{"title": "Risk management in Agile software development: A comparative study\n", "abstract": " The main goal of agile development methods is to reduce risk thereby resulting in more successful and effective information systems. Indeed, Finding out, analyzing, prioritising, and planning risks are important activities in all development approaches, including Agile development. However, while there is an extensive body of academic literature on risk management, few little researches have attempted to study risk management in Agile development projects. This paper discusses the Risk Management (RM) activities in Agile software development, and shows how using Agile can help with traditional RM process. Finally, the paper sheds light on the benefits and limitations of some Agile methodologies from a RM perspective and highlights directions for future work in this topic.", "num_citations": "41\n", "authors": ["2235"]}
{"title": "Software testing techniques in iot\n", "abstract": " As well as the important industry 4.0 revolution, based on of the serves that IoT provides in our society in different fields such as smart building, factory, mobility, health care. Previous studies explore various technology solution to find the best technique to test IoT applications in order to ensure quality for IoT devices. The paper surveys diverse of aspects of multiples software testing and tools for loT devices, and provides details in use case testing for IoT environment and test different accepts such as usability, security, connectivity. The paper considers various security requirement and challenges an unveils different research problems in testing IoT applications and proposes multiple tools and software techniques that help to enhance IoT applications quality.", "num_citations": "14\n", "authors": ["2235"]}
{"title": "Test-to-code traceability: Why and how?\n", "abstract": " In agile development, test suites are a valuable source of up-to-date documentation as developers continuously changes them to reflect changes in the production code to preserve an effective regression suite. Despite its importance, test-to-code traceability is not common in software development and, when needed, traceability information has to be recovered during software development and evolution. The main goal of this paper is focusing on the problem of supporting software maintenance through a mechanism for establishing traceability relations between the test cases and its code elements. This supports the developer during the identification of links between test suites and tested classes, and helps the software engineer to keep the consistency between unit tests and source code to make sure that all unit tests continue to pass after their related classes are modified. The survey highlights the limitations of …", "num_citations": "12\n", "authors": ["2235"]}
{"title": "Detection of wangiri telecommunication fraud using ensemble learning\n", "abstract": " Fraudsters can manipulate telecom regulatory systems to their advantage, and to the disadvantage of the telecom operator, in ways that are difficult to detect, trace, and prosecute. A subscriber whose network has been compromised will often refuse to pay large fraudulent charges, leaving the operator to cover the bill resulting in revenue losses. Moreover, attacks frequently happen over holidays and weekends, when networks are often less monitored closely. This calls for an intelligent automated solution for telecom fraud detection. Wangiri (Japanese term) telecom fraud also referred to as “one ring and cut fraud” relies on this single ring method for a quick way to make money. Missed calls from unknown callers entice subscribers to call back unknowingly premium numbers where they are deceived to stay on the line for as long as possible in an effort to inflate their bill. This paper proposes the use of varied …", "num_citations": "11\n", "authors": ["2235"]}
{"title": "Social media in project communications management\n", "abstract": " Many experts agree that the greatest threat to the success of any project, especially IT projects, is a failure to communicate. Project managers say they spend as much as 90 percent of their time communicating. Just as it is difficult to understand people and their motivations, it is also difficult to communicate with people effectively. Communications software and collaboration tools like e-mail, blogs, Web sites, Google docs, and tweets can aid in stakeholder communications and promote stakeholder engagement in projects. A very popular software category todaySocial Mediacan also help engage stake-holders. This paper highlights keys to good communications, provides suggestions for improving communications using the Social Media (SM), and describes how SM can assist in project communications management.", "num_citations": "7\n", "authors": ["2235"]}
{"title": "Using a new set of heuristics in evaluating Arabic interfaces\n", "abstract": " The Information Technology Sector has been growing rapidly in the Arab world. As a result, Arabic interfaces are now being widely used and developed in the region. However, little existing work has been done that focused on evaluating said systems. In this paper, we propose a new set of heuristics for evaluating the usability of systems that use Arabic interfaces. We focused on formal heuristic evaluation as the usability inspection method for identifying issues in these systems. In order to test the proposed set, we compared the findings of heuristics set by Nielsen with ones reported using the proposed heuristics on three Arabic interfaces. Experimental results show that using our heuristics, evaluators were able to find more severe problems than those who used Nielsen’s. Therefore, we believe that heuristic evaluation, when conducted using our proposed heuristics, can be more effective in finding usability issues …", "num_citations": "5\n", "authors": ["2235"]}
{"title": "Steam’s Early Access Model: A Study on Consumers’ Perspective\n", "abstract": " Involving consumers as influencers of the video game development process is the main feature of Steam's early access model. This has led to the exponential increase in the popularity of Steam's early access games. Steam being the most widespread digital distribution platform for video games on computers is part of the reason for the success of the early access model. Another part is the abundance of possibilities for game developers to communicate with end users and vice versa. The model is considered a success by the game development community as numerous games using Steam's early access as their distribution platform have gained a large user base (game owners) and high sales, even though, on principle early access games are not complete and are offered for sale in alpha and beta stages with no guarantees on release date or development schedule. Hence, the success of such a model cannot …", "num_citations": "5\n", "authors": ["2235"]}
{"title": "The correlation between customer satisfaction and service quality in Jordanian Uber & Careem\n", "abstract": " Customer satisfaction is a great concern for all companies in all sectors, to measure customer satisfaction it is necessary to measure the service quality to examine the relationship among them. In this paper, SERVQUAL model is used to measure service quality and the effect of these dimensions (tangibles, responsiveness, empathy, assurance, reliability) in customer satisfaction on intelligent transport applications (Uber & Careem) in Jordan by conducting an online questionnaire. The archived results show that Reliability has a high degree of importance on the impact of customer satisfaction and 89.2% of the sample prefer to use Uber & Careem smart app rather than traditional taxis.", "num_citations": "5\n", "authors": ["2235"]}
{"title": "Measuring Impact Score on Confidentiality, Integrity, and Availability Using Code Metrics\n", "abstract": " Confidentiality, Integrity, and Availability are principal keys to build any secure software. Considering the security principles during the different software development phases would reduce software vulnerabilities. This paper measures the impact of the different software quality metrics on Confidentiality, Integrity, or Availability for any given object-oriented PHP application, which has a list of reported vulnerabilities. The National Vulnerability Database was used to provide the impact score on confidentiality, integrity, and availability for the reported vulnerabilities on the selected applications. This paper includes a study for these scores and its correlation with 25 code metrics for the given vulnerable source code. The achieved results were able to correlate 23.7% of the variability in `Integrity' to four metrics: Vocabulary Used in Code, Card and Agresti, Intelligent Content, and Efferent Coupling metrics. The Length …", "num_citations": "5\n", "authors": ["2235"]}
{"title": "2019 International Arab Conference on Information Technology (ACIT)\n", "abstract": " 2019 International Arab Conference on Information Technology (ACIT) Table of Content Page 1 viii 2019 International Arab Conference on Information Technology (ACIT) Table of Content Paper Title Authors’ Name From To Markov Augmented Neural Networks for Streaming Video Classification Adnan Shaout, Brennan Crispin 1 7 An Intelligent Real Time Road Sign System Adnan Shaout, Ali Hassan 8 13 CASCloud : An Open Source Private Cloud for Higher Education Gaurav Bhatia, Ismail Al Salti 14 20 Performance Comparison of Two Algorithms for Arbitrary Shapes Clustering Mariam Khader, Ghazi AlNaymat 20 27 Semi Supervised Prediction Model in Educational Data Mining Ismail Hmeidi, Hassan Najdat, Zain Halloush, Ibtihal Jalabneh 28 32 Secure Data Quiry Using Unique Hash Indexing Utilizing MAC Address in a Remote Data Storage Khalid Alkaabneh, Rakan Alhwaidi 33 38 Opinion Mining: …", "num_citations": "5\n", "authors": ["2235"]}
{"title": "Tctracvis: test-to-code traceability links visualization tool\n", "abstract": " Visualizing traceability links between unit tests and tested classes is an important factor for effectively understanding the development and evolution of software systems. This paper presents a prototype tool that is used to visualize traceability links between unit tests and tested classes. Two types of visualization techniques are adopted in our tool: small colored squares to visualize test cases in a specific class, and tree graph to visualize traces between a specific method and its related test cases for a selected class.", "num_citations": "4\n", "authors": ["2235"]}
{"title": "Using Metadata in Optimizing the Design and Development of Enterprise Information Systems\n", "abstract": " Enterprise information systems are being widely and extensively used in many business domains. In fact, some of these domains cannot survive in operations without depending heavily on such systems. Although several research studies have been performed that explored the importance of enterprise information systems, only a few have been focusing on an effective and efficient end-to-end method to design and develop such systems. This paper presents a proposed approach of using a metadata model to design and implement APIs that can be utilized and reused as separate libraries to build enterprise information systems more effectively and efficiently than the traditional approaches. Primarily results of validating the proposed approach show promising potentials in reducing the manual development time and effort by an average of 64%.", "num_citations": "4\n", "authors": ["2235"]}
{"title": "Mitigating personalization challenges in mobile commerce: An empirical study\n", "abstract": " This study investigates the reception of personalization of Mobile Commerce (MC) and its associated challenges. A specific focus has been given to the elements that influence client's satisfaction. The study adopts a quantitative study design in which data was collected through a survey conducted on 340 Mobile Commerce consumers. Data have been analysed through Pearson correlation, KMO and Bartlett's test, multiple regression analysis, and factor analysis. The findings of the analyses depict that security concerns and potential risks impact the use of retail services (correlation coefficient, 0.915; P<0.05), and smartphone usage and privacy (correlation coefficient, 0.891; P<0.05). Moreover, security hazards have been identified as the primary factor that influences the adjustment of Mobile Commerce administrations. The study findings are significant as they can be used to bring about improvements in the …", "num_citations": "3\n", "authors": ["2235"]}
{"title": "Challenges and opportunities in cloud testing\n", "abstract": " Cloud computing is attracting the interest of many businesses around the world by offering feasible solutions towards hosting software applications and providing convenient development and testing environments. Cloud computing has developed enormously that it changed the management practices of dealing with computer systems and services. Because of cloud computing; testing as a service (TaaS) was created. Despite the facilities provided by TaaS, it produced some issues and challenges, particularly in cloud-based testing environments. Those issues are needed to be addressed and fixed. This paper reviews and addresses a set of challenges and benefits of cloud testing among with a theoretical comparison between cloud-based testing environment and traditional testing for regular systems.", "num_citations": "3\n", "authors": ["2235"]}
{"title": "Employee Retention in Agile Project Management\n", "abstract": " In today's contemporary world, one of the most significant challenges facing most organizations is the challenge of employee retention. To remain efficient in an extremely competitive world, it is important for organizations to invest in measures that enhance the productivity and motivation of their workforce. In essence, this is the key to remaining relevant. Agile project management is the newest trend in project management methods that support concepts of flexibility and continuous improvements which help to keep an organization's workforce efficient and motivated and reflect positively on employee retention. In this theoretical paper, we aim to critically analyze how the various Agile methods support employee retention better than traditional approaches by matching employee retention's best practices within its approach. In this work, we found that agile systems implicitly handle several job satisfaction factor and …", "num_citations": "3\n", "authors": ["2235"]}
{"title": "Top-Down vs. Bottom-Up in project management: A practical model\n", "abstract": " Top-down and bottom-up are both strategies of information processing and knowledge ordering, used in a variety of elds including software management and organization. This paper highlights the differences between these two approaches in the project management process groups, then the paper suggests some guidelines of how and when to use one of the two approaches or combining both of them during the project management lifecycle. Finally; the paper suggests an enhanced model combines the two approaches during the different project management knowledge areas.", "num_citations": "3\n", "authors": ["2235"]}
{"title": "Personalization in mobile commerce\n", "abstract": " The personalization is one of the main success factor in Mobile Commerce. This paper presents the main characteristic for Mobile Commerce and describes factors of personalization in Mobile Commerce, it also shows how these factors affects user satisfaction positively or negatively. The mechanism for personalization and recommendation system used in personalized Mobile Commerce are described. Many challenges that faces personalization improvement in Mobile Commerce are explored.", "num_citations": "3\n", "authors": ["2235"]}
{"title": "Students’ Satisfaction and Service Quality in Distance Education During COVID-19 Pandemic in Jordan\n", "abstract": " As a result of the COVID-19 pandemic and the global lock-down to ensure the social distancing, the education sector was one of the affected sectors if not the most affected one, so most of the educational institutions started distance education to keep up with their academic calendars and try to limit the losses as much as they can until the writing of this research it is not certainly known if this situation could last for more one or two semesters, and the end of this pandemic is not clear yet, according to the World Health Organization (WHO) recommendations it became a necessity to learn how to accept and coexist with this situation especially in sectors like education which has high risk of the virus spreading if the return to normal in-class education was done before the end of this pandemic.Owing to these facts the quality of distance education was investigated in this research using the SERVQUAL model, by examining …", "num_citations": "2\n", "authors": ["2235"]}
{"title": "OSINT techniques integration with risk assessment ISO/IEC 27001\n", "abstract": " Over the last few years, the amount of information that resides on the internet is quickly increasing especially due to the digital transformation era. Social media platforms, moving to the cloud, using the internet of things (IoT) are reasons for this transformation. However, taking advantage of publically available information related to companies and individuals can be useful in many ways. In this paper, an integration process between selected OSINT (Open source intelligence) techniques and ISO 27001 standard under some relevant domains for additional security, is proposed.", "num_citations": "2\n", "authors": ["2235"]}
{"title": "Team Building Activities for Virtual Teams in Jordanian Companies: Vision and Survey\n", "abstract": " Recently business owners are raising the importance of working with virtual teams using predefined telecommunication technologies and encourage the idea of investing in innovative team building activities in order to enhance internal relationships between individuals despite their different geographical locations and cultures, which eventually it will affect project completion results. Therefore this paper study team building activities for virtual teams especially in Jordanian companies through conducted systematic mapping study for previous researches. Also, we aim to find out the correlation between the application of virtual teams structure in Jordanian companies with its impact on efficiency scale and cost-effectiveness by building a model from our questionnaire survey results. The outcomes of this study should provide useful information to Jordanian companies regarding the impact of team building activities for …", "num_citations": "2\n", "authors": ["2235"]}
{"title": "By two: A two-dimensional mobile game model for novice developers\n", "abstract": " The objective of this research was to discuss the processes and challenges encountered in the creation of mobile games for both Android and iOS platforms, which would help the novice game developers to enter the big world of mobile game industry. We highlighted each phase of the mobile game development. These involved suggestions on efficient brainstorming of ideas, proper selection of game engine, game design, number and type of pages, creation of levels, and distribution of complexity across the game level. In addition, other factors were considered such as the creation of User Interface and User Experience (UI/UX) as well as definition of the screen object’s sizes and positions that would be suitable in all mobile devices. The importance of agile cycles of alpha and beta testing was also discussed, particularly its influence on the enhancement of game features. However, a successful game is recognized based on its earnings. Hence, a guide on how to properly market the game was also included. A model game called “By Two” was used in this study to illustrate and explain the steps in detail.", "num_citations": "2\n", "authors": ["2235"]}
{"title": "Global software development and its impact on software quality\n", "abstract": " Recent advancements in technology and lifestyle have changed a big deal of the world around us, and especially the world of business. With the booming of mobility and the continuous progression of smart technologies; a years ago, Global Software Development (GSD) has become a necessity in almost virtual businesses, GSD is becoming a hot topic in the place of work and outside of it. It's a concept that changed our way of life, the technological boundaries and works, a lot of organizations began to work virtually by outsourcing from diver's countries with remote access software development. It has become easy connecting with outsourcing to facilitate corporation and reduce cost. The internet has supported GSD by providing new options and techniques resulting in resource pools, flexibility, scalability. it also included usage tracking and independences.as well as affected on a product designed, build, tested …", "num_citations": "2\n", "authors": ["2235"]}
{"title": "A survey of IT outsourcing in Jordanian market\n", "abstract": " The massive elevation of globalization raised the competition between companies. That compelled business owner to demand more focusing on core business and trying to get access to greater number of resources with minimum cost. That made outsourcing one of the proposed solutions for this purpose. This survey paper highlights the definition of outsourcing, its strategies, advantages and disadvantages. In addition, it conducts a survey on 32 people who is working in the Information Technology field in Jordan.", "num_citations": "2\n", "authors": ["2235"]}
{"title": "Social Commerce Quality Service from Customer Perspective\n", "abstract": " Social Commerce is one of trading Electronics commerce (E-commerce) regarding for new technology and Smartphone's which made the social network available to everyone, everywhere and anytime, there is a different platform for social network such as (Facebook, Snapchat, Instagram), these social networks have a facility to commerce through them. This paper proposed quality service model for online social commerce from customer perspective by filling published survey, this model differs from others proposed model because its depends on users need to get confidence and trustiness, and what the dimension make them loyal to the social page. The proposed model has six dimensions, some of them are mentioned in the previous researched, and there is new dimension regarding new facilities added to the social networks sites, which made the social commerce easier and enjoyable without any afraid from …", "num_citations": "2\n", "authors": ["2235"]}
{"title": "Business Process Integration with Quality Characteristics: Quality-Oriented process\n", "abstract": " Business Process Re-engineering (BPR) is highly required in this changing world, most companies are changing their focus from Product-Oriented where they have focused on the products, to Process-Oriented where the focus on the process that produce the products in a manner to serve their customers with high level of customer service. As a result of high demand on BPR, there are many researches have been conducted in this area. This paper introduces new methodology to create and check the re-engineered process after it was adopted and before implemented in real project. The proposed method in this paper applies Six-Quality characteristics on the redesigned process before merging it to real situation.", "num_citations": "2\n", "authors": ["2235"]}
{"title": "Recovering test-to-code traceability via slicing and conceptual coupling\n", "abstract": " Maintaining traceability links between application code and unit test cases plays an important role for effectively managing the development and evolution of software systems. Unfortunately, the support in the contemporary development environment to identify such links is still inadequate. This research presents an automated solution to recover traceability links between test cases and classes under test. The approach is based on dynamic slicing and conceptual coupling. A preliminary evaluation indicates that the proposed approach identifies trace ability links between unit test cases and tested classes with a high accuracy and greater stability than existing techniques.", "num_citations": "2\n", "authors": ["2235"]}
{"title": "The Intention to Use E-wallet during Covid-19 Pandemic in Developing Country\n", "abstract": " In developed and emerging countries, the idea of E-wallets are rapidly being implemented to increase the size and efficiency of an online transaction. Especially, after Corona Virus Disease in 2019 (COVID-19) government officials take steps to facilitate non-contact payments after World Health Organisation has urged consumers to conduct contact-less transactions, payment transfers, under physical distancing policies. This study aims to determine the impact of selected factors on intention to use E-wallet in Jordan during the Covid-19 pandemic. The four selected factors for the study are performance expectancy, perceived usefulness, perceived security, and perceived ease of use. We used an online questionnaire to gather data from Jordanian individuals and evaluated the relationships between those variables using the correlation method. Based on the results, all four variables have a clear connection with …", "num_citations": "1\n", "authors": ["2235"]}
{"title": "Visualizing Multilevel Test-to-Code Relations\n", "abstract": " The test-to-code traceability (TCT) links play an important role in the process of software maintenance and re-engineering. However, the main issue is how to visualize these links efficiently and effectively to support the comprehension and maintenance of these links. In this work, a visualization approach is presented that displays the TCT links in two levels, class-level, and method level. Visualization traceability links at a method-level provide detailed information of the traceability links that support the development of software in different tasks such as, software maintenance, refactoring, and change impact analysis. The visualization approach is implemented using our visualization tool namely TCTracVis. The presented tool is evaluated on a real simple project and the achieved results confirm that the proposed approach and tool are efficient to support several tasks in software development.", "num_citations": "1\n", "authors": ["2235"]}
{"title": "Why Companies in Jordan Should Adopt e-Business Solutions?\n", "abstract": " E-Commerce (EC) is wide-spreading in the last few years as a countermeasure for economic turndown. Companies are adopting EC to cut costs, survive in the economic turndown, or gain a competitive advantage. Customer support can play a significant role in EC and may add a competitive advantage by combining sales and marketing with customer service. An Omnichannel contact center is an example of such an advantage, and we are spotlighting it with a real example. Finally, we found that businesses are rapidly moving toward EC, and the brick-and-mortar business model is disappearing.", "num_citations": "1\n", "authors": ["2235"]}
{"title": "Organizational management role in information security management system\n", "abstract": " This paper proposes an organizational management model for implementing the Information Security Management System (ISMS) Plan, Do, check and Act (PDCA) framework to achieve an improved balance between the effectiveness and efficiency of an organizations ISMS. Specifically describing the role of managerial structure and organizational structure in realizing the ISMS framework. Demonstrating the drawbacks in organizational structure that were reduced and the enhanced workflow within the organization due to the improved managerial role distinction regarding information security management. Projecting the effects of the proposed parallel loosely coupled approach when managing an ISMS related project within an organization.", "num_citations": "1\n", "authors": ["2235"]}
{"title": "GitBull: Source code hosting web application\n", "abstract": " This paper presents GitBull tool as a source code hosting Web application tailored for the university ecosystem. GitBull introduces the ideology of open source software development. The main aim of GitBull is to fill the gap between how students work on software development projects in university and how software is being developed in the work environment. GitBull helps students use source code versioning and collaboration tools, and reduce their learning curve when they enter the work environment. Students using GitBull and learning the Git source code versioning tool should be more prepared for the professional work environment. The application complements the Git source code versioning tool, by adding a visual user interface to some aspects while introducing some collaboration enhancement tools like the Issue Tracker and the Pull Request feature.", "num_citations": "1\n", "authors": ["2235"]}
{"title": "The effect of ISO/IEC 27001 standard over open-source intelligence\n", "abstract": " The Internet’s emergence as a global communication medium has dramatically expanded the volume of content that is freely accessible. Through using this information, open-source intelligence (OSINT) seeks to meet basic intelligence requirements. Although open-source information has historically been synonymous with strategic intelligence, today’s consumers range from governments to corporations to everyday people. This paper aimed to describe open-source intelligence and to show how to use a few OSINT resources. In this article, OSINT (a combination of public information, social engineering, open-source information, and internet information) was examined to define the present situation further, and suggestions were made as to what could happen in the future. OSINT is gaining prominence, and its application is spreading into different areas. The primary difficulty with OSINT is separating relevant bits from large volumes of details. Thus, this paper proposed and illustrated three OSINT alternatives, demonstrating their existence and distinguishing characteristics. The solution analysis took the form of a presentation evaluation, during which the usage and effects of selected OSINT solutions were reported and observed. The paper’s results demonstrate the breadth and dispersion of OSINT solutions. The mechanism by which OSINT data searches are returned varies greatly between solutions. Combining data from numerous OSINT solutions to produce a detailed summary and interpretation involves work and the use of multiple disjointed solutions, both of which are manual. Visualization of results is anticipated to be a potential theme in …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Credit Cards Theft Using Social Engineering over WhatsApp: A Survey Study\n", "abstract": " Social engineering is one of the most critical threats to security and people's privacy nowadays. Over the past years, attackers have been relying on this method to persuade people to provide and expose personal information willingly without them realizing that this could threaten them when this info is harmfully used. This study focuses on the impact social engineering can make on changing peoples' ideas and customs, especially in Jordan society. In addition to exploring the importance of social engineering and how criminals use it to influence events and pass its plans and goals. That is through studying social and understanding and explaining how it conveys hidden messages to influence society and its outlook. Finally, based on questionaries' results analysis, this study provides several concluding observations and recommendations that help deal with the harmful impact of social engineering in Jordan society …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "NETWORK INTRUSION DETECTION SYSTEMS USING SUPERVISED MACHINE LEARNING CLASSIFICATION AND DIMENSIONALITY REDUCTION TECHNIQUES: A SYSTEMATIC REVIEW\n", "abstract": " Protecting the confidentiality, integrity and availability of cyberspace and network (NW) assets has become an increasing concern. The rapid increase in the Internet size and the presence of new computing systems (like Cloud) are creating great incentives for intruders. Therefore, security engineers have to develop new technologies to match growing threats to NWs. New and advanced technologies have emerged to create more efficient intrusion detection systems using machine learning (ML) and dimensionality reduction techniques, to help security engineers bolster more effective NW Intrusion Detection Systems (NIDSs). This systematic review provides a comprehensive review of the most recent NIDS using the supervised ML classification and dimensionality reduction techniques, it shows how the used ML classifiers, dimensionality reduction techniques and evaluating metrics have improved NIDS construction. The key point of this study is to provide up-to-date knowledge for new interested researchers.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Risk Assessment for Emerging Domains (IoT, Cloud Computing, and AI)\n", "abstract": " Due to the rapid life changes and the fourth industrial revolution, every day the birth of new domains is witnessed such as the Internet of Things (IoT), Cloud Computing, and Artificial Intelligence (AI). These domains have a lot of advantages which make our life easier and more efficient, despite these advantages, a lot of risks come along with them. This paper aims to highlight the threats, vulnerabilities, and risk remediation, as well as the standards and regulations. A comparison was then made between the three technologies and the international standards (OWASP, NIST, ISO, and GDPR), the results showed that most of AI and IoT standards and regulations are under development, however cloud computing has a sufficient base of supporting standards.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Communication Amid COVID-19 and Its Impact on Project Management Effectiveness: A Case Study from Jordan\n", "abstract": " Project management is vital to the success of enterprises and organizations, regardless of their business size and no matter the context of a project. Therefore, it is crucial to ensure the effectiveness of this process at all times. However, this is very challenging due to the ever-developing nature of this field. Currently, and during the time of the COVID-19 crisis, a sudden shift to remote working has been enforced by many organizations all over the world. This new situation has raised concerns over the ability of organizations to operate at least at the same levels seen before the pandemic. Moreover, this unprecedented transition in working patterns has increased the levels of uncertainty in different areas, one out of which is communication. Where miscommunication or failure to communicate is considered as one of the greatest threats to a project's success. For this reason, in this research, we studied the impact of …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "SUCCESS FACTORS OF AGILE PROJECTS: CASE STUDY FOR PROJECTS IN JORDAN DURING COVID-19 PANDEMIC\n", "abstract": " The world has responded to the COVID-19 pandemic by obtaining minimal knowledge and using it to confront several uncertainties. Their capacity to be agile and innovative has been stressed, especially with the timing of policy measures, the degree of decentralization, the balance between flexibility and stability. The agile project management approach was commonly used to resolve the risks, where it illustrates individuals and collaboration ability that simplifies the production phase. This paper presents the results of a study that mainly focused on investigating the success factors of agile projects in Jordan during the COVID-19 pandemic. This was achieved by conducting a questionnaire distributed to employees and managers in several Jordanian companies. The results show that team capability and motivation are the most important success factors for many firms. However, most of the firms agreed that activate …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Data Strategy and Its Impact on Open Government Data Quality\n", "abstract": " Technology is playing a major role in decision-making and innovation through its wide capabilities of data mining and analysis. Developed countries have recognized data as an asset that can transform their services and economy to a better level if used effectively. In this paper, the authors discuss how data strategy can unleash the power of data and how such strategy affects open government data quality positively and help countries to achieve better outcomes in terms of sharing and reusing data. This paper analyzes UK & US data strategies and concludes the main elements that data strategy should include. Also, Jordan’s model in open government data is discussed and the need to formulate a data strategy to enhance data sharing and quality of open data is explained.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "A Conceptual Framework for Representing Business Functions and Their Role in the Quality of E-Banking Services\n", "abstract": " E-banking is growing more and more as banks shift their processes and services from traditional means to leverage emerging technologies and to seize maximum possible opportunities of the digital economy. However, to benefit from the services provided and sustain profits and success over time, organizations should maintain a strong relationship with their customers and ensure their loyalty by providing services with high levels of quality to satisfy or even exceed their needs. In this paper, we studied the business units within a bank and other stakeholders that are involved in shaping the E-banking quality and illustrated these functions in a conceptual framework to represent how they relate to the service quality. This representation shows that everyone is responsible for achieving the desired quality level, and success sustainability is achieved by collaborating the efforts between all stakeholders inside and …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Risk Assessment in Smartphones: Comprehensive Analysis\n", "abstract": " Smartphones are multi-purpose and widely used devices in various fields, in terms of personal use, and companies and governments. Increasing dependence on them opened the way for increased violations on its users, as it became a fat substance for criminals, for their illegal practices, so it encountered serious and targeted security threats. This paper presents a set of rules and controls that will reduce the risks that threaten smartphone users. Furthermore, this work provides the methods of risk assessment that are related to smartphones. It identifies the assets and lists several different threats that are relevant. Each risk has its impact on the assets, this is described by mapping it with the likelihood of each threat.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Comprehensive Approach to Implement E-Government Backend in Jordan Using Service-Oriented Architecture\n", "abstract": " This paper proposes a comprehensive approach to implement and deploy a backend middleware for e-government in Jordan using service-oriented architecture (SOA) and enterprise service bus (ESB). The proposed approach takes into consideration a full overview of needed e-services as well as all stakeholders communicating within e-government environment. The paper describes the high-level architecture of the proposed approach and then goes deeper to describe the internal implementation of the middleware and its layers. Finally, the paper addresses some deployment issues and proposes a deployment architecture to overcome these issues.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "A New e-Tendering Model For Fully Automated Tendering Process\n", "abstract": " Along with the revolution in information technology solutions and the wide replacement of the legacy manual procedures with the automated and digital workflow procedures, many electronic solutions have been developed and used to digitize the supply chain processes and as one of the main process in the supply chain, it is highly demanded nowadays to perform the procurement processes in the enterprises using e-procurement system. As part of e-Procurement, this paper emphasizes the importance of leveraging the tendering process in an enterprise to be fully electronic by adopting the e-Tendering approach. This research proposes a new model for e-Tendering which enables an enterprise to conduct a fully automated web-based tendering process. The proposed model is a new conceptual model of fully automated, digital and web-based tendering solution that is covering all steps of the tendering process …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Automatic Recovery of Unit Tests after Code Refactoring\n", "abstract": " Unit testing allows developers to refactor their code confidently, these tests act as a safety net against producing bugs and provide immediate feedback during the refactoring process and furthermore help developers overcome the fear of change. When performing refactoring, the design of code is changed or restructured according to a predefined plan, after refactoring is applied, the alignment between source code and its corresponding unit tests could be broken which creates a problem that needs to be solved.This paper introduces an approach in which code refactoring can maintain the integrity of the previous unit tests; the tool called GreenRef demonstrates this work. This tool supports an automatic recovery for the unit tests after performing of three particular refactoring types for Java programming language: Rename Method, Add Parameter and Remove Parameter.The achieved results indicate that GreenRef …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "A Strategic Approach for Patient-Centric E-Healthcare Development: Informatics Solution HIT as Case Study\n", "abstract": " Different types of industries, strategic thinking, planning, and management in healthcare have become cornerstones of providing high quality of healthcare services among the rapidly changing competitive environment and the emerging technologies, which is pushing health service providers to adopt the eHealth solutions to automate the treatment workflows during health service. This chapter introduces a new healthcare IT cloud model called HealthGate Cloud (HGC), which is specially designed as a central repository for patients' EHRs. The proposed model provides a technical and business framework for a centralized enterprise healthcare information system and data sharing between all participated healthcare providers in the country or region, which makes them all as if they are one big hospital having one single repository and database for all patients' medical records. It can be used by any HA in any country …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Power of Using Regular Expression Patterns in Software Coding Standards Quality Control\n", "abstract": " The regular expression is a method to describe strings that conform to a pattern. The need to use regular expressions arise to deal with strings which have a specific pattern such as a user input string, formatted data, and computer programs code elements. In this paper, the authors intend to establish a framework that aims to improve the quality control process to prove that the source code meets standards using a regular expressions. The framework extracts the code from the files then determines if the written code is following the company's own coding standards. The proposed framework covers the naming convention standards, data types utilizations, undesired programming language commands and keywords, hardcoded literals usage, and as well as the business dictionary tags compliance. The short achieved results shows the effectiveness of regular expressions to figure out the compliance of the source …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Visualization of test-to-code relations to detect problems of unit tests\n", "abstract": " Visualization of test information can be a means of providing an understanding of test-code relations which, in turn, is essential for other activities in SDLC such as: maintenance, software evolution, refactoring, etc. To our best knowledge, less research have specifically addressed the visualization of test-code relation and its importance in many tasks during software development. This paper is a modest contribution to draw attention to visualization of test-code relations and in particular visualizing of test-to-code traceability links. From the outcome of our investigation it has been demonstrated that visualizing of test-related metrics has been received rather interest of researchers; while in turn, little attention has been paid to visualizing of test to code traceability links. However, several practical questions emerged which can be investigated as the next step of our research, thus further research of visualization of test-to-code traceability links area is highly needed to address these questions.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Backshoring: Main Drives and Effects\n", "abstract": " During last decades, derived by low wages in foreign countries, a trend of offshoring production was adopted tremendously by many companies, especially in the US and Europe. However, a recent trend of backshoring production is rising increasingly through different sectors.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Project Manager Roles in Software Information Systems: Case Studies from Jordan\n", "abstract": " In the traditional software development life cycle (SDLC), the project management theory assumes the involvement of project manager in every phase of the project with all parties. However, this will not be always possible because of the variation of software projects based on the project size (small, medium, and enterprise), which affects the project constraints of cost, time, and scope. In this paper, we take real-life case studies of successful projects in Jordan to be classified based on many factors, and then, we define the responsibilities of the project managers in every class based on those case studies.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Special section on ICSM 2011.\n", "abstract": " The special section contained in this issue features selected papers from the 27th IEEE International Conference on Software Maintenance (ICSM), held in Williamsburg, VA, USA, on September 25-30, 2011. The Program Co-Chairs of the conference, James R. Cordy and Paolo Tonella, acted as guest editors and supervised the selection and reviewing process for this special section. The included papers are representative of three core research areas in software maintenance and evolution:(1) clone detection;(2) traceability recovery; and,(3) feature location. Copyright c 2013 John Wiley & Sons, Ltd.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "An Eclipse plug-in for Test-to-Code Traceability Recovery\n", "abstract": " Developers write and maintain unit tests continually in order to reflect changes in the production code and maintain an effective regression test suite. In addition, during refactoring developers must ensure that all unit tests continue to pass, so unit tests often need to be refactored together with the source code. Traceability links between application code and respective unit tests are extremely useful to preserving consistency during refactoring. Unfortunately, support for identifying and maintaining traceability links between unit tests and tested classes in contemporary software engineering environments and tools is not satisfactory. This paper presents SCOTCH (Slicing and COupling based Test to Code trace Hunter), a tool implemented as an Eclipse plug-in that uses dynamic slicing and conceptual coupling to automatically establish the traceability links between unit tests and application code. The evaluation of SCOTCH on several software systems highlights its usefulness as a feature within a software development environment.", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Traceability Recovery between Unit Tests and Classes Under Test: An Improved Approach\n", "abstract": " Traceability Recovery between Unit Tests and Classes Under Test: An Improved Approach IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Università degli Studi del Molise Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Traceability Recovery between Unit Tests and Classes Under Test: An Improved Approach Italiano Italiano English Traceability Recovery between Unit Tests and Classes Under Test: An Improved Approach / Qusef A; Oliveto R; De Lucia A. - (2010). ((Intervento presentato al convegno 26th IEEE International Conference on Software Maintenance tenutosi a Timisoara, Romania. Scheda breve Scheda completa Titolo: Traceability Recovery between Unit Tests and Classes Under Test: An Improved Approach Autori: OLIVETO, Rocco mostra contributor …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "CSIT 2016 Program Committee\n", "abstract": " Program Committee Page 1 CSIT 2016 Program Committee Ahmad Saifan, Yarmouk University, Jordan Hazem Qattous, Applied Science University, Jordan Daniel Neagu, University of Bradford, UK Mohammad Hamdaqa, University of Waterloo, Canada Ibrahim Aljarah, University of Jordan, Jordan Flaminia Luccio, Ca' Foscari University of Venice, Italy Raed Seetan, Slippery Rock University, USA Qasem Obeidat, Imam Muhammad ibn Saud Islamic University, KSA Mohammed Akour, Yarmouk University, Jordan Salimur Choudhury, Algoma University, Canada Danny Ho, NFA Estimation Inc, Canada Jamal Alsakran, University of Jordan, Jordan Omar Al-Azzam, St. Cloud State University, USA Mohamed Saad, University of Sharjah, UAE Omar Alsheikh Salem, Applied Science University, Jordan Ahmed Manasrah, Yarmouk University, Jordan Nouh Alhindawi, Jadara University, Jordan Abdallah Alma'Aitah, Jordan …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "ICTCS 2017\n", "abstract": " Organizing Committee IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.ictcs 2017 Organizing Committee 2017, pp. xv-xv, DOI Bookmark: 10.1109/ICTCS.2017.7 Keywords Authors Abstract Provides a listing of current committee members and society officers. Organizing Committee ,ICTCS 2017 , ,Edward Jaser, ,Princess Sumaya University for Technology, IEEE Member (Committee Chair) , ,Mostafa Ali, ,Jordan …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "ICTCS 2017\n", "abstract": " Technical Program Committee Page 1 Technical Program Committee ICTCS 2017 Ali Hadi, Princess Sumaya University for Technology (Committee Chair) Abdallah Qusef, Princess Sumaya University for Technology, Jordan Abdelmajid Ben Hamadou, Sfax University, Tunisia Adil Alpko‡ak, Dokuz Eylul University, Turkey Adnan Shaout, University of Michigan - Dearborn, USA Ahmad Kayed, Middle East University, Jordan Akram Al-Kouz, Princess Sumaya University for Technology, Jordan Ala Khalifeh, German Jordanian University, Jordan Alaa Al-hamami, Princess Sumaya University for Technology, Jordan Al-Baraa Awajan, Al-Balqa Applied University, Jordan Amjad Hudaib, University of Jordan, Jordan Amjed Al-Mousa, Princess Sumaya University for Technology, Jordan Amr Sabry, Indiana University Bloomington, USA Anas Abu Taleb, Princess Sumaya University for Technology, Jordan Andreas Lommatzsch, …", "num_citations": "0\n", "authors": ["2235"]}
{"title": "ABCDEFGH! J KLMN 0 P Q RSTUVW xy Z\n", "abstract": " Author index IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.csit 2016 Author index 2016, pp. 1-9, DOI Bookmark: 10.1109/CSIT.2016.7549484 Keywords Ontologies, Software, Indexing, Business, Context, Mel Frequency Cepstral Coefficient, Discrete Wavelet Transforms, Authors Author ,Index ,ABCDEFGH ,! ,J ,KLMN 0 P ,Q ,RSTUVW ,xy ,Z ,Author ,Title ,Start ,page ,Session ,Abbas ,Cheddad ,Towards ,Query ,…", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Recovering Test-To-Code Traceability Using Slicing and Textual Analysis–Technical Report–\n", "abstract": " In order to compare the different test-to-code traceability recovery techniques we had to create an oracle providing the correct set of tested classes for each JUnit test involved in our experimentation. To create the required oracle, three Ph. D. students from the University of Salerno manually identified the links between the JUnit tests and the tested classes for the five systems. The students individually analyzed the code. To avoid bias, students were not aware of the experimental goals or the experimental recovery methods. Once students retrieved the tested classes, they performed an open-discussion with the researchers to solve conflicts and reach a consensus on the traceability links identified. In this open discussion the researchers limited their role to moderators, making sure that the students reached a consensus for all the JUnit tests without introducing any bias. The links retrieved by each of the three students, as well as a table summarizing inter-evaluator agreement for each of the 358 tests composing our oracle are provided in the following. In particular:", "num_citations": "0\n", "authors": ["2235"]}
{"title": "Technical Papers Keynotes\n", "abstract": " Table of Contents Front Matter Technical Papers Keynotes Research Track Faults and Regression Testing Impact Analysis Dynamic An Page 1 iii Table of Contents Front Matter Foreword viii ICSM 2011 Organizing Committee ix ICSM 2011 Program Committee x Additional Reviewers xii Industry Track Program Committee xiii Additional Reviewers xiii Early Research Achievements Program Committee xiv Additional Reviewers xiv Tool Demonstrations Program Committee xv Additional Reviewers xv Technical Papers Keynotes How to Steal a Botnet and What Can Happen When You Do 1 Richard A. Kemmerer Useful Software Engineering Research - Leading a Double-Agent Life 2 Lionel C. Briand Research Track Faults and Regression Testing Fault Interaction and its Repercussions 3 Nicholas Digiuseppe and James Jones A Novel Approach to Regression Test Selection for J2EE Applications 13 Sheng Huang, …", "num_citations": "0\n", "authors": ["2235"]}