{"title": "What is keeping my phone awake?: characterizing and detecting no-sleep energy bugs in smartphone apps\n", "abstract": " Despite their immense popularity in recent years, smartphones are and will remain severely limited by their battery life. Preserving this critical resource has driven smartphone OSes to undergo a paradigm shift in power management: by default every component, including the CPU, stays off or in an idle state, unless the app explicitly instructs the OS to keep it on! Such a policy encumbers app developers to explicitly juggle power control APIs exported by the OS to keep the components on, during their active use by the app and off otherwise. The resulting power-encumbered programming unavoidably gives rise to a new class of software energy bugs on smartphones called no-sleep bugs, which arise from mis-handling power control APIs by apps or the framework and result in significant and unexpected battery drainage.", "num_citations": "348\n", "authors": ["1837"]}
{"title": "Smartphone energy drain in the wild: Analysis and implications\n", "abstract": " The limited battery life of modern smartphones remains a leading factor adversely affecting the mobile experience of millions of smartphone users. In order to extend battery life, it is critical to understand where and how is energy drain happening on users' phones under normal usage, for example, in a one-day cycle. In this paper, we conduct the first extensive measurement and modeling of energy drain of 1520 smartphone in the wild. We make two primary contributions. First, we develop a hybrid power model that integrates utilization-based models and FSM-based models for different phone components with a novel technique that estimates the triggers for the FSM-based network power model based on network utilization. Second, through analyzing traces collected on 1520 Galaxy S3 and S4 devices in the wild, we present detailed analysis of where the CPU time and energy are spent across the 1520 devices …", "num_citations": "127\n", "authors": ["1837"]}
{"title": "Smartphone Background Activities in the Wild: Origin, Energy Drain, and Optimization\n", "abstract": " As new iterations of more powerful and better connected smartphones emerge, their limited battery life remains a leading factor adversely affecting the mobile experience of millions of smartphone users. While it is well-known that many apps can drain battery even while running in background, there has not been any study that quantifies the extent and severity of such background energy drain for users in the wild. To extend battery life, various new features are being incorporated within the phone, one of them being preventing applications from running in background, ie, when the screen is off, but their impact is largely unknown. This paper makes several contributions. First, we present a large-scale measurement study that performs an in-depth analysis of the activities of various apps running in background on thousands of phones in the wild. Second, we quantify the amount of battery drain by all such background …", "num_citations": "105\n", "authors": ["1837"]}
{"title": "Multi-objective optimization and decision making approaches to cricket team selection\n", "abstract": " Selection of players for a sports team within a finite budget is a complex task which can be viewed as a constrained multi-objective optimization and a multiple criteria decision making problem. The task is specially challenging for the game of cricket where a team requires players who are efficient in multiple roles. In the formation of a good and successful cricket team, batting strength and bowling strength of a team are major factors affecting its performance and an optimum trade-off needs to be reached. We propose a novel gene representation scheme and a multi-objective approach using the NSGA-II algorithm to optimize the overall batting and bowling strength of a team with 11 players as variables. Fielding performance and a number of other cricketing criteria are also used in the optimization and decision-making process. Using the information from the trade-off front obtained, a multi-criteria decision making …", "num_citations": "92\n", "authors": ["1837"]}
{"title": "Energy and Performance of Smartphone Radio Bundling in Outdoor Environments\n", "abstract": " Most of today's mobile devices come equipped with both cellular LTE and WiFi wireless radios, making radio bundling (simultaneous data transfers over multiple interfaces) both appealing and practical. Despite recent studies documenting the benefits of radio bundling with MPTCP, many fundamental questions remain about potential gains from radio bundling, or the relationship between performance and energy consumption in these scenarios. In this study, we seek to answer these questions using extensive measurements to empirically characterize both energy and performance for radio bundling approaches. In doing so, we quantify potential gains of bundling using MPTCP versus an ideal protocol. We study the links between traffic partitioning and bundling performance, and use a novel componentized energy model to quantify the energy consumed by CPUs (and radios) during traffic management. Our results …", "num_citations": "71\n", "authors": ["1837"]}
{"title": "Hypnos: understanding and treating sleep conflicts in smartphones\n", "abstract": " To maximally conserve the critical resource of battery energy, smartphone OSes implement an aggressive system suspend policy that suspends the whole system after a brief period of user inactivity. This burdens developers with the responsibility of keeping the system on, or waking it up, to execute time-sensitive code. Developer mistakes in using the explicit power management unavoidably give rise to energy bugs, which cause significant, unexpected battery drain.", "num_citations": "45\n", "authors": ["1837"]}
{"title": "Cricket team selection using evolutionary multi-objective optimization\n", "abstract": " Selection of players for a high performance cricket team within a finite budget is a complex task which can be viewed as a constrained multi-objective optimization problem. In cricket team formation, batting strength and bowling strength of a team are the major factors affecting its performance and an optimum trade-off needs to be reached in formation of a good team. We propose a multi-objective approach using NSGA-II algorithm to optimize overall batting and bowling strength of a team and find team members in it. Using the information from trade-off front, a decision making approach is also proposed for final selection of team. Case study using a set of players auctioned in Indian Premier League, 4th edition has been taken and player’s current T-20 statistical data is used as performance parameter. This technique can be used by franchise owners and league managers to form a good team within budget …", "num_citations": "27\n", "authors": ["1837"]}
{"title": "How much energy can we save from prefetching ads?: energy drain analysis of top 100 apps\n", "abstract": " Recently, there has been a surge of interests on developing techniques and architectures for prefetching ads to potentially reduce the smartphone energy drain by 3G/4G radios from fetching ads. Despite the development of prefetching techniques, it remains unclear (1) how much smartphone energy do ads consume in popular apps in dominant app markets, and (2) out of which, what portion can we realistically save from prefetching?", "num_citations": "26\n", "authors": ["1837"]}
{"title": "Systems and methods of detecting power bugs\n", "abstract": " Embodiments of the present invention provide a system and methods for detecting power bugs. In one embodiment, a computer-implemented method for analyzing a computer code includes generating a control flow graph for at least a portion of the computer code at a processor. The method further includes identifying power bugs by traversing the control flow graph if the control flow graph exits without performing a function call to deactivate power to any component of a device configured to execute computer executable instructions based on the computer code after performing a function call to activate power.", "num_citations": "21\n", "authors": ["1837"]}
{"title": "On death, taxes, and sleep disorder bugs in smartphones\n", "abstract": " According to Benjamin Franklin, life holds but two certainties, death and taxes. As we enter the mobile era, the primary mobile device, ie, the smartphone, faces the certainties of adopting agressive sleeping polices to conserve battery energy, requiring programmers to use explicit power control APIs to keep the SOC/CPU on, and a third certainty that unavoidably rises from these: sleep disorder bugs.", "num_citations": "16\n", "authors": ["1837"]}
{"title": "Differential energy profiling: energy optimization via diffing similar apps\n", "abstract": " Mobile app energy profilers provide a foundational energy diagnostic tool by identifying energy hotspots in the app source code. However, they only tackle the first challenge faced by developers, as, after presented with the energy hotspots, developers typically do not have any guidance on how to proceed with the remaining optimization process:(1) Is there a more energy-efficient implementation for the same app task?(2) How to come up with the more efficient implementation?", "num_citations": "7\n", "authors": ["1837"]}
{"title": "Unsafe time handling in smartphones\n", "abstract": " Time manipulation, typically done using gettime () and settime (), happens extensively across all software layers in smartphones, from the kernel, to the framework, to millions of apps. This paper presents the first study of a new class of software bugs on smartphones called sleep-induced time bugs (SITB). SITB happenswhen the phone is suspended, due to the aggressive sleeping policy adopted in smartphones, in the middle of a time critical section where time is being manipulated and delay caused by unexpected phone suspension alters the intended program behavior.", "num_citations": "4\n", "authors": ["1837"]}
{"title": "Colour image compression by grey to colour conversion\n", "abstract": " Instead of de-correlating image luminance from chrominance, some use has been made of using the correlation between the luminance component of an image and its chromatic components, or the correlation between colour components, for colour image compression. In one approach, the Green colour channel was taken as a base, and the other colour channels or their DCT subbands were approximated as polynomial functions of the base inside image windows. This paper points out that we can do better if we introduce an addressing scheme into the image description such that similar colours are grouped together spatially. With a Luminance component base, we test several colour spaces and rearrangement schemes, including segmentation. and settle on a log-geometric-mean colour space. Along with PSNR versus bits-per-pixel, we found that spatially-keyed s-CIELAB colour error better identifies problem …", "num_citations": "4\n", "authors": ["1837"]}
{"title": "Differential resource profiling with actionable diagnostics\n", "abstract": " A differential resource analyzer performs differential resource profiling of two applications. The two applications are made to perform an operation. The differential resource analyzer matches a first application task of a first application to a second application task of a second application based on a determination that the first application task is similar to the second application task, and measures resource consumed in the first application task and the second application task. Responsive to determining that the second application task consumes less resource than the first application task, the differential resource analyzer performs an action to reduce resource consumption by the first application based on the second application task.", "num_citations": "1\n", "authors": ["1837"]}
{"title": "Towards Automated Energy Debugging on Smartphones\n", "abstract": " With over two billion users worldwide and over two million apps each in Google and Apple’s digital marketplaces, smartphones have permanently advanced human society into the mobile era. Despite the far-reaching societal impact of smartphones, the user experience has been severely limited by phone battery life. The obvious idea of extending smartphone battery life is to improve the battery technology which however has stagnated in the past 15 years, and battery capacity is generally viewed as nearing the limits of physics.", "num_citations": "1\n", "authors": ["1837"]}