{"title": "AN MCDM APPROACH TOWARDS M-PAYMENT BUSINESS MODELS EVALUATION\n", "abstract": " There are many challenges in the adaptation of m-payment technology such as improved service quality, missing standards, lack of content quality, low customer satisfaction, and lack of a business model. The business model plays a critical role in the success of mpayment technology, and there are different m-payment business models, each with their own advantages and disadvantages. Project managers have little understanding about the different components of these specific business models. This study surveyed different business model’s evaluation criteria from the literature and industry, and used the Analytic Hierarchy Process to evaluate m-payment business models on the basis of these criteria. The scalability and user centric architecture in the case of service related factors and collaboration & partnership, and response to market trends were the most important factors for sustainability of business models. According to the given criteria, the collaboration model was the most dominant model in the m-commerce domain. A sensitivity analysis was performed in order to find out different views about the final prioritized list under varying conditions.", "num_citations": "6\n", "authors": ["1565"]}
{"title": "An ANP approach towards analysis of socio-culture distance risks during control of GSD projects\n", "abstract": "  Abstract—The emerging tendency of today’s business is automation of business process in order to optimize different parameters like access to market, capturing market, consideration of global opportunities etc. This whole business process can be automated and optimized using software. Software is core component of today’s business process. Many traditional approaches exist to develop software but Global Software Development (GSD) is new paradigm in this era. The core concept behind GSD is to exploit different time zones, diverse skill set and access to market. This new paradigm also brings emerging challenges to manage and develop software projects ie communication, coordination and control. This work proposes a framework based on multi-criteria evaluation methodology for managers and software development experts to maximize their potential in positioning their projects in terms of the socio-cultural risks during controlling GSD projects.", "num_citations": "2\n", "authors": ["1565"]}
{"title": "An empirical evaluation of m-payment business models using analytic hierarchy process and sensitivity analysis\n", "abstract": " Mobile payment is the core concept in today’s m-commerce. There are different mobile payments business models but we cannot see the dominant model in the existing market. This work surveyed different factors from literature which support the sustainability of these models and were used for empirical evaluation. The literature does not report any empirical investigation about the relative importance of selection parameters and performance of each model based on this relativity. This study analyzed quantitatively current m-payment business models using AHP which is a quantitative method for decision making in case of multiple criteria and conflicting objectives, and on the basis of this analysis, the reported models and factors was prioritized according to their relative performance values. Similarly Sensitivity Analysis was done in order to find out different views about final prioritized list under varying conditions.", "num_citations": "2\n", "authors": ["1565"]}