{"title": "Context modelling and a context-aware framework for pervasive service creation: A model-driven approach\n", "abstract": " Pervasive service creation entails a complex process that involves a diversity of development aspects. Context-awareness is an important facet of pervasive service creation, which deals with the acquisition, rendering, representation and utilisation of context information. In this paper we tackle context-awareness at the application level dealing with the representation and utilisation of context by services. We propose a model-driven approach that facilitates the creation of a context modelling framework and simplifies the design and implementation of pervasive services. To conclude, we demonstrate the benefits of our model-driven approach via the creation of a pervasive museum service and its evaluation using selected software metrics.", "num_citations": "90\n", "authors": ["609"]}
{"title": "An open source domain-specific tools framework to support model driven development of OSS\n", "abstract": " Telecommunications companies undergo massive transformations which reflect onto exacting requirements for controlling the costs of new Operation Support Systems (OSS) development and integration. This calls for the adoption of new approaches, which improve agility and reusability. Model Drive Development (MDD), as specified by OMG, can drastically tackle these issues and has, therefore, attracted the interest of the telecommunications industry. Equally important is the Open Source paradigm. For MDD to gain wide industrial adoption, tools should be available to facilitate the OSS development process. In this paper, we specify requirements MDD tools should meet for effective application of the approach. An extensive survey is then carried out to evaluate existing meta-modelling frameworks over the identified tools requirements. Eventually, we present the Integrated Eclipse Model driven …", "num_citations": "28\n", "authors": ["609"]}
{"title": "Pervasive Service Creation using a Model Driven Petri Net Based Approach\n", "abstract": " Service creation is a complex process that involves service analysis design, implementation and testing. Traditionally, the service is validated at the late stage of testing. This increases development costs since any necessary amendments would require an iterative improving cycle on service design and implementation; until the desired result is eventually reached. This paper proposes a service creation methodology and tooling with a twofold contribution: (i) based on its design, a service is validated early on and prior to implementation, (ii) the service code is automatically generated out of the validated service designs. To achieve this, our approach integrates model-driven architecture (MDA) with Petri Nets (PN). MDA is used to define the (i) Information, (ii) Service Oriented Petri Net (SOPN) and (iii) User Interface modelling languages, which support the service design and implementation phases. Petri Nets …", "num_citations": "26\n", "authors": ["609"]}
{"title": "A model-driven framework for developing web service oriented applications\n", "abstract": " The advancements made in terms of the capabilities of mobile devices have shifted the interest of service engineering towards frameworks that are able to deliver applications rapidly and efficiently. The development of services that can be fully functional in mobile environments and operable on a variety of devices is an important and complex task for the research community. In this work, we propose a Model-Driven Web Service oriented framework that combines Model-Driven Engineering (MDE) with Web Services to automate the development of platform-specific web-based applications. The importance of this work is revealed through a case study that involves modelling and generation of a representative Web Service oriented mobile application.", "num_citations": "18\n", "authors": ["609"]}
{"title": "The cloud application modelling and execution language (CAMEL)\n", "abstract": " Cloud computing provides ubiquitous networked access to a shared and virtualised pool of computing capabilities that can be provisioned with minimal management effort. Cloud applications are deployed on cloud infrastructures and delivered as services. The PaaSage project aims to facilitate the modelling and execution of cloud applications by leveraging model-driven engineering (MDE) and by exploiting multiple cloud infrastructures. The Cloud Application Modelling and Execution Language (CAMEL) is the core modelling and execution language developed in the PaaSage project and enables the specification of multiple aspects of cross-cloud applications (i.e., applications deployed across multiple private, public, or hybrid cloud infrastructures). By exploiting models at both design- and run-time, and by allowing both direct and programmatic manipulation of models, CAMEL enables the management of self-adaptive cross-cloud applications (i.e., cross-cloud applications that autonomously adapt to changes in the environment, requirements, and usage). In this paper, we describe the design and implementation of CAMEL, with emphasis on the integration of heterogeneous domain-specific languages (DSLs) that cover different aspects of self-adaptive cross-cloud applications. Moreover, we provide a real-world running example to illustrate how to specify models in a concrete textual syntax and how to dynamically adapt these models during the application life cycle. Finally, we provide an evaluation of CAMEL’s usability and usefulness, based on the technology acceptance model (TAM).", "num_citations": "17\n", "authors": ["609"]}
{"title": "Automatic language translation for mobile SMS\n", "abstract": " In any form of communication it is vital that both parties can understand the same language, if they cannot a translator is required. Currently mobile users engage the service of a third party provider to translate an SMS text into a different language. The existing services have a number of drawbacks eg high cost to the user, not user friendly, they reduce the message space, and are inefficient. To communicate with a foreign person the sender must know the recipients preferred language and device display capability. What is needed is a service where a sender can send message in their native language without regard for the target tongue. We show that a mobile operator can provide a transparent service where the text message is automatically converted to the recipients preferred language. In comparison to the existing system, our implementation is efficient and cost effective and has large implications for commerce …", "num_citations": "16\n", "authors": ["609"]}
{"title": "A model driven approach to generate service creation environments\n", "abstract": " The creation of services is a complex activity that involves several tasks. Furthermore this complexity is augmented by the fact that supporting service creation environments are technology-specific. Consequently a technology-independent approach and framework are required to generate service creation environments and drive service creation. In this paper we present such an approach and a generic framework for supporting service creation. The approach realizes service creation via the phases of: (i) domain specific language definition, (ii) model definition and validation, (iii) model-to-model transformation and (iv) model-to-code generation. Each phase maps to a corresponding phase in service creation starting from service analysis to service implementation. The applicability of the approach and its accompanying framework is demonstrated via an example scenario that illustrates the automatic generation of a …", "num_citations": "14\n", "authors": ["609"]}
{"title": "SciChallenge: A Social Media Aware Platform for Contest-Based STEM Education and Motivation of Young Students\n", "abstract": " Scientific and technological innovations have become increasingly important as we face the benefits and challenges of both globalization and a knowledge-based economy. Still, enrolment rates in STEM degrees are low in many European countries and consequently there is a lack of adequately educated workforce in industries. We believe that this can be mainly attributed to pedagogical issues, such as the lack of engaging hands-on activities utilized for science and math education in middle and high schools. In this paper, we report our work in the SciChallenge European project, which aims at increasing the interest of preuniversity students in STEM disciplines, through its distinguishing feature, the systematic use of social media for providing and evaluation of the student-generated content. A social media-aware contest and platform were thus developed and tested in a panEuropean contest that attracted >700 …", "num_citations": "13\n", "authors": ["609"]}
{"title": "Developing an effective social presence system for older adults: The connected vitality network\n", "abstract": " Communication over distance via the use of communication technologies aims to offer and enable contact for older adults, who are typically restricted in terms of mobility and tend to suffer from loneliness due to the lack of social inclusion. Technologies enable communication over distance but suffer greatly in terms of providing the feeling of being connected, lacking also social presence during a remote contact. The Connected Vitality Network puts older adults at the centre of attention to study their needs for designing suitable human computer interaction methods and implement a social (tele)-presence system, which enables closeness and promotes social inclusion. Key research studies, workshop results, design principles and implementation details are presented in this paper.", "num_citations": "9\n", "authors": ["609"]}
{"title": "Non-Functional Properties in Service Oriented Architecture: Requirements, Models and Methods: Requirements, Models and Methods\n", "abstract": " Service Oriented Architecture (SOA) is the paradigm for software and system specification, design, implementation and management that intends to shape and dominate IT and business landscapes in the near future. Non-Functional Properties in Service Oriented Architecture: Requirements, Models and Methods offers a selection of chapters that cover three important aspects related to the use of non-functional properties in SOA: requirements specification with respect to non-functional properties, modeling non-functional properties and implementation of non-functional properties. This book serves as both a practical reference and an advanced scientific source for those interested in current issues, new trends, and yet-unresolved areas of the discipline.", "num_citations": "9\n", "authors": ["609"]}
{"title": "Agile product lifecycle management for service delivery frameworks: history, architecture and tools\n", "abstract": " Argyriou, L., Economou, D. and Bouki, V. 2020. Design methodology for 360 immersive video applications: the case study of a cultural heritage virtual tour. Personal and Ubiquitous Computing. 24, p. 843–859. https://doi. org/10.1007/s00779-020-01373-8", "num_citations": "8\n", "authors": ["609"]}
{"title": "RZRP: A Pure Reactive Zone-based Routing Protocol with Location-Based Predictive Caching Scheme for Wireless Mobile Ad Hoc Networks\n", "abstract": " Hybrid routing strategy is widely utilised in hierarchical routing protocols to balance the control overheads and packet delivery delay in mobile ad hoc networks (MANETs). In these protocols the area of the concerned MANET is usually divided into zones. As not all of the zones have the equal probability to become an active relay zone, the resources for proactive route information maintenance in each zone are then wasted. Such waste can be significant in large- scale networks. To cope with this deficiency we propose a two- stage pure reactive solution called RZRP. However, the pure reactive implementation can lead to longer delay than proactive or hybrid protocols. To solve this problem, a location-based predictive caching scheme is designed to reduce the latency caused by reactive route discovery. The simulation results have shown that the performance of the RZRP protocol has significantly improved in terms …", "num_citations": "7\n", "authors": ["609"]}
{"title": "The UbiCARS Model-Driven Framework: Automating Development of Recommender Systems for Commerce\n", "abstract": " Recommendations of products to customers are proved to boost sales, increase customer satisfaction and improve user experience, making recommender systems an important tool for retail businesses. With recent technological advancements in AmI and Ubiquitous Computing, the benefits of recommender systems can be enjoyed not only in e-commerce, but in the physical store scenario as well. However, developing effective context-aware recommender systems by non-expert practitioners is not an easy task due to the complexity of building the necessary data models and selecting and configuring recommendation algorithms. In this paper we apply the Model Driven Development paradigm on the physical commerce recommendation domain by defining a UbiCARS Domain Specific Modelling Language, a modelling editor and a system, that aim to reduce complexity, abstract the technical details and …", "num_citations": "6\n", "authors": ["609"]}
{"title": "Enabling Cross-Platform Mobile Application Development: A Context-Aware Middleware\n", "abstract": " The emergence of mobile computing has changed the rules of web application development. Since context-awareness has become almost a necessity in mobile applications, web applications need to adapt to this new reality. A universal development approach for context-aware applications is inherently complex due to the requirement to manage diverse context information from different sources and at different levels of granularity. A context middleware can be a key enabler in adaptive applications, since it can serve in hiding the complexity of context management functions, promoting reusability and enabling modularity and extensibility in developing context-aware applications. In this paper we present our work on a cross-platform framework that fulfils the above. We elaborate on the need for cross-platform support in context-aware web application development for mobile computing environments …", "num_citations": "6\n", "authors": ["609"]}