{"title": "A new software quality model for evaluating COTS components\n", "abstract": " Studies show that COTS-based (Commercial off the shelf) systems that are being built recently are exceeding 40% of the total developed software systems. Therefore, a model that ensures quality characteristics of such systems becomes a necessity. Among the most critical processes in COTS-based systems are the evaluation and selection of the COTS components. There are several existing quality models used to evaluate software systems in general; however, none of them is dedicated to COTS-based systems. In this contribution, an analysis study has been carried out on several existing software quality models, namely: McCall’s, Boehm, ISO 9126, FURPS, Dromey, ISO/IEC TR 15504-2 1998 (E), Triangle and Quality Cube, for the purpose of evaluating them and defining a ground to build a new model specializing in evaluating and selecting COTS components. The study also outlines limitations found in the existing models, such as the tendency to ignore a certain quality feature like Functionality or the failure to describe how the quality measurement in these models has been carried out. As a result of this analysis, a new model has been built that supports a standard set of quality characteristics suitable for evaluating COTS components, along with newly defined sets of sub-characteristics associated with them. The new model avoids some of the limitations found in the existing models. The new model ignores quality characteristics that are not applicable to COTS components and is empowered with new ones that are. In addition, it matches the appropriate type of stakeholders with corresponding quality characteristics; such a feature is …", "num_citations": "158\n", "authors": ["2212"]}
{"title": "An anomaly-based approach for DDoS attack detection in cloud environment\n", "abstract": " Cloud computing is currently a major focal point for researchers owing to its widespread application and benefits. Cloud computing's complete reliance on the internet for service provision and its distributed nature pose challenges to security, the most serious being insider Distributed Denial of Service (DDoS) which causes a total deactivation of service. Traditional defence mechanisms, such as firewalls, are unable to detect insider attacks. This work proposes an anomaly intrusion detection approach in the hypervisor layer to discourage DDoS activities between virtual machines. The proposed approach is implemented by the evolutionary neural network which integrates the particle swarm optimisation with neural network for detection and classification of the traffic that is exchanged between virtual machines. The performance analysis and results of our proposed approach detect and classify the DDoS attacks in …", "num_citations": "25\n", "authors": ["2212"]}
{"title": "A hybrid AHP-VIKOR methodology to evaluate for adoption COTS database components based on usability\n", "abstract": " Reusing commercial off-the-shelf (COTS) components in large system development provides several benefits, including accelerated development, increased dependability, and reduced process risk. However, choosing the right component among multiple alternatives is considered a hard process and may involve risk. Throughout the development life cycle, many stakeholders contribute from their own perspectives, and interests. End users desire ease of use, which is a user-focused quality attribute. Under such circumstances, there should be a mechanism that helps stakeholders to make decisions accordingly. Multiple-criteria decision-making (MCDM) or multiple-criteria decision analysis (MCDA), a sub-discipline of operations research, explicitly evaluates multiple conflicting criteria in decision-making. This research work introduces a decision-making methodology application that employs two well-known MCDM …", "num_citations": "4\n", "authors": ["2212"]}
{"title": "A Fast Approximate String Searching Algorithm\n", "abstract": " In both approximate and exact string searching algorithms, the shift distance at the skipping step plays a major role in the performance of string matching algorithms. A new algorithm called the Modified Character-Weight Algorithm (MWA) has been developed to test the effect of the shift distance on the performance of approximate string matching. An experiment was performed comparing the performance of the MWA with that of Mhashi's Character-Weight Algorithm (WA) using English text of size 1,005,077 characters. Using the average number of comparisons and the clock time as evaluation criteria, the MWA algorithm used only about 4% to 15% as many comparisons as the WA algorithm and about 10% to 35% of the clock time.", "num_citations": "3\n", "authors": ["2212"]}