{"title": "Queueing network models for performance evaluation of ZigBee-based WSNs\n", "abstract": " With the advent of the new very powerful sensors, the WSNs have extended their scope from simple isolated networks to multiple networks interconnected through Internet.               To model these new complex networks, a level of abstraction higher with respect to the one adopted by the simulation models of the original sensor networks is required. In this paper we describe an alternative approach to the one used in the original simulation models of WSN which is based on Queueing Network (QN) technique. This technique is particularly oriented to the solution of capacity planning problems.               We demonstrate through simulations that the results provided by the proposed QN model are reliable by comparing them to the ones obtained by a similar model implemented with the widely adopted network simulator ns-2. The results show a very good agreement between the values provided by the two …", "num_citations": "3\n", "authors": ["735"]}
{"title": "A Flexible Framework for Modeling Middleware Completions\n", "abstract": " Middleware has a major impact on the performance of distributed software applications. To predict the performance (e.g., response time, throughput) of an application using a performance model, it is essential to capture not only the characteristics of the application, but also the platform and the middleware. Model elements, which are added to an application software model for performance analysis are known as Completions. This research proposes a unified and flexible framework, called MMLQ (Middleware Modeling for Layered Queues), for modeling middleware completions and automatically composing them into software performance models. The existing approaches have many limitations. Some of them require to build and compose models manually, others lack generality, while others use component-based modeling which creates many elements that are not essential for performance analysis and …", "num_citations": "2\n", "authors": ["735"]}