{"title": "An online identity and smart contract management system\n", "abstract": " In today's online environment, people attend various kinds of activities, exhibit different digital presence, build personal digital reputations, issuing and receiving feedbacks from online communities being involved with. These diverse information sources once aggregated can provide a valuablefuture reference for personal online digital identity and credits check. The primary objective of this paper is to propose a systematic framework for aggregating online identity and reputation information, to provide a holistic approach to personal online behavioral ratings. Major contributions include: An identity aggregation mechanism based on social dependency network is proposed, a smart contract management framework referring to personal online ratings based on the aggregated digital identity, an experiment implementation based on blockchain technology, with illustrative examples and theoretical evaluations to the …", "num_citations": "77\n", "authors": ["1558"]}
{"title": "Improving software security awareness using a serious game\n", "abstract": " Protecting people from cyber threats imposes great challenges, not only technically, but also socially. To achieve the intended level of awareness, software security principles need to be shown with concrete examples during security education. This study aims to design a serious game integrating software security knowledge and concepts into the processes to make it more engaging to learn while playing. In this paper, we have: (i) designed a serious game to compensate the deficiencies in the literature; (ii) performed empirical evaluations including survey, brainstorming and observation to the proposed game. Results: Our study shows that: (i) Cyber Security-Requirements Awareness Game (CSRAG) has a positive effect on players security learning outcomes, level of engagement and participation; (ii) Game-based learning can be an effective way of teaching security related scenarios.", "num_citations": "26\n", "authors": ["1558"]}
{"title": "On the quality of grey literature and its use in information synthesis during systematic literature reviews\n", "abstract": " Context: The internet has become a vital channel for disseminating and accessing scientific literature for both the academic and industrial research needs. Nowadays, everyone has wide access to scientific literature repositories, which comprise of both “white” and “grey” literature. The “grey” literature, as opposed to “white” literature, is non-peer reviewed scientific information that is not available using commercial information sources such as IEEE or ACM. A large number of software engineering researchers are undertaking systematic literature reviews (SLRs) to investigate empirical evidence in software engineering. The key reason to include grey literature during information synthesis is to minimize the risk of any bias in the publication. Using the state of the art non-commercial databases that index information, the researchers can make the rigorous process of searching empirical studies in SLRs easier. This study explains the evidence of grey literature while performing synthesis in Systematic Literature Reviews.Objectives: The goals of this thesis work are,", "num_citations": "16\n", "authors": ["1558"]}
{"title": "Contemplating social engineering studies and attack scenarios: A review study\n", "abstract": " The previous year has seen an enormous increase in the studies related to social engineering. This increase is partly due to increasing number of social engineering attacks and partly due to people's inability to identify the attack. Thus, it is of great importance to find solutions which are helpful for human to understand the social engineering attacks and scenarios. To address this, we have performed a literature review of studies (on social engineering) in top‐notch journals and conferences. In this paper, we have enlisted the types of attacks, and the persuasion techniques used by social engineers as listed in the literature. We also combined different theories which researchers tried to use to explain various activities of social engineers. Furthermore, we have mentioned that a better understanding of the social engineering attack scenarios can be done using thematic and game‐based analysis techniques …", "num_citations": "15\n", "authors": ["1558"]}
{"title": "Using simulation system for collaborative learning to enhance learner’s performance\n", "abstract": " This study focuses on adoption of simulation system in rapidly changing technology and information flow. Given the prevalent popularity of simulation system, it is important to understand and adopt simulation system to develop future educational plans. This paper addresses how simulation system enhances student collaborative learning and learner performance using Technology Acceptance Model. Results were analyzed using Structure Equation Modeling technique; this study established that perceived usefulness, perceived ease of use, and perceived enjoyment all have a significant positive relationship with simulation system. The results indicate that simulation system serves as a dynamic tool to accelerate the progress of learning environments by encouraging collaboration and communication among students which strengthen their learning abilities and increase performance because students practically …", "num_citations": "14\n", "authors": ["1558"]}
{"title": "How persuasive is a phishing email? A phishing game for phishing awareness\n", "abstract": " Objective:The objective of this study is to utilize serious game to: i) educate players regarding phishing and spear-phishing attacks; ii) make aware and educate players regarding dangers associated with excessive online information disclosure.Method:In order to address the objectives we have: i) performed an in-depth literature review to extract insights related to social engineering, phishing, game design, learning functions, human interaction, and game-based learning etc; ii) proposed and aligned the game design with social engineering ontology concepts; iii) performed an empirical evaluation to evaluate the effectiveness of the designed board game.Conclusion:From this research study, we conclude that: i) PhishI game is useful in educating players regarding excessive online information disclosure and phishing awareness; ii) game-based learning is an effective method for inculcating and general cyber …", "num_citations": "11\n", "authors": ["1558"]}
{"title": "Big data services requirements analysis\n", "abstract": " The development of the Internet and cloud computing has set up a matured environment for developing and deploying big data services. The main objective of requirements engineering for big data is to capture big data service users’ needs and provider’s capabilities, and to identify value added service use cases for big data technology in a given organizational context. Major objectives may include: collect real-time data about the world, search for useful information in large data sets, gain insights about given problems by data analytics, predict possible trend of interesting subjects, and make decisions for the next immediate actions. In this paper, we propose a big data service requirements analysis framework, which aims to provide useful guidelines for eliciting service requirements, selecting the right services architectures and evaluate the available technological services implementations. For services …", "num_citations": "5\n", "authors": ["1558"]}
{"title": "Recent Studies on i*: A Survey.\n", "abstract": " i* is studied extensively in the requirements engineering and information systems engineering literature since the 90s. The language itself is gradually evolving and extended to iStar 2.0, and peoples interest of study is also evolving in the meantime. In this paper, we surveyed recent papers in a few major research databases, identifying key research issues people are aiming at while study i* language. We classified the work according to the content and nature of the studies, such as, modelling language, techniques, modelling applications, and teaching. This helps us understand the recent research interest centered around i* modelling language, and discuss about possible further directions for i* related research and practice.", "num_citations": "2\n", "authors": ["1558"]}
{"title": "How Shared Leadership Can be Introduced in a   Software Project Team? An Exploratory Study\n", "abstract": " Establishing a process of shared governance requires effective management, implementation of a suitable framework, multidisciplinary working, examination of its structure and culture. Shared governance is an ongoing process that requires constant assessment and reassessment so that administration may be responsive to a changing environment.", "num_citations": "2\n", "authors": ["1558"]}
{"title": "Understanding and deciphering of social engineering attack scenarios\n", "abstract": " Malicious scammers and social engineers are causing great harms to modern society, as they have led to the loss of data, information, money, and many more for individuals and companies. Knowledge about social engineering (SE) is wide‐spread and it exits in non‐academic papers and communication channels. Knowledge is mostly based on expert opinion and experience reports. Such knowledge, if articulated, can provide a valid source of knowledge and information. We performed the analysis of such sources, guided by academic principles around SE, and solicit existing SE scenarios from public awareness education materials, news stories, research literature, official advisories to public departments. We adopted grounded theory to extract the general knowledge behind SE, such as, attacking cycles, information gathering strategies, psychological principles, attack vectors, and so on. In this article, we aim …", "num_citations": "1\n", "authors": ["1558"]}
{"title": "Understanding social engineers strategies from the perspective of Sun-Tzu philosophy\n", "abstract": " Human remains susceptible to manipulations, and social engineers are expert of these techniques. To better understand the attack and defense strategies of social engineering attack, there is a need to map social engineering strategies with the war strategies. We can find plenty of war strategist and books on war strategies. By mapping the knowledge, we may get unique ways of defense and can further identify social engineering attack patterns. In this study, we have mapped the principles suggested by Sun-Tzu with social engineering attacks and further mentioned the initial results (by showing examples for each case). We aim to extend this work and further verify the effectiveness of this strategy in near future.", "num_citations": "1\n", "authors": ["1558"]}
{"title": "Designing the Next Mobile App Recommender System for the Globe\n", "abstract": " Innovative mobile applications bring radical changes to people's life around the globe. With its unique characteristics of anywhere, anytime accessibility, thousands of mobile apps are developed, distributed, and executed over the Internet. To understand the selection criteria for different end users when facing a mobile application, this paper quests for an evaluation framework for mobile apps based statistical data analysis and survey. Firstly, user's ratings on 1500+ mobile applications from Google Play were analyzed to elicit different users' preferences on mobile apps. The data was extracted twice, first at the end 2015, then early 2017, and the data are from four different locations: The UK, USA, Netherland, and Pakistan. Secondly, the survey was conducted to collect university students' rationale when making selections and downloading decisions of a mobile app. Furthermore, the knowledge gathered from data …", "num_citations": "1\n", "authors": ["1558"]}
{"title": "How to Overcome Communication Barriers in Global Software Development?\n", "abstract": " This research study was conducted to identify team-level coordination issues and to make strategies that help in overcoming these hurdles between Global Software Engineering (GSE) teams. In GSE projects, a steady flow of communication and coordination between the team members is required throughout the project. Communication and coordination make top in the list of challenges currently faced by GSE projects. Geographically dispersed teams members often face lack of coordination problems because of minimal communication. In GSE, teams coordinate on different level from requirement engineering (RE) phase to project deployment phase. Our main focus in this research was achieving coordination between dispersed GSE teams of requirements engineers, software designers and software developer.", "num_citations": "1\n", "authors": ["1558"]}