{"title": "Review of automatic text summarization techniques & methods\n", "abstract": " Text summarization automatically produces a summary containing important sentences and includes all relevant important information from the original document. One of the main approaches, when viewed from the summary results, are extractive and abstractive. An extractive summary is heading towards maturity and now research has shifted towards abstractive summation and real-time summarization. Although there have been so many achievements in the acquisition of datasets, methods, and techniques published, there are not many papers that can provide a broad picture of the current state of research in this field. This paper provides a broad and systematic review of research in the field of text summarization published from 2008 to 2019. There are 85 journal and conference publications which are the results of the extraction of selected studies for identification and analysis to describe research topics/trends …", "num_citations": "17\n", "authors": ["962"]}
{"title": "Literature review of automatic text summarization: research trend, dataset and method\n", "abstract": " Automatic text summarization can be defined as the process of presenting one or more text documents while maintaining the main information content using an automatic machine with no more than half the original text or less than the original text. Research in the field of text summarization began in the 1950s and until now there is no system that can produce summaries such as professionals or humans. This paper aims to identify and analyze methods, datasets and trends in automatic text summarization research from 2015 to 2019. The method used a systematic literature review (SLR) about automatic text summarization. The results obtained are that research on automatic text summarization is still relevant to date. The extractive approach is still in demand in the past three years because the extractive is easier than abstractive and the opportunity to combine methods is still open, for example using a neuro …", "num_citations": "10\n", "authors": ["962"]}
{"title": "A Study of Tracing and Writing Performance of Novice Students in Introductory Programming\n", "abstract": " The tasks of programming include complex knowledge and skills that is, from understanding problems to evaluating validity of program. Novice students often face difficulties in learning programming due to various issues and the nature of the subject, which can be vague and invisible. A survey was conducted on 294 students from two universities to study novices’ problems in dealing with tracking the logical flow and writing a simple code. The average score for tracking and writing skills were quite disappointing. Students were only able to master the static part of programming knowledge. They lacked the knowledge in understanding and tracing the dynamic behavior of the program. This research attempts to propose a model to shift the internal working memory load of students through integrated visualization tools that can reveal the dynamic behavior of programs and related concepts that appear in each …", "num_citations": "8\n", "authors": ["962"]}
{"title": "Pengenalan Computational Thinking Sebagai Metode Problem Solving Kepada Guru dan Siswa Sekolah di Kota Semarang\n", "abstract": " Problem solving merupakan salah satu kemampuan yang sangat dibutuhkan untuk menghadapi persaingan global. Maka dari itu perlu untuk dilatih sedari dini. Melihat pada perkembangan teknologi dan imlu komputer, lahirlah sebuah pendekatan problem solving skill yang dikenal dengan nama Computational Thinking (CT). CT dikembangkan dari konsep dasar ilmu komputer, dengan cara mengabstraksi permasalahan kemudian mengilustrasikan dan menyusun solusi. Mulai tahun 2016, Indonesia secara aktif berpartisipasi dalam Komunitas Bebras dan mengkampanyekan Computational Thinking dengan mengadakan Bebras Challenge bagi siswa sekolah di seluruh Indonesia. Fakultas Ilmu Komputer UDINUS menjadi salah satu Bebras Biro yang ikut sebagai penyelenggara Bebras Challenge di Kota Semarang. Penyuluhan Bebras kepada Guru dimaksudkan untuk mengenalkan skill Computational Thinking ini, sehingga ke depannya setiap guru dapat menyampaikan dan melatih siswanya dalam pengembangan skill problem solving. Penyuluhan diikuti oleh guru perwakilan dari 27 sekolah dasar di Kota Semarang. Sebagai rangkaian kampanye, Bebras Challenge diikuti oleh total 169 siswa dari SD dan SMP di Kota Semarang. Hasil Bebras Challenge, terdapat 1 peserta asal Bebras Biro UDINUS yang berhasil masuk peringkat 3 besar nasional.", "num_citations": "4\n", "authors": ["962"]}
{"title": "Kombinasi Teknik Chi Square Dan Singular Value Decomposition Untuk Reduksi Fitur Pada Pengelompokan Dokumen\n", "abstract": " Clustering dokumen adalah proses pengelompokan dokumen yang memiliki kesamaan topik. Metode Vector Space Model (VSM) merepresentasikan sekumpulan dokumen dalam bentuk matrik term-document, dimana setiap kolomnya mewakili dokumen dan setiap barisnya mewakili term (kata) yang terkandung dalam dokumen tersebut. Masalah yang terjadi dalam VSM adalah besarnya dimensi dan banyaknya nilai nol", "num_citations": "4\n", "authors": ["962"]}
{"title": "Sistem Informasi Geografis Pemetaan Domisili Asal Mahasiswa Universitas Dian Nuswantoro Berbasis Google Maps API\n", "abstract": " Universitas Dian Nuswantoro (Udinus) adalah Perguruan Tinggi Swasta yang memiliki mahasiswa yang berasal dari wilayah yang beragam namun asal mahasiswa Udinus terbanyak masih berasal dari wilayah Jawa Tengah. Untuk itu Tim Admisi yang merupakan Tim dari Biro Admisi dan Promosi melakukan kegiatan promosi ke sekolah-sekolah. Dari kegiatan tersebut, diperoleh data dalam format tabular (hardcopy dan softcopy) yang kemudian akan dilakukan analisa. Namun Tim Admisi memerlukan waktu yang cukup lama untuk mendapatkan pengetahuan dalam menentukan wilayah yang berpotensi untuk dilakukan promosi dengan lebih intensif. Hal ini dikarenakan representasi data tidak terkait secara langsung dengan informasi geografis yang menunjukkan wilayah tertentu. Permasalahan tersebut berakibat pada aktivitas promosi yang dilakukan Tim Admisi ke sekolah-sekolah tidak dapat merata dan penyebaran mahasiswa Udinus menjadi tidak merata. Untuk mengatasi permasalahan tersebut Tim Admisi perlu sistem pemetaan domisili asal mahasiswa berbasis Google Maps API dengan bantuan Sistem Informasi Geografis (SIG). Sistem selanjutnya dirancang dan dikembangkan dengan menggunakan metode Waterfall, bahasa pemrograman PHP dan database MySQL. Hasil penelitian ini adalah sebuah aplikasi SIG yang memuat output bukan hanya peta sebaran yang berisi jumlah mahasiswa tetapi juga informasi pendukung lainnya berupa tabel dan diagram batang. Aplikasi secara signifikan dapat membantu Tim Admisi dalam mempertimbangkan wilayah sasaran untuk keperluan promosi.", "num_citations": "2\n", "authors": ["962"]}
{"title": "Effectiveness of Integrated Algorithm-Program Visualization: A Case Study with the 3De-AlProV\n", "abstract": " A various research of algorithm visualization (AV) and program visualization (PV) tools in separate manner to help students learning introductory programming have been conducted during last few decades. However, the outcomes in the field are concluded to be “markedly mixed” and the results of learning programming still remind poor. The investigation of the collaborative approach between AV and PV through 3De-AlProV tool has been conducted. A group of novice learned introductory programming using 3De-AlProV tool for 7 weeks was compared with a group without using it. The statistical comparison resulted from pre- and post-test of programming performance between groups indicated that the treatment group significantly leading 13% better learning outcomes with syntactic and semantic correctness than control group who used traditional teaching materials without proposed tool.", "num_citations": "2\n", "authors": ["962"]}
{"title": "Pembelajaran Computational Thinking untuk Siswa SMA Institut Indonesia Semarang\n", "abstract": " Pembelajaran mengenai teknologi informasi telah banyak dilakukan di pendidikan menengah atas untuk mempersiapkan peserta didik menghadapi perkembangan teknologi informasi. Penerapan teknologi informasi di berbagai bidang sesungguhnya memerlukan kemampuan berpikir komputasional yang menjadi populer dalam beberapa tahun terakhir ini menjadi kemampuan yang mendasar yang seyogyanya dimiliki oleh setiap insan dalam era digital ini. Kemampuan berpikir komputasional adalah proses berpikir dalam melakukan formulasi persoalan dan solusinya sehingga solusi dapat dinyatakan dalam suatu bentuk yang dapat dikerjakan secara efektif oleh manusia atau mesin. Berpikir komputasional adalah kemampuan dasar yang diperlukan setiap orang, bukan hanya ilmuwan komputer. Selain kemampuan membaca, menulis, dan aritmatika, kita juga perlu menambahkan kemampuan berpikir komputasional kepada seorang anak untuk mengasah kemampuan analisisnya.", "num_citations": "1\n", "authors": ["962"]}