{"title": "Improving iris recognition performance using segmentation, quality enhancement, match score fusion, and indexing\n", "abstract": " This paper proposes algorithms for iris segmentation, quality enhancement, match score fusion, and indexing to improve both the accuracy and the speed of iris recognition. A curve evolution approach is proposed to effectively segment a nonideal iris image using the modified Mumford-Shah functional. Different enhancement algorithms are concurrently applied on the segmented iris image to produce multiple enhanced versions of the iris image. A support-vector-machine-based learning algorithm selects locally enhanced regions from each globally enhanced image and combines these good-quality regions to create a single high-quality iris image. Two distinct features are extracted from the high-quality iris image. The global textural feature is extracted using the 1-D log polar Gabor transform, and the local topological feature is extracted using Euler numbers. An intelligent fusion algorithm combines the textural …", "num_citations": "325\n", "authors": ["464"]}
{"title": "Plastic surgery: A new dimension to face recognition\n", "abstract": " Advancement and affordability is leading to the popularity of plastic surgery procedures. Facial plastic surgery can be reconstructive to correct facial feature anomalies or cosmetic to improve the appearance. Both corrective as well as cosmetic surgeries alter the original facial information to a large extent thereby posing a great challenge for face recognition algorithms. The contribution of this research is 1) preparing a face database of 900 individuals for plastic surgery, and 2) providing an analytical and experimental underpinning of the effect of plastic surgery on face recognition algorithms. The results on the plastic surgery database suggest that it is an arduous research challenge and the current state-of-art face recognition algorithms are unable to provide acceptable levels of identification performance. Therefore, it is imperative to initiate a research effort so that future face recognition systems will be able to …", "num_citations": "199\n", "authors": ["464"]}
{"title": "Evolutionary neural network modeling for software cumulative failure time prediction\n", "abstract": " An evolutionary neural network modeling approach for software cumulative failure time prediction based on multiple-delayed-input single-output architecture is proposed. Genetic algorithm is used to globally optimize the number of the delayed input neurons and the number of neurons in the hidden layer of the neural network architecture. Modification of Levenberg–Marquardt algorithm with Bayesian regularization is used to improve the ability to predict software cumulative failure time. The performance of our proposed approach has been compared using real-time control and flight dynamic application data sets. Numerical results show that both the goodness-of-fit and the next-step-predictability of our proposed approach have greater accuracy in predicting software cumulative failure time compared to existing approaches.", "num_citations": "183\n", "authors": ["464"]}
{"title": "Integrated multilevel image fusion and match score fusion of visible and infrared face images for robust face recognition\n", "abstract": " This paper presents an integrated image fusion and match score fusion of multispectral face images. The fusion of visible and long wave infrared face images is performed using 2 ν-granular SVM which uses multiple SVMs to learn both the local and global properties of the multispectral face images at different granularity levels and resolution. The 2 ν-GSVM performs accurate classification which is subsequently used to dynamically compute the weights of visible and infrared images for generating a fused face image. 2D log polar Gabor transform and local binary pattern feature extraction algorithms are applied to the fused face image to extract global and local facial features, respectively. The corresponding match scores are fused using Dezert Smarandache theory of fusion which is based on plausible and paradoxical reasoning. The efficacy of the proposed algorithm is validated using the Notre Dame and …", "num_citations": "180\n", "authors": ["464"]}
{"title": "Feature based RDWT watermarking for multimodal biometric system\n", "abstract": " This paper presents a 3-level RDWT biometric watermarking algorithm to embed the voice biometric MFC coefficients in a color face image of the same individual for increased robustness, security and accuracy. Phase congruency model is used to compute the embedding locations which preserves the facial features from being watermarked and ensures that the face recognition accuracy is not compromised. The proposed watermarking algorithm uses adaptive user-specific watermarking parameters for improved performance. Using face, voice and multimodal recognition algorithms, and statistical evaluation, we show that the proposed RDWT watermarking algorithm is robust to different frequency and geometric attacks, and provides the multimodal biometric verification accuracy of 94%.", "num_citations": "139\n", "authors": ["464"]}
{"title": "Face recognition with disguise and single gallery images\n", "abstract": " This paper presents a face recognition algorithm that addresses two major challenges. The first is when an individual intentionally alters the appearance and features using disguises, and the second is when limited gallery images are available for recognition. The algorithm uses a dynamic neural network architecture to extract the phase features of the face texture using 2D log polar Gabor transform. The phase features are divided into frames which are matched using the Hamming distance. The performance of the proposed algorithm is evaluated using three databases that comprise of real and synthetic face images with different disguise artifacts. The performance of the algorithm is evaluated for decreasing number of gallery images and various types of disguises. In all cases the proposed algorithm shows a better performance compared to other existing algorithms.", "num_citations": "131\n", "authors": ["464"]}
{"title": "A mosaicing scheme for pose-invariant face recognition\n", "abstract": " Mosaicing entails the consolidation of information represented by multiple images through the application of a registration and blending procedure. We describe a face mosaicing scheme that generates a composite face image during enrollment based on the evidence provided by frontal and semiproflle face images of an individual. Face mosaicing obviates the need to store multiple face templates representing multiple poses of a user's face image. In the proposed scheme, the side profile images are aligned with the frontal image using a hierarchical registration algorithm that exploits neighborhood properties to determine the transformation relating the two images. Multiresolution splining is then used to blend the side profiles with the frontal image, thereby generating a composite face image of the user. A texture-based face recognition technique that is a slightly modified version of the C2 algorithm proposed by …", "num_citations": "122\n", "authors": ["464"]}
{"title": "Robust biometric image watermarking for fingerprint and face template protection\n", "abstract": " This paper presents a combined DWT and LSB based biometric watermarking algorithm that securely embeds a face template in a fingerprint image. The proposed algorithm is robust to geometric and frequency attacks and protects the integrity of both the face template and the fingerprint image. Experimental results performed on a database of 750 face and 750 fingerprint images show that the algorithm has the advantages of both the existing DWT and LSB based algorithms. A multimodal biometric algorithm is used as a metric to evaluate the combined performance of both face and fingerprint recognition.", "num_citations": "117\n", "authors": ["464"]}
{"title": "LivDet iris 2017—Iris liveness detection competition 2017\n", "abstract": " Presentation attacks such as using a contact lens with a printed pattern or printouts of an iris can be utilized to bypass a biometric security system. The first international iris liveness competition was launched in 2013 in order to assess the performance of presentation attack detection (PAD) algorithms, with a second competition in 2015. This paper presents results of the third competition, LivDet-Iris 2017. Three software-based approaches to Presentation Attack Detection were submitted. Four datasets of live and spoof images were tested with an additional cross-sensor test. New datasets and novel situations of data have resulted in this competition being of a higher difficulty than previous competitions. Anonymous received the best results with a rate of rejected live samples of 3.36% and rate of accepted spoof samples of 14.71%. The results show that even with advances, printed iris attacks as well as patterned …", "num_citations": "113\n", "authors": ["464"]}
{"title": "On-line prediction of software reliability using an evolutionary connectionist model\n", "abstract": " An on-line adaptive software reliability prediction model using evolutionary connectionist approach based on multiple-delayed-input single-output architecture is proposed. Based on the currently available software failure time data, genetic algorithm is used to globally optimize the number of the delayed input neurons and the number of neurons in the hidden layer of the neural network architecture. Bayesian regularization is applied to our network training scheme to improve the generalization capability. The corresponding optimized neural network architecture is iteratively and dynamically reconfigured in real-time as new actual failure time data arrives. The performance of our proposed approach has been tested using four real-time control and flight dynamic application data sets. Numerical results show that our proposed approach is robust across different software projects, and has a better performance with …", "num_citations": "112\n", "authors": ["464"]}
{"title": "Multimodal medical image fusion using redundant discrete wavelet transform\n", "abstract": " Medical image fusion has revolutionized medical analysis by improving the precision and performance of computer assisted diagnosis. In this research, a fusion algorithm is proposed to combine pairs of multispectral magnetic resonance imaging such as T1, T2 and proton density brain images. The proposed algorithm utilizes different features of redundant discrete wavelet transform, mutual information based non-linear registration and entropy information to improve performance. Experiments on the BrainWeb database show that the proposed fusion algorithm preserves both edge and component information, and provides improved performance compared to existing discrete wavelet transform based fusion algorithms.", "num_citations": "103\n", "authors": ["464"]}
{"title": "Hierarchical fusion of multi-spectral face images for improved recognition performance\n", "abstract": " This paper presents a two level hierarchical fusion of face images captured under visible and infrared light spectrum to improve the performance of face recognition. At image level fusion, two face images from different spectrums are fused using DWT based fusion algorithm. At feature level fusion, the amplitude and phase features are extracted from the fused image using 2D log polar Gabor wavelet. An adaptive SVM learning algorithm intelligently selects either the amplitude or phase features to generate a fused feature set for improved face recognition. The recognition performance is observed under the worst case scenario of using single training images. Experimental results on Equinox face database show that the combination of visible light and short-wave IR spectrum face images yielded the best recognition performance with an equal error rate of 2.86%. The proposed image-feature fusion algorithm also …", "num_citations": "95\n", "authors": ["464"]}
{"title": "Reducing the false rejection rate of iris recognition using textural and topological features. Int\n", "abstract": " This paper presents a novel iris recognition system using 1D log polar Gabor wavelet and Euler numbers. 1D log polar Gabor wavelet is used to extract the textural features, and Euler numbers are used to extract topological features of the iris. The proposed decision strategy uses these features to authenticate an individual’s identity while maintaining a low false rejection rate. The algorithm was tested on CASIA iris image database and found to perform better than existing approaches with an overall accuracy of 99.93%. Keywords—Iris recognition, textural features, topological features. I.", "num_citations": "95\n", "authors": ["464"]}
{"title": "Enhancing security of fingerprints through contextual biometric watermarking\n", "abstract": " This paper presents a novel digital watermarking technique using face and demographic text data as multiple watermarks for verifying the chain of custody and protecting the integrity of a fingerprint image. The watermarks are embedded in selected texture regions of a fingerprint image using discrete wavelet transform. Experimental results show that modifications in these locations are visually imperceptible and maintain the minutiae details. The integrity of the fingerprint image is verified through the high matching scores obtained from an automatic fingerprint identification system. There is also a high degree of visual correlation between the embedded images, and the extracted images from the watermarked fingerprint. The degree of similarity is computed using pixel-based metrics and human visual system metrics. The results also show that the proposed watermarked fingerprint and the extracted images are …", "num_citations": "88\n", "authors": ["464"]}
{"title": "Improving biometric recognition accuracy and robustness using DWT and SVM watermarking\n", "abstract": " This paper presents a novel biometric watermarking algorithm for improving the recognition accuracy and protecting the face and fingerprint images from tampering. Multi-resolution Discrete Wavelet Transform is used for embedding the face image in a fingerprint image. An intelligent learning algorithm based on υ-Support Vector Machine (SVM) is introduced to enhance the quality of the extracted face image. The performance of the watermarking algorithm is experimentally validated using existing fingerprint and face recognition algorithms. The results show that the extracted fingerprint and face images are of high quality. The use of SVM enhances the performance of face recognition by at least 10% even when the watermarked image is subjected to certain geometric and frequency attacks such as scaling, cropping, compression and filtering.", "num_citations": "75\n", "authors": ["464"]}
{"title": "FaceDCAPTCHA: Face detection based color image CAPTCHA\n", "abstract": " With data theft and computer break-ins becoming increasingly common, there is a great need for secondary authentication to reduce automated attacks while posing a minimal hindrance to legitimate users. CAPTCHA is one of the possible ways to classify human users and automated scripts. Though text-based CAPTCHAs are used in many applications, they pose a challenge due to language dependency. In this paper, we propose a face image-based CAPTCHA as a potential solution. To solve the CAPTCHA, users must correctly identify visually-distorted human faces embedded in a complex background without selecting any non-human faces. The proposed algorithm generates a CAPTCHA that offers better human accuracy and lower machine attack rates compared to existing approaches.", "num_citations": "71\n", "authors": ["464"]}
{"title": "Hierarchical representation learning for kinship verification\n", "abstract": " Kinship verification has a number of applications such as organizing large collections of images and recognizing resemblances among humans. In this paper, first, a human study is conducted to understand the capabilities of human mind and to identify the discriminatory areas of a face that facilitate kinshipcues. The visual stimuli presented to the participants determine their ability to recognize kin relationship using the whole face as well as specific facial regions. The effect of participant gender and age and kin-relation pair of the stimulus is analyzed using quantitative measures such as accuracy, discriminability index d', and perceptual information entropy. Utilizing the information obtained from the human study, a hierarchical kinship verification via representation learning (KVRL) framework is utilized to learn the representation of different face regions in an unsupervised manner. We propose a novel approach for …", "num_citations": "69\n", "authors": ["464"]}
{"title": "Effect of plastic surgery on face recognition: A preliminary study\n", "abstract": " Variations in pose, expression, illumination, aging and disguise are considered as major challenges in face recognition and several techniques have been proposed to address these challenges. Plastic surgery, on the other hand, is considered as an arduous research issue; however, it has not yet been studied either theoretically or experimentally. This paper focuses on analyzing the effect of plastic surgery in face recognition algorithms. The preliminary study provides an experimental and analytical comparison of face recognition algorithms on a plastic surgery database of 506 individuals. The experimental results indicate that existing face recognition algorithms perform poorly when matching pre and post surgery face images. The results also suggest that it is imperative for future face recognition systems to be able to address this important issue and hence there is a need for more research in this important area.", "num_citations": "68\n", "authors": ["464"]}
{"title": "On the dynamic selection of biometric fusion algorithms\n", "abstract": " Biometric fusion consolidates the output of multiple biometric classifiers to render a decision about the identity of an individual. We consider the problem of designing a fusion scheme when 1) the number of training samples is limited, thereby affecting the use of a purely density-based scheme and the likelihood ratio test statistic; 2) the output of multiple matchers yields conflicting results; and 3) the use of a single fusion rule may not be practical due to the diversity of scenarios encountered in the probe dataset. To address these issues, a dynamic reconciliation scheme for fusion rule selection is proposed. In this regard, the contribution of this paper is two-fold: 1) the design of a sequential fusion technique that uses the likelihood ratio test-statistic in conjunction with a support vector machine classifier to account for errors in the former; and 2) the design of a dynamic selection algorithm that unifies the constituent …", "num_citations": "66\n", "authors": ["464"]}
{"title": "Face presentation attack with latex masks in multispectral videos\n", "abstract": " Face recognition systems are susceptible to presentation attacks such as printed photo attacks, replay attacks, and 3D mask attacks. These attacks, primarily studied in visible spectrum, aim to obfuscate or impersonate a person's identity. This paper presents a unique multispectral video face database for face presentation attack using latex and paper masks. The proposed Multispectral Latex Mask based Video Face Presentation Attack (MLFP) database contains 1350 videos in visible, near infrared, and thermal spectrums. Since the database consists of videos of subjects without any mask as well as wearing ten different masks, the effect of identity concealment is analyzed in each spectrum using face recognition algorithms. We also present the performance of existing presentation attack detection algorithms on the proposed MLFP database. It is observed that the thermal imaging spectrum is most effective in detecting face presentation attacks.", "num_citations": "60\n", "authors": ["464"]}
{"title": "Detecting medley of iris spoofing attacks using DESIST\n", "abstract": " Human iris is considered a reliable and accurate modality for biometric recognition due to its unique texture information. However, similar to other biometric modalities, iris recognition systems are also vulnerable to presentation attacks (commonly called spoofing) that attempt to conceal or impersonate identity. Examples of typical iris spoofing attacks are printed iris images, textured contact lenses, and synthetic creation of iris images. It is critical to note that majority of the algorithms proposed in the literature are trained to handle a specific type of spoofing attack. These algorithms usually perform very well on that particular attack. However, in real-world applications, an attacker may perform different spoofing attacks. In such a case, the problem becomes more challenging due to inherent variations in different attacks. In this paper, we focus on a medley of iris spoofing attacks and present a unified framework for …", "num_citations": "60\n", "authors": ["464"]}
{"title": "Quality-augmented fusion of level-2 and level-3 fingerprint information using DSm theory\n", "abstract": " Existing algorithms that fuse level-2 and level-3 fingerprint match scores perform well when the number of features are adequate and the quality of images are acceptable. In practice, fingerprints collected under unconstrained environment neither guarantee the requisite image quality nor the minimum number of features required. This paper presents a novel fusion algorithm that combines fingerprint match scores to provide high accuracy under non-ideal conditions. The match scores obtained from level-2 and level-3 classifiers are first augmented with a quality score that is quantitatively determined by applying redundant discrete wavelet transform to a fingerprint image. We next apply the generalized belief functions of Dezert–Smarandache theory to effectively fuse the quality-augmented match scores obtained from level-2 and level-3 classifiers. Unlike statistical and learning based fusion techniques, the proposed …", "num_citations": "59\n", "authors": ["464"]}
{"title": "Dynamic software reliability prediction: an approach based on support vector machines\n", "abstract": " A support vector machine (SVM) modeling approach for software reliability prediction is proposed. Based on the structural risk minimization principle, the learning scheme of SVM is focused on minimizing an upper bound of the generalization error that eventually results in better generalization performance. The SVM learning scheme is applied to the failure time data, forcing the network to learn and recognize the inherent internal temporal property of software failure sequence. Further, the SVM learning process is iteratively and dynamically updated after every occurrence of new failure time data in order to capture the most current feature hidden inside the software failure behavior. The performance of our proposed approach has been tested using four real-time control and flight dynamic application data sets and compared with feed-forward neural network and recurrent neural network modeling approaches …", "num_citations": "58\n", "authors": ["464"]}
{"title": "A secure conditional access system using digital signature and encryption\n", "abstract": " A new conditional access system architecture is proposed. It uses XML digital signature and encryption to securely distribute audio, video, image, and data on the Web. It also supports payment transactions in a secure environment.", "num_citations": "57\n", "authors": ["464"]}
{"title": "Age transformation for improving face recognition performance\n", "abstract": " This paper presents a novel age transformation algorithm to handle the challenge of facial aging in face recognition. The proposed algorithm registers the gallery and probe face images in polar coordinate domain and minimizes the variations in facial features caused due to aging. The efficacy of the proposed age transformation algorithm is validated using 2D log polar Gabor based face recognition algorithm on a face database that comprises of face images with large age progression. Experimental results show that the proposed algorithm significantly improves the verification and identification performance.", "num_citations": "55\n", "authors": ["464"]}
{"title": "Learning structure and strength of CNN filters for small sample size training\n", "abstract": " Convolutional Neural Networks have provided state-of-the-art results in several computer vision problems. However, due to a large number of parameters in CNNs, they require a large number of training samples which is a limiting factor for small sample size problems. To address this limitation, in this paper, we propose SSF-CNN which focuses on learning the “structure\" and “strength\" of filters. The structure of the filter is initialized using a dictionary based filter learning algorithm and the strength of the filter is learned using the small sample training data. The architecture provides the flexibility of training with both small and large training databases, and yields good accuracies even with small size training data. The effectiveness of the algorithm is demonstrated on MNIST, CIFAR10, NORB, Omniglot, and Newborn Face Image databases, with varying number of training samples. The results show that SSF-CNN significantly reduces the number of parameters required for training while providing high accuracies on the test database. On small problems such as newborn face recognition, the results demonstrate improvement in rank-1 identification accuracy by at least 10%.", "num_citations": "54\n", "authors": ["464"]}
{"title": "Unification of evidence-theoretic fusion algorithms: A case study in level-2 and level-3 fingerprint features\n", "abstract": " This paper formulates an evidence-theoretic multimodal unification approach using belief functions that take into account the variability in biometric image characteristics. While processing nonideal images, the variation in the quality of features at different levels of abstraction may cause individual classifiers to generate conflicting genuine-impostor decisions. Existing fusion approaches are nonadaptive and do not always guarantee optimum performance improvements. We propose a contextual unification framework to dynamically select the most appropriate evidence-theoretic fusion algorithm for a given scenario. In the first approach, the unification framework uses deterministic rules to select the most appropriate fusion algorithm; while in the second approach, the framework intelligently learns from the input evidences using a 2nu-granular support vector machine. The effectiveness of the unification approach is …", "num_citations": "54\n", "authors": ["464"]}
{"title": "A novel approach for short-term load forecasting using support vector machines\n", "abstract": " A support vector machine (SVM) modeling approach for short-term load forecasting is proposed. The SVM learning scheme is applied to the power load data, forcing the network to learn the inherent internal temporal property of power load sequence. We also study the performance when other related input variables such as temperature and humidity are considered. The performance of our proposed SVM modeling approach has been tested and compared with feed-forward neural network and cosine radial basis function neural network approaches. Numerical results show that the SVM approach yields better generalization capability and lower prediction error compared to those neural network approaches.", "num_citations": "51\n", "authors": ["464"]}
{"title": "Digital watermarking based secure multimodal biometric system\n", "abstract": " This paper presents a multimodal biometrics system using watermarking algorithms with two levels of security for simultaneously verifying an individual and protecting the biometric template. Iris template is watermarked in face, such that the face is visible for verification and the watermarked iris is used to cross authenticate the individual and secure the biometrics data as well. The accuracy of the multimodal biometrics system is around 96.8%. This system is also resistant to common attacks on biometric templates.", "num_citations": "47\n", "authors": ["464"]}
{"title": "Robust memory-efficient data level information fusion of multi-modal biometric images\n", "abstract": " This paper presents a novel multi-level wavelet based fusion algorithm that combines information from fingerprint, face, iris, and signature images of an individual into a single composite image. The proposed approach reduces the memory size, increases the recognition accuracy using multi-modal biometric features, and withstands common attacks such as smoothing, cropping, JPEG 2000, and filtering due to tampering. The fusion algorithm is validated using the verification algorithms we developed, existing algorithms, and commercial algorithm. In addition to our multi-modal database, experiments are also performed on other well known databases such as FERET face database and CASIA iris database. The effectiveness of the fusion algorithm is experimentally validated by computing the matching scores and the equal error rates before fusion, after reconstruction of biometric images, and when the composite …", "num_citations": "45\n", "authors": ["464"]}
{"title": "Combining pores and ridges with minutiae for improved fingerprint verification\n", "abstract": " This paper presents a fast fingerprint verification algorithm using level-2 minutiae and level-3 pore and ridge features. The proposed algorithm uses a two-stage process to register fingerprint images. In the first stage, Taylor series based image transformation is used to perform coarse registration, while in the second stage, thin plate spline transformation is used for fine registration. A fast feature extraction algorithm is proposed using the Mumford–Shah functional curve evolution to efficiently segment contours and extract the intricate level-3 pore and ridge features. Further, Delaunay triangulation based fusion algorithm is proposed to combine level-2 and level-3 information that provides structural stability and robustness to small changes caused due to extraneous noise or non-linear deformation during image capture. We define eight quantitative measures using level-2 and level-3 topological characteristics to form …", "num_citations": "44\n", "authors": ["464"]}
{"title": "Embedding biometric identifiers in 2D barcodes for improved security\n", "abstract": " Two-dimensional (2D) barcode symbology is an emerging technology used for compactly storing and retrieving information. These barcodes can be found on the back of drivers' licenses and are encoded with secure text data. Standard 2D barcode such as PDF417 uses upper and lowercase alphabets, numeric digits and special characters for encoding. Some barcodes also include a compressed photo of the individual. The visual quality of the compressed image is usually poor and occupies a large amount of space which greatly reduces the capacity needed for encoding text. This paper presents a novel approach for embedding uncompressed images in a standard PDF417 2D barcode using a blind digital watermarking technique. The text is encoded in the standard PDF417 format with error correction, while the face and fingerprint images are watermarked in the encoded 2D barcode. Experimental results show …", "num_citations": "43\n", "authors": ["464"]}
{"title": "Swapped! digital face presentation attack detection via weighted local magnitude pattern\n", "abstract": " Advancements in smartphone applications have empowered even non-technical users to perform sophisticated operations such as morphing in faces as few tap operations. While such enablements have positive effects, as a negative side, now anyone can digitally attack face (biometric) recognition systems. For example, face swapping application of Snapchat can easily create “swapped” identities and circumvent face recognition system. This research presents a novel database, termed as SWAPPED - Digital Attack Video Face Database, prepared using Snap chat's application which swaps/stitches two faces and creates videos. The database contains bonafide face videos and face swapped videos of multiple subjects. Baseline face recognition experiments using commercial system shows over 90% rank-1 accuracy when attack videos are used as probe. As a second contribution, this research also presents a …", "num_citations": "41\n", "authors": ["464"]}
{"title": "Improving verification accuracy by synthesis of locally enhanced biometric images and deformable model\n", "abstract": " In this paper, we propose a 2-stage preprocessing framework which consists of image enhancement and deformation techniques to increase the verification performance of image-based biometric systems. In the preprocessing framework, first the quality of biometric image is enhanced and then a deformation model is applied to minimize the variation between the two images to be matched. The proposed SVM image quality enhancement algorithm selects good quality regions from different globally enhanced images and combines them to generate a single high-quality feature-rich image. The proposed deformation algorithm is based on phase congruency information and locally minimizes the variations between two images while retaining the features required for recognition. The proposed algorithms are validated using face and iris biometrics as the two case studies. For performance evaluation, different face and …", "num_citations": "39\n", "authors": ["464"]}
{"title": "Highly robust biometric smart card design\n", "abstract": " An architecture of a highly reliable smart card is proposed. Dual on-chip biometric fingerprint sensors, implemented with different technologies, are integrated with the smart card architecture for increase security and reliability.", "num_citations": "39\n", "authors": ["464"]}
{"title": "Integrating image quality in 2ν-SVM biometric match score fusion\n", "abstract": " This paper proposes an intelligent 2ν-support vector machine based match score fusion algorithm to improve the performance of face and iris recognition by integrating the quality of images. The proposed algorithm applies redundant discrete wavelet transform to evaluate the underlying linear and non-linear features present in the image. A composite quality score is computed to determine the extent of smoothness, sharpness, noise, and other pertinent features present in each subband of the image. The match score and the corresponding quality score of an image are fused using 2ν-support vector machine to improve the verification performance. The proposed algorithm is experimentally validated using the FERET face database and the CASIA iris database. The verification performance and statistical evaluation show that the proposed algorithm outperforms existing fusion algorithms.", "num_citations": "37\n", "authors": ["464"]}
{"title": "Recognizing age-separated face images: Humans and machines\n", "abstract": " Humans utilize facial appearance, gender, expression, aging pattern, and other ancillary information to recognize individuals. It is interesting to observe how humans perceive facial age. Analyzing these properties can help in understanding the phenomenon of facial aging and incorporating the findings can help in designing effective algorithms. Such a study has two components - facial age estimation and age-separated face recognition. Age estimation involves predicting the age of an individual given his/her facial image. On the other hand, age-separated face recognition consists of recognizing an individual given his/her age-separated images. In this research, we investigate which facial cues are utilized by humans for estimating the age of people belonging to various age groups along with analyzing the effect of one's gender, age, and ethnicity on age estimation skills. We also analyze how various facial regions such as binocular and mouth regions influence age estimation and recognition capabilities. Finally, we propose an age-invariant face recognition algorithm that incorporates the knowledge learned from these observations. Key observations of our research are: (1) the age group of newborns and toddlers is easiest to estimate, (2) gender and ethnicity do not affect the judgment of age group estimation, (3) face as a global feature, is essential to achieve good performance in age-separated face recognition, and (4) the proposed algorithm yields improved recognition performance compared to existing algorithms and also outperforms a commercial system in the young image as probe scenario.", "num_citations": "36\n", "authors": ["464"]}
{"title": "Quality induced fingerprint identification using extended feature set\n", "abstract": " Automatic fingerprint identification systems use level-1 and level-2 features for fingerprint identification. However, forensic examiners utilize inherent level-3 details along with level-2 features. Existing level-3 feature extraction algorithms are computationally expensive to be used for identification. This paper presents a novel algorithm for fast level-3 feature extraction and identification. The algorithm starts with computing local image quality score using redundant discrete wavelet transform. A fast curve evolution algorithm is then used to extract four level-3 features namely, pores, ridge contours, dots, and incipient ridges. Along with level-1 and level-2 features, these level-3 features are used in a Delaunay triangulation based indexing algorithm. Finally, quality-based likelihood ratio is used to further improve the identification performance. Experiments conducted on a high resolution fingerprint database containing …", "num_citations": "34\n", "authors": ["464"]}
{"title": "Performance enhancement of 2D face recognition via mosaicing\n", "abstract": " We describe a face mosaicing scheme that generates a composite face image during enrollment based on the evidence provided by frontal and semi-profile face images of an individual. Face mosaicing obviates the need to store multiple face templates representing multiple poses of a user's face image. In the proposed scheme, the side profile images are aligned with the frontal image using a terrain transform that exploits neighborhood properties to determine the transformation relating the 2 images. Multiresolution splining is then used to blend the side profiles with the frontal image thereby generating a composite face image of the user. A local binary pattern matching algorithm is used to compare an input face image with the template face mosaic. Experiments conducted on a small dataset of 27 users indicate that face mosaicing as described in this paper offers significant benefits by accounting for the pose …", "num_citations": "34\n", "authors": ["464"]}
{"title": "Intelligent biometric information fusion using support vector machine\n", "abstract": " Abstract                              Biometrics is the process of verifying or identifying an individual using the person’s physiological and behavioral characteristics such as face, fingerprint, iris, signature, and gait. The main advantage of using biometrics for recognition is that it is unique for every individual and cannot be misplaced or forgotten. However, biometric systems that use a single biometric trait have to contend with noisy data, restricted degrees of freedom, failure to-enroll problems, spoof attacks, and unacceptable error rates. Various researchers have suggested that no single biometric modality can provide the protection required for high security applications [1] - [4]. To alleviate this problem and enhance the performance of a biometric system, information from different biometric sources are combined and such systems are known as multimodal biometric systems [2].", "num_citations": "33\n", "authors": ["464"]}
{"title": "Fusion of handcrafted and deep learning features for large-scale multiple iris presentation attack detection\n", "abstract": " Typical iris recognition systems may be vulnerable to presentation attacks such as textured contact lenses, print attacks, and synthetic iris images. Increasing applications of iris recognition have raised the importance of efficient presentation attack detection algorithms. In this paper, we propose a novel algorithm for detecting iris presentation attacks using a combination of handcrafted and deep learning based features. The proposed algorithm combines local and global Haralick texture features in multi-level Redundant Discrete Wavelet Transform domain with VGG features to encode the textural variations between real and attacked iris images. The proposed algorithm is extensively tested on a large iris dataset comprising more than 270,000 real and attacked iris images and yields a total error of 1.01%. The experimental evaluation demonstrates the superior presentation attack detection performance of the proposed algorithm as compared to state-of-the-art algorithms.", "num_citations": "32\n", "authors": ["464"]}
{"title": "Evolutionary granular approach for recognizing faces altered due to plastic surgery\n", "abstract": " Recognizing faces with altered appearances is a challenging task and is only now beginning to be addressed by researchers. The paper presents an evolutionary granular approach for matching face images that have been altered by plastic surgery procedures. The algorithm extracts discriminating information from non-disjoint face granules obtained at different levels of granularity. At the first level of granularity, both pre and post-surgery face images are processed by Gaussian and Laplacian operators to obtain face granules at varying resolutions. The second level of granularity divides face image into horizontal and vertical face granules of varying size and information content. At the third level of granularity, face image is tessellated into non-overlapping local facial regions. An evolutionary approach is proposed using genetic algorithm to simultaneously optimize the selection of feature extractor for each face …", "num_citations": "32\n", "authors": ["464"]}
{"title": "Biometric classifier update using online learning: A case study in near infrared face verification\n", "abstract": " The performance of a large scale biometric system may deteriorate over time as new individuals are continually enrolled. To maintain an acceptable level of performance, the classifier has to be re-trained offline in batch mode using both existing and new data. The process of re-training can be computationally expensive and time consuming. This paper presents a new biometric classifier update algorithm that incrementally re-trains the classifier using online learning and progressively establishes a decision hyperplane for improved classification. The proposed algorithm incorporates soft labels and granular computing in the formulation of a 2 ν-Online Granular Soft Support Vector Machine (SVM) to re-train the classifier using only the new data. Granular computing makes it adaptive to local and global variations in data distribution, while soft labels provide resilience to noise. Each time data is acquired, new support …", "num_citations": "32\n", "authors": ["464"]}
{"title": "Dempster-Shafer theory based classifier fusion for improved fingerprint verification performance\n", "abstract": " This paper presents a Dempster Shafer theory based classifier fusion algorithm to improve the performance of fingerprint verification. The proposed fusion algorithm combines decision induced match scores of minutiae, ridge, fingercode and pore based fingerprint verification algorithms and provides an improvement of at least 8.1% in the verification accuracy compared to the individual algorithms. Further, proposed fusion algorithm outperforms by at least 2.52% when compared with existing fusion algorithms. We also found that the use of Dempster’s rule of conditioning reduces the training time by approximately 191 seconds.", "num_citations": "31\n", "authors": ["464"]}
{"title": "Gender and ethnicity classification of iris images using deep class-encoder\n", "abstract": " Soft biometric modalities have shown their utility in different applications including reducing the search space significantly. This leads to improved recognition performance, reduced computation time, and faster processing of test samples. Some common soft biometric modalities are ethnicity, gender, age, hair color, iris color, presence of facial hair or moles, and markers. This research focuses on performing ethnicity and gender classification on iris images. We present a novel supervised auto-encoder based approach, Deep Class-Encoder, which uses class labels to learn discriminative representation for the given sample by mapping the learned feature vector to its label. The proposed model is evaluated on two datasets each for ethnicity and gender classification. The results obtained using the proposed Deep Class-Encoder demonstrate its effectiveness in comparison to existing approaches and state-of-the-art …", "num_citations": "30\n", "authors": ["464"]}
{"title": "Recognizing face images with disguise variations\n", "abstract": " Automatic face recognition, required in law enforcement applications such as surveillance, border security and forensic investigation, is a process in which an individual is identified or verified based on facial characteristics. Researchers have proposed several algorithms that can effectively recognize individuals in controlled environment with minor variations in pose, expression, and illumination (Zhao et al., 2003),(Li & Jain, 2005),(Wechsler, 2006),(Delac & Grgic, 2007). In recent face recognition test reports such as FRVT 2002, FRGC 2004, and FRGC 2006 (Philips et al., 2006 & Philips et al., 2007), the results show that under normal changes in constrained environment, the performance of existing face recognition systems is greatly enhanced. However, in most real world applications, images may not be of good quality or user may not be cooperative or there may be temporal variations and dissimilarities in facial characteristics that are artificially created using disguise accessories.Challenges in automatic face recognition can be classified into six categories: illumination, image quality, expression, pose, aging, and disguise. Among these challenges, recognition of faces with disguise is a major challenge and has only been recently addressed by few researchers (Alexander & Smith, 2003),(Ramanathan et al, 2004),(Silva & Rosa, 2003),(Singh et al., 2008). As shown in Fig. 1, the inter-personal and intra-personal characteristics can be modeled using disguise accessories to alter the appearance of an individual, to impersonate another person, or to hide one’s identity. For example, a criminal can alter facial features and appearance using …", "num_citations": "30\n", "authors": ["464"]}
{"title": "Textural feature based face recognition for single training images\n", "abstract": " A novel face recognition algorithm using single training face image is proposed. The algorithm is based on textural features extracted using the 2D log Gabor wavelet. These features are encoded into a binary pattern to form a face template which is used for matching. Experimental results show that on the colour FERET database the accuracy of the proposed algorithm is higher than the local feature analysis (LFA) and correlation filter (CF) based face recognition algorithms even when the number of training images is reduced to one. In comparison with recent single training image based face recognition algorithms, the proposed 2D log Gabor wavelet based algorithm shows an improvement of more than 3% in accuracy.", "num_citations": "30\n", "authors": ["464"]}
{"title": "Signature verification using static and dynamic features\n", "abstract": " A signature verification algorithm based on static and dynamic features of online signature data is presented. Texture and topological features are the static features of a signature image whereas the digital tablet captures in real-time the pressure values, breakpoints, and the time taken to create a signature. 1D – log Gabor wavelet and Euler numbers are used to analyze the textural and topological features of the signature respectively. A multi-classifier decision algorithm combines the results obtained from three feature sets to attain an accuracy of 98.18%.", "num_citations": "30\n", "authors": ["464"]}
{"title": "Comparing robustness of watermarking algorithms on biometrics data\n", "abstract": " Attacks on biometric templates are becoming common. Watermarking helps in template protection as well as facilitating multi-biometric verification. Several combinations of watermarks and cover images are possible. In this paper, we present the case where a face image is the cover and an iris code is used as a watermark. The effectiveness of selected watermarking techniques is evaluated by comparing the matching performance using face recognition and iris recognition algorithms. The robustness to various techniques is studied when the watermarked image is subjected to several attacks.", "num_citations": "30\n", "authors": ["464"]}
{"title": "Face recognition for look-alikes: A preliminary study\n", "abstract": " One of the major challenges efface recognition is to design a feature extractor and matcher that reduces the intra class variations and increases the inter-class variations. The feature extraction algorithm has to be robust enough to extract similar features for a particular subject despite variations in quality, pose, illumination, expression, aging, and disguise. The problem is exacerbated when there are two individuals with lower inter-class variations, i.e., look alikes. In such cases, the intra-class similarity is higher than the inter-class variation for these two individuals. This research explores the problem of look-alike faces and their effect on human performance and automatic face recognition algorithms. There is three fold contribution in this re search: firstly, we analyze the human recognition capabilities for look-alike appearances. Secondly, we compare human recognition performance with ten existing face recognition …", "num_citations": "29\n", "authors": ["464"]}
{"title": "Software reliability prediction using recurrent neural network with Bayesian regularization\n", "abstract": " A recurrent neural network modeling approach for software reliability prediction with respect to cumulative failure time is proposed. Our proposed network structure has the capability of learning and recognizing the inherent internal temporal property of cumulative failure time sequence. Further, by adding a penalty term of sum of network connection weights, Bayesian regularization is applied to our network training scheme to improve the generalization capability and lower the susceptibility of overfitting. The performance of our proposed approach has been tested using four real-time control and flight dynamic application data sets. Numerical results show that our proposed approach is robust across different software projects, and has a better performance with respect to both goodness-of-fit and next-step-predictability compared to existing neural network models for failure time prediction.", "num_citations": "29\n", "authors": ["464"]}
{"title": "Synthetic iris presentation attack using iDCGAN\n", "abstract": " Reliability and accuracy of iris biometric modality has prompted its large-scale deployment for critical applications such as border control and national ID projects. The extensive growth of iris recognition systems has raised apprehensions about susceptibility of these systems to various attacks. In the past, researchers have examined the impact of various iris presentation attacks such as textured contact lenses and print attacks. In this research, we present a novel presentation attack using deep learning based synthetic iris generation. Utilizing the generative capability of deep con-volutional generative adversarial networks and iris quality metrics, we propose a new framework, named as iDCGAN (iris deep convolutional generative adversarial network) for generating realistic appearing synthetic iris images. We demonstrate the effect of these synthetically generated iris images as presentation attack on iris recognition …", "num_citations": "28\n", "authors": ["464"]}
{"title": "QFuse: Online learning framework for adaptive biometric system\n", "abstract": " Biometrics, the science of verifying the identity of individuals, is increasingly being used in several applications such as assisting law enforcement agencies to control crime and fraud. Existing techniques are unable to provide significant levels of accuracy in uncontrolled noisy environments. Further, scalability is another challenge due to variations in data distribution with changing conditions. This paper presents an adaptive context switching algorithm coupled with online learning to address both these challenges. The proposed framework, termed as QFuse, uses the quality of input images to dynamically select the best biometric matcher or fusion algorithm to verify the identity of an individual. The proposed algorithm continuously updates the selection process using online learning to address the scalability and accommodate the variations in data distribution. The results on the WVU multimodal database and a …", "num_citations": "26\n", "authors": ["464"]}
{"title": "Face sketch matching via coupled deep transform learning\n", "abstract": " Face sketch to digital image matching is an important challenge of face recognition that involves matching across different domains. Current research efforts have primarily focused on extracting domain invariant representations or learning a mapping from one domain to the other. In this research, we propose a novel transform learning based approach termed as DeepTransformer, which learns a transformation and mapping function between the features of two domains. The proposed formulation is independent of the input information and can be applied with any existing learned or hand-crafted feature. Since the mapping function is directional in nature, we propose two variants of DeepTransformer:(i) semi-coupled and (ii) symmetrically-coupled deep transform learning. This research also uses a novel IIIT-D Composite Sketch with Age (CSA) variations database which contains sketch images of 150 subjects along with age-separated digital photos. The performance of the proposed models is evaluated on a novel application of sketch-to-sketch matching, along with sketch-to-digital photo matching. Experimental results demonstrate the robustness of the proposed models in comparison to existing state-of-the-art sketch matching algorithms and a commercial face recognition system.", "num_citations": "25\n", "authors": ["464"]}
{"title": "Face recognition captcha\n", "abstract": " CAPTCHA is one of the Turing tests used to classify human users and automated scripts. Existing CAPTCHAs, especially text-based CAPTCHAs, are used in many applications, however they pose challenges due to language dependency and high attack rates. In this paper, we propose a face recognition-based CAPTCHA as a potential solution. To solve the CAPTCHA, users must correctly find one pair of human face images, that belong to same subject, embedded in a complex background without selecting any nonface image or impostor pair. The proposed algorithm generates CAPTCHA that offer better human accuracy and lower attack rates compared to existing approaches.", "num_citations": "24\n", "authors": ["464"]}
{"title": "Short-term load forecasting using optimized neural network with genetic algorithm\n", "abstract": " An optimized neural network modeling approach with genetic algorithm for short-term load forecasting based on only multiple delayed historical power load data is proposed. Genetic algorithm is used to globally optimize the number of delayed input neurons and the number of neurons in the hidden layer of the neural network architecture. Modification of Levenberg-Marquardt algorithm with Bayesian regularization is used to improve the generalization ability of the neural network. The performance of our proposed approach has been compared using actual power load data sets. Numerical results show that our proposed power load forecasting approach is comparable to the existing approaches that use multiple input variables such as power load data, day type load patterns and weather conditions", "num_citations": "24\n", "authors": ["464"]}
{"title": "Supervised mixed norm autoencoder for kinship verification in unconstrained videos\n", "abstract": " Identifying kinship relations has garnered interest due to several applications such as organizing and tagging the enormous amount of videos being uploaded on the Internet. Existing research in kinship verification primarily focuses on kinship prediction with image pairs. In this research, we propose a new deep learning framework for kinship verification in unconstrained videos using a novel Supervised Mixed Norm AutoEncoder (SMNAE). This new autoencoder formulation introduces class-specific sparsity in the weight matrix. The proposed three-stage SMNAE based kinship verification framework utilizes the learned spatio-temporal representation in the video frames for verifying kinship in a pair of videos. A new kinship video (KIVI) database of more than 500 individuals with variations due to illumination, pose, occlusion, ethnicity, and expression is collected for this research. It comprises a total of 355 true kin …", "num_citations": "21\n", "authors": ["464"]}
{"title": "Quality-based fusion for multichannel iris recognition\n", "abstract": " We propose a quality-based fusion scheme for improving the recognition accuracy using color iris images characterized by three spectral channels - Red, Green and Blue. In the proposed method, quality scores are employed to select two channels of a color iris image which are fused at the image level using a Redundant Discrete Wavelet Transform (RDWT). The fused image is then used in a score-level fusion framework along with the remaining channel to improve recognition accuracy. Experimental results on a heterogenous color iris database demonstrate the efficacy of the technique when compared against other score-level and image-level fusion methods. The proposed method can potentially benefit the use of color iris images in conjunction with their NIR counterparts.", "num_citations": "21\n", "authors": ["464"]}
{"title": "Likelihood ratio in a svm framework: Fusing linear and non-linear face classifiers\n", "abstract": " The performance of score-level fusion algorithms is often affected by conflicting decisions generated by the constituent matchers/classifiers. This paper describes a fusion algorithm that incorporates the likelihood ratio test statistic in a support vector machine (SVM) framework in order to classify match scores originating from multiple matchers. The proposed approach also takes into account the precision and uncertainties of individual matchers. The resulting fusion algorithm is used to mitigate the effect of covariate factors in face recognition by combining the match scores of linear appearance-based face recognition algorithms with their non-linear counterparts. Experimental results on a heterogeneous face database of 910 subjects suggest that the proposed fusion algorithm can significantly improve the verification performance of a face recognition system. Thus, the contribution of this work is two-fold: (a) the design …", "num_citations": "21\n", "authors": ["464"]}
{"title": "Quality assessment based denoising to improve face recognition performance\n", "abstract": " A probe face image may contain noise due to environmental conditions, incorrect use of sensors or transmission error. The performance of face recognition severely depletes when the probe image is contaminated with noise. Denoising techniques can improve recognition performance, provided the correct parameters are used. In this paper, a parameter selection framework is presented. In the proposed framework, the optimal parameter set is selected for denoising using quality assessment algorithms with low complexity. Quality score based parameter selection is evaluated on the AR face dataset. A correlation study is discussed to ascertain the relationship between the quality scores and recognition rate. The experiments suggest that the proposed framework improves the performance both in terms of accuracy and computation time.", "num_citations": "20\n", "authors": ["464"]}
{"title": "Effect of illicit drug abuse on face recognition\n", "abstract": " Over the years, significant research has been undertaken to improve the performance of face recognition in the presence of covariates such as variations in pose, illumination, expressions, aging, and use of disguises. This paper highlights the effect of illicit drug abuse on facial features. An Illicit Drug Abuse Face (IDAF) database of 105 subjects has been created to study the performance on two commercial face recognition systems and popular face recognition algorithms. The experimental results show the decreased performance of current face recognition algorithms on drug abuse face images. This paper also proposes projective Dictionary learning based illicit Drug Abuse face Classification (DDAC) framework to effectively detect and separate faces affected by drug abuse from normal faces. This important pre-processing step stimulates researchers to develop a new class of face recognition algorithms …", "num_citations": "19\n", "authors": ["464"]}
{"title": "FR-CAPTCHA: CAPTCHA based on recognizing human faces\n", "abstract": " A Completely Automated Public Turing test to tell Computers and Humans Apart (CAPTCHA) is designed to distinguish humans from machines. Most of the existing tests require reading distorted text embedded in a background image. However, many existing CAPTCHAs are either too difficult for humans due to excessive distortions or are trivial for automated algorithms to solve. These CAPTCHAs also suffer from inherent language as well as alphabet dependencies and are not equally convenient for people of different demographics. Therefore, there is a need to devise other Turing tests which can mitigate these challenges. One such test is matching two faces to establish if they belong to the same individual or not. Utilizing face recognition as the Turing test, we propose FR-CAPTCHA based on finding matching pairs of human faces in an image. We observe that, compared to existing implementations, FR-CAPTCHA achieves a human accuracy of 94% and is robust against automated attacks.", "num_citations": "19\n", "authors": ["464"]}
{"title": "On co-training online biometric classifiers\n", "abstract": " In an operational biometric verification system, changes in biometric data over a period of time can affect the classification accuracy. Online learning has been used for updating the classifier decision boundary. However, this requires labeled data that is only available during new enrolments. This paper presents a biometric classifier update algorithm in which the classifier decision boundary is updated using both labeled enrolment instances and unlabeled probe in- stances. The proposed co-training online classifier update algorithm is presented as a semi-supervised learning task and is applied to a face verification application. Experiments indicate that the proposed algorithm improves the performance both in terms of classification accuracy and computational time.", "num_citations": "19\n", "authors": ["464"]}
{"title": "Between-subclass piece-wise linear solutions in large scale kernel SVM learning\n", "abstract": " The paper proposes a novel approach for learning kernel Support Vector Machines (SVM) from large scale data with reduced computation time. The proposed approach, termed as Subclass Reduced Set SVM (SRS-SVM), utilizes the subclass structure of data to effectively estimate the candidate support vector set. Since the candidate support vector set cardinality is only a fraction of the training set cardinality, learning SVM from the former requires less time without significantly changing the decision boundary. SRS-SVM depends on a domain knowledge related input parameter, i.e., number of subclasses. To reduce the domain knowledge dependency and to make the approach less sensitive to the subclass parameter, we extend the proposed SRS-SVM to create a robust and improved hierarchical model termed as the Hierarchical Subclass Reduced Set SVM (HSRS-SVM). Since SRS-SVM and HSRS-SVM splits …", "num_citations": "17\n", "authors": ["464"]}
{"title": "Multiple projective dictionary learning to detect plastic surgery for face verification\n", "abstract": " Researchers have shown that the changes in face features due to plastic surgery can be modeled as a covariate that reduces the ability of algorithms to recognize a person's identity. Traditional dictionary learning methods learn a sparse representation using I 0  and I 1  norms that are computationally expensive. This paper presents a multiple projective dictionary learning (MPDL) framework that does not require the computation of I 0  and I 1  norms. We propose a novel solution to discriminate plastic surgery faces from regular faces by learning representations of local and global plastic surgery faces using multiple projective dictionaries and by using compact binary face descriptors. Experimental results on the plastic surgery database show that the proposed MPDL framework is able to detect plastic surgery faces with a high accuracy of 97.96%. To verify the identity of a person, the detected plastic surgery faces …", "num_citations": "17\n", "authors": ["464"]}
{"title": "A framework for quality-based biometric classifier selection\n", "abstract": " Multibiometric systems fuse the evidence (e.g., match scores) pertaining to multiple biometric modalities or classifiers. Most score-level fusion schemes discussed in the literature require the processing (i.e., feature extraction and matching) of every modality prior to invoking the fusion scheme. This paper presents a framework for dynamic classifier selection and fusion based on the quality of the gallery and probe images associated with each modality with multiple classifiers. The quality assessment algorithm for each biometric modality computes a quality vector for the gallery and probe images that is used for classifier selection. These vectors are used to train Support Vector Machines (SVMs) for decision making. In the proposed framework, the bio- metric modalities are arranged sequentially such that the stronger biometric modality has higher priority for being processed. Since fusion is required only when all …", "num_citations": "17\n", "authors": ["464"]}
{"title": "Simultaneous latent fingerprint recognition\n", "abstract": " Simultaneous latent fingerprints are clusters of friction ridge impressions deposited concurrently in a crime scene. The analysis of these impressions is a complex task to infer individualization, exclusion or categorize as inconclusive. The problem is further compounded when distinctive features in each latent fingerprint in the cluster are of varying quality or none of the fingerprint has the requisite number of features to reliably arrive at a conclusion. Recently, SWGFAST (Scientific Working Group on Friction Ridge Analysis, Study and Technology) proposed a draft standard for simultaneous impression examination. The approach is manual and requires known reference ten-print for comparing with an unknown simultaneous latent fingerprint. This paper proposes a semi-automatic approach to process and analyze simultaneous latent fingerprints. The proposed algorithm demonstrates that comparisons can be made …", "num_citations": "17\n", "authors": ["464"]}
{"title": "An improved digital watermarking technique for protecting JPEG images\n", "abstract": " A new semi-blind digital watermarking technique is proposed using the modified discrete cosine transformation (MDCT). The results show that the quality of the watermarked image is high and is robust to compression, noise, filtering and geometric transformations.", "num_citations": "17\n", "authors": ["464"]}
{"title": "Multistage software estimation\n", "abstract": " This paper proposes a COCOMO-based multistage software estimation approach. In the first stage, Monte-Carlo simulation is used to identify the key cost drivers in COCOMO II model, which contribute most to the variance of the software effort prediction. In the second stage, six selected cost drivers, as fuzzy inputs, are fed into three fuzzy expert systems to get the effort multiplier estimation. An empirical case study is used to evaluate the simulation results. Numerical data analyses show that the proposed multistage fuzzy logic model is quite encouraging compared to original COCOMO II approach.", "num_citations": "17\n", "authors": ["464"]}
{"title": "SVM based adaptive biometric image enhancement using quality assessment\n", "abstract": " The quality of input data has an important role in the performance of a biometric system. Images such as fingerprint and face captured under non-ideal conditions may require additional preprocessing. This chapter presents intelligent SVM techniques for quality assessment and enhancement. The proposed quality assessment algorithm associates the quantitative quality score of the image that has a specific type of irregularity such as noise, blur, and illumination. This enables the application of the most appropriate quality enhancement algorithm on the non-ideal image. We further propose a SVM quality enhancement algorithm which simultaneously applies selected enhancement algorithms to the original image and selects the best quality regions from the global enhanced image. These selected regions are used to generate single high quality image. The performance of the proposed algorithms is validated by …", "num_citations": "16\n", "authors": ["464"]}
{"title": "Detecting textured contact lens in uncontrolled environment using DensePAD\n", "abstract": " The ubiquitous use of smartphones has spurred the research in mobile iris devices. Due to their convenience, these mobile devices are also utilized in unconstrained outdoor conditions. This scenario has necessitated the development of reliable iris recognition algorithms for such an uncontrolled environment. Additionally, iris presentation attacks such as textured contact lens pose a major challenge to current iris recognition systems. Motivated by these, this paper presents two key contributions. First, a new Unconstrained Multi-sensor Iris Presentation Attack (UnMIPA) database is created. It consists of more than 18,000 iris images of subjects wearing textured contact lens and without wearing contact lenses captured in both indoor and outdoor environment using multiple iris sensors. The second contribution of this paper is a novel algorithm, DensePAD, which utilizes DenseNet based convolutional neural network architecture for iris presentation attack detection. In-depth experimental evaluation of this algorithm reveals its superior performance in detecting iris presentation attack images on multiple databases. The performance of the proposed DensePAD algorithm is also evaluated in real-world scenarios of open-set iris presentation attacks which highlights the challenging nature of detecting iris presentation attack images from unseen distributions.", "num_citations": "15\n", "authors": ["464"]}
{"title": "Review of iris presentation attack detection competitions\n", "abstract": " Biometric recognition systems have been shown to be susceptible to presentation attacks, the use of an artificial biometric in place of a live biometric sample from a genuine user. Presentation Attack Detection (PAD) is suggested as a solution to this vulnerability. The LivDet-Iris—Iris Liveness Detection Competition started in 2013 strives to showcase the state-of-the- art in presentation attack detection by assessing the software-based iris PAD methods (Part 1), as well as hardware-based iris PAD methods (Part 2) against multiple datasets of spoof and live fingerprint images. These competitions have been open to all institutions, industrial and academic, and competitors which can enter as either anonymous or using the name of their institution. There have been two previous fingerprint competitions through LivDet; 2013 and 2015. LivDet-Iris 2017 is being conducted during 2017. LivDet-Iris has maintained a …", "num_citations": "15\n", "authors": ["464"]}
{"title": "DS theory based fingerprint classifier fusion with update rule to minimize training time\n", "abstract": " This paper presents a novel fingerprint classifier fusion algorithm using Dempster-Shafer theory concomitant with update rule. The proposed algorithm accurately matches fingerprint evidences and also efficiently adapts to dynamically evolving database size without compromising accuracy or speed. We experimentally validate our approach using three fingerprint recognition algorithms based on minutiae, ridges, and image pattern features. The performance of our proposed algorithm is compared with these individual fingerprint algorithms and commonly used fusion algorithms. In all cases, the proposed Dempster Shafer theory with update rule outperforms existing algorithms even with partial fingerprint image. We also show that as the database size increases, the proposed algorithm is designed to operate on only the augmented data instead of the entire database, thereby reducing the training time without compromising the verification accuracy.", "num_citations": "15\n", "authors": ["464"]}
{"title": "Denoising and Segmentation of 3D Brain Images.\n", "abstract": " This paper presents an algorithm for medical 3D image denoising and segmentation using redundant discrete wavelet transform. First, we present a two stage denoising algorithm using the image fusion concept. The algorithm starts with globally denoising the brain images (3D volume) using Perona Malik’s algorithm and RDWT based algorithms followed by combining the outputs using entropy based fusion approach. Next, a region segmentation algorithm is proposed using texture information and k-means clustering. The proposed algorithms are evaluated using brain 3D image/volume data. The results suggest that the proposed algorithms provide improved performance compared to existing algorithms.", "num_citations": "14\n", "authors": ["464"]}
{"title": "Iris presentation attack via textured contact lens in unconstrained environment\n", "abstract": " The widespread use of smartphones has spurred the research in mobile iris devices. Due to their convenience, these mobile devices are also utilized in unconstrained outdoor scenarios. This has necessitated the development of reliable iris recognition algorithms for such uncontrolled environment. At the same time, iris presentation attacks pose a major challenge to current iris recognition systems. It has been shown that print attacks and textured contact lens may significantly degrade the iris recognition performance. Motivated by these factors, we present a novel Mobile Uncontrolled Iris Presentation Attack Database (MUIPAD). The database contains more than 10,000 iris images that are acquired with and without textured contact lenses in indoor and outdoor environments using a mobile sensor. We also investigate the efficacy of textured contact lens in identity impersonation and obfuscation. Moreover, we …", "num_citations": "13\n", "authors": ["464"]}
{"title": "Face verification with disguise variations via deep disguise recognizer\n", "abstract": " The performance of current automatic face recognition algorithms is hindered by different covariates such as facial aging, disguises, and pose variations. Specifically, disguises are employed for intentional or unintentional modifications in the facial appearance for hiding one's own identity or impersonating someone else's identity. In this paper, we utilize deep learning based transfer learning approach for face verification with disguise variations. We employ residual Inception network framework with center loss for learning inherent face representations. The training for the Inception-ResNet model is performed using a large-scale face database which is followed by inductive transfer learning to mitigate the impact of facial disguises. To evaluate the performance of the proposed Deep Disguise Recognizer (DDR) framework, Disguised Faces in the Wild and IIIT-Delhi Disguise Version 1 face databases are used. Experimental evaluation reveals that for the two databases, the proposed DDR framework yields 90.36% and 66.9% face verification accuracy at the false accept rate of 10%.", "num_citations": "13\n", "authors": ["464"]}
{"title": "fgCaptcha: genetically optimized face image Captcha 5\n", "abstract": " The increasing use of smartphones, tablets, and other mobile devices poses a significant challenge in providing effective online security. CAPTCHAs, tests for distinguishing human and computer users, have traditionally been popular; however, they face particular difficulties in a modern mobile environment because most of them rely on keyboard input and have language dependencies. This paper proposes a novel image-based CAPTCHA that combines the touch-based input methods favored by mobile devices with genetically optimized face detection tests to provide a solution that is simple for humans to solve, ready for worldwide use, and provides a high level of security by being resilient to automated computer attacks. In extensive testing involving over 2600 users and 40000 CAPTCHA tests, fgCAPTCHA demonstrates a very high human success rate while ensuring a 0% attack rate using three well-known …", "num_citations": "13\n", "authors": ["464"]}
{"title": "Belief function theory based biometric match score fusion: Case studies in multi-instance and multi-unit iris verification\n", "abstract": " This paper presents a framework for multi-biometric match score fusion when non-ideal conditions cause conflict in the results of different classifiers. The proposed framework uses belief function theory to effectively fuse the match scores and density estimation technique to compute the belief assignments. Fusion is performed using belief models such as transferable belief model (TBM) and proportional conflict redistribution (PCR) rule followed by the likelihood ratio based decision making. Experimental results on multi-instance and multi-unit iris verification show that the proposed fusion framework with PCR rule yields the best verification accuracy even when individual biometric classifiers provide highly conflicting match scores.", "num_citations": "12\n", "authors": ["464"]}
{"title": "Context switching algorithm for selective multibiometric fusion\n", "abstract": " This paper presents a multimodal biometric fusion algorithm that supports biometric image quality and case-based context switching approach for selecting appropriate constituent unimodal traits and fusion algorithms. Depending on the quality of input samples, the proposed algorithm intelligently selects appropriate fusion algorithm for optimal performance. Experiments and correlation analysis on a multimodal database of 320 subjects show that the context switching algorithm improves the verification performance both in terms of accuracy and time.", "num_citations": "11\n", "authors": ["464"]}
{"title": "Fingerprint Indexing using Minutiae and Pore Features.\n", "abstract": " In this paper, we propose level-2 and level-3 feature based fingerprint indexing algorithm to improve the speed and accuracy of identification. Indexing parameters are computed using the minutiae and pore features. The identification performance is further improved by incorporating Dempster Shafer theory based match score fusion algorithm. Experimental results on a high resolution fingerprint database show that the proposed algorithm improves the identification performance by at least 10% compared to existing fingerprint identification algorithms.", "num_citations": "11\n", "authors": ["464"]}
{"title": "On matching skulls to digital face images: A preliminary approach\n", "abstract": " Forensic application of automatically matching skull with face images is an important research area linking biometrics with practical applications inforensics. It is an opportunity for biometrics and face recognition researchers to help the law enforcement and forensic experts in giving an identity to unidentified human skulls. It is an extremely challenging problem which is further exacerbated due to lack of any publicly available database related to this problem. This is the first research in this direction with a twofold contribution: (i) introducing the first of its kind skull-face image pair database, Identify Me, and (ii) presenting a preliminary approach using the proposed semi-supervised formulation of transform learning. The experimental results and comparison with existing algorithms showcase the challenging nature of the problem. We assert that the availability of the database will inspire researchers to build sophisticated …", "num_citations": "9\n", "authors": ["464"]}
{"title": "Attack-resistant aiCAPTCHA using a negative selection artificial immune system\n", "abstract": " The growth of online services has resulted in a great need for tools to secure systems from would-be attackers without compromising the user experience. CAPTCHAs (Completely Automated Public Turing Tests to Tell Computers and Humans Apart) are one tool for this purpose, but their popular text-based form has been rendered insecure by improvements in character recognition technology. In this paper, we propose a novel imagebased CAPTCHA which employs object recognition as its test. Inspired by the negative selection approach in biological immune systems, an innovative two-phase filtering algorithm is proposed which ensures that the CAPTCHA is resilient to automated attack while remaining easy for human users to solve. In extensive testing involving over 3,000 participants, the proposed aiCAPTCHA achieved a 92.0% human success rate.", "num_citations": "9\n", "authors": ["464"]}
{"title": "A multibiometrics-based CAPTCHA for improved online security\n", "abstract": " CAPTCHA (Completely Automated Public Turing Test to tell Computers and Humans Apart) have been a common tool for preventing unauthorized access to websites for over a decade, but increasingly sophisticated optical character recognition algorithms and attack strategies have rendered traditional CAPTCHAs insecure. In this paper, we propose a new CAPTCHA incorporating multiple biometric modalities. Users are asked to identify faces, eyes, and fingerprints in a complex composite image. With over 1,900 volunteers and 30,000+ attempts, the proposed approach achieves high human accuracy while being resistant to existing attacks on CAPTCHAs and to detection by state-of-the-art software.", "num_citations": "9\n", "authors": ["464"]}
{"title": "A reconfigurable distributed multiagent system optimized for scalability\n", "abstract": " This thesis proposes a novel solution for optimizing the size and communication overhead of a distributed multiagent system without compromising the performance. The proposed approach addresses the challenges of scalability especially when the multiagent system is large. A modified spectral clustering technique is used to partition a large network into logically related clusters. Agents are assigned to monitor dedicated clusters rather than monitor each device or node. The proposed scalable multiagent system is implemented using JADE (Java Agent Development Environment) for a large power system. The performance of the proposed topology-independent decentralized multiagent system and the scalable multiagent system is compared by comprehensively simulating different fault scenarios. The time taken for reconfiguration, the overall computational complexity, and the communication overhead incurred …", "num_citations": "9\n", "authors": ["464"]}
{"title": "Multiclass mv-granular soft support vector machine: A case study in dynamic classifier selection for multispectral face recognition\n", "abstract": " This paper presents a novel formulation of multiclass support vector machine by integrating the concepts of soft labels and granular computing. The proposed multiclass mv-granular soft support vector machine uses soft labels to address the issues due to noisy and incorrectly labeled data, and granular computing to make it adaptable to data distributions both globally and locally. The proposed multiclass classifier is used for dynamic selection in a multispectral face recognition application. Specifically, for the given probe face images, mv-GSSVM is used to optimally choose one of the four options: visible spectrum face recognition, short-wave infrared face recognition, multispectral face image fusion, and multispectral match score fusion. Experimental results on a multispectral face database show that the proposed algorithm improves the verification accuracy and also decreases the computational time.", "num_citations": "9\n", "authors": ["464"]}
{"title": "Novel hybrid mitigation strategy for improving the resiliency of hierarchical networks subjected to attacks\n", "abstract": " This paper studies the resiliency of hierarchical networks when subjected to random errors, static attacks, and cascade attacks. The performance is compared with existing Erdös–Rényi (ER) random networks and Barabasi and Albert (BA) scale-free networks using global efficiency as the common performance metric. The results show that critical infrastructures modeled as hierarchical networks are intrinsically efficient and are resilient to random errors, however they are more vulnerable to targeted attacks than scale-free networks. Based on the response dynamics to different attack models, we propose a novel hybrid mitigation strategy that combines discrete levels of critical node reinforcement with additional edge augmentation. The proposed modified topology takes advantage of the high initial efficiency of the hierarchical network while also making it resilient to attacks. Experimental results show that when the …", "num_citations": "9\n", "authors": ["464"]}
{"title": "Computational intelligence methods in software reliability prediction\n", "abstract": " Computational intelligence methods are evolving collections of methodologies, which adopt tolerance for imprecision, uncertainty, and partial truth to obtain robustness, tractability, and low cost. Fuzzy logic, neural networks, genetic algorithm and evolutionary computation are the most important key methodologies. These advanced knowledge processing methods have recently gained more and more attention and have been successfully applied in wide varieties of application fields, such as aerospace, communication systems, consumer appliances, electric power operation systems, manufacturing automation and robotics, process engineering, transportation systems, and software measurement and estimation. Fuzzy logic modeling is a white box approach, assuming that there is already human knowledge about a solution. Fuzzy logic modeling can deal with the imprecision of the input and output variables directly …", "num_citations": "9\n", "authors": ["464"]}
{"title": "Electronic product design and manufacture in a concurrent engineering environment\n", "abstract": " The authors describe a concurrent engineering approach to meet the highly competitive needs of today's consumer electronics industry by providing the capability of predicting, analyzing and making decisions on design, test, manufacturing, marketing and cost-related issues during the early phases of the product life cycle. The methodology of developing a high quality product by coordinating team efforts within a specific discipline and also among multiple disciplines such as electrical, mechanical, marketing, materials and manufacturing is presented. The design of a multi-function electronic display board is discussed. The general development process from concept to manufacture is outlined covering issues related to multiple disciplines and specifically focusing on the manufacturing issues.< >", "num_citations": "9\n", "authors": ["464"]}
{"title": "Online learning in biometrics: A case study in face classifier update\n", "abstract": " In large scale applications, hundreds of new subjects may be regularly enrolled in a biometric system. To account for the variations in data distribution caused by these new enrollments, biometric systems require regular re-training which usually results in a very large computational overhead. This paper formally introduces the concept of online learning in biometrics. We demonstrate its application in classifier update algorithms to re-train classifier decision boundaries. Specifically, the algorithm employs online learning technique in a 2nu-granular soft support vector machine for rapidly training and updating face recognition systems. The proposed online classifier is used in a face recognition application for classifying genuine and impostor match scores impacted by different covariates. Experiments on a heterogeneous face database of 1,194 subjects show that the proposed online classifier not only improves the …", "num_citations": "8\n", "authors": ["464"]}
{"title": "Expression classification in children using mean supervised deep Boltzmann Machine\n", "abstract": " Automated facial expression classification has widespread application in multiple domains such as human computer interaction, health and entertainment, biometrics, and security. There are six basic facial expressions: Anger, Disgust, Fear, Happiness, Sadness, and Surprise, apart from a neutral state. Most of the research in expression classification has focused on adult face images, with no dedicated research on automating expression classification for children. To the best of our knowledge, this is the first research which presents a deep learning based expression classification approach for children. A novel supervised deep learning formulation, termed as Mean Supervised Deep Boltzmann Machine (msDBM) is proposed which classifies an input face image into one of the seven expression classes. The proposed approach has been evaluated on two child face datasets-Radboud Faces and CAFE, along with experiments on the adult face images of the Radboud Faces dataset. Experimental results and analysis reinforces the challenging nature of the task at hand, and the effectiveness of the proposed msDBM model.", "num_citations": "7\n", "authors": ["464"]}
{"title": "Modeling distributed software defect removal effectiveness in the presence of code churn\n", "abstract": " Two types of discrete defect removal models that consider the dynamics of code churn behavior during software testing phases under distributed software development environment are proposed. The first model is based on a sequential debugging process, while the second model is based on an iterative debugging process during each testing phase. The mathematical relationship between the number of defects detected during a testing phase and the total estimated remaining defects at the end of the same testing phase for both models are elaborated in detail. The defect detection ratio is identified to have the greatest contribution to the variance of the estimated number of remaining defects based on the sensitivity analysis using Monte-Carlo simulation. Using the proposed models, we quantitatively show how to estimate the number of defects by varying the defect detection ratio, defect correction ratio, the …", "num_citations": "7\n", "authors": ["464"]}
{"title": "An improved method to watermark images sensitive to blocking artifacts\n", "abstract": " A new digital watermarking technique for images that are sensitive to blocking artifacts is presented. Experimental results show that the proposed MDCT based approach produces highly imperceptible watermarked images and is robust to attacks such as compression, noise, filtering and geometric transformations. The proposed MDCT watermarking technique is applied to fingerprints for ensuring security. The face image and demographic text data of an individual are used as multiple watermarks. An AFIS system was used to quantitatively evaluate the matching performance of the MDCT-based watermarked fingerprint. The high fingerprint matching scores show that the MDCT approach is resilient to blocking artifacts. The quality of the extracted face and extracted text images was computed using two human visual system metrics and the results show that the image quality was high.", "num_citations": "7\n", "authors": ["464"]}
{"title": "Computer-based multimedia video conferencing system\n", "abstract": " An affordable system level design of a practically prototyped computer-based desktop video conferencing (DVC) system that is capable of delivering full motion analog audio and video is presented. The DVC system is designed to exchange full motion analog video and audio among conference participants using point-to-point and multipoint communication. It is capable of interfacing directly with a codec for video conferencing in the digital domain. The main advantages of this system are low cost, flexibility, and the ability to share applications in an effective manner. The proposed DVC system has been implemented to support 12 users and one additional video/audio input for viewing external television broadcasts.< >", "num_citations": "7\n", "authors": ["464"]}
{"title": "Unconstrained visible spectrum iris with textured contact lens variations: Database and benchmarking\n", "abstract": " Iris recognition in visible spectrum has developed into an active area of research. This has elevated the importance of efficient presentation attack detection algorithms, particularly in security based critical applications. In this paper, we present the first detailed analysis of the effect of textured contact lenses on iris recognition in visible spectrum. We introduce the first contact lens database in visible spectrum, Unconstrained Visible Contact Lens Iris (UVCLI) Database, containing samples from 70 classes with subjects wearing textured contact lenses in indoor and outdoor environments across multiple sessions. We observe that textured contact lenses degrade the visible spectrum iris recognition performance by over 25% and thus, may be utilized intentionally or unintentionally to attack existing iris recognition systems. Next, three iris presentation attack detection (PAD) algorithms are evaluated on the proposed …", "num_citations": "6\n", "authors": ["464"]}
{"title": "Simultaneous latent fingerprint recognition: A preliminary study\n", "abstract": " Recent cases such as Commonwealth v Patterson show that there is a lack of research in how to process and recognize simultaneous fingerprint impressions, especially when none of the latent prints in the cluster could be individually matched. SWGFAST released the first version of the standard on simultaneous impression examination that can help fingerprint examiners to systematically compare latent simultaneous impressions to a known ten-print card. However, when the individual is not known, the simultaneous fingerprint impressions have to be compared using a large database of reference ten-prints, making the process very challenging. This paper introduces the research problem of identifying simultaneous latent fingerprint impressions to the community and presents a semi-automatic approach to process the impressions of any individual. The approach generates a list of top matches and latent fingerprint …", "num_citations": "6\n", "authors": ["464"]}
{"title": "Secure distribution of heterogeneous multimedia content on the internet\n", "abstract": " This paper presents an architecture for a distributed conditional access system with multiple service providers. The standard XML digital signature and XML encryption techniques are applied to ensure secure distribution of audio, video, image and data on the web. The proposed approach seamlessly integrates the payment transactions with content delivery in a secure environment.", "num_citations": "6\n", "authors": ["464"]}
{"title": "Learning a shared transform model for skull to digital face image matching\n", "abstract": " Human skull identification is an arduous task, traditionally requiring the expertise of forensic artists and anthropologists. This paper is an effort to automate the process of matching skull images to digital face images, thereby establishing an identity of the skeletal remains. In order to achieve this, a novel Shared Transform Model is proposed for learning discriminative representations. The model learns robust features while reducing the intra-class variations between skulls and digital face images. Such a model can assist law enforcement agencies by speeding up the process of skull identification, and reducing the manual load. Experimental evaluation performed on two pre-defined protocols of the publicly available IdentifyMe dataset demonstrates the efficacy of the proposed model.", "num_citations": "5\n", "authors": ["464"]}
{"title": "Matching digital and scanned face images with age variation\n", "abstract": " Existing face recognition systems have demonstrated success in constrained settings with limited variability in illumination, pose, and expression. However, these incremental improvements are not sufficient to transcend the challenging applications such as identifying missing persons or matching individuals with photo ID. These applications require recognition of face images with aging variations and matching digital to scanned photo images. This paper presents a preprocessing framework to enhance the quality of the input scanned and digital face images and minimize the aging differences. Three face recognition algorithms are used to evaluate the efficacy of the proposed framework. Experimental results computed on a digital and scanned database of 310 subjects show that the framework improves the accuracy of all three algorithms by minimizing the quality differences and the variations due to aging.", "num_citations": "5\n", "authors": ["464"]}
{"title": "Image-based face detection CAPTCHA for improved security\n", "abstract": " In this paper, we propose a novel image-based completely automated public turing test to tell computers and humans apart (CAPTCHA) that relies on detecting human faces to provide an additional layer of security in web-based services. Face images were selected from the CMU face database and subjected to different types of distortions at different intensity levels to make the automatic face detection very challenging. An extensive experimental study involving 1,100 individuals was undertaken to determine the efficacy of the proposed approach and evaluate the performance of humans compared to computers. We also used two image quality metrics to objectively study the characteristics of the composite CAPTCHA images. Unlike a text-based CAPTCHA, a major benefit of the proposed image-based face detection CAPTCHA is that it does not have any language barriers. In addition, the proposed CAPTCHA can …", "num_citations": "5\n", "authors": ["464"]}
{"title": "Modeling the reliability of large dynamic distributed non-homogeneous networks\n", "abstract": " The Internet has revolutionized the way information is processed. It can be modeled as an ultra-large scale, amorphous, non-homogeneous network. Several studies on the reliability of large-scale gracefully degradable systems have been undertaken. Much of the work has focused on the study of static homogeneous, massively parallel, fault-tolerant networks [7], such as hypercubes [5, 8], and multistage interconnection networks [1, 4]. However, the Internet can be viewed as a large dynamic non-homogeneous network with varying number of computers connected at any given time. It comprises of different types of computers, and communicates with an interconnection schema which is constantly changing. The Internet has the inherent attribute of a gracefully degradable network. The degradation of networks can be measured", "num_citations": "5\n", "authors": ["464"]}
{"title": "Elimination of visual artifacts in digital image watermarking\n", "abstract": " A new digital watermarking technique is proposed for still images in the modified discrete cosine transform (MDCT) domain. Most of the existing image and video watermarking algorithms use block transformations that introduce blocking artifacts, causing perceptible distortions. MDCT has better coding performance compared to DCT and also the computational complexity of MDCT has been reduced in recent years compared to wavelets. We investigate the use of MDCT in digital watermarking.", "num_citations": "5\n", "authors": ["464"]}
{"title": "Microcontroller compatible clock chip design using field programmable gate array\n", "abstract": " The design and implementation of a microcontroller-compatible real-time clock using a field programmable gate array are presented. The advantage of rapidly prototyping an IC chip design according to user-defined specifications is demonstrated. The chip design is directly interfaced with 10 seven-segment light-emitting diodes for displaying time and calendar information. Translating the clock function to an external peripheral allows the microcontroller to perform other tasks more efficiently. The relatively short cycle time to develop a product from concept to the final chip is described.< >", "num_citations": "5\n", "authors": ["464"]}
{"title": "Supervised cosmos autoencoder: Learning beyond the euclidean loss!\n", "abstract": " Autoencoders are unsupervised deep learning models used for learning representations. In literature, autoencoders have shown to perform well on a variety of tasks spread across multiple domains, thereby establishing widespread applicability. Typically, an autoencoder is trained to generate a model that minimizes the reconstruction error between the input and the reconstructed output, computed in terms of the Euclidean distance. While this can be useful for applications related to unsupervised reconstruction, it may not be optimal for classification. In this paper, we propose a novel Supervised COSMOS Autoencoder which utilizes a multi-objective loss function to learn representations that simultaneously encode the (i) \"similarity\" between the input and reconstructed vectors in terms of their direction, (ii) \"distribution\" of pixel values of the reconstruction with respect to the input sample, while also incorporating (iii) \"discriminability\" in the feature learning pipeline. The proposed autoencoder model incorporates a Cosine similarity and Mahalanobis distance based loss function, along with supervision via Mutual Information based loss. Detailed analysis of each component of the proposed model motivates its applicability for feature learning in different classification tasks. The efficacy of Supervised COSMOS autoencoder is demonstrated via extensive experimental evaluations on different image datasets. The proposed model outperforms existing algorithms on MNIST, CIFAR-10, and SVHN databases. It also yields state-of-the-art results on CelebA, LFWA, Adience, and IJB-A databases for attribute prediction and face recognition, respectively.", "num_citations": "4\n", "authors": ["464"]}
{"title": "Real time fault tolerant control of robot manipulators\n", "abstract": " The complexity of computing the generalized forces or torques acting at the joints of a robot manipulator with n degrees of freedom directly effects the speed and accuracy of control. For real-time robust control, the large number of mathematical computations performed must satisfy the speed requirements and must also be error-free. In this paper, a combination of parallel and distributed processing techniques are proposed to compute the generalized forces using the Lagrangian formulation. The complexity of computation is reduced from the order θ(n3) to θ(n). It is shown that with minor modification in the architecture, all single errors that occur during computation can be detected, located, and corrected for robust control.", "num_citations": "4\n", "authors": ["464"]}
{"title": "Software metrics for real-time systems using fuzzy sets\n", "abstract": " The recent development of COSMIC-FFP (Common Software Measurement International Consortium) as a functional size measurement metric has greatly improved the estimation of real-time systems. This research attempts to develop effort estimation methods to complement the COSMIC-FFP by fuzzy set based generalization of effort models. The two methods used to achieve this are the fuzzy set model and the fuzzy linear regression model.", "num_citations": "4\n", "authors": ["464"]}
{"title": "Poster: Adaptcha: An adaptive captcha for improved user experience\n", "abstract": " CAPTCHAs are an important security tool for preventing automated attacks against online systems. However, they can be an undesirable source of friction in the user experience. In this poster, we propose a novel approach to dynamically improve the CAPTCHA experience for users by individually learning which types of CAPTCHA tests each user is best at solving and adapting future tests presented based on this knowledge.", "num_citations": "3\n", "authors": ["464"]}
{"title": "Intelligent reconfigurable universal fuzzy flip-flop\n", "abstract": " In this paper a universal fuzzy flip-flop is proposed that can be reconfigured as a fuzzy SR, D, JK, or T flip-flop. When integrated with a multi layer neural network, the resulting reconfigurable fuzzy-neural structure showed excellent learning ability. The sigmoid activation function of neurons in the hidden layers of the multilayer neural network was replaced by the quasi-sigmoidal transfer characteristics of the universal fuzzy flip-flop in the reconfigurable fuzzy-neural structure. Experimental results showed that the reconfigurable fuzzy-neural structure can be effectively trained using either a large or sparse set of data points to closely approximate nonlinear input functions.", "num_citations": "3\n", "authors": ["464"]}
{"title": "An improved SRAM cell design for tolerating radiation-induced single-event effects\n", "abstract": " This paper presents an improved design of a radiationhardened static random access memory (SRAM) cell. The memory cell is designed to be tolerant to transient single-event upsets by taking advantage of the fact that for the same area, the surface mobility of NMOS transistors is greater than that of PMOS transistors. The results show that the proposed design is able to withstand single-event upsets for temperatures between− 55◦ C to 125◦ C when subjected to radiation intensities of 10 14 rad (Si)/sec without affecting the write performance of the memory. The circuit is also robust when impinging high energy particle strikes at various angles of incidence.", "num_citations": "3\n", "authors": ["464"]}
{"title": "Design of reconfigurable fault-tolerant VLSI/WSI processor array structures\n", "abstract": " This paper presents a new reconfiguration technique for VLSI/WSI processor arrays. The fault-tolerant capabilities of both interstitial redundancy and time redundancy are combined to provide optimal reconfiguration. Results obtained through Monte Carlo simulations show that with the proposed reconfiguration technique, a very high yield and chip area utilization is achieved. It is also shown that in the presence of harsh environments, where a high rate of transient faults occur, the proposed algorithm is more robust compared to the existing approaches.", "num_citations": "3\n", "authors": ["464"]}
{"title": "Special issue on soft computing for digital information forensics\n", "abstract": " The emergence and evolution of new digital technologies are dramatically changing how information is captured, processed, analyzed, interpreted, transmitted, and stored. While digital technology has greatly improved the collection and analysis of evidences, the underlying research challenges primarily focus on the integrity and the reliability of validating the resulting forensic decisions accurately. Furthermore, digital evidences can be easily tampered, altered, or forged to commit fraud, identity theft, or impersonate someone else, to remain elusive from law enforcement. Using image processing techniques, it is easy to tamper the original image by replacing an individual’s face, and making the change difficult to detect. Image forensic techniques use natural properties of image to determine forgery or locate tampering. In another example, it is possible to determine whether an image is generated by a digital camera …", "num_citations": "2\n", "authors": ["464"]}
{"title": "Improved IDDQ design-for-testability technique to detect CMOS stuck-open faults\n", "abstract": " This paper presents a novel design-for-testability technique to reliably detect stuck-open faults in CMOS complex gates. The modified design uses an additional pair of transistors to establish a constant saturation current IDDQ through the transistors under test. Variations in current level are monitored using a built-in current sensor to detect the presence of stuck-open faults. Circuit simulations verify that the proposed design is also resilient to time skews caused by unequal delays in circuit paths.", "num_citations": "2\n", "authors": ["464"]}
{"title": "Detecting and masking transient failures in computers used for coal mining operations\n", "abstract": " The effect of lightning poses a significant problem to computer systems and electronic equipment used in surface and underground mines. Conventional protection schemes such as shielding, insulation, and filtering circuits are not adequate. The field-induced voltages and currents cause transients that can create an upset in digital or computer systems. Two effective approaches are proposed to detect and recover from transient faults when monitoring, processing, or controlling critical mining operations.< >", "num_citations": "2\n", "authors": ["464"]}
{"title": "Reducing the False Rejection Rate of Iris Recognition Using Textural and Topological\n", "abstract": " This paper presents a novel iris recognition system using 1D log polar Gabor wavelet and Euler numbers. 1D log polar Gabor wavelet is used to extract the textural features, and Euler numbers are used to extract topological features of the iris. The proposed decision strategy uses these features to authenticate an individual’s identity while maintaining a low false rejection rate. The algorithm was tested on CASIA iris image database and found to perform better than existing approaches with an overall accuracy of 99.93%.", "num_citations": "2\n", "authors": ["464"]}
{"title": "Age Gap Reducer-GAN for Recognizing Age-Separated Faces\n", "abstract": " In this paper, we propose a novel algorithm for matching faces with temporal variations caused due to age progression. The proposed generative adversarial network algorithm is a unified framework that combines facial age estimation and age-separated face verification. The key idea of this approach is to learn the age variations across time by conditioning the input image on the subject's gender and the target age group to which the face needs to be progressed. The loss function accounts for reducing the age gap between the original image and generated face image as well as preserving the identity. Both visual fidelity and quantitative evaluations demonstrate the efficacy of the proposed architecture on different facial age databases for age-separated face recognition.", "num_citations": "1\n", "authors": ["464"]}
{"title": "Understanding ACE-V Latent Fingerprint Examination Process via Eye-Gaze Analysis\n", "abstract": " The latent fingerprint examiners often mark minutiae and perform a comparison of latent fingerprints with exemplar fingerprints of known identity. The interpretation of details in the fingerprints is often based on the proficiency of examiners. Different examiners discern fingerprint regions and details differently due to an unconscious choice of certain features driven by their experiences. In this study, we aim to draw inferences from the perceptual behavior by collecting eye gaze of examiners while they mark minutiae and perform comparison. The study shows the patterns observed across different forensic examiners and infers specific heuristics used by examiners to discern features. These practices could be inculcated back into an AFIS system to improve automated comparison and help train novice examiners. To draw inferences, novice and expert examiners perform latent to exemplar fingerprint comparison by …", "num_citations": "1\n", "authors": ["464"]}
{"title": "Region-specific fMRI dictionary for decoding face verification in humans\n", "abstract": " This paper focuses on decoding the process of face verification in the human brain using fMRI responses. 2400 fMRI responses are collected from different participants while they perform face verification on genuine and imposter stimuli face pairs. The first part of the paper analyzes the responses covering both cognitive and fMRI neuro-imaging results. With an average verification accuracy of 64.79% by human participants, the results of the cognitive analysis depict that the performance of female participants is significantly higher than the male participants with respect to imposter pairs. The results of the neuro-imaging analysis identifies regions of the brain such as the left fusiform gyrus, caudate nucleus, and superior frontal gyrus that are activated when participants perform face verification tasks. The second part of the paper proposes a novel two-level fMRI dictionary learning approach to predict if the stimuli …", "num_citations": "1\n", "authors": ["464"]}
{"title": "Dynamically reconfigurable evolutionary multi-context robust cellular array design\n", "abstract": " This paper presents a novel dynamically reconfigurable evolutionary design of multi-context multi-output near real-time functions for implementation using a 2D cellular array structure. A genetic algorithm generates solutions that reuse the cells in the cellular array to implement multiple multi-output functions, thereby minimising the area overhead and power consumed. Further constraints are introduced to yield solutions that are resilient to single cell failure. Test vectors to identify the faulty cell are presented. The experimental validation and results of the proposed approach is demonstrated on a 5 × 5 cellular array to implement context-specific arithmetic functions under fault-free and faulty cell scenarios. The upper and lower bounds for the total time delay in the reconfigurable 2D array is derived.", "num_citations": "1\n", "authors": ["464"]}
{"title": "Performance optimization to alleviate I/O constraints in designing large FPGA shifters\n", "abstract": " This paper presents a novel design of large shift registers to overcome the problem of I/O pin bottleneck typically encountered in FPGA implementation. The proposed design uses an embedded logic recursively to decompose and synthesize the shifter operations. Compared to the conventional logic shifter, barrel shifter, and logarithmic shifter designs, the proposed approach reduces the number of I/O pins by at least 89%, and increases the available logic slices by 215%. The performance of the design is optimized by using a hybrid clocking scheme and is easily extended to multi-chip FPGA implementation.", "num_citations": "1\n", "authors": ["464"]}
{"title": "Reply to “Comments on ‘Evolutionary neural network modeling for software cumulative failure time prediction’by Liang Tian and Afzel Noore,” by Bev Littlewood [Reliability …\n", "abstract": " DiscussionReply to “Comments on ‘Evolutionary neural network modeling for software cumulative failure time prediction’by Liang Tian and Afzel Noore,” by Bev Littlewood [Reliability Engineering and System Safety 87 (2005) 45–51]", "num_citations": "1\n", "authors": ["464"]}
{"title": "Reliable detection of CMOS stuck-open faults due to variable internal delays\n", "abstract": " Testable designs for detecting single stuck-open faults in CMOS circuits have been proposed so that the tests remain valid even in the presence of unequal delays in the circuit. Existing approaches require the CMOS gate to be internally modified and are thus suitable for future chip designs. This paper proposes two versatile designs that can be adapted for both existing chips and new chip designs. A 3-sequence test set and a 2-sequence test set are derived for the proposed designs to reliably detect stuck-open faults.", "num_citations": "1\n", "authors": ["464"]}
{"title": "Single chip decoder design for large numeric displays\n", "abstract": " The author describes an integrated decoder design for displaying large English numeric digits using four clusters of standard seven-segment displays. The viewing area for each digit in the proposed design is four times the size of a standard display. It is also shown that the net power consumed by displaying any numeric digit using the proposed four-cluster display layout is less than that consumed by a single seven-segment display.< >", "num_citations": "1\n", "authors": ["464"]}
{"title": "On testing iterated neural network structures\n", "abstract": " A new and fast technique to determine the convergence of iterated neural networks is presented. Test vectors are derived to determine the convergence of the output function in the presence of stuck-at faults.<>", "num_citations": "1\n", "authors": ["464"]}
{"title": "MEMORY DESIGNS FOR ENHANCING TESTABILITY AND RELIABILITY.\n", "abstract": " Degree: Ph. D.DegreeYear: 1987Institute: West Virginia UniversityThe problems encountered in testing VLSI memories are analyzed and potential solutions to minimize or eliminate these problems are presented. The test generation process includes computer-aided-design of functional subsystems using NMOS technology. Circuit level fault simulation was performed on various models developed. This made it possible to increase the fault coverage. Apart from conventional stuck-at faults, a wide range of faults associated with (1) MOSFETs intermediate switching characteristics,(2) variations in substrate doping, ion implantation dose and gate oxidation thickness, and (3) processing deficiencies that cause changes in the channel length or channel width were simulated and the outputs were observed. The diagnostic resolution of the test was greatly improved when the output responses are quantized at discrete …", "num_citations": "1\n", "authors": ["464"]}
{"title": "Encyclopedia of Biometrics Springer Science+ Business Media, LLC 2009\n", "abstract": " Logical access control is the means and procedures to protect access to information on PCs, networks, and mobile phones. A variety of credential types may be used, such as passwords, tokens, or biometrics, to authenticate the user. These credentials may represent something the user knows (password), something the user has (token), or a physical trait of the user (biometrics). A logical access control system will implement a method to enroll and associate credentials with the user, and then to request that one or more of the user’s credentials be authenticated for access to the resource (application, network, device, or operating system). The logical access control system may also log all access attempts for use in auditing who and when someone accessed a specific resource.", "num_citations": "1\n", "authors": ["464"]}