{"title": "Energy efficient task caching and offloading for mobile edge computing\n", "abstract": " While augment reality applications are becoming popular, more and more data-hungry and computation-intensive tasks are delay-sensitive. Mobile edge computing is expected to an effective solution to meet the low latency demand. In contrast to previous work on mobile edge computing, which mainly focus on computation offloading, this paper introduces a new concept of task caching. Task caching refers to the caching of completed task application and their related data in edge cloud. Then, we investigate the problem of joint optimization of task caching and offloading on edge cloud with the computing and storage resource constraint. We formulate this problem as mixed integer programming which is hard to solve. To solve the problem, we propose efficient algorithm, called task caching and offloading (TCO), based on alternating iterative algorithm. Finally, the simulation experimental results show that our …", "num_citations": "164\n", "authors": ["82"]}
{"title": "Software defined healthcare networks\n", "abstract": " With the increasingly serious problem of the aging population, creating an efficient and real-time health management and feedback system based on the healthcare Internet of Things (HealthIoT) is an urgent need. Specifically, wearable technology and robotics can enable a user to collect the required human signals in a comfortable way. HealthIoT is the basic infrastructure for realizing health surveillance, and should be flexible to support multiple application demands and facilitate the management of infrastructure. Therefore, enlightened by the software defined network, we put forward a smart healthcare oriented control method to software define health monitoring in order to make the network more elastic. In this article, we design a centralized controller to manage physical devices and provide an interface for data collection, transmission, and processing to develop a more flexible health surveillance application …", "num_citations": "110\n", "authors": ["82"]}
{"title": "Edge-CoCaCo: Toward joint optimization of computation, caching, and communication on edge cloud\n", "abstract": " With the development of recent innovative applications (e.g., augmented reality, natural language processing, and various cognitive applications), more and more computation-intensive and rich-media tasks are delay-sensitive. Edge cloud computing is expected to be an effective solution to meet the demand for low latency. By the use of content offloading and/or computation offloading, users' quality of experience is improved with shorter delay. Compared to existing edge computing solutions, this article introduces a new concept of computing task caching and gives the optimal computing task caching policy. Furthermore, joint optimization of computation, caching, and communication on the edge cloud, dubbed Edge-CoCaCo, is proposed. Then we give the solution to that optimization problem. Finally, the simulation experimental results show that compared to the other schemes, Edge-CoCaCo has shorter delay.", "num_citations": "109\n", "authors": ["82"]}
{"title": "A facial-expression monitoring system for improved healthcare in smart cities\n", "abstract": " Human facial expressions change with different states of health; therefore, a facial-expression recognition system can be beneficial to a healthcare framework. In this paper, a facial-expression recognition system is proposed to improve the service of the healthcare in a smart city. The proposed system applies a bandlet transform to a face image to extract sub-bands. Then, a weighted, center-symmetric local binary pattern is applied to each sub-band block by block. The CS-LBP histograms of the blocks are concatenated to produce a feature vector of the face image. An optional feature-selection technique selects the most dominant features, which are then fed into two classifiers: a Gaussian mixture model and a support vector machine. The scores of these classifiers are fused by weight to produce a confidence score, which is used to make decisions about the facial expression's type. Several experiments are …", "num_citations": "84\n", "authors": ["82"]}
{"title": "From the service-oriented architecture to the web API economy\n", "abstract": " As Web APIs become the backbone of Web, cloud, mobile, and machine learning applications, the services computing community will need to expand and embrace opportunities and challenges from these domains.", "num_citations": "84\n", "authors": ["82"]}
{"title": "Big data-driven service composition using parallel clustered particle swarm optimization in mobile environment\n", "abstract": " The proliferation of mobile computing and smartphone technologies has resulted in an increasing number and range of services from myriad service providers. These mobile service providers support numerous emerging services with differing quality metrics but similar functionality. Facilitating an automated service workflow requires fast selection and composition of services from the services pool. The mobile environment is ambient and dynamic in nature, requiring more efficient techniques to deliver the required service composition promptly to users. Selecting the optimum required services in a minimal time from the numerous sets of dynamic services is a challenge. This work addresses the challenge as an optimization problem. An algorithm is developed by combining particle swarm optimization and k-means clustering. It runs in parallel using MapReduce in the Hadoop platform. By using parallel processing …", "num_citations": "78\n", "authors": ["82"]}
{"title": "Medical image forgery detection for smart healthcare\n", "abstract": " With the invention of new communication technologies, new features and facilities are provided in a smart healthcare framework. The features and facilities aim to provide a seamless, easy-to-use, accurate, and real-time healthcare service to clients. As health is a sensitive issue, it should be taken care of with utmost security and caution. This article proposes a new medical image forgery detection system for the healthcare framework to verify that images related to healthcare are not changed or altered. The system works on a noise map of an image, applies a multi-resolution regression filter on the noise map, and feeds the output to support-vector-machine-based and extreme-learning-based classifiers. The noise map is created in an edge computing resource, while the filtering and classification are done in a core cloud computing resource. In this way, the system works seamlessly and in real time. The bandwidth …", "num_citations": "74\n", "authors": ["82"]}
{"title": "Secure quantum steganography protocol for fog cloud internet of things\n", "abstract": " The security of sensitive information is an urgent need in today's communication, principally in cloud and Internet of Things (IoT) environments. Therefore, a well-designed security mechanism should be carefully considered. This paper presents a new framework for secure information in fog cloud IoT. In the framework, the user in one location embeds his/her valuable data via the proposed quantum steganography protocol and uploads the covered data to the fog cloud. The intended receiver in another location accesses the data from the fog cloud and extracts the intended content via the proposed extraction approach. This paper also presents a novel quantum steganography protocol based on hash function and quantum entangled states. To the best of our knowledge, there is no prior quantum steganography protocol that authenticates an embedded secret message. In the suggested protocol, the hash function is …", "num_citations": "71\n", "authors": ["82"]}
{"title": "Deep relative attributes\n", "abstract": " Relative attribute (RA) learning aims to learn the ranking function describing the relative strength of the attribute. Most of current learning approaches learn a linear ranking function for each attribute by use of the hand-crafted visual features. Different from the existing study, in this paper, we propose a novel deep relative attributes (DRA) algorithm to learn visual features and the effective nonlinear ranking function to describe the RA of image pairs in a unified framework. Here, visual features and the ranking function are learned jointly, and they can benefit each other. The proposed DRA model is comprised of five convolutional neural layers, five fully connected layers, and a relative loss function which contains the contrastive constraint and the similar constraint corresponding to the ordered image pairs and the unordered image pairs, respectively. To train the DRA model effectively, we make use of the transferred …", "num_citations": "70\n", "authors": ["82"]}
{"title": "Localization based on social big data analysis in the vehicular networks\n", "abstract": " Location-based services, especially for vehicular localization, are an indispensable component of most technologies and applications related to the vehicular networks. However, because of the randomness of the vehicle movement and the complexity of a driving environment, attempts to develop an effective localization solution face certain difficulties. In this paper, an overlapping and hierarchical social clustering model (OHSC) is first designed to classify the vehicles into different social clusters by exploring the social relationship between them. By using the results of the OHSC model, we propose a social-based localization algorithm (SBL) that use location prediction to assist in global localization in the vehicular networks. The experiment results validate the performance of the OHSC model and show that the presented SBL algorithm demonstrates superior localization performance compared with the existing …", "num_citations": "68\n", "authors": ["82"]}
{"title": "A triaxial accelerometer-based human activity recognition via EEMD-based features and game-theory-based feature selection\n", "abstract": " In recent years, sensor-based human activity recognition has attracted lots of studies. This paper presents a single wearable triaxial accelerometer-based human activity recognition system, which can be used in the real life of activity monitoring. The sensor is attached around different parts of the body: waist and left ankle, respectively. In order to improve the accuracy and reduce the computational complexity, the ensemble empirical mode decomposition (EEMD)-based features and the feature selection (FS) method are introduced, respectively. Considering the feature interaction, a game theory-based FS method is proposed to evaluate the features. Relevant and distinguished features that are robust to the placement of sensors are selected. In the experiment, the data acquired from the two different parts of the body, waist and ankle, are utilized to evaluate the proposed FS method. To verify the effectiveness of the …", "num_citations": "68\n", "authors": ["82"]}
{"title": "Energy-aware green adversary model for cyberphysical security in industrial system\n", "abstract": " Adversary models have been fundamental to the various cryptographic protocols and methods. However, their use in most of the branches of research in computer science is comparatively restricted, primarily in case of the research in cyberphysical security (e.g., vulnerability studies, position confidentiality). In this article, we propose an energy-aware green adversary model for its use in smart industrial environment through achieving confidentiality. Even though, mutually the hardware and the software parts of cyberphysical systems can be improved to decrease its energy consumption, this article focuses on aspects of conserving position and information confidentiality. On the basis of our findings (assumptions, adversary goals, and capabilities) from the literature, we give some testimonials to help practitioners and researchers working in cyberphysical security. The proposed model that runs on real-time …", "num_citations": "67\n", "authors": ["82"]}
{"title": "Cervical cancer classification using convolutional neural networks and extreme learning machines\n", "abstract": " Cervical cancer is one of the main reasons of death from cancer in women. The complication of this cancer can be limited if it is diagnosed and treated at an early stage. In this paper, we propose a cervical cancer cell detection and classification system based on convolutional neural networks (CNNs). The cell images are fed into a CNNs model to extract deep-learned features. Then, an extreme learning machine (ELM)-based classifier classifies the input images. CNNs model is used via transfer learning and fine tuning. Alternatives to the ELM, multi-layer perceptron (MLP) and autoencoder (AE)-based classifiers are also investigated. Experiments are performed using the Herlev database. The proposed CNN-ELM-based system achieved 99.5% accuracy in the detection problem (2-class) and 91.2% in the classification problem (7-class).", "num_citations": "59\n", "authors": ["82"]}
{"title": "Green video transmission in the mobile cloud networks\n", "abstract": " Video transmission is an indispensable component of most applications related to the mobile cloud networks (MCNs). However, because of the complexity of the communication environment and the limitation of resources, attempts to develop an effective solution for video transmission in the MCN face certain difficulties. In this paper, we propose a novel green video transmission (GVT) algorithm that uses video clustering and channel assignment to assist in video transmission. A video clustering model is designed based on game theory to classify the different video parts stored in mobile devices. Using the results of video clustering, the GVT algorithm provides the function of channel assignment, and its assignment process depends on the content of the video to improve channel utilization in the MCN. Extensive simulations are carried out to evaluate the GVT with several performance criteria. Our analysis and …", "num_citations": "58\n", "authors": ["82"]}
{"title": "Fog intelligence for real-time IoT sensor data analytics\n", "abstract": " The evolution of the Internet of things and the continuing increase in the number of sensors connected to the Internet impose big challenges regarding the management of the resulting deluge of data and network latency. Uploading sensor data over the web does not add value. Therefore, an efficient knowledge extraction technique is badly needed to reduce the amount of data transfer and to help simplify the process of knowledge management. Homoscedasticity and statistical features extraction are introduced in this paper as novelty detection enabling techniques, which help extract the important events in sensor data in real time when used with neural classifiers. Experiments have been conducted on a fog computing platform. System performance has been also evaluated on an occupancy data set and showed promising results.", "num_citations": "45\n", "authors": ["82"]}
{"title": "Emotion-aware multimedia systems security\n", "abstract": " The interactive robot is expected to support emotion analysis and utilize the deep learning and machine learning to provide users with continuous emotional care. However, it is a great challenge to securely acquire sufficient data for emotion analysis such that the privacy of emotional data is adequately protected. To address the security issue, this paper proposes a security policy based on identity authentication and access control to ensure the security certificate through an interactive robot or edge devices while the access control of private data stored in the edge cloud is adequately protected. Specifically, this paper adopts a polynomial-based access control policy and designs a secure and effective access control scheme. At the same time, this paper puts forward an identity authentication mechanism in view of edge cloud systems, which can reduce the computational overhead and authentication delay in a …", "num_citations": "44\n", "authors": ["82"]}
{"title": "Naive Bayes classifier based Arabic document categorization\n", "abstract": " Text Categorization aims to assign an electronic document to one or more categories based on its contents. Due to the rapid growth of the number of online Arabic documents, the information libraries and Arabic document corpus, automatic Arabic document classification becomes an important task. This paper suggests the use of rooting algorithm with Nai¿ve Bayes Classifier to the problem of document categorization of Arabic language and reports the algorithm performance in terms of error rate, accuracy, and micro-average recall measures. Our experimental study shows that using rooting algorithm with Nai¿ve Bayes (NB) Classifier gives ~62.23% average accuracy and decreases the dimensionality of the training documents.", "num_citations": "42\n", "authors": ["82"]}
{"title": "Intelligent task prediction and computation offloading based on mobile-edge cloud computing\n", "abstract": " Edge computing overcomes the high communication delay shortcoming of traditional cloud computing and provides computing services with high reliability and high bandwidth for mobile devices. At present, edge computing has become the forefront and hotspot of mobile-edge cloud computing (MEC) research. However, with the increasing requirements and services of mobile users, offloading strategy of simple edge computing is no longer applicable to MEC architecture. This paper puts forward a new intelligent computation offloading based MEC architecture in combination with artificial intelligence (AI) technology. According to the data size of computation task from mobile users and the performance features of edge computing nodes, a computation offloading and task migration algorithm based on task prediction is proposed. The computation task prediction based on LSTM algorithm, computation offloading …", "num_citations": "41\n", "authors": ["82"]}
{"title": "A buffer-aware QoS streaming approach for SDN-enabled 5G vehicular networks\n", "abstract": " With the progress of network technology in recent years, multimedia streaming applications have become increasingly popular. However, it is difficult to achieve quality of service and efficiency for multimedia streaming over vehicular networks because of the high mobility feature. Over the existing network architecture, it is difficult to immediately analyze the status of the entire network, and then establish the rules of allocation and management. However, the novel network architecture, software-defined networking, offers other options for making network management more efficient, especially for the 5G network environment. Hence, a buffer-aware streaming approach is proposed to allow users to play multimedia streaming over vehicular 5G networks, in the case of handover between different eNodeBs, to achieve minimum delay and have better quality of service. According to the user's mobility information, the status …", "num_citations": "40\n", "authors": ["82"]}
{"title": "Folksonomy-based visual ontology construction and its applications\n", "abstract": " An ontology hierarchically encodes concepts and concept relationships, and has a variety of applications such as semantic understanding and information retrieval. Previous work for building ontologies has primarily relied on labor-intensive human contributions or focused on text-based extraction. In this paper, we consider the problem of automatically constructing a folksonomy-based visual ontology (FBVO) from the user-generated annotated images. A systematic framework is proposed consisting of three stages as concept discovery, concept relationship extraction, and concept hierarchy construction. The noisy issues of the user-generated tags are carefully addressed to guarantee the quality of derived FBVO. The constructed FBVO finally consists of 139 825 concept nodes and millions of concept relationships by mining more than 2.4 million Flickr images. Experimental evaluations show that the derived FBVO …", "num_citations": "40\n", "authors": ["82"]}
{"title": "A lightweight and robust secure key establishment protocol for internet of medical things in COVID-19 patients care\n", "abstract": " Due to the outbreak of COVID-19, the Internet of Medical Things (IoMT) has enabled the doctors to remotely diagnose the patients, control the medical equipment, and monitor the quarantined patients through their digital devices. Security is a major concern in IoMT because the IoT nodes exchange sensitive information between virtual medical facilities over the vulnerable wireless medium. Hence, the virtual facilities must be protected from adversarial threats through secure sessions. This paper proposes a lightweight and physically secure mutual authentication and secret key establishment protocol that uses Physical Unclonable Functions (PUF) to enable the network devices to verify the doctor’s legitimacy (user) and sensor node before establishing a session key. PUF also protects the sensor nodes deployed in an unattended and hostile environment from tampering, cloning, and side-channel attacks. The …", "num_citations": "39\n", "authors": ["82"]}
{"title": "Machine learning for assisting cervical cancer diagnosis: An ensemble approach\n", "abstract": " Cervical cancer remains one of the most prevalent gynecologic malignancies, worldwide. As cervical cancer is a highly preventable disease, therefore, early screening represents the most effective strategy to minimize the global burden of cervical cancer. However, due to scarce awareness, lack of access to medical centers, and highly expensive procedures in developing countries, the vulnerable patient populations cannot afford to undergo examination regularly. A novel ensemble approach is presented in this paper to predict the risk of cervical cancer. By adopting a voting strategy, this method addresses the challenges associated with previous studies on cervical cancer. A data correction mechanism is proposed to improve the performance of the prediction. A gene-assistance module is also included as an optional strategy to enhance the robustness of the prediction. Multiple measurements are performed to …", "num_citations": "32\n", "authors": ["82"]}
{"title": "Recurrent convolutional neural network based multimodal disease risk prediction\n", "abstract": " With the rapid growth of biomedical and healthcare data, machine learning methods are used in more and more work to predict disease risk. However, most works use single-mode data to predict disease risk and only few works use multimodal data to predict disease risk. Thus, a new multimodal data-based recurrent convolutional neural network (MD-RCNN) for disease risk prediction is proposed. This model not only can use patient’s structured data and text data, but also can extract structured and unstructured features in fine-grained. Furthermore, in order to obtain the highly non-linear relationships between structured data and unstructured data, we use deep belief network (DBN)to fuse the features. Finally, we experiment with the medical big data of a Chinese two grade hospital during 2013–2015. Experimental results show that the accuracy of MD-RCNN algorithm can reaches 96% and outperforms several …", "num_citations": "32\n", "authors": ["82"]}
{"title": "HELOS: Heterogeneous load scheduling for electric vehicle-integrated microgrids\n", "abstract": " With increasing concerns about worldwide environmental conditions and rapid development of renewable energy technologies, microgrids have been regarded as a promising solution to reduce the burden of infrastructure-based power systems. However, due to the intrinsically intermittent features of existing renewable energy, along with random residential behavior patterns, unpredictable plugged-in or unplugged actions of electric vehicles (EVs) and the time-varying price of electricity, it is challenging for microgrid operators to efficiently perform load scheduling and energy management. In this paper, we propose an online algorithm to conduct cost-aware scheduling of EV loads and energy supplies for microgrids. We formulate this problem into a stochastic optimization problem with the objective of minimizing the time-average cost of a microgrid, including the purchase cost of electricity from the main grid, the …", "num_citations": "31\n", "authors": ["82"]}
{"title": "An efficient spam detection technique for IoT devices using machine learning\n", "abstract": " The Internet of Things (IoT) is a group of millions of devices having sensors and actuators linked over wired or wireless channel for data transmission. IoT has grown rapidly over the past decade with more than 25 billion devices expected to be connected by 2020. The volume of data released from these devices will increase many-fold in the years to come. In addition to an increased volume, the IoT devices produces a large amount of data with a number of different modalities having varying data quality defined by its speed in terms of time and position dependency. In such an environment, machine learning (ML) algorithms can play an important role in ensuring security and authorization based on biotechnology, anomalous detection to improve the usability, and security of IoT systems. On the other hand, attackers often view learning algorithms to exploit the vulnerabilities in smart IoT-based systems. Motivated …", "num_citations": "29\n", "authors": ["82"]}
{"title": "Quantum color image encryption based on multiple discrete chaotic systems\n", "abstract": " In this paper, a novel quantum encryption algorithm for color image is proposed based on multiple discrete chaotic systems. The proposed quantum image encryption algorithm utilize the quantum controlled-NOT image generated by chaotic logistic map, asymmetric tent map and logistic Chebyshev map to control the XOR operation in the encryption process. Experiment results and analysis show that the proposed algorithm has high efficiency and security against differential and statistical attacks.", "num_citations": "29\n", "authors": ["82"]}
{"title": "Artificial-intelligence-based data analytics for cognitive communication in heterogeneous wireless networks\n", "abstract": " Rapidly growing wireless networks are facing spectrum shortages, so how to improve spectrum utilization becomes critical. The rise of artificial intelligence (AI) technologies can provide a more intelligent and effective strategy for realizing cognitive wireless communication to improve spectrum utilization. Therefore, this article uses AI technology for data analytics, and combines cognitive technology to perform dynamic spectrum allocation. In terms of data analytics, AI technology is utilized in both feature extraction and data dimensionality, and the data correlation calculation between users. Then the data analytics results are applied to the spectrum allocation. Combined with deep learning, an AI-driven data-analytics-based spectrum allocation (ADASA) algorithm is proposed. ADASA enables the adaptive adjustment of the allocation parameters according to the network environmental status when allocating spectrum …", "num_citations": "27\n", "authors": ["82"]}
{"title": "Enhanced artificial bee colony algorithm for QoS-aware web service selection problem\n", "abstract": " Web Service Composition aims to select and aggregate many web services to generate a workflow. The workflow contains many tasks and for each task there are many web services to choose from. The challenge is to select the best combination of web services that achieve the user requirements. This problem is called Web Service Selection (WSS). In this work, we improve on the Artificial Bee Colony Algorithm to make it more suitable for the WSS problem. Our proposed enhancement controls the exploitation and exploration strategies in such a way that encourages exploration at early stages and exploitation at later stages. Our experiments indicate that our algorithm finds better solutions and reduces the execution time compared with other algorithms.", "num_citations": "25\n", "authors": ["82"]}
{"title": "Head pose estimation on top of haar-like face detection: A study using the kinect sensor\n", "abstract": " Head pose estimation is a crucial initial task for human face analysis, which is employed in several computer vision systems, such as: facial expression recognition, head gesture recognition, yawn detection, etc. In this work, we propose a frame-based approach to estimate the head pose on top of the Viola and Jones (VJ) Haar-like face detector. Several appearance and depth-based feature types are employed for the pose estimation, where comparisons between them in terms of accuracy and speed are presented. It is clearly shown through this work that using the depth data, we improve the accuracy of the head pose estimation. Additionally, we can spot positive detections, faces in profile views detected by the frontal model, that are wrongly cropped due to background disturbances. We introduce a new depth-based feature descriptor that provides competitive estimation results with a lower computation time. Evaluation on a benchmark Kinect database shows that the histogram of oriented gradients and the developed depth-based features are more distinctive for the head pose estimation, where they compare favorably to the current state-of-the-art approaches. Using a concatenation of the aforementioned feature types, we achieved a head pose estimation with average errors not exceeding 5: 1; 4: 6; 4: 2 for pitch, yaw and roll angles, respectively. View Full-Text", "num_citations": "25\n", "authors": ["82"]}
{"title": "COCME: content-oriented caching on the mobile edge for wireless communications\n", "abstract": " With the rapid development of mobile networks and mobile communications, various content can be conveniently accessed. Recently, some novel caching-based approaches have been proposed to enhance the QoE in wireless communications, but it is still challenging to develop advanced content delivery in wireless communications due to limitations of conventional D2D communications and caching strategies. To address these challenges, this article proposes content-oriented caching on the mobile edge for wireless communications. Specifically, it designs novel mobile edge caching based on popular content recommendations. Sufficient experiments demonstrate that the proposed approaches can effectively decrease the traffic load by using an acceptable volume of storage resources on mobile edges.", "num_citations": "21\n", "authors": ["82"]}
{"title": "An adapted ant-inspired algorithm for enhancing Web service composition\n", "abstract": " Web Service Composition (WSC) provides a flexible framework for integrating independent web services to satisfy complex user requirements. WSC aims to choose the best web service from a set of candidates. The candidates have the same functionality and different non-functional criteria such as Quality of Service (QoS). In this work, the authors propose an ant-inspired algorithm for such problem. They named it Flying Ant Colony Optimization (FACO). Flying ants inject pheromone not only on the nodes on their paths but also on neighboring nodes increasing their chances of being explored in future iterations. The amount of pheromone deposited on these neighboring nodes is inversely proportional to the distance between them and the nodes on the path. The authors believe that by depositing pheromone on neighboring nodes, FACO may consider a more diverse population of solutions, which may avoid …", "num_citations": "14\n", "authors": ["82"]}
{"title": "Program Educational Objectives Definition and Assessment for Quality and Accreditation.\n", "abstract": " Academic accreditation of degree programs is becoming an important mean for many institutions to improve the quality of their degree programs. Many programs, in particular computing and engineering, offered by many schools have engaged in the accreditation process with different accreditation bodies. Accreditation bodies include ABET in USA, ABEEK in South Korea, JABEE in Japan, etc. Probably the most known accreditation body in the Unites States of America for engineering, computing, technology, and applied science programs is ABET. A key problem towards the satisfaction of accreditation criteria for most of accreditation agencies including ABET is the appropriate definition and assessment of program educational objectives for a specific degree program. Program Educational Objectives are important as they represent the ultimate mean to judge the quality of a program. They related directly to student …", "num_citations": "13\n", "authors": ["82"]}
{"title": "Photo sundial: estimating the time of capture in consumer photos\n", "abstract": " The time of capture of consumer photos provides rich information in temporal context and has been widely employed for solving various multimedia problems, such as multimedia retrieval and social media analysis. However, we observed that the recorded time stamp in a consumer photo does not often correspond to the true local time at which the photo was taken. This would greatly damage the robustness of time-aware multimedia applications, such as travel route recommendation. Therefore, motivated by the use of traditional sundials, this work proposes a system, Photo Sundial, for estimating the time of capture by exploiting the astronomical theory. In particular, we infer the time by establishing its relations to the measurable astronomical factors from a given outdoor photo, i.e. the sun position in the sky and the camera viewing direction in the photo-taken location. In practice, since it is more often that people …", "num_citations": "12\n", "authors": ["82"]}
{"title": "Handover performance of unstable-yaw stratospheric high-altitude stations\n", "abstract": " Stratospheric platform (SP) is a new technique for providing mobile and data communications and is capable to add many advantages to the users compared to conventional terrestrial and satellite systems. A very competing problem of this emerging system is the positional instability of SP which affects the system performance. In this paper, one main problem of SP positional instabilities—which is the rotation drift—is described and analyzed and its impact on the call handover in cellular systems is also investigated. The total handover due to both user mobility and platform positional instability is explained and determined. In addition, an expression for the number of handed calls is deduced which has been shown as function of user density, distribution, platform angular shift due to rotation, cell geometry, and number of active calling users. The analysis of this number shows the serious effects of the …", "num_citations": "12\n", "authors": ["82"]}
{"title": "Data-driven resource management in a 5G wearable network using network slicing technology\n", "abstract": " The rapid development of the wearable technology brings an explosive growth of wearable devices and imposes a new challenge to the current network. This is because the wearable devices require real-time interaction and data processing. To cope with this challenge and to realize reasonable utilization of resources, this paper first introduces the network slice-based 5G wearable networks, including the 5G ultra-dense cellular network, the edge caching, and the edge computing. Then, in order to realize the service aware and efficient management of network slicing resources, we propose a data-driven resource management framework which includes the service cognitive engine, the resources cognitive engine, and the global cognitive engine. Furthermore, through information perception, analytical prediction, policy decisions, and performance evaluation, the data-driven resources management method is …", "num_citations": "10\n", "authors": ["82"]}
{"title": "Leveraging artificial intelligence to improve voice disorder identification through the use of a reliable mobile app\n", "abstract": " The evolution of the Internet of Things, cloud computing and wireless communication has contributed to an advance in the interconnectivity, efficiency and data accessibility in smart cities, improving environmental sustainability, quality of life and well-being, knowledge and intellectual capital. In this scenario, the satisfaction of security and privacy requirements to preserve data integrity, confidentiality and authentication is of fundamental importance. In particular, this is essential in the healthcare sector, where health-related data are considered sensitive information able to reveal confidential details about the subject. In this regard, to limit the possibility of security attacks or privacy violations, we present a reliable mobile voice disorder detection system capable of distinguishing between healthy and pathological voices by using a machine learning algorithm. This latter is totally embedded in the mobile application, so it …", "num_citations": "9\n", "authors": ["82"]}
{"title": "Mining tag-clouds to improve social media recommendation\n", "abstract": " Massive amounts of data are available on social websites, therefore finding the suitable item is a challenging issue. According to recent social statistics, we have more than 930 million people are using WhatsApp with more than 340 million active daily users and 955 million people who access Facebook daily with an average daily photo uploads up to 325 million. The approach presented in this paper employs the collaborative tagging accumulated by huge number of users to improve social media recommendation. Our approach has two phases, in the first phase, we compute the tag-item weight model and in the second phase, we compute the user-tag preference model. After that we employ the two models to find the suitable items tailored to the user’s preferences and recommend the items with the highest score. Also our model can compute the tag score and suggest the tags with the highest weight to the …", "num_citations": "9\n", "authors": ["82"]}
{"title": "QoS management for dependable sensory environments\n", "abstract": " Sensory environments for healthcare are commonplace nowadays. A patient monitoring system in such an environment deals with sensor data capture, transmission and processing in order to provide on-the-spot support for monitoring the vulnerable and critical patients. A fault in such a system can be hazardous on the health of the patient. Therefore, such a system must be dependable and ensure reliability, fault-tolerance, safety and other critical aspects, in order to deploy it in real scenario. Also, the management of the infrastructure resources must be efficient and the eventual system reconfiguration must be reliably performed. This paper encounters some of these issues and proposes a component platform with specific support for several QoS aspects, namely fault tolerance, safe inter-component communication and resource management. The platform adopts the Service Component Architecture (SCA …", "num_citations": "9\n", "authors": ["82"]}
{"title": "Cognitive and hierarchical fuzzy inference system for generating next release planning in saas applications\n", "abstract": " The next release planning is considered as a cognitive decision-making problem where many stakeholders provide their judgments and opinions about the set of features that shall be included in the next release of the software. In multi-tenant Software as a Service (SaaS) applications, planning for the next release is a significant process that plays important roles in the success of SaaS applications. SaaS providers shall fulfill the evolving needs and requirements of their tenants by continuously delivering new releases. The first step in a release development lifecycle is the release planning process. This paper proposes a novel approach for the next release planning for multi-tenant SaaS applications. This approach is a prioritization approach that employs a hierarchical fuzzy inference system (HFIS) module to deal with the uncertainty associated with human judgments. The main objectives of the proposed …", "num_citations": "6\n", "authors": ["82"]}
{"title": "Dysphonia detection index (DDI): A new multi-parametric marker to evaluate voice quality\n", "abstract": " The rapid diffusion of voice disorders and the lack of appropriate knowledge about the problem have prompted the search for novel and reliable approaches to detect dysphonia, through easy and accessible instruments such as mobile devices. These systems represent, in fact, valid instruments to improve the patient care not only to facilitate the monitoring of symptoms of any diseases but also supporting the correct diagnosis of pathology, such as the dysphonia. In this paper, we propose a new marker, namely the dysphonia detection index, able to support the evaluation of voice disorders, which can be embedded in a mobile health solution. Four acoustic parameters are combined in a single marker to globally evaluate the state of the health of the voice and to assess the presence or not of a voice disorder. A model tree regression algorithm has been applied to define the relationship between these parameters …", "num_citations": "6\n", "authors": ["82"]}
{"title": "If-rans: intelligent traffic prediction and cognitive caching toward fog-computing-based radio access networks\n", "abstract": " The rapid development of wireless communication technology and smart devices has made the traditional cloud-based Internet of Things architecture unable to meet the stringent requirements of 5G mobile communication networks. In order to realize high-reliability and low-latency communication for 5G, F-RANs have become a potential evolution path. However, F-RANs still face several challenges regrading infrastructure, network traffic, and caching mechanism. From the point of view of integrating AI, F-RANs, and cloud, this article proposes intelligent traffic prediction and cognitive caching toward IF-RANs. First, a traffic flow prediction algorithm is developed that is based on LSTM with an attention mechanism. The algorithm can effectively predict real-time traffic of different data types. Then, for caching policy, cognitive caching based on LSTM and collaborative filtering is proposed to reduce the total …", "num_citations": "5\n", "authors": ["82"]}
{"title": "RADB: random access with differentiated barring for latency-constrained applications in NB-IoT network\n", "abstract": " With the development of LPWA (Low Power Wide Area) technology, the emerging NB-IoT (Narrowband Internet of Things) technology is becoming popular with wide area and low-data-rate services. In order to achieve objectives such as huge amount of connection and wide area coverage within NB-IoT, the problem of network congestion generated by random access of numerous devices should be solved. In this paper, we first introduce the background of NB-IoT and investigate the research on random access optimization algorithm. Then we summarize relevant features of NB-IoT uplink and narrowband physical random access channel and design random access with differentiated barring (RADB), which can improve the insufficiency of traditional dynamic access class barring method. At last, the algorithms proposed in this paper are realized with established NB-IoT model using OPNET Modeler platform, and simulations are conducted. The simulation results show that RADB is able to effectively solve preamble request conflict generated by random access of numerous devices and preferentially provide efficient and reliable random access for latency-sensitive devices.", "num_citations": "5\n", "authors": ["82"]}
{"title": "ASM based synthesis of handwritten Arabic text pages\n", "abstract": " Document analysis tasks, as text recognition, word spotting, or segmentation, are highly dependent on comprehensive and suitable databases for training and validation. However their generation is expensive in sense of labor and time. As a matter of fact, there is a lack of such databases, which complicates research and development. This is especially true for the case of Arabic handwriting recognition, that involves different preprocessing, segmentation, and recognition methods, which have individual demands on samples and ground truth. To bypass this problem, we present an efficient system that automatically turns Arabic Unicode text into synthetic images of handwritten documents and detailed ground truth. Active Shape Models (ASMs) based on 28046 online samples were used for character synthesis and statistical properties were extracted from the IESK-arDB database to simulate baselines and word slant or skew. In the synthesis step ASM based representations are composed to words and text pages, smoothed by B-Spline interpolation and rendered considering writing speed and pen characteristics. Finally, we use the synthetic data to validate a segmentation method. An experimental comparison with the IESK-arDB database encourages to train and test document analysis related methods on synthetic samples, whenever no sufficient natural ground truthed data is available.", "num_citations": "5\n", "authors": ["82"]}
{"title": "An Enhanced Ant Colony Optimization Based Algorithm to Solve QoS-Aware Web Service Composition\n", "abstract": " Web Service Composition (WSC) can be defined as the problem of consolidating the services regarding the complex user requirements. These requirements can be represented as a workflow. This workflow consists of a set of abstract task sequence where each sub-task represents a definition of some user requirements. In this work, we propose a more efficient neighboring selection process and multi-pheromone distribution method named Enhanced Flying Ant Colony Optimization (EFACO) to solve this problem. The WSC problem has a challenging issue, where the optimization algorithms search the best combination of web services to achieve the functionality of the workflow's tasks. We aim to improve the computation complexity of the Flying Ant Colony Optimization (FACO) algorithm by introducing three different enhancements. We analyze the performance of EFACO against six of existing algorithms and …", "num_citations": "4\n", "authors": ["82"]}
{"title": "A multi-class task scheduling strategy for heterogeneous distributed computing systems\n", "abstract": " Performance enhancement is one of the most important issues in high performance distributed computing systems. In such computing systems, online users submit their jobs anytime and anywhere to a set of dynamic resources. Jobs arrival and processes execution times are stochastic. The performance of a distributed computing system can be improved by using an effective load balancing strategy to redistribute the user tasks among computing resources for efficient utilization. This paper presents a multi-class load balancing strategy that balances different classes of user tasks on multiple heterogeneous computing nodes to minimize the per-class mean response time. For a wide range of system parameters, the performance of the proposed multi-class load balancing strategy is compared with that of the random distribution load balancing, and uniform distribution load balancing strategies using simulation. The results show that, the proposed strategy outperforms the other two studied strategies in terms of average task response time, and average computing nodes utilization.", "num_citations": "4\n", "authors": ["82"]}
{"title": "A Stepwise Self-adaptive Model for Improving Cloud Efficiency Based on Multi-Agent Features.\n", "abstract": " Today, the multi-agent systems are the most common systems that have intelligent behavior and able to adapt features based on the environmental changes. On the other side, cloud applications enable the stakeholders to customize their resources and software they need based on the requested domain. These applications face many challenges such as how to handle the changes of the stakeholder requirements at run-time, how to reconfigure the constituted architecture dynamically to be in consistency with the new services, and how to cope with the highly inherent expensive cost. To deal with these challenges, we proposed a new model that uses basic agent features for enhancing the cloud infrastructure functionalities by reconfiguring their allocated resources and software at run-time. The proposed model is composed of three levels. The first level is the cloud level which via its functionalities the consistent image that maps the user’s requests through its manual components can be created & established. The second level is the intermediate level, which is responsible for two issues: playing the role of connector between the cloud level and the multi-agent level, and verifying the consistent of outputs for both of the upper and lower levels. The third level is the multi-agent, which is responsible for improving the quality of the constituted cloud images by co-operating the information, reasoning, learning and mobile agents. Finally, the urban transportation system is used to proof the applicability and usage of the proposed model.", "num_citations": "4\n", "authors": ["82"]}
{"title": "Reflective and adaptive middleware for software evolution of information systems\n", "abstract": " The high volatility and competitively of organizational ('socio-techno-economical') environment are putting tremendous pressure on software-intensive developers to come up with adaptive and evolving approaches. To contribute to such topical efforts towards adaptive information system at early phases, the present thesis addresses the rigorous development of self-adapting information systems. The approach we are putting forwards is referred to as RAMSES (Reflective and Adaptive Middleware for Software Evolution of non-stopping information Systems), and provides a reflective architecture for adapting the software applications, in response the requirements and environmental changes.The reflective middleware is based on a UML-compliant base-and meta-level. RAMSES provides objects with the ability of dynamically changing their behavior by exploiting their design information. The meta-level of the proposed architecture reifies UML diagrams including structural and behavioral information of the system to adapt; then it uses such data for dynamically adapting the software system against environmental changes. The evolution takes place in two steps: a meta-object, called evolutionary meta-object, plans a possible evolution against the detected external events then another meta-object, called consistency checker meta-object validates the feasibility of the proposed plan before really evolving the system. The meta-objects use the system design information to lead its evolution.", "num_citations": "4\n", "authors": ["82"]}
{"title": "Auxiliary Diagnosis of COVID-19 Based on 5G-Enabled Federated Learning\n", "abstract": " The development of 5G and artificial intelligence technologies have brought novel ideas to the prevention, control, and diagnosis of disease. Due to the limitation of the privacy protection of medical big data, releasing the data of patients is not allowed. However, as COVID-19 spreads globally, it is urgent to develop a robust diagnostic model to serve as many institutions as possible. Therefore, we propose a 5G-enabled architecture of auxiliary diagnosis based on federated learning for multiple institutions and central cloud collaboration to realize the sharing of diagnosis models with high generalization performance. In order to exchange model and parameters between the central and distributed nodes, a framework of diagnosis model cognition is constructed for sharing and updating the model adaptively. The severity classification experiments of COVID-19 were carried out on the central cloud and three edge cloud …", "num_citations": "3\n", "authors": ["82"]}
{"title": "Exploring the Use of Artificial Intelligence Techniques to Detect the Presence of Coronavirus Covid-19 Through Speech and Voice Analysis\n", "abstract": " The Covid-19 pandemic represents one of the greatest global health emergencies of the last few decades with indelible consequences for all societies throughout the world. The cost in terms of human lives lost is devastating on account of the high contagiousness and mortality rate of the virus. Millions of people have been infected, frequently requiring continuous assistance and monitoring. Smart healthcare technologies and Artificial Intelligence algorithms constitute promising solutions useful not only for the monitoring of patient care but also in order to support the early diagnosis, prevention and evaluation of Covid-19 in a faster and more accurate way. On the other hand, the necessity to realise reliable and precise smart healthcare solutions, able to acquire and process voice signals by means of appropriate Internet of Things devices in real-time, requires the identification of algorithms able to discriminate …", "num_citations": "3\n", "authors": ["82"]}
{"title": "Tanta Protocol for Management of COVID-19: Perspectives from a Developing Country.\n", "abstract": " In late 2019, SARS-COV-2 disease is firstly discovered in Wuhan, China and it reached millions of people worldwide. Later, the World Health Organization (WHO) described COVID-19 as the first pandemic invading the world in 21st century. The WHO has declared that the emerging infection will last long enough to force adjustments not only in people's lifestyles but also in health care system. This amendment is expected to spread through many medical practices and specialties. A lot of diagnostic and therapeutic modalities have been proposed for COVID-19 management. The best strategy for management of patients requires a multi-disciplinary team approach with correct decision regarding the right timing of each modality of treatment. The participating multidisciplinary team for COVID-19 management includes six infectious diseases experts in Tanta University; one critical care management expert; an emergency medicine expert and two pharmacists in Tanta University. In this review, we reported our multi-disciplinary team experience with up to date literature guidance to propose a valid protocol for management of COVID-19 patients in limited resources setting.", "num_citations": "3\n", "authors": ["82"]}
{"title": "Registration of Feature-Poor 3D Measurements from Fringe Projection\n", "abstract": " We propose a novel method for registration of partly overlapping three-dimensional surface measurements for stereo-based optical sensors using fringe projection. Based on two-dimensional texture matching, it allows global registration of surfaces with poor and ambiguous three-dimensional features, which are common to surface inspection applications. No prior information about relative sensor position is necessary, which makes our approach suitable for semi-automatic and manual measurement. The algorithm is robust and works with challenging measurements, including uneven illumination, surfaces with specular reflection as well as sparsely textured surfaces. We show that precisions of 1 mm and below can be achieved along the surfaces, which is necessary for further local 3D registration. View Full-Text", "num_citations": "3\n", "authors": ["82"]}
{"title": "Cobe framework: Cloud ontology blackboard environment for enhancing discovery behavior\n", "abstract": " The new relatively concept of cloud computing & its associated methodologies has many advantages in the world of today. Such advantages range between providing solutions for integration of the miscellaneous systems & presenting as well guarantees for distribution of searching means & integration of software tools which are used by consumers & different providers. In this paper, we have constructed an ontologybased cloud framework with a view to identifying its external agent’s interoperability. The proposed framework has been designed using the blackboard design style. This framework is composed of mainly two components: controller and cloud ontology blackboard environment. The function of the controller is to interact with consumers after receipt of the subject request where it spontaneously uses the ontology base to distribute it & constitute the required related responses whereas the function of the second framework component is to interact with different cloud providers and systems, using the meta-ontology framework to restructure data via using AI reasoning tools and map them to its corresponding redistributed request. Finally, E-tourism case study can be applicable will be explored.", "num_citations": "3\n", "authors": ["82"]}
{"title": "An approach for securing and validating business processes based on a defined enterprise security ontology criteria\n", "abstract": " The security ontology criteria are a vital de-facto in Service Oriented Architecture (SOA) which guarantees a secure orchestration of the organizational services to face the new security aspects. Quality of Service (QoS) is a set of standards and algorithms used to measure the performance of a service by monitoring quality affecting factors. In this paper we secure and validate the business processes by introducing a framework and a security tag. The security tag is used to represent certain infrastructure quality of service criteria within business processes of an enterprise. This is achieved by correlating the infrastructure security components performance and business process through an enterprise infrastructure-based security token presented in the BPEL file in newly introduced attributes. The framework then applies its developed algorithm to validate the enterprise security ontology criteria by using the …", "num_citations": "3\n", "authors": ["82"]}
{"title": "MEMO box: health assistant for depression with medicine carrier and exercise adjustment driven by edge computing\n", "abstract": " According to the report by the World Health Organization, depression, as the leading disabling disease in the world, has aroused widespread social concern. However, the shortage of medical and nursing staff in psychiatry conflicts with the rising nursing needs of depressed patients. First, depression is a chronic mental illness, its cure course is relatively long, and stable drug treatment and healthy living habits are keys to the curing process. Second, the disease feature where depression patients have stronger emotional needs and more sensitive mental states is ignored in existing health monitoring systems. In consideration of the above two aspects, a health management assistant is proposed in this paper, called MEMO box system, that focuses on emotion and takes smart medicine box as carrier. Specifically, the MEMO box system is composed of electronic medicine box and smart applications of phones, and …", "num_citations": "2\n", "authors": ["82"]}
{"title": "Caudal neostigmine improves postoperative analgesia in children undergoing open heart surgery\n", "abstract": " Background: The use of regional anesthesia techniques in infants and children has become increasingly accepted as standard of care during the final decades of the 20th century. As single shot technique with relatively short duration of post operative analgesia so the most frequently used method to further prolong postoperative analgesia following caudal is to add different adjunct drugs to the local anesthetic solution.Study Objective: The aim of the present randomized study was to determine the effect of adding neostigmine to bupivacaine compared with bupivacaine alone in caudal block, on postoperative analgesia and the incidence of side effects in children undergoing open heart surgery for congenital heart disease.Study Type: InterventionalStudy Design: Allocation: Randomized", "num_citations": "2\n", "authors": ["82"]}
{"title": "Blockchain and AI-Based Natural Gas Industrial IoT System: Architecture and Design Issues\n", "abstract": " With the development of energy interconnection and increasing consumption of natural gas, the distributed energy supply and trusted-transaction- based natural gas Industrial Internet of Things (IIoT) has become one of the hottest research spots in the energy industry. This article puts forward natural gas IIoT architecture based on blockchain and AI, in order to address the defects of centralized energy supply architecture. The proposed architecture is introduced in detail from three aspects of infrastructure, side-chain of natural gas block based on data dimension, and backbone of natural gas block based on value dimension. Then the design issues on the integration existence of blockchain and AI in an actual natural gas IIoT scenario are discussed, including data association and interaction of blockchains, trusted identity authentication and management, energy source and virtual currency transformation, and so on …", "num_citations": "1\n", "authors": ["82"]}
{"title": "Smart autonomous moving platforms\n", "abstract": " In recent years, several advances in artificial intelligence such as deep learning, computer vision, automatic driving, cognitive computing, and robotics, have laid the technological foundation for the large-scale application of Smart-AMPs in complex environments. Potential solutions have appeared for smart transportation, aerospace exploration, smart logistics and smart cities. This article summarizes all kinds of autonomous moving platforms, proposes a definition of Smart- AMPs, and investigates taxonomy, technologies, applications, open issues and key challenges for Smart-AMPs. This article is suitable as a pedagogical overview of Smart-AMPs.", "num_citations": "1\n", "authors": ["82"]}
{"title": "Web service based collaborative e-learning environment for engineering education\n", "abstract": " With the increasing growth of communication technologies and pervasive devices, a number of collaborative services are being builtfor ubiquitous learning access to e-learning environment. However, there exist so many devices with similar functionality but withheterogeneous QoS capability. In order to have suitable services according to desired QoS, services need to be selected. This articlepresents the corresponding solutions to service selection for collaborative e-learning environment. The experimental results not onlyshowed our solution is more efficient than the similar system but also proved that our solution can work well for web services-based collaborative e-learning environment, especially for enhanced engineering education.", "num_citations": "1\n", "authors": ["82"]}
{"title": "A Dynamic Reconfigurable-Based Approach for Connectivity Mismatches of Web Services\n", "abstract": " Web services are the main stones of building and developing internal organization business workflow. If the connectivity of these web services is not well defined, companies that rely on them may face many problems especially when integration and composition are needed. Companies need a well-defined harmonic structure of the web service connectivity within their workflow. The most challenge of these companies is to keep their workflow structure harmonic by handling unexpected changes or new policies. In this paper, we face this problem by proposing a framework with supporting some dedicated dynamic reconfigurable algorithms to generate and develop an automatically efficient adaptor. This adapter is designed to work in the case of the behavioral and graph mismatches within the web services connectivity for business workflow. The proposed framework composes of two main engines namely …", "num_citations": "1\n", "authors": ["82"]}
{"title": "Service Oriented Workflow Enhancement Blueprint Based on QoS and Graph Theory\n", "abstract": " SWWS 2010: proceedings of the 2010 international conference on semantic web & web services (Las Vegas NV, July 12-15, 2010). 2010, pp 84-90, 7 p; ref: 20 ref", "num_citations": "1\n", "authors": ["82"]}
{"title": "Integrative framework for Service Oriented Architecture composition of business processes\n", "abstract": " Service oriented architecture (SOA) is a dominant architecture for today software development architecture. The companies must adapt their systems to face the changes in the business processes. In SOA, each business process may be represented by one or more services. To achieve greater automation of enterprises business processes, enterprises need an integration engine that integrates and harmonizes an enterprise's business processes and services within the enterprise. In this paper, a new framework is built to address this integration problem to integrate new service within an existing business process workflow. This framework measures the level of integration and tests whether that service is fully, partially, or not integrated at all with the other services in the workflow. Also, a new adapted business process workflow is generated using a real case study obtained from SADAD (Saudi Payment System).", "num_citations": "1\n", "authors": ["82"]}