{"title": "The MAFT architecture for distributed fault tolerance\n", "abstract": " A description is given of the multicomputer architecture for fault tolerance (MAFT), a distributed system designed to provide extremely reliable computation in real-time control systems. MAFT is based on the physical and functional partitioning of executive functions from applications functions. The implementation of the executive functions in a special-purpose hardware processor allows the fault-tolerance functions to be transparent to the application programs and minimizes overhead. Byzantine agreement and approximate agreement algorithms are used for critical system parameters. MAFT supports the use of multiversion hardware and software to tolerate built-in or generic faults. Graceful degradation and restoration of the application workload is permitted in response to the exclusion and readmission of nodes, respectively.< >", "num_citations": "310\n", "authors": ["535"]}
{"title": "Synchronizer for a fault tolerant multiple node processing system\n", "abstract": " A synchronizer for each node in a multiple node processing system having a message interface for receiving sync and pre-sync time-dependent message, counter means for generating a local time, a time stamp memory having an entry for each node in the multiple node processing system, a time stamper responsive to receiving a time-dependent message from a node for storing the local time in the entry of said time stamp memory for that node to generate a time stamp. The synchronizer has a time stamp voter for generating a medial time stamp value from all the time stamps in the time stamp memory, a sync correction generator for generating a sync delta having a value corresponding to the difference between the voted time stamp and the node's own time stamp, means for adding said sync delta to a nominal transmission timing interval to generate an actual transmission timing interval, and a message generator …", "num_citations": "222\n", "authors": ["535"]}
{"title": "Technique for detecting and predicting air filter condition\n", "abstract": " A method and system for detecting and predicting air filter condition for an air handling system operates by determining a system resistance to air flow. The system resistance is utilized to determine a detection statistic indicative of current filter condition and to predict remaining life of the air filter. The system resistance is determined using models that approximate the expected operation of the air handling system. The approximation is then compared to actual values to obtain a difference. Once the difference between the approximated value exceeds a threshold value, an alarm is initiated that is indicative of system resistance. The remaining air filter life is then determined by using historically gathered data, or by using a known degradation rate of the air filter. Once the remaining life of the air filter is estimated, replacement can be scheduled that would coincide with other maintenance.", "num_citations": "212\n", "authors": ["535"]}
{"title": "Operations controller for a fault tolerant multiple node processing system\n", "abstract": " A task communicator for each node in a multiple node processing system having a data memory storing data received from a voter interface which is used for the execution of tasks by an associated applications processor, a next task register storing the identification code of the next task to be executed by the applications processor received from a scheduler through a scheduler interface. An input handler passes the identification code of the next task and the data required for the execution of that task to an input FIFO register interfacing the applications processor. An output FIFO register temporarily stores the data generated by the applications processor and an output handler generates inter-node messages containing data stored in the output FIFO and passes these inter-node messages to a transmitter through a transmitter interface for transmission to all of the other nodes in the processing system.", "num_citations": "162\n", "authors": ["535"]}
{"title": "Task scheduler for a fault tolerant multiple node processing system\n", "abstract": " A task scheduler for a fault tolerant multiple node processing system having a task activity list storing a set of application tasks, a priority scan list storing a selected portion of the set of application tasks, a completion status list also storing the same selected portion of the set of application tasks. A wake-up sequencer transfers the application tasks from the task activity list to the priority scan list, and a priority scanner transfers the application tasks ready for execution from the priority scan list to a selection queue. A next task selector selects the next application task that its node will execute, and a task started register stores the identity of the application tasks completed by the other nodes. A task interactive consistency (TIC) handler updates the status of the application tasks stored in the task activity list, the priority scan list, and the completion status list in response to messages received from the other nodes identifying …", "num_citations": "154\n", "authors": ["535"]}
{"title": "Robust and reliable acoustic echo and noise cancellation system for cabin communication\n", "abstract": " A cabin communication system for improving clarity of a voice spoken within an interior cabin having ambient noise includes an adaptive speech enhancement filter for receiving an audio signal that includes a first component indicative of the spoken voice, a second component indicative of a feedback echo of the spoken voice and a third component indicative of the ambient noise, the speech enhancement filter filtering the audio signal by removing the third component to provide a filtered audio signal, the speech enhancement filter adapting to the audio signal at a first adaptation rate, and an adaptive acoustic echo cancellation system for receiving the filtered audio signal and removing the second component in the filtered audio signal to provide an echo-cancelled audio signal, the echo cancellation signal adapting to the filtered audio signal at a second adaption rate, wherein the first adaptation rate and the …", "num_citations": "119\n", "authors": ["535"]}
{"title": "Video-based smoke detection: possibilities, techniques, and challenges\n", "abstract": " When a fire occurs, minimum detection latency is crucial to minimizing damage and saving lives. Current smoke sensors inherently suffer from the transport delay of the smoke from the fire to the sensor. A video smoke detection system would not have this delay. Further, video is a volume sensor, not a point sensor. A point sensor looks at a point in space. That point may not be affected by smoke or fire, so the smoke would not be detected. A volume sensor potentially monitors a larger area and has much higher probability of successful early detection of smoke or flame.Video smoke detection is a good option when smoke does not propagate in a “normal” manner, eg, in tunnels, mines, and other areas with forced ventilation, and in areas with air stratification, eg, hangars, warehouses, etc. Video is also a good option for large, open areas where there may be no heat or smoke propagation to a fixed point, eg, saw mills, petrochemical refineries, forest fires, etc.", "num_citations": "114\n", "authors": ["535"]}
{"title": "Active noise control system using phased-array sensors\n", "abstract": " An active noise control system is provided with a plurality of error sensor arrays 50, 77 which provide signals on lines 64-74, 90-100 to beam forming and beam steering logic 76 which cause the arrays 50, 77 to exhibit acoustic response profiles 104,106, respectively. The profiles 104,106 intersect in a predefined region 116 to be quieted. The logic 76 provides signals on lines 118, one for each region to be quieted, to active noise control (ANC) logic 20 which also receives inputs from feedforward sensing microphones 10 and provides output signals to acoustic speakers 24 which generate anti-noise 26 to cancel the noise in the quiet region 116. The quiet region 116 may be selectively positioned to any region in the room by steering the beams 104,108. Alternatively, the system may have a plurality of distributed sensors which, when taken together, have an overall maximum (main lobe) acoustic response at a …", "num_citations": "112\n", "authors": ["535"]}
{"title": "Operations controller for a fault tolerant multiple node processing system\n", "abstract": " An operations controller for a multiple node fault tolerant processing system having a transmitter for transmitting inter-node messages, a plurality of receivers, each receiving inter-node messages from only one of the nodes and a message checker for checking each received message for physical and logical errors. A fault tolerator assembles all of the errors detected and decides which nodes are faulty based on the number and severity of the detected errors. A voter generates a voted value for each value which is received from the other nodes which is stored in a data memory by a task communicator. A scheduler selects the tasks to be executed by an applications processor which is passed to the task communicator. The task communicator passes the selected task and the data required for the execution of that task to the applications processor and transmits the data resulting from that task to all of the nodes in the …", "num_citations": "112\n", "authors": ["535"]}
{"title": "Video aided system for elevator control\n", "abstract": " An elevator control system (24) provides elevator dispatch and door control based on passenger data received from a video monitoring system. The video monitoring system includes a video processor (16) connected to receive video input from at least one video camera (12). The video processor (16) tracks objects located within the field of view of the video camera, and calculates passenger data parameters associated with each tracked object. The elevator controller (24) provides elevator dispatch (26), door control (28), and security functions (30) based in part on passenger data provided by the video processor (16). The security functions may also be based in part on data from access control systems (14).", "num_citations": "82\n", "authors": ["535"]}
{"title": "Remote operating system having secure communication of encoded messages and automatic re-synchronization\n", "abstract": " A remote operating system for remote-controlled operation of a device provides secure communication of encoded messages between a transmitter (100) and receiver (150) of the system, and provides automatic re-synchronization of the transmitter and receiver without revealing a loss of synchronization to the operator. A pseudo random binary number (PRBN) generator (105) in the transmitter (100) produces a sequence of identification numbers. Each time the transmitter (100) is activated, the identification number contained in the transmitted encoded message is selected as the next number in the sequence of identification numbers. A PRBN generator (170) in the receiver (150) produces a sequence of reference numbers that is identical to the sequence of identification numbers. The receiver responds to a command code portion of the transmitted encoded message for operation the device when there is identity …", "num_citations": "76\n", "authors": ["535"]}
{"title": "Charge loss detection and prognostics for multi-modular split systems\n", "abstract": " A method for detecting and predicting refrigerant level includes the steps of determining an estimated value for a parameter indicative of refrigerant level and comparing that estimated value to an actual value. The difference between the actual and estimated value provides a refrigerant charge indicator value. The charge indicator value is indicative of the amount of refrigerant contained within the system. A change value is combined with the charge indicator value to provide a prediction for the future value of the charge indicator value. This future value is determined based on a rate of change and charge indicator value over a selected period of time.", "num_citations": "74\n", "authors": ["535"]}
{"title": "Adaptive filter for speech enhancement in a noisy environment\n", "abstract": " A cabin communication system for improving clarity of a voice spoken within an interior cabin having ambient noise includes a microphone for receiving the spoken voice and the ambient noise and for converting the spoken voice and the ambient noise into an audio signal, the audio signal having a first component corresponding to the spoken voice and a second component corresponding to the ambient noise, a speech enhancement filter for removing the second component from the audio signal to provide a filtered audio signal, the speech enhancement filter removing the second component by processing the audio signal by a method taking into account elements of psycho-acoustics of a human ear, and a loudspeaker for outputting a clarified voice in response to the filtered audio signal.", "num_citations": "72\n", "authors": ["535"]}
{"title": "MAFT: A multicomputer architecture for fault-tolerance in real-time control systems\n", "abstract": " MAFT: a multicomputer architecture for fault-tolerance in real-time control systems | Tutorial: hard real-time systems ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksTutorial: hard real-time systemsMAFT: a multicomputer architecture for fault-tolerance in real-time control systems chapter MAFT: a multicomputer architecture for fault-tolerance in real-time control systems Share on Authors: Chris J Walter profile image CJ Walter View Profile , Roger M Kieckhafer profile image RM Kieckhafer View Profile , Alan M Finn profile image AM Finn View Profile Authors Info & Affiliations Publication: Tutorial: hard real-time systemsJanuary 1989 …", "num_citations": "66\n", "authors": ["535"]}
{"title": "Method and control for testing air filter condition in HVAC system\n", "abstract": " A method and control for determining an air filter condition in an HVAC system forces a change in a motor speed for a fan for driving air through the air filter and into an environment to be conditioned. When the motor speed is changed, an expected change in temperature in the environment is monitored. If the actual change is not as expected, a determination may be made that the air filter is clogged.", "num_citations": "62\n", "authors": ["535"]}
{"title": "Method for detecting a fault in an HVAC system\n", "abstract": " A bypass factor of an evaporator is used to indicate when an air filter of an HVAC is clogged. The bypass factor represents the amount of air that is bypassed without direct contact with the evaporator. As the air filter clogs, the bypass factor decreases. The bypass factor can also be used for early detection of clogging of the air filter. A first bypass factor is calculated by using the temperature measurements, and a second bypass factor is calculated by using the airflow rate of the air. The difference between the two bypass factors determines the error. An increase in the error indicates that the air filter is clogged. A coefficient of performance of the evaporator can also be calculated to detect if the air filter is clogged. A decrease in the coefficient of performance indicates that the air filter is clogged.", "num_citations": "57\n", "authors": ["535"]}
{"title": "Automatic volume control for communication system\n", "abstract": " An automatic gain control for a cabin communication system for improving clarity of a voice spoken within a movable interior cabin having ambient noise includes a microphone for receiving the spoken voice and the ambient noise and for converting the spoken voice and the ambient noise into a first audio signal having a first component corresponding to the spoken voice and a second component corresponding to the ambient noise, a filter for removing the second component from the first audio signal to provide a filtered audio signal, an acoustic echo canceller for receiving the filtered audio signal in accordance with a supplied dither signal and providing an echo-canceled audio signal, a control signal generating circuit for generating a first automatic gain control signal in response to a noise signal that corresponds to a current speed of the cabin, the first automatic gain control signal controlling a first gain of the …", "num_citations": "53\n", "authors": ["535"]}
{"title": "Sensor fault diagnostics and prognostics using component model and time scale orthogonal expansions\n", "abstract": " A method of diagnosing sensor faults for a heating, ventilation and air conditioning system includes the steps of creating a component model for a specific component within the system. The component model is created through the use of commonly available manufacturing data. Data within the system is input into the component model and compared to calculated and predicted values that are also calculated using the identical component models. Differences between the calculated and actual values is determined and compared to a threshold difference value. If the difference exceeds the threshold value, then a fault is detected. The specific type of sensor fault is determined using probability distribution analysis. Each type of sensor fault produces a different type of statistical deviation from normal distribution. By recognizing these patterns of deviations from the normal distribution, the specific type of fault such as …", "num_citations": "47\n", "authors": ["535"]}
{"title": "A two-step approach to see-through bad weather for surveillance video quality enhancement\n", "abstract": " Adverse weather conditions such as snow, fog or heavy rain greatly reduce the visual quality of outdoor surveillance videos. Video quality enhancement can improve the visual quality of surveillance videos providing clearer images with more details to better meet human perception needs and also improve video analytics performance. Existing work in this area mainly focuses on the quality enhancement for high-resolution videos or still images, but few algorithms are developed for enhancing surveillance videos, which normally have low resolution, high noises and compression artifacts. In addition, for snow or rain conditions, the image quality of near-field view is degraded by the obscuration of apparent snowflakes or raindrops, while the quality of far-field view is degraded by the obscuration of fog-like snowflakes or raindrops. Very few video quality enhancement algorithms have been developed to …", "num_citations": "46\n", "authors": ["535"]}
{"title": "Intention recognition for triggering voice recognition system\n", "abstract": " A method and intent recognition system that triggers voice recognition is provided. The intent recognition system includes an intent recognition device that detects a user location and/or behavior in a building and detects a triggering event based on the user location and/or behavior that suggests the user wants to input a service request, a prompt device that is triggered to provide a prompt based on the detecting by the intent recognition device and the detected triggering event, a listening device that receives an auditory input from the user, a signal processing device that processes the received auditory input and generates a control signal, and in-building equipment that receives the control signal from the signal processing device and controls the in-building equipment based on the control signal.", "num_citations": "40\n", "authors": ["535"]}
{"title": "Clock synchronization in MAFT\n", "abstract": " The steady-state clock synchronization algorithm of MAFT (multicomputer architecture for fault tolerance), an extremely reliable system for real-time applications, is discussed. The synchronization algorithm has been implemented in hardware and a system prototype constructed. The algorithm uses an interactive convergence approach, based on synchronized rounds of message transmission. The authors derive the maximum skew between nonfaulty clocks in terms of basic system parameters. The problem of detecting clock faults is also addressed, with attention to the minimum amount of synchronization error guaranteed to be unambiguously detected. The authors discuss the various practicalities which arise in the implementation of the algorithm as an integrated part of the whole system. Relationships between the synchronization subsystem and the total system are discussed.< >", "num_citations": "39\n", "authors": ["535"]}
{"title": "Systolic array computation of the singular value decomposition\n", "abstract": " Linear time computation of the singular value decomposition (SVD) would be useful in many real time signal processing applications. Two algorithms for the SVD have been developed for implementation on a quadratic array of processors. A specific architecture is proposed and we demonstrate the mapping of the algorithms to the architecture. The algorithms and architecture together have been verified by functional level and register transfer level simulation.", "num_citations": "37\n", "authors": ["535"]}
{"title": "Visual display of temperature differences for refrigerant charge indication\n", "abstract": " The sufficiency of refrigerant charge in an air conditioning system is determined by a comparison of two sensed temperatures in the system, one being the liquid line temperature and the other being either the outdoor temperature or the condenser coil temperature. In one embodiment the two sensed temperatures are displayed on respective thermochromic strips which are so calibrated and juxtaposed as to provide a visual indication, by the relative positions of the two displayed sensed temperatures, as to whether the refrigerant charge is adequate. In another embodiment, the sensed liquid line temperature is displayed by way of a plurality of LEDs and the other temperature is displayed by way of a marker on a temperature scale. If the two displayed temperatures are aligned, then the refrigerant charge is optimized, and if they are not aligned, the system is undercharged or overcharged.", "num_citations": "35\n", "authors": ["535"]}
{"title": "Beacon synchronization in wifi based systems\n", "abstract": " A wireless device comprises a transceiver and a scheduling system. The transceiver transmits and receives messages to and from an access point, and has a sleep mode from which it occasionally wakes at wakeup times to listen for beacons from the access point. The scheduling system schedules wakeup times according to historical beacon synchronization data.", "num_citations": "33\n", "authors": ["535"]}
{"title": "Cabin communication system\n", "abstract": " The present invention teaches a system for improving the clarity of a voice spoken within an enclosed space. The system comprises a first microphone, positioned at a first location, for receiving the audible communication and for converting the audible communication at the first location into a first audio signal. The system also comprises a loudspeaker for receiving the first audio signal, and for converting the first audio signal into a first reproduced audible communication, the reproduced audible communication also being fed back and received by the first microphone and converted with the audible communication into the first audio signal. Moreover, the system comprises an acoustic echo cancellation system for determining the relationship between the received audible communication by the first microphone and the first audio signal comprising both the audible communication and the reproduced audible …", "num_citations": "31\n", "authors": ["535"]}
{"title": "RFID and low resolution CCD sensor based positioning system\n", "abstract": " An apparatus and method for measuring a position of a moveable platform comprising a plurality of RFID tags encoded with location information situated at known locations and a plurality of visual markers situated at precise, known locations. An RF reader attached to a moveable platform reads the RFID tags to determine the approximate location of the platform. A camera apparatus attached to the moveable platform scans the visual marker. The scanned image is processed to provide the precise position information of the platform.", "num_citations": "30\n", "authors": ["535"]}
{"title": "System and method for automated defect detection utilizing prior data\n", "abstract": " A system and method for performing automated defect detection by utilizing data from prior inspections is disclosed. The system and method may include providing a image capture device for capturing and transmitting at least one current image of an object and providing a database for storing at least one prior image from prior inspections. The system and method may further include registering the at least one current image with the at least one prior image, comparing the registered at least one current image with the at least one prior image to determine a transformation therebetween and updating the database with the at least one current image.", "num_citations": "28\n", "authors": ["535"]}
{"title": "Cabin communication system without acoustic echo cancellation\n", "abstract": " A cabin communication system for improving clarity of a voice spoken within an interior cabin uses a microphone array including a first microphone, positioned at a first location within the cabin, for receiving the spoken voice primarily in a first direction and for converting the spoken voice into a first audio signal, and a second microphone, positioned at a second location within the cabin, for receiving the spoken voice primarily in the first direction and for converting the spoken voice into a second audio signal. A sound source, such as the speaker of an entertainment system, inputs sound into the cabin such that the input sound approaches the microphone array primarily in a second direction different from the first direction. A processor combines the first and second audio signals to provide a resultant audio signal, wherein the combining of the first and second audio signals defines a beampattern of the microphone …", "num_citations": "28\n", "authors": ["535"]}
{"title": "Method and system for position control based on automated defect detection feedback\n", "abstract": " A computer program product and method for performing position control on device members that have been identified as defective. The method may include providing a storage medium that stores data and programs used in processing images and a processing unit that processes the images, receiving, by the processing unit from an image capture device coupled to the processing unit, a set of images of a plurality of members inside of a device, detecting, by the processing unit, a defect in a first member of the plurality of members, and providing instructions to move the first member to an inspection position in the device. The device may be an engine and the members may be blades within the engine.", "num_citations": "26\n", "authors": ["535"]}
{"title": "System and method for automated borescope inspection user interface\n", "abstract": " A system and method for improving human-machine interface while performing automated defect detection is disclosed. The system and method may include an image capture device for capturing and transmitting data of an object, performing automated analysis of the data and reviewing results of the automated analysis by a human inspector and providing feedback. The system and method may further include refining the automated analysis of the data based upon the feedback of the human inspector.", "num_citations": "25\n", "authors": ["535"]}
{"title": "Traffic list generation for passenger conveyance\n", "abstract": " A passenger tracking system includes a multiple of sensors for capturing depth map data of objects. A processing module in communication with the multiple of sensors to receive the depth map data, the processing module uses the depth map data to track an object and calculate passenger data associated with the tracked object to generate a passenger tracking list that tracks each individual passenger in the passenger data from an origin lobby to a destination lobby and through an in-car track between the origin lobby and the destination lobby.", "num_citations": "24\n", "authors": ["535"]}
{"title": "Method and system for automated defect detection\n", "abstract": " A computer program product and method for performing automated defect detection of blades within an engine is disclosed. The method may include providing a storage medium for storing data and programs used in processing video images, providing a processing unit for processing images, receiving from a borescope an initial set of images of a plurality of members inside of a device, and using the processing unit to apply Robust Principal Component Analysis to decompose the initial set of images into a first series of low rank component images and a second series of sparse component images, wherein there are at least two images in the initial series.", "num_citations": "24\n", "authors": ["535"]}
{"title": "System and method for data-driven automated borescope inspection\n", "abstract": " A system and method for performing automated defect detection of blades within an engine is disclosed. The system and method may include an image capture device capable of capturing and transmitting images of a plurality of blades of an engine, creating a normal blade model of an undamaged one of the plurality of blades and determining defects within the plurality of blades by utilizing the normal blade model.", "num_citations": "24\n", "authors": ["535"]}
{"title": "Passive ultrasonic RFID elevator positioning reference system\n", "abstract": " An apparatus for measuring a position of a moveable platform includes a plurality of transponder modules. The transponder modules include an electromagnetic transmitter adapted to emit an electromagnetic signal, and an acoustic receiver adapted to receive an acoustic signal. At least two of the plurality of transponders are disposed about the position to be measured. The apparatus also includes at least one transceiver module affixed to the moveable platform, which transceiver modules includes an acoustic transmitter adapted to emit an acoustic signal, an electromagnetic receiver adapted to receive an electromagnetic signal. The apparatus also includes a timing mechanism for measuring a plurality of durations between an emission of the acoustic signal and a receipt of the electromagnetic signal, and a computing mechanism for processing the plurality of durations to compute the position.", "num_citations": "24\n", "authors": ["535"]}
{"title": "Method and control for determining low refrigerant charge\n", "abstract": " A refrigerant system is provided with a method and a control programmed to perform the method, in which a low charge of refrigerant is identified. The mass flow of refrigerant through the system is calculated utilizing at least two different methods. The two calculated mass flow rates are compared, and if they differ by more than predetermined amount, a determination is made that there is a low charge of refrigerant within the system.", "num_citations": "24\n", "authors": ["535"]}
{"title": "Real-time content adaptive contrast enhancement for see-through fog and rain\n", "abstract": " In this paper we present a novel algorithm for improving the visibility of surveillance videos degraded by fog and/or rain. The proposed algorithm adaptively enhances the global and local contrast of a surveillance video. The algorithm is inspired on the human visual system, and accounts for the perceptual sensitivity to noise, compression artifacts, and the texture of image content. The model is combined with the classic Contrast Limited Adaptive Histogram Equalization (CLAHE) method to adaptively enhance surveillance videos. We have implemented a real-time video enhancement system and performed extensive experimental testing over a video database containing common surveillance videos recorded under fog and rain conditions. The proposed approach significantly improves the visual quality of surveillance videos by removing fog/rain effects, as well as reducing noise and artifacts.", "num_citations": "23\n", "authors": ["535"]}
{"title": "Virtual load monitoring system and method\n", "abstract": " A method and system estimates a desired output signal waveform based on measured state parameters. A model training step generates a model by empirically obtaining measured signal waveforms corresponding to measured state parameters. Features, such as mode shapes and mode amplitudes, are extracted from the measured signals and stored in an estimation model along with coefficients of the model that correlate measured state parameters with the mode amplitudes. During part operation, the state parameters measured during operation are entered into the estimation model to obtain estimated features in a estimated signal waveform. The estimated features are then used to synthesize the estimated signal reflecting the actual operation of the operating part. The estimation model therefore allows estimation of an entire signal waveform from the state parameters.", "num_citations": "23\n", "authors": ["535"]}
{"title": "Voter subsystem for a fault tolerant multiple node processing system\n", "abstract": " A voter subsystem for a multiple node fault tolerant system having an upper medial value sorter for sorting a plurality of received values to generate an upper medial value and a lower medial value sorter for sorting the same plurality of received values to generate a lower medial value. An averaging circuit adds the upper and lower medial values then divides by two to generate a voted value. A deviance checker checks each of the plurality of received values against the voted value to generate a deviance error for each received value which differed from the voted value by a predetermied amount. A loader loads the plurality of received values into the upper and lower medial value sorters and the deviance checker bit-by-bit, starting from the most significant bit positions through the least significant bit positions. The upper and lower medial value sorters and deviance checker process the received values on-the-fly in …", "num_citations": "23\n", "authors": ["535"]}
{"title": "User interface for communication system\n", "abstract": " An improved user interface is installed in the cabin of a vehicle incorporating a cabin communication system using acoustic echo cancellation for improving the ease and flexibility of the cabin communication. Separate controls at each seat location enable the person occupying that seat to selectively converse with other occupants in the vehicle, create a recorded message and/or place a telephone call.", "num_citations": "22\n", "authors": ["535"]}
{"title": "Method and device for consistent region of interest\n", "abstract": " The present invention describes a system and method for surveillance cameras that maintain proper mapping of a mapped region of interest with an imaged region of interest based on feedback received regarding the current orientation of a surveillance camera. The system or method first determines the location of the imaged region of interest within the surveillance camera's imaged current field of view based on mechanical or imaged feedback, or a combination of both. The system or method then remaps the mapped region of interest within the surveillance camera's imaged current field of view such that the mapped region of interest is coextensive with the imaged region of interest.", "num_citations": "21\n", "authors": ["535"]}
{"title": "System for computationally efficient active control of tonal sound or vibration\n", "abstract": " A noise or vibration control system reduces a sampling rate and reduces a control rate to improve computation efficiency. The present invention permits the use of a sample frequency (f s) that is less than twice the frequency of interest (f d). The sensed signals are filtered to extract a particular frequency range with a lower bound given by (2n− 1)* f s/2 and an upper bound given by (2n+ 1)* f s/2, where n is an integer chosen so that the frequency of interest (f d) is within the extracted frequency range. The control commands are also calculated at a reduced rate, which is dependent upon the bandwidth of the tone, rather than the absolute frequency of the tone. Rather than updating the control signals directly on the sampled sensor data y k as it enters the computer, the control computations are done on the harmonic components a k and b k, or equivalently on the magnitude and phase.", "num_citations": "21\n", "authors": ["535"]}
{"title": "System and method for video-quality enhancement\n", "abstract": " A video enhancement system provides automatic enhancement to video data that includes the presence of obscurations. The system provides near-field enhancement of the video data by detecting the presence of near-field obscurations such as snowflakes/raindrops and determining whether the detected obscurations are located over background pixels or foreground objects. The detected obscuration pixels are filled-in depending on whether they are located over the background or foreground to create an enhanced image. The system may also provide local/global adaptive contrast enhancement to enhance video in the presence of far-field obscurations.", "num_citations": "20\n", "authors": ["535"]}
{"title": "Sparsity-inspired image reconstruction for electrical capacitance tomography\n", "abstract": " We present a new image reconstruction method for Electrical Capacitance Tomography (ECT). ECT image reconstruction is generally ill-posed because the number of measurements is small whereas the image dimensions are large. Here, we present a sparsity-inspired approach to achieve better ECT image reconstruction from the small number of measurements. Our approach for ECT image reconstruction is based on Total Variation (TV) regularization. We apply an efficient Split-Bregman Iteration (SBI) approach to solve the problem. We also propose three metrics to evaluate image reconstruction performance, i.e., a joint metric of positive reconstruction rate (PRR) and false reconstruction rate (FRR), correlation coefficient, and a shape and location metric. The results on both synthetic and real data show that the proposed TV-SBI method can better preserve the edges of images and better resolve different objects …", "num_citations": "20\n", "authors": ["535"]}
{"title": "Spatial-temporal structural and dynamics features for Video Fire Detection\n", "abstract": " We present a new Video Fire Detection (VFD) system for surveillance applications in fire and security industries. The system consists of three modules: pixel-level processing to identify potential fire blobs, blob-based spatial-temporal feature extraction, and a Support Vector Machine (SVM) classifier. The proposed novel spatial-temporal features include a spatial-temporal structural feature and a spatial-temporal contour dynamics feature. The spatial-temporal structural features are extracted from an accumulated motion mask (AMM) and an accumulated intensity template (AIT), capturing the concentric ring structure of fire intensity. The spatial-temporal dynamics features are based on the Fourier descriptor of contours in space and time, capturing the dynamic properties of fire. These global blob-based features are more robust and effective in rejecting false alarms and nuisance sources than pixel-wise features. In …", "num_citations": "20\n", "authors": ["535"]}
{"title": "Nuisance alarm filter\n", "abstract": " An alarm filter (22) for use in a security system (14) to reduce the occurrence of nuisance alarms receives sensor signals (S 1-S n, S v) from a plurality of sensors (18, 20) included in the security system (14). The alarm filter (22) produces an opinion output as a function of the sensor signals and selectively modifies the sensor signals as a function of the opinion output to produce verified sensor signals (S 1′-S n′).", "num_citations": "20\n", "authors": ["535"]}
{"title": "Auto commissioning system and method\n", "abstract": " An auto-calibration system for a passenger conveyance system includes a depth-sensing sensor deposed within a passenger conveyance enclosure or deposed within a passenger waiting area external to the conveyance enclosure for capturing depth map data of objects within a field of view. A processing module is in communication with the depth-sensing sensor to receive the depth map data, the processing module uses the depth map data to calibrate the sensor coordinate system to the world coordinate system.", "num_citations": "19\n", "authors": ["535"]}
{"title": "System and method for multiple simultaneous automated defect detection\n", "abstract": " A system and method for performing automated defect detection using multiple image capture devices is disclosed. The system and method may include providing a plurality of image capture devices, the plurality of image capture devices capturing and transmitting a plurality of images of an object. The system and method may further include determining a feature correspondence between the plurality of images of the plurality of image capture devices, creating mosaiced images of the plurality of images if the feature correspondence is found or known and performing at least of an automated analysis and a manual inspection on the mosaiced images to find any defects in the object.", "num_citations": "19\n", "authors": ["535"]}
{"title": "Elevator cab locating system including wireless communication\n", "abstract": " An elevator system (20) includes wireless communicating portions (40, 42) that communicate with each other to provide elevator cab (22) position information within a hoistway (24). In one example, a first communicating portion (40) is supported on the elevator cab (22) that generates a radio frequency trigger signal (58) that is received by a second communicating portion (42) at a selected position along the hoistway (24). The second communicating portion (42) responsively generates an ultrasound signal (64) that is received by the first communicating portion (40). A characteristic of the received locating signal, such as the timing between the trigger signal and the receipt of the locating signal, provides position information regarding the cab within the hoistway.", "num_citations": "19\n", "authors": ["535"]}
{"title": "Random imaging\n", "abstract": " An image processing system comprises a filter associated with a sensor array, which is operable to capture an image. The filter is provided to separate a plurality of distinct qualities of light from the scene to be captured. The filter has filter portions associated with the plurality of distinct qualities of light which are spatially pseudo-randomly ordered relative to each other. The image processing system also comprises an image reconstruction algorithm specifically designed to operate with the filter.", "num_citations": "18\n", "authors": ["535"]}
{"title": "Supercritical pressure regulation of vapor compression system by regulation of adaptive control\n", "abstract": " A vapor compression system includes a compressor, a gas cooler, an expansion device, and an evaporator. Refrigerant is circulated through the closed circuit cycle. Preferably, carbon dioxide is used as the refrigerant. Adaptive control is employed to optimize the coefficient of performance of the vapor compression system. As the system changes over time, a model that operates the system is modified. The model is determined by an adaptive control algorithm including variable coefficients. As the model changes, the variables of the adaptive control algorithm change. A control of the gas cooler is then adjusted to regulate the high pressure of the system, and therefore the coefficient of performance. In a first example, Least Mean Squares (LMS) is used to modify the variables of the adaptive control algorithm to optimize the coefficient of performance. In a second example, the coefficient of performance is optimized by …", "num_citations": "18\n", "authors": ["535"]}
{"title": "Method and system for automated inspection utilizing a multi-modal database\n", "abstract": " A method and system for performing automated defect detection is disclosed. The system may include at least one database, an image capture device and a processor. The method may comprise providing at least one database for storing information used in processing data to detect a defect in at least one member of a plurality of members in a device. The information may include a plurality of different modes of data. The method may further comprise providing a processing unit for processing the information; receiving, by the database, updates to the information; identifying a potential defect in a first mode of data; applying, by the processing unit, analysis of a second mode of data, the analysis of the second mode of data triggered by the identifying, the second mode of data different than the first mode of data; and reporting defects based on the results of the applying.", "num_citations": "16\n", "authors": ["535"]}
{"title": "Systems and methods for detecting damage\n", "abstract": " A system and method of detecting damage to a component may include a first sensor and a processor. The method may include the steps of receiving, by the processor, a first data for the component from a first sensor, aligning, by the processor, the first data with a reference model, determining, by the processor, a feature dissimilarity between the first data and the reference model, classifying, by the processor, the feature dissimilarity, and determining, by the processor, a probability that the feature dissimilarity indicates damage to the component.", "num_citations": "16\n", "authors": ["535"]}
{"title": "Structural masking for progressive health monitoring\n", "abstract": " A method of structural masking for progressive health monitoring of a structural component includes receiving a current image of the structural component. A processor aligns the current image and a reference image of the structural component. The processor performs a structure estimation on the current image and the reference image to produce a current structure estimate image and a reference structure estimate image. The processor generates a structural mask from the reference structure estimate image. The processor masks the current structure estimate image with the structural mask to identify one or more health monitoring analysis regions including a potential defect or damaged area appearing in the masked current structure estimate image that does not appear in the reference structure estimate image.", "num_citations": "14\n", "authors": ["535"]}
{"title": "Depth sensor based passenger sensing for passenger conveyance control\n", "abstract": " A passenger conveyance system includes a depth-sensing sensor for capturing depth map data of objects within a field of view adjacent a passenger conveyance door. A processing module in communication with the depth-sensing sensor to receive the depth map data, the processing module uses the depth map data to track an object and calculate passenger data associated with the tracked object, and a passenger conveyance controller to receive the passenger data from the processing module, wherein the passenger conveyance controller controls a passenger conveyance dispatch control function in response to the passenger data.", "num_citations": "14\n", "authors": ["535"]}
{"title": "Depth sensor based passenger sensing for passenger conveyance door control\n", "abstract": " An passenger conveyance system includes a depth-sensing sensor within a passenger conveyance enclosure for capturing depth map data of objects within a field of view that includes a passenger conveyance door. A processing module is in communication with the depth-sensing sensor to receive the depth map data, the processing module uses the depth map data to track an object and calculate passenger data associated with the tracked object. a passenger conveyance controller receives the passenger data from the processing module to control operation of a passenger conveyance door in response to the passenger data.", "num_citations": "14\n", "authors": ["535"]}
{"title": "Depth sensor based passenger detection\n", "abstract": " A passenger conveyance system includes a depth-sensing sensor within a passenger conveyance enclosure for capturing depth map data of objects within a field of view that includes a passenger conveyance door. A processing module in communication with the depth-sensing sensor to receive the depth map data, the processing module uses the depth map data to determine that the passenger conveyance enclosure is empty. a passenger conveyance controller receives the passenger data from the processing module to control operation of a passenger conveyance door in response to an empty car determination.", "num_citations": "14\n", "authors": ["535"]}
{"title": "High dynamic range image sensor\n", "abstract": " An image processing system has a sensor array with a plurality of pixels. A distinct circuit is associated with each pixel in the sensor array. The circuits are designed such that across the plurality of circuits, there are a plurality of distinct sensitivities to irradiance from a scene to be captured which are spatially pseudo-randomly ordered relative to each other. The image processing system also comprises an image reconstruction algorithm. A method is also disclosed.", "num_citations": "14\n", "authors": ["535"]}
{"title": "SYSTEMS AND METHODS FOR IMAGE-BASED QUANTIFICATION FOR ALLERGEN SKIN REACTION\n", "abstract": " A method of image-based quantification for allergen skin reaction includes imaging an area of skin that has been subject to a skin-prick test to produce one or more images of the area. The method includes identifying regions of wheal and/or flare in the one or more images of the area and quantifying weal and/or flare indicators based on the regions identified. The method also includes outputting results of the quantified wheal and/or flare indicators indicative of quantified allergen skin reaction.", "num_citations": "13\n", "authors": ["535"]}
{"title": "System and method to determine visible damage\n", "abstract": " A method of calculating an amount of visible damage on a component includes capturing an image of the component, identifying an area of visible damage, calculating a size of the area, and communicating the size of visible damage to a storage device. A system for evaluating coating loss is also disclosed.", "num_citations": "13\n", "authors": ["535"]}
{"title": "SYSTEM AND METHOD FOR VIDEO BASED FIRE DETECTION\n", "abstract": " A method for recognizing fire using block-wise processing of video input provided by a video detector. Video input is divided into a plurality of frames (42), and each frame is divided into a plurality of blocks (44). Video metrics are calculated with respect to each of the plurality of blocks (46), and blocks containing the presence of fire are identified based on the calculated video metrics (74). The detection of a fire is then communicated to an alarm system.", "num_citations": "13\n", "authors": ["535"]}
{"title": "System effects of single event upsets\n", "abstract": " Single Event Upsets (SEUs) pose a serious threat to computer reliability and longevity. SEU effects are found at sea level, in airborne avionics, and in space. At the system level, SEUs in processors are controlled by replication and voting, watchdog processors, and tagged data schemes. SEUs in memory subsysterns are controlled by periodically scrubbing words protected by an Error Control C'ode (ECC). The rate of menlory scrubbing affects the performance and reliability of the entire computer system. There are tradeoffs between using radiationhardened senliconductors, scrubbing rates, and ECC capabilities. Previous tradeoff analyses have used sirnplified analytic models.The system effects of SEUs may be evaluated by Markov modeling. Markov modeling has been extensively used for modeling processor redundancy; here it is also used for memory subsystems. A nodel ling methodology is presented which …", "num_citations": "13\n", "authors": ["535"]}
{"title": "Depth sensor based passenger sensing for empty passenger conveyance enclosure determination\n", "abstract": " A passenger conveyance system, includes a depth-sensing sensor within a passenger conveyance enclosure for capturing sensor data from within the passenger conveyance enclosure; a processing module in communication with the depth-sensing sensor to receive the sensor data, the processing module uses the depth-sensing sensor data to determine that the passenger conveyance enclosure is empty; and a passenger conveyance controller to receive the empty passenger conveyance enclosure determination from the processing module to control operation of the passenger conveyance system in response to the empty passenger conveyance enclosure determination.", "num_citations": "12\n", "authors": ["535"]}
{"title": "System and method for video detection of smoke and flame\n", "abstract": " A method for detecting flame and smoke using spatial analysis of video input (40) provided by a video detector. The video input (40) consists of a number of individual frames, wherein analysis is performed on each individual frame to detect and outline regions that may contain smoke or flame (42). Based on the defined outline or boundary of each detected region, spatial features associated with the region are extracted (52), such as perimeter/area and surface area/volume. The extracted spatial features are related to one another (54) to determine the likelihood that the region contains smoke or flame. Extracted spatial features may be related to one another using a power law relationship that provides an indication of the turbulence associated with a bounded region, wherein turbulence is a characteristic of both flame and smoke.", "num_citations": "12\n", "authors": ["535"]}
{"title": "Video Fire Detection–Techniques and Applications in the Fire Industry\n", "abstract": " Video fire detectors use a relatively new technology compared with traditional heat sensors, smoke sensors, or gas detectors. We first review different fire detection methods and put video fire detection into the general fire detection arena. We then review various video fire detection methods, including those for both flame detection and smoke detection. We next describe our contributions to this area of research. We conclude with our thoughts for the challenges in this field and predict promising research directions.", "num_citations": "12\n", "authors": ["535"]}
{"title": "Systems and methods for positioning a hoist and hook\n", "abstract": " Systems and methods for operating a hoist and hook assembly may determine a position of a target using a position sensor. A hook assembly may be positioned in response to the position of the target as detected by the position sensor. Positioning the hook assembly may include articulating a boom coupled to a hoist, using one or more local thrust sources on the hook assembly, and/or moving an airframe relative to the position of the target.", "num_citations": "11\n", "authors": ["535"]}
{"title": "MULTIMODAL FUSION FOR OBJECT DETECTION\n", "abstract": " A method of image-based quantification for allergen skin reaction includes imaging an area of skin that has been subject to a skin-prick test to produce one or more images of the area. The method includes identifying regions of wheal and/or flare in the one or more images of the area and quantifying weal and/or flare indicators based on the regions identified. The method also includes outputting results of the quantified wheal and/or flare indicators indicative of quantified allergen skin reaction.", "num_citations": "11\n", "authors": ["535"]}
{"title": "IMAGE CORRECTION AND METROLOGY FOR OBJECT QUANTIFICATION\n", "abstract": " A method of image-based quantification for allergen skin reaction includes imaging an area of skin that has been subject to a skin-prick test to produce one or more images of the area. The method includes identifying regions of wheal and/or flare in the one or more images of the area and quantifying weal and/or flare indicators based on the regions identified. The method also includes outputting results of the quantified wheal and/or flare indicators indicative of quantified allergen skin reaction.", "num_citations": "11\n", "authors": ["535"]}
{"title": "Device and method for self-aligning position reference system\n", "abstract": " A positioning system for a moveable platform comprising at least one active array comprised of at least one light emitting element for transmitting a binary encoded identification, where the encoding may be spatial or temporal, positioned at a known location, at least one camera for acquiring an image of the at least one active array, component for receiving the binary encoded identification from the image, component for processing the image to determine the position of the active array with respect to the moveable platform, and component for combining the received binary encoded identification and the determined position to calculate a position of the moveable platform.", "num_citations": "11\n", "authors": ["535"]}
{"title": "A fast implementation of the complex singular value decomposition on the Connection Machine\n", "abstract": " An algorithm suitable for signal processing applications of the complex singular value decomposition (SVD), and its implementation on the Connection Machine, are described. Many approaches to high-resolution array signal processing require the computation of a complex SVD. For small matrices, the SVD may be computed in a reasonable amount of time on very fast uniprocessors. For larger matrices, a special-purpose systolic array may be designed to compute the SVD, at the expense of programmability. As an alternative, massively parallel machines such as the Connection Machine may be candidates for performing high-resolution signal processing on large arrays.", "num_citations": "11\n", "authors": ["535"]}
{"title": "Depth sensor based sensing for special passenger conveyance loading conditions\n", "abstract": " A passenger conveyance special loading system includes a depth-sensing sensor for capturing depth map data of objects within a field of view. A processing module in communication with the depth-sensing sensor receives the depth map data, the processing module uses the depth map data calculate passenger data associated with an object to determine a special loading condition. A passenger conveyance controller receives the passenger data from the processing module, the passenger conveyance controller controls a passenger conveyance dispatch control function in response to the special loading condition.", "num_citations": "10\n", "authors": ["535"]}
{"title": "Intelligent building system for providing elevator occupancy information with anonymity\n", "abstract": " A system and/or method for detecting an occupancy of an elevator cab of an elevator to generate occupancy information is provided. The system and/or method further generates anonymized occupancy information based on the occupancy information and provides the anonymized occupancy information to enable the occupancy of the elevator cab to be presented with anonymity for occupants.", "num_citations": "10\n", "authors": ["535"]}
{"title": "Systems and methods for user machine interaction for image-based metrology\n", "abstract": " A method of image-based quantification for allergen skin reaction includes imaging an area of skin that has been subject to a skin-prick test to produce one or more images of the area. The method includes identifying regions of wheal and/or flare in the one or more images of the area and quantifying weal and/or flare indicators based on the regions identified. The method also includes outputting results of the quantified wheal and/or flare indicators indicative of quantified allergen skin reaction.", "num_citations": "10\n", "authors": ["535"]}
{"title": "Sensors for conveyance control\n", "abstract": " A method includes generating a depth stream from a scene associated with a conveyance device; processing, by a computing device, the depth stream to obtain depth information; recognizing a gesture based on the depth information; and controlling the conveyance device based on the gesture.", "num_citations": "10\n", "authors": ["535"]}
{"title": "SYSTEMS AND METHODS FOR IMAGE METROLOGY AND USER INTERFACES\n", "abstract": " A method of image-based quantification for allergen skin reaction includes imaging an area of skin that has been subject to a skin-prick test to produce one or more images of the area. The method includes identifying regions of wheal and/or flare in the one or more images of the area and quantifying weal and/or flare indicators based on the regions identified. The method also includes outputting results of the quantified wheal and/or flare indicators indicative of quantified allergen skin reaction.", "num_citations": "10\n", "authors": ["535"]}
{"title": "Image reconstruction for electrical capacitance tomography exploiting sparsity\n", "abstract": " We present a new image reconstruction method for Electrical Capacitance Tomography (ECT) by exploiting the sparsity of reconstructed images. ECT image reconstruction is generally ill-posed because the number of measurements is small whereas the image dimensions are large. Inspired by recent developments in Compressive Sensing (CS), given the sparsity of the signal (image), our idea is to apply an efficient and stable algorithm through L 1  regularization to recover the sparse signal with sufficient measurements that have cardinality comparable to the sparsity of the signal. In this paper, we apply an efficient GPSR (Gradient Projection for Sparse Reconstruction) algorithm to reconstruct the sparse signal under DCT basis (GPSR-DCT). Our results on real data show that the proposed GPSR-DCT algorithm can better preserve object boundary and shape, as compared to a representative state-of-the-art ECT …", "num_citations": "10\n", "authors": ["535"]}
{"title": "Position reference system for elevators\n", "abstract": " A position reference system for use with a conveyance, such as an elevator (12). The system includes a code affixed to or embedded within a suspension device or primary motion coupling such as a rope or coated steel belt (16). A reader (28) in a fixed location determines the position of the conveyance.", "num_citations": "10\n", "authors": ["535"]}
{"title": "Surveillance centric coding\n", "abstract": " In this paper we introduce the paradigm of Surveillance Centric Coding (SCC), in which coding aims to achieve bit- rate optimisation and adaptation of surveillance videos for storing and transmission purposes. In the proposed approach the SCC encoder communicates with Video Content Analysis (VCA) module that detects events of interests in video captured by CCTV. Bit-rate optimization and adaptation is achieved by exploiting the scalability properties of the employed codec. Time segments containing events relevant to surveillance application are encoded using high spatio- temporal resolution and quality while the irrelevant portions from the surveillance standpoint are encoded at low spatio- temporal resolution and / or quality. Thanks to the scalability of the produced compressed bit-stream, additional bit-rate adaptation is possible, for instance for the transmission purposes. Experimental evaluation shows …", "num_citations": "10\n", "authors": ["535"]}
{"title": "Method for estimating inlet and outlet air conditions of an HVAC system\n", "abstract": " The temperature of the air exiting an evaporator and the relative humidity of the air entering and exiting the evaporator can be calculated by using existing sensors in a vapor compression system. The temperature of the air exiting the evaporator is calculated by using the detected temperature of the air entering the evaporator, the saturation temperature of the air, and a bypass factor. The relative humidity of the air entering and exiting the evaporator are then estimated using a psychrometric chart. By using the existing sensors to determine the temperature of the air exiting the evaporator and the relative humidity of the air entering and exiting the evaporator, the load requirement of the vapor compression system can be calculated without employing additional sensors. The system capacity of the vapor compression system can be matched to the load requirement to allow the effective use of electric power.", "num_citations": "10\n", "authors": ["535"]}
{"title": "AUTOMATIC VIDEO QUALITY MONITORING FOR SURVEILLANCE CAMERAS\n", "abstract": " A system for automatically determining video quality receives video input from one or more surveillance cameras (16 a, 16 b... 16N), and based on the received input calculates a number of video quality metrics (40). The video quality metrics are fused together (42), and provided to decision logic (44), which determines, based on the fused video quality metrics, the video quality provided by the one or more surveillance cameras (16 a, 16 b... 16N). The determination is provided to a monitoring station (24).", "num_citations": "10\n", "authors": ["535"]}
{"title": "System and method for video detection of smoke and flame\n", "abstract": " A video recognition system detects the presence of fire based on video data provided by one or more video detectors. The video recognition system divides each individual frame of video data into a plurality of frame elements and calculates with respect to each frame element a structural feature that the algorithm uses to identify a core region of potential fire. The video recognition system defines a region surrounding the core region and calculates with respect to each frame element within the surrounding region a temporal feature. Based on the calculated temporal feature, the video recognition system associates a representative temporal value with the core region. Based on the structural and temporal features associated with the core region, video recognition system determines whether the video data indicates the presence of fire.", "num_citations": "9\n", "authors": ["535"]}
{"title": "System and method for video detection of smoke and flame\n", "abstract": " A video recognition system detects the presence of fire based on video data provided by one or more video detectors. The video recognition system divides each individual frame of video data into a plurality of frame elements and calculates with respect to each frame element a structural feature that the algorithm uses to identify a core region of potential fire. The video recognition system defines a region surrounding the core region and calculates with respect to each frame element within the surrounding region a temporal feature. Based on the calculated temporal feature, the video recognition system associates a representative temporal value with the core region. Based on the structural and temporal features associated with the core region, video recognition system determines whether the video data indicates the presence of fire.", "num_citations": "9\n", "authors": ["535"]}
{"title": "Refrigerant charge status indication method and device\n", "abstract": " A method and apparatus for determining the sufficiency of the refrigerant charge in an air conditioning system by use of temperature measurements. The temperature of the liquid refrigerant leaving the condenser coil and the outdoor temperature are sensed and representative electrical signals are generated. The electrical signals are converted to digital values that are than compared to predetermined optimal values to determine whether the system is properly charged with refrigerant. An appropriate LED is lighted to indicate that the system is undercharged, overcharged or properly charged. For non-TXV/EXV systems a third parameter ie the return air wet bulb temperature is also sensed and a representative digital value thereof is included in the comparison with the predetermined known values to determine if the charge is proper.", "num_citations": "9\n", "authors": ["535"]}
{"title": "Electromagnetic/ultrasonic roll-calling/answering (EURA) system for elevator positioning\n", "abstract": " A positioning system for an elevator cab (37) includes transponder modules (10) having a unique ID for receiving a signal (39) and emitting an ultrasonic signal when the signal is equivalent to the unique ID with a determination of position based on the time duration of the signals.", "num_citations": "9\n", "authors": ["535"]}
{"title": "System and method for fan blade rotor disk and gear inspection\n", "abstract": " A system for component inspection comprising at least one sensor configured to capture sensor data of the component; and a processor coupled to the at least one sensor, the processor comprising at least one model configured to separate the sensor data into a normal category and an abnormal category.", "num_citations": "8\n", "authors": ["535"]}
{"title": "Monitoring system of a passenger conveyor and monitoring method thereof\n", "abstract": " The present invention relates to the field of passenger conveyor technologies, and provides a monitoring system of a passenger conveyor and a monitoring method thereof. In the monitoring system and detection method of the present invention, a monitored object of the passenger conveyor is sensed by using an imaging sensor and/or a depth sensing sensor to acquire a data frame, and the data frame is analyzed by a processing apparatus to monitor whether the monitored object is in a normal state. The monitored object may include a landing plate, a step, a barrier used in a maintenance and repair working condition and/or a step speed, and the like.", "num_citations": "8\n", "authors": ["535"]}
{"title": "A context-driven approach to image-based crack detection\n", "abstract": " We present a novel context-driven approach to image-based crack detection for automated inspection of aircraft surface and subsurface defects. In contrast to existing image-based crack detection methods, which rely mostly on low-level image processing and data-driven methods, our method explicitly incorporates multiple high-level context into low-level processing. We present two classes of context: geometric/structural context and physical context. We formulate mathematically a sparse decomposition problem to incorporate the context and apply robust principal component analysis to decompose typical repetitive rivet regions into a normal component and a sparse component. Cracks are detected in the sparse component. By applying the proposed context-driven approach to coated and uncoated test specimens, we achieve significant reduction in false detections compared to the approach without …", "num_citations": "8\n", "authors": ["535"]}
{"title": "System and method for auto-commissioning an intelligent video system\n", "abstract": " An auto-commissioning system provides automatic parameter selection for an intelligent video system based on target video provided by the intelligent video system. The auto-commissioning system extracts visual feature descriptors from the target video and provides the one or more visual feature descriptors associated with the received target video to an parameter database that is comprised of a plurality of entries, each entry including a set of one or more stored visual feature descriptors and associated parameters tailored for the set of stored visual feature descriptors. A search of the parameter database locates one or more best matches between the extracted visual feature descriptors and the stored visual feature descriptors. The parameters associated with the best matches are returned as part of the search and used to commission the intelligent video system.", "num_citations": "8\n", "authors": ["535"]}
{"title": "Elevator active suspension utilizing respulsive magnetic force\n", "abstract": " An elevator includes a car follower associated with each of a pair of guide rails, and carrying electromagnets which are spaced from electromagnets on an elevator car. The electromagnets on the car and car follower create a repulsive force tending to center the car between the car follower electromagnets associated with the two guide rails. Preferably, the car follower electromagnets are interconnected into a single car follower such that they move together.", "num_citations": "8\n", "authors": ["535"]}
{"title": "Adaptive signal separation system and method\n", "abstract": " A method of reducing undesired components from a signal that includes a desired component and undesirable components utilizes an autoregressive model technique. An autoregressive module determines a power spectral density approximation of the signal. An error component of the power spectral density approximation includes the desired component. Portions of the error component having frequencies outside of the expected range of the desired component preferably are filtered so that the result is the desired component with the undesired component removed. The invention is useful, for example, for reducing undesirable noise components from sound signals.", "num_citations": "8\n", "authors": ["535"]}
{"title": "Differential magnetic alignment of an elevator and a landing\n", "abstract": " An apparatus for determining if an elevator car is level with respect to a landing comprises: a first magnet disposed proximate to the landing; a second magnet disposed proximate to the landing; a sensor for providing a level signal in response to detecting a minimum flux region formed by the first and second magnets; and a processor for determining if the elevator is level with respect to the landing in response to the level signal. Each magnet has a first and second magnetic pole. The first and second magnets are adjacently aligned such that the first magnetic pole of the first magnet is adjacent to the first magnetic pole of the second magnet, and the second magnetic pole of the first magnet is adjacent to the second magnetic pole of the second magnet.", "num_citations": "8\n", "authors": ["535"]}
{"title": "Elevator passenger tracking control and call cancellation system\n", "abstract": " A passenger conveyance passenger tracking control system that controls operation of a passenger conveyance, eg, an elevator car, includes at least one call request device, eg, a call request panel, configured to receive at least one input from at least one passenger located at a occupancy depth grid. At least one passenger position three-dimensional (3-D) depth-sensing sensor is configured to track a position of the at least one passenger located at the occupancy depth grid. The passenger conveyance passenger tracking control system further includes an electronic control module in signal communication with the at least one call request device and at least one passenger position 3-D depth-sensing sensor. The electronic control module is configured to control operation of the passenger conveyance based on the position of the at least one passenger.", "num_citations": "7\n", "authors": ["535"]}
{"title": "AUTO COMMISSIONING SYSTEM AND METHOD\n", "abstract": " An installation process for a sensor associated with a passenger conveyance system, the process including at least partially automatically calibrating a sensor coordinate system to a world coordinate system via a calibration matrix, wherein the sensor coordinate system is at least partially obtained using a depth map.", "num_citations": "7\n", "authors": ["535"]}
{"title": "Method and System for Multiple 3D Sensor Calibration\n", "abstract": " A method for multiple 3D sensor calibration for a passenger conveyance system, the process including a computing a centroid location from spatial measurements for each of a pair of 3D sensors that form a common field of view via a moving object mathematical model; computing translation parameters from the locations of each centroid location; and correcting one of the pair of 3D sensors to a common world coordinate system from the translation parameters.", "num_citations": "7\n", "authors": ["535"]}
{"title": "Autonomous long-range landing using sensor data\n", "abstract": " A method of autonomous landing of an aircraft in a landing area includes receiving, with the processor, sensor signals related to the landing area via a sensor device; obtaining, with the processor, a template of the landing area in response to the receiving of the sensor signals; matching, with the processor, one or more features of the template with the features of the acquired images of the landing area; and controlling, with the processor, each of the sensor device and aircraft control system independently based on said matching.", "num_citations": "7\n", "authors": ["535"]}
{"title": "System and method for ensuring the performance of a video-based fire detection system\n", "abstract": " A video-based fire detection system receives video data comprised of a plurality of individual frames, and determines based on the video data the ability of the system to detect the presence of fire. The system includes a video recognition system connectable to receive the video data and to calculate one or more background features associated with the video data. Based on the calculated background features, the video recognitions system assesses the ability of the video-based fire detection system to detect the presence of fire. The system includes one or more outputs operably connectable to communicate the results of the assessment made by the video recognitions system.", "num_citations": "7\n", "authors": ["535"]}
{"title": "Electrical capacitance tomography: A compressive sensing approach\n", "abstract": " We present a new image reconstruction method for Electrical Capacitance Tomography (ECT). ECT image reconstruction is generally ill-posed because the number of measurements is small whereas the image dimensions are large. Here, Compressive Sensing is used to provide better reconstruction from the small number of measurements. Given the sparsity of the signal (image), the idea is to apply an efficient and stable algorithm through L1 regularization to recover the sparse signal with sufficient measurements that have cardinality comparable to the sparsity of the signal. In this paper, we present Total Variation (TV) regularization for ECT image reconstruction, and apply an efficient Split-Bregman Iteration (SBI) approach to solve the problem. We propose a joint metric of positive re-construction rate (PRR) and false reconstruction rate (FRR) to evaluate image reconstruction performance. The results on both …", "num_citations": "7\n", "authors": ["535"]}
{"title": "Fast Face Hallucination with Sparse Representation for Video Surveillance\n", "abstract": " In this paper we propose a novel face hallucination algorithm to synthesize a high-resolution face image from several low-resolution input face images. As described in Liu et al. [8]'s work, face hallucination uses two models: a global parametric model which synthesizes global face shapes from eigenfaces, and a local parametric model which enhances the local high frequency details. We follow a similar process to develop a robust face hallucination algorithm. Firstly, we obtain eigenfaces from a number of low resolution face images extracted from a video sequence using a face tracking algorithm. Then we compute the difference between the interpolated low-resolution face and the mean face, and use this difference face as the query to retrieve approximate sparse eigenfaces representation. The eigenfaces are combined using the coefficients obtained from sparse representation and added into the interpolated low …", "num_citations": "7\n", "authors": ["535"]}
{"title": "POSITION REFERENCING SYSTEM\n", "abstract": "", "num_citations": "7\n", "authors": ["535"]}
{"title": "A network architecture for radar signal processing\n", "abstract": " This paper presents design goals, an architecture, and simulation results for a new generation of programmable radar signal processors. The design goals for future processors include increased programmability, performance, reliability, and availability. A new network architecture for interprocessor communication is introduced to meet these design goals. The network is optimal in that it provides the maximum number of processors and memories with single-path unit-delay interconnection. Advanced simulation tools have been used to evaluate the performance and reliability of the new interconnection architecture. The architecture is shown to be efficient for typical radar signal processing tasks.", "num_citations": "7\n", "authors": ["535"]}
{"title": "Multi-camera system for simultaneous registration and zoomed imagery\n", "abstract": " A multi-camera system for a component inspection comprising a table having a table top or, alternatively, another sufficiently rigid surface; a first camera having a narrow field-of-view lens; a second camera having a wide field-of-view lens linked to said first camera, wherein said first camera and said second camera are configured to move identical distances along a common axis relative to said table top or surface; and a pre-defined pattern defined on said table top or surface.", "num_citations": "6\n", "authors": ["535"]}
{"title": "System and method for damage detection by cast shadows\n", "abstract": " An inspection system comprises an imaging device mounted so as to image a component surface. At least one controllable light mounted at low oblique angles around the component and configured to illuminate the component surface and cast at least one shadow on the component surface. A processor is coupled to the imaging device and the at least one controllable light. The processor is used for determining a feature based on a dissimilarity between image data and a reference model, and to determine damage to the component.", "num_citations": "6\n", "authors": ["535"]}
{"title": "System and method for flexibly holding workpiece and reporting workpiece location\n", "abstract": " A vacuum clamp inspection system comprises a rigid structure; a sensor system mounted relative to the rigid structure; a calibration fixture mounted on the table; and a vacuum clamp configured to provide at least one of a location and a pose of a component relative to the calibration fixture.", "num_citations": "6\n", "authors": ["535"]}
{"title": "SYSTEM AND METHOD FOR VIDEO-PROCESSING ALGORITHM IMPROVEMENT\n", "abstract": " A method for improving a video-processing algorithm (36) identifies Video data (48) that may have been misinterpreted by the video-processing algorithm (36). The identified video data (48) is provided to a monitoring center (38) that uses the identified video data (48) to modify and improve upon the video-processing algorithm (36). An improved video-processing algorithm (49) is able to correctly analyze the identified video data (48).", "num_citations": "6\n", "authors": ["535"]}
{"title": "High sensitivity fiber optic based detection\n", "abstract": " A detection system for measuring one or more condition within a predetermined area includes a fiber harness having at least one fiber optic cable for transmitting light. The at least one fiber optic cable defines a node arranged to measure the one or more conditions. A light source is coupled to the at least one fiber optic cable for emitting a modulated light to the node. The modulated light is transmitted into the predetermined area. A light sensitive device is coupled to the at least one fiber optic cable for receiving scattered light associated with the node. A control unit is operably coupled to the light source and to the light sensitive device to determine at least one of a presence and magnitude of the one or more conditions within the predetermined area.", "num_citations": "5\n", "authors": ["535"]}
{"title": "High sensitivity fiber optic based detection\n", "abstract": " A detection system for measuring one or more conditions within a predetermined area including a fiber harness having at least one fiber optic cable for transmitting light. The at least one fiber optic cable defines a plurality of nodes arranged to measure the one or more conditions. A control system is operably coupled to the fiber harness such that scattered light associated with the plurality of nodes is transmitted to the control system. The control system analyzes the scattered light from each of the plurality of nodes individually and the control system analyzes the scattered light from each of the plurality of nodes collectively to determine at least one of a presence and magnitude of the one or more conditions within the predetermined area.", "num_citations": "5\n", "authors": ["535"]}
{"title": "Nondestructive inspection using thermoacoustic imagery and method therefor\n", "abstract": " A method for nondestructive vibrothermography inspection of a component, the method includes generating ultrasonic excitations in a component over a range of frequencies; determining a thermal signature in the component from the excitations; registering a model with the thermal signature; determining damage based on the thermal signal and model; and classifying the component based on the determining.", "num_citations": "5\n", "authors": ["535"]}
{"title": "System of monitoring handrail for a passenger conveyer device, a passenger conveyer device and monitoring method thereof\n", "abstract": " A moving handrail monitoring system includes a sensor configured to sense at least part of a moving handrail of the passenger conveying device to acquire a data frame; a processing device configured to analyze and process the data frame to monitor whether a tension degree of the moving handrail is in a normal state, wherein the processing device is configured to include: a target object recognition module configured to recognize, based on a sensed movement and/or position and/or color and/or shape, a moving handrail portion that serves as a target object from the data frame; an object feature extraction module configured to extract a tension degree feature of the moving handrail portion; and a judgment module configured to compare the extracted tension degree feature with a system preset interval, and judge whether a current tension degree of the moving handrail is normal.", "num_citations": "5\n", "authors": ["535"]}
{"title": "Monitoring system of a passenger conveyor, a passenger conveyor, and a monitoring method thereof\n", "abstract": " A monitoring system and a monitoring method for a passenger conveying device, and the passenger conveying device. The monitoring system comprises an imaging sensor and/or a depth sensing sensor for sensing a monitoring area of the passenger conveying device to acquire data frames; and a processing device for performing data processing on the data frames to monitor whether the monitoring area is abnormal, and configured to comprise: a background acquisition module for acquiring a background model based on data frames sensed when the monitoring area is in a normal state; a foreground detection module for comparing data frames sensed in real time with the background model to obtain a foreground object; a foreground feature extraction module for extracting a corresponding foreground object markup feature from the foreground object; and a state judgment module for judging whether the …", "num_citations": "5\n", "authors": ["535"]}
{"title": "System and method for localization and acoustic voice interface\n", "abstract": " A system and method for user localization and acoustic voice interface are provided. The system including a locator system that includes at least one sensor that detects a location of a user and generates a location value, a listening system that includes a microphone array that includes at least one microphone, wherein the listening system receives the location value and collects an audio signal from the location defined by the location value, and a signal processor that generates a control signal based on at least the audio signal.", "num_citations": "5\n", "authors": ["535"]}
{"title": "Big data analyzing and processing system and method for passenger conveyor\n", "abstract": " The present invention provides a big data analysis and processing system and method for a passenger transport apparatus, wherein the big data analysis and processing system comprises: a data collection module, the data collection module comprising: an imaging sensor and/or depth sensing sensor, configured to constantly collect image data and/or depth map data of at least one region of the passenger transport apparatus; and an image processing module, configured to process the image data and/or depth map data to acquire a plurality of types of data of the passenger transport apparatus, comprising one or more of device running data, load data, abnormal behavior data and contingency data; a database, the database gathering and storing the plurality of types of data; and a statistical analysis unit, the statistical analysis unit performing classification and statistics on the plurality of types of data according to …", "num_citations": "5\n", "authors": ["535"]}
{"title": "Active threat mitigation control system\n", "abstract": " A method and system to mitigate at least one threat associated with a building includes receiving at least one threat parameter of the at least one threat via at least one threat sensor, and actively controlling at least one threat mitigator in response to the at least one threat parameter via a threat controller.", "num_citations": "5\n", "authors": ["535"]}
{"title": "Roll-calling mechanism based vision system for elevator positioning\n", "abstract": " A positioning system having a plurality of transponder modules each located at a known location for receiving an electromagnetic signal and emitting a light signal, at least one transceiver module for emitting an electromagnetic signal and receiving the light signal, and apparatus processing the received light signal to determine a position of the at least one transceiver module.", "num_citations": "5\n", "authors": ["535"]}
{"title": "VIDEO CONTENT ANALYSIS\n", "abstract": " A video content analysis (VCA) system generates an output regarding a detected condition that provides an indication of a confidence level regarding the detected condition. One example VCA system determines whether a first characteristic of a detected object in a field of vision of the video content analysis system satisfies a first criterion. If so, a first signal is generated under selected conditions. The VCA system also determines whether a second characteristic of the detected object satisfies a corresponding second criterion. If so, a second, different signal is generated if the first and second criteria are satisfied. The first and second signals indicate respective, different confidence levels that an event has occurred. A disclosed example includes a VCA as part of a security system.", "num_citations": "5\n", "authors": ["535"]}
{"title": "Automated analysis of thermally-sensitive coating and method therefor\n", "abstract": " A method for thermally-sensitive coating analysis of a component includes imaging the coated, exposed component over a range of distinct frequencies as selected by a narrowband variable filter; estimating parameters of non-uniformity correction (NUC) for every pixel at every wavelength; constructing a 2D temperature map on a pixel-by-pixel basis using the non-uniformity correction; and mapping the 2D temperature map to a 3D computer aided design (CAD) model.", "num_citations": "4\n", "authors": ["535"]}
{"title": "High sensitivity fiber optic based detection\n", "abstract": " A detection system for measuring one or more conditions within a predetermined area includes a fiber harness having at least one fiber optic cable for transmitting light. The at least one fiber optic cable defines a node arranged to measure the one or more conditions. A control system is operably coupled to the fiber harness such that a signal indicative of scattered light associated with the node is transmitted to the control system. The control system analyzes the signal associated with the node in one or more of a frequency domain, time-frequency domain, time domain, and spatial domain, to determine at least one of a presence and magnitude of the condition within the predetermined area.", "num_citations": "4\n", "authors": ["535"]}
{"title": "Detection and control system for elevator operations\n", "abstract": " A sensor system for a passenger conveyance system includes a multiple of 3D sensors mounted to a movable structure within a vertical shaft and/or a horizontal shaft and a processing module in communication with the multiple of 3D sensors, the processing module operable to identify an obstruction within the horizontal or vertical shaft.", "num_citations": "4\n", "authors": ["535"]}
{"title": "System and method for distant gesture-based control using a network of sensors across the building\n", "abstract": " A gesture-based interaction system for communication with an equipment-based system includes a sensor device and a signal processing unit. The sensor device is configured to capture at least one scene of a user to monitor for at least one gesture of a plurality of possible gestures, conducted by the user, and output a captured signal. The signal processing unit includes a processor configured to execute recognition software and a storage medium configured to store pre-defined gesture data. The signal processing unit is configured to receive the captured signal, process the captured signal by at least comparing the captured signal to the pre-defined gesture data for determining if at least one gesture of the plurality of possible gestures are portrayed in the at least one scene, and output a command signal associated with the at least one gesture to the equipment-based system.", "num_citations": "4\n", "authors": ["535"]}
{"title": "A two-step face hallucination approach for video surveillance applications\n", "abstract": " In this paper we propose a novel face hallucination algorithm to synthesize a high-resolution face image from several low-resolution input face images. Face hallucination normally uses two models: a global parametric model which synthesizes the global face shapes from eigenfaces, and a local parametric model which enhances the local high frequency details. We follow a similar process to develop a robust face hallucination algorithm. First, we obtain eigenfaces from a number of low resolution face images segmented from a video sequence using a face tracking algorithm. Then we compute the difference between an interpolated low-resolution face and a mean face, and use this difference as the query to retrieve an approximate sparse eigenface representation. The eigenfaces are combined using the coefficients obtained from the sparse representation and added into the interpolated low-resolution …", "num_citations": "4\n", "authors": ["535"]}
{"title": "Radar adaptive beamforming algorithms and architectures\n", "abstract": " Adaptive beamforming algorithms and architectures for phased array radars are reviewed. In particular, the linearly constrained minimum variance (LCMV) beamformer with a normalized least mean square (LMS) weight update algorithm is examined for airborne surveillance applications. LCMV simulation results for realistic clutter, noise, and array miscalibration models are presented. The LCMV beamformer with a normalized LMS weight update algorithm is shown to offer good, performance with minimum computational complexity.< >", "num_citations": "4\n", "authors": ["535"]}
{"title": "Diagnostic signal analysis using rank reduction and the Wigner distribution\n", "abstract": " The Wigner-Ville Distribution of reduced-rank rocket, engine test-data is evaluated for rocket engine health inonitoring. The dat, a, is prefilt, ered by data adaptive. signal est, iination where Clie SVD of a rectangular Toeplitz data matrix is computed and only the dominant singular values spa. nning t, lie signal subspace are retained. The Wigner-Ville Distribution is then computed using resulting prefilt, ered data. Results are shown for data collected from (. lie main combustion chamber of the Space Shuttle Main En gin e.", "num_citations": "4\n", "authors": ["535"]}
{"title": "Systems and methods for improved elevator scheduling\n", "abstract": " Methods and systems for controlling elevator systems are provided. The methods include receiving inputs from at least one interactive input device, wherein the inputs include elevator call requests, tracking one or more people located within a monitored area using at least one sensor, assigning elevator assignments to the one or more people based on at least one of the inputs from the at least one interactive input device and a grouping algorithm based on the tracking of the one or more people, and scheduling operation of at least one elevator car based on the elevator assignments.", "num_citations": "3\n", "authors": ["535"]}
{"title": "Monitoring of step rollers and maintenance mechanics of passenger conveyors\n", "abstract": " The present invention relates to step roller monitoring and maintenance personnel monitoring of a passenger conveyor, and belongs to the field of passenger conveyor technologies. In the monitoring system and monitoring method of the present invention, an imaging sensor and/or a depth sensing sensor is used to sense the step roller/maintenance personnel of the passenger conveyor to acquire data frames, and the data frames are analyzed and processed to monitor whether the movement or position of the step roller/activity or position of the maintenance personnel is in a normal state.", "num_citations": "3\n", "authors": ["535"]}
{"title": "System and method for automated fluorescent penetrant inspection\n", "abstract": " An example method of inspecting a part includes applying a penetrant dye to the part, the penetrant dye exhibiting a fluorescent color when subjected to light from a lighting device. A portion of the part is illuminated with light from the lighting device. An image of the portion of the part is automatically recorded with a camera while the portion is illuminated. An uncertainty metric for the image is automatically determined that is indicative of a likelihood that pixels in the image having the fluorescent color represent damage to the part. At least one of the part, lighting device, and camera are automatically adjusted based on the uncertainty metric being within a predefined range. The automatic recording, determining, and adjusting steps are iteratively repeated until the uncertainty metric is greater than the predefined range, or a predefined number of iterations have been performed for the portion of the part.", "num_citations": "3\n", "authors": ["535"]}
{"title": "Speed detection system of passenger conveyor and speed detection method thereof\n", "abstract": " The present invention relates to the field of passenger conveyor technologies, and provides a speed detection system of a passenger conveyor and a speed detection method thereof. In the speed detection system and the speed detection method of the present invention, an imaging sensor and/or a depth sensing sensor are/is used to sense at least one part of the passenger conveyor to acquire sequence frames, and the sequence frames are analyzed by a processing apparatus to obtain at least speed information about steps of the passenger conveyor.", "num_citations": "2\n", "authors": ["535"]}
{"title": "Depth sensor for automatic doors\n", "abstract": " A door system is provided and includes= a door assembly operable to assume an open position at which an aperture is opened and a closed position at which the aperture is closed, a sensor assembly and a controller. The controller is coupled to the door assembly and configured to instruct the door assembly to normally assume the closed position and to assume the open position in accordance with an open signal being issued by the sensor assembly. The sensor assembly is configured to track the individual, determine whether the individual is likely to be approaching the aperture from the tracking and issue the open signal in accordance with a determination that the individual is likely to be approaching the aperture.", "num_citations": "2\n", "authors": ["535"]}
{"title": "Video-based fire detection and suppression with closed-loop control\n", "abstract": " A closed-loop system employs video analytic outputs in a feedback loop to control the operation of a video-based fire detection system. In particular, video data captured by a video detector is analyzed by a video analytic system to generate outputs identifying regions indicative of fire. These outputs are employed as feedback in a closed-loop control system to orient the camera such that field of the view of the camera is modified to improve the ability of the video analytic system to verify or confirm the presence of fire within a region identified as indicative of fire. In addition, video analytic system may generate outputs identifying the delivery location of a fire suppressant. These outputs are employed as feedback in a closed-loop control system to orient the delivery of suppressant to extinguish the fire.", "num_citations": "2\n", "authors": ["535"]}
{"title": "System and method for video detection of smoke and flame\n", "abstract": " A video recognition system detects the presence of fire based on video data provided by one or more video detectors. The video recognition system is operable to calculate a first flicker feature with respect to a first set of frame data and a second flicker feature with respect to a second set of frame data. The video recognition system combines the first flicker feature and the second flicker feature to generate an accumulated flicker feature. The video recognition system defines, based on the accumulated flicker feature, a flicker mask that represents a dynamic region of the fire. Based on the defined flicker mask, the video recognition system determines whether the video data indicates the presence of fire.", "num_citations": "2\n", "authors": ["535"]}
{"title": "SYSTEM AND METHOD FOR VIDEO DETECTION OF SMOKE AND FLAME\n", "abstract": " A video recognition system detects the presence of fire based on video data provided by one or more video detectors. The video recognition system is operable to calculate a first flicker feature with respect to a first set of frame data and a second flicker feature with respect to a second set of frame data. The video recognition system combines the first flicker feature and the second flicker feature to generate an accumulated flicker feature. The video recognition system defines, based on the accumulated flicker feature, a flicker mask that represents a dynamic region of the fire. Based on the defined flicker mask, the video recognition system determines whether the video data indicates the presence of fire.", "num_citations": "2\n", "authors": ["535"]}
{"title": "Signal enhancement for diagnostic signal analysis (rocket engines)\n", "abstract": " Two time-frequency distributions of rocket engine test data are evaluated for rocket engine health monitoring. The data is enhanced using Cadzow's (1988) signal enhancement technique based on composite property mappings. Following signal enhancement, the Wigner-Ville and Choi-Williams (1989) distributions are computed. Though the signal enhancement algorithm was able to reduce noise by 5-9 dB, on average, the time-frequency distributions were capable of discerning signal features without enhancement. Results are shown for data collected from the main combustion chamber of the Space Shuttle main engine.<>", "num_citations": "2\n", "authors": ["535"]}
{"title": "Presence detection system\n", "abstract": " A presence detection system includes an infrared detector and a radar detector. A computer processor of the system is configured to receive respective signals from the infrared and radar detectors and process the signals via execution of an algorithm.", "num_citations": "1\n", "authors": ["535"]}
{"title": "Nondestructive multispectral vibrothermography inspection system and method therefor\n", "abstract": " A nondestructive multispectral vibrothermography inspection system includes a fixture to retain a component, an ultrasonic excitation source directed toward the component retained within the fixture, a laser Doppler vibrometer directed toward the component retained within the fixture, and a multispectral thermography system directed toward the component retained within the fixture. A method for nondestructive multispectral vibrothermography inspection of a component, includes generating ultrasonic excitations in a component over a broad range of frequencies; determining a spectral signature in the component from the excitations; comparing the spectral energy signature against database 270 of correlations between vibrational frequencies of a multiple of components and the spectral energy distribution thereof, and classifying the component based on the database data.", "num_citations": "1\n", "authors": ["535"]}
{"title": "Spoken command interface\n", "abstract": " Methods, systems, and computer program products for spoken command interface are provided. Aspects include receiving a statement command from a user, wherein the receiving the statement command from the user includes capturing, by a sensor, a series of frames of the user, wherein the series of frames includes lip movements of the user, and determining at least one statement command from the user based on the lip movements of the user. One or more keywords are extracted from the statement command. The one or more keywords are used to determine an elevator command.", "num_citations": "1\n", "authors": ["535"]}
{"title": "System and method for monitoring handrail entrance of passenger conveyor\n", "abstract": " The present invention provides a handrail entry monitoring system of a passenger conveyor and a monitoring method thereof, and belongs to the field of passenger conveyor technologies. In the handrail entry monitoring system and the monitoring method of the present invention, at least part of a handrail entry region of the passenger conveyor is sensed by using an imaging sensor and/or a depth sensing sensor, to acquire a data frame, and the data frame is analyzed to monitor whether a handrail entry of the operating passenger conveyor is in a normal state or an abnormal state. The monitoring system of the present invention and the monitoring method thereof can timely and effectively detect a danger that a foreign matter is about to be entrapped into the handrail entry, helping prevent foreign matters from being entrapped into the handrail entry, thereby improving safety of the passenger conveyor.", "num_citations": "1\n", "authors": ["535"]}
{"title": "A building management system using object detection and tracking in a large space with a low resolution sensor\n", "abstract": " A method of operating an object detection and tracking system includes the step of estimating (202) a current background of a current frame of sensor data generated by a sensor based on a previous frame of sensor data by a computer-based processor. The method further includes estimating (204) a foreground of the current frame of sensor data by comparing the current frame of sensor data to the current background, and detecting (212) an object using a sensor-specific object model.", "num_citations": "1\n", "authors": ["535"]}
{"title": "Imaging systems and methods\n", "abstract": " An imaging method includes receiving electromagnetic radiation with a plurality of qualities from a scene to be captured at a mask and passing a first portion of the received electromagnetic radiation having the plurality of qualities present in the received electromagnetic radiation through the mask. One or more qualities of the received electromagnetic radiation is removed from a second portion of the received electromagnetic radiation, and the second portion of the received electromagnetic radiation absent the one or more removed qualities is passed through the mask.", "num_citations": "1\n", "authors": ["535"]}
{"title": "Systems and methods for indexing and detecting components\n", "abstract": " Systems and methods for defect detection and position control are described herein. A method of performing position control on members in a device may comprise applying, by a deposition device, a fiducial mark to a first member of the device, and receiving, by a processing unit, from an image capture device coupled to the processing unit, an image of the first member. in various embodiments, the method may further comprise detecting, by the processing unit, the fiducial mark on the first member. In various embodiments, the fiducial mark may comprise ink.", "num_citations": "1\n", "authors": ["535"]}
{"title": "Robust and reliable acoustic echo and noise cancellation system for cabin communication\n", "abstract": " Robust and reliable acoustic echo and noise cancellation system for cabin communication - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Robust and reliable acoustic echo and noise cancellation system for cabin communication Venkatesh, Saligrama R. ; Finn, Alan M. Abstract Publication: Acoustical Society of America Journal Pub Date: 2007 DOI: 10.1121/1.2756491 Bibcode: 2007ASAJ.....30V full text sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian Privacy Notice Smithsonian Terms of Use Smithsonian …", "num_citations": "1\n", "authors": ["535"]}
{"title": "Simulation of multiple access protocols for real-time control\n", "abstract": " The simulation activity described in this paper was undertaken for the design of a hierarchical multiple access communication network for a distributed real-time control system. The network consisted of multiple busses hierarchically connected by bridges. High bandwidth control loops were closed over local busses. Lower rate loops and status information were shared between busses.Multiple simulation methodologies were employed to design and valdate the communications protocol for the network. The methodologies included mathematical analysis, functional simulation, and physical simulation. Each method elucidated a separate aspect of the protocol's behavior. The unique contribution of each method yielded a comprehensive understanding of the proposed design and perrnitted model validation by cross-checking the results.The ortginal traffic load for this study included messages with maximurn …", "num_citations": "1\n", "authors": ["535"]}
{"title": "Modeling and simulation of an i860-based multiprocessor\n", "abstract": " This paper presents the modeling and simulation of a nlultiprocessor architecture. The methodology included cycle-by-cycle uniprocessor simulation, trace driven multiprocessor simulation, and high-level sinmlation in an Architecture Design and Assessment System (ADAS). The multiprocessor was designed for digital signal processing (DSP) and used single-chip Intel i860 processors with a shared global memory.", "num_citations": "1\n", "authors": ["535"]}