{"title": "Early dropout prediction using data mining: a case study with high school students\n", "abstract": " Early prediction of school dropout is a serious problem in education, but it is not an easy issue to resolve. On the one hand, there are many factors that can influence student retention. On the other hand, the traditional classification approach used to solve this problem normally has to be implemented at the end of the course to gather maximum information in order to achieve the highest accuracy. In this paper, we propose a methodology and a specific classification algorithm to discover comprehensible prediction models of student dropout as soon as possible. We used data gathered from 419 high schools students in Mexico. We carried out several experiments to predict dropout at different steps of the course, to select the best indicators of dropout and to compare our proposed algorithm versus some classical and imbalanced well‐known classification algorithms. Results show that our algorithm was capable of …", "num_citations": "218\n", "authors": ["1076"]}
{"title": "Predicting student failure at school using genetic programming and different data mining approaches with high dimensional and imbalanced data\n", "abstract": " Predicting student failure at school has become a difficult challenge due to both the high number of factors that can affect the low performance of students and the imbalanced nature of these types of datasets. In this paper, a genetic programming algorithm and different data mining approaches are proposed for solving these problems using real data about 670 high school students from Zacatecas, Mexico. Firstly, we select the best attributes in order to resolve the problem of high dimensionality. Then, rebalancing of data and cost sensitive classification have been applied in order to resolve the problem of classifying imbalanced data. We also propose to use a genetic programming model versus different white box techniques in order to obtain both more comprehensible and accuracy classification rules. The outcomes of each approach are shown and compared in order to select the best to improve …", "num_citations": "213\n", "authors": ["1076"]}
{"title": "Weighted Data Gravitation Classification for Standard and Imbalanced Data\n", "abstract": " Gravitation is a fundamental interaction whose concept and effects applied to data classification become a novel data classification technique. The simple principle of data gravitation classification (DGC) is to classify data samples by comparing the gravitation between different classes. However, the calculation of gravitation is not a trivial problem due to the different relevance of data attributes for distance computation, the presence of noisy or irrelevant attributes, and the class imbalance problem. This paper presents a gravitation-based classification algorithm which improves previous gravitation models and overcomes some of their issues. The proposed algorithm, called DGC+, employs a matrix of weights to describe the importance of each attribute in the classification of each class, which is used to weight the distance between data samples. It improves the classification performance by considering both global …", "num_citations": "109\n", "authors": ["1076"]}
{"title": "Multi-Target Support Vector Regression Via Correlation Regressor Chains\n", "abstract": " Multi-target regression is a challenging task that consists of creating predictive models for problems with multiple continuous target outputs. Despite the increasing attention on multi-label classification, there are fewer studies concerning multi-target (MT) regression. The current leading MT models are based on ensembles of regressor chains, where random, differently ordered chains of the target variables are created and used to build separate regression models, using the previous target predictions in the chain. The challenges of building MT models stem from trying to capture and exploit possible correlations among the target variables during training. This paper presents three multi-target support vector regression models. The first involves building independent, single-target Support Vector Regression (SVR) models for each output variable. The second builds an ensemble of random chains using the first method …", "num_citations": "92\n", "authors": ["1076"]}
{"title": "A survey on graphic processing unit computing for large-scale data mining\n", "abstract": " General purpose computation using Graphic Processing Units (GPUs) is a well‐established research area focusing on high‐performance computing solutions for massively parallelizable and time‐consuming problems. Classical methodologies in machine learning and data mining cannot handle processing of massive and high‐speed volumes of information in the context of the big data era. GPUs have successfully improved the scalability of data mining algorithms to address significantly larger dataset sizes in many application areas. The popularization of distributed computing frameworks for big data mining opens up new opportunities for transformative solutions combining GPUs and distributed frameworks. This survey analyzes current trends in the use of GPU computing for large‐scale data mining, discusses GPU architecture advantages for handling volume and velocity of data, identifies limitation factors …", "num_citations": "73\n", "authors": ["1076"]}
{"title": "An Interpretable Classification Rule Mining Algorithm\n", "abstract": " Obtaining comprehensible classifiers may be as important as achieving high accuracy in many real-life applications such as knowledge discovery tools and decision support systems. This paper introduces an efficient Evolutionary Programming algorithm for solving classification problems by means of very interpretable and comprehensible IF-THEN classification rules. This algorithm, called the Interpretable Classification Rule Mining (ICRM) algorithm, is designed to maximize the comprehensibility of the classifier by minimizing the number of rules and the number of conditions. The evolutionary process is conducted to construct classification rules using only relevant attributes, avoiding noisy and redundant data information. The algorithm is evaluated and compared to nine other well-known classification techniques in 35 varied application domains. Experimental results are validated using several non-parametric …", "num_citations": "67\n", "authors": ["1076"]}
{"title": "Online Ensemble Learning with Abstaining Classifiers for Drifting and Noisy Data Streams\n", "abstract": " Mining data streams is among most vital contemporary topics in machine learning. Such scenario requires adaptive algorithms that are able to process constantly arriving instances, adapt to potential changes in data, use limited computational resources, as well as be robust to any atypical events that may appear. Ensemble learning has proven itself to be an effective solution, as combining learners leads to an improved predictive power, more flexible drift handling, as well as ease of being implemented in high-performance computing environments. In this paper, we propose an enhancement of popular online ensembles by augmenting them with abstaining option. Instead of relying on a traditional voting, classifiers are allowed to abstain from contributing to the final decision. Their confidence level is being monitored for each incoming instance and only learners that exceed certain threshold are selected. We …", "num_citations": "62\n", "authors": ["1076"]}
{"title": "Speeding up the evaluation phase of GP classification algorithms on GPUs\n", "abstract": " The efficiency of evolutionary algorithms has become a studied problem since it is one of the major weaknesses in these algorithms. Specifically, when these algorithms are employed for the classification task, the computational time required by them grows excessively as the problem complexity increases. This paper proposes an efficient scalable and massively parallel evaluation model using the NVIDIA CUDA GPU programming model to speed up the fitness calculation phase and greatly reduce the computational time. Experimental results show that our model significantly reduces the computational time compared to the sequential approach, reaching a speedup of up to 820×. Moreover, the model is able to scale to multiple GPU devices and can be easily extended to any evolutionary algorithm.", "num_citations": "60\n", "authors": ["1076"]}
{"title": "A Survey on Urban Traffic Anomalies Detection Algorithms\n", "abstract": " This paper reviews the use of outlier detection approaches in urban traffic analysis. We divide existing solutions into two main categories: flow outlier detection and trajectory outlier detection. The first category groups solutions that detect flow outliers and includes statistical, similarity and pattern mining approaches. The second category contains solutions where the trajectory outliers are derived, including off-line processing for trajectory outliers and online processing for sub-trajectory outliers. Solutions in each of these categories are described, illustrated, and discussed, and open perspectives and research trends are drawn. Compared to the state-of-the-art survey papers, the contribution of this paper lies in providing a deep analysis of all the kinds of representations in urban traffic data, including flow values, segment flow values, trajectories, and sub-trajectories. In this context, we can better understand the …", "num_citations": "55\n", "authors": ["1076"]}
{"title": "Kappa Updated Ensemble for Drifting Data Stream Mining\n", "abstract": " Learning from data streams in the presence of concept drift is among the biggest challenges of contemporary machine learning. Algorithms designed for such scenarios must take into an account the potentially unbounded size of data, its constantly changing nature, and the requirement for real-time processing. Ensemble approaches for data stream mining have gained significant popularity, due to their high predictive capabilities and effective mechanisms for alleviating concept drift. In this paper, we propose a new ensemble method named Kappa Updated Ensemble (KUE). It is a combination of online and block-based ensemble approaches that uses Kappa statistic for dynamic weighting and selection of base classifiers. In order to achieve a higher diversity among base learners, each of them is trained using a different subset of features and updated with new instances with given probability following a …", "num_citations": "54\n", "authors": ["1076"]}
{"title": "Adapted k Nearest Neighbors for Detecting Anomalies on Spatio-Temporal Traffic Flow\n", "abstract": " Outlier detection is an extensive research area, which has been intensively studied in several domains such as biological sciences, medical diagnosis, surveillance, and traffic anomaly detection. This paper explores advances in the outlier detection area by finding anomalies in spatio-temporal urban traffic flow. It proposes a new approach by considering the distribution of the flows in a given time interval. The flow distribution probability (FDP) databases are first constructed from the traffic flows by considering both spatial and temporal information. The outlier detection mechanism is then applied to the coming flow distribution probabilities, the inliers are stored to enrich the FDP databases, while the outliers are excluded from the FDP databases. Moreover, a k-nearest neighbor for distance-based outlier detection is investigated and adopted for FDP outlier detection. To validate the proposed framework, real data from …", "num_citations": "53\n", "authors": ["1076"]}
{"title": "ur-CAIM: improved CAIM discretization for unbalanced and balanced data\n", "abstract": " Supervised discretization is one of basic data preprocessing techniques used in data mining. CAIM (class-attribute interdependence maximization) is a discretization algorithm of data for which the classes are known. However, new arising challenges such as the presence of unbalanced data sets, call for new algorithms capable of handling them, in addition to balanced data. This paper presents a new discretization algorithm named ur-CAIM, which improves on the CAIM algorithm in three important ways. First, it generates more flexible discretization schemes while producing a small number of intervals. Second, the quality of the intervals is improved based on the data classes distribution, which leads to better classification performance on balanced and, especially, unbalanced data. Third, the runtime of the algorithm is lower than CAIM’s. The algorithm has been designed free-parameter and it self-adapts …", "num_citations": "53\n", "authors": ["1076"]}
{"title": "High Performance Evaluation of Evolutionary-Mined Association Rules on GPUs\n", "abstract": " Association rule mining is a well-known data mining task, but it requires much computational time and memory when mining large scale data sets of high dimensionality. This is mainly due to the evaluation process, where the antecedent and consequent in each rule mined are evaluated for each record. This paper presents a novel methodology for evaluating association rules on graphics processing units (GPUs). The evaluation model may be applied to any association rule mining algorithm. The use of GPUs and the compute unified device architecture (CUDA) programming model enables the rules mined to be evaluated in a massively parallel way, thus reducing the computational time required. This proposal takes advantage of concurrent kernels execution and asynchronous data transfers, which improves the efficiency of the model. In an experimental study, we evaluate interpreter performance and …", "num_citations": "52\n", "authors": ["1076"]}
{"title": "LAIM discretization for multi-label data\n", "abstract": " Multi-label learning is a challenging task in data mining which has attracted growing attention in recent years. Despite the fact that many multi-label datasets have continuous features, general algorithms developed specially to transform multi-label datasets with continuous attributes’ values into a finite number of intervals have not been proposed to date. Many classification algorithms require discrete values as the input and studies have shown that supervised discretization may improve classification performance. This paper presents a Label-Attribute Interdependence Maximization (LAIM) discretization method for multi-label data. LAIM is inspired in the discretization heuristic of CAIM for single-label classification. The maximization of the label-attribute interdependence is expected to improve labels prediction in data separated through disjoint intervals. The main aim of this paper is to present a discretization method …", "num_citations": "49\n", "authors": ["1076"]}
{"title": "Multi-objective genetic programming for feature extraction and data visualization\n", "abstract": " Feature extraction transforms high-dimensional data into a new subspace of lower dimensionality while keeping the classification accuracy. Traditional algorithms do not consider the multi-objective nature of this task. Data transformations should improve the classification performance on the new subspace, as well as to facilitate data visualization, which has attracted increasing attention in recent years. Moreover, new challenges arising in data mining, such as the need to deal with imbalanced data sets call for new algorithms capable of handling this type of data. This paper presents a Pareto-based multi-objective genetic programming algorithm for feature extraction and data visualization. The algorithm is designed to obtain data transformations that optimize the classification and visualization performance both on balanced and imbalanced data. Six classification and visualization measures are identified as …", "num_citations": "44\n", "authors": ["1076"]}
{"title": "Speeding-Up Association Rule Mining With Inverted Index Compression\n", "abstract": " The growing interest in data storage has made the data size to be exponentially increased, hampering the process of knowledge discovery from these large volumes of high-dimensional and heterogeneous data. In recent years, many efficient algorithms for mining data associations have been proposed, facing up time and main memory requirements. Nevertheless, this mining process could still become hard when the number of items and records is extremely high. In this paper, the goal is not to propose new efficient algorithms but a new data structure that could be used by a variety of existing algorithms without modifying its original schema. Thus, our aim is to speed up the association rule mining process regardless the algorithm used to this end, enabling the performance of efficient implementations to be enhanced. The structure simplifies, reorganizes, and speeds up the data access by sorting data by means of …", "num_citations": "42\n", "authors": ["1076"]}
{"title": "Distributed Nearest Neighbor Classification for Large-Scale Multi-label Data on Spark\n", "abstract": " Modern data is characterized by its ever-increasing volume and complexity, particularly when data instances belong to many categories simultaneously. This learning paradigm is known as multi-label classification and one of its most renowned methods is the multi-label k nearest neighbor ( Ml-knn). The traditional implementations of this method are not feasible for large-scale multi-label data due to its complexity and memory restrictions. We propose a distributed Ml-knn implementation based on the MapReduce programming model, implemented on Apache Spark. We compare three strategies for distributed nearest neighbor search: 1) iteratively broadcasting instances, 2) using a distributed tree-based index structure, and 3) building hash tables to group instances. The experimental study evaluates the trade-off between the quality of the predictions and runtimes on 22 benchmark datasets, and compares the …", "num_citations": "40\n", "authors": ["1076"]}
{"title": "Exploiting GPU and cluster parallelism in single scan frequent itemset mining\n", "abstract": " This paper considers discovering frequent itemsets in transactional databases and addresses the time complexity problem by using high performance computing (HPC). Three HPC versions of the Single Scan (SS) algorithm are proposed. The first one (GSS) implements SS on a GPU (Graphics Processing Unit) architecture using an efficient mapping between thread blocks and the input data. The second approach (CSS) implements SS on a cluster architecture by scheduling independent jobs to workers in a cluster. The third, (CGSS) accelerates the frequent itemset mining process by using multiple cluster nodes equipped with GPUs. Moreover, three partitioning strategies are proposed to reduce GPU thread divergence and cluster load imbalance. Results show that CGSS outperforms SS, GSS, and CSS in terms of speedup. Specifically, CGSS provides up to a 350 times speedup for low minimum support values …", "num_citations": "35\n", "authors": ["1076"]}
{"title": "Distributed multi-label feature selection using individual mutual information measures\n", "abstract": " Multi-label learning generalizes traditional learning by allowing an instance to belong to multiple labels simultaneously. This causes multi-label data to be characterized by its large label space dimensionality and the dependencies among labels. These challenges have been addressed by feature selection techniques which improve the final model accuracy. However, the large number of features along with a large number of labels call for new approaches to manage data effectively and efficiently in distributed computing environments. This paper proposes a distributed model to compute a score that measures the quality of each feature with respect to multiple labels on Apache Spark. We propose two different approaches that study how to aggregate the mutual information of multiple labels: Euclidean Norm Maximization (ENM) and Geometric Mean Maximization (GMM). The former selects the features with the …", "num_citations": "34\n", "authors": ["1076"]}
{"title": "Speeding up multiple instance learning classification rules on GPUs\n", "abstract": " Multiple instance learning is a challenging task in supervised learning and data mining. However, algorithm performance becomes slow when learning from large-scale and high-dimensional data sets. Graphics processing units (GPUs) are being used for reducing computing time of algorithms. This paper presents an implementation of the G3P-MI algorithm on GPUs for solving multiple instance problems using classification rules. The GPU model proposed is distributable to multiple GPUs, seeking for its scalability across large-scale and high-dimensional data sets. The proposal is compared to the multi-threaded CPU algorithm with streaming SIMD extensions parallelism over a series of data sets. Experimental results report that the computation time can be significantly reduced and its scalability improved. Specifically, an speedup of up to 149 can be achieved over the multi-threaded CPU algorithm …", "num_citations": "33\n", "authors": ["1076"]}
{"title": "Interpretable Multi-view Early Warning System adapted to Underrepresented Student Populations\n", "abstract": " Early warning systems have been progressively implemented in higher education institutions to predict student performance. However, they usually fail at effectively integrating the many information sources available at universities to make more accurate and timely predictions, they often lack decision-making reasoning to motivate the reasons behind the predictions, and they are generally biased toward the general student body, ignoring the idiosyncrasies of underrepresented student populations (determined by socio-demographic factors such as race, gender, residency, or status as a freshmen, transfer, adult, or first-generation students) that traditionally have greater difficulties and performance gaps. This paper presents a multiview early warning system built with comprehensible Genetic Programming classification rules adapted to specifically target underrepresented and underperforming student populations …", "num_citations": "30\n", "authors": ["1076"]}
{"title": "A Classification Module for Genetic Programming Algorithms in JCLEC\n", "abstract": " JCLEC-Classification is a usable and extensible open source library for genetic programming classification algorithms. It houses implementations of rule-based methods for classification based on genetic programming, supporting multiple model representations and providing to users the tools to implement any classifier easily. The software is written in Java and it is available from http://jclec. sourceforge. net/classification under the GPL license.", "num_citations": "30\n", "authors": ["1076"]}
{"title": "Parallel multi-objective Ant Programming for classification using GPUs\n", "abstract": " Classification using Ant Programming is a challenging data mining task which demands a great deal of computational resources when handling data sets of high dimensionality. This paper presents a new parallelization approach of an existing multi-objective Ant Programming model for classification, using GPUs and the NVIDIA CUDA programming model. The computational costs of the different steps of the algorithm are evaluated and it is discussed how best to parallelize them. The features of both the CPU parallel and GPU versions of the algorithm are presented. An experimental study is carried out to evaluate the performance and efficiency of the interpreter of the rules, and reports the execution times and speedups regarding variable population size, complexity of the rules mined and dimensionality of the data sets. Experiments measure the original single-threaded and the new multi-threaded CPU and GPU …", "num_citations": "30\n", "authors": ["1076"]}
{"title": "Sentiment Classification from Multi-class Imbalanced Twitter Data Using Binarization\n", "abstract": " Twitter became one of the most dynamically developing areas of social media. Due to concise nature of messages, rapid publication and high outreach, people share more and more of their opinions, thoughts and commentaries using this medium. Sentiment analysis is a specific subsection of natural language processing that concentrates on automatically categorizing opinions and attitudes expressed in a given portion of textual information. This requires dedicated machine learning solutions that are able to handle various difficulties embedded in the nature of data. In this paper, we present an efficient framework for automatic sentiment analysis from high-dimensional and sparse datasets that suffer from multi-class imbalance. We propose to approach it by applying a one-vs-one binary decomposition and reducing the dimensionality of each pairwise class set using Multiple Correspondence Analysis …", "num_citations": "28\n", "authors": ["1076"]}
{"title": "An ensemble approach to multi-view multi-instance learning\n", "abstract": " Multi-view learning combines data from multiple heterogeneous sources and employs their complementary information to build more accurate models. Multi-instance learning represents examples as labeled bags containing sets of instances. Data fusion of different multi-instance views cannot be simply concatenated into a single set of features due to their different cardinality and feature space. This paper proposes an ensemble approach that combines view learners and pursues consensus among the weighted class predictions to take advantage of the complementary information from multiple views. Importantly, the ensemble must deal with the different feature spaces coming from each of the views, while data for the bags may be partially represented in the views. The experimental study evaluates and compares the performance of the proposal with 20 traditional, ensemble-based, and multi-view algorithms on a …", "num_citations": "26\n", "authors": ["1076"]}
{"title": "Evolving Rule-Based Classifiers with Genetic Programming on GPUs for Drifting Data Streams\n", "abstract": " Designing efficient algorithms for mining massive high-speed data streams has become one of the contemporary challenges for the machine learning community. Such models must display highest possible accuracy and ability to swiftly adapt to any kind of changes, while at the same time being characterized by low time and memory complexities. However, little attention has been paid to designing learning systems that will allow us to gain a better understanding of incoming data. There are few proposals on how to design interpretable classifiers for drifting data streams, yet most of them are characterized by a significant trade-off between accuracy and interpretability. In this paper, we show that it is possible to have all of these desirable properties in one model. We introduce ERulesD2S: evolving rule-based classifier for drifting data Streams. By using grammar-guided genetic programming, we are able to obtain …", "num_citations": "24\n", "authors": ["1076"]}
{"title": "Speeding up k-Nearest Neighbors Classifier for Large-Scale Multi-Label Learning on GPUs\n", "abstract": " Multi-label classification is one of the most dynamically growing fields of machine learning, due to its numerous real-life applications in solving problems that can be described by multiple labels at the same time. While most of works in this field focus on proposing novel and accurate classification algorithms, the issue of the computational complexity on growing dataset sizes is somehow marginalized. Owning to the ever-increasing capabilities of data capturing, we are faced with the problem of large-scale data mining that forces learners to be not only highly accurate, but also fast and scalable on high-dimensional spaces of instances, features, and labels. In this paper, we propose a highly efficient parallel approach for computing the multi-label k-Nearest Neighbor classifier on GPUs. While this method is highly effective due to its accuracy and simplicity, its computational complexity makes it prohibitive for large-scale …", "num_citations": "24\n", "authors": ["1076"]}
{"title": "MIRSVM: Multi-Instance Support Vector Machine with Bag Representatives\n", "abstract": " Multiple-instance learning (MIL) is a variation of supervised learning, where samples are represented by labeled bags, each containing sets of instances. The individual labels of the instances within a bag are unknown, and labels are assigned based on a multi-instance assumption. One of the major complexities associated with this type of learning is the ambiguous relationship between a bag’s label and the instances it contains. This paper proposes a novel support vector machine (SVM) multiple-instance formulation and presents an algorithm with a bag-representative selector that trains the SVM based on bag-level information, named MIRSVM. The contribution is able to identify instances that highly impact classification, i.e. bag-representatives, for both positive and negative bags, while finding the optimal class separation hyperplane. Unlike other multi-instance SVM methods, this approach eliminates possible …", "num_citations": "24\n", "authors": ["1076"]}
{"title": "Extremely High-dimensional Optimization with MapReduce: Scaling Functions and Algorithm\n", "abstract": " Large scale optimization is an active research area in which many algorithms, benchmark functions, and competitions have been proposed to date. However, extremely high-dimensional optimization problems comprising millions of variables demand new approaches to perform effectively in results quality and efficiently in time. Memetic algorithms are popular in continuous optimization but they are hampered on such extremely large dimensionality due to the limitations of computational and memory resources, and heuristics must tackle the immensity of the search space. This work advances on how the MapReduce parallel programming model allows scaling to problems with millions of variables, and presents an adaptation of the MA-SW-Chains algorithm to the MapReduce framework. Benchmark functions from the IEEE CEC 2010 and 2013 competitions are considered and results with 1, 3 and 10 million …", "num_citations": "24\n", "authors": ["1076"]}
{"title": "Solving classification problems using genetic programming algorithms on GPUs\n", "abstract": " Genetic Programming is very efficient in problem solving compared to other proposals but its performance is very slow when the size of the data increases. This paper proposes a model for multi-threaded Genetic Programming classification evaluation using a NVIDIA CUDA GPUs programming model to parallelize the evaluation phase and reduce computational time. Three different well-known Genetic Programming classification algorithms are evaluated using the parallel evaluation model proposed. Experimental results using UCI Machine Learning data sets compare the performance of the three classification algorithms in single and multithreaded Java, C and CUDA GPU code. Results show that our proposal is much more efficient.", "num_citations": "23\n", "authors": ["1076"]}
{"title": "Distributed selection of continuous features in multi-label classification using mutual information\n", "abstract": " Multilabel learning is a challenging task demanding scalable methods for large-scale data. Feature selection has shown to improve multilabel accuracy while defying the curse of dimensionality of high-dimensional scattered data. However, the increasing complexity of multilabel feature selection, especially on continuous features, requires new approaches to manage data effectively and efficiently in distributed computing environments. This article proposes a distributed model for mutual information (MI) adaptation on continuous features and multiple labels on Apache Spark. Two approaches are presented based on MI maximization, and minimum redundancy and maximum relevance. The former selects the subset of features that maximize the MI between the features and the labels, whereas the latter additionally minimizes the redundancy between the features. Experiments compare the distributed multilabel …", "num_citations": "21\n", "authors": ["1076"]}
{"title": "Scalable CAIM discretization on multiple GPUs using concurrent kernels\n", "abstract": " Class-attribute interdependence maximization (CAIM) is one of the state-of-the-art algorithms for discretizing data for which classes are known. However, it may take a long time when run on high-dimensional large-scale data, with large number of attributes and/or instances. This paper presents a solution to this problem by introducing a graphic processing unit (GPU)-based implementation of the CAIM algorithm that significantly speeds up the discretization process on big complex data sets. The GPU-based implementation is scalable to multiple GPU devices and enables the use of concurrent kernels execution capabilities of modern GPUs. The CAIM GPU-based model is evaluated and compared with the original CAIM using single and multi-threaded parallel configurations on 40 data sets with different characteristics. The results show great speedup, up to 139 times faster using four GPUs, which makes …", "num_citations": "21\n", "authors": ["1076"]}
{"title": "Multi-label kNN Classifier with Self Adjusting Memory for Drifting Data Streams\n", "abstract": " Multi-label data streams is a highly challenging task involving drifts in features and labels. Classifiers must automatically adapt to changes while keeping a competitive accuracy in a real-time dynamic environment where the frequencies of the labelsets are non-stationary and highly imbalanced. This paper presents a multi-label k Nearest Neighbor (kNN) with Self Adjusting Memory (SAM) for drifting data streams (ML-SAM-kNN). It exploits short-and long-term memories to predict the current and evolving states of the data stream. The experimental study compares the proposal with eight other multi-label classifiers for data streams on 23 datasets on six multi-label metrics, evaluation time, and memory consumption. Non-parametric statistical analysis of the results shows the superiority of ML-SAM-kNN, including when compared with ML-kNN.", "num_citations": "20\n", "authors": ["1076"]}
{"title": "Parallel evaluation of Pittsburgh rule-based classifiers on GPUs\n", "abstract": " Individuals from Pittsburgh rule-based classifiers represent a complete solution to the classification problem and each individual is a variable-length set of rules. Therefore, these systems usually demand a high level of computational resources and run-time, which increases as the complexity and the size of the data sets. It is known that this computational cost is mainly due to the recurring evaluation process of the rules and the individuals as rule sets. In this paper we propose a parallel evaluation model of rules and rule sets on GPUs based on the NVIDIA CUDA programming model which significantly allows reducing the run-time and speeding up the algorithm. The results obtained from the experimental study support the great efficiency and high performance of the GPU model, which is scalable to multiple GPU devices. The GPU model achieves a rule interpreter performance of up to 64 billion operations per …", "num_citations": "20\n", "authors": ["1076"]}
{"title": "A locally weighted learning method based on a data gravitation model for multi-target regression\n", "abstract": " Locally weighted regression allows to adjust the regression models to nearby data of a query example. In this paper, a locally weighted regression method for the multi-target regression problem is proposed. A novel way of weighting data based on a data gravitation-based approach is presented. The process of weighting data does not need to decompose the multi-target data into several single-target problems. This weighted regression method can be used with any multi-target regressor as a local method to provide the target vector of a query example. The proposed method was assessed on the largest collection of multi-target regression datasets publicly available. The experimental stage showed that the performance of multi-target regressors can be significantly improved by means of fitting the models to local training data.", "num_citations": "19\n", "authors": ["1076"]}
{"title": "GPU-parallel subtree interpreter for genetic programming\n", "abstract": " Genetic Programming (GP) is a computationally intensive technique but its nature is embarrassingly parallel. Graphic Processing Units (GPUs) are many-core architectures which have been widely employed to speed up the evaluation of GP. In recent years, many works have shown the high performance and efficiency of GPUs on evaluating both the individuals and the fitness cases in parallel. These approaches are known as population parallel and data parallel. This paper presents a parallel GP interpreter which extends these approaches and adds a new parallelization level based on the concurrent evaluation of the individual's subtrees. A GP individual defined by a tree structure with nodes and branches comprises different depth levels in which there are independent subtrees which can be evaluated concurrently. Threads can cooperate to evaluate different subtrees and share the results via GPU's shared …", "num_citations": "19\n", "authors": ["1076"]}
{"title": "OLLAWV: OnLine Learning Algorithm using Worst-Violators\n", "abstract": " Due to the ever-growing nature of dataset sizes, the need for scalable and accurate machine learning algorithms has become evident. Stochastic gradient descent methods are popular tools used to optimize large-scale learning problems because of their generalization performance, simplicity, and scalability. This paper proposes a novel stochastic, also known as online, learning algorithm for solving the L1 support vector machine (SVM) problem, named OnLine Learning Algorithm using Worst-Violators (OLLAWV). Unlike other stochastic methods, OLLAWV eliminates the need for specifying the maximum number of iterations and the use of a regularization term. OLLAWV uses early stopping for controlling the size of the margin instead of the regularization term. The experimental study, performed under very strict nested cross-validation (a.k.a., double resampling), evaluates and compares the performance of this …", "num_citations": "18\n", "authors": ["1076"]}
{"title": "A parallel genetic programming algorithm for classification\n", "abstract": " In this paper a Grammar Guided Genetic Programming-based method for the learning of rule-based classification systems is proposed. The method learns disjunctive normal form rules generated by means of a context-free grammar. The individual constitutes a rule based decision list that represents the full classifier. To overcome the problem of computational time of this system, it parallelizes the evaluation phase reducing significantly the computation time. Moreover, different operator genetics are designed to maintain the diversity of the population and get a compact set of rules. The results obtained have been validated by the use of non-parametric statistical tests, showing a good performance in terms of accuracy and interpretability.", "num_citations": "17\n", "authors": ["1076"]}
{"title": "Exploring Pattern Mining Algorithms for Hashtag Retrieval Problem\n", "abstract": " Hashtag is an iconic feature to retrieve the hot topics of discussion on Twitter or other social networks. This paper incorporates the pattern mining approaches to improve the accuracy of retrieving the relevant information and speeding up the search performance. A novel algorithm called PM-HR (Pattern Mining for Hashtag Retrieval) is designed to first transform the set of tweets into a transactional database by considering two different strategies (trivial and temporal). After that, the set of the relevant patterns is discovered, and then used as a knowledge-based system for finding the relevant tweets based on users' queries under the similarity search process. Extensive results are carried out on large and different tweet collections, and the proposed PM-HR outperforms the baseline hashtag retrieval approaches in terms of runtime, and it is very competitive in terms of accuracy.", "num_citations": "15\n", "authors": ["1076"]}
{"title": "Multi-label Punitive kNN with Self-Adjusting Memory for Drifting Data Streams\n", "abstract": " In multi-label learning, data may simultaneously belong to more than one class. When multi-label data arrives as a stream, the challenges associated with multi-label learning are joined by those of data stream mining, including the need for algorithms that are fast and flexible, able to match both the speed and evolving nature of the stream. This article presents a punitive k nearest neighbors algorithm with a self-adjusting memory (MLSAMPkNN) for multi-label, drifting data streams. The memory adjusts in size to contain only the current concept and a novel punitive system identifies and penalizes errant data examples early, removing them from the window. By retaining and using only data that are both current and beneficial, MLSAMPkNN is able to adapt quickly and efficiently to changes within the data stream while still maintaining a low computational complexity. Additionally, the punitive removal mechanism offers …", "num_citations": "14\n", "authors": ["1076"]}
{"title": "Discovering useful patterns from multiple instance data\n", "abstract": " Association rule mining is one of the most common data mining techniques used to identify and describe interesting relationships between patterns from large datasets, the frequency of an association being defined as the number of transactions that it satisfies. In situations where each transaction includes an undetermined number of instances (customers shopping habits where each transaction represents a different customer having a varied number of instances), the problem cannot be described as a traditional association rule mining problem. The aim of this work is to discover robust and useful patterns from multiple instance datasets, that is, datasets where each transaction may include an undetermined number of instances. We propose a new problem formulation in the data mining framework: multiple-instance association rule mining. The problem definition, an algorithm to tackle the problem, the application …", "num_citations": "14\n", "authors": ["1076"]}
{"title": "Blocking Self-avoiding Walks Stops Cyber-epidemics: A Scalable GPU-based Approach\n", "abstract": " Cyber-epidemics, the widespread of fake news or propaganda through social media, can cause devastating economic and political consequences. A common countermeasure against cyber-epidemics is to disable a small subset of suspected social connections or accounts to effectively contain the epidemics. An example is the recent shutdown of 125,000 ISIS-related Twitter accounts. Despite many proposed methods to identify such a subset, none are scalable enough to provide high-quality solutions in nowadays' billion-size networks. To this end, we investigate the Spread Interdiction problems that seek the most effective links (or nodes) for removal under the well-known Linear Threshold model. We propose novel CPU-GPU methods that scale to networks with billions of edges, yet possess rigorous theoretical guarantee on the solution quality. At the core of our methods is an O(1)-space out-of-core algorithm to …", "num_citations": "13\n", "authors": ["1076"]}
{"title": "Trajectory Outlier Detection: Algorithms, Taxonomies, Evaluation and Open Challenges\n", "abstract": " Detecting abnormal trajectories is an important task in research and industrial applications, which has attracted considerable attention in recent decades. This work studies the existing trajectory outlier detection algorithms in different industrial domains and applications, including maritime, smart urban transportation, video surveillance, and climate change domains. First, we review several algorithms for trajectory outlier detection. Second, different taxonomies are proposed regarding application-, output-, and algorithm-based levels. Third, evaluation of 10 trajectory outlier detection algorithms is performed on small, large, and big trajectory databases. Finally, future challenges and open issues with regard to trajectory outliers are derived and discussed. This survey offers a general overview of existing trajectory outlier detection algorithms in industrial informatics applications. As a result, mature solutions may be …", "num_citations": "13\n", "authors": ["1076"]}
{"title": "A General-Purpose Distributed Pattern Mining System\n", "abstract": " This paper explores five pattern mining problems and proposes a new distributed framework called DT-DPM: Decomposition Transaction for Distributed Pattern Mining. DT-DPM addresses the limitations of the existing pattern mining problems by reducing the enumeration search space. Thus, it derives the relevant patterns by studying the different correlation among the transactions. It first decomposes the set of transactions into several clusters of different sizes, and then explores heterogeneous architectures, including MapReduce, single CPU, and multi CPU, based on the densities of each subset of transactions. To evaluate the DT-DPM framework, extensive experiments were carried out by solving five pattern mining problems (FIM: Frequent Itemset Mining, WIM: Weighted Itemset Mining, UIM: Uncertain Itemset Mining, HUIM: High Utility Itemset Mining, and SPM: Sequential Pattern Mining). Experimental results reveal that by using DT-DPM, the scalability of the pattern mining algorithms was improved on large databases. Results also reveal that DT-DPM outperforms the baseline parallel pattern mining algorithms on big databases.", "num_citations": "13\n", "authors": ["1076"]}
{"title": "100 million dimensions large-scale global optimization using distributed GPU computing\n", "abstract": " At this time, many industrial and science problems deal with a large number of decision variables. Classic metaheuristics have shown excellent search abilities on bounded problems, but they often lose their efficacy when applied to large ones. This is known as the curse of dimensionality. To this issue, we have to add the simple fact that the solution evaluation becomes excessively demanding in time. To push the research state forward on this type of problems, the IEEE Congress on Evolutionary Computation regularly organises a competition on large-scale global optimization since 2008. On the other hand, general purpose computing with graphics processing units has become very attractive in the last years, because they may attain very high speed-up ratios on problems with high data parallelism levels. In this work, we study the benefits of exploiting a scalable and distributed computational architecture with …", "num_citations": "13\n", "authors": ["1076"]}
{"title": "An EP algorithm for learning highly interpretable classifiers\n", "abstract": " This paper introduces an Evolutionary Programming algorithm for solving classification problems using highly interpretable IF-THEN classification rules. It is an algorithm aimed to maximize the comprehensibility of the classifier by minimizing the number of rules and employing only relevant attributes. The proposal is evaluated and compared to other 5 well-known classification techniques over 18 datasets. The results obtained from the experiments show its competitive accuracy and the significantly better interpretability of the classifiers provided in terms of number of rules, number of conditions and a complexity metric.", "num_citations": "13\n", "authors": ["1076"]}
{"title": "A Data-Driven Approach for Twitter Hashtag Recommendation\n", "abstract": " This paper addresses the hashtag recommendation problem using high average-utility pattern mining. We introduce a novel framework called PM-HRec (Pattern Mining for Hashtag Recommendation). It consists of two main stages. First, offline processing transforms the corpus of tweets into a transactional database considering the temporal information of the tagged tweets (tweets with hashtags). The method discovers the temporal top k high average utility patterns. Irrelevant tagged tweets and the ontology of tagged tweets are also constructed offline. Second, an online processing inputs the utility patterns, the ontology, and the irrelevant tagged tweets to extract the most relevant hashtags for a given orpheline tweet (tweet without hashtags). Extensive experiments were carried out on large tweets collections. The proposed PM-HRec outperforms the existing state of the art hashtag recommendation approaches in …", "num_citations": "12\n", "authors": ["1076"]}
{"title": "Adaptive Ensemble Active Learning for Drifting Data Stream Mining\n", "abstract": " Learning from data streams is among the most vital contemporary fields in machine learning and data mining. Streams pose new challenges to learning systems, due to their volume and velocity, as well as ever-changing nature caused by concept drift. Vast majority of works for data streams assume a fully supervised learning scenario, having an unrestricted access to class labels. This assumption does not hold in real-world applications, where obtaining ground truth is costly and time-consuming. Therefore, we need to carefully select which instances should be labeled, as usually we are working under a strict label budget. In this paper, we propose a novel active learning approach based on ensemble algorithms that is capable of using multiple base classifiers during the label query process. It is a plug-in solution, capable of working with most of existing streaming ensemble classifiers. We realize this process as a Multi-Armed Bandit problem, obtaining an efficient and adaptive ensemble active learning procedure by selecting the most competent classifier from the pool for each query. In order to better adapt to concept drifts, we guide our instance selection by measuring the generalization capabilities of our classifiers. This adaptive solution leads not only to better instance selection under sparse access to class labels, but also to improved adaptation to various types of concept drift and increasing the diversity of the underlying ensemble classifier.", "num_citations": "11\n", "authors": ["1076"]}
{"title": "Learning classification rules with differential evolution for high-speed data stream mining on GPUs\n", "abstract": " High-speed data streams are potentially infinite sequences of rapidly arriving instances that may be subject to concept drift phenomenon. Hence, dedicated learning algorithms must be able to update themselves with new data and provide an accurate prediction in a limited amount of time. This requirement was considered as prohibitive for using evolutionary algorithms for high-speed data stream mining. This paper introduces a massively parallel implementation on GPUs of a differential evolution algorithm for learning classification rules in the presence of concept drift. The proposal based on the DE /rand - to - best/1/bin strategy takes advantage of up to four nested levels of parallelism to maximize the performance of the algorithm. Efficient GPU kernels parallelize the evolution of the populations, rules, conditional clauses, and evaluation on instances. The proposed method is evaluated on 25 data stream …", "num_citations": "11\n", "authors": ["1076"]}
{"title": "A data structure to speed-up machine learning algorithms on massive datasets\n", "abstract": " Data processing in a fast and efficient way is an important functionality in machine learning, especially with the growing interest in data storage. This exponential increment in data size has hampered traditional techniques for data analysis and data processing, giving rise to a new set of methodologies under the term Big Data. Many efficient algorithms for machine learning have been proposed, facing up time and main memory requirements. Nevertheless, this process could still become hard when the number of features or records is extremely high. In this paper, the goal is not to propose new efficient algorithms but a new data structure that could be used by a variety of existing algorithms without modifying their original schemata. Moreover, the proposed data structure enables sparse datasets to be massively reduced, efficiently processing the data input into a new data structure output. The results …", "num_citations": "11\n", "authors": ["1076"]}
{"title": "Autómatas celulares y aplicaciones\n", "abstract": " Un autómata celular es un modelo matemático para un sistema dinámico que evoluciona en pasos discretos. Este trabajo presenta una aplicación de los autómatas celulares para el cifrado de información y el reparto de secretos. Se detalla un ejemplo didáctico de su aplicación para el cifrado de secretos empleando imágenes digitales. El desarrollo de este trabajo ha servido como actividad académica dirigida a alumnado de Ingeniería en Informática, para fomentar su interés en la criptografía mediante herramientas matemáticas estudiadas a lo largo de su carrera.", "num_citations": "11\n", "authors": ["1076"]}
{"title": "Active Learning with Abstaining Classifiers for Imbalanced Drifting Data Streams\n", "abstract": " Learning from data streams is one of the most promising and challenging domains in modern machine learning. Proliferating online data sources provide us access to real-time knowledge we have never had before. At the same time, new obstacles emerge and we have to overcome them in order to fully and effectively utilize the potential of the data. Prohibitive time and memory constraints or non-stationary distributions are only some of the problems. When dealing with classification tasks, one has to remember that effective adaptation has to be achieved on weak foundations of partially labeled and often imbalanced data. In our work, we propose an online framework for binary classification, that aims to handle the complex problem of working with dynamic, sparsely labeled and imbalanced streams. The main part of it is a novel active learning strategy (MD-OAL) that is able to prioritize labeling of minority instances …", "num_citations": "10\n", "authors": ["1076"]}
{"title": "Parallelization strategies for markerless human motion capture\n", "abstract": " Markerless motion capture (MMOCAP) is the problem of determining the pose of a person from images captured by one or several cameras simultaneously without using markers on the subject. Evaluation of the solutions is frequently the most time-consuming task, making most of the proposed methods inapplicable in real-time scenarios. This paper presents an efficient approach to parallelize the evaluation of the solutions in CPUs and GPUs. Our proposal is experimentally compared on six sequences of the HumanEva-I dataset using the CMAES algorithm. Multiple algorithm’s configurations were tested to analyze the best trade-off with regard to the accuracy and computing time. The proposed methods obtain speedups of 8 in multi-core CPUs, 30 in a single GPU and up to 110 using 4 GPUs.", "num_citations": "10\n", "authors": ["1076"]}
{"title": "Large-scale multi-label ensemble learning on Spark\n", "abstract": " Multi-label learning is a challenging problem which has received growing attention in the research community over the last years. Hence, there is a growing demand of effective and scalable multi-label learning methods for larger datasets both in terms of number of instances and numbers of output labels. The use of ensemble classifiers is a popular approach for improving multi-label model accuracy, especially for datasets with high-dimensional label spaces. However, the increasing computational complexity of the algorithms in such ever-growing high-dimensional label spaces, requires new approaches to manage data effectively and efficiently in distributed computing environments. Spark is a framework based on MapReduce, a distributed programming model that offers a robust paradigm to handle large-scale datasets in a cluster of nodes. This paper focuses on multi-label ensembles and proposes a number of …", "num_citations": "9\n", "authors": ["1076"]}
{"title": "A hybrid dynamic programming for solving a mixed-model sequencing problem with production mix restriction and free interruptions\n", "abstract": " In this article, we propose a hybrid procedure based on bounded dynamic programming assisted by linear programming to solve the mixed-model sequencing problem with workload minimization with serial workstations, free interruption of the operations and with production mix restrictions. We performed a computational experiment with 23 instances related to a case study of the Nissan powertrain plant located in Barcelona. The results of our proposal are compared with those obtained by mixed integer linear programming.", "num_citations": "9\n", "authors": ["1076"]}
{"title": "Selecting local ensembles for multi-class imbalanced data classification\n", "abstract": " Learning from imbalanced data is a challenge that machine learning community is facing over last decades, due to its ever-growing presence in real-life problems. While there is a significant number of works addressing the issue of handling binary and skewed datasets, its multi-class counterpart have not received as much attention. This problem is much more difficult, as presence of multiple imbalanced classes can significantly deteriorate the predictive power of any classifier. The relationship among classes are no longer clearly established and there are many difficulties embedded in the nature of such data that needs to be properly addressed. In this work, we discuss the issue of forming effective ensembles for multi-class imbalanced data based on static classifier selection approach. We propose a fully adaptive learning scheme that splits the original feature space into a number of competence areas and …", "num_citations": "8\n", "authors": ["1076"]}
{"title": "A grammar-guided genetic programming algorithm for multi-label classification\n", "abstract": " Multi-label classification is a challenging problem which demands new knowledge discovery methods. This paper presents a Grammar-Guided Genetic Programming algorithm for solving multi-label classification problems using IF-THEN classification rules. This algorithm, called G3P-ML, is evaluated and compared to other multi-label classification techniques in different application domains. Computational experiments show that G3P-ML often obtains better results than other algorithms while achieving a lower number of rules than the other methods.", "num_citations": "7\n", "authors": ["1076"]}
{"title": "Genetic programming for mining association rules in relational database environments\n", "abstract": " Most approaches for the extraction of association rules look for associations from a dataset in the form of a single table. However, with the growing interest in the storage of information, relational databases comprising a series of relations (tables) and relationships have become essential. We present the first grammar-guided genetic programming approach for mining association rules directly from relational databases. We represent the relational databases as trees by means of genetic programming, preserving the original database structure and enabling rules to be defined in an expressive and very flexible way. The proposed model deals with both positive and negative items, and also with both discrete and quantitative attributes. We exemplify the utility of the proposed approach with an artificial generated database having different characteristics. We also analyse a real case study, discovering interesting …", "num_citations": "5\n", "authors": ["1076"]}
{"title": "Classification rule mining with iterated greedy\n", "abstract": " In the context of data mining, classification rule discovering is the task of designing accurate rule based systems that model the useful knowledge that differentiate some data classes from others, and is present in large data sets.                                Iterated greedy search is a powerful metaheuristic, successfully applied to different optimisation problems, which to our knowledge, has not previously been used for classification rule mining.               In this work, we analyse the convenience of using iterated greedy algorithms for the design of rule classification systems. We present and study different alternatives and compare the results with state-of-the-art methodologies from the literature. The results show that iterated greedy search may generate accurate rule classification systems with acceptable interpretability levels.", "num_citations": "5\n", "authors": ["1076"]}
{"title": "Binary and multiclass imbalanced classification using multi-objective ant programming\n", "abstract": " Classification in imbalanced domains is a challenging task, since most of its real domain applications present skewed distributions of data. However, there are still some open issues in this kind of problem. This paper presents a multi-objective grammar-based ant programming algorithm for imbalanced classification, capable of addressing this task from both the binary and multiclass sides, unlike most of the solutions presented so far. We carry out two experimental studies comparing our algorithm against binary and multiclass solutions, demonstrating that it achieves an excellent performance for both binary and multiclass imbalanced data sets.", "num_citations": "4\n", "authors": ["1076"]}
{"title": "Trabajando con imágenes digitales en clase de Matemáticas\n", "abstract": " Los profesores de Matemáticas, sobre todo de titulaciones de Ciencias e Ingeniería, debemos presentar a nuestros alumnos aplicaciones de las Matemáticas en áreas de interés para sus estudios. De esta forma conseguiremos que nuestros alumnos aprendan Matemáticas sabiendo para qué les pueden servir y una mayor motivación de los mismos hacia la asignatura. En este trabajo se muestran unas propuestas desarrolladas con alumnos de primer curso de Ingeniería Técnica Informática. Veremos cómo las imágenes digitales pueden ser una magnífica herramienta en clase de Matemáticas.Las imágenes digitales son matrices y por eso existe una relación evidente entre imágenes y Matemáticas. Podemos utilizar imágenes para trabajar con conceptos matemáticos desarrollados en clase. En este artículo se van a exponer algunos de los ejemplos que hemos propuesto a nuestros alumnos. Algunos de estos ejemplos eran", "num_citations": "4\n", "authors": ["1076"]}
{"title": "Speeding Up Classifier Chains in Multi-label Classification\n", "abstract": " Multi-label classification has attracted increasing attention of the scientific community in recent years, given its ability to solve problems where each of the examples simultaneously belongs to multiple labels. From all the techniques developed to solve multi-label classification problems, Classifier Chains has been demonstrated to be one of the best performing techniques. However, one of its main drawbacks is its inherently sequential definition. Although many research works aimed to reduce the runtime of multi-label classification algorithms, to the best of our knowledge, there are no proposals to specifically reduce the runtime of Classifier Chains. Therefore, in this paper we propose a method called Parallel Classifier Chains which enables the parallelization of Classifier Chain. In this way, Parallel Classifier Chains builds k binary classifiers in parallel, where each of them includes as extra input features the predictions of those labels that have been previously built. We performed an experimental evaluation over 20 datasets using 5 metrics to analyze both the runtime and the predictive performance of our proposal. The results of the experiments affirmed that our proposal was able to significantly reduce the runtime of Classifier Chains while the predictive performance was not statistically significantly harmed.", "num_citations": "3\n", "authors": ["1076"]}
{"title": "JCLEC Meets WEKA!\n", "abstract": " WEKA has recently become a very referenced DM tool. In spite of all the functionality it provides, it does not include any framework for the development of evolutionary algorithms. An evolutionary computation framework is JCLEC, which has been successfully employed for developing several EAs. The combination of both may lead in a mutual benefit. Thus, this paper proposes an intermediate layer to connect WEKA with JCLEC. It also presents a study case which samples the process of including a JCLEC’s EA into WEKA.", "num_citations": "3\n", "authors": ["1076"]}
{"title": "Cifrado de imágenes y Matemáticas\n", "abstract": " Un tema que debe interesar al profesorado de Matemáticas de todos los niveles educativos es cómo hacer comprender a nuestros alumnos la utilidad de los conceptos matemáticos que están estudiando en nuestras asignaturas. Si se les presenta aplicaciones de las Matemáticas en temas atractivos e interesantes conseguiremos motivar a nuestros alumnos. Una de estas aplicaciones es el cifrado de la información. La Criptografía es un tema de gran actualidad debido al auge de Internet, la telefonía móvil, etc. y el correspondiente aumento de intercambio de información: comercio electrónico, transacciones bancarias, etc. Es imprescindible poder intercambiar información de manera segura a salvo de intrusos malintencionados. No sólo se producen intercambios de mensajes de texto sino que también se producen intercambios de otro tipo de ficheros digitales como imágenes, ficheros de audio, etc. Este trabajo se va a dedicar a presentar una experiencia docente realizada con alumnos de una asignatura de Matemáticas de primer curso de Ingeniería Técnica Informática sobre técnicas de cifrado de imágenes digitales. Los métodos de cifrado han sido muy variados: un par de métodos basados en cálculo matricial, un método basado en el Teorema Chino de los Restos y un método basado en secuencias caóticas. De esta forma conseguimos relacionar las Matemáticas que se estudian en clase con temas de interés para nuestros alumnos. Así conseguimos que valoren más los conocimientos que están adquiriendo.", "num_citations": "3\n", "authors": ["1076"]}
{"title": "On-site forest fire smoke detection by low-power autonomous vision sensor\n", "abstract": " Early detection plays a crucial role to prevent forest fires from spreading. Wireless vision sensor networks deployed throughout high-risk areas can perform fine-grained surveillance and thereby very early detection and precise location of forest fires. One of the fundamental requirements that need to be met at the network nodes is reliable low-power on-site image processing. It greatly simplifies the communication infrastructure of the network as only alarm signals instead of complete images are transmitted, anticipating thus a very competitive cost. As a first approximation to fulfill such a requirement, this paper reports the results achieved from field tests carried out in collaboration with the Andalusian Fire-Fighting Service (INFOCA). Two controlled burns of forest debris were realized (www.youtube.com/user/vmoteProject). Smoke was successfully detected on-site by the EyeRISTM v1.2, a general-purpose autonomous vision system, built by AnaFocus Ltd., in which a vision algorithm was programmed. No false alarm was triggered despite the significant motion other than smoke present in the scene. Finally, as a further step, we describe the preliminary laboratory results obtained from a prototype vision chip which implements, at very low energy cost, some image processing primitives oriented to environmental monitoring.", "num_citations": "3\n", "authors": ["1076"]}
{"title": "Self-Adjusting k Nearest Neighbors for Continual Learning from Multi-Label Drifting Data Streams\n", "abstract": " Drifting data streams and multi-label data are both challenging problems. Multi-label instances may simultaneously be associated with many labels and classifiers must predict the complete set of labels. Learning from data streams requires algorithms able to learn from potentially unbounded data that is constantly changing. When multi-label data arrives as a stream, the challenges of both problems must be addressed, but additional challenges unique to the combined problem also arise. Each label may experience different concept drifts, simultaneously or distinctly, and parameter optimizations may be different for each label. In this paper we present a self-adapting algorithm for drifting, multi-label data streams, that can adapt to a variety of concepts drifts, is robust to data-level difficulties, and mitigates the necessity to tune multiple parameters. The window of retained instances self-adjusts in size to retain only the …", "num_citations": "2\n", "authors": ["1076"]}
{"title": "A Two-Phase Anomaly Detection Model for Secure Intelligent Transportation Ride-Hailing Trajectories\n", "abstract": " This paper addresses the taxi fraud problem and introduces a new solution to identify trajectory outliers. The approach as presented allows to identify both individual and group outliers and is based on a two phase-based algorithm. The first phase determines the individual trajectory outliers by computing the distance of each point in each trajectory, whereas the second identifies the group trajectory outliers by exploring the individual trajectory outliers using both feature selection and sliding windows strategies. A parallel version of the algorithm is also proposed using a sliding window-based GPU approach to boost the runtime performance. Extensive experiments have been carried out to thoroughly demonstrate the usefulness of our methodology on both synthetic and real trajectory databases. The results show that the GPU approach enables reaching a speed-up of 341 over the sequential algorithm on large …", "num_citations": "2\n", "authors": ["1076"]}
{"title": "PSIONplusm Server for Accurate Multi-Label Prediction of Ion Channels and Their Types\n", "abstract": " Computational prediction of ion channels facilitates the identification of putative ion channels from protein sequences. Several predictors of ion channels and their types were developed in the last quindecennial. While they offer reasonably accurate predictions, they also suffer a few shortcomings including lack of availability, parallel prediction mode, single-label prediction (inability to predict multiple channel subtypes), and incomplete scope (inability to predict subtypes of the voltage-gated channels). We developed a first-of-its-kind PSIONplus m method that performs sequential multi-label prediction of ion channels and their subtypes for both voltage-gated and ligand-gated channels. PSIONplus m sequentially combines the outputs produced by three support vector machine-based models from the PSIONplus predictor and is available as a webserver. Empirical tests show that PSIONplus m outperforms current methods for the multi-label prediction of the ion channel subtypes. This includes the existing single-label methods that are available to the users, a naïve multi-label predictor that combines results produced by multiple single-label methods, and methods that make predictions based on sequence alignment and domain annotations. We also found that the current methods (including PSIONplus m) fail to accurately predict a few of the least frequently occurring ion channel subtypes. Thus, new predictors should be developed when a larger quantity of annotated ion channels will be available to train predictive models. View Full-Text", "num_citations": "2\n", "authors": ["1076"]}
{"title": "Hybrid Group Anomaly Detection for Sequence Data: Application to Trajectory Data Analytics\n", "abstract": " Many research areas depend on group anomaly detection. The use of group anomaly detection can maintain and provide security and privacy to the data involved. This research attempts to solve the deficiency of the existing literature in outlier detection thus a novel hybrid framework to identify group anomaly detection from sequence data is proposed in this paper. It proposes two approaches for efficiently solving this problem: i) Hybrid Data Mining-based algorithm, consists of three main phases: first, the clustering algorithm is applied to derive the micro-clusters. Second, the kNN algorithm is applied to each micro-cluster to calculate the candidates of the group's outliers. Third, a pattern mining framework gets applied to the candidates of the group's outliers as a pruning strategy, to generate the groups of outliers, and ii) a GPU-based approach is presented, which benefits from the massively GPU computing to boost …", "num_citations": "1\n", "authors": ["1076"]}
{"title": "An Ontology Matching Approach for Semantic Modeling: A Case Study in Smart Cities\n", "abstract": " This paper investigates the semantic modeling of smart cities and proposes two ontology matching frameworks, called Clustering for Ontology Matching‐based Instances (COMI) and Pattern mining for Ontology Matching‐based Instances (POMI). The goal is to discover the relevant knowledge by investigating the correlations among smart city data based on clustering and pattern mining approaches. The COMI method first groups the highly correlated ontologies of smart‐city data into similar clusters using the generic k‐means algorithm. The key idea of this method is that it clusters the instances of each ontology and then matches two ontologies by matching their clusters and the corresponding instances within the clusters. The POMI method studies the correlations among the data properties and selects the most relevant properties for the ontology matching process. To demonstrate the usefulness and accuracy of …", "num_citations": "1\n", "authors": ["1076"]}
{"title": "An Evolutionary Self-Adaptive Algorithm for Mining Association Rules\n", "abstract": " This paper presents a novel self-adaptive grammar-guided genetic programming proposal for mining association rules. It generates individuals through a context-free grammar, which allows of defining rules in an expressive and flexible way over different domains. Each rule is represented as a derivation tree that shows a solution (described using the language) denoted by the grammar. Unlike existing evolutionary algorithms for mining association rules, the proposed algorithm only requires a small number of parameters, providing the possibility of discovering association rules in an easy way for non-expert users. More specifically, this algorithm does not require any threshold, and uses a novel parent selector based on a niche-crowding model to group rules. This approach keeps the", "num_citations": "1\n", "authors": ["1076"]}
{"title": "Modelo gravitacional para clasificación\n", "abstract": " La gravedad es una interacción fundamental, cuyo concepto y efectos han sido aplicados a la clasificación de datos. El principio de la clasificación gravitatoria es clasificar los ejemplos mediante la comparación de la atracción gravitatoria a las distintas clases. Este artıculo presenta un algoritmo de clasificación gravitatoria que mejora los modelos gravitatorios existentes y soluciona algunos de sus problemas. El algoritmo propuesto, denominado IGCA (Improved Gravitation Classification Algorithm), es capaz de trabajar con atributos numéricos y nominales, filtrar atributos ruidosos o irrelevantes, y alcanzar buenos resultados sobre conjuntos de datos no balanceados. La propuesta emplea una matriz de pesos para describir la importancia de cada atributo en la clasificación de cada clase y mejora la exactitud en la clasificación al considerar tanto la información global como local de los datos, especialmente en los ejemplos cercanos a la frontera entre clases. La propuesta se evalúa y compara con otros 6 algoritmos de clasificación, incluyendo un modelo gravitatorio previo, sobre 30 conjuntos de datos. Los resultados obtenidos de la experimentación muestran los buenos resultados de nuestro modelo gravitatorio y se validan mediante tests estadısticos no paramétricos.", "num_citations": "1\n", "authors": ["1076"]}