{"title": "The grapevine genome sequence suggests ancestral hexaploidization in major angiosperm phyla.\n", "abstract": " The analysis of the first plant genomes provided unexpected evidence for genome duplication events in species that had previously been considered as true diploids on the basis of their genetics. These polyploidization events may have had important consequences in plant evolution, in particular for species radiation and adaptation and for the modulation of functional capacities. Here we report a high-quality draft of the genome sequence of grapevine (Vitis vinifera) obtained from a highly homozygous genotype. The draft sequence of the grapevine genome is the fourth one produced so far for flowering plants, the second for a woody species and the first for a fruit crop (cultivated for both fruit and beverage). Grapevine was selected because of its important place in the cultural heritage of humanity beginning during the Neolithic period. Several large expansions of gene families with roles in aromatic features are observed. The grapevine genome has not undergone recent genome duplication, thus enabling the discovery of ancestral traits and features of the genetic organization of flowering plants. This analysis reveals the contribution of three ancestral genomes to the grapevine haploid content. This ancestral arrangement is common to many dicotyledonous plants but is absent from the genome of rice, which is a monocotyledon. Furthermore, we explain the chronology of previously described whole-genome duplication events in the evolution of flowering plants.", "num_citations": "3333\n", "authors": ["1640"]}
{"title": "A consensus list of microsatellite markers for olive genotyping\n", "abstract": " Cultivar identification is a primary concern for olive growers, breeders, and scientists. This study was aimed at examining the SSR markers retrieved from the literature and currently used in olive study, in order to select those most effective in characterizing the olive accessions and to make possible the comparison of data obtained by different laboratories. Olive microsatellite profiles were assessed by four independent laboratories, which analyzed 37 pre-selected SSR loci on a set of 21 cultivars. These SSR markers were initially tested for their reproducibility, power of discrimination and number of amplified loci/alleles. Independent segregation was tested for each pair of SSRs in a controlled cross and the allelic error rate was quantified. Some of them were finally selected as the most informative and reliable. Most of the alleles were sequenced and their sizes were determined. Profiles of the reference …", "num_citations": "218\n", "authors": ["1640"]}
{"title": "Ariadne: a framework for reachability analysis of hybrid automata\n", "abstract": " In this paper we introduce the problem of reachability analysis of hybrid automata to decide safety properties. Then we describe ARIADNE, an in-progress open environment to design algorithms for computing with hybrid automata. We show that ARIADNE relies on a rigorous computable analysis theory to represent geometric objects, in order to achieve provable approximation bounds along the computations. The proposed tool differs from existing ones because it relies on a sound theoretical basis for the semantics of operators in continuous space and time, making available exact and approximate, but error-bounded operations on geometric points and sets. Currently the geometry module is substantially completed, and work is in progress on the evaluation module. As a first application, we will use ARIADNE to compute the reachable sets of a challenging collection of benchmarks whose safety properties have practical interest.", "num_citations": "66\n", "authors": ["1640"]}
{"title": "Room and high temperature wear behaviour of Ni matrix micro-and nano-SiC composite electrodeposits\n", "abstract": " In the frame of the research domain of the production of metal matrix composite deposits the aim of this work is the production of Ni matrix composite coatings containing either micro- or nano-SiC particles and their characterization. The electrodeposition has been carried out under DC conditions using a nickel sulfammate plating bath into which the particles were suspended. The composite coatings were tested and compared to pure nickel deposits regarding the microstructure, microhardness and wear resistance under high load at both room temperature and 300 °C. The codeposition of the SiC particles changed the microstructure of the nickel matrix and the preferential orientation of the Ni grains leading to a noticeable improvement on both microhardness and wear resistance. The pure nickel deposit presents a pseudocolumnar structure and a preferential [100] orientation. The codeposition of the μSiC particles …", "num_citations": "44\n", "authors": ["1640"]}
{"title": "Reachability computation for hybrid systems with Ariadne\n", "abstract": " Ariadne is an in-progress open environment to design algorithms for computing with hybrid automata, that relies on a rigorous computable analysis theory to represent geometric objects, in order to achieve provable approximation bounds along the computations. In this paper we discuss the problem of reachability analysis of hybrid automata to decide safety properties. We describe in details the algorithm used in Ariadne to compute over-approximations of reachable sets. Then we show how it works on a simple example. Finally, we discuss the lower-approximation approach to the reachability problem and how to extend Ariadne to support it.", "num_citations": "40\n", "authors": ["1640"]}
{"title": "Semi-algebraic constant reset hybrid automata-SACoRe\n", "abstract": " In this paper we introduce and study a special class of hybrid automata, Semi-Algebraic Constant Reset hybrid automata (SACoRe). SACoRe automata are an extension of Ominimal semi-algebraic automata over the reals in the case of flows obtained from non-autonomous systems of differential inclusions. Even though SACoRe automata do not have the finite bisimulation property, they do admit decision procedures for reachability and model checking for a limited fragment of CTL, by combining Tarski's decidability result over the reals and Michael's selection theorem.", "num_citations": "28\n", "authors": ["1640"]}
{"title": "GAM: genomic assemblies merger: a graph based method to integrate different assemblies\n", "abstract": " Many software tools are currently available to solve the hard goal of assembling millions of fragments produced in sequencing projects. Such a variety includes packages for long and short reads, generated by classical and next-generation sequencing technologies. Often the result produced by different tools can diverge-sometime significantly-for many reasons: the underlying algorithm, the data structures employed, the heuristics implemented, default parameters, etc. On the ground of the above considerations, we were motivated in developing a methodology which may both guide in a comparison of different assembler's output and improve the overall quality of the genome assembly sequences,by merging the sequences produced by different assembly programs.", "num_citations": "21\n", "authors": ["1640"]}
{"title": "Inclusion dynamics hybrid automata\n", "abstract": " Hybrid systems are dynamical systems with the ability to describe mixed discrete-continuous evolution of a wide range of systems. Consequently, at first glance, hybrid systems appear powerful but recalcitrant, neither yielding to analysis and reasoning through a purely continuous-time modeling as with systems of differential equations, nor open to inferential processes commonly used for discrete state-transition systems such as finite state automata. A convenient and popular model, called hybrid automata, was introduced to model them and has spurred much interest on its tractability as a tool for inference and model checking in a general setting. Intuitively, a hybrid automaton is simply a “finite-state” automaton with each state augmented by continuous variables, which evolve according to a set of well-defined continuous laws, each specified separately for each state. This article investigates both the notion of …", "num_citations": "20\n", "authors": ["1640"]}
{"title": "Independent dynamics hybrid automata in systems biology\n", "abstract": " Independent Dynamics Hybrid Automata (IDA) describe a new class of hybrid automata that extends decidable O-minimal automata by further allowing identity resets. We define the conditions under which reachability is decidable over IDA. These conditions involve the satisfiability of first-order formulæ that limit the interval of time we need to consider to study reachability. In order to prove the decidability of reachability we mainly exploit the decidability of the first-order formulæ which define IDA. IDA are useful in the modeling of biological systems where it is possible to have variables which continue their flows independently (eg, external input reactants). We briefly comment on how to model bacterial chemotaxis using IDA.", "num_citations": "17\n", "authors": ["1640"]}
{"title": "Discrete semantics for hybrid automata\n", "abstract": " Many natural systems exhibit a hybrid behavior characterized by a set of continuous laws which are switched by discrete events. Such behaviors can be described in a very natural way by a class of automata called hybrid automata. Their evolution are represented by both dynamical systems on dense domains and discrete transitions. Once a real system is modeled in a such framework, one may want to analyze it by applying automatic techniques, such as Model Checking or Abstract Interpretation. Unfortunately, the discrete/continuous evolutions not only provide hybrid automata of great flexibility, but they are also at the root of many undecidability phenomena. This paper addresses issues regarding the decidability of the reachability problem for hybrid automata (i.e., “can the system reach a state a from a state b?”) by proposing an “inaccurate” semantics. In particular, after observing that dense sets are …", "num_citations": "15\n", "authors": ["1640"]}
{"title": "Translating time-course gene expression profiles into semi-algebraic hybrid automata via dimensionality reduction\n", "abstract": " Biotechnological innovations which sample gene expressions allow to measure the gene expression levels of a biological system with varying degree of accuracy, cost and speed. By repeating the measurement steps at different sampling rates, one can both infer relations among the genes and define a dynamic model of the underlying biological system. When a very large number of genes and measurements are involved, they raise several difficult algorithmic questions, as accurate model-building, checking and inference tasks. Semi-algebraic hybrid automata were proposed as a modeling formalism for biological systems (see, e.g., [17,6]), and demonstrated their abilities to handle complex biochemical pathways. This paper proposes an automatic procedure to build semi-algebraic hybrid automata from gene-expression profiles. In order to reduce the size of the resulting automata and to minimize their …", "num_citations": "15\n", "authors": ["1640"]}
{"title": "Improving reachability analysis of hybrid automata for engine control\n", "abstract": " A new approach is presented for computing approximations of the reached sets of linear hybrid automata. First, we present some new theoretical results on termination of a class of reachability algorithms, which includes Botchkarev's, based on ellipsoidal calculus. The main contribution of the paper is a revised reachability computation that avoids the approximations caused by the union operation in the discretized flow tube estimation. Therefore, the new algorithm may classify as unreachable states that are reachable according to the previous algorithm because of the looser over-approximations introduced by the union operation. We implemented the new reachability algorithm and tested it successfully on a real-life case modeling a hybrid model of a controlled car engine.", "num_citations": "12\n", "authors": ["1640"]}
{"title": "Reasoning about connectivity without paths.\n", "abstract": " In graph theory connectivity is stated, prevailingly, in terms of paths. While exploiting a proof assistant to check formal reasoning about graphs, we chose to work with an alternative characterization of connectivity: for, within the framework of the underlying set theory, it requires virtually no preparatory notions. We say that a graphs devoid of isolated vertices is connected if no subset of its set of edges, other than the empty set and the set of all edges, is vertex disjoint from its complementary set. Before we can work with this notion smoothly, we must prove that every connected graph has a non-cut vertex, ie, a vertex whose removal does not disrupt connectivity. This paper presents such a proof in accurate formal terms and copes with hypergraphs to achieve greater generality.", "num_citations": "9\n", "authors": ["1640"]}
{"title": "Is hyper-extensionality preservable under deletions of graph elements?\n", "abstract": " Any hereditarily finite set S can be represented as a finite pointed graph –dubbed membership graph– whose nodes denote elements of the transitive closure of {S} and whose edges model the membership relation. Membership graphs must be hyper-extensional, that is pairwise distinct nodes are not bisimilar and (uniquely) represent hereditarily finite sets.We will see that the removal of even a single node or edge from a membership graph can cause “collapses” of different nodes and, therefore, the loss of hyper-extensionality of the graph itself. With the intent of gaining a deeper understanding on the class of hyper-extensional hereditarily finite sets, this paper investigates whether pointed hyper-extensional graphs always contain either a node or an edge whose removal does not disrupt the hyper-extensionality property.", "num_citations": "8\n", "authors": ["1640"]}
{"title": "Hybrid Automata and\\epsilon-Analysis on a Neural Oscillator\n", "abstract": " In this paper we propose a hybrid model of a neural oscillator, obtained by partially discretizing a well-known continuous model. Our construction points out that in this case the standard techniques, based on replacing sigmoids with step functions, is not satisfactory. Then, we study the hybrid model through both symbolic methods and approximation techniques. This last analysis, in particular, allows us to show the differences between the considered approximation approaches. Finally, we focus on approximations via epsilon-semantics, proving how these can be computed in practice.", "num_citations": "8\n", "authors": ["1640"]}
{"title": "Composing semi-algebraic o-minimal automata\n", "abstract": " This paper addresses questions regarding the decidability of hybrid automata that may be constructed hierarchically and in a modular way, as is the case in many exemplar systems, be it natural or engineered. Since an important step in such constructions is a product operation, which constructs a new product hybrid automaton by combining two simpler component hybrid automata, an essential property that would be desired is that the reachability property of the product hybrid automaton be decidable, provided that the component hybrid automata belong to a suitably restricted family of automata. Somewhat surprisingly, the product operation does not assure a closure of decidability for the reachability problem. Nonetheless, this paper establishes the decidability of the reachability condition over automata which are obtained by composing two semi-algebraic o-minimal systems. The class of semi-algebraic …", "num_citations": "8\n", "authors": ["1640"]}
{"title": "pyHybrid analysis: A package for semantics analysis of hybrid systems\n", "abstract": " Hybrid automata naturally represent systems that exhibit a mixed discrete-continuous behaviours. The undecidability of the reach ability problem over them constrains the chances of punctually investigating this kind of formalism. Established that this negative result and the presence of artifacts, which do not correspond to any observable phenomena, are mainly due to the density of the continuous domain, a class of finite precision semantics, named [epsilon]-semantics, has been proposed to analyze hybrid automata. This paper presents a Python package, pyHybrid Analysis, that both implements the [epsilon]-semantics framework and allows to analyze hybrid automata.", "num_citations": "7\n", "authors": ["1640"]}
{"title": "Hybrid systems: a first-order approach to verification and approximation techniques\n", "abstract": " Systems having a mixed discrete-continuous evolution are called hybrid systems. Since hybrid systems cannot be studied by either dynamical system techniques or finite state system approaches only, specific formal tools, hybrid automata, were introduced to model them. Intuitively, a hybrid automaton is a “finite-state” automaton with continuous variables which evolve according to a set of continuous laws. Such kind of automata has been widely used to demonstrate the validity of hybrid system properties and, even if it is proved that many simple verification problems, such as reachability, are not in general decidable over them, various model checking techniques have been proposed in literature. In this dissertation, we further investigate both the notion of hybrid automaton and the model checking problem over such structure. We relate first-order theories and analysis results on multi-valued maps and we reduce bounded reachability problem for hybrid automata whose continuous laws are expressed by inclusions to decidability problem for first-order formulæ over the reals. We introduce two classes of hybrid automata for which the reachability problem can be decided and we prove decidability of model checking for a CTLsub-logic over them. We suggest a new algorithm for computing approximations of the reached sets, based on a previous algorithm presented by Botchkarev. We present some theoretical results on termination for both algorithms and we prove that they have the same complexity. Finally, we introduce a new software package, called ARIADNE, for the verification of hybrid automaton properties and we show that, since it relies on …", "num_citations": "7\n", "authors": ["1640"]}
{"title": "Decidable compositions of o-minimal automata\n", "abstract": " We identify a new class of decidable hybrid automata: namely, parallel compositions of semi-algebraic o-minimal automata. The class we consider is fundamental to hierarchical modeling in many exemplar systems, both natural and engineered. Unfortunately, parallel composition, which is an atomic operator in such constructions, does not preserve the decidability of reachability. Luckily, this paper is able to show that when one focuses on the composition of semi-algebraic o-minimal automata, it is possible to translate the decidability problem into a satisfiability problem over formulæinvolving both real and integer variables. While in the general case such formulæ would be undecidable, the particular format of the formulæ obtained in our translation allows combining decidability results stemming from both algebraic number theory and first-order logic over (ℝ, 0, 1, + , *, < ) to yield a novel decidability …", "num_citations": "5\n", "authors": ["1640"]}
{"title": "Discreteness, hybrid automata, and biology\n", "abstract": " Most of the observable natural phenomena exhibit a mixed discrete-continuous behavior characterized by laws changing according to a phase cycle. Such behaviors can be modeled in a very natural way by a class of automata called hybrid automata. In this class the evolution of measurable quantities, such as concentrations, is represented according to both dynamical system evolutions - on dense domains - and rules phases through a discrete transition structure. Once the real systems are modeled in such a framework, one may want to analyze them by applying automatic techniques, such as model checking or abstract interpretation. Unfortunately, the interleaving of dense and discrete evolutions soon leads to undecidability results on hybrid automata. This paper addresses questions regarding the decidability of reachability problem for hybrid automata (i.e., ldquocan the systems reach a state a from a state b …", "num_citations": "5\n", "authors": ["1640"]}
{"title": "Tolque–A Tool for Algorithmic Algebraic Model Checking\n", "abstract": " Motivated by the need for scalable symbolic reasoning methodologies aimed at systems biology, as well as the novel opportunities made possible by powerful hybrid automata models of biochemical networks, we have embarked upon the Algorithmic Algebraic Model Checking (AAMC) project that combines symbolic computation with model checking to analyze biochemical systems. Briefly, AAMC aims to identify a decidable (ultimately, practical) component of a theory for systems biology by examining the connections between semi-algebraic hybrid automata, modal logic, computability and systems biology, starting with a characterization based on Semi-Algebraic Hybrid Automata [5]. Tolque is a continually evolving practical implementation of this emerging theoretical framework. In Semi-Algebraic Hybrid Automata, the continuous dynamics and discrete jump conditions are defined by first-order formulæ whose terms are polynomials over the reals. Consequently, they can exploit a series of real algebraic techniques, based on Tarski’s result on the decidability of real quantifier elimination, to study the possible evolutions of the system entirely symbolically. Beyond decidability of Timed Computation Tree Logic (TCTL)[4], we studied Semi-Algebraic Constant Reset Automata [2] and Independent Dynamics Automata [1] whose resets were constrained to be constant or identity.Tolque [4], a preliminary version of the algebraic dense-time model-checker for semi-algebraic hybrid automata, was implemented in C/C++. Inspired by the success over small examples and by the substantial theoretical progress since the prototypical implementation, in this …", "num_citations": "5\n", "authors": ["1640"]}
{"title": "PolyMorph: A P300 Polymorphic Speller\n", "abstract": " P300 is an electric signal emitted by brain about 300 milliseconds after a rare, but relevant-for-the-user event. Even if it is hard to identify and it provides a low-rate communication channel, it can be used in cases in which other evoked potentials fail. One of the applications of this signal is a speller that enables subjects who lost the control of their motor pathways to communicate by selecting one by one each character of a sentence in a matrix containing all the alphabet symbols. This paper provides an improvement of this paradigm and it aims at reducing both the error rate and the time required to spell a sentence by exploiting the redundancy which is present in all the natural languages.", "num_citations": "4\n", "authors": ["1640"]}
{"title": "Model checking on hybrid automata\n", "abstract": " Many systems, both natural and artificial, exhibit a mixed discrete-continuous behavior that cannot be fully captured by either continuous nor discrete models: they evolve in accordance to continuous laws, but these laws are controlled by a finite set of modes. Hybrid automata were proposed to represent such kind of behaviors and they have been used to model numerous natural phenomena in the last decades. Unfortunately, the Model Checking problem over them was proved undecidable and, because of that, many techniques were suggested so far to both approximate the original models and reduce the analysis complexity. This paper surveys some of such techniques and reports some open questions.", "num_citations": "4\n", "authors": ["1640"]}
{"title": "An effective pressure–flow characterization of respiratory asynchronies in mechanical ventilation\n", "abstract": " Ineffective effort during expiration (IEE) occurs when there is a mismatch between the demand of a mechanically ventilated patient and the support delivered by a Mechanical ventilator during the expiration. This work presents a pressure–flow characterization for respiratory asynchronies and validates a machine-learning method, based on the presented characterization, to identify IEEs. 1500 breaths produced by 8 mechanically-ventilated patients were considered: 500 of them were included into the training set and the remaining 1000 into the test set. Each of them was evaluated by 3 experts and classified as either normal, artefact, or containing inspiratory, expiratory, or cycling-off asynchronies. A software implementing the proposed method was trained by using the experts’ evaluations of the training set and used to identify IEEs in the test set. The outcomes were compared with a consensus of three expert …", "num_citations": "3\n", "authors": ["1640"]}
{"title": "ϵ-Semantics computations on biological systems\n", "abstract": " The assumption of being able to perform infinite precision measurements does not only lead to undecidability, but it also introduces artifacts in the mathematical models that do not correspond to observable behaviours of systems under study. When bounded spatial regions are involved, such issues can be avoided if arbitrarily small sets of points are not definable in the mathematical setting. ϵ-semantics were introduced in this spirit. In this paper we investigate the use of ϵ-semantics deeper, in the context of reachability analysis of hybrid automata. In particular, we focus on two ϵ-semantics and reason about their computability. We then try our approach on biological model analysis to give evidence about the effectiveness of the methodology.", "num_citations": "3\n", "authors": ["1640"]}
{"title": "Beyond kappa: an informational index for diagnostic agreement in dichotomous and multivalue ordered-categorical ratings\n", "abstract": " Agreement measures are useful tools to both compare different evaluations of the same diagnostic outcomes and validate new rating systems or devices. Cohen’s kappa (κ) certainly is the most popular agreement method between two raters, and proved its effectiveness in the last sixty years. In spite of that, this method suffers from some alleged issues, which have been highlighted since the 1970s; moreover, its value is strongly dependent on the prevalence of the disease in the considered sample. This work introduces a new agreement index, the informational agreement (IA), which seems to avoid some of Cohen’s kappa’s flaws, and separates the contribution of the prevalence from the nucleus of agreement. These goals are achieved by modelling the agreement—in both dichotomous and multivalue ordered-categorical cases—as the information shared between two raters through the virtual diagnostic channel connecting them: the …", "num_citations": "2\n", "authors": ["1640"]}
{"title": "PolyMorph: increasing P300 spelling efficiency by selection matrix polymorphism and sentence-based predictions\n", "abstract": " P300 is an electric signal emitted by brain about 300 milliseconds after a rare, but relevant-for-the-user event. One of the applications of this signal is sentence spelling that enables subjects who lost the control of their motor pathways to communicate by selecting characters in a matrix containing all the alphabet symbols. Although this technology has made considerable progress in the last years, it still suffers from both low communication rate and high error rate. This article presents a P300 speller, named PolyMorph, that introduces two major novelties in the field: the selection matrix polymorphism, that reduces the size of the selection matrix itself by removing useless symbols, and sentence-based predictions, that exploit all the spelt characters of a sentence to determine the probability of a word. In order to measure the effectiveness of the presented speller, we describe two sets of tests: the first one in vivo and the second one in silico. The results of these experiments suggest that the use of PolyMorph in place of the naive character-by-character speller both increases the number of spelt characters per time unit and reduces the error rate.", "num_citations": "2\n", "authors": ["1640"]}
{"title": "Approximated symbolic computations over hybrid automata\n", "abstract": " Hybrid automata are a natural framework for modeling and analyzing systems which exhibit a mixed discrete continuous behaviour. However, the standard operational semantics defined over such models implicitly assume perfect knowledge of the real systems and infinite precision measurements. Such assumptions are not only unrealistic, but often lead to the construction of misleading models. For these reasons we believe that it is necessary to introduce more flexible semantics able to manage with noise, partial information, and finite precision instruments. In particular, in this paper we integrate in a single framework based on approximated semantics different over and under-approximation techniques for hybrid automata. Our framework allows to both compare, mix, and generalize such techniques obtaining different approximated reachability algorithms.", "num_citations": "2\n", "authors": ["1640"]}
{"title": "Synchronized product of semialgebraic o-minimal hybrid automata\n", "abstract": " This paper addresses questions regarding the decidability of hybrid automata that may be constructed hierarchically and in a modular way, as is the case in many exemplar systems, be it natural or engineered. Since the basic fundamental step in such constructions is a product operation, which constructs a new product hybrid automaton by combining two simpler component hybrid automata, an essential property that would be desired is that the reachability property of the product hybrid automaton be decidable, provided that the component hybrid automata belong to a suitably restricted family of automata, for which the reachability property is provably decidable. Somewhat surprisingly, it does not appear that, under product operation, closure of decidability property for reachability condition could be guaranteed, in an arbitrarily general setting. Nonetheless, this paper establishes the decidability of the reachability condition over automata which are obtained by synchronizing two semialgebraic o-minimal systems. Such hybrid automata appear in systems biological modeling, and hence could be applied when one is interested in understanding a complex biological systems composed of smaller selforganizing systems.", "num_citations": "2\n", "authors": ["1640"]}
{"title": "A new algorithm for reachability analysis of hybrid automata\n", "abstract": " A new algorithm is presented for computing approximations of the reached sets of linear hybrid automata. First, we present some new theoretical results on termination of a class of reachability algorithms, which includes Botchkarev’s, based on ellipsoidal calculus. The main contribution of the paper is a revised reachability computation that avoids the approximations caused by the union operation in the discretized flow tube estimation. Therefore, the new algorithm may correctly classify as unreachable states that are reachable according to the previous algorithm because of the looser over-approximations introduced by the union operation. We implemented the new reachability algorithm and tested it successfully on a real-life case modeling a hybrid model of a controlled car engine.", "num_citations": "2\n", "authors": ["1640"]}
{"title": "Computing Information Agreement\n", "abstract": " Agreement measures are useful to both compare different evaluations of the same diagnostic outcomes and validate new rating systems or devices. Information Agreement (IA) is an information-theoretic-based agreement measure introduced to overcome all the limitations and alleged pitfalls of Cohen's Kappa. However, it is only able to deal with agreement matrices whose values are positive natural numbers. This work extends IA admitting also 0 as a possible value for the agreement matrix cells.", "num_citations": "1\n", "authors": ["1640"]}
{"title": "Unwinding biological systems\n", "abstract": " Unwinding conditions have been fruitfully exploited in Information Flow Security to define persistent security properties. In this paper we investigate their meaning and possible uses in the analysis of biological systems. In particular, we elaborate on the notion of robustness and propose some instances of unwinding over the process algebra Bio-PEPA and over hybrid automata. We exploit such instances to analyse two case-studies: Neurospora crassa circadian system and Influenza kinetics models.", "num_citations": "1\n", "authors": ["1640"]}
{"title": "External interactions on hybrid models of biological systems\n", "abstract": " We propose a general framework for the analysis of hybrid automata representing biological systems which interacts with an environment. Our framework is based on unwinding conditions and it aims at establishing which external interactions substantially change the system behaviours. We exploit our proposal for the analysis of influenza disease treatable with both antivirals and interferons.", "num_citations": "1\n", "authors": ["1640"]}
{"title": "SCOP family fingerprints: An information theoretic approach to structural classification of protein domains\n", "abstract": " Protein domain classification is a useful instrument to deduce functional properties of proteins. Several databases have been introduced that collect domains having a known structure, and SCOP is probably the most used one. It classifies domains in a four level hierarchy and it groups sequences according to both structural similarity and phylogenetic relation. Many automatic tools to classify domains according to available databases have been proposed so far. In this paper we introduce the notion of “fingerprint” as an easy and readable digest of the similarities between a sequence and an entire set of sequences, and this concept offers us a rationale for building an automatic SCOP classifier which assigns a query sequence to the most likely family. Fingerprint-based analysis has been implemented in a software tool and we report some experimental validations for it.", "num_citations": "1\n", "authors": ["1640"]}
{"title": "Hybrid automata and bisimulations\n", "abstract": " This paper surveys hybrid automata and bisimulation relations. We formally introduce both notions and briefly present the model checking problem over hybrid automata. We show how, in some cases, bisimulations can be used to quotient infinite state systems to finite ones and, hence, we reduce the model checking over hybrid automata to model checking over finite models. Finally, we review some classes of hybrid automata which admit finite bisimulation quotients.", "num_citations": "1\n", "authors": ["1640"]}
{"title": "The Importance of Being Bounded⋆\n", "abstract": " In this paper we introduce and study a new class of hybrid automata, Independent Dynamics Hybrid Automata (IDA). IDA automata are an extension of decidable o-minimal automata in which also identity resets are allowed. We define the conditions under which reachability is decidable over IDA automata. These conditions involve the satisfiability of first-order formulæ that limit the interval of time we need to consider to study reachability. In order to prove the decidability of reachability we mainly exploit the decidability of the first-order formulæ which define IDA automata. Then we introduce the subclass∞ IDA of IDA over which reachability is always decidable. An interesting subclass of∞ IDA is the class of IDA automata whose flows are non-constant polynomials.", "num_citations": "1\n", "authors": ["1640"]}
{"title": "Hybrid Automata and∈-Analysis on a Neural Oscillator\n", "abstract": " Hybrid Automata and -Analysis on a Neural Oscillator Page 1 Outline Hybrid Automata Techniques Neural Oscillator Conclusions Hybrid Automata and ∈-Analysis on a Neural Oscillator A. Casagrande1 T. Dreossi2 C. Piazza2 1DMG, University of Trieste, Italy 2DIMI, University of Udine, Italy Page 2 Outline Hybrid Automata Techniques Neural Oscillator Conclusions Intuitively. . . Motivations: • Reachability Analysis of Hybrid Automata with applications to Biological Models • Automatic analysis (. . . as much as possible) • Exploit existing “approximation” techniques • Avoid ad-hoc studies Case of study: • Neural oscillator • Rhythmic neural activity • Interaction between neurons Page 3 Outline Hybrid Automata Techniques Neural Oscillator Conclusions Intuitively. . . Saddle point Avoid ad-hoc studies Page 4 Outline Hybrid Automata Techniques Neural Oscillator Conclusions Outline 1 Hybrid Automata 2 “Approximation” …", "num_citations": "1\n", "authors": ["1640"]}
{"title": "Parallel composition of semi-algebraic o-minimal automata\n", "abstract": " This paper addresses questions regarding the decidability of hybrid automata that may be built hierarchically as is the case in many exemplar systems, be it natural or engineered. Parallel composition can be considered a fundamental tool in such costructions. Somewhat surprisingly, this operation does not always preseve the decidability of reachability problem ie, even if we prove the decidability of reachability over component automata, we cannot guarantee the decidability over their parallel composition. Despite the above consideration, this paper establishes the decidability of the reachability problem over parallel composition of semi-algebraic o-minimal automata by reducing it to a system of linear Diophantine disequations whose coefficients are semi-algebraic. The resulting hybrid automata appear in systems biological modeling, and hence could be applied when one is interested in understanding a complex biological system composed of smaller self-organizing systems.", "num_citations": "1\n", "authors": ["1640"]}