{"title": "System level design paradigms: Platform-based design and communication synthesis\n", "abstract": " Embedded system level design must be based on paradigms that make formal foundations and unification a cornerstone of their construction. Platform-Based designs and communication synthesis are important components of the paradigm shift we advocate. Communication synthesis is a fundamental productivity tool in a design methodology where reuse is enforced. Communication design in a reuse methodology starts with a set of functional requirements and constraints on the interaction among components and then proceeds to build protocols, topology, and physical implementations that satisfy requirements and constraints while optimizing appropriate measures of efficiency of the implementation. Maximum efficiency can be reached when the communication specifications are entered at high levels of abstraction and the design process optimizes the implementation from this specification. Unfortunately, this …", "num_citations": "61\n", "authors": ["700"]}
{"title": "Synthesis of embedded networks for building automation and control\n", "abstract": " We present a methodology and a software framework for the automatic design exploration of the communication network among sensors, actuators and controllers in building automation systems. Given 1) a set of end-to-end latency, throughput and packet error rate constraints between nodes, 2) the building geometry, and 3) a library of communication components together with their performance and cost characterization, a synthesis algorithm produces a network implementation that satisfies all end-to-end constraints and that is optimal with respect to installation and maintenance cost. The methodology is applied to the synthesis of wireless networks for an essential step in any control algorithm in a distributed environment: the estimation of control variables such as temperature and air-flow in buildings.", "num_citations": "47\n", "authors": ["700"]}
{"title": "Interchange format for hybrid systems: Abstract semantics\n", "abstract": " In [1] we advocated the need for an interchange format for hybrid systems that enables the integration of design tools coming from many different research communities. In deriving such interchange format the main challenge is to define a language that, while presenting a particular formal semantics, remains general enough to accommodate the translation across the various modeling approaches used in the existing tools. In this paper we give a formal definition of the syntax and semantics for the proposed interchange format. In doing so, we clearly separate the structure of a hybrid system from the semantics attached to it. The semantics can be considered an “abstract semantics” in the sense that it can be refined to yield the model of computation, or “concrete semantics”, which, in turn, is associated to the existing languages that are used to specify hybrid systems. We show how the interchange format can …", "num_citations": "47\n", "authors": ["700"]}
{"title": "Design system for managing complexity in aerospace systems\n", "abstract": " A new generation of aerospace systems has introduced more-electric technologies and highly coupled architectures, leading to a substantial increase in design complexity. The inability of current design systems to manage this complexity has lead to substantial cost and schedule overruns during the development of new military and commercial platforms. This paper presents the framework for a new design process to manage system complexity and highlights four key elements: 1) Abstraction-based design tools to allow complex interactions to be assessed at a high level of abstraction early in the design cycle; 2) Quantitative complexity metrics that can guide early design decisions and identify sources of complexity within candidate designs; 3) Advanced architecture synthesis methods that enable the formal and automated architecture synthesis, enumeration, and evaluation of feasible architecture options; and 4 …", "num_citations": "42\n", "authors": ["700"]}
{"title": "Strategic planning under uncertainties via constrained Markov decision processes\n", "abstract": " In this paper, we propose a hierarchical mission planner where the state of the world and of the mission are abstracted into corresponding states of a Markov Decision Process (MDP). Transitions in the MDP represent abstract motion actions that are planned by a lower level probabilistic planner. The cost structure of the MDP is multi-dimensional: each state-action pair is annotated with a vector of metrics such as time and resource requirements. A mission specification is divided into three parts: a temporal logic formula defined over state propositions, the choice of the primary cost, and constraints on the remaining secondary costs. The planning problem is formulated as finding the optimal policy of a Constrained Markov Decision Process with above mission specification. The resulting planning system is tested in a mission where an agent is tasked with a complex mission in a urban hostile environment.", "num_citations": "40\n", "authors": ["700"]}
{"title": "Interchange formats for hybrid systems: Review and proposal\n", "abstract": " Interchange formats have been the backbone of the EDA industry for several years. They are used as a way of helping the development of design flows that integrate foreign tools using formats with different syntax and, more importantly, different semantics. The need for integrating tools coming from different communities is even more severe for hybrid systems because of the relative immaturity of the field and the intrinsic difficulty of the mathematical underpinnings. In this paper, we provide a discussion about interchange formats for hybrid systems, we survey the approaches used by different tools for analysis (simulation and formal verification) and synthesis of hybrid systems, and we give a recommendation for an interchange format for hybrid systems based on the Metropolis metamodel. The proposed interchange format has rigorous semantics and can accommodate the translation to and from the formats …", "num_citations": "39\n", "authors": ["700"]}
{"title": "An overview of embedded system design education at Berkeley\n", "abstract": " Embedded systems have been a traditional area of strength in the research agenda of the University of California at Berkeley. In parallel to this effort, a pattern of graduate and undergraduate classes has emerged that is the result of a distillation process of the research results. In this paper, we present the considerations that are driving our curriculum development and we review our undergraduate and graduate program. In particular, we describe in detail a graduate class (EECS249: Design of Embedded Systems: Modeling, Validation and Synthesis) that has been taught for six years. A common feature of our education agenda is the search for fundamentals of embedded system science rather than embedded system design techniques, an approach that today is rather unique.", "num_citations": "37\n", "authors": ["700"]}
{"title": "Interconnect modeling for improved system-level design optimization\n", "abstract": " Accurate modeling of delay, power, and area of interconnections early in the design phase is crucial for effective system-level optimization. Models presently used in system-level optimizations, such as network-on-chip (NoC) synthesis, are inaccurate in the presence of deep-submicron effects. In this paper, we propose new, highly accurate models for delay and power in buffered interconnects; these models are usable by system-level designers for existing and future technologies. We present a general and transferable methodology to construct our models from a wide variety of reliable sources (Liberty, LEF/ITF, ITRS, PTM, etc.). The modeling infrastructure, and a number of characterized technologies, are available as open source. Our models comprehend key interconnect circuit and layout design styles, and a power-efficient buffering technique that overcomes unrealities of previous delay-driven buffering …", "num_citations": "32\n", "authors": ["700"]}
{"title": "Hierarchical multi-objective planning: From mission specifications to contingency management\n", "abstract": " We propose a hierarchical planning framework for mission planning and execution in uncertain and dynamic environments. We consider missions that involve motion planning in large, cluttered environments, trading off mission objectives while satisfying logical/spatial/temporal constraints. Our framework enables the decomposition of the planning problem across different layers, leveraging the difference in spatial and temporal scales of the mission objectives. We show that this framework facilitates contingency management under unanticipated events. Interaction between the various layers requires consistent model abstractions and common message semantics. To satisfy these requirements, we adopt a generic knowledge-based architecture that is independent from a specific application domain. We show a specific instance of our framework using a Constrained Markov Decision Process (CMDP) planner at the …", "num_citations": "29\n", "authors": ["700"]}
{"title": "COSI: A framework for the design of interconnection networks\n", "abstract": " This article presents a software framework for communication infrastructure synthesis of distributed systems, which is critical for overall system performance in communication-based design. Particular emphasis is given to on-chip interconnect synthesis of multicore designs.", "num_citations": "27\n", "authors": ["700"]}
{"title": "A methodology for constraint-driven synthesis of on-chip communications\n", "abstract": " We present a methodology and an optimization framework for the synthesis of on-chip communication through the assembly of components such as interfaces, routers, buses, and links, from a target library. Models for functionality, cost, and performance of each element are captured in the library together with their composition rules. We develop a mathematical framework to model communication at different levels of abstraction from the point-to-point input specification to the library elements and the final implementation.", "num_citations": "24\n", "authors": ["700"]}
{"title": "Metaphysics of Planning Domain Descriptions\n", "abstract": " Domain models for sequential decision making typically represent abstract versions of real-world systems. In practice, such representations are compact, easy to maintain, and affort faster solution times. Unfortunately, as we show in this paper, simple ways of abstracting solvable real-world problems may lead to models whose solutions are incorrect with respect to the real-world problem. There is some evidence that such limitations have restricted the applicability of SDM technology in the real world, as is apparent in the case of task and motion planning in robotics. We show that the situation can be ameliorated by a combination of increased expressive power---for example, allowing angelic nondeterminism in action effects---and new kinds of algorithmic approaches designed to produce correct solutions from initially incorrect or non-Markovian abstract models.", "num_citations": "22\n", "authors": ["700"]}
{"title": "A design flow for building automation and control systems\n", "abstract": " We propose a system-level design flow for building automation and control (BAC) systems. The input to the design flow is a high level description of the control algorithms given in a model-based environment such as Simulink. The input specification is translated into an intermediate format, and then automatically refined into a distributed implementation. Refinement includes optimal mapping of the functional specification on a set of computation and communication resources, and software synthesis, which generates code for each component in the mapped design while guaranteeing semantic equivalence with the original specification. Experiments with a temperature control system are presented to illustrate the flow.", "num_citations": "22\n", "authors": ["700"]}
{"title": "Embedded system education: a new paradigm for engineering schools?\n", "abstract": " Embedded systems are emerging as an essential component of modern electronic products. Embedded system design problems are posing challenges that involve entirely new skills for engineers. These skills are related to the combination of traditionally disjoint engineering disciplines. There is a shared concern that today's educational systems are not providing the appropriate foundations for embedded systems. We believe a new education paradigm is needed.We will argue this point using the example of an emerging curriculum on embedded systems at the University of California at Berkeley. This curriculum is the result of a distillation process of more than ten years of intense research work. We will present the considerations that are driving the curriculum development and we review our undergraduate and graduate program. In particular, we describe in detail a graduate class (EECS249: Design of …", "num_citations": "22\n", "authors": ["700"]}
{"title": "Platform-based design and frameworks: METROPOLIS and METRO II\n", "abstract": " System-level design (SLD) means many different things to many different people. In our view, SLD is about the design of a whole that consists of several components where specifications are given in terms of functionality along with", "num_citations": "21\n", "authors": ["700"]}
{"title": "Correct-by-construction design of aircraft electric power systems\n", "abstract": " We provide an optimization oriented formalization of correct-by-construction design following the principles of Platform-Based Design. i The design proceeds by refinement steps. At each step, a specification is given in terms of requirements to be satisfied by an implementation. The implementation choices are implicitly captured by a set of components, their properties, and their composition rules. A class of candidate implementations of the specification is derived by formulating and solving an optimization problem. The implementation becomes the specification for the next step in the design flow. We show how the optimization oriented formalization enables design space exploration, and we present the trade-offs involved in the selection of the refinement steps. We show how the methodology can be applied to the design of electric power systems by decomposing the design flow into the following steps: generator …", "num_citations": "20\n", "authors": ["700"]}
{"title": "Explaining AI decisions using efficient methods for learning sparse Boolean formulae\n", "abstract": " In this paper, we consider the problem of learning Boolean formulae from examples obtained by actively querying an oracle that can label these examples as either positive or negative. This problem has received attention in both machine learning as well as formal methods communities, and it has been shown to have exponential worst-case complexity in the general case as well as for many restrictions. In this paper, we focus on learning sparse Boolean formulae which depend on only a small (but unknown) subset of the overall vocabulary of atomic propositions. We propose two algorithms—first, based on binary search in the Hamming space, and the second, based on random walk on the Boolean hypercube, to learn these sparse Boolean formulae with a given confidence. This assumption of sparsity is motivated by the problem of mining explanations for decisions made by artificially intelligent (AI …", "num_citations": "18\n", "authors": ["700"]}
{"title": "Metropolis: A design environment for heterogeneous systems\n", "abstract": " Publisher SummaryThis chapter presents the Metropolis design environment for the design of complex electronic systems. It is based on a metamodel with formal semantics, which can be used to capture designs directly or import them from other specification languages. It also supports simulation, formal analysis, and synthesis tools. The framework is conceived to encompass different application domains. Each application domain needs different models, tools, and flows. Metropolis captures heterogeneous system designs in a unified semantic model. Heterogeneity is supported at the utmost level in Metropolis to allow this kind of customization. The formal semantics of the metamodel permits embedding of models of computation in a rigorous framework, thus favoring design reuse and design chain support. The features of the system facilitate the designers with different knowledge domains. The chapter also uses a …", "num_citations": "18\n", "authors": ["700"]}
{"title": "On learning sparse Boolean formulae for explaining AI decisions\n", "abstract": " In this paper, we consider the problem of learning Boolean formulae from examples obtained by actively querying an oracle that can label these examplesz as either positive or negative. This problem has received attention in both machine learning as well as formal methods communities, and it has been shown to have exponential worst-case complexity in the general case as well as for many restrictions. In this paper, we focus on learning sparse Boolean formulae which depend on only a small (but unknown) subset of the overall vocabulary of atomic propositions. We propose an efficient algorithm to learn these sparse Boolean formulae with a given confidence. This assumption of sparsity is motivated by the problem of mining explanations for decisions made by artificially intelligent (AI) algorithms, where the explanation of individual decisions may depend on a small but unknown subset of all the inputs to …", "num_citations": "17\n", "authors": ["700"]}
{"title": "Scalable approach to uncertainty quantification and robust design of interconnected dynamical systems\n", "abstract": " Development of robust dynamical systems and networks such as autonomous aircraft systems capable of accomplishing complex missions faces challenges due to the dynamically evolving uncertainties coming from model uncertainties, necessity to operate in a hostile cluttered urban environment, and the distributed and dynamic nature of the communication and computation resources. Model-based robust design is difficult because of the complexity of the hybrid dynamic models including continuous vehicle dynamics, the discrete models of computations and communications, and the size of the problem. We will overview recent advances in methodology and tools to model, analyze, and design robust autonomous aerospace systems operating in uncertain environment, with stress on efficient uncertainty quantification and robust design using the case studies of the mission including model-based target tracking …", "num_citations": "17\n", "authors": ["700"]}
{"title": "A communication synthesis infrastructure for heterogeneous networked control systems and its application to building automation and control\n", "abstract": " In networked control systems the controller of a physically-distributed plant is implemented as a collection of tightly-interacting, concurrent processes running on a distributed execution platform. The execution platform consists of a set of heterogeneous components (sensors, actuators, and controllers) that interact through a hierarchical communication network. We propose a methodology and a framework for design exploration and automatic synthesis of the communication network. We present how our approach can be applied to the design of control systems for intelligent buildings. The input specification of the control system includes (i) the constraints on the location of its components, which are imposed by the plant,(ii) the communication requirements among the components, and (iii) an estimation of the real-time constraints for the correct behavior of the algorithms implementing the control law. The output …", "num_citations": "17\n", "authors": ["700"]}
{"title": "Accurate predictive interconnect modeling for system-level design\n", "abstract": " We propose new accurate predictive models for the delay, power, and area of buffered interconnects to enable a more effective system-level design exploration with existing and future nanometer technology processes. We show that our models are significantly more accurate than previous models - essentially matching sign-off analyses. We integrate our models in the COSI-OCC communication synthesis infrastructure and show how they impact the feasibility and optimality of the network-on-chip architectures that are synthesized by this tool.", "num_citations": "16\n", "authors": ["700"]}
{"title": "Synthesis of distributed execution platforms for cyber-physical systems with applications to high-performance buildings\n", "abstract": " We propose a methodology, and its embodiment into a design flow, to realize execution platforms for high-performance building applications. This is an example of a class of cyber-physical systems where a network of sensors, controllers, and actuators must be designed under physical spatial constraints to implement various types of signal processing and control tasks. In our approach, the applications are specified using the dataflow model of computation while the building dictates the physical constraints, including the position of sensors and actuators. We present a rigorous formulation of the design-space exploration problem and we propose to solve it by progressing through a sequence of refinement steps from specification to detailed implementation. Two key steps are the synthesis of the computation platform and the synthesis of the communication network. Combined, they allow us to automatically derive an …", "num_citations": "15\n", "authors": ["700"]}
{"title": "Meta II complex systems design and analysis (CODA)\n", "abstract": " Research conducted under this task is aimed at compressing product development and deployment time by enabling the foundry-style model of design and manufacturing of complex, heterogeneous, and physically-coupled cyber-electromechanical systems in aerospace and defense. The main concept is to create a meta-representation of a system capable of capturing the detailed system design at varying levels of functional and logical abstraction the system should be designed and verified entirely independent of its physical manifestation while at the same time considering design for manufacturability. The UTRC META II project is divided into 4 major tasks Design Flow, Manufacturing ModelingIntegration, Architecture Enumeration Analysis, and ComplexityAdaptability Measures in Design.Descriptors:", "num_citations": "12\n", "authors": ["700"]}
{"title": "A formal approach to system level design: Metamodels and unified design environments\n", "abstract": " The debate about efficient methods for hardware-software co-design has taken interesting turns over the years. In this paper, we argue that the essential problems to solve are prior to the decision on how to partition the system in hardware-software. We present a formal platform-based design method we have proposed over the years and a design environment, Metropolis, supporting the methodology, which starts by capturing the design specifications at the highest level of abstraction and then proceed toward an efficient implementation by subsequent refinement steps. We present the modeling strategy used in Metropolis based on formal semantics that is general enough to support the models of computation proposed so far and that facilitates the creation of new ones. Nonfunctional and declarative constraints can also be captured using a logic language.", "num_citations": "11\n", "authors": ["700"]}
{"title": "On-time network on-chip: Analysis and architecture\n", "abstract": " Game, multimedia, consumer and control applications today often demand high performance computing platforms that are able to deliver real-time services while satisfying tight power constraints. Multi-core architectures, supported by onchip networks, are emerging as scalable solutions to fulfill these requirements. However, the increasing number of concurrent applications running on these platforms and the time-varying nature of the communication requirements give rise to communication delays that are difficult to predict. We propose a simple and flexible instrumentation of the onchip network that provides services to the application software for establishing end-to-end communication flows with timing guarantees. We provide a detailed analysis of the delay in a NoC using worm-hole flow control and an algorithm that, given the state of the NoC and a request to route a new real-time flow, establishes a suitable path for the route, if one exists, or rejects the request. We implemented the new protocol in a cycleaccurate simulator to validate the accuracy of the models and the correctness of the path establishment algorithm.", "num_citations": "10\n", "authors": ["700"]}
{"title": "A complexity metric for concurrent finite state machine based embedded software\n", "abstract": " The development cost of safety-critical embedded systems is dominated today by the cost of software including verification and validation. This cost is typically related to the complexity of the software functions implementing the desired system behavior in nominal and off-nominal conditions. A widely used measure of complexity is the cyclomatic number, which is computed on the implementation code. However this technique is not effective when model-based development and code generation are used because the complexity of the software also depends on the communication and execution semantics of the models. This paper proposes a model-based complexity number that is defined on the decision diagram (DD) representation of the system functionality. The proposed complexity number gives an upper bound on the number of tests that are necessary to achieve Condition/Decision (C/D) coverage (which is …", "num_citations": "9\n", "authors": ["700"]}
{"title": "CSL4P: A Contract Specification Language for Platforms\n", "abstract": " The contract‐based design formalism supports compositional design and verification, and generalizes many other languages where components are defined in terms of their assumptions and guarantees. Most languages and tools for contract‐based design provide constructs to define, instantiate, and connect contracts, but fall short in capturing families of potential architectures in a flexible way. This article presents a Contract‐Based Specification Language for Platforms (CSL4P). A platform comprises a set of contract types and a set of constraints called rules. Contract types can be instantiated and connected to form platform instances. While the meaning of composition is predefined in most languages, composition rules are used in CSL4P to provide a finer control on the semantics of interconnections. In addition, the separation of contract types from rules allows users of CSL4P to define different platforms out of …", "num_citations": "7\n", "authors": ["700"]}
{"title": "Correct-by-construction and optimal synthesis of beacon-enabled ZigBee network\n", "abstract": " In this paper we develop a formal approach for the synthesis of a cost-effective and correct-by-construction communication network (focusing on ZigBee wireless networks) subject to a set of end-to-end communication constraints of latency, bandwidth and error-rate, together with the constraints of the network protocols and the desired geographical placement of the network. We also develop a software platform to implement the proposed approach for network synthesis, and apply it to a practical wireless network synthesis for centralized as well as distributed estimation application.", "num_citations": "7\n", "authors": ["700"]}
{"title": "A platform-based approach to communication synthesis for embedded systems\n", "abstract": " As the complexity of electronic systems increases, designers adopt a re-use methodology where new products are assembled out of components. This is a common trend in many application domains. In consumer electronics, Systems-on-Chips (SoCs) integrate many different cores to provide tens of different functions. In automotive, modern cars rely on a distributed, networked embedded system that comprises hundreds of processors to provide comfort, fuel efficiency and entertainment. In large scale systems, such as avionics and building automation, networked distributed controllers are used to provide comfort, safety and energy efficiency.", "num_citations": "7\n", "authors": ["700"]}
{"title": "Interchange semantics for hybrid system models\n", "abstract": " • I⊆ N is a set of indexes,• σ: 2 R (V)→ 2I is a function that associates a set of indexes to each domain• ω: I→ 2 E is a function that associates a set of equations to each index,• ρ: 2 R (V)× 2 R (V)× R (V)→ 2 R (V) is a function to reset the values of the variables.", "num_citations": "6\n", "authors": ["700"]}
{"title": "A hierarchical wireless network architecture for building automation and control systems\n", "abstract": " The building automation industry is experiencing a sudden increase in the complexity of control systems, mainly due to the push towards energy efficient buildings. These systems are necessarily distributed and rely on a communication network to gather data from sensors, produce intermediate results, and send commands to actuators. These networks should be cost effective, and should be flexible enough to be easily reconfigured if the building usage changes over the years. Wireless sensor and actuator networks are, therefore, key enablers. In this paper, we propose a hierarchical wireless network architecture for building automation and control systems and a protocol to manage it. We implement gradient based routing (for collecting data) and label switching table (for disseminating configuration commands), thereby supporting upstream and downstream data flows across the network.", "num_citations": "5\n", "authors": ["700"]}
{"title": "Developing design tools for uncertain systems in an industrial setting\n", "abstract": " We motivate the need for a cyber-physical system analysis and design tool that embraces uncertainty as key characteristic of these type of systems. We outline the features that such tool should provide and we present a prototype implementation. The challenges faced during its development go beyond the sheer complexity of analyzing large Markov Models. We close the paper with some examples of analysis of uncertain systems.", "num_citations": "3\n", "authors": ["700"]}
{"title": "Synthesis of wireless time-triggered embedded networks for networked control systems\n", "abstract": " In this paper, we extend our previous work by including the decisions for connection-scheduling as part of the automated synthesis of embedded networks for networked control systems. We propose an automated approach for the synthesis of a cost-effective and correct-by-construction communication network for embedded applications subject to a set of end-to-end communication constraints of latency, bandwidth, and error-rate, the geometry constraints arising due to a desired geographical placement of the network, and a set of scheduling constraints. We also apply the proposed approach for network synthesis with scheduling to the synthesis of wireless networks for centralized and distributed state estimation in building automation and control. The proposed approach is general enough to be applicable to wired and wireless network synthesis.", "num_citations": "3\n", "authors": ["700"]}
{"title": "An ROS-based Shared Communication Middleware for Plug & Play Modular Intelligent Design of Smart Systems\n", "abstract": " Centralized architectures for systems such as smart offices and homes are rapidly becoming obsolete due to inherent inflexibility in their design and management. This is because such systems should not only be easily re-configurable with the addition of newer capabilities over time but should also have the ability to adapt to multiple points of failure. Fully harnessing the capabilities of these massively integrated systems requires higher level reasoning engines that allow them to plan for and achieve diverse long-term goals, rather than being limited to a few predefined tasks. In this paper, we propose a set of properties that will accommodate such capabilities, and develop a general architecture for integrating automated planning components into smart systems. We show how the reasoning capabilities are embedded in the design and operation of the system and demonstrate the same on a real-world implementation of a smart office.", "num_citations": "2\n", "authors": ["700"]}
{"title": "Optimal design of a class of hybrid systems with uncertain parameters\n", "abstract": " Many modern engineering systems can be mathematically modeled as hybrid systems. For many such systems, there may be uncertain parameters and also parameters that can be adjusted so that the system achieves some optimal performance. It is important to develop efficient numerical tools and software to optimize for these adjustable parameters. We focus on a specific class of hybrid systems where mode transitions are dependent only on the amount of time spent in a mode (or equivalently a clock value). The amount of time spent in each mode is assumed to be a random variable with a known distribution. We aim to design or choose values for the free parameters in each mode of the hybrid system so that the expected value of some meaningful cost-function is minimized. This can be framed as a stochastic optimization problem. We use the sample average approximation method to solve the resulting …", "num_citations": "2\n", "authors": ["700"]}
{"title": "Outage-based rate maximization in cdma wireless networks\n", "abstract": " The problem of maximizing the sum of the transmit rates while limiting the outage probability below an appropriate threshold is investigated for networks where the nodes have limited processing capabilities. We focus on CDMA wireless network whose rates are characterized under mixed Rayleigh- lognormal fading. The outage probability is given implicitly by a complex function so that solving the optimization problem requires substantial computing. In this paper, we propose a novel explicit approximation of this function that allows solving the problem in an affordable manner. We propose two solutions of the maximization problem with the simplified outage probability constraint: one solves the problem using mixed integer-real programming. The other relaxes the constraints that rates be integers yielding a standard convex programming optimization that can be solved much faster. Numerical results show that our …", "num_citations": "2\n", "authors": ["700"]}
{"title": "An Open and Modular Architecture for Autonomous and Intelligent Systems\n", "abstract": " Over the past few decades, remarkable progress has been made in the the field of Artificial Intelligence (AI). For some tasks such as games, natural language processing, and image classification, AI powered applications can match or surpass human performance. Despite this progress, truly Autonomous and Intelligent Systems (AIS) serving the needs of, and sharing the environment with humans, are yet to become a commercial reality. AIS engineering requires considerable integration efforts that must be disciplined and guided by a reference model enabling reuse and concurrent design: an open and modular architecture. While several specialized architectures have been developed over the course of few decades, there is a need for a unified approach that supports multi-agency, learning, knowledge representation, reasoning, planning, and run-time verification. In this paper, we propose an open and modular …", "num_citations": "1\n", "authors": ["700"]}
{"title": "Stochastic analysis and design of systems\n", "abstract": " Analysis and design methods for stochastic hybrid dynamical systems are presented. Analysis methods include reachability analysis as well as statistical approaches. System refinement and decomposition are explored as possible approaches to deal with complexity. Findings show that analysis of this class of systems is not scalable. A promising approach is demonstrated which relies on the automatic construction of decentralized control systems using desirable properties as constraints. The synthesized system does not require to be analyzed thereby cutting the analysis effort. This approach is promising but for now limited in its use.Descriptors:", "num_citations": "1\n", "authors": ["700"]}
{"title": "A model-based end-to-end toolchain for the probabilistic analysis of complex systems\n", "abstract": " We present a model-based environment for the probabilistic analysis of systems operating under uncertain conditions. This uncertainty may result from either the environments in which they operate or the platforms on which they execute. Available probabilistic analysis methods require to capture the system specification using languages that are semantically very close to Markov Chains. However, designers use model-based environments working at much higher abstraction levels. We present an integrated tool, called StoNES (Stochastic analysis of Networked Embedded Systems), that automates the model transformation and probabilistic analysis of systems. We apply our translation and analysis methodology to explore the trade-off between sensor accuracy and computational speed for the vision algorithm of an autonomous helicopter system.", "num_citations": "1\n", "authors": ["700"]}
{"title": "Markov modeling of stochastic hybrid systems\n", "abstract": " Hybrid systems are a useful abstraction for systems that have a combination of discrete and continuous dynamics. For typical examples of hybrid systems, there can be various sources of stochasticity. The source of stochasticity can be in the dynamics of the continuous states, the probabilistic switching between various modes of the system and the probabilistic resetting of the continuous state after switches. Such systems can be mathematically modeled by Discrete Time Stochastic Hybrid Systems (DTSHS). If the uncertainty in the initial condition of the stochastic hybrid system is specified by a probability distribution, it is useful to compute the probability distribution of the state of the system for some time in the future. This would allow one to quantify the probability of the system to be in an undesired or unsafe set. Such computations can be useful for probabilistic verification and validation of systems. In this paper, we …", "num_citations": "1\n", "authors": ["700"]}
{"title": "A case study in distributed deployment of embedded software for camera networks\n", "abstract": " We present an embedded software application for the real-time estimation of building occupancy using a network of video cameras. We analyze a series of alternative decompositions of the main application tasks and profile each of them by running the corresponding embedded software on three different processors. Based on the profiling measures, we build various alternative embedded platforms by combining different embedded processors, memory modules and network interfaces. In particular, we consider the choice of two possible network technologies: ARCnet and Ethernet. After deriving an analytical model of the network costs, we use it to complete an exploration of the design space as we scale the number of video cameras in an hypothetical building. We compare our results with those obtained for two real buildings of different characteristics. We conclude discussing the results of our case study in the …", "num_citations": "1\n", "authors": ["700"]}