{"title": "Probabilistic reachability and safety for controlled discrete time stochastic hybrid systems\n", "abstract": " In this work, probabilistic reachability over a finite horizon is investigated for a class of discrete time stochastic hybrid systems with control inputs. A suitable embedding of the reachability problem in a stochastic control framework reveals that it is amenable to two complementary interpretations, leading to dual algorithms for reachability computations. In particular, the set of initial conditions providing a certain probabilistic guarantee that the system will keep evolving within a desired ‘safe’ region of the state space is characterized in terms of a value function, and ‘maximally safe’ Markov policies are determined via dynamic programming. These results are of interest not only for safety analysis and design, but also for solving those regulation and stabilization problems that can be reinterpreted as safety problems. The temperature regulation problem presented in the paper as a case study is one such case.", "num_citations": "391\n", "authors": ["1810"]}
{"title": "On efficient sensor scheduling for linear dynamical systems\n", "abstract": " Consider a set of sensors estimating the state of a process in which only one of these sensors can operate at each time-step due to constraints on the overall system. The problem addressed here is to choose which sensor should operate at each time-step to minimize a weighted function of the error covariances of the state estimates. This work investigates the development of tractable algorithms to solve for the optimal and suboptimal sensor schedules. A condition on the non-optimality of an initialization of the schedule is developed. Using this condition, both an optimal and a suboptimal algorithm are devised to prune the search tree of all possible sensor schedules. The suboptimal algorithm trades off the quality of the solution and the complexity of the problem through a tuning parameter. The performance of the suboptimal algorithm is also investigated and an analytical error bound is provided. Numerical …", "num_citations": "134\n", "authors": ["1810"]}
{"title": "Exponential stabilization of discrete-time switched linear systems\n", "abstract": " This article studies the exponential stabilization problem for discrete-time switched linear systems based on a control-Lyapunov function approach. It is proved that a switched linear system is exponentially stabilizable if and only if there exists a piecewise quadratic control-Lyapunov function. Such a converse control-Lyapunov function theorem justifies many of the earlier synthesis methods that have adopted piecewise quadratic Lyapunov functions for convenience or heuristic reasons. In addition, it is also proved that if a switched linear system is exponentially stabilizable, then it must be stabilizable by a stationary suboptimal policy of a related switched linear-quadratic regulator (LQR) problem. Motivated by some recent results of the switched LQR problem, an efficient algorithm is proposed, which is guaranteed to yield a control-Lyapunov function and a stabilizing policy whenever the system is exponentially …", "num_citations": "131\n", "authors": ["1810"]}
{"title": "Adaptive and sequential gridding procedures for the abstraction and verification of stochastic processes\n", "abstract": " This work is concerned with the generation of finite abstractions of general state-space processes                     to be employed in the formal verification of probabilistic properties by means of automatic techniques such as probabilistic model checkers.                     The work employs an abstraction procedure based on the partitioning of the state-space,                     which generates a Markov chain as an approximation of the original process.                     A novel adaptive and sequential gridding algorithm is presented and is expected to conform                     to the underlying dynamics of the model and thus to mitigate the curse of dimensionality unavoidably related to the partitioning procedure.                     The results are also extended to the general modeling framework known as stochastic hybrid systems.                     While the technique is applicable to a wide arena of probabilistic properties,                     with focus on the …", "num_citations": "112\n", "authors": ["1810"]}
{"title": "On the value functions of the discrete-time switched LQR problem\n", "abstract": " In this paper, we derive some important properties for the finite-horizon and the infinite-horizon value functions associated with the discrete-time switched LQR (DSLQR) problem. It is proved that any finite-horizon value function of the DSLQR problem is the pointwise minimum of a finite number of quadratic functions that can be obtained recursively using the so-called  switched Riccati mapping . It is also shown that under some mild conditions, the family of the finite-horizon value functions is homogeneous (of degree 2), is uniformly bounded over the unit ball, and converges exponentially fast to the infinite-horizon value function. The exponential convergence rate of the value iterations is characterized analytically in terms of the subsystem matrices.", "num_citations": "99\n", "authors": ["1810"]}
{"title": "Modeling options for demand side participation of thermostatically controlled loads\n", "abstract": " Residential thermostatically controlled loads (TCLs) have potential for participation in electricity markets. This is because we can control a large group of these loads to achieve aggregate system behavior such as providing frequency reserves while ensuring the control actions are non-disruptive to the end users. A main challenge in controlling aggregations of TCLs is developing dynamical system models that are simple enough for optimization and control, but rich enough to capture the behavior of the loads. In this work, we propose three classes of models that approximate aggregate TCL dynamics. We analyze these models in terms of their accuracy and computational tractability. The models demonstrate a progression from models that help us analyze and predict TCL population behavior to those that help us develop large-scale automatic control strategies. Specifically, we demonstrate how formal methods from …", "num_citations": "92\n", "authors": ["1810"]}
{"title": "F A U ST: Formal Abstractions of Uncountable- STate STochastic Processes\n", "abstract": " FAUST                    is a software tool that generates formal abstractions of (possibly non-deterministic) discrete-time Markov processes (dtMP) defined over uncountable (continuous) state spaces. A dtMP model is specified in MATLAB and abstracted as a finite-state Markov chain or a Markov decision process. The abstraction procedure runs in MATLAB and employs parallel computations and fast manipulations based on vector calculus, which allows scaling beyond state-of-the-art alternatives. The abstract model is formally put in relationship with the concrete dtMP via a user-defined maximum threshold on the approximation error introduced by the abstraction procedure. FAUST                    allows exporting the abstract model to well-known probabilistic model checkers, such as PRISM or MRMC. Alternatively, it can handle internally the computation of PCTL properties (e.g. safety or reach-avoid …", "num_citations": "91\n", "authors": ["1810"]}
{"title": "Aggregation and control of populations of thermostatically controlled loads by formal abstractions\n", "abstract": " This paper discusses a two-step procedure, based on the use of formal abstractions, to generate a finite-space stochastic dynamical model as an aggregation of the continuous temperature dynamics of a homogeneous population of thermostatically controlled loads (TCLs). The temperature of a TCL is described by a stochastic difference equation and the TCL status (ON, OFF) by a deterministic switching mechanism. The procedure is deemed to be formal, as it allows the quantification of the error introduced by the abstraction. As such, it builds and improves on a known, earlier approximation technique used in the literature. Furthermore, the contribution discusses the extension to the instance of heterogeneous populations of TCLs by means of two approaches. It moreover investigates the problem of global (population-level) power reference tracking and load balancing for TCLs that are explicitly dependent on a …", "num_citations": "88\n", "authors": ["1810"]}
{"title": "Computational approaches to reachability analysis of stochastic hybrid systems\n", "abstract": " This work investigates some of the computational issues involved in the solution of probabilistic reachability problems for discrete-time, controlled stochastic hybrid systems. It is first argued that, under rather weak continuity assumptions on the stochastic kernels that characterize the dynamics of the system, the numerical solution of a discretized version of the probabilistic reachability problem is guaranteed to converge to the optimal one, as the discretization level decreases. With reference to a benchmark problem, it is then discussed how some of the structural properties of the hybrid system under study can be exploited to solve the probabilistic reachability problem more efficiently. Possible techniques that can increase the scale-up potential of the proposed numerical approximation scheme are suggested.", "num_citations": "85\n", "authors": ["1810"]}
{"title": "Sufficient conditions for the existence of Zeno behavior\n", "abstract": " In this paper, sufficient conditions for the existence of Zeno behavior in a class of hybrid systems are given; these are the first sufficient conditions on Zeno of which the authors are aware for hybrid systems with nontrivial dynamics. This is achieved by considering a class of hybrid systems termed diagonal first quadrant (DFQ) hybrid systems. When the underlying graph of a DFQ hybrid system has a cycle, we can construct an in finite execution for this system when the vector fields on each domain satisfy certain assumptions. To this execution, we can associate a single discrete time dynamical system that describes its continuous evolution. Therefore, we reduce the study of executions of DFQ hybrid systems to the study of a single discrete time dynamical system. We obtain sufficient conditions for the existence of Zeno by determining when this discrete time dynamical system is exponentially stable.", "num_citations": "82\n", "authors": ["1810"]}
{"title": "Infinite-horizon switched LQR problems in discrete time: A suboptimal algorithm with performance analysis\n", "abstract": " This paper studies the quadratic regulation problem for discrete-time switched linear systems (DSLQR problem) on an infinite time horizon. A general relaxation framework is developed to simplify the computation of the value iterations. Based on this framework, an efficient algorithm is developed to solve the infinite-horizon DSLQR problem with guaranteed closed-loop stability and suboptimal performance. Due to these guarantees, the proposed algorithm can be used as a general controller synthesis tool for switched linear systems.", "num_citations": "77\n", "authors": ["1810"]}
{"title": "Approximate abstractions of stochastic hybrid systems\n", "abstract": " We present a constructive procedure for obtaining a finite approximate abstraction of a discrete-time stochastic hybrid system. The procedure consists of a partition of the state space of the system and depends on a controllable parameter. Given proper continuity assumptions on the model, the approximation errors introduced by the abstraction procedure are explicitly computed and it is shown that they can be tuned through the parameter of the partition. The abstraction is interpreted as a Markov set-Chain. We show that the enforcement of certain ergodic properties on the stochastic hybrid model implies the existence of a finite abstraction with finite error in time over the concrete model, and allows introducing a finite-time algorithm that computes the abstraction.", "num_citations": "72\n", "authors": ["1810"]}
{"title": "Symbolic models for stochastic switched systems: A discretization and a discretization-free approach\n", "abstract": " Stochastic switched systems are a relevant class of stochastic hybrid systems with probabilistic evolution over a continuous domain and control-dependent discrete dynamics over a finite set of modes. In the past few years several different techniques have been developed to assist in the stability analysis of stochastic switched systems. However, more complex and challenging objectives related to the verification of and the controller synthesis for logic specifications have not been formally investigated for this class of systems as of yet. With logic specifications we mean properties expressed as formulae in linear temporal logic or as automata on infinite strings. This paper addresses these complex objectives by constructively deriving approximately equivalent (bisimilar) symbolic models of stochastic switched systems. More precisely, this paper provides two different symbolic abstraction techniques: one requires state …", "num_citations": "70\n", "authors": ["1810"]}
{"title": "On the optimal solutions of the infinite-horizon linear sensor scheduling problem\n", "abstract": " This paper studies the infinite-horizon sensor scheduling problem for linear Gaussian processes with linear measurement functions. Several important properties of the optimal infinite-horizon schedules are derived. In particular, it is proved that under some mild conditions, both the optimal infinite-horizon average-per-stage cost and the corresponding optimal sensor schedules are independent of the covariance matrix of the initial state. It is also proved that the optimal estimation cost can be approximated arbitrarily closely by a periodic schedule with a finite period. Moreover, it is shown that the sequence of the average-per-stage costs of the optimal schedule must converge. These theoretical results provide valuable insights into the design and analysis of various infinite-horizon sensor scheduling algorithms.", "num_citations": "70\n", "authors": ["1810"]}
{"title": "Cell packing influences planar cell polarity signaling\n", "abstract": " Some epithelial cells display asymmetry along an axis orthogonal to the apical-basal axis, referred to as planar cell polarity (PCP). A Frizzled-mediated feedback loop coordinates PCP between neighboring cells, and the cadherin Fat transduces a global directional cue that orients PCP with respect to the tissue axes. The feedback loop can propagate polarity across clones of cells that lack the global directional signal, although this polarity propagation is error prone. Here, we show that, in the Drosophila wing, a combination of cell geometry and nonautonomous signaling at clone boundaries determines the correct or incorrect polarity propagation in clones that lack Fat mediated global directional information. Pattern elements, such as veins, and sporadic occurrences of irregular geometry are obstacles to polarity propagation. Hence, in the wild type, broad distribution of the global directional cue combines with a …", "num_citations": "68\n", "authors": ["1810"]}
{"title": "Reachability analysis for controlled discrete time stochastic hybrid systems\n", "abstract": " A model for discrete time stochastic hybrid systems whose evolution can be influenced by some control input is proposed in this paper. With reference to the introduced class of systems, a methodology for probabilistic reachability analysis is developed that is relevant to safety verification. This methodology is based on the interpretation of the safety verification problem as an optimal control problem for a certain controlled Markov process. In particular, this allows to characterize through some optimal cost function the set of initial conditions for the system such that safety is guaranteed with sufficiently high probability. The proposed methodology is applied to the problem of regulating the average temperature in a room by a thermostat controlling a heater.", "num_citations": "62\n", "authors": ["1810"]}
{"title": "Quantitative automata-based controller synthesis for non-autonomous stochastic hybrid systems\n", "abstract": " This work deals with Markov processes that are defined over an uncountable state space (possibly hybrid) and embedding non-determinism in the shape of a control structure. The contribution looks at the problem of optimization, over the set of allowed controls, of probabilistic specifications defined by automata-in particular, the focus is on deterministic finite-state automata. This problem can be reformulated as an optimization of a probabilistic reachability property over a product process obtained from the model for the specification and the model of the system. Optimizing over automata-based specifications thus leads to maximal or minimal probabilistic reachability properties. For both setups, the contribution shows that these problems can be sufficiently tackled with history-independent Markov policies. This outcome has relevant computational repercussions: in particular, the work develops a discretization …", "num_citations": "56\n", "authors": ["1810"]}
{"title": "Do weather conditions influence the onset of renal colic? A novel approach to analysis\n", "abstract": " Background/Aim: To investigate the seasonal variations of the incidence of renal colic by a computerized analysis of cyclic climatic features. Methods: 1,163 consecutive patients with acute renal colic were studied. Eigendecomposition and signal reconstruction of district temperature and humidity were performed to establish any cyclic variation. Average temperatures and humidity values were calculated at time periods of 15, 30, 45 and 60 days preceding each renal colic. Results: Patients were allocated to groups every 30 days, since eigendeanalysis suggested that intervals of this duration have homogeneous climatic features. With an average time period of 15 days preceding each renal colic, a positive correlation coefficient of temperature (r=+ 0.75 with CI 0.31–0.93, p< 0.005) and a cubic relationship at the regression analysis (R= 82.4%, p= 0.015) were found with the onset of colics. We observed a negative …", "num_citations": "53\n", "authors": ["1810"]}
{"title": "Modeling and simulation of a microgrid as a stochastic hybrid system\n", "abstract": " Microgrids (MGs) are small-scale local energy grids. While dedicated to cover local power needs, their structure and operation is usually quite complex. Complexity arises due to a number of factors: in the first instance, a variety of operational modes - among them, MGs can be considered to be operated autonomously whenever the main distribution grid is not available; furthermore, the heterogeneity of energy types in a MG - not exclusively electrical energy, but also thermal for instance; also, the different functions that a MG energy management system has to fulfill - like coordination and dispatching of multiple generation, transfer, transformation and storage devices; finally, the external and internal random factors that affect operations. All these aspects make control and scheduling of a MG quite a challenging task. On the other hand, this widespread complexity leaves much room for improvement on the current …", "num_citations": "50\n", "authors": ["1810"]}
{"title": "Approximately bisimilar symbolic models for randomly switched stochastic systems\n", "abstract": " In the past few years there has been a growing interest in the use of symbolic models for control systems. The main reason is the possibility to leverage algorithmic techniques over symbolic models to synthesize controllers that are valid for the concrete control systems. Such controllers can enforce complex logical specifications that are otherwise hard (if not impossible) to establish on the concrete models with classical control techniques. Examples of such specifications include those expressible via linear temporal logic or as automata on infinite strings. A relevant goal in this research line is in the identification of classes of systems that admit symbolic models: in particular, continuous-time systems with stochastic or hybrid dynamics have been only recently considered, due to their rather general and complex dynamics. In this work we make progress in this direction by enlarging the class of stochastic hybrid systems …", "num_citations": "48\n", "authors": ["1810"]}
{"title": "A stochastic games framework for verification and control of discrete time stochastic hybrid systems\n", "abstract": " We describe a framework for analyzing probabilistic reachability and safety problems for discrete time stochastic hybrid systems within a dynamic games setting. In particular, we consider finite horizon zero-sum stochastic games in which a control has the objective of reaching a target set while avoiding an unsafe set in the hybrid state space, and a rational adversary has the opposing objective. We derive an algorithm for computing the maximal probability of achieving the control objective, subject to the worst-case adversary behavior. From this algorithm, sufficient conditions of optimality are also derived for the synthesis of optimal control policies and worst-case disturbance strategies. These results are then specialized to the safety problem, in which the control objective is to remain within a safe set. We illustrate our modeling framework and computational approach using both a tutorial example with jump Markov …", "num_citations": "44\n", "authors": ["1810"]}
{"title": "Computational techniques for reachability analysis of max-plus-linear systems\n", "abstract": " This work discusses a computational approach to reachability analysis of Max-Plus-Linear (MPL) systems, a class of discrete-event systems widely used in synchronization and scheduling applications. Given a set of initial states, we characterize and compute its “reach tube,” namely the collection of set of reachable states (regarded step-wise as “reach sets”). By an alternative characterization of the MPL dynamics, we show that the exact computation of the reach sets can be performed quickly and compactly by manipulations of difference-bound matrices, and further derive worst-case bounds on the complexity of these operations. The approach is also extended to backward reachability analysis. The concepts and results are elucidated by a running example, and we further illustrate the performance of the approach by a numerical benchmark: the technique comfortably handles twenty-dimensional MPL systems (i.e …", "num_citations": "42\n", "authors": ["1810"]}
{"title": "Formula-free finite abstractions for linear temporal verification of stochastic hybrid systems\n", "abstract": " Results on approximate model-checking of Stochastic Hybrid Systems (SHS) against general temporal specifications lead to abstractions that structurally depend on the given specification or with a state cardinality that crucially depends on the size of the specification. In order to cope with the associated issues of generality and scalability, we propose a specification-free abstraction approach that is general, namely it allows constructing a single abstraction to be then used for a whole cohort of problems. It furthermore computationally outperforms specification-dependent abstractions over linear temporal properties, such as bounded LTL (BLTL). The proposed approach unifies techniques for the approximate abstraction of SHS over different classes of properties by explicitly relating the error introduced by the approximation to the distance between transition kernels of abstract and concrete models, and by …", "num_citations": "42\n", "authors": ["1810"]}
{"title": "Adaptive gridding for abstraction and verification of stochastic hybrid systems\n", "abstract": " This work is concerned with the generation of finite abstractions of general Stochastic Hybrid Systems, to be employed in the formal verification of probabilistic properties by means of model checkers. The contribution employs an abstraction procedure based on a partitioning of the state space, and puts forward a novel adaptive gridding algorithm that is expected to conform to the underlying dynamics of the model and thus at least to mitigate the curse of dimensionality related to the partitioning procedure. With focus on the study of probabilistic safety over a finite horizon, the proposed adaptive algorithm is first benchmarked against a uniform gridding approach from the literature, and finally tested on a known applicative case study.", "num_citations": "41\n", "authors": ["1810"]}
{"title": "Quantitative automata model checking of autonomous stochastic hybrid systems\n", "abstract": " This paper considers the quantitative verification of discrete-time stochastic hybrid systems (DTSHS) against linear time objectives. The central question is to determine the likelihood of all the trajectories in a DTSHS that are accepted by an automaton on finite or infinite words. This verification covers regular and ω-regular properties, and thus comprises the linear temporal logic LTL. This work shows that these quantitative verification problems can be reduced to computing reachability probabilities over the product of an automaton and the DTSHS under study. The computation of reachability probabilities can be performed in a backward-recursive manner, and quantitatively approximated by procedures over discrete-time Markov chains. A case study shows the feasibility of the approach.", "num_citations": "40\n", "authors": ["1810"]}
{"title": "Verification of general Markov decision processes by approximate similarity relations and policy refinement\n", "abstract": " In this work we introduce new approximate similarity relations that are shown to be key for policy (or control) synthesis over general Markov decision processes. The models of interest are discrete-time Markov decision processes, endowed with uncountably infinite state spaces and metric output (or observation) spaces. The new relations, underpinned by the use of metrics, allow, in particular, for a useful trade-off between deviations over probability distributions on states, and distances between model outputs. We show that the new probabilistic similarity relations, inspired by a notion of simulation developed for finite-state models, can be effectively employed  over general Markov decision processes for verification purposes, and specifically for control refinement from abstract models.", "num_citations": "39\n", "authors": ["1810"]}
{"title": "Approximation metrics based on probabilistic bisimulations for general state-space Markov processes: a survey\n", "abstract": " This article provides a survey of approximation metrics for stochastic processes. We deal with Markovian processes in discrete time evolving on general state spaces, namely on domains with infinite cardinality and endowed with proper measurability and metric structures. The focus of this work is to discuss approximation metrics between two such processes, based on the notion of probabilistic bisimulation: in particular we investigate metrics characterized by an approximate variant of this notion. We suggest that metrics between two processes can be introduced essentially in two distinct ways: the first employs the probabilistic conditional kernels underlying the two stochastic processes under study, and leverages notions derived from algebra, logic, or category theory; whereas the second looks at distances between trajectories of the two processes, and is based on the dynamical properties of the two processes …", "num_citations": "39\n", "authors": ["1810"]}
{"title": "Flux response of glycolysis and storage metabolism during rapid feast/famine conditions in Penicillium chrysogenum using dynamic 13C labeling\n", "abstract": " The scale‐up of fermentation processes frequently leads to a reduced productivity compared to small‐scale screening experiments. Large‐scale mixing limitations that lead to gradients in substrate and oxygen availability could influence the microorganism performance. Here, the impact of substrate gradients on a penicillin G producing Penicillium chrysogenum cultivation was analyzed using an intermittent glucose feeding regime. The intermittent feeding led to fluctuations in the extracellular glucose concentration between 400 μM down to 6.5 μM at the end of the cycle. The intracellular metabolite concentrations responded strongly and showed up to 100‐fold changes. The intracellular flux changes were estimated on the basis of dynamic 13C mass isotopomer measurements during three cycles of feast and famine using a novel hybrid modeling approach. The flux estimations indicated a high turnover of internal …", "num_citations": "38\n", "authors": ["1810"]}
{"title": "A novel approach for accurate prediction of spontaneous passage of ureteral stones: support vector machines\n", "abstract": " The objective of this study was to optimally predict the spontaneous passage of ureteral stones in patients with renal colic by applying for the first time support vector machines (SVM), an instance of kernel methods, for classification. After reviewing the results found in the literature, we compared the performances obtained with logistic regression (LR) and accurately trained artificial neural networks (ANN) to those obtained with SVM, that is, the standard SVM, and the linear programming SVM (LP-SVM); the latter techniques show an improved performance. Moreover, we rank the prediction factors according to their importance using Fisher scores and the LP-SVM feature weights. A data set of 1163 patients affected by renal colic has been analyzed and restricted to single out a statistically coherent subset of 402 patients. Nine clinical factors are used as inputs for the classification algorithms, to predict one binary …", "num_citations": "38\n", "authors": ["1810"]}
{"title": "Model-based predictive maintenance in building automation systems with user discomfort\n", "abstract": " This work presents a new methodology for quantifying the discomfort caused by non-optimal temperature regulation, in a building automation system, as a result of degraded biomass boiler operation. This discomfort is incorporated in a model-based dynamic programming algorithm that computes the optimal maintenance action for cleaning or replacing the boiler. A non-linear cleaning model is used to represent the different cleaning strategies under taken by contractors. The maintenance strategy minimizes the total operational costs of the boiler, the cleaning costs and the newly defined discomfort costs, over a long-term prediction horizon that captures the short-term daily thermal comfort within the heating zone. The approach has been developed based on real data obtained from a biomass boiler at a Spanish school and the resulting optimal maintenance strategies are shown to have the potential of significant …", "num_citations": "37\n", "authors": ["1810"]}
{"title": "Finite abstractions of max-plus-linear systems\n", "abstract": " This work puts forward a novel technique to generate finite abstractions of autonomous and nonautonomous Max-Plus-Linear (MPL) models, a class of discrete-event systems used to characterize the dynamics of the timing related to successive events that synchronize autonomously. Nonautonomous versions of MPL models embed within their dynamics nondeterminism, namely a signal choice that is usually regarded as an exogenous control or schedule. In this paper, abstractions of MPL models are characterized as finite-state Labeled Transition Systems (LTS). LTS are obtained first by partitioning the state space (and, for the nonautonomous model, by covering the input space) of the MPL model and by associating states of the LTS to the introduced partitions, then by defining relations among the states of the LTS based on dynamical transitions between the corresponding partitions of the MPL state space, and …", "num_citations": "35\n", "authors": ["1810"]}
{"title": "Efficient suboptimal solutions of switched LQR problems\n", "abstract": " This paper studies the discrete-time switched LQR (DSLQR) problem using a dynamic programming approach. Efficient algorithms are proposed to solve both the finite-horizon and the infinite-horizon suboptimal DSLQR problems. More importantly, we establish analytical conditions under which the strategies generated by the algorithms are stabilizing and suboptimal. These conditions are derived explicitly in terms of subsystem matrices and are thus easy to verify. The proposed algorithms and the analysis provide a systematical way of solving the DSLQR problem with guaranteed closed-loop stability and suboptimal performance. Simulation results indicate that the proposed algorithms can efficiently solve not only specific but also randomly generated DSLQR problems, making NP-hard problems numerically tractable.", "num_citations": "35\n", "authors": ["1810"]}
{"title": "Sufficient conditions for the existence of Zeno behavior in a class of nonlinear hybrid systems via constant approximations\n", "abstract": " The existence of Zeno behavior in hybrid systems is related to a certain type of equilibria, termed Zeno equilibria, that are invariant under the discrete, but not the continuous, dynamics of a hybrid system. In analogy to the standard procedure of linearizing a vector field at an equilibrium point to determine its stability, in this paper we study the local behavior of a hybrid system near a Zeno equilibrium point by considering the value of the vector field on each domain at this point, i.e., we consider constant approximations of nonlinear hybrid systems. By means of these constant approximations, we are able to derive conditions that simultaneously imply both the existence of Zeno behavior and the local exponential stability of a Zeno equilibrium point. Moreover, since these conditions are in terms of the value of the vector field on each domain at a point, they are remarkably easy to verify.", "num_citations": "34\n", "authors": ["1810"]}
{"title": "StocHy-automated verification and synthesis of stochastic processes\n", "abstract": " Stochastic hybrid systems (SHS) are a rich mathematical modelling framework capable of describing complex systems, where uncertainty and hybrid (that is, both continuous and discrete) components are relevant. We introduce a new software tool-StocHy-aimed at simplifying both the modelling of SHS and their analysis. StocHy can (i) perform verification tasks, eg, compute the probability of staying within a certain region of the state space from a given set of initial conditions;(ii) automatically synthesise strategies maximising this probability, and (iii) simulate the SHS evolution over time. We highlight the performance of StocHy, via a set of experiment that are run on a standard laptop, with an Intel Core i7-8550U CPU at 1.80 GHz× 8 and with 8 GB of RAM. StocHy is available at gitlab. com/natchi92/StocHy.", "num_citations": "31\n", "authors": ["1810"]}
{"title": "Robust PCTL model checking\n", "abstract": " This paper deals with the notion of approximate probabilistic bisimulation (APB) relation for discrete-time labeled Markov Chains (LMC). In order to provide a quantified upper bound on a metric over probabilistic realizations for LMC, we exploit the structure and properties of the APB and leverage the mathematical framework of Markov set-Chains. Based on this bound, the article proves that the existence of an APB implies the preservation of robust PCTL formulae, which are formulae that allow being properly relaxed or strengthened, according to the underlying APB. This leads to a notion of robustness for probabilistic model checking.", "num_citations": "31\n", "authors": ["1810"]}
{"title": "On infinite horizon switched LQR problems with state and control constraints\n", "abstract": " This paper studies the Discrete-Time Switched LQR problem over an infinite time horizon, subject to polyhedral constraints on state and control inputs. Specifically, we aim to find an infinite-horizon hybrid-control sequence, i.e., a sequence of continuous and discrete (switching) control inputs, that minimizes an infinite-horizon quadratic cost function, subject to polyhedral constraints on state and (continuous) control input. The overall constrained, infinite-horizon problem is split into two subproblems: (i) an unconstrained, infinite-horizon problem and (ii) a constrained, finite-horizon one. We derive a stationary suboptimal policy for problem (i) with analytical bounds on its optimality, and develop a novel formulation of problem (ii) as a Mixed-Integer Quadratic Program. By introducing the concept of a safe set, the solutions of the two subproblems are combined to achieve the overall control objective. Through the …", "num_citations": "29\n", "authors": ["1810"]}
{"title": "On infinite-horizon probabilistic properties and stochastic bisimulation functions\n", "abstract": " This work investigates infinite-horizon properties over discrete-time stochastic models with continuous state spaces. The focus is on understanding how the structural features of a model (e.g., the presence of absorbing sets) affect the values of these properties and relate to their uniqueness. Furthermore, we argue that the investigation of these features can lead to approximation bounds for the value of such properties, as well as to improvements on their computation. The article employs the presented results to find a stochastic bisimulation function of two processes.", "num_citations": "29\n", "authors": ["1810"]}
{"title": "Adaptive aggregation of Markov chains: Quantitative analysis of chemical reaction networks\n", "abstract": " Quantitative analysis of Markov models typically proceeds through numerical methods or simulation-based evaluation. Since the state space of the models can often be large, exact or approximate state aggregation methods (such as lumping or bisimulation reduction) have been proposed to improve the scalability of the numerical schemes. However, none of the existing numerical techniques provides general, explicit bounds on the approximation error, a problem particularly relevant when the level of accuracy affects the soundness of verification results. We propose a novel numerical approach that combines the strengths of aggregation techniques (state-space reduction) with those of simulation-based approaches (automatic updates that adapt to the process dynamics). The key advantage of our scheme is that it provides rigorous precision guarantees under different measures. The new approach, which …", "num_citations": "28\n", "authors": ["1810"]}
{"title": "Discrete time stochastic hybrid dynamical games: Verification & controller synthesis\n", "abstract": " This paper presents a framework for analyzing probabilistic safety and reachability problems for discrete time stochastic hybrid systems in scenarios where system dynamics are affected by rational competing agents. In particular, we consider a zero-sum game formulation of the probabilistic reach-avoid problem, in which the control objective is to maximize the probability of reaching a desired subset of the hybrid state space, while avoiding an unsafe set, subject to the worst-case behavior of a rational adversary. Theoretical results are provided on a dynamic programming algorithm for computing the maximal reach-avoid probability under the worst-case adversary strategy, as well as the existence of a max-min control policy which achieves this probability. The modeling framework and computational algorithm are demonstrated using an example derived from a robust motion planning application.", "num_citations": "28\n", "authors": ["1810"]}
{"title": "Aggregation of thermostatically controlled loads by formal abstractions\n", "abstract": " This work discusses a two-step procedure based on formal abstractions, which generates a finite stochastic dynamical model as an aggregation of the continuous temperature dynamics of a population of Thermostatically Controlled Loads (TCL). The temperature of each single TCL is described by a stochastic difference equation and the TCL status (ON, OFF) by a deterministic switching mechanism. The procedure is formal as it allows the exact quantification of the error introduced by the abstraction. The work discusses extensions to the case of controlled TCL. The procedure is tested on a case study and benchmarked against an alternative approach in the literature.", "num_citations": "26\n", "authors": ["1810"]}
{"title": "Piecewise affine approximations of fluxes and enzyme kinetics from in vivo 13C labeling experiments\n", "abstract": " Owing to the ever increasing amount of available information on metabolic networks and, in particular, to the increase in information content from in vivo 13C dynamic labeling experiments, this work investigates the problem of reconstructing dynamic fluxes and enzyme kinetics. The model structure is based on the use of piecewise affine approximations. The optimization procedure at the basis of the model identification is improved by separating the parameter estimation procedure into two different phases. As a first step, a dynamic flux profile in time is reconstructed using functions that are piecewise affine (in time). To achieve scalability for this step, several approaches have been developed and compared. Afterwards, the time‐dependent profiles are embedded in the concentration space and the enzyme kinetic functions for single reactions are identified independently. This is an advantage compared with …", "num_citations": "26\n", "authors": ["1810"]}
{"title": "Towards scalable synthesis of stochastic control systems\n", "abstract": " Formal synthesis approaches over stochastic systems have received significant attention in the past few years, in view of their ability to provide provably correct controllers for complex logical specifications in an automated fashion. Examples of complex specifications include properties expressed as formulae in linear temporal logic (LTL) or as automata on infinite strings. A general methodology to synthesize controllers for such properties resorts to symbolic models of the given stochastic systems. Symbolic models are finite abstractions of the given concrete systems with the property that a controller designed on the abstraction can be refined (or implemented) into a controller on the original system. Although the recent development of techniques for the construction of symbolic models has been quite encouraging, the general goal of formal synthesis over stochastic control systems is by no means solved. A …", "num_citations": "24\n", "authors": ["1810"]}
{"title": "Data-driven and model-based verification via Bayesian identification and reachability analysis\n", "abstract": " This work develops a measurement-driven and model-based formal verification approach, applicable to dynamical systems with partly unknown dynamics. We provide a new principled method, grounded on Bayesian inference and on reachability analysis respectively, to compute the confidence that a physical system driven by external inputs and accessed under noisy measurements verifies a given property expressed as a temporal logic formula. A case study discusses the bounded- and unbounded-time safety verification of a partly unknown system, encompassed within a class of linear, time-invariant dynamical models with inputs and output measurements.", "num_citations": "24\n", "authors": ["1810"]}
{"title": "A contractivity approach for probabilistic bisimulations of diffusion processes\n", "abstract": " This work is concerned with the problem of characterizing and computing probabilistic bisimulations of diffusion processes. A probabilistic bisimulation relation between two such processes is defined through a bisimulation function, which induces an approximation metric on the expectation of the (squared norm of the) distance between the two processes. We introduce sufficient conditions for the existence of a bisimulation function, based on the use of contractivity analysis for probabilistic systems. Furthermore, we show that the notion of stochastic contractivity is related to a probabilistic version of the concept of incremental stability. This relationship leads to a procedure that constructs a discrete approximation of a diffusion process. The procedure is based on the discretization of space and time. Given a diffusion process, we raise sufficient conditions for the existence of such an approximation, and show that it is …", "num_citations": "24\n", "authors": ["1810"]}
{"title": "Bisimilar symbolic models for stochastic control systems without state-space discretization\n", "abstract": " In the past few years different techniques have been developed for constructively deriving symbolic abstractions of (stochastic) control systems. The obtained symbolic models allow us to leverage the apparatus of finite-state reactive synthesis towards the problem of designing hybrid controllers enforcing rich logic specifications over the concrete models. Unfortunately, most of the existing techniques severely suffer from the curse of dimensionality due to the need to discretize state and input sets. In this paper we provide a symbolic abstraction technique for incrementally stable stochastic control systems, which only requires discretizing input sets. We show that for every incrementally stable stochastic control system, and for every given positive precision ε, the discretization of exclusively the input set allows constructing a symbolic model which is ε-approximate bisimilar (in moments) to the original stochastic control …", "num_citations": "23\n", "authors": ["1810"]}
{"title": "Approximate abstractions of stochastic systems: A randomized method\n", "abstract": " This work introduces a randomized method for the design of an approximate abstraction of a stochastic system and the assessment of its quality. The proposed approach relies on the formulation of the problem as a semi-infinite chance-constrained optimization program and on its solution via randomization. The method has quite general applicability, since it only requires to be able to run multiple executions of the candidate abstract model and of the original system and to compute their distance. Two variants of the notion of distance are considered in view of a possible use of the approximate abstraction for probabilistic safety verification. The approach is tested on a numerical example.", "num_citations": "23\n", "authors": ["1810"]}
{"title": "Understanding deadlock and livelock behaviors in hybrid control systems\n", "abstract": " This paper introduces a formal definition and a categorization of Deadlock and Livelock behaviors for a general class of deterministic Hybrid Control Systems (HCS), thus extending the classical notion known for (uncontrolled) discrete transition systems. This characterization hinges on three important aspects: (1) the concept of composition (or interconnection) of HCSs; (2) the notion of control-dependent specification, and that of composition of specifications; (3) the dynamical structure of an HCS and its related behaviors. The first notion is introduced in a novel manner, by including aspects from the literature of discrete transition systems, as well as accounting for classical concepts such as that of feedback interconnection of dynamical systems. The second point allows us to formally express general properties that are of interest from a systems and control theory perspective. The third part discriminates between the …", "num_citations": "23\n", "authors": ["1810"]}
{"title": "Markov set-chains as abstractions of stochastic hybrid systems\n", "abstract": " The objective of this study is to introduce an abstraction procedure that applies to a general class of dynamical systems, that is to discrete-time stochastic hybrid systems (dt-SHS). The procedure abstracts the original dt-SHS into a Markov set-chain (MSC) in two steps. First, a Markov chain (MC) is obtained by partitioning the hybrid state space, according to a controllable parameter, into non-overlapping domains and computing transition probabilities for these domains according to the dynamics of the dt-SHS. Second, explicit error bounds for the abstraction that depend on the above parameter are derived, and are associated to the computed transition probabilities of the MC, thus obtaining a MSC. We show that one can arbitrarily increase the accuracy of the abstraction by tuning the controllable parameter, albeit at an increase of the cardinality of the MSC. Resorting to a number of results from the MSC …", "num_citations": "23\n", "authors": ["1810"]}
{"title": "Optimal control of partially observable discrete time stochastic hybrid systems for safety specifications\n", "abstract": " This paper describes a theoretical framework for the design of controllers to satisfy probabilistic safety specifications for partially observable discrete time stochastic hybrid systems. We formulate the problem as a partial information stochastic optimal control problem, in which the objective is to maximize the probability that the state trajectory remains within a given safe set in the hybrid state space, using observations of the history of inputs and outputs. It is shown that this optimal control problem, which has a multiplicative payoff structure, is equivalent to a terminal payoff problem when the state space is augmented with a binary random variable capturing the safety of past state evolution. This allows us to derive a sufficient statistic for the probabilistic safety problem as a set of Bayesian filtering equations updating a conditional distribution on the augmented state space, as well as an abstract dynamic programming …", "num_citations": "22\n", "authors": ["1810"]}
{"title": "Characterization and computation of infinite-horizon specifications over Markov processes\n", "abstract": " This work is devoted to the formal verification of specifications over general discrete-time Markov processes, with an emphasis on infinite-horizon properties. These properties, formulated in a modal logic known as PCTL, can be expressed through value functions defined over the state space of the process. The main goal is to understand how structural features of the model (primarily the presence of absorbing sets) influence the uniqueness of the solutions of corresponding Bellman equations. Furthermore, this contribution shows that the investigation of these structural features leads to new computational techniques to calculate the specifications of interest: the emphasis is to derive approximation techniques with associated explicit convergence rates and formal error bounds.", "num_citations": "21\n", "authors": ["1810"]}
{"title": "Probabilistic reachability and safe sets computation for discrete time stochastic hybrid systems\n", "abstract": " In this work probabilistic reachability for controlled discrete time stochastic hybrid systems is investigated. By a suitable formulation of the reachability problem within a stochastic optimal control framework, two complementary interpretations and their corresponding computational techniques are suggested. The results can be of interest for solving safety analysis and control design problems for stochastic hybrid systems, by the computation of maximal probabilistic safe sets and maximally safe policies. They can also be employed to solve regulation problems through the interpretation of the desired operating region for the system as a \"safe set\". The described methodology is applied to a simple temperature regulation problem", "num_citations": "21\n", "authors": ["1810"]}
{"title": "Formal synthesis of lyapunov neural networks\n", "abstract": " We propose an automatic and formally sound method for synthesising Lyapunov functions for the asymptotic stability of autonomous non-linear systems. Traditional methods are either analytical and require manual effort or are numerical but lack of formal soundness. Symbolic computational methods for Lyapunov functions, which are in between, give formal guarantees but are typically semi-automatic because they rely on the user to provide appropriate function templates. We propose a method that finds Lyapunov functions fully automatically—using machine learning—while also providing formal guarantees—using satisfiability modulo theories (SMT). We employ a counterexample-guided approach where a numerical learner and a symbolic verifier interact to construct provably correct Lyapunov neural networks (LNNs). The learner trains a neural network that satisfies the Lyapunov criteria for asymptotic stability …", "num_citations": "20\n", "authors": ["1810"]}
{"title": "Long-term predictive maintenance: A study of optimal cleaning of biomass boilers\n", "abstract": " Combustion in a biomass-fired boiler causes build-up of soot, which reduces the heat transfer and decreases the efficiency of operation. In order to mitigate this natural occurrence, cleaning via soot blowing is an important maintenance action. The objective of this study is to develop long-term optimal maintenance strategies, which are model-based and specifically employ the dynamics of boiler efficiency and of anticipated heating demand, both of which are identified from empirical data. An approximate dynamic programming algorithm is set up, resulting in the optimal maintenance actions over time, so that the total operational costs of the biomass boiler plus the cleaning costs are minimized. A practical case study with real data is used to elucidate the benefits of the new approach.", "num_citations": "20\n", "authors": ["1810"]}
{"title": "Finite abstractions of networked control systems\n", "abstract": " In networked control systems (NCS), the communication between sensors, controllers, and actuators is supported by a shared communication channel that is subject to variable communication delays, limited bandwidth, packet losses, quantization errors, and other practical non-idealities. This work investigates the problem of constructively deriving symbolic models of NCS by simultaneously considering the mentioned network non-idealities. By employing the obtained symbolic models, one can completely automate the design of controllers enforcing rich logical specifications, e.g. formulae in linear temporal logic, over NCS.", "num_citations": "20\n", "authors": ["1810"]}
{"title": "Safe Policy Search with Gaussian Process Models\n", "abstract": " We propose a method to optimise the parameters of a policy which will be used to safely perform a given task in a data-efficient manner. We train a Gaussian process model to capture the system dynamics, based on the PILCO framework. Our model has useful analytic properties, which allow closed form computation of error gradients and estimating the probability of violating given state space constraints. During training, as well as operation, only policies that are deemed safe are implemented on the real system, minimising the risk of failure.", "num_citations": "19\n", "authors": ["1810"]}
{"title": "Certified policy synthesis for general markov decision processes: An application in building automation systems\n", "abstract": " In this paper, we present an industrial application of new approximate similarity relations for Markov models, and show that they are key for the synthesis of control strategies. Typically, modern engineering systems are modelled using complex and high-order models which make the correct-by-design controller construction computationally hard. Using the new approximate similarity relations, this complexity is reduced and we provide certificates on the performance of the synthesised policies. The application deals with stochastic models for the thermal dynamics in a “smart building” setup: such building automation system set-up can be described by discrete-time Markov decision processes evolving over an uncountable state space and endowed with an output quantifying the room temperature. The new similarity relations draw a quantitative connection between different levels of model abstraction, and allow to …", "num_citations": "19\n", "authors": ["1810"]}
{"title": "Quantitative approximation of the probability distribution of a Markov process by formal abstractions\n", "abstract": " The goal of this work is to formally abstract a Markov process evolving in discrete time over a general state space as a finite-state Markov chain, with the objective of precisely approximating its state probability distribution in time, which allows for its approximate, faster computation by that of the Markov chain. The approach is based on formal abstractions and employs an arbitrary finite partition of the state space of the Markov process, and the computation of average transition probabilities between partition sets. The abstraction technique is formal, in that it comes with guarantees on the introduced approximation that depend on the diameters of the partitions: as such, they can be tuned at will. Further in the case of Markov processes with unbounded state spaces, a procedure for precisely truncating the state space within a compact set is provided, together with an error bound that depends on the asymptotic properties of the transition kernel of the original process. The overall abstraction algorithm, which practically hinges on piecewise constant approximations of the density functions of the Markov process, is extended to higher-order function approximations: these can lead to improved error bounds and associated lower computational requirements. The approach is practically tested to compute probabilistic invariance of the Markov process under study, and is compared to a known alternative approach from the literature.", "num_citations": "19\n", "authors": ["1810"]}
{"title": "Probabilistic reach-avoid computation for partially degenerate stochastic processes\n", "abstract": " This work is concerned with the computation of probabilistic reach-avoid properties over a finite horizon for partially degenerate stochastic (that is, mixed deterministic-stochastic) processes evolving in discrete time over a continuous state-space. The models of interest consist of two fully coupled dynamical parts: the first part is described by deterministic maps (vector fields), whereas the second depends on probabilistic dynamics that are characterized by stochastic kernels. In contrast with a fully probabilistic approach (which is possible since the two dynamical components are coupled), this work shows that the probabilistic reach-avoid problem can be characterized-and thus computed-in two sequential steps: the first is a simple deterministic reachability analysis, which is then followed by a probabilistic reach-avoid problem depending on the outcome of the first step. This characterization leads to implementation …", "num_citations": "19\n", "authors": ["1810"]}
{"title": "Efficiency through uncertainty: Scalable formal synthesis for stochastic hybrid systems\n", "abstract": " This work targets the development of an efficient abstraction method for formal analysis and control synthesis of discrete-time stochastic hybrid systems (SHS) with linear dynamics. The focus is on temporal logic specifications over both finite-and infinite-time horizons. The framework constructs a finite abstraction as a class of uncertain Markov models known as interval Markov decision process (IMDP). Then, a strategy that maximizes the satisfaction probability of the given specification is synthesized over the IMDP and mapped to the underlying SHS. In contrast to existing formal approaches, which are by and large limited to finite-time properties and rely on conservative over-approximations, we show that the exact abstraction error can be computed as a solution of convex optimization problems and can be embedded into the IMDP abstraction. This is later used in the synthesis step over both bounded-and …", "num_citations": "18\n", "authors": ["1810"]}
{"title": "Higher-order approximations for verification of stochastic hybrid systems\n", "abstract": " This work investigates the approximate verification of probabilistic specifications expressed as any non-nested PCTL formula over Markov processes on general state spaces. The contribution puts forward new algorithms, based on higher-order function approximation, for the efficient computation of approximate solutions with explicit bounds on the error. Approximation error related to higher-order approximations can be substantially lower than those for piece-wise constant (zeroth-order) approximations known in the literature and, unlike the latter, can display convergence in time to a finite value. Furthermore, higher-order approximation procedures, which depend on the partitioning of the state space, can lead to lower partition cardinality than the related piece-wise constant ones. The work is first presented for Markov processes over Euclidean spaces and thereafter extended to hybrid spaces …", "num_citations": "18\n", "authors": ["1810"]}
{"title": "Stochastic approximations of hybrid systems\n", "abstract": " This paper introduces a method for approximating the dynamics of deterministic hybrid systems. Within this setting, we shall consider jump conditions that are characterized by spatial guards. After defining proper penalty functions along these deterministic guards, corresponding probabilistic intensities are introduced and the deterministic dynamics are approximated by the stochastic evolution of a continuous-time Markov process. We would illustrate how the definition of the stochastic barriers can avoid ill-posed events such as \"grazing\", and show how the probabilistic guards can be helpful in addressing the problem of event detection. Furthermore, this method represents a very general technique for handling Zeno phenomena; it provides a universal way to regularize a hybrid system. Simulations would show that the stochastic approximation of a hybrid system is accurate, while being able to handle ''pathological …", "num_citations": "18\n", "authors": ["1810"]}
{"title": "New congestion control schemes over wireless networks: Delay sensitivity analysis and simulations\n", "abstract": " This paper proposes two new congestion control schemes for packet switched wireless networks. Starting from the seminal work of Kelly (Kelly et al., Dec 1999), we consider the decentralized flow control model for a TCP-like scheme and extend it to the wireless scenario. Motivated by the presence of channel errors, we introduce updates in the part of the model representing the number of connections the user establishes with the network; this assumption has important physical interpretation. Specifically, we propose two updates: the first is static, while the second evolves dynamically. The global stability of both schemes has been proved; also, a stochastic stability study and the rate of convergence of the two algorithms have been investigated. This paper focuses on the delay sensitivity of both schemes. A stability condition on the parameters of the system is introduced and proved. Moreover, some deeper insight …", "num_citations": "18\n", "authors": ["1810"]}
{"title": "ARCH-COMP18 Category Report: Stochastic Modelling.\n", "abstract": " This report presents the results of a friendly competition for formal verification and policy synthesis of stochastic models. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2018. In this first edition, we present five benchmarks with different levels of complexities and stochastic flavours. We make use of six different tools and frameworks (in alphabetical order): Barrier Certificates, FAUST2, FIRM-GDTL, Modest, SDCPN modelling & MC simulation and SReachTools; and attempt to solve instances of the five different benchmark problems. Through these benchmarks, we capture a snapshot on the current state-of the art tools and frameworks within the stochastic modelling domain. We also present the challenges encountered within this domain and highlight future plans which will push forward the development of more tools and methodologies for performing formal verification and optimal policy synthesis of stochastic processes.", "num_citations": "17\n", "authors": ["1810"]}
{"title": "Benchmarks for cyber-physical systems: A modular model library for building automation systems\n", "abstract": " Building Automation Systems (BAS) are exemplars of Cyber-Physical Systems (CPS), incorporating digital control architectures over underlying continuous physical processes. We provide a modular model library for BAS drawn from expertise developed on a real BAS setup. The library allows to build models comprising either physical quantities or digital control modules. The structure, operation, and dynamics of the model can be complex, incorporating (i) stochasticity, (ii) non-linearities, (iii) numerous continuous variables or discrete states, (iv) various input and output signals, and (v) a large number of possible discrete configurations. The modular composition of BAS components can generate useful CPS benchmarks. We display this use by means of three realistic case studies, where corresponding models are built and engaged with different analysis goals. The benchmarks, the model library and associated …", "num_citations": "17\n", "authors": ["1810"]}
{"title": "Precise approximations of the probability distribution of a Markov process in time: an application to probabilistic invariance\n", "abstract": " The goal of this work is to formally abstract a Markov process evolving over a general state space as a finite-state Markov chain, with the objective of precisely approximating the state probability distribution of the Markov process in time. The approach uses a partition of the state space and is based on the computation of the average transition probability between partition sets. In the case of unbounded state spaces, a procedure for precisely truncating the state space within a compact set is provided, together with an error bound that depends on the asymptotic properties of the transition kernel of the Markov process. In the case of compact state spaces, the work provides error bounds that depend on the diameters of the partitions, and as such the errors can be tuned. The method is applied to the problem of computing probabilistic invariance of the model under study, and the result is compared to an …", "num_citations": "17\n", "authors": ["1810"]}
{"title": "Probabilistic reachability for stochastic hybrid systems: theory, computations, and applications\n", "abstract": " Stochastic Hybrid Systems are probabilistic models suitable at describing the dynamics of variables presenting interleaved and interacting continuous and discrete components.", "num_citations": "17\n", "authors": ["1810"]}
{"title": "Optimal control for a class of stochastic hybrid systems\n", "abstract": " In this paper, an optimal control problem over a \"hybrid Markov chain\" (HMC) is studied. An HMC can be thought of as a traditional MC with continuous time dynamics pertaining to each node; from a different perspective, it can be regarded as a class of hybrid system with random discrete switches induced by an embedded MC. As a consequence of this setting, the index to be maximized, which depends on the dynamics, is the expected value of a nondeterministic cost function. After obtaining a closed form for the objective function, we gradually suggest how to device a computationally tractable algorithm to get to the optimal value. Furthermore, the complexity and rate of convergence of the algorithm is analyzed. Proofs and simulations of our results are provided; moreover, an applicative and motivating example is introduced.", "num_citations": "17\n", "authors": ["1810"]}
{"title": "Symbolic abstractions of networked control systems\n", "abstract": " The last decade has witnessed significant attention on networked control systems (NCSs) due to their ubiquitous presence in industrial applications, and in the particular case of wireless NCSs, because of their architectural flexibility and low installation and maintenance costs. In wireless NCSs, the communication between sensors, controllers, and actuators is supported by a communication channel that is likely to introduce variable communication delays, packet losses, limited bandwidth, and other practical nonidealities leading to numerous technical challenges. Although stability properties of NCSs have been investigated extensively in the literature, results for NCSs under more complex and general objectives, and, in particular, results dealing with verification or controller synthesis for logical specifications, are much more limited. This paper investigates how to address such complex objectives by constructively …", "num_citations": "16\n", "authors": ["1810"]}
{"title": "Backward reachability of autonomous max-plus-linear systems\n", "abstract": " This work discusses the backward reachability of autonomous Max-Plus-Linear (MPL) systems, a class of continuous-space discrete-event models that are relevant for applications dealing with synchronization and scheduling. Given an MPL system and a continuous set of final states, we characterize and compute its “backward reach tube” and “backward reach sets, ” namely the set of states that can reach the final set within a given event interval or at a fixed event step, respectively. We show that, in both cases, the computation can be done exactly via manipulations of difference-bound matrices. Furthermore, we illustrate the application of the backward reachability computations over safety and transient analysis of MPL systems.", "num_citations": "16\n", "authors": ["1810"]}
{"title": "On the relationship between bisimulation and trace equivalence in an approximate probabilistic context\n", "abstract": " This work introduces a notion of approximate probabilistic trace equivalence for labelled Markov chains, and relates this new concept to the known notion of approximate probabilistic bisimulation. In particular this work shows that the latter notion induces a tight upper bound on the approximation between finite-horizon traces, as expressed by a total variation distance. As such, this work extends corresponding results for exact notions and analogous results for non-probabilistic models. This bound can be employed to relate the closeness in satisfaction probabilities over bounded linear-time properties, and allows for probabilistic model checking of concrete models via abstractions. The contribution focuses on both finite-state and uncountable-state labelled Markov chains, and claims two main applications: firstly, it allows an upper bound on the trace distance to be decided for finite state systems; secondly, it …", "num_citations": "15\n", "authors": ["1810"]}
{"title": "VeriSiMPL: Verification via biSimulations of MPL Models\n", "abstract": " VeriSiMPL (“very simple”) is a software tool to obtain finite abstractions of Max-Plus-Linear (MPL) models. MPL models (Sect. 2), specified in MATLAB, are abstracted to Labeled Transition Systems (LTS). The LTS abstraction is formally put in relationship with the concrete MPL model via a (bi)simulation relation. The abstraction procedure (Sect. 3) runs in MATLAB and leverages sparse representations, fast manipulations based on vector calculus, and optimized data structures such as Difference-Bound Matrices. LTS abstractions can be exported to structures defined in the PROMELA. This enables the verification of MPL models against temporal specifications within the SPIN model checker (Sect. 4). The toolbox is available at                                                                        http://sourceforge.net/projects/verisimpl/", "num_citations": "15\n", "authors": ["1810"]}
{"title": "Robust model predictive control through adjustable variables: an application to path planning\n", "abstract": " Robustness in model predictive control (MPC) is the main focus of this work. After a definition of the conceptual framework and of the problem's setting, we analyze how a technique developed for studying robustness in convex optimization can be applied to address the problem of robustness in the MPC case. Therefore, exploiting this relationship between control and optimization, we tackle robustness issues for the first setting through methods developed in the second framework. Proofs for our results are included. As an application of this robust MPC result, we consider a path planning problem and discuss some simulations thereabout.", "num_citations": "15\n", "authors": ["1810"]}
{"title": "Automated and sound synthesis of Lyapunov functions with SMT solvers\n", "abstract": " In this paper we employ SMT solvers to soundly synthesise Lyapunov functions that assert the stability of a given dynamical model. The search for a Lyapunov function is framed as the satisfiability of a second-order logical formula, asking whether there exists a function satisfying a desired specification (stability) for all possible initial conditions of the model. We synthesise Lyapunov functions for linear, non-linear (polynomial), and for parametric models. For non-linear models, the algorithm also determines a region of validity for the Lyapunov function. We exploit an inductive framework to synthesise Lyapunov functions, starting from parametric templates. The inductive framework comprises two elements: a learner proposes a Lyapunov function, and a verifier checks its validity - its lack is expressed via a counterexample (a point over the state space), for further use by the learner. Whilst the verifier uses the SMT solver Z3, thus ensuring the overall soundness of the procedure, we examine two alternatives for the learner: a numerical approach based on the optimisation tool Gurobi, and a sound approach based again on Z3. The overall technique is evaluated over a broad set of benchmarks, which shows that this methodology not only scales to 10-dimensional models within reasonable computational time, but also offers a novel soundness proof for the generated Lyapunov functions and their domains of validity.", "num_citations": "14\n", "authors": ["1810"]}
{"title": "Reachability computation for switching diffusions: Finite abstractions with certifiable and tuneable precision\n", "abstract": " We consider continuous time stochastic hybrid systems with no resets and continuous dynamics described by linear stochastic differential equations--models also known as switching diffusions. We show that for this class of models reachability (and dually, safety) properties can be studied on an abstraction defined in terms of a discrete time and finite space Markov chain (DTMC), with provable error bounds. The technical contribution of the paper is a characterization of the uniform convergence of the time discretization of such stochastic processes with respect to safety properties. This allows us to newly provide a complete and sound numerical procedure for reachability and safety computation over switching diffusions.", "num_citations": "14\n", "authors": ["1810"]}
{"title": "Correct-by-design output feedback of LTI systems\n", "abstract": " Current state-of-the-art correct-by-design controllers are designed for full-state measurable systems. This work extends the applicability of correct-by-design controllers to partially observable linear, time-invariant (LTI) models. Towards the certification of the synthesised controllers, approximate simulation relations are leveraged to attain a quantification for the accuracy of introduced approximations. Additionally, the robustness of the approach allows the extension to models with the presence of probabilistic disturbances on state transitions and on output measurements. In a case study from smart buildings we evaluate the new output-based correct-by-design controller on a physical system with limited sensor information.", "num_citations": "14\n", "authors": ["1810"]}
{"title": "Data-driven and model-based verification: A bayesian identification approach\n", "abstract": " This work develops a measurement-driven and model-based formal verification approach, applicable to systems with partly unknown dynamics. We provide a principled method, grounded on reachability analysis and on Bayesian inference, to compute the confidence that a physical system driven by external inputs and accessed under noisy measurements verifies a temporal logic property. A case study is discussed, where we investigate the bounded- and unbounded-time safety of a partly unknown linear time invariant system.", "num_citations": "14\n", "authors": ["1810"]}
{"title": "Irreversible prey diapause as an optimal strategy of a physiologically extended Lotka–Volterra model\n", "abstract": " We propose an optimal control framework to describe intra-seasonal predator–prey interactions, which are characterized by a continuous-time dynamical model comprising predator and prey density, as well as the energy budget of the prey over the length of a season. The model includes a time-dependent decision variable for the prey, representing the portion of the prey population in time that is active, as opposed to diapausing (a state of physiological rest). The predator follows autonomous dynamics and accordingly it remains active during the season. The proposed model is a generalization of the classical Lotka–Volterra predator–prey model towards non-autonomous dynamics that furthermore includes the effect of an energy variable. The model has been inspired by a specific biological system of predatory mites (Acari: Phytoseiidae) and prey mites (so-called fruit-tree red spider mites) (Acari …", "num_citations": "14\n", "authors": ["1810"]}
{"title": "Probabilistic invariance of mixed deterministic-stochastic dynamical systems\n", "abstract": " This work is concerned with the computation of probabilistic invariance (or safety) over a finite horizon for mixed deterministic-stochastic, discrete-time processes over a continuous state space. The models of interest are made up of two sets of (possibly coupled) variables: the first set of variables has associated dynamics that are described by deterministic maps (vector fields), whereas the complement has dynamics that are characterized by a stochastic kernel. The contribution shows that the probabilistic invariance problem can be separated into two parts: a deterministic reachability analysis, and a probabilistic invariance problem that depends on the outcome of the first. This technique shows advantages over a fully probabilistic approach, and allows putting forward an approximation algorithm with explicit error bounds. The technique is tested on a case study modeling a chemical reaction network.", "num_citations": "14\n", "authors": ["1810"]}
{"title": "Approximate abstractions of discrete-time controlled stochastic hybrid systems\n", "abstract": " This work presents a procedure to construct a finite abstraction of a controlled discrete-time stochastic hybrid system. The state space and the control space of the original system are partitioned by finite lattices, according to some refinement parameters. The errors introduced by the abstraction procedure can be explicitly computed, over time, given some continuity assumptions on the original model. We show that the errors can be arbitrarily tuned by selecting the partition accuracy. The obtained abstraction can be interpreted as a controlled Markov set-Chain, and can be used both for verification and control design purposes. We test the proposed technique to analyze a model from systems biology.", "num_citations": "14\n", "authors": ["1810"]}