{"title": "Recommender systems: an introduction\n", "abstract": " In this age of information overload, people use a variety of strategies to make choices about what to buy, how to spend their leisure time, and even whom to date. Recommender systems automate some of these strategies with the goal of providing affordable, personal, and high-quality recommendations. This book offers an overview of approaches to developing state-of-the-art recommender systems. The authors present current algorithmic approaches for generating personalized buying proposals, such as collaborative and content-based filtering, as well as more interactive and knowledge-based approaches. They also discuss how to measure the effectiveness of recommender systems and illustrate the methods with practical case studies. The final chapters cover emerging topics such as recommender systems in the social web and consumer buying behavior theory. Suitable for computer science researchers and students interested in getting an overview of the field, this book will also be useful for professionals looking for the right technology to build real-world recommender systems.", "num_citations": "1882\n", "authors": ["1504"]}
{"title": "Constraint-based recommender systems: technologies and research issues\n", "abstract": " Recommender systems support users in identifying products and services in e-commerce and other information-rich environments. Recommendation problems have a long history as a successful AI application area, with substantial interest beginning in the mid-1990s, and increasing with the subsequent rise of e-commerce. Recommender systems research long focused on recommending only simple products such as movies or books; constraint-based recommendation now receives increasing attention due to the capability of recommending complex products and services. In this paper, we first introduce a taxonomy of recommendation knowledge sources and algorithmic approaches. We then go on to discuss the most prevalent techniques of constraint-based recommendation and outline open research issues.", "num_citations": "357\n", "authors": ["1504"]}
{"title": "Consistency-based diagnosis of configuration knowledge bases\n", "abstract": " Configuration problems are a thriving application area for declarative knowledge representation that currently experiences a constant increase in size and complexity of knowledge bases. Automated support of the debugging process of such knowledge bases is a necessary prerequisite for effective development of configurators. We show that this task can be achieved by consistency-based diagnosis techniques. Based on the formal definition of consistency-based configuration we develop a framework suitable for diagnosing configuration knowledge bases. During the test phase of configurators, valid and invalid examples are used to test the correctness of the system. In case such examples lead to unintended results, debugging of the knowledge base is initiated. Starting from a clear definition of diagnosis in the configuration domain we develop an algorithm based on conflicts. Our framework is general enough …", "num_citations": "248\n", "authors": ["1504"]}
{"title": "UML as domain specific language for the construction of knowledge-based configuration systems\n", "abstract": " In many domains, software development has to meet the challenges of developing highly adaptable software very rapidly. In order to accomplish this task, domain specific, formal description languages and knowledge-based systems are employed. From the viewpoint of the industrial software development process, it is important to integrate the construction and maintenance of these systems into standard software engineering processes. In addition, the descriptions should be comprehensible for the domain experts in order to facilitate the review process.         For the realization of product configuration systems, we show how these requirements can be met by using a standard design language (UML-Unified Modeling Language) as notation in order to simplify the construction of a logic-based description of the domain knowledge. We show how classical description concepts for expressing configuration knowledge …", "num_citations": "229\n", "authors": ["1504"]}
{"title": "An integrated environment for the development of knowledge-based recommender applications\n", "abstract": " The complexity of the product assortments offered by on-line selling platforms makes selection a challenging task. Customers differ in respect to expertise and product knowledge, but intelligent recommender systems offer personalized dialogues that support the product-selection process. This paper describes CWAdvisor, a domain-independent, knowledge-based recommender environment that provides users with consistently appropriate solutions, identifies additional selling opportunities, and explains solutions. The discussion uses examples from several application domains to show how model-based diagnosis, personalization, and intuitive knowledge-acquisition techniques support customer-oriented sales dialogues. Experience obtained in industrial projects is reported, and successfully deployed recommender applications are evaluated.", "num_citations": "226\n", "authors": ["1504"]}
{"title": "Conceptual modeling for configuration of mass-customizable products\n", "abstract": " The development and maintenance of product configuration systems is faced with increasing challenges caused by the growing complexity of the underlying knowledge bases. Effective knowledge acquisition is needed since the product and the corresponding configuration system have to be developed in parallel. In this paper, we show how to employ a standard design language (Unified Modeling Language, UML) for modeling configuration knowledge bases. The two constituent parts of the configuration model are the component model and a set of corresponding functional architectures defining which requirements can be imposed on the product. The conceptual configuration model is automatically translated into an executable logic representation. Using this representation we show how to employ model-based diagnosis techniques for debugging faulty configuration knowledge bases, detecting infeasible …", "num_citations": "221\n", "authors": ["1504"]}
{"title": "Knowledge-based configuration: From research to business cases\n", "abstract": " Knowledge-based Configuration incorporates knowledge representation formalisms to capture complex product models and reasoning methods to provide intelligent interactive behavior with the user. This book represents the first time that corporate and academic worlds collaborate integrating research and commercial benefits of knowledge-based configuration. Foundational interdisciplinary material is provided for composing models from increasingly complex products and services. Case studies, the latest research, and graphical knowledge representations that increase understanding of knowledge-based configuration provide a toolkit to continue to push the boundaries of what configurators can do and how they enable companies and customers to thrive. Includes detailed discussion of state-of-the art configuration knowledge engineering approaches such as automated testing and debugging, redundancy detection, and conflict management Provides an overview of the application of knowledge-based configuration technologies in the form of real-world case studies from SAP, Siemens, Kapsch, and more Explores the commercial benefits of knowledge-based configuration technologies to business sectors from services to industrial equipment Uses concepts that are based on an example personal computer configuration knowledge base that is represented in an UML-based graphical language", "num_citations": "212\n", "authors": ["1504"]}
{"title": "An efficient diagnosis algorithm for inconsistent constraint sets\n", "abstract": " Constraint sets can become inconsistent in different contexts. For example, during a configuration session the set of customer requirements can become inconsistent with the configuration knowledge base. Another example is the engineering phase of a configuration knowledge base where the underlying constraints can become inconsistent with a set of test cases. In such situations we are in the need of techniques that support the identification of minimal sets of faulty constraints that have to be deleted in order to restore consistency. In this paper we introduce a divide and conquer-based diagnosis algorithm (FastDiag) that identifies minimal sets of faulty constraints in an overconstrained problem. This algorithm is specifically applicable in scenarios where the efficient identification of leading (preferred) diagnoses is crucial. We compare the performance of FastDiag with the conflict-directed calculation of hitting sets …", "num_citations": "182\n", "authors": ["1504"]}
{"title": "Recommender systems: An overview\n", "abstract": " Recommender systems are tools for interacting with large and complex information spaces. They provide a personalized view of such spaces, prioritizing items likely to be of interest to the user. The field, christened in 1995, has grown enormously in the variety of problems addressed and techniques employed, as well as in its practical applications. Recommender systems research has incorporated a wide variety of artificial intelligence techniques including machine learning, data mining, user modeling, case-based reasoning, and constraint satisfaction, among others. Personalized recommendations are an important part of many on-line e-commerce applications such as Amazon. com, Netflix, and Pandora. This wealth of practical application experience has provided inspiration to researchers to extend the reach of recommender systems into new and challenging areas. The purpose of the articles in this special issue is to take stock of the current landscape of recommender systems research and identify directions the field is now taking. This article provides an overview of the current state of the field and introduces the various articles in the special issue.", "num_citations": "166\n", "authors": ["1504"]}
{"title": "A framework for the development of personalized, distributed web-based configuration systems\n", "abstract": " For the last two decades, configuration systems relying on AI techniques have successfully been applied in industrial environments. These systems support the configuration of complex products and services in shorter time with fewer errors and, therefore, reduce the costs of a mass-customization business model. The European Union-funded project entitled CUSTOMER-ADAPTIVE WEB INTERFACE FOR THE CONFIGURATION OF PRODUCTS AND SERVICES WITH MULTIPLE SUPPLIERS (CAWICOMS) aims at the next generation of web-based configuration applications that cope with two challenges of today's open, networked economy:(1) the support for heterogeneous user groups in an open-market environment and (2) the integration of configurable subproducts provided by specialized suppliers. This article describes the CAWICOMS WORKBENCH for the development of configuration services, offering personalized user interaction as well as distributed configuration of products and services in a supply chain. The developed tools and techniques rely on a harmonized knowledge representation and knowledge-acquisition mechanism, open XMLbased protocols, and advanced personalization and distributed reasoning techniques. We exploited the workbench based on the real-world business scenario of distributed configuration of services in the domain of information processing-based virtual private networks.", "num_citations": "157\n", "authors": ["1504"]}
{"title": "Guest editors' introduction: Recommender systems\n", "abstract": " This special issue presents eight articles, five long and three short, on techniques to improve recommender systems. They cover improving such aspects as user interaction with recommenders, the quality of results presented to users, and user trust in presented recommendations. This article is part of a special issue on Recommender Systems.", "num_citations": "116\n", "authors": ["1504"]}
{"title": "Developing constraint-based recommenders\n", "abstract": " Traditional recommendation approaches (content-based filtering [48] and collaborative filtering[40]) are well-suited for the recommendation of quality&taste products such as books, movies, or news. However, especially in the context of products such as cars, computers, appartments, or financial services those approaches are not the best choice (see also Chapter 11). For example, apartments are not bought very frequently which makes it rather infeasible to collect numerous ratings for one specific item (exactly such ratings are required by collaborative recommendation algorithms). Furthermore, users of recommender applications would not be satisfied with recommendations based on years-old item preferences (exactly such preferences would be exploited in this context by content-based filtering algorithms).", "num_citations": "104\n", "authors": ["1504"]}
{"title": "The VITA financial services sales support environment\n", "abstract": " Knowledge-based recommender technologies support customers and sales representatives in the identification of appropriate products and services. These technologies are especially useful for complex and high involvement products such as cars, computers, or financial services. In this paper we present the VITA (Virtualis Tanacsado) financial services recommendation environment which has been deployed for the Fundamenta building and loan association in Hungary. On the basis of knowledge-based recommender technologies, VITA supports sales dialogs between Fundamenta sales representatives and customers interested in financial services (eg, loans). VITA has been developed and is maintained on the basis of an environment which supports automated testing and debugging of knowledge bases and recommender process definitions. Besides presenting the VITA environment we focus on reporting empirical results which clearly show the payoffs of the deployed application in terms of time savings in the conduction of sales dialogs.", "num_citations": "104\n", "authors": ["1504"]}
{"title": "A short survey of recommendation technologies in travel and tourism\n", "abstract": " Recommendation has a long history as a successful application area of Artificial Intelligence. The demand of e-commerce platforms (eg, amazon. com) to improve the accessibility of large product-and service assortments contributed to an increased popularity of recommendation technologies. Three basic technologies supporting the personalized recommendation of products and services are presented in this paper. In order to take into account the focus of this special issue, we provide a discussion of the application of those technologies in the tourism domain (eg, recommendation of travel destinations) with a special focus on mobile environments.", "num_citations": "99\n", "authors": ["1504"]}
{"title": "Plausible repairs for inconsistent requirements\n", "abstract": " Knowledge-based recommenders support users in the identification of interesting items from large and potentially complex assortments. In cases where no recommendation could be found for a given set of requirements, such systems propose explanations that indicate minimal sets of faulty requirements. Unfortunately, such explanations are not personalized and do not include repair proposals which triggers a low degree of satisfaction and frequent cancellations of recommendation sessions. In this paper we present a personalized repair approach that integrates the calculation of explanations with collaborative problem solving techniques. In order to demonstrate the applicability of our approach, we present the results of an empirical study that show significant improvements in the accuracy of predictions for interesting repairs.", "num_citations": "95\n", "authors": ["1504"]}
{"title": "Configuration knowledge representations for Semantic Web applications\n", "abstract": " Today's economy exhibits a growing trend toward highly specialized solution providers cooperatively offering configurable products and services to their customers. This paradigm shift requires the extension of current standalone configuration technology with capabilities of knowledge sharing and distributed problem solving. In this context a standardized configuration knowledge representation language with formal semantics is needed in order to support knowledge interchange between different configuration environments. Languages such as Ontology Inference Layer (OIL) and DARPA Agent Markup Language (DAML+OIL) are based on such formal semantics (description logic) and are very popular for knowledge representation in the Semantic Web. In this paper we analyze the applicability of those languages with respect to configuration knowledge representation and discuss additional demands on …", "num_citations": "95\n", "authors": ["1504"]}
{"title": "Recommender systems for health informatics: state-of-the-art and future perspectives\n", "abstract": " Recommender systems are a classical example for machine learning applications, however, they have not yet been used extensively in health informatics and medical scenarios. We argue that this is due to the specifics of benchmarking criteria in medical scenarios and the multitude of drastically differing end-user groups and the enormous context-complexity of the medical domain. Here both risk perceptions towards data security and privacy as well as trust in safe technical systems play a central and specific role, particularly in the clinical context. These aspects dominate acceptance of such systems. By using a Doctor-in-the-Loop approach some of these difficulties could be mitigated by combining both human expertise with computer efficiency. We provide a three-part research framework to access health recommender systems, suggesting to incorporate domain understanding, evaluation and specific …", "num_citations": "89\n", "authors": ["1504"]}
{"title": "Consumer decision making in knowledge-based recommendation\n", "abstract": " In contrast to customers of bricks and mortar stores, users of online selling environments are not supported by human sales experts. In such situations recommender applications help to identify the products and/or services that fit the user’s wishes and needs. In order to successfully apply recommendation technologies we have to develop an in-depth understanding of decision strategies of users. These decision strategies are explained in different models of human decision making. In this paper we provide an overview of selected models and discuss their importance for recommender system development. Furthermore, we provide an outlook on future research issues.", "num_citations": "84\n", "authors": ["1504"]}
{"title": "Human decision making and recommender systems\n", "abstract": " Recommender systems have already proved to be valuable for coping with the information overload problem in several application domains. They provide people with suggestions for items which are likely to be of interest for them; hence, a primary function of recommender systems is to help people make good choices and decisions. However, most previous research has focused on recommendation techniques and algorithms, and less attention has been devoted to the decision making processes adopted by the users and possibly supported by the system. There is still a gap between the importance that the community gives to the assessment of recommendation algorithms and the current range of ongoing research activities concerning human decision making. Different decision-psychological phenomena can influence the decision making of users of recommender systems, and research along these lines is …", "num_citations": "83\n", "authors": ["1504"]}
{"title": "Basic approaches in recommendation systems\n", "abstract": " Recommendation systems support users in finding items of interest. In this chapter, we introduce the basic approaches of collaborative filtering, content-based filtering, and knowledge-based recommendation. We first discuss principles of the underlying algorithms based on a running example. Thereafter, we provide an overview of hybrid recommendation approaches which combine basic variants. We conclude this chapter with a discussion of newer algorithmic trends, especially critiquing-based and group recommendation.", "num_citations": "81\n", "authors": ["1504"]}