{"title": "A web application to support telemedicine services in Brazil\n", "abstract": " This paper describes a system that has been developed to support Telemedicine activities in Brazil, a country that has serious problems in the delivery of health services. The system is a part of the broader Tele-health Project that has been developed to make health services more accessible to the low-income population in the northeast region. The HealthNet system is based upon a pilot area that uses fetal and pediatric cardiology. This article describes both the system’s conceptual model, including the tele-diagnosis and second medical opinion services, as well as its architecture and development stages. The system model describes both collaborating tools used asynchronously, such as discussion forums, and synchronous tools, such as videoconference services. Web and free-of-charge tools are utilized for implementation, such as Java and MySQL database. Furthermore, an interface with Electronic Patient …", "num_citations": "30\n", "authors": ["1376"]}
{"title": "Using function points in agile projects\n", "abstract": " Agile development has become increasingly common in the organizational software development environment. This paper examines whether function points would be compatible with story points on agile projects. Specifically, it addresses the question of whether function points are a relevant measure of velocity. Although any unit of measure can be used, this paper contrasts theoretical concepts about Story Points (SP) and function points (FP) as units for measuring size. It was also realized a statistical correlation between FP and SP using 2191 stories and 18 iterations in a Brazilian public agency. The conclusion drawn from this study was that function points, in that particular case, could be related with the initial value of the Story Points found after the planning poker.", "num_citations": "28\n", "authors": ["1376"]}
{"title": "Uma Proposta de um Ambiente de Implementação de Processos de Software\n", "abstract": " Ambientes de Desenvolvimento de Software Centrados no Processo possuem como uma de suas finalidades permitir que as etapas do ciclo de vida de processo de software (definição, simulação, execução e avaliação) possam ser automatizadas. Este artigo apresenta a arquitetura de implementação dos serviços contemplados para uma abordagem de automação e implementação de processos de software usando como base a especificação de projeto de um ambiente. Este processo deve ser instanciado a partir das características e propriedades que definem uma organização ou um domínio de um projeto específico. Este trabalho é uma pesquisa do programa de Doutorado do CIN/UFPE.", "num_citations": "27\n", "authors": ["1376"]}
{"title": "A comparative analysis between BPMN and SPEM modeling standards in the software processes context\n", "abstract": " The main objective of this paper is to analyze the representativeness of the SPEM (Software Process Engineering Metamodel Specification) and the BPMN (Business Process Modeling Notation) standards in the software processes modeling context. To perform this analysis, it was adopted a standard structure to define a software process based upon a process ontology. Then, the SPEM and BPMN standards notations and their semantically corresponding elements in the default process were identified. This mapping also includes components of the CMMI-DEV (Capability Maturity Model Integration for Development) and MR-MPS (Reference Model for Software Process Improvement) quality models. This was necessary to assist in the mapping evaluation through a case study which models the best practices of these quality models. Finally, we carried out an analysis of these standards through specific characteristics considered necessary to model and to represent software processes.", "num_citations": "26\n", "authors": ["1376"]}
{"title": "Introdução à Engenharia de Software e à Qualidade de Software\n", "abstract": " Atualmente, há cada vez mais sistemas controlados por software, fazendo com que a economia de praticamente todos os países seja muito dependente da qualidade dos softwares por eles usados, justificando um investimento significativo nesse setor.Há alguns anos atrás, desenvolvia-se software de uma maneira completamente artesanal. A partir de uma simples definição dos requisitos do software, partia-se imediatamente para a implementação do mesmo. Hoje em dia, ainda há muitas empresas que desenvolvem software dessa maneira, mas várias outras estão mudando suas formas de trabalho.", "num_citations": "24\n", "authors": ["1376"]}
{"title": "Agile software development and CMMI: What we do not know about dancing with elephants\n", "abstract": " In this paper we discuss how the merging of Agile Methodologies and Software Quality Models in same process today is ignoring many important aspects of both approaches. The inconsideration of these points results in a rigid integration of Agile and Quality Models that limits the full potential of their synergies. Ignoring such important items however does not necessarily means that they are not being utilized in the process, it normally indicates their utilization in an ad-hoc way. To explore this topic, we collected qualitative and quantitative data from literature and two Brazilian companies which work with agile and XP.", "num_citations": "21\n", "authors": ["1376"]}
{"title": "Adequação de processos para fábricas de software\n", "abstract": " Each day the research concerning Software Factories has increased, especially due to recent term growth in the world-wide scene. Indian Factories had become quality and success reference, making that countries like Brazil came to pursue a similar model and to search results so positive how much. However, to reach this standard, it must be clear that factors as processes, quality standards and manufacture solutions frameworks intervene directly with the final result. From this point of view, this paper presents a mapping of the software development process into the different boarding of Software Factories.Resumo. A cada dia as pesquisas acerca de Fábricas de Software vêm se intensificando, especialmente devido ao crescimento desta atividade no cenário mundial. Fábricas da Índia se tornaram referência de qualidade e sucesso, fazendo com que países como o Brasil viessem a perseguir um modelo semelhante e buscar resultados tão positivos quanto. Porém, para atingir este padrão, devemos estar cientes que fatores como processos, padrões de qualidade e frameworks de soluções fabris interferem diretamente no resultado final. Neste contexto, este artigo apresenta um mapeamento dos tipos de processo de desenvolvimento às diferentes abordagens de Fábricas de Software.", "num_citations": "21\n", "authors": ["1376"]}
{"title": "The impact of human factors on agile projects\n", "abstract": " This research aims to provide more evidences about the impact of human factors in agile software projects. In this light we have conducted a systematic literature review (SLR) to investigate which human factors impact agile projects and conducted a survey in software companies in order to verify their perceptions. Considering the SLR, we found 48 resulting studies where most cited human factors were: Communication (23 papers), Collaboration (6 papers) and Trust (8 papers). The survey was answered for 186 companies that consider communication the most important factor. So we conclude that Communication, Trust and Collaboration are important factors in projects using agile methods but others factors need to be more investigated due the perception of its value to the industry.", "num_citations": "17\n", "authors": ["1376"]}
{"title": "Mapeamento do modelo de Melhoria do Processo de Software Brasileiro (MPS. Br) para empresas que utilizam Extreme Programming (XP) como metodologia de desenvolvimento\n", "abstract": " Este artigo apresenta sugestões de modificações necessárias para que uma organização que possua Extreme Programming como metodologia de processo, possa se adequar ao nível G ou F do Modelo de Melhoria do Processo de Software Brasileiro. Neste caso a organização pode se beneficiar de um processo disciplinado, de fácil implantação e de retorno de resultados rápido dados por XP, ao mesmo tempo ter seu processo certificado por um modelo de qualidade consolidado (MPS. Br) a um custo muito baixo tornando-a competitiva no mercado nacional.", "num_citations": "16\n", "authors": ["1376"]}
{"title": "Software process improvement in agile software development a systematic literature review\n", "abstract": " It is recognized the relevance and importance that software process improvement (SPI) and agile development have gained in the field of software engineering. Both are approaches that increase the efficiency and effectiveness of a software development organization and to enhance software products. This paper aims to identify and characterize SPI in agile environments through a systematic literature review, including 423 papers published between2001 and March/2013. The selected papers were classified according to SPI aspects. Distinct approaches to Agile SPI were identified, the most common is to adapt traditional approaches of SPI in agile environments, but there are novel approaches such as improving people behavior or even improving practices being innovative in SPI consideration. Conducting SPI initiatives in agile environments is quite different from the traditional one, becoming necessary to adapt …", "num_citations": "15\n", "authors": ["1376"]}
{"title": "xspider_ml: Proposal of a software processes enactment language compliant with spem 2.0\n", "abstract": " SPEM (Software Process Engineering Metamodel Specification) is the software processes modeling standard defined by OMG (Object Management Group). However, the process enactment support provided by this standard has many deficiencies. Therefore, the main objective of this paper is to propose a language for software process enactment based upon SPEM 2.0 concepts. First, we will present a critical analysis of the SPEM standard approach for enactment. Then, we will present xSPIDER_ML, an enactment language, and describe its structure, components and associated rules. In order to evaluate the proposed language, a case study is performed through a RUP (Rational Unified Process) process instantiation. The language presented in this paper is part of a support set of tools for flexible software process enactment. Additionally, this set of tools is in compliance with software process quality models.", "num_citations": "14\n", "authors": ["1376"]}
{"title": "Assessing agile methods: an empirical study\n", "abstract": " Agile software processes emerged to address the issue of building software on time and within the planned budget. To adopt an agile process, it is imperative to analyze and evaluate its effectiveness in supporting high quality software development while complying with stringent time constraints. In this paper we describe an agile method for Web-based application development (XWebProcess) and an experiment conducted with a group of forty senior undergraduate students to assess the quality/speed effectiveness of the proposed method vis-à-vis the effectiveness of Extreme Programming (XP). The results have shown that the process proposed is equally agile when compared to XP, moreover, surveys conducted as part of the experiment pointed out that XWebProcess is more suitable to Web development in dimensions such as requirements gathering, user interface and navigation design, and software testing, therefore leading to better quality software.", "num_citations": "14\n", "authors": ["1376"]}
{"title": "Towards CMMI-compliant business process-driven requirements engineering\n", "abstract": " Modeling of business processes has been both recommended by academia and adopted by industry for elicitation of system requirements. Software process maturity models are also relevant in industry, and compliance with them is a major concern for many organizations. Therefore, business process-driven requirements engineering approaches should aim to comply with those maturity models, and how the approaches comply or not should be determined. However, no work has addressed these issues properly. This paper proposes a compliance analysis, based on a maturity model, of business process-based requirements engineering approaches as a first step to tackle these issues. This type of analysis allows practitioners to know if a specific approach meets their needs, and researchers to identify room for improvement in approaches in order to try to increase their industrial acceptance. As an example, the …", "num_citations": "13\n", "authors": ["1376"]}
{"title": "Towards a CMMI-compliant goal-oriented software process through model-driven development\n", "abstract": " The i* framework is a Goal-Oriented Requirement Engineering (GORE) approach that is widely applied at academic level. However, its application to industrial scenarios is limited. For the application of i* in concrete software development process, an alternative is to transform the defined requirements models into initial input models to be used by Model-Driven Development (MDD) approaches. However, this does not assure that the resultant development process will be sound enough to motivate real development companies to adopt this GORE solution. To tackle this issue, we propose the alignment of GORE and MDD solutions with software process maturity models, which are strongly adopted and applied by industry. In particular, we have considered an approach that integrates the i* framework into an industrially-applied MDD solution to obtain a development process (that goes from requirements to …", "num_citations": "13\n", "authors": ["1376"]}
{"title": "Análise da Relevância dos Tópicos e da Efetividade das Abordagens para o Ensino de Engenharia de Software\n", "abstract": " This paper presents the results of a survey on the adoption and learning of Software Engineering (SE) topics recommended by ACM/IEEE and Brazilian Society of Computer (SBC) curriculum guidelines. In addition, we researched which teaching approaches are adopted by professors and what these the students consider effective for their learning. This survey was conducted with 47 students and 23 professors of Computer undergraduate courses in 20 public and private education institutions in Brazil. The data analysis of this survey suggests that 6 SE knowledge units are considered most relevant, while other 4 units could be considered less relevant in the SE discipline curricula. Moreover, we identified that the students consider practices teaching approaches more effective to their learning.Resumo. Este artigo apresenta os resultados de um survey sobre a adoção e aprendizagem de tópicos de Engenharia de Software (ES) recomendados pelos currículos de referência da ACM/IEEE e SBC. Pesquisou-se, também, sobre quais abordagens de ensino são adotadas pelos professores e quais destas os alunos consideram efetivas para seu aprendizado. Este survey foi realizado com 47 alunos e 23 professores de cursos de graduação em Computação de 20 instituições de ensino públicas e privadas do Brasil. A análise dos dados do survey sugere que 6 unidades de conhecimento da ES são consideradas de maior relevância, enquanto outras 4 unidades poderiam ser consideradas menos relevantes nas ementas da disciplina de ES. Além disso, identificou-se que os alunos consideram abordagens de ensino práticas mais efetivas para o …", "num_citations": "11\n", "authors": ["1376"]}
{"title": "XWebProcess: Agile Software Development for Web Applications\n", "abstract": " Accelerating application development and reducing time to market is a highly valuable feature of a software process. For web-based applications, in particular, project development efforts often need to comply with severe time constraints imposed by the strategic business importance of the web. In this paper we describe XWebProcess, an agile process for web-based application development. XWebProcess is grounded on the principles underlying Extreme Programming and is aimed at building high quality web applications in a time effective way. XWebProcess’ agility has been compared to XP via an experimental setting which shows its superiority in supporting web development dimensions such as requirements gathering, user navigation design, and software testing, while retaining the agile property of Extreme Programming.", "num_citations": "11\n", "authors": ["1376"]}
{"title": "Incremental processing of Z specifications\n", "abstract": " Incremental processing of Z specifications | Proceedings of the IFIP TC6/WG6.1 Fifth International Conference on Formal Description Techniques for Distributed Systems and Communication Protocols: Formal Description Techniques, V ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsFORTE '92Incremental processing of Z specifications Article Incremental processing of Z specifications Share on Authors: Alexandre ML de Vasconcelos View Profile , John A. McDermid View Profile Authors Info & Affiliations FORTE '92: Proceedings of the IFIP TC6/WG6.Fifth International Conference on Formal Description Techniques for …", "num_citations": "11\n", "authors": ["1376"]}
{"title": "ToolManager: Uma Camada de Gerenciamento de Ferramentas CASE a um Ambiente Centrado no Processo\n", "abstract": " Historicamente, o aumento mais significativo de produtividade nos processos manufaturados e de construção ocorreu quando ferramentas poderosas foram incorporadas às habilidades humanas [10]. Similarmente, a produtividade dos projetos de engenharia é melhorada quando estes projetos estão suportados por sistemas CAD, que eliminam o trabalho tedioso dos desenhos e verificam os erros e omissões do projeto. Portanto, o suporte de ferramentas de automação na engenharia de software deve também conduzir à melhoria da produtividade do software. Desde o início dos anos 80, uma grande quantidade de ferramentas para o suporte ao desenvolvimento de software tem sido desenvolvida. O termo Computeraided Software Engineering (CASE) é atualmente utilizado para denominar esse suporte automatizado [1]. Por sua vez, Ambientes de Desenvolvimento de Software (ADS) são compostos de ferramentas. Estas ferramentas devem compartilhar informações sobre os vários projetos, pois os usuários necessitam utilizar em uma ferramenta informações geradas por outra ferramenta. Portanto, o ADS deve prover uma estrutura unificadora que integre suas ferramentas. Dessa forma, uma vez que as Ferramentas CASE se tornaram largamente disponíveis, uma camada de gerenciamento em torno da utilização dessas ferramentas a um ADS faz-se necessária a fim de juntas poderem trabalhar para melhor sustentar o processo de desenvolvimento de software [2]. Este artigo propõe a definição desta Camada de Gerenciamento de Ferramentas CASE tendo como base o Modelo de Referência NIST/ECMA. Nós analisamos as …", "num_citations": "10\n", "authors": ["1376"]}
{"title": "MetaMídia: um modelo de metadados na indexação e recuperação de objeto multimídia\n", "abstract": " Um banco de dados convencional é um repositório de dados, que contém valores numéricos, alfanuméricos, booleanos e datas. Um banco de dados multimídia, adicionalmente, contém imagens gráficas, clipes de vídeo, arquivos de som, textos, entre outros. O dado armazenado no banco de dados deve ser estruturado de tal modo que a informação desejada possa ser facilmente localizada e recuperada. A modelagem de dados é o termo usado para determinar quais dados devem ser armazenados e refletir os relacionamentos entre eles. A representação dos dados convencionais é feita essencialmente por atributos que descrevem objetos do mundo real, enquanto que dados multimídia são objetos do mundo real que são mantidos no banco de dados. A dificuldade em descrever (indexar) objetos multimídia com o objetivo de recuperá-los motivou o desenvolvimento desta tese. Um modelo de metadados é proposto para descrever objetos multimídia e permitir a indexação e recuperação desses objetos. O uso de metadados na descrição de objetos multimídia justifica-se pela dificuldade em efetuar casamento exato de padrões; dificuldade na pesquisa baseada em conteúdo, devido à análise em grande conjunto de dados: e quando a pesquisa baseada em conteúdo é possível de ser realizada, a mesma não pode ser feita de fato por razões de desempenho. A importância, relevância e originalidade desta proposta estão relacionadas aos seguintes itens: (i) integração de dados de diferentes bases, com tratamento uniforme, através do uso de uma base de metadados descritivos; (ii) descrição de objetos de multimídia, usando um …", "num_citations": "10\n", "authors": ["1376"]}
{"title": "The use of industry training strategies in a software engineering course: an experience report\n", "abstract": " The software industry presents dissatisfaction in relation to the level of recently graduated professionals. Consequently, software companies end up investing in the training of these professionals in order to develop skills related to the software development process. This paper presents an experience report of an adaptation of industry training practices in a course of Software Engineering (SE). Initially, we mapped SE topics of the ACM/IEEE curriculum guidelines to the specific practices of the CMMI-DEV model. Then, we carried out a survey of training strategies with 10 consultants in Software Process Improvement (SPI), who also act as SE professors. Finally, these strategies have been adapted and incorporated in a SE Course. We compared the impact of these learning strategies in relation to traditional teaching approaches, regarding the student perception of learning. We observed an increase of approximately …", "num_citations": "9\n", "authors": ["1376"]}
{"title": "Um Modelo Iterativo para o Ensino de Engenharia de Software Baseado em Abordagens Focadas no Aluno\n", "abstract": " A disciplina de Engenharia de Software (ES) possui uma ampla quantidade de tópicos teóricos que é melhor fixada na prática. No entanto, a maioria dos professores adotam abordagens tradicionais de ensino, como aulas expositivas. Mediante este contexto, este artigo apresenta um modelo iterativo baseado nas principais abordagens focadas no aluno que são aplicadas no ensino de ES. A avaliação deste modelo foi feita através de um painel de especialistas composto por 3 (três) professores/pesquisadores na área de ES. Este painel de especialistas considerou o modelo completo e consistente. A partir do uso deste modelo, espera-se que os alunos desenvolvam competências técnicas em ES no nível de aplicação.", "num_citations": "9\n", "authors": ["1376"]}
{"title": "Spider-pe: A set of support tools to software process enactment\n", "abstract": " In order to have a competitive software industry, it is essential to adopt standards and reference models of software processes quality. However, despite the growing adoption of standards and models, the number of organizations that adopt these is a small portion of the total population of software organizations. This paper presents a set of support tools to enactment of modeled processes in the Software Process Engineering Metamodel (SPEM). This set of support tools, called Spider-PE (Process Enactment), aims to assist software organizations in the implementation of the Capability Maturity Model Integration for Development (CMMI-DEV) and Reference Model of Software Process Improvement to Software (MR-MPS-SW) models. We expect Spider-PE to be more easily adopted by software organizations because it is based on models and standards largely accepted. Furthermore, this set of support tools adopts free technologies (non-proprietary) in order to reduce costs.", "num_citations": "9\n", "authors": ["1376"]}
{"title": "Modelagem de negócio na prática: Um método para suportar a compreensao e comunicaçao das necessidades dos negócios\n", "abstract": " Sistemas de informação e suporte à informação têm se tornado parte integrante das operações de negócio, pois tais sistemas podem criar novas oportunidades para as organizações, e tornar mais sólida sua margem de competitividade no mercado. A qualidade dos produtos e o prazo de entrega têm adquirido importância fundamental, no sentido de agregar valor às necessidades dos clientes. Isso exerce uma forte influência nas funcionalidades e flexibilidade dos sistemas de informação em atender as mudanças e possibilitar aderência às reais necessidades dos negócios. Modelos de negócio são abstrações de como os negócios funcionam. Eles detalham diferentes perspectivas e pontos de vista dos objetivos e visões dos negócios, incluindo elementos que estão atuando em harmonia com os negócios. Modelagem do domínio do negócio auxilia a explorar o entendimento do negócio e promove um significado para representar e capturar os objetivos, causas, oportunidades, processos e operações sem considerar as limitações e terminologias da Tecnologia da Informação, apoiando a comunicação e minimizando as discrepâncias existentes entre a visão dos desenvolvedores de sistemas e a real necessidade do negócio, vista pela ótica dos stakeholders. Diversas pesquisas têm investigado o esforço empreendido no desenvolvimento de sistemas de informação que muitas vezes não alcançam aderência e suporte adequado ao negócio. O entendimento de um domínio específico de uma aplicação e suas atividades, quando da formulação dos requisitos do sistema de informação, tem sido um problema essencial na engenharia de …", "num_citations": "8\n", "authors": ["1376"]}
{"title": "Using ISO 25040 standard for evaluating electronic health record systems.\n", "abstract": " Quality of electronic health record systems (EHR-S) is one of the key points in the discussion about the safe use of this kind of system. It stimulates creation of technical standards and certifications in order to establish the minimum requirements expected for these systems.[1] In other side, EHR-S suppliers need to invest in evaluation of their products to provide systems according to these requirements. This work presents a proposal of use ISO 25040 standard, which focuses on the evaluation of software products, for define a model of evaluation of EHR-S in relation to Brazilian Certification for Electronic Health Record Systems-SBIS-CFM Certification. Proposal instantiates the process described in ISO 25040 standard using the set of requirements that is scope of the Brazilian certification. As first results, this research has produced an evaluation model and a scale for classify an EHR-S about its compliance level in relation to certification. This work in progress is part for the acquisition of the degree of master in Computer Science at the Federal University of Pernambuco.", "num_citations": "7\n", "authors": ["1376"]}
{"title": "Design and empirical evaluation of an agile web engineering process\n", "abstract": " Web applications present important characteristics that must be properly addressed by software engineering methods, processes and techniques. In most cases, Web systems have to be delivered complying with severe time constraints due to its strategic nature for the client’s business. In this work we describe an agile process for Web-based application development, XWebProcess, which is based on Extreme Programming and aims at building high quality Web applications in a time effective way. The process is described using the SPEM meta-modeling language to facilitate its understanding and further improvements. An experiment was conducted to assess the time effectiveness and the quality of the proposed process. The results have shown that XWebProcess is equally agile when compared to Extreme Programming, moreover, surveys conducted as part of the experiment pointed out that XWebProcess is suitable to Web development in dimensions such as requirements gathering, user interface and navigation design, and software testing.", "num_citations": "7\n", "authors": ["1376"]}
{"title": "Frames: Uma proposta de framework para o ensino de tópicos da engenharia de software\n", "abstract": " A indústria de software apresenta insatisfação quanto ao nível de preparação dos profissionais recém-formados que atuam na área de Engenharia de Software (ES). Assim, as empresas investem na capacitação profissional para repasse de práticas específicas. Baseado em estratégias de capacitação da indústria e em métodos de ensino focados no aluno, este artigo apresenta uma proposta de framework para o ensino/aprendizado de ES. Espera-se que o uso deste framework possa ajudar a diminuir a carência na formação de profissionais e, consequentemente, atender a demanda da indústria de software.", "num_citations": "6\n", "authors": ["1376"]}
{"title": "FRAMES: Um Framework para o Ensino-Aprendizagem dos Tópicos de Engenharia de Software dos Currículos de Referência da ACM/IEEE e SBC\n", "abstract": " The ACM/IEEE curriculum guidelines defines a structure of topics and knowledge units to specify teaching guidelines and professional qualification for the Software Engineering (SE) area. However, it is impracticable to cover all content suggested by this curriculum, especially considering the hours available. This paper presents a framework to support the teaching and learning of SE topics recommended by the ACM/IEEE and Brazilian Computer Society (SBC) curriculum guidelines. This framework, called FRAMES, was defined from the results of a survey about the topics relevance and from a case study about the teaching approaches effectiveness applied in SE discipline. Both the methods were conducted with teachers and students. In addition, this framework incorporates industry training strategies identified from a survey with professionals that work in the SE area. The FRAMES was tested in a SE discipline for teaching the Software Process knowledge unit, and the results of this test are reported in this paper.Resumo. O currículo de referência da ACM/IEEE define uma estrutura de tópicos e unidades de conhecimento a fim de especificar diretrizes de ensino e formação profissional para a área de Engenharia de Software (ES). No entanto, é simplesmente inviável cobrir todo o conteúdo sugerido por este currículo, especialmente considerando a carga horária disponível. Este artigo apresenta um framework de apoio ao ensino-aprendizagem dos tópicos de ES recomendados pelos currículos de referência da ACM/IEEE e SBC. Este framework, denominado FRAMES, foi definido a partir dos resultados de um survey e um estudo de caso …", "num_citations": "6\n", "authors": ["1376"]}
{"title": "Um perfil de capacidade para a melhoria do processo em micro e pequenas organizações orientadas à manutenção e evolução de produtos de software\n", "abstract": " Manutenção e Evolução de Software é a atividade de ajustar, consertar ou melhorar algum software ou componente desenvolvido, portanto, possui características próprias que diferem das atividades convencionais de desenvolvimento de software. Esta é uma atividade crítica e seu custo varia de 50% a 80% do ciclo de vida do software. Desta forma, iniciativas de melhoria do processo para organizações orientadas à manutenção e evolução de produtos de software devem ser adaptadas para melhor alinhamento ao modelo e objetivos de negócio deste tipo de organização. Isto é ainda mais agravado quando se considera o contexto das organizações de micro e pequeno porte, onde as iniciativas de melhoria do processo têm que minimizar os efeitos limitantes do seu porte e maximizar os benefícios inerentes à inserção dos processos. Considerando este cenário, este trabalho propõe um Perfil de Capacidade de Processo (PCP), baseado nos modelos CMMI-DEV e CMMI-SVC, para apoiar a melhoria do processo em micro e pequenas organizações orientadas à manutenção e evolução de produtos de software. O PCP foi definido a partir de estudos de Mapeamento Sistemático da Literatura e estudos de Pesquisa-Ação na indústria. Este PCP agrega boas práticas do modelo de referência para melhoria dos serviços, apoiando a gestão de atividades de manutenção de software e serviços correlatos, em conjunto com boas práticas do modelo de referência para desenvolvimento de software, apoiando a gestão técnica dos produtos mantidos. Além dos resultados favoráveis identificados na execução da Pesquisa-ação em três …", "num_citations": "6\n", "authors": ["1376"]}
{"title": "A Continuous Improvement Model in ImPProS\n", "abstract": " The goal of this work is analyzing each one of the phases that composes the structure of the IDEAL (Initiating, Diagnosing, Establishing, Acting and Learning) model, as well as its activities and principles, and adapting for the characteristics that the software process implementation environment must have about the continuous software process improvement. This environment helps an organization in the gradual software process implementation, it is useful to supply automated support by means of an environment (ImPProS - gradual software process implementation environment) capable to support the phases that the specialized literature considers as necessary: software process definition, simulation, execution and evaluation (Oliveira et al., 2005). The ImPProS is a project of initiative the Center of Informatic at UFPE - Federal University of Pernambuco with the partnership at UNAMA - University of Amazonia …", "num_citations": "6\n", "authors": ["1376"]}
{"title": "Mapeando o Processo Unificado em Relação ao CMM–Nível 2\n", "abstract": " O desenvolvimento de software de alta qualidade tem sido uma preocupação constante da comunidade de engenharia de software. É bastante aceito que a melhoria do processo de desenvolvimento é uma das formas de melhorar a qualidade de produtos de software. O Processo Unificado [JAC99] tem sido apontado como um processo de desenvolvimento orientado a objetos bastante sistemático e bem definido. Objetivamos neste artigo, mapear este processo em relação ao modelo de avaliação de maturidade CMM (Capability Maturity Model) tendo o nível repetível (2) como foco. A partir deste mapeamento, apontamos as características e/ou princípios definidos no processo unificado que permitem satisfazer os requisitos necessários para obter o nível repetível de maturidade atribuído pelo CMM.", "num_citations": "6\n", "authors": ["1376"]}
{"title": "Engenharia de requisitos em projetos ágeis: uma revisão sistemática da literatura\n", "abstract": " Nos últimos anos, percebe-se um interesse crescente, da indústria e da academia, na utilização de metodologias ágeis como estratégia para minimizar problemas no desenvolvimento de software, tais como expectativas do cliente não atendidas e dificuldades em estimar prazo e orçamento. Apesar disso, pouco ainda se sabe sobre como a engenharia de requisitos está sendo conduzida em conjunto com essas metodologias. Nesse contexto, o objetivo desta pesquisa é investigar como a engenharia de requisitos e as metodologias ágeis vêm sendo utilizadas conjuntamente em projetos de desenvolvimento de software aplicados na indústria. Para isso, foi realizada uma revisão sistemática da literatura, que encontrou 24 estudos primários relevantes, cujos dados foram extraídos e sintetizados. Essa revisão identificou as técnicas e processos de engenharia de requisitos que estão sendo mais utilizados no contexto de desenvolvimento ágil e os principais problemas e limitações encontrados. A síntese dos dados apontou que a falta de envolvimento do usuário associada às características das atuais técnicas utilizadas para especificar requisitos e suas constantes mudanças são os principais desafios a serem superados.", "num_citations": "5\n", "authors": ["1376"]}
{"title": "Uma abordagem para melhoria do processo de software baseada em medição\n", "abstract": " Este artigo apresenta uma abordagem para Melhoria de Processo de Software, definida através da simplificação e adaptação do DMAIC, tendo como foco principal a melhoria baseada na medição dos processos. A abordagem visa trabalhar os processos prioritários para a organização e relevantes para os clientes, utilizando ciclos de melhoria menores, com intuito de obter resultados rápidos e significativos.", "num_citations": "5\n", "authors": ["1376"]}
{"title": "Using the IDEAL model for the construction of a deployment framework of IT Service Desks at the Brazilian Federal Institutes of Education\n", "abstract": " Brazilian Federal Institutes of Education, Science and Technology (FIs) have expanded through multicampi structure, which has led to profound changes in their administrative and academic organization. As consequence of this expansion, the demand for services, systems, and information technology (IT) solutions has increased; and the support service’s provision has become much more relevant. However, a diagnosis of the quality of the IT support services, performed with the FI’s CIOs, has shown that the service’s provision in these institutions is below required. There are several problems encountered, such as political and cultural issues, lack of stakeholder involvement, insufficient staff, resistance to change, lack of priorities, excessive demands, lack of knowledge of best practices, and the use of inappropriate tools. So, there is a clear need to develop a proposal to help the FIs to improve their IT …", "num_citations": "4\n", "authors": ["1376"]}
{"title": "Um panorama sobre o uso de práticas DevOps nas indústrias de software\n", "abstract": " Hoje as organizações de T.I. estão enfrentando um sério desafio, por um lado temos mercados cada vez mais competitivos, com mudanças quase que rotineiras nos softwares e uma variedade imensa de dispositivos e sistemas operacionais; por outro, os sistemas ficam cada vez mais complexos, integrados a outros serviços e exigindo um alto grau de confiabilidade e disponibilidade dos mesmos, exigindo assim um processo de implantação cada vez mais eficiente e robusto. Nos últimos anos o termo DevOps – colaboração entre desenvolvimento e operação - e suas práticas foram amplamente usados e discutidos sob diferentes aspectos. Assim como no movimento ágil, DevOps também nasceu na indústria e a partir da necessidade da mesma. Por mais que várias organizações já adotem práticas que ficaram conhecidas como DevOps, seu uso ainda não é prescritivo, existindo assim uma variedade de diferentes manifestações de uso em termos de definição e padrão dentre as organizações. Diante disso, esta dissertação teve por objetivo realizar um mapeamento sistemático da literatura e um survey em busca do movimento DevOps, áreas de concentração dos estudos, os principais autores da área e as principais práticas e formas de uso de DevOps nas organizações. Como contribuição, esta pesquisa identificou que dentre as principais áreas de DevOps podem-se destacar (i) entrega, (ii) integração, (iii) e testes contínuos, além da (vi) automação da infraestrutura. Como principais práticas foram possíveis destacar: (a) implantações através de máquinas virtuais, (b) visibilidade do pipeline de implantação, (c) processos robustos de …", "num_citations": "4\n", "authors": ["1376"]}
{"title": "Uma Apoio Sistematizado à Implementação do Processo de Desenvolvimento de Requisitos do MPS. BR e CMMI a partir do Uso de Ferramentas de Software Livre.\n", "abstract": " Para atender as demandas de mercado e garantir competitividade, a busca por qualidade tem se tornado objetivo estratégico de muitas empresas, logo, a procura por modelos de qualidade torna-se necessária. Neste contexto, este trabalho apresenta uma proposta de apoio ferramental para a implementação do processo de Desenvolvimento de Requisitos constante nos programas MPS. BR e CMMI utilizando exclusivamente ferramentas de software livre, analisando a aderência aos programas de maturidade e procurando diminuir o tempo e custo de implementação do mesmo.", "num_citations": "4\n", "authors": ["1376"]}
{"title": "Avaliaçao da Qualidade de um Produto de Software\n", "abstract": " A avaliação de produto de software com base em normas de qualidade tem sido uma das formas empregadas por organizações que produzem ou adquirem software para aferirem a qualidade de seus produtos. Assim, para que a avaliação seja mais efetiva, é importante a utilização de modelos de qualidade que permitam estabelecer e avaliar requisitos de qualidade, e também que o processo de avaliação seja bem definido e estruturado [12].", "num_citations": "4\n", "authors": ["1376"]}
{"title": "Um processo de recomendação de modelos de maturidade em gerenciamento de projetos\n", "abstract": " A busca pela excelência no gerenciamento de projetos é uma meta perseguida por muitas empresas. Um dos instrumentos utilizados para tal fim, e que tem apelo popular crescente, são os modelos de maturidade em gerenciamento de projetos. À medida que o interesse por estes modelos cresceu, vários foram criados e muitas vezes as organizações não conhecem as possibilidades existentes, nem sabem por qual modelo optar. Assim sendo, este artigo apresenta e compara os seis modelos de maturidade em gerenciamento de projetos mais referenciados na literatura e propõe um processo de recomendação capaz de indicar quais modelos são mais adequados a um dado cenário de avaliação. Para validar este processo, um estudo de caso foi realizado no âmbito de uma empresa multinacional de telecomunicações.", "num_citations": "4\n", "authors": ["1376"]}
{"title": "Modelo de maturidade em testes com foco em ambientes de testes heterogêneos\n", "abstract": " No passado as grandes empresas confiavam a qualidade dos seus sistemas aos seus fornecedores (sejam internos ou externos). Novas tecnologias estão surgindo, processos de desenvolvimento estão mais maduros, mas os fornecedores ainda pecam na qualidade do produto. Falhas no desenvolvimento dos sistemas, cronogramas estourados e defeitos em produção são os principais problemas que prejudicam todo o planejamento financeiro e estratégico de uma organização [TER_01]. Boas práticas em testes de software contribuem para a melhoria da qualidade e redução dos custos dos produtos finais, pela diminuição de retrabalho nos estágios posteriores de testes, durante a implantação e na manutenção. Modelos de maturidade para o desenvolvimento de software, como CMMi vêm sendo utilizados em larga escala para amenizar estes problemas, entretanto esses modelos não tratam com grande atenção as atividades relacionadas a testes. Em resposta a esta deficiência foram criados modelos de maturidade para os processos de testes. Entre eles, o TMM, Testing Maturity Model [TMM_01], o TIM, Test Improvement Model [TIM_01] e o TPI, Test Process Improvement [TPI_01]. Um novo modelo de maturidade em teste, fruto deste trabalho tem como objetivo cobrir as ausências dos modelos citados. A principal delas é falta de detalhes sobre ambientes de teste. O TMM-e (enviroment) como será chamado é adequado para empresas de grande porte onde encontramos uma variedade de plataformas, linguagens de programação e dispositivos todos funcionando de forma integrada. O mesmo servirá de referência para estas …", "num_citations": "4\n", "authors": ["1376"]}
{"title": "Modelo Comportamental de um Ambiente de Implementação de Processo de Software\n", "abstract": " Ambiente de Engenharia de Software Centrado no Processo (PSEE-Process-centered Software Engineering Environment) tem como um dos seus propósitos prover que as fases do ciclo de vida de um processo de software (definição, simulação, execução e avaliação) possam ser automatizadas. Este trabalho apresenta um fluxo de serviços para a automação e implementação de processos de software, usando como base a especificação inicial de um ambiente. Este processo deve ser instanciado a partir de características e propriedades que definem uma organização ou um domínio específico de projeto de software.", "num_citations": "4\n", "authors": ["1376"]}
{"title": "Análise do impacto do gerenciamento de riscos no sucesso de projetos: um estudo de caso em uma organização de desenvolvimento de software\n", "abstract": " A falha na condução dos projetos de software é um assunto que sempre foi uma preocupação para a engenharia de software. Muitas são as iniciativas em melhoria de processo no desenvolvimento de software e gerenciamento de projetos que buscam reduzir estas falhas. Os projetos de software são complexos por natureza e estão sujeitos a uma série de incertezas. Conhecer estas variáveis pode ajudar aos gestores a tomar decisões de forma eficaz e conduzir o projeto ao sucesso. Mesmo com todas as iniciativas para que os projetos tenham sucesso, as incertezas sempre existirão. Essa constatação faz com que a área de gerência de riscos tenha uma importância significativa. O objetivo deste trabalho foi realizar uma análise do impacto do gerenciamento dos riscos no sucesso de projetos de software. A implantação das melhorias no processo de gerenciamento de risco objetivaram também atender aos modelos de maturidade CMMI e MPS.BR. Para isso, foi realizado um estudo de caso em uma organização de desenvolvimento de software. Durante o estudo de caso, a criação de um repositório de riscos organizacionais foi realizada e alimentada com cinco projetos. Um dos desafios deste trabalho foi definir conceitos e medidas objetivas para avaliar os eventos associados com o gerenciamento de riscos e com o sucesso de projetos. Uma avaliação preliminar em 15 (quinze) projetos finalizados foi realizada para entender como o gerenciamento dos riscos de cada um desses projetos, impactou no seu sucesso.", "num_citations": "3\n", "authors": ["1376"]}
{"title": "Um Mapeamento Sistemático sobre Abordagens de Apoio à Rastreabilidade de Requisitos no Contexto de Projetos de Software\n", "abstract": " The Requirements Traceability is seen as a quality factor with regard to software development, being present in standards and quality models. In this context, several techniques, models, frameworks and tools have been used to support it. Thus, the purpose of this paper is to present a systematic mapping carried out in order to find in the literature approaches to support the requirements traceability in the context of software projects and make the categorization of the data found in order to demonstrate, by means of a reliable, accurate and auditable method, how this arca has developed and what are the main approaches are used to implement it.", "num_citations": "3\n", "authors": ["1376"]}
{"title": "The confidence of agile assessment methods in the context of software process improvement\n", "abstract": " With the advent of CMMI in the late 1990s, software companies tried to use a kind of score to rank themselves in the market. Being a CMMI level five company for a long time represented the epitome of highly qualified company. This phenomenon is also emerging in the agile software development with the emergence of methods such as Nokia or comparative test agility. This paper presents an analysis of how these methods are placed in the context of agile software development and its contribution to the improvement of software process in the same context from a case study developed in real companies.", "num_citations": "3\n", "authors": ["1376"]}
{"title": "Towards CMMI-compliant MDD Software Processes\n", "abstract": " (MDD) approaches have taken an important role in the quality improvement of software products. These approaches perform the automatic compilation of high-abstraction models to generate the final application code. In this way, MDD approaches aim at reducing development costs as well as increasing productivity, portability, interoperability, and ease of software evolution; ie, achieving higher product quality. A major obstacle for MDD approaches to be massively adopted by industry is their lack of alignment to well-defined quality models for software processes. We advocate that performing a compliance analysis, based on a software process quality model, is the first step to deal with this obstacle. In this paper, we analyze the degree of compliance of an industrially applied MDD approach with the CMMI-DEV quality model. In particular, we determine those characteristics that meet the technical solution process area of CMMI-DEV and identify improvement opportunities to obtain a proper alignment of the MDD approach with this model.", "num_citations": "3\n", "authors": ["1376"]}
{"title": "Uma proposta de acordo de nível de serviço para fábricas de software\n", "abstract": " As iniciativas de fábrica de software brasileiras têm se multiplicado e apresentado um crescimento considerável nos últimos anos, especialmente devido a fatores competitivos, uma vez que o próprio mercado nacional tem se tornado mais exigente em termos de qualidade do produto e de redução de custos. Associado à organização operacional e funcionamento interno da fábrica de software, um outro fator extremamente relevante no cenário atual é o relacionamento e manutenção do cliente, ou seja, a imagem da fábrica para o mundo exterior. A revolução no relacionamento entre prestadores e contratantes de serviços em geral, enfatizada na última década, potencializou a importância do fluxo de informações, fazendo com que as empresas busquem otimizar o seu operacional, aumentando fatores como a qualidade, a satisfação do cliente e a lucratividade, mantendo ainda assim uma redução nos custos. É neste contexto que se insere o Acordo de Nível de Serviço (ANS), instrumento utilizado para gerir o relacionamento entre cliente e fornecedor, embasado em indicadores de desempenho, que oferece visibilidade ao cliente e confere confiabilidade ao fornecedor, agregando valor na gestão de serviços de TI de uma forma geral. Assim, este trabalho apresenta uma proposta de Acordo de Nível de Serviço para utilização no relacionamento com Fábricas de Software do tipo programa, considerando as especificidades deste relacionamento e sugerindo alguns indicadores importantes neste contexto. A proposta foi gerada a partir de pesquisa bibliográfica acerca do tema e observação de um estudo de caso realizado em uma empresa …", "num_citations": "3\n", "authors": ["1376"]}
{"title": "A Process Meta-Model in a Gradual Software Process Implementation Environment\n", "abstract": " PSEE-Process-centered Software Engineering Environment-PSEE has one of its intentions to provide that phases of the software process life cycle (definition, simulation, enacting and evaluation) can be automatized. This work presents the structure and the automation of a software process meta-model capable to group terminologies of processes based on quality models/norms and to help in the implementation and refinement these types of processes. This implementation must be made from characteristics and properties that define an organization or a specific domain of software project. The meta-model services were automatized trough a tool and the description of them can be found in this paper.", "num_citations": "3\n", "authors": ["1376"]}
{"title": "Towards Reconciling Quality and Agility in Web Application Development.\n", "abstract": " Delivering high quality web applications complying with severe project delivery time constraints is still an elusive goal for a software process. In many software projects, development teams often resort to\" short cuts\" in the software development process avoiding recommended software process disciplines to speed up delivery. The usual side-effects of this ad-hoc approach are low software quality and high maintenance costs. In this paper we empirically address the tension between quality and agility (speed) in web application development describing a set of software disciplines that were added to Extreme Programming to improve web software quality without sacrificing development agility.", "num_citations": "3\n", "authors": ["1376"]}
{"title": "Incremental type-checking in Z\n", "abstract": " Over the last decade, formal methods have become progressively more widely used to counteract the problems of software development. Nowadays, a relatively large number of formal methods, or notations, are available and Z is one of the most widely used. However, Z is not so widespread in the industrial community as it is in the academic one.The provision of automated tools, such as syntax checkers and type checkers, is essential to the successful application of Z on industrial scale problems. The use of these tools during the software specification phase reduces the possibility of errors, and consequently improves software quality and productivity. In this paper we propose a hypertext-like tool to support the development of Z specifications. The main characteristic of the tool is the ability to process specifications on an incremental basis. In this context, the most fundamental aspect of the work is the development of an incremental polymorphic typechecker for Z specifications.", "num_citations": "3\n", "authors": ["1376"]}
{"title": "A adesão do processo de contratação de soluções de tecnologia da informação pelos órgãos ligados à administração pública federal adotando análise documental\n", "abstract": " Pesquisas apontam irregularidades encontradas pelos órgãos ligados a Administração Pública Federal Brasileira (APF) na utilização do processo de contratação de soluções de TI. Diante das irregularidades encontradas, o Tribunal de Contas da União (TCU), recomendou a elaboração da Instrução Normativa IN/SLTI/MPOG 04, contendo diretrizes para o processo de contratação de soluções de TI. A cada dois anos, o TCU conduzuma pesquisa, para avaliar a maturidade da governança corporativa de TI da APF, com o objetivo de identificar possíveis dificuldades e problemas em relação a diversos aspectos ligados a TI, incluindo os processos de contratação previstos na IN/SLTI/MPOG 04/2014. Com base nos resultados reportados pelo TCU e, utilizando a técnica de análise documental, este trabalho visaavaliar a utilização e/ou adesão da IN/SLTI/MPOG 04/2014pelos órgãos ligados a Administração Pública Federal Brasileira (APF) nos processos de contratação de soluções de TI.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Um modelo iterativo para o ensino de Engenharia de Software baseado em abordagens focadas no aluno e práticas de capacitação da indústria\n", "abstract": " Tipicamente, os profissionais da indústria de software cursam graduação na área de Computação a fim de se prepararem para atuar na área de ES. Apesar disso, a indústria de software apresenta insatisfação quanto ao nível de preparação dos profissionais recém-formados. Essa carência na formação pode ser resultado de uma educação inadequada. Existe um consenso entre os pesquisadores da área de que abordagens práticas são as mais indicadas para o ensino de ES. No entanto, nem todos os cursos oferecem essa oportunidade aos alunos de realizarem atividades práticas. Nesse contexto, o principal objetivo dessa pesquisa é apoiar a adoção de abordagens práticas no processo de ensino-aprendizagem de ES a fim de que os alunos desenvolvam determinadas competências técnicas em nível de aplicação. Para tal, definiu-se um modelo iterativo que integra as principais abordagens focadas no aluno que são aplicadas no ensino de ES. Como diferencial, incorporou-se nesse modelo práticas de capacitação adotadas pela indústria de software adaptadas para o contexto acadêmico. A avaliação da documentação e usabilidade desse modelo foi feita através de um painel de especialistas composto por três professores doutores que atuam na área de ensino de ES. Posteriormente, realizou-se um experimento controlado em duas turmas de graduação com o intuito de comparar o uso do modelo iterativo e as abordagens tradicionais de ensino em relação ao desenvolvimento de competências em ES. Os dados foram coletados através de questionários estruturados e analisados usando ANOVA. O painel de especialistas …", "num_citations": "2\n", "authors": ["1376"]}
{"title": "A Set of Support Tools to Software Process Appraisal and Improvement in Adherence to CMMI-DEV\n", "abstract": " Adopting standards and reference models for quality software processes is essential to ensure a competitive software industry. However, despite the increasing number of standards and models, only a small proportion of software organizations adopt them. This paper presents a set of support tools for software process appraisal and improvement through their adherence to the CMMI-DEV (Capability Maturity Model Integration for Development) model. The purpose of this set of support tools is to assist software organizations in the implementation of the CMMI-DEV model. It is expected that these tools will be readily adopted by software organizations because they are based on models and standards that are generally accepted. Furthermore, this set of support tools employs free (non-proprietary) technologies to reduce costs.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Engenharia de requisitos em projetos ágeis: um mapeamento sistemático baseado em evidências da indústria\n", "abstract": " Nos últimos anos, percebe-se um interesse crescente na utilização de metodologias ágeis como estratégia para minimizar os problemas no desenvolvimento de software. Apesar disso, pouco ainda se sabe sobre como a engenharia de requisitos está sendo conduzida em conjunto com essas metodologias. Neste contexto, o objetivo desta pesquisa é investigar como a engenharia de requisitos e as metodologias ágeis vêm sendo utilizadas conjuntamente na prática em projetos de desenvolvimento de software aplicados na indústria. Para isso, foi realizado um mapeamento sistemático da literatura que encontrou 24 estudos primários relevantes, cujos dados foram extraídos e sintetizados. Esse mapeamento identificou as técnicas e processos de engenharia de requisitos que estão sendo mais utilizados no contexto de desenvolvimento ágil e quais os principais problemas e limitações encontradas. Após a execução do mapeamento, verificou-se que a falta de envolvimento do usuário associada às características das atuais técnicas utilizadas para especificar requisitos e suas constantes mudanças são os principais desafios a serem superados.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Uma Análise da Literatura Especializada sobre a Aplicação de Métodos Ágeis no Contexto da Área de Processo de Solução Técnica constante em Modelos de Qualidade para Processo de …\n", "abstract": " Esse trabalho tem o objetivo de apresentar o resultado da revisão da literatura especializada no contexto da aplicação dos métodos ágeis para apoio à implementação dos modelos de qualidade CMMI e MPS. BR, especificamente para a área de processo de Solução Técnica e o processo de Projeto e Construção do Produto. O resultado da pesquisa é a identificação de quais métodos ágeis são aplicadas no contexto dos modelos de qualidade. Além disso, buscou-se identificar práticas ágeis que apoiem a implementação desses processos.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Aplicação de Pontos por Função em Projetos que Usam Métodos Ágeis\n", "abstract": " Contexto: O desenvolvimento ágil tem se tornado cada vez mais comum no ambiente de desenvolvimento de software, contudo estimativas de tamanho em projetos de software que usam metodologias ágeis são feitas de maneira diferente das realizadas em projetos tradicionais.Objetivo: Este artigo apresenta o progresso de uma análise comparativa entre as diferentes abordagens de aplicação da Análise de Pontos de Função (APF) em projetos de software que fazem uso de alguma metodologia ágil existente no mercado.Método: Através de uma revisão sistemática, serão discutidos, de forma comparativa e funcional, os conceitos de metodologia ágil e de APF e seu trabalho em conjunto para a resolução de problemas em medição de software. Por meio de uma pesquisa experimental, empírica e controlada, as propostas existentes na literatura são avaliadas no intuito de testar sua aplicação e analisar seus resultados.Resultados esperados: Espera-se desta forma, definir os pontos de convergência e de divergências entre as metodologias ágeis e os elementoschave da APF; identificar as possibilidades de aplicação desta integração e apresentar uma análise detalhada sobre as propostas de aplicação da APF em projetos de software com metodologias ágeis existentes na literatura.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Modelo de Contratação de Soluções de TI da Administração Publica Federal: Uma Análise Qualitativa para Identificar a Maturidade e Aderência aos Modelos CMMI-ACQ, CMMI-DEV e …\n", "abstract": " Diversas iniciativas têm surgido na busca da melhoria de processos de software (MPS) nos últimos anos. Parte dessas iniciativas é orientada por normas, modelos e padrões de qualidade, tendo como objetivo estabelecer melhores práticas para orientar a definição de processos e apoiar a avaliação da maturidade e capacidade das organizações no desenvolvimento de seus produtos. Estas normas e modelos definem melhores práticas e descrevem um caminho para a evolução e melhoria de processos, partindo desde a sua concepção, até chegarem a processos controlados e maduros em uma organização de software. Apesar do surgimento de diversas iniciativas de melhoria de processos de software, quando o assunto se refere ao processo de contratação de soluções de tecnologia da informação (TI) pela Administração Pública Federal (APF), a sua aplicação no contexto das organizações públicas brasileiras encontra diversos obstáculos. Dentre estes obstáculos, destacam-se a complexidade dos processos decorrentes da legislação brasileira e a contínua fiscalização dos órgãos de controle do governo federal. Para superar esses obstáculos, o Tribunal de Contas da União (TCU), recomendou a elaboração da Instrução Normativa SLTI/MP 04/2010, contendo diretrizes para o processo de contratação de soluções de TI. Além disso, foram definidos processos, atividades, artefatos e papéis obrigatórios, compondo, assim, o modelo de contratação de soluções de TI (MCTI) da Administração Pública Federal (APF). Este trabalho tem como objetivo geral identificar a maturidade e a aderência do modelo MCTI em relação aos modelos …", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Aspectos de Retorno de Investimento em Melhoria de Processo de Software\n", "abstract": " The Brazilian companies of Software search to conquer each more time the national and international market, that are more competitive. The viable strategy is to invest in the increase of the quality and productivity that are the weapons of this battle. The focus of this work is to investigate significant factors to measure the Return on Investment (ROI) of Software Process Improvement (SPI). With the objective to consider a Framework consisting of phases based in the concepts ROI Methodology, and using indicating used by David Rico in ROI of SPI and an election of metrics used for MPS.Resumo. As empresas de Software Brasileiras buscam conquistar cada vez mais o mercado nacional e internacional, os quais estão cada vez mais competitivos. A estratégia viável é investir no aumento da qualidade e produtividade. O foco desse trabalho é investigar fatores significantes para mensurar o Return on Investment (ROI) em Melhoria de Processo de Software (MPS). Com o objetivo de propor um Framework constituído por fases baseado nos conceitos da ROI Methodology, utilizando indicadores utilizados por David Rico em ROI of SPI e uma seleção de medições utilizadas para MPS.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "ProEvaluator: Uma Ferramenta para Avaliação de Processos de Software\n", "abstract": " Em dezembro de 2003, a SOFTEX (Associação para Promoção da Excelência do Software Brasileiro) lançou o MPS. BR (Modelo para Melhoria de Processo de Software Brasileiro). Para verificar se as organizações atendem aos requisitos do modelo criado, foi definido o MA-MPS (Método de Avaliação do MPS. BR). Este artigo apresenta uma ferramenta para apoiar as atividades descritas no método MA-MPS. A ferramenta permite o cadastro de evidências da execução do processo, atribuição de conceitos aos resultados esperados dos processos e de seus atributos e, a partir daí, calcula automaticamente o nível de maturidade da organização e emite um relatório final com os resultados da avaliação.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "FROISPI–Framework Return on Investment of Software Process Improvement\n", "abstract": " As empresas de Software Brasileiras buscam conquistar cada vez mais o mercado nacional e internacional, os quais estão cada vez mais competitivos. A estratégia viável é investir no aumento da qualidade e produtividade, que são as armas dessa batalha. O foco desse trabalho é investigar fatores significantes para mensurar o Return on Investment (ROI) em Melhoria de Processo de Software (MPS). Com o objetivo de propor um Framework constituído por fases baseado nos conceitos de Business Process Management (BPM), ROI Methodology, IDEAL e DMAIC, utilizando indicadores utilizados por David Rico em ROI of SPI e uma seleção de medições utilizadas para MPS.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Achieving Software Quality Certifications Through Agile Software Development\n", "abstract": " Quality is, recognizably, a competitive advantage in the software industry. Seeking this differential, many software companies have begun programs to increase their quality in order to reach a level of excellence in their development processes. However, reaching this high level of quality has not been sufficient for these companies to attract new clients. As a result, most of them have considered achieving certifications such as CMMI to demonstrate their quality level and be recognized in the market. In parallel, Agile Software Development has emerged as a new way to develop software, and its use is increasing quickly. On the other hand, there are few registered cases of companies using agile methods to achieve these certifications. This paper shows how agile methods can help to achieve these certifications, and the difficulties that companies choosing to use them will face.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Mapeamento dos Conceitos do guia do CMMI em notações do SPEM no contexto da Definição do Processo de Software\n", "abstract": " Este trabalho propõe a modelagem dos conceitos do guia do CMMI (Maturity Levels, Discipline, Specific Goals, e outros) a partir das notações definidas pelo SPEM, como base para a modelagem de processos de software definidos em um Ambiente de Desenvolvimento de Software. Este mapeamento visa capturar informações sobre a aderência e compatibilidade do CMMI no SPEM, capturando os componentes do processo de software e os seus relacionamentos baseando-se na análise deste modelo. A motivação deste trabalho visa à composição de um meta-modelo de processo de software que possibilite definições de processo aderentes ao CMMI e SPEM. Uma área de processo do CMMI foi usada para a representação deste mapeamento.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Suporte à engenharia de requisitos no desenvolvimento distribuído de software\n", "abstract": " Nos últimos anos, o software tem se transformado em elemento fundamental e fator decisivo para aumentar a competitividade das empresas. Há mais ou menos uma década atrás, algumas empresas começaram a testar o desenvolvimento distribuído visando atingir baixos custos e utilizar recursos capacitados. Existem alguns fatores que impulsionaram esse movimento (Herbsleb e Moitra, 2001):", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Utilização de Métricas em uma Ferramenta de Apoio à Melhoria Contínua de Processos de Software\n", "abstract": " Nas ultimas décadas, ocorreu um grande aumento na complexidade dos produtos de software desenvolvidos, demandando equipes de desenvolvimento cada vez maiores e degradando a qualidade dos produtos gerados e a produtividade das empresas de software. Diante deste cenário, para permanecerem de forma competitiva no mercado, as empresas desenvolvedoras de software tiveram que investir cada vez mais na qualidade dos produtos resultantes e na produtividade de suas equipes de desenvolvimento, dando origem aos processos de software.Os processos de software obtiveram tamanha importância que as empresas passaram a investir na qualidade do próprio processo. Aumentando-se a qualidade de um processo, espera-se aumentar também a qualidade dos produtos gerados através desse processo. Várias abordagens e modelos de melhoria de processos de software foram surgindo …", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Um Framework para definição de processos de testes de software que atenda ao nível 3 do TMM-e\n", "abstract": " Nas ultimas décadas, ocorreu um grande aumento na complexidade dos produtos de software desenvolvidos, exigindo equipes cada vez maiores e mais especializadas e ambientes mais complexos, dificultando a produção e degradando a qualidade dos produtos gerados e a produtividade das empresas de software. Por estes motivos, as empresas de software têm se preocupado e investido cada vez mais recursos na tentativa de garantia da qualidade de seus produtos. Um grande número de empresários reconhece que investimentos em qualidade produzem resultados positivos, não fazer nada é que custa caro, de tal modo que os prejuízos causados pela imagem de uma empresa associada à má qualidade podem ser incalculáveis.Diante deste cenário, e dada à importância do software no trabalho diário dos diversos segmentos e os elevados custos de atendimento associados às suas falhas, são …", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Definiçãoo e Implementação de um Modelo de Rastreamento para Engenharia de Requisitos Distribuída\n", "abstract": " This paper presents the definition of a requirements traceability model that deals with specific aspects of Requirements Engineering in Distributed Software Development. This model was validated through the construction of a requirements management tool and the accomplishment of a case study, which assists to demonstrate the applicability of this model in real project software.Resumo. Este artigo apresenta a definição de um modelo de rastreamento de requisitos que trata aspectos específicos da Engenharia de Requisitos em ambientes de Desenvolvimento Distribuído de Software. Esse modelo foi validado através da construção de uma ferramenta de gerenciamento de requisitos e a realização de um estudo de caso, o qual auxilia a demonstrar a aplicabilidade do modelo em um projeto de software real.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Integrando Groupware e Gerenciamento de Requisitos no Suporte à Engenharia de Requisitos Distribuída.\n", "abstract": " Esse artigo propõe a integração de groupware e gerenciamento de requisitos para permitir o registro e manutenção de rationale sobre requisitos e dessa forma, aumentar a compreensão destes em Desenvolvimento Distribuído de Software (DDS), além de ampliar a coordenação e comunicação entre os participantes. Para isso, uma análise de ferramentas de gerenciamento de requisitos existentes foi realizada para verificar a viabilidade da proposta e um protótipo foi desenvolvido e integrado a um groupware open source existente. Um estudo de caso é apresentado para validar a proposta.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Suporte a engenharia de requisitos com equipes distribuídas através de contexto\n", "abstract": " This paper proposes context insertion in a requirements engineering process with distributed teams. So, it presents a distributed requirements engineering process and a traceability model based on this process. The traceability model can help developers to insert context in a collaborative requirements engineering applications. The negotiation model was validated through a prototype based on IBIS framework and integrated with RequisitePro.Resumo. Esse artigo propõe a utilização de contexto no processo de engenharia de requisitos com equipes distribuídas. Para isso, é apresentado um processo para engenharia de requisitos distribuída e um modelo de rastreamento baseado nesse processo, o qual pode auxiliar desenvolvedores a inserir contexto em aplicações colaborativas para engenharia de requisitos. O modelo de negociação foi validado através da implementação de um protótipo baseado no framework IBIS e integrado ao RequisitePro.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Uma Extensão do Fluxo de Análise e Projeto do RUP para o Desenvolvimento de Aplicações WEB\n", "abstract": " A Internet tem se mostrado como um dos mais efetivos e atrativos meios para realização de transações comerciais, possibilitando tanto a divulgação, quanto a negociação e disponibilização de bens e serviços. Além disto, devido em grande parte a globalização da economia mundial, cada vez mais as empresas estão migrando seus sistemas corporativos para plataformas baseadas principalmente na Web. Diante deste panorama, hoje em dia existe uma demanda bastante significativa pelo desenvolvimento de aplicações para Web. Entretanto, do ponto de vista da Engenharia de Software, as aplicações Web possuem características específicas que as diferenciam das aplicações tradicionais, e que precisam ser tratadas no processo de desenvolvimento de uma forma disciplinada. Para tanto, fazem-se necessárias adaptações em processos de desenvolvimento de software já existentes para um melhor atendimento na construção de aplicações Web. Visando atender as necessidades de desenvolvimento específicas para aplicações Web, este trabalho apresenta uma adequação da metodologia genérica de desenvolvimento de software RUP (Rational Unified Process), mais especificamente no fluxo de Análise e Projeto, tendo em vista que a etapa de análise e projeto é onde há uma maior diferença no desenvolvimento de aplicações Web com relação a aplicações tradicionais. Este trabalho apresenta também um estudo de caso para validação da efetividade da proposta de extensão do fluxo de Análise e Projeto do RUP para o desenvolvimento mais apropriado de aplicações Web", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Descrevendo um modelo de informação de vídeo através de uma linguagem de especificação orientada a objetos\n", "abstract": " Este artigo apresenta a descrição do modelo de informação de vídeo do sistema multimídia OVID (Object-oriented Vídeo Information Database)[OT97]. Tal descrição é apresentada na linguagem de especificação MooZ (Modular object-oriented Z)[MCS93], uma extensão orientada a objetos de Z [Spi92]. O desenvolvimento da especificação formal tem como objetivo melhorar o entendimento de tal modelo, mostrando a utilização de metadados (dados descritivos) para descrever cenas de vídeos.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Hipertexto: O Projeto do Sistema H\n", "abstract": " Este artigo apresenta alguns conceitos básicos de hipertexto, alguns dos principais progressos realizados na área, no mundo, até agora, e algumas idéias sobre o que poderá vir no futuro próximo. Em particular, o texto é uma introdução ao trabalho sendo realizado no Grupo de Linguagens e Engenharia de Software (Lin ES) do Departamento de Informática da U FPE. O principal projeto em andamento na UFPE visa definir e implementar um sistema de hipertexto cuja fundamental aplicação deverá ser a gerência de processos de desenvolvimento de software. A curto prazo, um sistema de hipertexto voltado a aplicações de documentação eletrônica já está sendo implementado. Tal sistema é parcialmente descrito neste artigO'.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "Adaptando o RUP para o Desenvolvimento de Sistemas de Informação Web\n", "abstract": " This paper proposes an adaptation of the Rational Unified Process (RUP) to be used in the development of Web Information Systems (WIS). We analyze the activities which must be included or instantiated in the Process’ workflows, so that it can be properly used in the development of this kind of systems.", "num_citations": "2\n", "authors": ["1376"]}
{"title": "An Empirical Study on the Use of Student-Focused Approaches in the Software Engineering Teaching\n", "abstract": " The software industry is not satisfied with the preparation level of newly graduated professionals in Computing undergraduate courses. There is a predominance of traditional approaches to the Software Engineering (SE) teaching which proved to be inefficient, because they focus on the content from the professors viewpoint. This research aims to investigate if the use of student-focused approaches in the SE teaching can develop more technical competencies to apply in industry than when traditional approaches are applied. For this, an iterative model has been defined to integrate the main student-focused approaches and a controlled experiment was carried out in four undergraduate courses. The data were collected from structured interviews with students and analyzed using ANOVA. The results showed no significant statistical difference between student-focused and traditional teaching approaches in the …", "num_citations": "1\n", "authors": ["1376"]}
{"title": "A multi-model approach for provision of services the information technology for federal public administration Brazilian\n", "abstract": " Os Serviços de Tecnologia da Informação (TI) têm se proliferado no mundo pela emergente demanda da sociedade em utilizar os recursos tecnológicos, como meio de solucionar problemas. Dentro destes serviços, tem-se a oferta de soluções requeridas pelo cliente, que demandam dos provedores de serviços, entregas rápidas em níveis de qualidade cada vez mais desafiadores. Logo, a Prestação de Serviços de TI tem se tornado uma área cada vez mais crítica. Normas, Modelos e Padrões tem sido utilizado com o objetivo de estruturar os processos e as atividades da Prestação de Serviços de TI. Neste contexto, a Administração Pública Federal Brasileira (APF), aparece como o maior consumidor de serviços e soluções de TI no Brasil. Para isto, a APF estabeleceu processos na Instrução Normativa IN/SLTI/MPOG 04/2014 e Guia de Contratação de Soluções de TI baseados na Lei 8.666/93, para guiar as …", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Agile Testing in Brazil: A Systematic Mapping\n", "abstract": " The increasing adoption of agile methodologies is changing the landscape of software testing. Both the manifold of testing techniques and the agile mindset have shown as challenges for professionals. In this context, this work conducted a systematic mapping of studies published in Brazil, with the goal of gathering evidence on the use of agile testing practices in the country. Using the Agile Testing Quadrants as classification model, testing techniques, their benefits and challenges were identified. This systematic mapping revealed that, despite the quality improvements and reduction of costs brought by the use of agile testing techniques, learning curves and lack of management cooperation introduce significant difficulties for the full adoption of agile testing.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Using Function Points in Agile Projects: A Comparative Analysis Between Existing Approaches\n", "abstract": " Agile Software Development has become increasingly common in the software development environment, but effort estimates in software projects using Agile methodologies are made differently from those made in traditional way projects. This paper presents a comparative analysis of the different approaches of applying Function Point Analysis (FPA) in software projects that make use of some existing agile methodologies. Through an experimental, empirical and controlled research, the existing proposals in the literature in order to test your application and analyze its results were evaluated. The results showed that in the context studied, the approach Agile Estimation Using Functional Metrics was best suited up.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "QoS-TI: Um Framework Adaptável para Qualidade do Serviço de Suporte de TI nos Institutos Federais\n", "abstract": " Este artigo apresenta o QoS-TI, um framework que tem por objetivo apoiar a implantação ou a melhoria de Centrais de Serviços de TI nos Institutos Federais (IFs). Estruturado através de um ciclo de vida baseado no modelo IDEAL e de um Toolbox de processos, o framework QoS-TI incorpora diversas práticas identificadas nos modelos de qualidade e serviços ITIL, ISO 9001, ISO 20000, CMMI Services e MR-MPS-SV, e fornece uma abordagem focada em “como fazer”, ao invés de “o quê fazer”. Após o seu desenvolvimento, o framework foi avaliado por especialistas dos IFs. Os aspectos avaliados receberam opiniões positivas da maioria dos especialistas.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Fatores críticos de sucesso na implantação de uma central de serviços de TI nas Instituições Federais de Ensino Superior\n", "abstract": " A Tecnologia da Informação tem se apresentado como um dos principais componentes estratégicos utilizados pelas organizações, auxiliando os seus processos da gestão, com o objetivo de otimizar negócios, viabilizar metas institucionais e auxiliar no relacionamento com clientes e usuários. Em virtude disso, a gestão da Tecnologia da Informação nas Instituições Federais de Ensino Superior (IFES), objeto desta pesquisa, vem passando por uma grande reformulação, na qual o foco não se limita apenas ao atendimento às exigências dos órgãos de controle, que continuam atuando fortemente no sentido da adequação e conformidade a leis, normas, ferramentas e práticas por eles orientadas, e que interferem diretamente nas atividades de gestão de TI neste setor, mas também existe uma preocupação cada vez maior com o valor e a satisfação percebidos pelos usuários/clientes dessas instituições com os serviços de TI fornecidos. Dentro desta perspectiva, em relação ao gerenciamento de serviços de TI, a existência de uma Central de Serviços de TI é recomendada como boa prática por organismos internacionais, como forma de assegurar o suporte necessário à área de TI, permitindo também atuar de forma proativa, em relação ao atendimento das demandas da organização, participando e contribuindo verdadeiramente da geração de valor. Diante deste contexto, o objetivo deste estudo é realizar uma pesquisa que apresente os desafios envolvidos na Implantação de uma Central de Serviços de TI, no contexto de uma Instituição Federal de Ensino Superior, procurando identificar os fatores críticos de sucesso envolvidos, com seus …", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Explorando a gestão de contratos com fornecedores no contexto de CMMI-DEV e metodologias ágeis: a identificação de um gap\n", "abstract": " A subcontratação de software é um processo de aquisição que significa delegar, por meio de contrato, o desenvolvimento de parte, ou totalidade do produto junto a fornecedores externos ao projeto. Vários estudos obtiveram sucesso com o uso da subcontratação nesse contexto. No entanto, as organizações continuam com problemas no planejamento, execução e gestão dos fornecedores dentro do processo de aquisição no desenvolvimento de software. Este estudo conduziu uma revisão sistemática da literatura com o intuito de explorar o atual estado da investigação sobre a relação entre Metodologias Ágeis e CMMI-DEV, no contexto da gestão do acordo de fornecedores. A revisão revelou a escassez de dados empíricos sobre a temática, apontando a necessidade de mais pesquisas sobre a combinação dessas abordagens.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Proposta de uma Abordagem para Prestação de Serviços de Tecnologia da Informação à Administração Pública Federal por Empresas Brasileiras\n", "abstract": " Os serviços de Tecnologia da Informação (TI) têm se proliferado no mundo pela emergente demanda da sociedade em utilizar os recursos tecnológicos, como meio de solucionar problemas. Dentro desses serviços, tem-se a oferta de soluções solicitadas pelo cliente, que demandam dos provedores de serviços, entregas rápidas em níveis de qualidade cada vez mais desafiadores. Logo, a prestação de serviços de TI tem se tornado uma área cada vez mais crítica. Diversas Normas, Modelos e Padrões tem sido utilizados, com o objetivo de estruturar os processos e as atividades da Prestação de Serviços de TI. Neste contexto, a Administração Pública Federal Brasileira (APF), aparece como o maior consumidor de serviços e soluções de TI no Brasil. Para isto, a APF estabeleceu processos na Instrução Normativa IN/SLTI/MPOG 04/2014 e Guia de Contratação de Soluções de TI. Estes processos foram criados baseados na Lei 8.666/93, com o objetivo de guiar as contratações de soluções, produtos e serviços de TI no Brasil. Este trabalho apresenta a Proposta de Uma Abordagem para Prestação de Serviços de Tecnologia da Informação à Administração Pública Federal por Empresas Brasileiras, com o objetivo de minimizar os potenciais conflitos existentes entre a APF e a Indústria Brasileira de Software e Serviços.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "A qualitative analysis of the adhrence between the Information Tecnology Solution Aquisition Guide, for Brazilian Federal Public Administration and, the CMMI models.\n", "abstract": " quality models and standards guide Software Process Improvement Initiatives. Usually aiming to establish the best practices to instruct the definition of processes and support organizational assessment of the maturity and capability level. However, despite these initiatives, the best practices application in Brazilian public organizations is impaired by various obstacles regarding the process of Contracting IT solutions by the Federal Public Administration (APF), the main contractor of software and services in Brazil. Among these obstacles the ones that stand out are process complexity and the continuous supervision of control bodies. In order to minimize these obstacles, the court Union Accounts (TCU), recommended the establishment of the Normative Instruction SLTI/MPOG 04/2014, containing guidelines for the acquirement of IT Solutions and a Guide for Contracting IT Solutions (GCSTI). This work aims at identifying the maturity and adherence of GCSTI relative to CMMI models. To achieve this goal, defined and carried out a method of mapping between GCSTI and CMMI models. The survey results show the maturity and adherence to CMMI models based on procedures defined in GCSTI.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Fatores que influenciam na migração do MPS. BR para o CMMI nas empresas de software brasileiras\n", "abstract": " A indústria de software no Brasil investe cada vez mais em melhoria dos seus processos, sendo o modelo MPS uma opção economicamente viável. Contudo, muitas empresas nacionais migram sua avaliação do MPS para o CMMI. Neste contexto, esta pesquisa busca identificar os fatores que influenciam a migração do modelo MPS para o CMMI. Foram analisadas as listas das empresas avaliadas pelo MPS e CMMI, também, executada umarevisão não sistemática da literatura e duas pesquisas de campo. Foram encontradas evidências de migração dos níveis iniciais do MPS para o CMMI e os fatores que envolvem a internacionalização e exigência dos clientes foram apontados como motivadores principais.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Software Process Education Oriented to Software Industry Needs.\n", "abstract": " Typically, software professionals are trained in undergraduate courses as a way of preparing to the industry. However, there is a shortage of qualified professionals in relation to Software Process field in the Brazilian industry. Thus, software companies have to provide skills related to the Software Process areas through training. To address this problem, this PhD research aims to analyze the recommendations for the Software Process education in curriculum guidelines of computer courses in Brazil. In addition, we will examine which of these recommendations are relevant to software professionals. Furthermore, we propose a teaching approach that aims to meet the goals of these curriculum guidelines through models and quality standards for the process and software product widely adopted in the Brazilian software industry.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Aplicação de pontos por função em projetos que usam métodos ágeis: uma análise comparativa entre abordagens existentes\n", "abstract": " O desenvolvimento ágil tem se tornado cada vez mais comum no ambiente de desenvolvimento de software. Contudo estimativas de esforço em projetos de software que usam metodologias ágeis são feitas de maneira diferente das realizadas em projetos que usam metodologias tradicionais. Com base nesses problemas e com respeito ao grau de precisão de estimativa de esforço, essa dissertação apresenta uma análise comparativa entre as abordagens Extending Function Point Analysis, Function Point Analysis and Cost Estimation in An Agile Development Environment e Agile Estimation Using Functional Metrics. Através de um mapeamento sistemático, foram identificadas as formas de estimativas de esforço existentes na literatura e, a partir do mapeamento, foram escolhidas três abordagens que utilizam Pontos de Função como base para realizar estimativas. Por meio de uma pesquisa experimental e controlada com três cenários distintos, as abordagens foram avaliadas no intuito de testar sua aplicabilidade e analisar seus resultados. No mapeamento sistemático foram identificados 2572 estudos. Entre estes, 40 estudos primários que passaram por uma avaliação da qualidade foram incluídos para serem analisados em profundidade. Os resultados do experimento mostraram, que no contexto estudado, a abordagem Function Point Analysis and Cost Estimation in An Agile Development Environment não se adequou bem e teve os piores resultados em todos os cenários. Nos dois primeiros cenários, as abordagens Extending Function Point Analysis e Agile Estimation Using Functional Metrics se mostraram com resultados bem …", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Spider-MSControl: A Tool for Support to the Measurement Process using GQIM Approach\n", "abstract": " This paper presents a software tool called Spider-MsControl, a desktop solution that operates in a clientserver system and aims to help the measurement process, with respect to the measures definition, collection, analysis and monitoring activities, following practices defined in GQIM approach. The software follows all practices, expected results and activities set for the Measurement process of CMMI-DEV and MR-MPS-SW models and the ISO/IEC 12207 norm, and other good practices guides in this discipline.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Fatores que influenciam na migração do MPS. BR para o CMMI nas empresas de software brasileiras\n", "abstract": " As organizações que desenvolvem software no Brasil investem cada vez mais na melhoria dos seus processos, sendo o modelo MPS.BR uma opção economicamente viável. Contudo, apesar das características facilitadoras e de ações promovidas pela Softex para difundir o modelo, muitas empresas nacionais migram sua avaliação do MPS.BR para o CMMI. Neste contexto, esta pesquisa busca identificar os fatores que influenciam a migração do modelo MPS.BR para o CMMI. Os métodos de coleta de dados utilizados para entender o fenômeno da migração foram: o cruzamento da lista de avaliações das empresas do MPS.BR e CMMI, revisão não sistemática da literatura, pesquisa de campo aplicada junto ao grupo de implementadores e avaliadores do MPS.BR e outra realizada nas empresas que realizaram o processo de migração entre os modelos citados. Os dados quantitativos extraídos foram tratados por métodos estatísticos descritivos e testes não-paramétricos e os qualitativos foram analisados por meio da codificação de categorias prevista pela Teoria Fundamentada em Dados. Foram encontradas evidências de migração dos níveis iniciais do MPS.BR para o CMMI, sendo os fatores que envolvem mercado externo, reconhecimento internacional do modelo e marketing, apontados como os principais motivadores desse processo. Porém, fatores relacionados a aspectos técnicos da empresa e da implantação do modelo não foram apontados como motivadores da migração. O fomento na implantação do MPS.BR apenas em níveis iniciais de maturidade e a otimização da monitoria e controle dos processos podem ter …", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Integração de Práticas Ágeis: Uma abordagem para melhorar a qualidade de especificações de software em projetos mobile\n", "abstract": " The requirements engineering has been identified as a source of problems in adopting agile approaches. This research proposes an exploratory study in the industry. The aim is to investigate how the requirements engineering has been used in agile projects. In this context, a case study will be conducted in companies that develop mobile applications in Pernambuco. Then a new approach for specifying requirements in mobile projects will be defined, integrating the best practices of agile and adhering to CMMI-DEV. A controlled experiment will be performed to assess the quality and productivity of the proposed approach.Resumo. A engenharia de requisitos vem sendo apontada como uma das fontes de problemas na adoção das abordagens ágeis. Esta pesquisa propõe um estudo exploratório na indústria que tem por objetivo investigar como a engenharia de requisitos vem sendo utilizada em projetos ágeis e qual a qualidade das especificações geradas. Nesse contexto, será realizado um estudo de caso em empresas que desenvolvem aplicativos mobile em Pernambuco. Em seguida será elaborada uma nova abordagem para especificação de requisitos em projetos mobile, integrando as melhores práticas das metodologias ágeis e aderente ao CMMI-DEV. Para avaliar a qualidade e a produtividade da abordagem proposta será realizado um experimento controlado.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Spider-PE: Uma Ferramenta de Apoio à Implementação da Capacidade do MR-MPS Nível F e CMMI-DEV Nível 2\n", "abstract": " This paper presents a tool for the process enactment, called Spider-PE, which aims to support the implementation of the MR-MPS Level F and the CMMI-DEV Level 2 Capability. It is expected that this tool be able to assist the software development organizations which aims to accelerate the implementation and appraisal of these quality models, as well reduce the costs of these process, that occurs due to the use of free technologies.Resumo. Este artigo apresenta uma ferramenta de execução de processo, denominada Spider-PE, que objetiva apoiar a implementação da Capacidade do MR-MPS Nível F e CMMI-DEV Nível 2. Espera-se que esta ferramenta possa auxiliar as organizações desenvolvedoras de software que desejam agilizar a implementação e avaliação destes modelos de qualidade e reduzir os custos destes processos devido a proposta adotar tecnologias livres.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Balanced Testing Scorecard-A Model for Evaluating and Improving the Performance of Software Testing Houses.\n", "abstract": " Many companies have invested in the process of testing to improve the test team's performance. Although Testing Maturity Models aim at tackling this issue, they are unpopular among the many of the highly competitive and innovative companies because they encourage displacing the true goals of the mission of “achieving a higher maturity level”. Moreover, they generally have the effect of blinding an organization to the most effective use of its resources, as they focus only on satisfying the requirements of the model. This article defines the Balanced Testing Scorecard (BTSC) model. This aims to evaluate and improve the test team’s performance. The model, based on Balanced Scorecard and Testing Maturity Models, is capable of aligning clients’ and financial objectives with testing maturity goals in order to improve the test team's performance and client’s performance. The model was based on and developed from the specialized literature and was applied in a software testing house as a case study.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Proevaluator: uma ferramenta de apoio à avaliação de processos de software com foco em modelos de maturidade\n", "abstract": " Com intuito de aperfeiçoar o processo de desenvolvimento de software e obter produtos com os níveis desejados de qualidade com prazo e custo, nas duas últimas décadas ocorreu uma mudança significativa de enfoque com relação a software. Esta mudança intensificou a pesquisa sobre processos de software, sendo propostas várias normas e modelos para auxiliar na definição e melhoria dos processos de software. Neste contexto Oliveira propôs, em (Oliveira, 2005), a definição de um ambiente para a implementação de processo de software, o ImPProS (Ambiente de Implementação Progressiva de Processos de Software), com os objetivos de possibilitar: a especificação dos processos de acordo com o domínio do projeto específico e das características da organização; a instanciação do processo de software de acordo com as propriedades de cada projeto; sua simulação a partir dos parâmetros de configuração (prazo, pressões, custo, recursos, etc.); uma execução (automação) mais próxima do que se espera para um processo organizacional; e uma avaliação a partir da coleta de métricas desta execução. Este trabalho descreve a evolução da ferramenta de avaliação de processos de software do ambiente ImPPros, a ProEvaluator 2.0, que contém modelos genéricos de melhoria e avaliação de processos de software", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Abordagem para Implantação de Testes baseada no TMM e em Práticas Ágeis\n", "abstract": " Este artigo descreve uma abordagem para implantação de testes de software baseada no TMM e em práticas ágeis com o objetivo de viabilizar a melhoria e implantação de processos de testes em empresas que necessitam de resultados rápidos e com poucos investimentos. Para a validação da abordagem, ela foi aplicada em duas empresas de desenvolvimento de software. Este artigo apresenta a abordagem desenvolvida, uma aplicação prática e as conclusões.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Uma abordagem para implantação de testes baseada em metodologias ágeis\n", "abstract": " Nas últimas décadas, indústrias de software têm investido um esforço substancial na melhoria da qualidade de seus produtos. Pensando nisso, muitas empresas estão buscando implantar ou melhorar seus processos de teste. A melhoria de processo de testes é uma instanciação da melhoria de processos. Com o intuito de facilitar a melhoria de processo de software, diversos modelos têm surgido, tais como IDEAL [McFeeley, 1996], ISO/IEC 15504 [ISO 15504, 2005] e Pro2Pi [Salviano, 2006]. Existem também modelos de referência específicos para definição de requisitos necessários a um Processo de Testes, como: TMM [Burnstein, 2003], TIM [Ericson, 1996] e TPI [Koomen, 1999]. No entanto, estes modelos não fornecem diretrizes para a sua implantação em uma organização de testes. A melhoria de processo de testes é uma instanciação da melhoria de processos. Embora tenham surgido tais modelos de melhoria de processo, bem como os modelos de referência para processos de testes, e haja resultados encorajadores, grande parte da indústria de software ainda apresenta muitas dificuldades em realizar um programa de melhoria de processo de testes de software efetivo. Isto ocorre por uma série de motivos, dentre os quais, podemos destacar o fato de que estes modelos são  genéricos  e exigem diversas adaptações para tratar as dificuldades comumente encontradas em um programa de melhoria de testes. Diante deste cenário, a abordagem proposta neste trabalho guiará as empresas de maneira simples e ágil a estabelecer processos de teste de software, possibilitando o alcance de melhores níveis de qualidade de seus …", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Implantação de um Processo de Estimativas de Tempo em uma Instituição Pública baseado em Pontos por Estória\n", "abstract": " Este artigo descreve a implantação de um processo de estimativas de tempo utilizando metodologias ágeis em uma instituição pública. Este processo de estimativas é baseado na abordagem Pontos por Estórias.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Análise da Conversão de Processos de Software a partir de Modelos/Normas de Qualidade\n", "abstract": " O propósito desse trabalho é definir uma metodologia de conversão de processos de software a partir de modelos/normas de qualidade e posteriormente desenvolver uma ferramenta que automatize essa conversão, integrada ao ImPProS (Ambiente de Implementação Progressiva de Processos de Software)[Oliveira 05], um ambiente proposto em um plano de trabalho do programa de doutorado submetido e aprovado pelo Centro de Informática da Universidade Federal de Pernambuco.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Aumentando a Compreensão de Requisitos em Desenvolvimento de Software com Equipes Distribuídas.\n", "abstract": " Esse artigo apresenta uma proposta para melhorar a compreensão de requisitos entre equipes distribuídas. É apresentado um processo colaborativo para engenharia de requisitos e um modelo de rastreamento originado a partir desse processo, o qual auxilia desenvolvedores de aplicações colaborativas. A validação do modelo foi realizada através da construção de uma aplicação integrada a um groupware e um estudo de caso simulando a execução de um projeto open source real. Uma análise de vinte e quatro ferramentas de gerenciamento de requisitos avaliou o suporte fornecido por ferramentas comerciais, open source e free, servindo também de base para definição de requisitos e viabilidade da proposta.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Suporte a Engenharia de Requisitos com Equipes Distribuídas\n", "abstract": " Este artigo apresenta o protótipo de uma ferramenta cooperativa para engenharia de requisitos, construída na forma de um plugin para o Eclipse. A ferramenta auxilia o trabalho de equipes distribuídas, permitindo edição colaborativa e comunicação entre os stakeholders. Além disso, ela foi construída com base em um novo framework do projeto Eclipse, o ECF (Eclipse Communications Framework), que pretende auxiliar a construção de aplicações colaborativas.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "Um Modelo de Aplicação Distribuída Baseada em Objetos no Suporte ao Serviço de Segunda Opinião Médica do HealthNet\n", "abstract": " 1. Introdução. O HealthNet [1] surgiu a partir do projeto da Rede Recife ATM. Dentre os principais objetivos deste projeto destacam-se o desenvolvimento e estudo de aplicações específicas que possam se beneficiar da alta taxa de transmissão de dados disponibilizada pela rede ATM. Dentre as áreas de aplicações encontra-se a Telemedicina. O HealthNet é um sistema de telemedicina baseado na Web de apoio ao telediagnóstico e à segunda opinião médica. O Hospital das Clínicas da UFPE e o Real Hospital Português (RHP) de Beneficência em Pernambuco, interligados pelo backbone ATM, farão parte do que será chamado de “Rede Integrada de Cooperação em Saúde”. Através do HealthNet, estes hospitais poderão fornecer serviços de diagnósticos remotos especializados para hospitais e postos de saúde menos favorecidos da região metropolitana de Recife e do interior pernambucano e poderão utilizar o serviço de segunda opinião médica para cooperação em cima de casos clínicos de pacientes.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "ProjectSpace: Uma Ferramenta para Gerenciamento e Monitoração de Projeto de Software\n", "abstract": " Este artigo apresenta o ProjectSpace, um projeto de iniciativa do Centro de Informática da UFPE em parceria com o CESAR–Centro de Estudos Avançados do Recife e a Devex Tecnologia e Sistemas que objetiva a criação de um ambiente para monitoração e gerenciamento de projetos de software. O ProjectSpace vem sendo especificado e implementado a dois anos e atualmente se encontra com alguns módulos em fase de implementação enquanto outros já estão em fases de uso e validação. Este artigo trás a arquitetura do ProjectSpace e a primeira versão da ferramenta.", "num_citations": "1\n", "authors": ["1376"]}
{"title": "HealthNet, um Sistema de Apoio à Construção da Rede Integrada de Cooperação em Saúde na Cidade de Recife-PE\n", "abstract": " Este artigo descreve o trabalho de pesquisa envolvido no projeto e implementação do HealthNet. O HealthNet é um sistema de Telemedicina de suporte ao telediagnóstico e à segunda opinião médica e tem como um de seus principais objetivos o suporte a Rede Integrada de Cooperação em Saúde na cidade de Recife. São apresentados a motivação, objetivos, funcionalidades e arquitetura do sistema. Um protótipo foi implementado a fim de validar o modelo do sistema e possibilitar a avaliação de tecnologias a serem utilizadas em sua contrução. Finalmente são apresentados os resultados desta pesquisa.", "num_citations": "1\n", "authors": ["1376"]}