{"title": "Integration of biological networks and gene expression data using Cytoscape\n", "abstract": " Cytoscape is a free software package for visualizing, modeling and analyzing molecular and genetic interaction networks. This protocol explains how to use Cytoscape to analyze the results of mRNA expression profiling, and other functional genomics and proteomics experiments, in the context of an interaction network obtained for genes of interest. Five major steps are described:(i) obtaining a gene or protein network,(ii) displaying the network using layout algorithms,(iii) integrating with gene expression and other functional attributes,(iv) identifying putative complexes and functional modules and (v) identifying enriched Gene Ontology annotations in the network. These steps provide a broad sample of the types of analyses performed by Cytoscape.", "num_citations": "2393\n", "authors": ["832"]}
{"title": "Glioma Groups Based on 1p/19q, IDH, and TERT Promoter Mutations in Tumors\n", "abstract": " BackgroundThe prediction of clinical behavior, response to therapy, and outcome of infiltrative glioma is challenging. On the basis of previous studies of tumor biology, we defined five glioma molecular groups with the use of three alterations: mutations in the TERT promoter, mutations in IDH, and codeletion of chromosome arms 1p and 19q (1p/19q codeletion). We tested the hypothesis that within groups based on these features, tumors would have similar clinical variables, acquired somatic alterations, and germline variants.   MethodsWe scored tumors as negative or positive for each of these markers in 1087 gliomas and compared acquired alterations and patient characteristics among the five primary molecular groups. Using 11,590 controls, we assessed associations between these groups and known glioma germline variants.   ResultsAmong 615 grade II or III gliomas, 29% had all three alterations (i.e., were …", "num_citations": "1402\n", "authors": ["832"]}
{"title": "A travel guide to Cytoscape plugins\n", "abstract": " Cytoscape is open-source software for integration, visualization and analysis of biological networks. It can be extended through Cytoscape plugins, enabling a broad community of scientists to contribute useful features. This growth has occurred organically through the independent efforts of diverse authors, yielding a powerful but heterogeneous set of tools. We present a travel guide to the world of plugins, covering the 152 publicly available plugins for Cytoscape 2.5–2.8. We also describe ongoing efforts to distribute, organize and maintain the quality of the collection.", "num_citations": "1203\n", "authors": ["832"]}
{"title": "WikiPathways: pathway editing for the people\n", "abstract": " WikiPathways provides a collaborative platform for creating, updating, and sharing pathway diagrams and serves as an example of content curation by the biology community.", "num_citations": "623\n", "authors": ["832"]}
{"title": "Dynamic and coordinated epigenetic regulation of developmental transitions in the cardiac lineage\n", "abstract": " Heart development is exquisitely sensitive to the precise temporal regulation of thousands of genes that govern developmental decisions during differentiation. However, we currently lack a detailed understanding of how chromatin and gene expression patterns are coordinated during developmental transitions in the cardiac lineage. Here, we interrogated the transcriptome and several histone modifications across the genome during defined stages of cardiac differentiation. We find distinct chromatin patterns that are coordinated with stage-specific expression of functionally related genes, including many human disease-associated genes. Moreover, we discover a novel preactivation chromatin pattern at the promoters of genes associated with heart development and cardiac function. We further identify stage-specific distal enhancer elements and find enriched DNA binding motifs within these regions that predict sets …", "num_citations": "564\n", "authors": ["832"]}
{"title": "WikiPathways: building research communities on biological pathways\n", "abstract": " Here, we describe the development of WikiPathways (http://www.wikipathways.org), a public wiki for pathway curation, since it was first published in 2008. New features are discussed, as well as developments in the community of contributors. New features include a zoomable pathway viewer, support for pathway ontology annotations, the ability to mark pathways as private for a limited time and the availability of stable hyperlinks to pathways and the elements therein. WikiPathways content is freely available in a variety of formats such as the BioPAX standard, and the content is increasingly adopted by external databases and tools, including Wikipedia. A recent development is the use of WikiPathways as a staging ground for centrally curated databases such as Reactome. WikiPathways is seeing steady growth in the number of users, page views and edits for each pathway. To assess whether the community …", "num_citations": "552\n", "authors": ["832"]}
{"title": "WikiPathways: a multifaceted pathway database bridging metabolomics to other omics research\n", "abstract": " WikiPathways (wikipathways.org) captures the collective knowledge represented in biological pathways. By providing a database in a curated, machine readable way, omics data analysis and visualization is enabled. WikiPathways and other pathway databases are used to analyze experimental data by research groups in many fields. Due to the open and collaborative nature of the WikiPathways platform, our content keeps growing and is getting more accurate, making WikiPathways a reliable and rich pathway database. Previously, however, the focus was primarily on genes and proteins, leaving many metabolites with only limited annotation. Recent curation efforts focused on improving the annotation of metabolism and metabolic pathways by associating unmapped metabolites with database identifiers and providing more detailed interaction knowledge. Here, we report the outcomes of the continued …", "num_citations": "548\n", "authors": ["832"]}
{"title": "Variants in the CDKN2B and RTEL1 regions are associated with high-grade glioma susceptibility\n", "abstract": " The causes of glioblastoma and other gliomas remain obscure 1, 2. To discover new candidate genes influencing glioma susceptibility, we conducted a principal component–adjusted 3 genome-wide association study (GWAS) of 275,895 autosomal variants among 692 adult high-grade glioma cases (622 from the San Francisco Adult Glioma Study (AGS) and 70 from the Cancer Genome Atlas (TCGA)) 4 and 3,992 controls (602 from AGS and 3,390 from Illumina iControlDB (iControls)). For replication, we analyzed the 13 SNPs with P< 10− 6 using independent data from 176 high-grade glioma cases and 174 controls from the Mayo Clinic. On 9p21, rs1412829 near CDKN2B had discovery P= 3.4× 10− 8, replication P= 0.0038 and combined P= 1.85× 10− 10. On 20q13. 3, rs6010620 intronic to RTEL1 had discovery P= 1.5× 10− 7, replication P= 0.00035 and combined P= 3.40× 10− 9. For both SNPs, the direction of …", "num_citations": "510\n", "authors": ["832"]}
{"title": "Crystal structure of Hck in complex with a Src family–selective tyrosine kinase inhibitor\n", "abstract": " The crystal structure of the autoinhibited form of Hck has been determined at 2.0 Å resolution, in complex with a specific pyrazolo pyrimidine-type inhibitor, PP1. The activation segment, a key regulatory component of the catalytic domain, is unphosphorylated and is visualized in its entirety. Tyr-416, the site of activating autophosphorylation in the Src family kinases, is positioned such that access to the catalytic machinery is blocked. PP1 is bound at the ATP-binding site of the kinase, and a methylphenyl group on PP1 is inserted into an adjacent hydrophobic pocket. The enlargement of this pocket in autoinhibited Src kinases suggests a route toward the development of inhibitors that are specific for the inactive forms of these proteins.", "num_citations": "507\n", "authors": ["832"]}
{"title": "WikiPathways: capturing the full diversity of pathway knowledge\n", "abstract": " WikiPathways (http://www.wikipathways.org) is an open, collaborative platform for capturing and disseminating models of biological pathways for data visualization and analysis. Since our last NAR update, 4 years ago, WikiPathways has experienced massive growth in content, which continues to be contributed by hundreds of individuals each year. New aspects of the diversity and depth of the collected pathways are described from the perspective of researchers interested in using pathway information in their studies. We provide updates on extensions and services to support pathway analysis and visualization via popular standalone tools, i.e. PathVisio and Cytoscape, web applications and common programming environments. We introduce the Quick Edit feature for pathway authors and curators, in addition to new means of publishing pathways and maintaining custom pathway collections to serve specific …", "num_citations": "407\n", "authors": ["832"]}
{"title": "Presenting and exploring biological pathways with PathVisio\n", "abstract": " Biological pathways are a useful abstraction of biological concepts, and software tools to deal with pathway diagrams can help biological research. PathVisio is a new visualization tool for biological pathways that mimics the popular GenMAPP tool with a completely new Java implementation that allows better integration with other open source projects. The GenMAPP MAPP file format is replaced by GPML, a new XML file format that provides seamless exchange of graphical pathway information among multiple programs. PathVisio can be combined with other bioinformatics tools to open up three possible uses: visual compilation of biological knowledge, interpretation of high-throughput expression datasets, and computational augmentation of pathways with interaction information. PathVisio is open source software and available at                      http://www.pathvisio.org                                        . PathVisio is a graphical editor for biological pathways, with flexibility and ease of use as primary goals.", "num_citations": "388\n", "authors": ["832"]}
{"title": "Structure of the RCK domain from the E. coli K+ channel and demonstration of its presence in the human BK channel\n", "abstract": " The intracellular C-terminal domain structure of a six-transmembrane K+ channel from Escherichia coli has been solved by X-ray crystallography at 2.4 Å resolution. The structure is representative of a broad class of domains/proteins that regulate the conductance of K+ (here referred to as RCK domains) in prokaryotic K+ transporters and K+ channels. The RCK domain has a Rossmann-fold topology with unique positions, not commonly conserved among Rossmann-fold proteins, composing a well-conserved salt bridge and a hydrophobic dimer interface. Structure-based amino acid sequence alignments and mutational analysis are used to demonstrate that an RCK domain is also present and is an important component of the gating machinery in eukaryotic large-conductance Ca2+-activated K+ channels.", "num_citations": "366\n", "authors": ["832"]}
{"title": "PathVisio 3: an extendable pathway analysis toolbox\n", "abstract": " PathVisio is a commonly used pathway editor, visualization and analysis software. Biological pathways have been used by biologists for many years to describe the detailed steps in biological processes. Those powerful, visual representations help researchers to better understand, share and discuss knowledge. Since the first publication of PathVisio in 2008, the original paper was cited more than 170 times and PathVisio was used in many different biological studies. As an online editor PathVisio is also integrated in the community curated pathway database WikiPathways. Here we present the third version of PathVisio with the newest additions and improvements of the application. The core features of PathVisio are pathway drawing, advanced data visualization and pathway statistics. Additionally, PathVisio 3 introduces a new powerful extension systems that allows other developers to contribute additional functionality in form of plugins without changing the core application. PathVisio can be downloaded from http://www.pathvisio.org and in 2014 PathVisio 3 has been downloaded over 5,500 times. There are already more than 15 plugins available in the central plugin repository. PathVisio is a freely available, open-source tool published under the Apache 2.0 license (http://www.apache.org/licenses/LICENSE-2.0). It is implemented in Java and thus runs on all major operating systems. The code repository is available at http://svn.bigcat.unimaas.nl/pathvisio. The support mailing list for users is available on https://groups.google.com/forum/#!forum/wikipathways-discuss and for developers on https://groups.google.com/forum/#!forum/wikipathways …", "num_citations": "339\n", "authors": ["832"]}
{"title": "GenMAPP 2: new features and resources for pathway analysis\n", "abstract": " Microarray technologies have evolved rapidly, enabling biologists to quantify genome-wide levels of gene expression, alternative splicing, and sequence variations for a variety of species. Analyzing and displaying these data present a significant challenge. Pathway-based approaches for analyzing microarray data have proven useful for presenting data and for generating testable hypotheses. To address the growing needs of the microarray community we have released version 2 of Gene Map Annotator and Pathway Profiler (GenMAPP), a new GenMAPP database schema, and integrated resources for pathway analysis. We have redesigned the GenMAPP database to support multiple gene annotations and species as well as custom species database creation for a potentially unlimited number of species. We have expanded our pathway resources by utilizing homology information to translate pathway content …", "num_citations": "310\n", "authors": ["832"]}
{"title": "Cytoscape automation: empowering workflow-based network analysis\n", "abstract": " Cytoscape is one of the most successful network biology analysis and visualization tools, but because of its interactive nature, its role in creating reproducible, scalable, and novel workflows has been limited. We describe Cytoscape Automation (CA), which marries Cytoscape to highly productive workflow systems, for example, Python/R in Jupyter/RStudio. We expose over 270 Cytoscape core functions and 34 Cytoscape apps as REST-callable functions with standardized JSON interfaces backed by Swagger documentation. Independent projects to create and publish Python/R native CA interface libraries have reached an advanced stage, and a number of automation workflows are already published.", "num_citations": "309\n", "authors": ["832"]}
{"title": "Structure of the human BK channel Ca2+-activation apparatus at 3.0 Å resolution\n", "abstract": " High-conductance voltage- and Ca2+-activated K+ (BK) channels encode negative feedback regulation of membrane voltage and Ca2+ signaling, playing a central role in numerous physiological processes. We determined the x-ray structure of the human BK Ca2+ gating apparatus at a resolution of 3.0 angstroms and deduced its tetrameric assembly by solving a 6 angstrom resolution structure of a Na+-activated homolog. Two tandem C-terminal regulator of K+ conductance (RCK) domains from each of four channel subunits form a 350-kilodalton gating ring at the intracellular membrane surface. A sequence of aspartic amino acids that is known as the Ca2+ bowl, and is located within the second of the tandem RCK domains, creates four Ca2+ binding sites on the outer perimeter of the gating ring at the “assembly interface” between RCK domains. Functionally important mutations cluster near the Ca2+ bowl, near …", "num_citations": "304\n", "authors": ["832"]}
{"title": "GO-Elite: a flexible solution for pathway and ontology over-representation\n", "abstract": " Summary: We introduce GO-Elite, a flexible and powerful pathway analysis tool for a wide array of species, identifiers (IDs), pathways, ontologies and gene sets. In addition to the Gene Ontology (GO), GO-Elite allows the user to perform over-representation analysis on any structured ontology annotations, pathway database or biological IDs (e.g. gene, protein or metabolite). GO-Elite exploits the structured nature of biological ontologies to report a minimal set of non-overlapping terms. The results can be visualized on WikiPathways or as networks. Built-in support is provided for over 60 species and 50 ID systems, covering gene, disease and phenotype ontologies, multiple pathway databases, biomarkers, and transcription factor and microRNA targets. GO-Elite is available as a web interface, GenMAPP-CS plugin and as a cross-platform application.                    Availability:           http://www.genmapp.org …", "num_citations": "267\n", "authors": ["832"]}
{"title": "Alternative splicing regulates mouse embryonic stem cell pluripotency and differentiation\n", "abstract": " Two major goals of regenerative medicine are to reproducibly transform adult somatic cells into a pluripotent state and to control their differentiation into specific cell fates. Progress toward these goals would be greatly helped by obtaining a complete picture of the RNA isoforms produced by these cells due to alternative splicing (AS) and alternative promoter selection (APS). To investigate the roles of AS and APS, reciprocal exon–exon junctions were interrogated on a genome-wide scale in differentiating mouse embryonic stem (ES) cells with a prototype Affymetrix microarray. Using a recently released open-source software package named AltAnalyze, we identified 144 genes for 170 putative isoform variants, the majority (67%) of which were predicted to alter protein sequence and domain composition. Verified alternative exons were largely associated with pathways of Wnt signaling and cell-cycle control, and most …", "num_citations": "224\n", "authors": ["832"]}
{"title": "Variants near TERT and TERC influencing telomere length are associated with high-grade glioma risk\n", "abstract": " Glioma, the most common central nervous system cancer in adults, has poor prognosis. Here we identify a new SNP associated with glioma risk, rs1920116 (near TERC), that reached genome-wide significance (P combined= 8.3× 10− 9) in a meta-analysis of genome-wide association studies (GWAS) of high-grade glioma and replication data (1,644 cases and 7,736 controls). This region has previously been associated with mean leukocyte telomere length (LTL). We therefore examined the relationship between LTL and both this new risk locus and other previously established risk loci for glioma using data from a recent GWAS of LTL (n= 37,684 individuals) 1. Alleles associated with glioma risk near TERC and TERT were strongly associated with longer LTL (P= 5.5× 10− 20 and 4.4× 10− 19, respectively). In contrast, risk-associated alleles near RTEL1 were inconsistently associated with LTL, suggesting the …", "num_citations": "170\n", "authors": ["832"]}
{"title": "The BridgeDb framework: standardized access to gene, protein and metabolite identifier mapping services\n", "abstract": " Many complementary solutions are available for the identifier mapping problem. This creates an opportunity for bioinformatics tool developers. Tools can be made to flexibly support multiple mapping services or mapping services could be combined to get broader coverage. This approach requires an interface layer between tools and mapping services. Here we present BridgeDb, a software framework for gene, protein and metabolite identifier mapping. This framework provides a standardized interface layer through which bioinformatics tools can be connected to different identifier mapping services. This approach makes it easier for tool developers to support identifier mapping. Mapping services can be combined or merged to support multi-omics experiments or to integrate custom microarray annotations. BridgeDb provides its own ready-to-go mapping services, both in webservice and local database forms. However, the framework is intended for customization and adaptation to any identifier mapping service. BridgeDb has already been integrated into several bioinformatics applications. By uncoupling bioinformatics tools from mapping services, BridgeDb improves capability and flexibility of those tools. All described software is open source and available at                      http://www.bridgedb.org                                        .", "num_citations": "168\n", "authors": ["832"]}
{"title": "Integrated proteogenomic characterization of clear cell renal cell carcinoma\n", "abstract": " To elucidate the deregulated functional modules that drive clear cell renal cell carcinoma (ccRCC), we performed comprehensive genomic, epigenomic, transcriptomic, proteomic, and phosphoproteomic characterization of treatment-naive ccRCC and paired normal adjacent tissue samples. Genomic analyses identified a distinct molecular subgroup associated with genomic instability. Integration of proteogenomic measurements uniquely identified protein dysregulation of cellular mechanisms impacted by genomic alterations, including oxidative phosphorylation-related metabolism, protein translation processes, and phospho-signaling modules. To assess the degree of immune infiltration in individual tumors, we identified microenvironment cell signatures that delineated four immune-based ccRCC subtypes characterized by distinct cellular pathways. This study reports a large-scale proteogenomic analysis of …", "num_citations": "166\n", "authors": ["832"]}
{"title": "Mining biological pathways using WikiPathways web services\n", "abstract": " WikiPathways is a platform for creating, updating, and sharing biological pathways [1]. Pathways can be edited and downloaded using the wiki-style website. Here we present a SOAP web service that provides programmatic access to WikiPathways that is complementary to the website. We describe the functionality that this web service offers and discuss several use cases in detail. Exposing WikiPathways through a web service opens up new ways of utilizing pathway information and assisting the community curation process.", "num_citations": "150\n", "authors": ["832"]}
{"title": "Affinity purification–mass spectrometry and network analysis to understand protein-protein interactions\n", "abstract": " By determining protein-protein interactions in normal, diseased and infected cells, we can improve our understanding of cellular systems and their reaction to various perturbations. In this protocol, we discuss how to use data obtained in affinity purification–mass spectrometry (AP-MS) experiments to generate meaningful interaction networks and effective figures. We begin with an overview of common epitope tagging, expression and AP practices, followed by liquid chromatography–MS (LC-MS) data collection. We then provide a detailed procedure covering a pipeline approach to (i) pre-processing the data by filtering against contaminant lists such as the Contaminant Repository for Affinity Purification (CRAPome) and normalization using the spectral index (SI N) or normalized spectral abundance factor (NSAF);(ii) scoring via methods such as MiST, SAInt and CompPASS; and (iii) testing the resulting scores. Data …", "num_citations": "147\n", "authors": ["832"]}
{"title": "A low-frequency variant at 8q24. 21 is strongly associated with risk of oligodendroglial tumors and astrocytomas with IDH1 or IDH2 mutation\n", "abstract": " Variants at 8q24. 21 have been shown to be associated with glioma development. By means of tag SNP genotyping and imputation, pooled next-generation sequencing using long-range PCR and subsequent validation SNP genotyping, we identified seven low-frequency SNPs at 8q24. 21 that were strongly associated with glioma risk (P= 1× 10− 25 to 1× 10− 14). The most strongly associated SNP, rs55705857, remained highly significant after individual adjustment for the other top six SNPs and two previously published SNPs. After stratifying by histological and tumor genetic subtype, the most significant associations of rs55705857 were with oligodendroglial tumors and gliomas with mutant IDH1 or IDH2 (odds ratio (OR)= 5.1, P= 1.1× 10− 31 and OR= 4.8, P= 6.6× 10− 22, respectively). Strong associations were observed for astrocytomas with mutated IDH1 or IDH2 (grades 2–4)(OR= 5.16–6.66, P= 4.7× 10− 12 to …", "num_citations": "130\n", "authors": ["832"]}
{"title": "Intramolecular regulatory interactions in the Src family kinase Hck probed by mutagenesis of a conserved tryptophan residue\n", "abstract": " Intramolecular interactions between the Src homology domains (SH2 and SH3) and the catalytic domains of Src family kinases result in repression of catalytic activity. The crystal structure of the Src family kinase Hck, with its regulatory domains intact, has been solved. It predicts that a conserved residue, Trp260, at the end of the linker between the SH2 and the catalytic domains plays an important role in regulation by the SH3 and SH2 domains. We have mutated this residue and compared the activities of C-terminally phosphorylated wild type Hck and W260A Hck. The W260A mutant has a higher specific activity than wild type Hck. The W260A mutant requires autophosphorylation at Tyr416 for full activity, but it is not activated by ligand binding to the SH3 or SH2 domains. This mutation also changes the accessibility of the SH2 and SH3 domains to their cognate peptide ligands. Our results indicate that Trp260 plays …", "num_citations": "121\n", "authors": ["832"]}
{"title": "Proteogenomic characterization of endometrial carcinoma\n", "abstract": " We undertook a comprehensive proteogenomic characterization of 95 prospectively collected endometrial carcinomas, comprising 83 endometrioid and 12 serous tumors. This analysis revealed possible new consequences of perturbations to the p53 and Wnt/β-catenin pathways, identified a potential role for circRNAs in the epithelial-mesenchymal transition, and provided new information about proteomic markers of clinical and genomic tumor subgroups, including relationships to known druggable pathways. An extensive genome-wide acetylation survey yielded insights into regulatory mechanisms linking Wnt signaling and histone acetylation. We also characterized aspects of the tumor immune landscape, including immunogenic alterations, neoantigens, common cancer/testis antigens, and the immune microenvironment, all of which can inform immunotherapy decisions. Collectively, our multi-omic analyses …", "num_citations": "114\n", "authors": ["832"]}
{"title": "Cytoscape app store\n", "abstract": " Summary: Cytoscape is an open source software tool for biological network visualization and analysis, which can be extended with independently developed apps. We launched the Cytoscape App Store to highlight the important features that apps add to Cytoscape, enable researchers to find and install apps they need and help developers promote their apps.                    Availability: The App Store is available at http://apps.cytoscape.org.                    Contact:           apico@gladstone.ucsf.edu", "num_citations": "111\n", "authors": ["832"]}
{"title": "COVID-19 Disease Map, building a computational repository of SARS-CoV-2 virus-host interaction mechanisms\n", "abstract": " We announce the COVID-19 Disease Map (https://doi. org/10.17881/covid19-disease-map), an effort to build a comprehensive, standardized knowledge repository of SARS-CoV-2 virus-host interaction mechanisms, guided by input from domain experts and based on published work. This knowledge, available in the vast body of existing literature 1, 2 and the fast-growing number of new SARS-CoV-2 publications, needs rigorous and efficient organization in both human and machine-readable formats. This endeavour is an open collaboration between clinical researchers, life scientists, pathway curators, computational biologists and data scientists. Currently, 162 contributors from 25 countries around the world are participating in the project, including partners from Reactome 3, WikiPathways 4, IMEx Consortium 5, Pathway Commons 6, DisGeNET 7, ELIXIR 8, and the Disease Maps Community 9. With this effort, we …", "num_citations": "97\n", "authors": ["832"]}
{"title": "Alternative splicing in the differentiation of human embryonic stem cells into cardiac precursors\n", "abstract": " The role of alternative splicing in self-renewal, pluripotency and tissue lineage specification of human embryonic stem cells (hESCs) is largely unknown. To better define these regulatory cues, we modified the H9 hESC line to allow selection of pluripotent hESCs by neomycin resistance and cardiac progenitors by puromycin resistance. Exon-level microarray expression data from undifferentiated hESCs and cardiac and neural precursors were used to identify splice isoforms with cardiac-restricted or common cardiac/neural differentiation expression patterns. Splice events for these groups corresponded to the pathways of cytoskeletal remodeling, RNA splicing, muscle specification, and cell cycle checkpoint control as well as genes with serine/threonine kinase and helicase activity. Using a new program named AltAnalyze (http://www.AltAnalyze.org), we identified novel changes in protein domain and microRNA binding site architecture that were predicted to affect protein function and expression. These included an enrichment of splice isoforms that oppose cell-cycle arrest in hESCs and that promote calcium signaling and cardiac development in cardiac precursors. By combining genome-wide predictions of alternative splicing with new functional annotations, our data suggest potential mechanisms that may influence lineage commitment and hESC maintenance at the level of specific splice isoforms and microRNA regulation.", "num_citations": "96\n", "authors": ["832"]}
{"title": "WikiPathways: connecting communities\n", "abstract": " WikiPathways (https://www.wikipathways.org) is a biological pathway database known for its collaborative nature and open science approaches. With the core idea of the scientific community developing and curating biological knowledge in pathway models, WikiPathways lowers all barriers for accessing and using its content. Increasingly more content creators, initiatives, projects and tools have started using WikiPathways. Central in this growth and increased use of WikiPathways are the various communities that focus on particular subsets of molecular pathways such as for rare diseases and lipid metabolism. Knowledge from published pathway figures helps prioritize pathway development, using optical character and named entity recognition. We show the growth of WikiPathways over the last three years, highlight the new communities and collaborations of pathway authors and curators, and describe …", "num_citations": "93\n", "authors": ["832"]}
{"title": "Pathway analysis of single-nucleotide polymorphisms potentially associated with glioblastoma multiforme susceptibility using random forests\n", "abstract": " Glioma is a complex disease that is unlikely to result from the effect of a single gene. Genetic analysis at the pathway level involving multiple genes may be more likely to capture gene-disease associations than analyzing genes one at a time. The current pilot study included 112 Caucasians with glioblastoma multiforme and 112 Caucasian healthy controls frequency matched to cases by age and gender. Subjects were genotyped using a commercially available (ParAllele/Affymetrix) assay panel of 10,177 nonsynonymous coding single-nucleotide polymorphisms (SNP) spanning the genome known at the time the panel was constructed. For this analysis, we selected 10 pathways potentially involved in gliomagenesis that had SNPs represented on the panel. We performed random forests (RF) analyses of SNPs within each pathway group and logistic regression to assess interaction among genes in the one pathway …", "num_citations": "86\n", "authors": ["832"]}
{"title": "Longer genotypically-estimated leukocyte telomere length is associated with increased adult glioma risk\n", "abstract": " Telomere maintenance has emerged as an important molecular feature with impacts on adult glioma susceptibility and prognosis. Whether longer or shorter leukocyte telomere length (LTL) is associated with glioma risk remains elusive and is often confounded by the effects of age and patient treatment. We sought to determine if genotypically-estimated LTL is associated with glioma risk and if inherited single nucleotide polymorphisms (SNPs) that are associated with LTL are glioma risk factors. Using a Mendelian randomization approach, we assessed differences in genotypically-estimated relative LTL in two independent glioma case-control datasets from the UCSF Adult Glioma Study (652 patients and 3735 controls) and The Cancer Genome Atlas (478 non-overlapping patients and 2559 controls). LTL estimates were based on a weighted linear combination of subject genotype at eight SNPs, previously …", "num_citations": "81\n", "authors": ["832"]}
{"title": "Fibrin-targeting immunotherapy protects against neuroinflammation and neurodegeneration\n", "abstract": " Activation of innate immunity and deposition of blood-derived fibrin in the central nervous system (CNS) occur in autoimmune and neurodegenerative diseases, including multiple sclerosis (MS) and Alzheimer’s disease (AD). However, the mechanisms that link disruption of the blood–brain barrier (BBB) to neurodegeneration are poorly understood, and exploration of fibrin as a therapeutic target has been limited by its beneficial clotting functions. Here we report the generation of monoclonal antibody 5B8, targeted against the cryptic fibrin epitope γ 377–395, to selectively inhibit fibrin-induced inflammation and oxidative stress without interfering with clotting. 5B8 suppressed fibrin-induced nicotinamide adenine dinucleotide phosphate (NADPH) oxidase activation and the expression of proinflammatory genes. In animal models of MS and AD, 5B8 entered the CNS and bound to parenchymal fibrin, and its therapeutic …", "num_citations": "79\n", "authors": ["832"]}
{"title": "Extracellular RNAs are associated with insulin resistance and metabolic phenotypes\n", "abstract": " OBJECTIVE Insulin resistance (IR) is a hallmark of obesity and metabolic disease. Circulating extracellular RNAs (ex-RNAs), stable RNA molecules in plasma, may play a role in IR, though most studies on ex-RNAs in IR are small. We sought to characterize the relationship between ex-RNAs and metabolic phenotypes in a large community-based human cohort.RESEARCH DESIGN AND METHODS We measured circulating plasma ex-RNAs in 2,317 participants without diabetes in the Framingham Heart Study (FHS) Offspring Cohort at cycle 8 and defined associations between ex-RNAs and IR (measured by circulating insulin level). We measured association between candidate ex-RNAs and markers of adiposity. Sensitivity analyses included individuals with diabetes. In a separate cohort of 90 overweight/obese youth, we measured selected ex-RNAs and metabolites. Biology of candidate microRNAs was …", "num_citations": "65\n", "authors": ["832"]}
{"title": "Analysis of 60 Reported Glioma Risk SNP s Replicates Published GWAS Findings but Fails to Replicate Associations From Published Candidate‐Gene Studies\n", "abstract": " Genomewide association studies (GWAS) and candidate‐gene studies have implicated single‐nucleotide polymorphisms (SNPs) in at least 45 different genes as putative glioma risk factors. Attempts to validate these associations have yielded variable results and few genetic risk factors have been consistently replicated. We conducted a case‐control study of Caucasian glioma cases and controls from the University of California San Francisco (810 cases, 512 controls) and the Mayo Clinic (852 cases, 789 controls) in an attempt to replicate previously reported genetic risk factors for glioma. Sixty SNPs selected from the literature (eight from GWAS and 52 from candidate‐gene studies) were successfully genotyped on an Illumina custom genotyping panel. Eight SNPs in/near seven different genes (TERT, EGFR, CCDC26, CDKN2A, PHLDB1, RTEL1, TP53) were significantly associated with glioma risk in the …", "num_citations": "58\n", "authors": ["832"]}
{"title": "Finding the right questions: exploratory pathway analysis to enhance biological discovery in large datasets\n", "abstract": " This Essay discusses the role of pathways for exploratory data analysis in present-day biology.", "num_citations": "56\n", "authors": ["832"]}
{"title": "Genetic variants in telomerase-related genes are associated with an older age at diagnosis in glioma patients: evidence for distinct pathways of gliomagenesis\n", "abstract": " Background           Genome-wide association studies have implicated single nucleotide polymorphisms (SNPs) in 7 genes as glioma risk factors, including 2 (TERT, RTEL1) involved in telomerase structure/function. We examined associations of these 7 established glioma risk loci with age at diagnosis among patients with glioma.                             Methods           SNP genotype data were available for 2286 Caucasian glioma patients from the University of California, San Francisco (n = 1434) and the Mayo Clinic (n = 852). Regression analyses were performed to test for associations between “number of risk alleles” and “age at diagnosis,” adjusted for sex and study site and stratified by tumor grade/histology where appropriate.                             Results           Four SNPs were significantly associated with age at diagnosis. Carrying a greater number of risk alleles at rs55705857 (CCDC26) and at rs498872 …", "num_citations": "49\n", "authors": ["832"]}
{"title": "Using the semantic web for rapid integration of WikiPathways with other biological online data resources\n", "abstract": " The diversity of online resources storing biological data in different formats provides a challenge for bioinformaticians to integrate and analyse their biological data. The semantic web provides a standard to facilitate knowledge integration using statements built as triples describing a relation between two objects. WikiPathways, an online collaborative pathway resource, is now available in the semantic web through a SPARQL endpoint at http://sparql.wikipathways.org. Having biological pathways in the semantic web allows rapid integration with data from other resources that contain information about elements present in pathways using SPARQL queries. In order to convert WikiPathways content into meaningful triples we developed two new vocabularies that capture the graphical representation and the pathway logic, respectively. Each gene, protein, and metabolite in a given pathway is defined with a standard set of identifiers to support linking to several other biological resources in the semantic web. WikiPathways triples were loaded into the Open PHACTS discovery platform and are available through its Web API (https://dev.openphacts.org/docs) to be used in various tools for drug development. We combined various semantic web resources with the newly converted WikiPathways content using a variety of SPARQL query types and third-party resources, such as the Open PHACTS API. The ability to use pathway information to form new links across diverse biological data highlights the utility of integrating WikiPathways in the semantic web.", "num_citations": "48\n", "authors": ["832"]}
{"title": "Proteogenomic and metabolomic characterization of human glioblastoma\n", "abstract": " Glioblastoma (GBM) is the most aggressive nervous system cancer. Understanding its molecular pathogenesis is crucial to improving diagnosis and treatment. Integrated analysis of genomic, proteomic, post-translational modification and metabolomic data on 99 treatment-naive GBMs provides insights to GBM biology. We identify key phosphorylation events (e.g., phosphorylated PTPN11 and PLCG1) as potential switches mediating oncogenic pathway activation, as well as potential targets for EGFR-, TP53-, and RB1-altered tumors. Immune subtypes with distinct immune cell types are discovered using bulk omics methodologies, validated by snRNA-seq, and correlated with specific expression and histone acetylation patterns. Histone H2B acetylation in classical-like and immune-low GBM is driven largely by BRDs, CREBBP, and EP300. Integrated metabolomic and proteomic data identify specific lipid …", "num_citations": "47\n", "authors": ["832"]}
{"title": "Science Forum: Wikidata as a knowledge graph for the life sciences\n", "abstract": " Wikidata is a community-maintained knowledge base that has been assembled from repositories in the fields of genomics, proteomics, genetic variants, pathways, chemical compounds, and diseases, and that adheres to the FAIR principles of findability, accessibility, interoperability and reusability. Here we describe the breadth and depth of the biomedical knowledge contained within Wikidata, and discuss the open-source tools we have built to add information to Wikidata and to synchronize it with source databases. We also demonstrate several use cases for Wikidata, including the crowdsourced curation of biomedical ontologies, phenotype-based diagnosis of disease, and drug repurposing.", "num_citations": "46\n", "authors": ["832"]}
{"title": "Transcriptional profiling and therapeutic targeting of oxidative stress in neuroinflammation\n", "abstract": " Oxidative stress is a central part of innate immune-induced neurodegeneration. However, the transcriptomic landscape of central nervous system (CNS) innate immune cells contributing to oxidative stress is unknown, and therapies to target their neurotoxic functions are not widely available. Here, we provide the oxidative stress innate immune cell atlas in neuroinflammatory disease and report the discovery of new druggable pathways. Transcriptional profiling of oxidative stress–producing CNS innate immune cells identified a core oxidative stress gene signature coupled to coagulation and glutathione-pathway genes shared between a microglia cluster and infiltrating macrophages. Tox-seq followed by a microglia high-throughput screen and oxidative stress gene network analysis identified the glutathione-regulating compound acivicin, with potent therapeutic effects that decrease oxidative stress and axonal …", "num_citations": "44\n", "authors": ["832"]}
{"title": "Integration of extracellular RNA profiling data using metadata, biomedical ontologies and Linked Data technologies\n", "abstract": " The large diversity and volume of extracellular RNA (exRNA) data that will form the basis of the exRNA Atlas generated by the Extracellular RNA Communication Consortium pose a substantial data integration challenge. We here present the strategy that is being implemented by the exRNA Data Management and Resource Repository, which employs metadata, biomedical ontologies and Linked Data technologies, such as Resource Description Framework to integrate a diverse set of exRNA profiles into an exRNA Atlas and enable integrative exRNA analysis. We focus on the following three specific data integration tasks: (a) selection of samples from a virtual biorepository for exRNA profiling and for inclusion in the exRNA Atlas; (b) retrieval of a data slice from the exRNA Atlas for integrative analysis and (c) interpretation of exRNA analysis results in the context of pathways and networks. As exRNA profiling gains …", "num_citations": "43\n", "authors": ["832"]}
{"title": "Molecular, phenotypic, and sample-associated data to describe pluripotent stem cell lines and derivatives\n", "abstract": " The use of induced pluripotent stem cells (iPSC) derived from independent patients and sources holds considerable promise to improve the understanding of development and disease. However, optimized use of iPSC depends on our ability to develop methods to efficiently qualify cell lines and protocols, monitor genetic stability, and evaluate self-renewal and differentiation potential. To accomplish these goals, 57 stem cell lines from 10 laboratories were differentiated to 7 different states, resulting in 248 analyzed samples. Cell lines were differentiated and characterized at a central laboratory using standardized cell culture methodologies, protocols, and metadata descriptors. Stem cell and derived differentiated lines were characterized using RNA-seq, miRNA-seq, copy number arrays, DNA methylation arrays, flow cytometry, and molecular histology. All materials, including raw data, metadata, analysis and …", "num_citations": "38\n", "authors": ["832"]}
{"title": "Inherited variant on chromosome 11q23 increases susceptibility to IDH-mutated but not IDH-normal gliomas regardless of grade or histology\n", "abstract": " Introduction           Recent discoveries of inherited glioma risk loci and acquired IDH mutations are providing new insights into glioma etiology. IDH mutations are common in lower grade gliomas and secondary glioblastomas and uncommon in primary glioblastomas. Because the inherited variant in 11q23 has been associated with risk of lower grade glioma and not with glioblastomas, we hypothesized that this variant increases susceptibility to IDH-mutated gliomas, but not to IDH-wild-type gliomas.                             Methods           We tested this hypothesis in patients with glioma and controls from the San Francisco Adult Glioma Study, the Mayo Clinic, and Illumina controls (1102 total patients, 5299 total controls). Case-control additive associations of 11q23 risk alleles (rs498872, T allele) were calculated using logistic regression, stratified by tumor IDH status (mutated or wild-type) and by histology and …", "num_citations": "38\n", "authors": ["832"]}
{"title": "Proteogenomic insights into the biology and treatment of HPV-negative head and neck squamous cell carcinoma\n", "abstract": " We present a proteogenomic study of 108 human papilloma virus (HPV)-negative head and neck squamous cell carcinomas (HNSCCs). Proteomic analysis systematically catalogs HNSCC-associated proteins and phosphosites, prioritizes copy number drivers, and highlights an oncogenic role for RNA processing genes. Proteomic investigation of mutual exclusivity between FAT1 truncating mutations and 11q13.3 amplifications reveals dysregulated actin dynamics as a common functional consequence. Phosphoproteomics characterizes two modes of EGFR activation, suggesting a new strategy to stratify HNSCCs based on EGFR ligand abundance for effective treatment with inhibitory EGFR monoclonal antibodies. Widespread deletion of immune modulatory genes accounts for low immune infiltration in immune-cold tumors, whereas concordant upregulation of multiple immune checkpoint proteins may underlie …", "num_citations": "37\n", "authors": ["832"]}
{"title": "RCy3: Network biology using Cytoscape from within R\n", "abstract": " RCy3 is an R package in Bioconductor that communicates with Cytoscape via its REST API, providing access to the full feature set of Cytoscape from within the R programming environment. RCy3 has been redesigned to streamline its usage and future development as part of a broader Cytoscape Automation effort. Over 100 new functions have been added, including dozens of helper functions specifically for intuitive data overlay operations. Over 40 Cytoscape apps have implemented automation support so far, making hundreds of additional operations accessible via RCy3. Two-way conversion with networks from\\textit {igraph} and\\textit {graph} ensures interoperability with existing network biology workflows and dozens of other Bioconductor packages. These capabilities are demonstrated in a series of use cases involving public databases, enrichment analysis pipelines, shortest path algorithms and more. With …", "num_citations": "37\n", "authors": ["832"]}
{"title": "SNPLogic: an interactive single nucleotide polymorphism selection, annotation, and prioritization system\n", "abstract": " SNPLogic (http://www.snplogic.org) brings together single nucleotide polymorphism (SNP) information from numerous sources to provide a comprehensive SNP selection, annotation and prioritization system for design and analysis of genotyping projects. SNPLogic integrates information about the genetic context of SNPs (gene, chromosomal region, functional location, haplotypes tags and overlap with transcription factor binding sites, splicing sites, miRNAs and evolutionarily conserved regions), genotypic data (allele frequencies per population and validation method), coverage of commercial arrays (ParAllele, Affymetrix and Illumina), functional predictions (modeled on structure and sequence) and connections or established associations (biological pathways, gene ontology terms and OMIM disease terms). The SNPLogic web interface facilitates construction and annotation of user-defined SNP lists that can …", "num_citations": "37\n", "authors": ["832"]}
{"title": "WikiPathways App for Cytoscape: Making biological pathways amenable to network analysis and visualization\n", "abstract": " In this paper we present the open-source WikiPathways app for Cytoscape (http://apps. cytoscape. org/apps/wikipathways) that can be used to import biological pathways for data visualization and network analysis. WikiPathways is an open, collaborative biological pathway database that provides fully annotated pathway diagrams for manual download or through web services. The WikiPathways app allows users to load pathways in two different views: as an annotated pathway ideal for data visualization and as a simple network to perform computational analysis. An example pathway and dataset are used to demonstrate the functionality of the WikiPathways app and how they can be combined and used together with other apps. More than 3000 downloads in the first 12 months following its release in August 2013 highlight the importance and adoption of the app in the network biology field.", "num_citations": "36\n", "authors": ["832"]}
{"title": "Reactome from a WikiPathways perspective\n", "abstract": " Reactome and WikiPathways are two of the most popular freely available databases for biological pathways. Reactome pathways are centrally curated with periodic input from selected domain experts. WikiPathways is a community-based platform where pathways are created and continually curated by any interested party. The nascent collaboration between WikiPathways and Reactome illustrates the mutual benefits of combining these two approaches. We created a format converter that converts Reactome pathways to the GPML format used in WikiPathways. In addition, we developed the ComplexViz plugin for PathVisio which simplifies looking up complex components. The plugin can also score the complexes on a pathway based on a user defined criterion. This score can then be visualized on the complex nodes using the visualization options provided by the plugin. Using the merged collection of curated and converted Reactome pathways, we demonstrate improved pathway coverage of relevant biological processes for the analysis of a previously described polycystic ovary syndrome gene expression dataset. Additionally, this conversion allows researchers to visualize their data on Reactome pathways using PathVisio’s advanced data visualization functionalities. WikiPathways benefits from the dedicated focus and attention provided to the content converted from Reactome and the wealth of semantic information about interactions. Reactome in turn benefits from the continuous community curation available on WikiPathways. The research community at large benefits from the availability of a larger set of pathways for analysis in PathVisio …", "num_citations": "34\n", "authors": ["832"]}
{"title": "From scientific discovery to cures: Bright stars within a galaxy\n", "abstract": " We propose that data mining and network analysis utilizing public databases can identify and quantify relationships between scientific discoveries and major advances in medicine (cures). Further development of such approaches could help to increase public understanding and governmental support for life science research and could enhance decision making in the quest for cures.", "num_citations": "31\n", "authors": ["832"]}
{"title": "enhancedGraphics: a Cytoscape app for enhanced node graphics\n", "abstract": " enhancedGraphics (http://apps. cytoscape. org/apps/enhancedGraphics) is a Cytoscape app that implements a series of enhanced charts and graphics that may be added to Cytoscape nodes. It enables users and other app developers to create pie, line, bar, and circle plots that are driven by columns in the Cytoscape Node Table. Charts are drawn using vector graphics to allow full-resolution scaling.", "num_citations": "31\n", "authors": ["832"]}
{"title": "Evaluation of methods to assign cell type labels to cell clusters from single-cell RNA-sequencing data\n", "abstract": " Background: Identification of cell type subpopulations from complex cell mixtures using single-cell RNA-sequencing (scRNA-seq) data includes automated steps from normalization to cell clustering. However, assigning cell type labels to cell clusters is often conducted manually, resulting in limited documentation, low reproducibility and uncontrolled vocabularies. This is partially due to the scarcity of reference cell type signatures and because some methods support limited cell type signatures.Methods: In this study, we benchmarked five methods representing first-generation enrichment analysis (ORA), second-generation approaches (GSEA and GSVA), machine learning tools (CIBERSORT) and network-based neighbor voting (METANEIGHBOR), for the task of assigning cell type labels to cell clusters from scRNA-seq data. We used five scRNA-seq datasets: human liver, 11 Tabula Muris mouse tissues, two human …", "num_citations": "29\n", "authors": ["832"]}
{"title": "MicroRNAs associated with reverse left ventricular remodeling in humans identify pathways of heart failure progression\n", "abstract": " Background:Plasma extracellular RNAs have recently garnered interest as biomarkers in heart failure (HF). Most studies in HF focus on single extracellular RNAs related to phenotypes and outcomes, and few describe their functional roles. We hypothesized that clusters of plasma microRNAs (miRNAs) associated with left ventricular (LV) remodeling in human HF would identify novel subsets of genes involved in HF in animal models. Methods and Results:We prospectively measured circulating miRNAs in 64 patients with systolic HF (mean age, 64.8 years; 91% men; median LV ejection fraction, 26%) with serial echocardiography (10 months apart) during medical therapy. We defined LV reverse remodeling as a 15% reduction in LV end-systolic volume index. Using principal components analysis, we identified a component associated with LV reverse remodeling (odds ratio=3.99; P=0.01) that provided risk …", "num_citations": "28\n", "authors": ["832"]}
{"title": "Mosaic: making biological sense of complex networks\n", "abstract": " Summary: We present a Cytoscape plugin called Mosaic to support interactive network annotation, partitioning, layout and coloring based on gene ontology or other relevant annotations.                    Availability: Mosaic is distributed for free under the Apache v2.0 open source license and can be downloaded via the Cytoscape plugin manager. A detailed user manual is available on the Mosaic web site (http://nrnb.org/tools/mosaic).                    Contact:           apico@gladstone.ucsf.edu", "num_citations": "26\n", "authors": ["832"]}
{"title": "Associations of circulating extracellular RNAs with myocardial remodeling and heart failure\n", "abstract": " ImportanceMortality is high among patients heart failure (HF) who are receiving treatment, and therefore identifying new pathways rooted in preclinical cardiac remodeling phenotypes may afford novel biomarkers and therapeutic avenues. Circulating extracellular RNAs (ex-RNAs) are an emerging class of biomarkers with target-organ epigenetic effects relevant to myocardial biology, although large human investigations remain limited.ObjectiveTo measure the association of highly expressed circulating ex-RNAs with left ventricular remodeling and incident HF in a community-based cohort.Design, Setting, and ParticipantsThis is a prospective observational cohort study of individuals who were included in the eighth examination of the Framingham Offspring Cohort (2005-2008). Collected data include measurements of the left ventricle via electrocardiography, determination of circulating ex-RNAs in plasma, and …", "num_citations": "25\n", "authors": ["832"]}
{"title": "NOA: a cytoscape plugin for network ontology analysis\n", "abstract": " Summary: The Network Ontology Analysis (NOA) plugin for Cytoscape implements the NOA algorithm for network-based enrichment analysis, which extends Gene Ontology annotations to network links, or edges. The plugin facilitates the annotation and analysis of one or more networks in Cytoscape according to user-defined parameters. In addition to tables, the NOA plugin also presents results in the form of heatmaps and overview networks in Cytoscape, which can be exported for publication figures.                    Availability: The NOA plugin is an open source, Java program for Cytoscape version 2.8 available via the Cytoscape App Store (http://apps.cytoscape.org/apps/noa) and plugin manager. A detailed user manual is available at http://nrnb.org/tools/noa.                    Contact: apico@gladstone.ucsf.edu                    Supplementary information: Supplementary data are available at Bioinformatics online.", "num_citations": "23\n", "authors": ["832"]}
{"title": "Metabolic architecture of acute exercise response in middle-aged adults in the community\n", "abstract": " Background: Whereas regular exercise is associated with lower risk of cardiovascular disease and mortality, mechanisms of exercise-mediated health benefits remain less clear. We used metabolite profiling before and after acute exercise to delineate the metabolic architecture of exercise response patterns in humans. Methods: Cardiopulmonary exercise testing and metabolite profiling was performed on Framingham Heart Study participants (age 53±8 years, 63% women) with blood drawn at rest (n= 471) and at peak exercise (n= 411). Results: We observed changes in circulating levels for 502 of 588 measured metabolites from rest to peak exercise (exercise duration 11.9±2.1 minutes) at a 5% false discovery rate. Changes included reductions in metabolites implicated in insulin resistance (glutamate,− 29%; P= 1.5× 10− 55; dimethylguanidino valeric acid [DMGV],− 18%; P= 5.8× 10− 18) and increases in …", "num_citations": "19\n", "authors": ["832"]}
{"title": "Proteins altered by surgical weight loss highlight biomarkers of insulin resistance in the community\n", "abstract": " Objective— Mechanisms of early and late improvements in cardiovascular risk after bariatric surgery and applicability to larger, at-risk populations remain unclear. We aimed to identify proteins altered after bariatric surgery and their relations to metabolic syndrome and diabetes mellitus.   Approach and Results— We identified 19 proteins altered in 32 nonfasting plasma samples from a study of patients undergoing bariatric surgery who were evaluated preoperatively (visit 1) versus both early (visit 2; ≈3 months) and late (visit 3; ≈12 months) postoperative follow-up using predefined protein panels (Olink). Using in silico methods and publicly available gene expression repositories, we found that genes encoding 8 out of 19 proteins had highest expression in liver relative to other assayed tissues, with the top biological and disease processes, including major obesity-related vascular diseases. Of 19 candidate …", "num_citations": "15\n", "authors": ["832"]}
{"title": "RCK domain model of calcium activation in BK channels\n", "abstract": " Potassium ion channels are ubiquitously expressed from bacteria to mammals where they are involved in various processes ranging from the regulation of osmotic pressure in a single cell to the electrical response in muscle fibers to the generation of action potentials in neurons. The BK channel family (BK for Big K+ conductance) is an interesting subfamily of K+ channels responsive to both membrane voltage and intracellular calcium ion. The unique, high-affinity Ca 2+ sensitivity of BK channels is critical to their physiological function in various cell types. The mechanism by which Ca 2+ activates BK channel gating, however, is not well understood. Here we present a structure-based approach to the study of BK channels with the goal of providing a structural and functional model of the Ca 2+-activation mechanism. Sequence analysis of BK channel C-terminal domains and domains from prokaryotic homologs …", "num_citations": "15\n", "authors": ["832"]}
{"title": "Mir-30d regulates cardiac remodeling by intracellular and paracrine signaling\n", "abstract": " Rationale: Previous translational studies implicate plasma extracellular microRNA-30d (miR-30d) as a biomarker in left ventricular remodeling and clinical outcome in heart failure (HF) patients, although precise mechanisms remain obscure.   Objective: To investigate the mechanism of miR-30d–mediated cardioprotection in HF.   Methods and Results: In rat and mouse models of ischemic HF, we show that miR-30d gain of function (genetic, lentivirus, or agomiR-mediated) improves cardiac function, decreases myocardial fibrosis, and attenuates cardiomyocyte (CM) apoptosis. Genetic or locked nucleic acid–based knock-down of miR-30d expression potentiates pathological left ventricular remodeling, with increased dysfunction, fibrosis, and cardiomyocyte death. RNA sequencing of in vitro miR-30d gain and loss of function, together with bioinformatic prediction and experimental validation in cardiac myocytes and …", "num_citations": "14\n", "authors": ["832"]}
{"title": "PSFC: a pathway signal flow calculator app for cytoscape\n", "abstract": " Cell signaling pathways are sequences of biochemical reactions that propagate an input signal, such as a hormone binding to a cell-surface receptor, into the cell to trigger a reactive process. Assessment of pathway activities is crucial for determining which pathways play roles in disease versus normal conditions. To date various pathway flow/perturbation assessment tools are available, however they are constrained to specific algorithms and specific data types. There are no accepted standards for evaluation of pathway activities or simulation of flow propagation events in pathways, and the results of different software are difficult to compare. Here we present Pathway Signal Flow Calculator (PSFC), a Cytoscape app for calculation of a pathway signal flow based on the pathway topology and node input data. The app provides a rich framework for customization of different signal flow algorithms to allow users to …", "num_citations": "14\n", "authors": ["832"]}
{"title": "Setsapp for cytoscape: Set operations for cytoscape nodes and edges\n", "abstract": " setsApp (http://apps. cytoscape. org/apps/setsapp) is a relatively simple Cytoscape 3 app for users to handle groups of nodes and/or edges. It supports several important biological workflows and enables various set operations. setsApp provides basic tools to create sets of nodes or edges, import or export sets, and perform standard set operations (union, difference, intersection) on those sets. Automatic set partitioning and layout functions are also provided. The sets functionality is also exposed to users and app developers in the form of a set of commands that can be used for scripting purposes or integrated in other Cytoscape apps.", "num_citations": "12\n", "authors": ["832"]}
{"title": "CyAnimator: simple animations of Cytoscape networks\n", "abstract": " CyAnimator (http://apps. cytoscape. org/apps/cyanimator) is a Cytoscape app that provides a tool for simple animations of Cytoscape networks. The tool allows you to take a series of snapshots (CyAnimator calls them frames) of Cytoscape networks. For example, the first frame might be of a network shown from a” zoomed out” viewpoint and the second frame might focus on a specific group of nodes. Once these two frames are captured by the tool, it can animate between them by interpolating the changes in location, zoom, node color, node size, edge thickness, presence or absence of annotations, etc. The animations may be saved as a series of individual frames, animated GIFs, or H. 264/MP4 movies.", "num_citations": "11\n", "authors": ["832"]}
{"title": "A new strontium-copper ethylene glycol complex: synthesis and structure of [Sr (C2H6O2) 5][Cu (C2H4O2) 2]· C2H6O2\n", "abstract": " A new crystalline strontium-copper ethylene glycol complex has been isolated and structurally characterized by single-crystal X-ray diffraction. The solution-phase complex has also been investigated as a possible molecular precursor for use in sol-gel synthesis of SrCuO 2.[Sr (C 2 H 6 O 2) 5][Cu (C 2 H 4 O 2) 2]· C 2 H 6 O 2 has been isolated by crystallization from an ethylene glycol/methylethylketone solution of the strontium-copper salt. Crystallographic data are as follows: orthorhombic, space group Pna2 1, a= 18.494 (3), b= 9.3076 (8), c= 16.615 (3) Å, V= 2860 (2) A ̊ 3, Z= 4, R= 0.044. In this molecule, copper is coordinated by two bidentate ethylene glycolate ligands in roughly a square planar geometry. Strontium is coordinated by three bidentate ethylene glycol molecules and two monodentate ethylene glycol molecules; the eight-fold coordination resembles a highly-distorted square antiprism. An additional …", "num_citations": "9\n", "authors": ["832"]}
{"title": "Proteomic analysis of heart failure hospitalization among patients with chronic kidney disease: The Heart and Soul Study\n", "abstract": " Background Patients with chronic kidney disease (CKD) are at increased risk for heart failure (HF). We aimed to investigate differences in proteins associated with HF hospitalizations among patients with and without CKD in the Heart and Soul Study.   Methods and results We measured 1068 unique plasma proteins from baseline samples of 974 participants in The Heart and Soul Study who were followed for HF hospitalization over a median of 7 years. We sequentially applied forest regression and Cox survival analyses to select prognostic proteins. Among participants with CKD, four proteins were associated with HF at Bonferroni-level significance (p<2.5x10-4): Angiopoietin-2 (HR[95%CI] 1.45[1.33, 1.59]), Spondin-1 (HR[95%CI] 1.13 [1.06, 1.20]), tartrate-resistant acid phosphatase type 5 (HR[95%CI] 0.65[0.53, 0.78]) and neurogenis locus notch homolog protein 1 (NOTCH1) (HR[95%CI] 0.67[0.55, 0.80]). These associations persisted at p<0.01 after adjustment for age, estimated glomerular filtration and history of HF. CKD was a significant interaction term in the associations of NOTCH1 and Spondin-1 with HF. Pathway analysis showed a trend for higher representation of the Cardiac Hypertrophy and Complement/Coagulation pathways among proteins prognostic of HF in the CKD sub-group.   Conclusions These results suggest that markers of heart failure differ between patients with and without CKD. Further research is needed to validate novel markers in cohorts of patients with CKD and adjudicated HF events.", "num_citations": "8\n", "authors": ["832"]}
{"title": "The Cytoscape Automation app article collection\n", "abstract": " Cytoscape is the premiere platform for interactive analysis, integration and visualization of network data. While Cytoscape itself delivers much basic functionality, it relies on community-written apps to deliver specialized functions and analyses. To date, Cytoscape’s CyREST feature has allowed researchers to write workflows that call basic Cytoscape functions, but provides no access to its high value app-based functions. With Cytoscape Automation, workflows can now call apps that have been upgraded to expose their functionality. This article collection is a resource to assist readers in quickly and economically leveraging such apps in reproducible workflows that scale independently to large data sets and production runs.", "num_citations": "8\n", "authors": ["832"]}
{"title": "The Cytoscape app article collection\n", "abstract": " As a network visualization and analysis platform, Cytoscape relies on apps to provide domain-specific features and functions. There are many resources available to support Cytoscape app development and distribution, including the Cytoscape App Store and an online “cookbook” for app developers. This article collection is another resource to help researchers find out more about relevant Cytoscape apps and to provide app developers with useful implementation tips. The collection will grow over time as new Cytoscape apps are developed and published.", "num_citations": "8\n", "authors": ["832"]}
{"title": "Circulating miRNAs and risk of sudden death in patients with coronary heart disease\n", "abstract": " Objectives This study evaluated whether plasma miRNAs were specifically associated with sudden cardiac and/or arrhythmic death (SCD) in a cohort of patients with coronary heart disease (CHD), most of whom were without primary prevention implantable cardioverter-defibrillators.   Background Novel biomarkers for sudden death risk stratification are needed in patients with CHD to more precisely target preventive therapies, such as implantable cardioverter-defibrillators. miRNAs have been implicated in regulating inflammation and cardiac fibrosis in cells, and plasma miRNAs have been shown to predict cardiovascular death in patients with CHD.   Methods We performed a nested case control study within a multicenter cohort of 5,956 patients with CHD followed prospectively for SCD. Plasma levels of 18 candidate miRNAs previously associated with cardiac remodeling were measured in 129 SCD cases and …", "num_citations": "6\n", "authors": ["832"]}
{"title": "BridgeDb app: unifying identifier mapping services for Cytoscape\n", "abstract": " The BridgeDb app for Cytoscape allows users to map and annotate identifiers of genes, proteins and metabolites in the context of biological networks. The app greatly simplifies the identifier mapping process in Cytoscape by providing a unified interface to different mapping resources and services. The app also provides a programming interface via Cytoscape Commands that can be utilized for identifier mapping by other Cytoscape apps. In this article we provide a technical guide to the BridgeDb app for mapping identifiers in Cytoscape.", "num_citations": "6\n", "authors": ["832"]}
{"title": "Pathway information extracted from 25 years of pathway figures\n", "abstract": " Thousands of pathway diagrams are published each year as static figures inaccessible to computational queries and analyses. Using a combination of machine learning, optical character recognition, and manual curation, we identified 64,643 pathway figures published between 1995 and 2019 and extracted 1,112,551 instances of human genes, comprising 13,464 unique NCBI genes, participating in a wide variety of biological processes. This collection represents an order of magnitude more genes than found in the text of the same papers, and thousands of genes missing from other pathway databases, thus presenting new opportunities for discovery and research.", "num_citations": "5\n", "authors": ["832"]}
{"title": "Research synergy and drug development: Bright stars in neighboring constellations\n", "abstract": " Drug discovery and subsequent availability of a new breakthrough therapeutic or ‘cure’ is a compelling example of societal benefit from research advances. These advances are invariably collaborative, involving the contributions of many scientists to a discovery network in which theory and experiment are built upon. To document and understand such scientific advances, data mining of public and commercial data sources coupled with network analysis can be used as a digital methodology to assemble and analyze component events in the history of a therapeutic. This methodology is extensible beyond the history of therapeutics and its use more generally supports (i) efficiency in exploring the scientific history of a research advance (ii) documenting and understanding collaboration (iii) portfolio analysis, planning and optimization (iv) communication of the societal value of research. Building upon prior art, we have …", "num_citations": "5\n", "authors": ["832"]}
{"title": "Comprehensive metabolic phenotyping refines cardiovascular risk in young adults\n", "abstract": " Background: Whereas cardiovascular disease (CVD) metrics define risk in individuals >40 years of age, the earliest lesions of CVD appear well before this age. Despite the role of metabolism in CVD antecedents, studies in younger, biracial populations to define precise metabolic risk phenotypes are lacking.   Methods: We studied 2330 White and Black young adults (mean age, 32 years; 45% Black) in the CARDIA study (Coronary Artery Risk Development in Young Adults) to identify metabolite profiles associated with an adverse CVD phenome (myocardial structure/function, fitness, vascular calcification), mechanisms, and outcomes over 2 decades. Statistical learning methods (elastic nets/principal components analysis) and Cox regression generated parsimonious, metabolite-based risk scores validated in >1800 individuals in the Framingham Heart Study.   Results: In the CARDIA study, metabolite profiles …", "num_citations": "4\n", "authors": ["832"]}
{"title": "PathwayPCA: an R/Bioconductor Package for Pathway Based Integrative Analysis of Multi‐Omics Data\n", "abstract": " The authors present pathwayPCA, an R/Bioconductor package for integrative pathway analysis that utilizes modern statistical methodology, including supervised and adaptive, elastic‐net, sparse principal component analysis. pathwayPCA can be applied to continuous, binary, and survival outcomes in studies with multiple covariates and/or interaction effects. It outperforms several alternative methods at identifying disease‐associated pathways in integrative analysis using both simulated and real datasets. In addition, several case studies are provided to illustrate pathwayPCA analysis with gene selection, estimating, and visualizing sample‐specific pathway activities, identifying sex‐specific pathway effects in kidney cancer, and building integrative models for predicting patient prognosis. pathwayPCA is an open‐source R package, freely available through the Bioconductor repository. pathwayPCA is expected to …", "num_citations": "4\n", "authors": ["832"]}
{"title": "Identifier mapping in cytoscape\n", "abstract": " Identifier Mapping, the association of terms across disparate taxonomies and databases, is a common hurdle in bioinformatics workflows. The idmapper app for Cytoscape simplifies identifier mapping for genes and proteins in the context of common biological networks. This app provides a unified interface to different identifier resources accessible through a right-click on the table's column header. It also provides an OSGi programming interface via Cytoscape Commands and CyREST that can be utilized for identifier mapping in scripts and other Cytoscape apps, and supports integrated Swagger documentation.", "num_citations": "4\n", "authors": ["832"]}
{"title": "The Dynamic Platelet Transcriptome in Obesity and Weight Loss\n", "abstract": " Objective: Adiposity is associated with oxidative stress, inflammation, and glucose intolerance. Previous data suggest that platelet gene expression is associated with key cardiometabolic phenotypes, including body mass index but stable in healthy individuals over time. However, modulation of gene expression in platelets in response to metabolic shifts (eg, weight reduction) is unknown and may be important to defining mechanism.   Approach and Results: Platelet RNA sequencing and aggregation were performed from 21 individuals with massive weight loss (>45 kg) following bariatric surgery. Based on RNA sequencing data, we measured the expression of 67 genes from isolated platelet RNA using high-throughput quantitative reverse transcription quantitative PCR in 1864 FHS (Framingham Heart Study) participants. Many transcripts not previously studied in platelets were differentially expressed with bariatric …", "num_citations": "3\n", "authors": ["832"]}
{"title": "Identifying genes in published pathway figure images\n", "abstract": " BACKGROUND Pathway figures are commonly found in the biomedical literature providing intuitive models of complex processes in a visually concise format. The contents of a pathway figure often reflect the key findings and relevant context of an article. Unfortunately, the vast majority of pathway figures are drawn as one-off static images despite freely available pathway tools and resources, thus rendering their contents inaccessible to search, data mining and downstream analysis.APPROACH Leveraging advances in optical character recognition and domain expertise in pathway modeling, we devised an approach to identify genes in published pathway figures. The approach was optimized against a set of figure images obtained from PubMed Central and tested against a set of 400 curated pathways with known content from WikiPathways (F-measure 95.2%).RESULTS Applied to 3982 published pathway figures spanning a four year period, our approach identified 29,189 gene symbols representing 4159 unique gene identifiers. The gene content unlocked from just this small sample of published figures includes novel and diverse pathway associations unmatched by any pathway database. Our approach over doubled the number of genes associated with the articles containing these figures as compared to combined annotations available from PubMed and PubTator. Encouraged by these initial results, we plan to scale the approach to make the molecular contents of the continuing stream of published pathway figures more accessible.", "num_citations": "3\n", "authors": ["832"]}
{"title": "Translational epidemiology: entering a brave new world of team science\n", "abstract": " epidemiology toward variation in the circulating metabolome, transcriptome, and most recently the proteome in search for functional biomarkers and novel mechanisms of cardiovascular disease. Seminal investigations in large US-and Europeanbased cohorts have established circulating branched–chain amino acids as markers of cardiometabolic disease independent of obesity, in line with mechanistic observations in smaller human and animal studies of their role in insulin resistance in muscle tissue. 6, 7 In comparison, the prognostic importance of the plasma proteome has been reported in 2 major cohort studies so far, 8, 9 with preliminary data suggesting modest improvement in diagnostic sensitivity beyond traditional risk factors. In final, there is a growing interest in the role of the bloodbased transcriptome in human disease. 10 The importance of both protein-and nonprotein-coding genes in bridging genetics …", "num_citations": "3\n", "authors": ["832"]}
{"title": "Molecular signature of multisystem cardiometabolic stress and its association with prognosis\n", "abstract": " ImportanceCardiometabolic disease is responsible for decreased longevity and poorer cardiovascular outcomes in the modern era. Metabolite profiling provides a specific measure of global metabolic function to examine specific metabolic mechanisms and pathways of cardiometabolic disease beyond its clinical definitions.ObjectivesTo define a molecular basis for cardiometabolic stress and assess its association with cardiovascular prognosis.Design, Setting, and ParticipantsA prospective observational cohort study was conducted in a population-based setting across 2 geographically distinct centers (Boston Puerto Rican Health Study [BPRHS], an ongoing study of individuals enrolled between June 1, 2004, and October 31, 2009; and Atherosclerosis Risk in Communities [ARIC] study, whose participants were originally sampled between November 24, 1986, and February 10, 1990, and followed up through …", "num_citations": "2\n", "authors": ["832"]}
{"title": "WikiPathways: Pathway Editing for the People\n", "abstract": " Biological pathways provide intuitive views of the myriad of interactions underlying biological processes. A typical signaling pathway, for example, can represent receptor-binding events, protein complexes, phosphorylation reactions, translocations and transcriptional regulation, with only a minimal set of symbols, lines and arrows. These powerful representations are essential tools, common among the textbooks and review articles that document any given field of biology. Making these tools available for computational methods of analysis will allow researchers to connect pathways to databases of biological annotations and experimental data, creating effective products of systems biology. Collecting and maintaining pathway information in a robust database, however, is an ongoing challenge.To facilitate pathway contributions and maintenance from the scientific community, we recently established www …", "num_citations": "2\n", "authors": ["832"]}
{"title": "Shared Mechanisms Govern HIV Transcriptional Suppression in Circulating CD103+ and Gut CD4+ T Cells\n", "abstract": " Latent HIV infection is the main barrier to cure, and most HIV-infected cells reside in the gut, where distinct but unknown mechanisms may promote viral latency. Transforming growth factor β (TGF-β), which induces the expression of CD103 on tissue-resident memory T cells, has been implicated in HIV latency. Using CD103 as a surrogate marker to identify cells that have undergone TGF-β signaling, we compared the HIV RNA/DNA contents and cellular transcriptomes of CD103+ and CD103− CD4 T cells from the blood and rectum of HIV-negative (HIV−) and antiretroviral therapy (ART)-suppressed HIV-positive (HIV+) individuals. Like gut CD4+ T cells, circulating CD103+ cells harbored more HIV DNA than did CD103− cells but transcribed less HIV RNA per provirus. Circulating CD103+ cells also shared a gene expression profile that is closer to that of gut CD4 T cells than to that of circulating CD103− cells, with …", "num_citations": "1\n", "authors": ["832"]}
{"title": "ERNIE: A data platform for research assessment\n", "abstract": " Data mining coupled to network analysis has been successfully used to study relationships between basic discovery and translational applications such as drug development; and to document research collaborations and knowledge flows. Assembling relevant data for such studies in a form that supports analysis presents challenges. We have developed Enhanced Research Network Information Environment (ERNIE), an open source, scalable cloud-based platform that (i) integrates data drawn from public and commercial sources (ii) provides users with analytical workflows that incorporate expert input at critical stages. A modular design enables the addition, deletion, or substitution of data sources. To demonstrate the capabilities of ERNIE, we have conducted case studies that span drug development and pharmacogenetics. In these studies, we analyze data from regulatory documents, bibliographic and patent databases, research grant records, and clinical trials, to document collaborations and identify influential research accomplishments.", "num_citations": "1\n", "authors": ["832"]}
{"title": "Local cortical injections of glutamate and noradrenaline alter high-frequency (245 Hz) neuronal activity in rat cortex\n", "abstract": " Data collected from rat frontal cortical neurons has shown a surprising change in power levels at frequencies surrounding 245 Hz following local injections of the neurotransmitters noradrenaline and glutamate. The power spectrum does not change anywhere else up to 1000 Hz. This effect does not appear to be related to the firing rate of individual neurons, nor the overall power spectral densities.", "num_citations": "1\n", "authors": ["832"]}