{"title": "Dec: Service demand estimation with confidence\n", "abstract": " We present a new technique for predicting the resource demand requirements of services implemented by multitier systems. Accurate demand estimates are essential to ensure the efficient provisioning of services in an increasingly service-oriented world. The demand estimation technique proposed in this paper has several advantages compared with regression-based demand estimation techniques, which many practitioners employ today. In contrast to regression, it does not suffer from the problem of multicollinearity, it provides more reliable aggregate resource demand and confidence interval predictions, and it offers a measurement-based validation test. The technique can be used to support system sizing and capacity planning exercises, costing and pricing exercises, and to predict the impact of changes to a service upon different service customers.", "num_citations": "36\n", "authors": ["725"]}
{"title": "MODE: Mix driven on-line resource demand estimation\n", "abstract": " Adaptive performance management solutions often rely on models that require accurate resource demand measures that are estimated in an on-line manner. However it is typically not possible to directly measure resource demands at the abstraction they are needed, e.g., for a software service within an application server that is invoked by a URL. For such cases, linear regression techniques are often used to estimate resource demands. We evaluate the effectiveness of the Least Squares (LSQ) and Least Absolute Deviations (LAD) regression techniques, used extensively by others, as well as Support Vector Regression (SVR) for the purpose of demand estimation. To the best of our knowledge SVR has not yet been evaluated for computer resource demand estimation. We consider the predictive accuracy of these methods for three different real and simulated workloads. Our results demonstrate the importance of …", "num_citations": "30\n", "authors": ["725"]}
{"title": "Resource demand modeling for multi-tier services\n", "abstract": " We present a new technique for predicting the resource demand requirements of services implemented by multi-tier systems. Accurate demand estimates are essential to ensure the efficient provisioning of services in an increasingly service-oriented world. The demand estimation technique proposed in this paper has several advantages compared with regression-based demand estimation techniques, which many practitioners employ today. In contrast to regression, it does not suffer from the problem of multicollinearity, it provides more reliable aggregate resource demand and confidence interval predictions, and it offers a measurement-based validation test. The technique can be used to support system sizing and capacity planning exercises, costing and pricing exercises, and to predict the impact of changes to a service upon different service customers.", "num_citations": "22\n", "authors": ["725"]}
{"title": "Automatic stress testing of multi-tier systems by dynamic bottleneck switch generation\n", "abstract": " The performance of multi-tier systems is known to be significantly degraded by workloads that place bursty service demands on system resources. Burstiness can cause queueing delays, oversubscribe limited threading resources, and even cause dynamic bottleneck switches between resources. Thus, there is need for a methodology to create benchmarks with controlled burstiness and bottleneck switches to evaluate their impact on system performance. We tackle this problem using a model-based technique for the automatic and controlled generation of bursty benchmarks. Markov models are constructed in an automated manner to model the distribution of service demands placed by sessions of a given system on various system resources. The models are then used to derive session submission policies that result in user-specified levels of service demand burstiness for resources at the different tiers in a …", "num_citations": "19\n", "authors": ["725"]}
{"title": "Burn: Enabling workload burstiness in customized service benchmarks\n", "abstract": " We introduce BURN, a methodology to create customized benchmarks for testing multitier applications under time-varying resource usage conditions. Starting from a set of preexisting test workloads, BURN finds a policy that interleaves their execution to stress the multitier application and generate controlled burstiness in resource consumption. This is useful to study, in a controlled way, the robustness of software services to sudden changes in the workload characteristics and in the usage levels of the resources. The problem is tackled by a model-based technique which first generates Markov models to describe resource consumption patterns of each test workload. Then, a policy is generated using an optimization program which sets as constraints a target request mix and user-specified levels of burstiness at the different resources in the system. Burstiness is quantified using a novel metric called overdemand …", "num_citations": "18\n", "authors": ["725"]}
{"title": "Wireless security in UAE: A survey paper\n", "abstract": " Wireless Local Area Networks (WLAN) used by residents and companies in two major cities of the United Arab Emirates (UAE). The goal is to study the security vulnerabilities that lie beneath the usage of WLAN by the public in UAE. Data will be collected from various populated sites and will be analyzed to better understand the wireless security awareness among the public.", "num_citations": "9\n", "authors": ["725"]}
{"title": "Simulation by example for complex systems\n", "abstract": " Our goal is to support capacity management for systems such as hospitals, campuses, and cities, which utilize resources such as people, places, and things in complex ways. Simulation tools have traditionally been used for these sorts of studies, but they require expert model builders to create and maintain abstract business process models of the system under study. This can lead to a lack of representativeness and difficulty in adapting the model for additional or different study scenarios. This paper presents a new simulation approach, Simulation By Example, which overcomes these problems by guiding the simulation using traces, i.e., examples, of the behavior of the actual system but without requiring explicit business process models to be authored. Instead we rely on system instrumentation to capture the traces. We demonstrate the method in two case studies for healthcare systems as described in recent …", "num_citations": "6\n", "authors": ["725"]}
{"title": "Automatically generating bursty benchmarks for multitier systems\n", "abstract": " Burstiness in resource consumption of requests has been recently observed to be a fundamental performance driver for multi-tier applications. This motivates the need for a methodology to create benchmarks with controlled burstiness that helps to improve the effectiveness of system sizing efforts and makes application testing more comprehensive. We tackle this problem using a model-based technique for the automatic and controlled generation of bursty benchmarks. Phase-type models are constructed in an automated manner to model the distribution of service demands placed by user sessions on various system resources. The models are then used to derive session submission policies that result in user-specified levels of service demand burstiness for resources at the different tiers in a system. A case study using a three-tier TPC-W testbed shows that our method is able to control and predict burstiness for …", "num_citations": "6\n", "authors": ["725"]}
{"title": "System and method for resource partitioning in distributed computing\n", "abstract": " A method for resource allocation in a distributed computing system receives data indicative of a total number of computing resources in a compute cluster of the distributed computing system, generates resource pools in accordance with the total number of computing resources, each of the plurality of resource pools associated with a quantity of computing resources that is included in one or more partitions of the total quantity of resources; assigns a weight to each of the resource pools based on the quantity of computing resources associated with each resource pool; and sends the resource pools and the weights assigned to each resource pool to a scheduler of the compute cluster.", "num_citations": "1\n", "authors": ["725"]}
{"title": "AMIR: Analytic method for improving responsiveness by reducing burstiness\n", "abstract": " Service demand burstiness, or serial correlations in resource service demands, has previously been shown to have an adverse impact on system performance metrics such as response time. This article proposes AMIR, an analytic framework to characterize burstiness and identify strategies to reduce its impact on performance. AMIR considers an overtake-free system model consisting of multiple queues that service multiple classes of sessions, i.e., sequences of requests. Given the per-class service demand distributions and number of sessions belonging to each class, AMIR can identify an ordering of sessions, i.e., a schedule, that minimizes burstiness at the bottleneck. Hence, it is likely to improve system responsiveness metrics, including mean session wait time and total schedule processing time. To characterize burstiness, the technique uses an order O schedule burstiness metric βO representing the mean …", "num_citations": "1\n", "authors": ["725"]}