{"title": "Steganography on RGB Images Based on a\" Matrix Pattern\" using Random Blocks\n", "abstract": " In this paper, we describe a novel spatial domain method for steganography in RGB images where a secret message is embedded in the blue layer of certain blocks. In this algorithm, each block first chooses a unique t1xt2 matrix of pixels as a “matrix pattern” for each keyboard character, using the bit difference of neighbourhood pixels. Next, a secret message is embedded in the remaining part of the block, those without any role in the “matrix pattern” selection procedure. In this procedure, each pattern sums up with the blue layer of the image. For increasing the security, blocks are chosen randomly using a random generator. The results show that this algorithm is highly resistant against the frequency and spatial domain attacks including RS, Sample pair, X2 and DCT based attacks. In addition, the proposed algorithm could provide more than 84.26 times of capacity comparing with a competitive method. Moreover, the results indicated that stego-image has almost 1.73 times better transparency than the competitive algorithm.", "num_citations": "30\n", "authors": ["2124"]}
{"title": "A novel steganography method based on matrix pattern and LSB algorithms in RGB images\n", "abstract": " In this paper, a new steganography algorithm that combines two different steganography methods, namely Matrix Pattern (MP) and Least Significant Bit (LSB), is presented for RGB images. These two methods use the spatial domain of images for hiding secret messages; however, they differ from each other, fundamentally. The MP method is an algorithm which, firstly, divides the \"Cover-Image\" into non-overlapping B×B blocks. Then, it hides the data in the 4th through 7th bit layers of the blue layer of the \"Cover-Image\", by generating unique tixt2 matrix patterns for each character in each block. The LSB method is an algorithm that hides data in the least significant bit of the \"Cover-Image\" pixels, which has the least visible effect on the transparency of the \"Stego-Image\". In the proposed algorithm, the first three bit layers, and the 4th to 7th bit layers of the blue layer of the RGB \"Cover-Image\" is used for hiding the …", "num_citations": "23\n", "authors": ["2124"]}
{"title": "Block Texture Pattern Detection Based on Smoothness and Complexity of Neighborhood Pixels.\n", "abstract": " In this paper, a novel method for detecting Block Texture Patterns (BTP), based on two measures: smoothness and complexity of neighborhood pixels is proposed. With these two measures, a new classification for texture detection is defined. Texture detection with these measures can be used in many image processing and computer vision applications. As an example, the applicability of BTP on data hiding algorithms is discussed, and the advantages of this classification on these algorithms are shown.", "num_citations": "9\n", "authors": ["2124"]}