{"title": "Express virtual channels: towards the ideal interconnection fabric\n", "abstract": " Due to wire delay scalability and bandwidth limitations inherent in shared buses and dedicated links, packet-switched on-chip interconnection networks are fast emerging as the pervasive communication fabric to connect different processing elements in many-core chips. However, current state-of-the-art packet-switched networks rely on complex routers which increases the communication overhead and energy consumption as compared to the ideal interconnection fabric. In this paper, we try to close the gap between the state-of-the-art packet-switched network and the ideal interconnect by proposing express virtual channels (EVCs), a novel flow control mechanism which allows packets to virtually bypass intermediate routers along their path in a completely non-speculative fashion, thereby lowering the energy/delay towards that of a dedicated wire while simultaneously approaching ideal throughput with a practical …", "num_citations": "508\n", "authors": ["188"]}
{"title": "Connectivity and inference problems for temporal networks\n", "abstract": " Many network problems are based on fundamental relationships involving time. Consider, for example, the problems of modeling the flow of information through a distributed network, studying the spread of a disease through a population, or analyzing the reachability properties of an airline timetable. In such settings, a natural model is that of a graph in which each edge is annotated with a time label specifying the time at which its endpoints “communicated.” We will call such a graph a temporal network. To model the notion that information in such a network “flows” only on paths whose labels respect the ordering of time, we call a path time-respecting if the time labels on its edges are non-decreasing. The central motivation for our work is the following question: how do the basic combinatorial and algorithmic properties of graphs change when we impose this additional temporal condition? The notion of a path is …", "num_citations": "462\n", "authors": ["188"]}
{"title": "Provisioning a virtual private network: a network design problem for multicommodity flow\n", "abstract": " Consider a setting in which a group of nodes, situated in a large underlying network, wishes to reserve bandwidth on which to support communication. Virtual private networks (VPNs) are services that support such a construct; rather than building a new physical network on the group of nodes that must be connected, bandwidth in the underlying network is reserved for communication within the group, forming a virtual “sub-network.”", "num_citations": "371\n", "authors": ["188"]}
{"title": "A new method for solving fully fuzzy linear programming problems\n", "abstract": " Lotfi et al. [Solving a full fuzzy linear programming using lexicography method and fuzzy approximate solution, Appl. Math. Modell. 33 (2009) 3151–3156] pointed out that there is no method in literature for finding the fuzzy optimal solution of fully fuzzy linear programming (FFLP) problems and proposed a new method to find the fuzzy optimal solution of FFLP problems with equality constraints. In this paper, a new method is proposed to find the fuzzy optimal solution of same type of fuzzy linear programming problems. It is easy to apply the proposed method compare to the existing method for solving the FFLP problems with equality constraints occurring in real life situations. To illustrate the proposed method numerical examples are solved and the obtained results are discussed.", "num_citations": "359\n", "authors": ["188"]}
{"title": "A simple linear time (1+/spl epsiv/)-approximation algorithm for k-means clustering in any dimensions\n", "abstract": " We present the first linear time (1 + /spl epsiv/)-approximation algorithm for the k-means problem for fixed k and /spl epsiv/. Our algorithm runs in O(nd) time, which is linear in the size of the input. Another feature of our algorithm is its simplicity - the only technique involved is random sampling.", "num_citations": "327\n", "authors": ["188"]}
{"title": "Maximum coverage problem with group budget constraints and applications\n", "abstract": " We study a variant of the maximum coverage problem which we label the maximum coverage problem with group budget constraints (MCG). We are given a collection of sets  where each set S                                            i                  is a subset of a given ground set X. In the maximum coverage problem the goal is to pick k sets from  to maximize the cardinality of their union. In the MCG problem  is partitioned into groupsG                         1, G                         2, ..., G                         ℓ. The goal is to pick k sets from  to maximize the cardinality of their union but with the additional restriction that at most one set be picked from each group. We motivate the study of MCG by pointing out a variety of applications. We show that the greedy algorithm gives a 2-approximation algorithm for this problem which is tight in the oracle model. We also obtain a constant factor approximation algorithm for the cost …", "num_citations": "239\n", "authors": ["188"]}
{"title": "Thermal modeling, characterization and management of on-chip networks\n", "abstract": " Due to the wire delay constraints in deep submicron technology and increasing demand for on-chip bandwidth, networks are becoming the pervasive interconnect fabric to connect processing elements on chip. With ever-increasing power density and cooling costs, the thermal impact of on-chip networks needs to be urgently addressed. In this work, we first characterize the thermal profile of the MIT Raw chip. Our study shows networks having comparable thermal impact as the processing elements and contributing significantly to overall chip temperature, thus motivating the need for network thermal management. The characterization is based on an architectural thermal model we developed for on-chip networks that takes into account the thermal correlation between routers across the chip and factors in the thermal contribution of on-chip interconnects. Our thermal model is validated against finite-element based …", "num_citations": "236\n", "authors": ["188"]}
{"title": "Simpler and better approximation algorithms for network design\n", "abstract": " We give simple and easy-to-analyze randomized approximation algorithms for several well-studied NP-hard network design problems. Our algorithms improve over the previously best known approximation ratios. Our main results are the following.", "num_citations": "210\n", "authors": ["188"]}
{"title": "Clustering with spectral norm and the k-means algorithm\n", "abstract": " There has been much progress on efficient algorithms for clustering data points generated by a mixture of k probability distributions under the assumption that the means of the distributions are well-separated, i.e., the distance between the means of any two distributions is at least Ω(k) standard deviations. These results generally make heavy use of the generative model and particular properties of the distributions. In this paper, we show that a simple clustering algorithm works without assuming any generative (probabilistic) model. Our only assumption is what we call a \"proximity condition'': the projection of any data point onto the line joining its cluster center to any other cluster center is Ω(k) standard deviations closer to its own center than the other center. Here the notion of standard deviations is based on the spectral norm of the matrix whose rows represent the difference between a point and the mean of the …", "num_citations": "191\n", "authors": ["188"]}
{"title": "HybDTM: a coordinated hardware-software approach for dynamic thermal management\n", "abstract": " With ever-increasing power density and cooling costs in modern high-performance systems, dynamic thermal management (DTM) has emerged as an effective technique for guaranteeing thermal safety at run-time. While past works on DTM have focused on different techniques in isolation, they fail to consider a synergistic mechanism using both hardware and software support and hence lead to a significant execution time overhead. In this paper, we propose HybDTM, a methodology for fine-grained, coordinated thermal management using a hybrid of hardware techniques, such as clock gating, and software techniques, such as thermal-aware process scheduling, synergistically leveraging the advantages of both approaches. We show that while hardware techniques can be used reactively to manage thermal emergencies, proactive use of low-overhead software techniques can rely on application-specific thermal …", "num_citations": "185\n", "authors": ["188"]}
{"title": "A new approach for solving fuzzy transportation problems using generalized trapezoidal fuzzy numbers\n", "abstract": " In the literature, several algorithms are proposed for solving the transportation problems in fuzzy environment but in all the proposed algorithms the parameters are represented by normal fuzzy numbers. Chen [Operations on fuzzy numbers with function principal, Tamkang Journal of Management Science 6 (1985) 13–25] pointed out that in many cases it is not to possible to restrict the membership function to the normal form and proposed the concept of generalized fuzzy numbers. There are several papers in the literature in which generalized fuzzy numbers are used for solving real life problems but to the best of our knowledge, till now no one has used generalized fuzzy numbers for solving the transportation problems. In this paper, a new algorithm is proposed for solving a special type of fuzzy transportation problems by assuming that a decision maker is uncertain about the precise values of transportation cost …", "num_citations": "184\n", "authors": ["188"]}
{"title": "Algorithms for provisioning virtual private networks in the hose model\n", "abstract": " Virtual private networks (VPNs) provide customers with predictable and secure network connections over a shared network. The recently proposed hose model for VPNs allows for greater flexibility since it permits traffic to and from a hose endpoint to be arbitrarily distributed to other endpoints. We develop novel algorithms for provisioning VPNs in the hose model. We connect VPN endpoints using a tree structure and our algorithms attempt to optimize the total bandwidth reserved on edges of the VPN tree. We show that even for the simple scenario in which network links are assumed to have infinite capacity, the general problem of computing the optimal VPN tree is NP-hard. Fortunately, for the special case when the ingress and egress bandwidths for each VPN endpoint are equal, we can devise an algorithm for computing the optimal tree whose time complexity is O(mn), where m and n are the number of links and …", "num_citations": "164\n", "authors": ["188"]}
{"title": "Token flow control\n", "abstract": " As companies move towards many-core chips, an efficient on-chip communication fabric to connect these cores assumes critical importance. To address limitations to wire delay scalability and increasing bandwidth demands, state-of-the-art on-chip networks use a modular packet-switched design with routers at every hop which allow sharing of network channels over multiple packet flows. This, however, leads to packets going through a complex router pipeline at every hop, resulting in the overall communication energy/delay being dominated by the router overhead, as opposed to just wire energy/delay.", "num_citations": "153\n", "authors": ["188"]}
{"title": "Primal–dual algorithms for connected facility location problems\n", "abstract": " We consider the Connected Facility Location problem. We are given a graph  with costs  on the edges,  a set of facilities $\\F \\subseteq V$, and a set of clients $\\D \\subseteq V$. Facility  has a facility opening cost  and client  has  units of demand. We are also given a parameter . A solution opens some facilities, say , assigns each client  to an open facility , and connects the open facilities by a Steiner tree . The total cost incurred is ${\\sum}_{i\\in F} f_i+ sum_{j\\in\\D} d_jc_{i(j)j}+M\\sum_{e\\in T}c_e$. We want a solution of minimum cost. A special case of this problem  is when all opening costs are 0 and facilities may be opened anywhere, i.e., $\\F=V$. If we know a facility  that is open, then the problem becomes a special case of the single-sink buy-at-bulk problem with two cable types, also known as the rent-or-buy problem. We give the first primal–dual algorithms for these problems …", "num_citations": "146\n", "authors": ["188"]}
{"title": "Wavelength conversion in optical networks\n", "abstract": " In many models of optical routing, we are given a set of communication paths in a network, and we must assign a wavelength to each path so that paths sharing an edge receive different wavelengths. The goal is to assign as few wavelengths as possible in order to make as efficient use as possible of the optical bandwidth. A lot of work in the area of optical networks has considered the use of wavelength converters: if a node of a network contains a wavelength converter, any path that passes through this node may change its wavelength. Having converters at some of the nodes can reduce the number of wavelengths required for routing, down to the following natural congestion bound: even with converters, we will always need at least as many wavelengths as the maximum number of paths sharing a single edge. Thus Wilfong and Winkler defined a set S of nodes in a network to be sufficient if, placing converters at …", "num_citations": "146\n", "authors": ["188"]}
{"title": "Algorithms for provisioning virtual private networks in the hose model\n", "abstract": " Virtual Private Networks (VPNs) provide customers with predictable and secure network connections over a shared network. The recently proposed hose model for VPNs allows for greater flexibility since it permits traffic to and from a hose endpoint to be arbitrarily distributed to other endpoints. In this paper, we develop novel algorithms for provisioning VPNs in the hose model. We connect VPN endpoints using a tree structure and our algorithms attempt to optimize the total bandwidth reserved on edges of the VPN tree. We show that even for the simple scenario in which network links are assumed to have infinite capacity, the general problem of computing the optimal VPN tree is NP hard. Fortunately, for the special case when the ingress and egress bandwidths for each VPN endpoint are equal, we can devise an algorithm for computing the optimal tree whose time complexity is O (mn), where m and n are the …", "num_citations": "140\n", "authors": ["188"]}
{"title": "A new method for solving fuzzy transportation problems using ranking function\n", "abstract": " In the literature, several methods are proposed for solving transportation problems in fuzzy environment but in all the proposed methods the parameters are represented by normal fuzzy numbers. [S.H. Chen, Operations on fuzzy numbers with function principal, Tamkang Journal of Management Sciences 6 (1985) 13–25] pointed out that in many cases it is not to possible to restrict the membership function to the normal form and proposed the concept of generalized fuzzy numbers. There are several papers in the literature in which generalized fuzzy numbers are used for solving real life problems but to the best of our knowledge, till now no one has used generalized fuzzy numbers for solving the transportation problems. In this paper, a new method is proposed for solving fuzzy transportation problems by assuming that a decision maker is uncertain about the precise values of the transportation cost, availability and …", "num_citations": "135\n", "authors": ["188"]}
{"title": "Linear-time approximation schemes for clustering problems in any dimensions\n", "abstract": " We present a general approach for designing approximation algorithms for a fundamental class of geometric clustering problems in arbitrary dimensions. More specifically, our approach leads to simple randomized algorithms for the k-means, k-median and discrete k-means problems that yield (1+ε) approximations with probability ≥ 1/2 and running times of O(2(k/ε)O(1) dn). These are the first algorithms for these problems whose running times are linear in the size of the input (nd for n points in d dimensions) assuming k and ε are fixed. Our method is general enough to be applicable to clustering problems satisfying certain simple properties and is likely to have further applications.", "num_citations": "127\n", "authors": ["188"]}
{"title": "Deterministic wavelet thresholding for maximum-error metrics\n", "abstract": " Several studies have demonstrated the effectiveness of the wavelet, decomposition as a tool for reducing large amounts of data down to compact, wavelet synopses that can be used to obtain fast, accurate approximate answers to user queries. While conventional wavelet synopses are based on greedily minimizing the overall root-mean-squared (ie, L 2-norm) error in the data approximation, recent work has demonstrated that such synopses can suffer from important problems, including severe bias and wide variance in the quality of the data reconstruction, and lack of non-trivial guarantees for individual approximate answers. As a result, probabilistic thresholding schemes have been recently proposed as a means of building wavelet synopses that try to probabilistically control other approximation-error metrics, such as the maximum relative error in data-value reconstruction, which is arguably the most important for …", "num_citations": "127\n", "authors": ["188"]}
{"title": "Toward ideal on-chip communication using express virtual channels\n", "abstract": " Current on-chip networks use a packet-switched design with a complex router at every hop, which imposes significant communication energy, delay, and throughput overhead. we propose reducing energy and delay, and increasing throughput, using express virtual channels. packets traveling along these virtual express lanes, which connect distant nodes in the network, bypass intermediate routers, significantly reducing router overhead.", "num_citations": "119\n", "authors": ["188"]}
{"title": "Efficient load-balancing routing for wireless mesh networks\n", "abstract": " Wireless mesh networks (WMNs) consist of static wireless routers, some of which, called gateways, are directly connected to the wired infrastructure. User stations are connected to the wired infrastructure via wireless routers. This paper presents a simple and effective management architecture for WMNs, termed configurable access network (CAN). Under this architecture, the control function is separated from the switching function, so that the former is performed by an network operation center (NOC) which is located in the wired infrastructure. The NOC monitors the network topology and user performance requirements, from which it computes a path between each wireless router and a gateway, and allocates fair bandwidth for carrying the associated traffic along the selected route. By performing such functions in the NOC, we offload the network management overhead from wireless routers, and enable the …", "num_citations": "117\n", "authors": ["188"]}
{"title": "Multi-processor scheduling to minimize flow time with ε resource augmentation\n", "abstract": " We investigate the problem of online scheduling of jobs to minimize flow time and stretch on m identical machines. We consider the case where the algorithm is given either (1+ ε) m machines or m machines of speed (1+ ε), for arbitrarily small ε> 0. We show that simple randomized and deterministic load balancing algorithms, coupled with simple single machine scheduling strategies such as SRPT (shortest remaining processing time) and SJF (shortest job first), are O (poly (1/ε))-competitive for both flow time and stretch. These are the first results which prove constant factor competitive ratios for flow time or stretch with arbitrarily small resource augmentation. Both the randomized and the deterministic load balancing algorithms are non-migratory and do immediate dispatch of jobs. The randomized algorithm just allocates each incoming job to a random machine. Hence this algorithm is non-clairvoyant, and coupled …", "num_citations": "113\n", "authors": ["188"]}
{"title": "Resource augmentation for weighted flow-time explained by dual fitting\n", "abstract": " We propose a general dual-fitting technique for analyzing online scheduling algorithms in the unrelated machines setting where the objective function involves weighted flow-time, and we allow the machines of the on-line algorithm to have (1 + ε)-extra speed than the offline optimum (the so-called speed augmentation model). Typically, such algorithms are analyzed using non-trivial potential functions which yield little insight into the proof technique. We propose that one can often analyze such algorithms by looking at the dual (or Lagrangian dual) of the linear (or convex) program for the corresponding scheduling problem, and finding a feasible dual solution as the on-line algorithm proceeds. As representative cases, we get the following results:  For the problem of minimizing weighted flow-time, we give an O (1/ε)-competitive greedy algorithm. This is an improvement by a factor of 1/ε on the competitive ratio of the …", "num_citations": "111\n", "authors": ["188"]}
{"title": "System-level dynamic thermal management for high-performance microprocessors\n", "abstract": " Thermal issues are fast becoming major design constraints in high-performance systems. Temperature variations adversely affect system reliability and prompt worst-case design. In recent history, researchers have proposed dynamic thermal-management (DTM) techniques targeting average-case design and tackling the temperature issue at runtime. While past work on DTM has focused on different techniques in isolation, it fails to consider a system-level approach which uses both hardware and software support in a synergistic fashion and hence leads to a significant execution-time overhead. In this paper, we propose HybDTM, a system-level framework for doing fine-grained coordinated thermal management using a hybrid of hardware techniques (like clock gating) and software techniques (like thermal-aware process scheduling), leveraging the advantages of both approaches in a synergistic fashion. We show …", "num_citations": "109\n", "authors": ["188"]}
{"title": "Approximation algorithms for the unsplittable flow problem\n", "abstract": " We present approximation algorithms for the unsplittable flow problem (UFP) in undirected graphs. As is standard in this line of research, we assume that the maximum demand is at most the minimum capacity. We focus on the non-uniform capacity case in which the edge capacities can vary arbitrarily over the graph. Our results are:               We obtain an  approximation ratio for UFP, where n is the number of vertices,  is the maximum degree, and  is the expansion of the graph. Furthermore, if we specialize to the case where all edges have the same capacity, our algorithm gives an  approximation.               For certain strong constant-degree expanders considered by                    Frieze [17]                                     we obtain an  approximation for the uniform capacity case.               For UFP on the line and the ring, we give the first constant-factor approximation algorithms …", "num_citations": "100\n", "authors": ["188"]}
{"title": "Assigning papers to referees\n", "abstract": " Refereed conferences require every submission to be reviewed by members of a program committee (PC) in charge of selecting the conference program. There are many software packages available to manage the review process. Typically, in a bidding phase PC members express their personal preferences by ranking the submissions. This information is used by the system to compute an assignment of the papers to referees (PC members).               We study the problem of assigning papers to referees. We propose to optimize a number of criteria that aim at achieving fairness among referees/papers. Some of these variants can be solved optimally in polynomial time, while others are NP-hard, in which case we design approximation algorithms. Experimental results strongly suggest that the assignments computed by our algorithms are considerably better than those computed by popular conference …", "num_citations": "98\n", "authors": ["188"]}
{"title": "NoC with near-ideal express virtual channels using global-line communication\n", "abstract": " As processor core counts increase, networks-on-chip (NoCs) are becoming an increasingly popular interconnection fabric due to their ability to supply high bandwidth. However, NoCs need to deliver this high bandwidth at low latencies, while keeping within a tight power envelope. In this paper, we present a novel NoC with hybrid interconnect that leverages multiple types of interconnects - specifically, conventional full-swing short-range wires for the data path, in conjunction with low-swing, multi-drop wires with long-range, ultra-low-latency communication for the flow control signals. We show how this proposed system can be used to overcome key limitations of express virtual channels (EVC), a recently proposed flow control technique that allows packets to bypass intermediate routers to simultaneously improve energy-delay-throughput. Our preliminary results show up to a 8.2% reduction in power and up to a 44 …", "num_citations": "94\n", "authors": ["188"]}
{"title": "Synthesis and anticonvulsant activity of some potential thiazolidinonyl 2-oxo/thiobarbituric acids\n", "abstract": " A series of 5-[(N-substituted benzylidenylimino)amino]-2-oxo/thiobarbituric acids (3a–3h) have been synthesized by the condensation of 5-hydrazino-2-oxo/thiobarbituric acids (2a–2b) with various aromatic aldehydes. Cycloaddition of thioglycolic acid to 3a–3h, yielded 5-[(2′-substituted phenyl-4′-oxothiazolidin-3′-yl)amino]-2-oxo/thiobarbituric acids (4a–4h). All these compounds were screened, in vivo, for their anticonvulsant activity and acute toxicity studies. Compounds 4f and 4g were found to be most potent compounds of this series and were compared with the reference drugs, phenytoin sodium, lamotrigine and sodium valproate. The structures of these compounds have been established by IR, 1H NMR and mass spectroscopic data.", "num_citations": "90\n", "authors": ["188"]}
{"title": "Fairness measures for resource allocation\n", "abstract": " In many optimization problems, one seeks to allocate a limited set of resources to a set of individuals with demands. Thus, such allocations can naturally be viewed as vectors, with one coordinate representing each individual. Motivated by work in network routing and bandwidth assignment, we consider the problem of producing solutions that simultaneously approximate all feasible allocations in a coordinate-wise sense. This is a very strong type of \"global\" approximation guarantee, and we explore its consequences in a range of discrete optimization problems, including facility location, scheduling, and bandwidth assignment in networks. A fundamental issue-one not encountered in the traditional design of approximation algorithms-is that good approximations in this global sense need not exist for every problem instance; there is no a priori reason why there should be an allocation that simultaneously …", "num_citations": "90\n", "authors": ["188"]}
{"title": "Method for distinct count estimation over joins of continuous update stream\n", "abstract": " The invention provides methods and systems for summarizing multiple continuous update streams such that an approximate answer to a query over one or more of the continuous update streams (such as a Query requiring a join operation followed by a duplicate elimination step) may be rapidly provided. The systems and methods use multiple (parallel) Join Distinct (JD) Sketch data structures corresponding to hash buckets of at least one initial attribute.", "num_citations": "86\n", "authors": ["188"]}
{"title": "Performance analysis of different feeding techniques\n", "abstract": " This paper describes the performance analysis of different feeding technique for wireless microstrip patch antenna ie for wi-max applications. In this paper four types of feeding techniques (Microstrip line feed, coaxial probe feed, proximity coupled feed and aperture coupled feed) are used. From the four feeding techniques, microstrip line and coaxial probe feeds are contacting scheme, in which RF power is fed directly to the radiating patch using a connecting element such as a microstrip line whereas proximity and aperture coupled feeds are non-contacting schemes, in which electromagnetic field coupling is done to transfer power between the microstrip line and the radiating patch. Paper describing four feeding technique and gives a better understanding of design parameters of an antenna and their effect on return losses, bandwidth, VSWR and resonant frequency. Finally simulation is done using design software HFSS.", "num_citations": "83\n", "authors": ["188"]}
{"title": "Fuzzy optimal solution of fully fuzzy linear programming problems with inequality constraints\n", "abstract": " SID.ir | FUZZY OPTIMAL SOLUTION OF FULLY FUZZY LINEAR PROGRAMMING PROBLEMS WITH INEQUALITY CONSTRAINTS Click for new scientific resources and news about Corona[COVID-19] Use Online Translation Powered By Click Here STRS STRS www.SID.ir Home Journals Authors ISI Iranian Journals Updated Journals JCR About Us Contact Us Help Others Scientific Information Databases بانک نشریات فارسی ایران بانک همایش های علمی فارسی ایران بانک طرح های پژوهشی فارسی ایران مراکز علمی تخصصی ایران English Journals Database of Iran English Seminars Database of Iran Today: 2/14/2021 Advanced Search Papers ... English فارسی Paper Information Journal: INTERNATIONAL JOURNAL OF MATHEMATICS AND COMPUTER SCIENCE 2010 , Volume 6 , Number -; Page(s) 37 To 41. Paper: FUZZY OPTIMAL SOLUTION OF FULLY FUZZY LINEAR PROGRAMMING PROBLEMS WITH Author(s): A…", "num_citations": "83\n", "authors": ["188"]}
{"title": "A new approach for ranking of L–R type generalized fuzzy numbers\n", "abstract": " Ranking of fuzzy numbers play an important role in decision making, optimization, forecasting etc. Fuzzy numbers must be ranked before an action is taken by a decision maker. Cheng (Cheng, C. H. (1998). A new approach for ranking fuzzy numbers by distance method. Fuzzy Sets and Systems, 95, 307–317) pointed out that the proof of the statement “Ranking of generalized fuzzy numbers does not depend upon the height of fuzzy numbers” stated by Liou and Wang (Liou, T. S., & Wang, M. J. (1992). Ranking fuzzy numbers with integral value. Fuzzy Sets and Systems, 50, 247–255) is incorrect. In this paper, by giving an alternative proof it is proved that the above statement is correct. Also with the help of several counter examples it is proved that ranking method proposed by Chen and Chen (Chen, S. M., & Chen, J. H. (2009). Fuzzy risk analysis based on ranking generalized fuzzy numbers with different heights …", "num_citations": "82\n", "authors": ["188"]}
{"title": "Approximation via cost sharing: Simpler and better approximation algorithms for network design\n", "abstract": " We present constant-factor approximation algorithms for several widely-studied NP-hard optimization problems in network design, including the multicommodity rent-or-buy, virtual private network design, and single-sink buy-at-bulk problems. Our algorithms are simple and their approximation ratios improve over those previously known, in some cases by orders of magnitude. We develop a general analysis framework to bound the approximation ratios of our algorithms. This framework is based on a novel connection between random sampling and game-theoretic cost sharing.", "num_citations": "82\n", "authors": ["188"]}
{"title": "Method and apparatus for routing a packet within a plurality of nodes arranged in a line or a tree given a maximum stack depth\n", "abstract": " A method and apparatus are provided for routing a packet within a plurality of n nodes arranged in a line or tree (or a combination of the foregoing), given a maximum stack depth, s. A fixed stack process for routing packets on a line given a stack depth, s, initially divides a line of n nodes into segments, such as n 1/s approximately equal segments. A unique label is assigned to each segment and, within each segment, one of up to n 1/s labels is assigned to each node. A fixed stack process for routing packets on a tree, given a target stack depth, s, initially identifies a subset, S, of at nodes from the tree, such as at most 3 n 1/s nodes, such that after the subset, S, is removed, each remaining subtree has at most n (s-1)/s nodes. A unique label is assigned to each of the nodes in the subset S and, within each remaining subtree, one of up to n (s-1)/s labels is assigned to each node. If the bound on the stack depth cannot …", "num_citations": "80\n", "authors": ["188"]}
{"title": "Wavelet synopses for general error metrics\n", "abstract": " Several studies have demonstrated the effectiveness of the wavelet decomposition as a tool for reducing large amounts of data down to compact wavelet synopses that can be used to obtain fast, accurate approximate query answers. Conventional wavelet synopses that greedily minimize the overall root-mean-squared (i.e., L2-norm) error in the data approximation can suffer from important problems, including severe bias and wide variance in the quality of the data reconstruction, and lack of nontrivial guarantees for individual approximate answers. Thus, probabilistic thresholding schemes have been recently proposed as a means of building wavelet synopses that try to probabilistically control maximum approximation-error metrics (e.g., maximum relative error).A key open problem is whether it is possible to design efficient deterministic wavelet-thresholding algorithms for minimizing general, non-L2 error metrics …", "num_citations": "80\n", "authors": ["188"]}
{"title": "Primal-dual algorithms for connected facility location problems\n", "abstract": " We consider the Connected Facility Location problem. We are given a graph G = (V,E) with cost c                      e on edge e, a set of facilities F ⊆ V, and a set of demands D ⊆ V. We are also given a parameter M ≥ 1. A solution opens some facilities, say F, assigns each demand j to an open facility i(j), and connects the open facilities by a Steiner tree T. The cost incurred is  . We want a solution of minimum cost. A special case is when all opening costs are 0 and facilities may be opened anywhere, i.e.,F = V. If we know a facility v that is open, then this problem reduces to the rent-or-buy problem. We give the first primal-dual algorithms for these problems and achieve the best known approximation guarantees. We give a 9-approximation algorithm for connected facility location and a 5-approximation for the rent-or-buy problem. Our algorithm integrates the primal-dual approaches …", "num_citations": "75\n", "authors": ["188"]}
{"title": "Approximation algorithms for the unsplittable flow problem\n", "abstract": " We present approximation algorithms for the unsplittable                      flow problem (UFP) on undirected graphs. As is standard in this line of research, we assume that the maximum demand is at most the minimum capacity. We focus on the non-uniform capacity case in which the edge capacities can vary arbitrarily over the graph. Our results are:                                      - For undirected graphs we obtain a O(Δα-1 log2                               n) approximation ratio, where n is the number of vertices, Δ the maximum degree, and α the expansion of the graph. Our ratio is capacity independent and improves upon the earlier O(Δα-1(c                               max/c                               min) log n) bound [15] for large values of c                               max/c                               min. Furthermore, if we specialize to the case where all edges have the same capacity, our algorithm gives an O(Δα-1 log n) approximation, which matches the performance …", "num_citations": "73\n", "authors": ["188"]}
{"title": "A constant-factor approximation algorithm for the multicommodity rent-or-buy problem\n", "abstract": " We present the first constant factor approximation algorithm for network design with multiple commodities and economies of scale. We consider the rent-or-buy problem, a type of multicommodity buy-at-bulk network design in which there are two ways to install capacity on any given edge. Capacity can be rented, with cost incurred on a per-unit of capacity basis, or bought, which allows unlimited use after payment of a large fixed cost. Given a graph and a set of source-sink pairs, we seek a minimum-cost way of installing sufficient capacity on edges so that a prescribed amount of flow can be sent simultaneously from each source to the corresponding sink. Recent work on buy-at-bulk network design has concentrated on the special case where all sinks are identical; existing constant factor approximation algorithms for this special case make crucial use of the assumption that all commodities ship flow to the same sink …", "num_citations": "68\n", "authors": ["188"]}
{"title": "A new method to solve time-dependent intuitionistic fuzzy differential equations and its application to analyze the intuitionistic fuzzy reliability of industrial systems\n", "abstract": " To the best of our knowledge, there is no method in the literature for solving such differential equations in which all the parameters except independent variables are represented by intuitionistic fuzzy numbers. In this article, a new method is proposed for solving such nth-order time-dependent intuitionistic fuzzy linear differential equations. To show the application of the proposed method in real-life problems, the time-dependent intuitionistic fuzzy Kolmogorov’s differential equations, obtained by Markov model of condensate system, are solved by the proposed method, and the obtained solution is used to analyze the intuitionistic fuzzy reliability of condensate system.", "num_citations": "67\n", "authors": ["188"]}
{"title": "PLUG: flexible lookup modules for rapid deployment of new protocols in high-speed routers\n", "abstract": " New protocols for the data link and network layer are being proposed to address limitations of current protocols in terms of scalability, security, and manageability. High-speed routers and switches that implement these protocols traditionally perform packet processing using ASICs which offer high speed, low chip area, and low power. But with inflexible custom hardware, the deployment of new protocols could happen only through equipment upgrades. While newer routers use more flexible network processors for data plane processing, due to power and area constraints lookups in forwarding tables are done with custom lookup modules. Thus most of the proposed protocols can only be deployed with equipment upgrades. To speed up the deployment of new protocols, we propose a flexible lookup module, PLUG (Pipelined Lookup Grid). We can achieve generality without loosing efficiency because various custom …", "num_citations": "67\n", "authors": ["188"]}
{"title": "Optimal configuration of OSPF aggregates\n", "abstract": " Open Shortest Path First (OSPF) is a popular protocol for routing within an autonomous system (AS) domain. In order to scale for large networks containing hundreds and thousands of subnets, OSPF supports a two-level hierarchical routing scheme through the use of OSPF areas. Subnet addresses within an area are aggregated, and this aggregation is a crucial requirement for scaling OSPF to large AS domains, as it results in significant reductions in routing table sizes, smaller link-state databases, and less network traffic to synchronize the router link-state databases. On the other hand, address aggregation also implies loss of information about the length of the shortest path to each subnet, which in turn, can lead to suboptimal routing. We address the important practical problem of configuring OSPF aggregates to minimize the error in OSPF shortest-path computations due to subnet aggregation. We first develop …", "num_citations": "67\n", "authors": ["188"]}
{"title": "A competitive algorithm for minimizing weighted flow time on unrelatedmachines with speed augmentation\n", "abstract": " We consider the online problem of scheduling jobs on unrelated machines so as to minimize the total weighted flow time. This problem has an unbounded competitive ratio even for very restricted settings. In this paper we show that if we allow the machines of the online algorithm to have ε more speed than those of the offline algorithm then we can get an O ((1+ ε-1) 2)-competitive algorithm. Our algorithm schedules jobs preemptively but without migration. However, we compare our solution to an offline algorithm which allows migration. Our analysis uses a potential function argument which can also be extended to give a simpler and better proof of the randomized immediate dispatch algorithm of Chekuri-Goel-Khanna-Kumar for minimizing average flow time on parallel machines.", "num_citations": "66\n", "authors": ["188"]}
{"title": "Temperature-aware on-chip networks\n", "abstract": " On-chip networks are becoming increasingly popular as a way to connect high-performance single-chip computer systems, but thermal issues greatly limit network design. Sirius, an thermal modeling and simulation framework combines with ThermalHerd, a distributed runtime scheme for thermal management to offer a path to thermally efficient on-chip network design", "num_citations": "63\n", "authors": ["188"]}
{"title": "Online and dynamic algorithms for set cover\n", "abstract": " In this paper, we give new results for the set cover problem in the fully dynamic model. In this model, the set of\" active\" elements to be covered changes over time. The goal is to maintain a near-optimal solution for the currently active elements, while making few changes in each timestep. This model is popular in both dynamic and online algorithms: in the former, the goal is to minimize the update time of the solution, while in the latter, the recourse (number of changes) is bounded. We present generic techniques for the dynamic set cover problem inspired by the classic greedy and primal-dual offline algorithms for set cover. The former leads to a competitive ratio of O (logn t), where n t is the number of currently active elements at timestep t, while the latter yields competitive ratios dependent on f t, the maximum number of sets that a currently active element belongs to. We demonstrate that these techniques are useful …", "num_citations": "61\n", "authors": ["188"]}
{"title": "XML stream processing using tree-edit distance embeddings\n", "abstract": " We propose the first known solution to the problem of correlating, in small space, continuous streams of XML data through approximate (structure and content) matching, as defined by a general tree-edit distance metric. The key element of our solution is a novel algorithm for obliviously embedding tree-edit distance metrics into an L1 vector space while guaranteeing a (worst-case) upper bound of O(log2n log*n) on the distance distortion between any data trees with at most n nodes. We demonstrate how our embedding algorithm can be applied in conjunction with known random sketching techniques to (1) build a compact synopsis of a massive, streaming XML data tree that can be used as a concise surrogate for the full tree in approximate tree-edit distance computations; and (2) approximate the result of tree-edit-distance similarity joins over continuous XML document streams. Experimental results from an …", "num_citations": "61\n", "authors": ["188"]}
{"title": "Traveling with a pez dispenser (or, routing issues in mpls)\n", "abstract": " A new packet routing model proposed by the Internet Engineering Task Force is MultiProtocol Label Switching, or MPLS [B. Davie and Y. Rekhter, MPLS: Technology and Applications, Morgan Kaufmann (Elsevier), New York, 2000]. Instead of each router's parsing the packet network layer header and doing its lookups based on that analysis (as in much of conventional packet routing), MPLS ensures that the analysis of the header is performed just once. The packet is then assigned a stack of labels, where the labels are usually much smaller than the packet headers themselves. When a router receives a packet, it examines the label at the top of the label stack and makes the decision of where the packet is forwarded based solely on that label. It can pop the top label off the stack if it so desires, and can also push some new labels onto the stack, before forwarding the packet. This scheme has several advantages over …", "num_citations": "60\n", "authors": ["188"]}
{"title": "System and method for optimizing open shortest path first aggregates and autonomous network domain incorporating the same\n", "abstract": " Systems and method for selecting open shortest path first (OSPF) aggregates and aggregate weights for a particular area. In one embodiment, an aggregate selecting system includes:(1) a database for containing data pertaining to candidate OSPF aggregates and corresponding weights and (2) an aggregate selector, associated with the database, that selects at least a subset of the OSPF aggregates such that the shortest path length between the particular source and destination subnets resulting from advertisement of a set of weighted aggregates approaches the shortest path length between the particular source and destination subnets irrespective of the advertisement. In one embodiment, a weight selection system includes:(1) a database for containing data pertaining to candidate OSPF aggregates and (2) a weight assigner, associated with the database, that assigns, for the OSPF aggregates, weights based …", "num_citations": "59\n", "authors": ["188"]}
{"title": "Ranking of generalized trapezoidal fuzzy numbers based on rank, mode, divergence and spread\n", "abstract": " Ranking of fuzzy numbers play an important role in risk analysis, decision making, optimization, forecasting etc. Fuzzy numbers must be ranked before an action is taken by a decision maker. In this paper, a new approach is proposed for the ranking of generalized trapezoidal fuzzy numbers. The proposed approach is based on rank, mode, divergence and spread. The main advantage of the proposed approach is that the proposed approach provides the correct ordering of generalized and normal trapezoidal fuzzy numbers and also the proposed approach is very simple and easy to apply in the real life problems. For the validation, the results of the proposed approach are compared with different existing approaches.", "num_citations": "58\n", "authors": ["188"]}
{"title": "Correlating XML data streams using tree-edit distance embeddings\n", "abstract": " We propose the first known solution to the problem of correlating, in small space, continuous streams of XML data through approximate (structure and content) matching, as defined by a general tree-edit distance metric. The key element of our solution is a novel algorithm for obliviously embedding tree-edit distance metrics into an L 1 vector space while guaranteeing an upper bound of O (log 2 n log* n) on the distance distortion between any data trees with at most n nodes. We demonstrate how our embedding algorithm can be applied in conjunction with known random sketching techniques to:(1) build a compact synopsis of a massive, streaming XML data tree that can be used as a concise surrogate for the full tree in approximate tree-edit distance computations; and,(2) approximate the result of tree-edit distance similarity joins over continuous XML document streams. To the best of our knowledge, these are the …", "num_citations": "58\n", "authors": ["188"]}
{"title": "A new method for solving fuzzy linear programs with trapezoidal fuzzy numbers\n", "abstract": " Ganesan and Veeramani [Fuzzy linear programs with trapezoidal fuzzy numbers, Annals of Operations Research 143 (2006) 305-315.] proposed a new method for solving a special type of fuzzy linear programming problems. In this paper a new method, named as Mehar’s method, is proposed for solving the same type of fuzzy linear programming problems and it is shown that it is easy to apply the Mehar’s method as compared to the existing method for solving the same type of fuzzy linear programming problems.", "num_citations": "56\n", "authors": ["188"]}
{"title": "Mehar’s method for solving fully fuzzy linear programming problems with LR fuzzy parameters\n", "abstract": " To the best of our knowledge, there is no method in literature for solving such fully fuzzy linear programming (FLP) problems in which some or all the parameters are represented by unrestricted L-R flat fuzzy numbers. Also, to propose such a method, there is need to find the product of unrestricted L-R flat fuzzy numbers. However, there is no method in the literature to find the product of unrestricted L-R flat fuzzy numbers.In this paper, firstly the product of unrestricted L-R flat fuzzy numbers is proposed and then with the help of proposed product, a new method (named as Mehar’s method) is proposed for solving fully FLP problems. It is also shown that the fully FLP problems which can be solved by the existing methods can also be solved by the Mehar’s method. However, such fully FLP problems in which some or all the parameters are represented by unrestricted L-R flat fuzzy numbers can be solved by Mehar’s …", "num_citations": "55\n", "authors": ["188"]}
{"title": "Fuzzy reliability of a marine power plant using interval valued vague sets\n", "abstract": " In conventional reliability analysis, the failure probabilities of the components of a system are treated   as exact values. It is often difficult to obtain data for failure probabilities under changing environmental conditions. Hence fuzzy sets are used to analyze the fuzzy system reliability, where a fuzzy number represents the reliability of each component. Chen [14] analyzed the fuzzy system reliability using vague set theory. The values of the membership and non-membership of an element, in a vague set, are represented by a real number in [0, 1]. A specialist is always uncertain about the values of the membership and non-membership of an element in a set. Hence, it is better to represent the values of the membership and non-membership of an element in a set by intervals of possible real numbers instead of real numbers. In this paper a new method has been developed for analyzing the fuzzy system reliability of a series and parallel system using interval valued trapezoidal vague sets, where the reliability of each component of each system is represented by an interval valued trapezoidal vague set defined in the universe of discourse [0, 1].The developed method has been used to analyze the fuzzy reliability of a marine power plant. The major advantage of the proposed approach (the concept of interval valued vague sets) over the existing approaches [7, 8, 14] is that the proposed approach separates the positive and negative evidence for the membership of an element in a set. Also in the proposed approach the values of the membership and non- membership of an element in a set are intervals instead of a single real number.", "num_citations": "55\n", "authors": ["188"]}
{"title": "Minimizing average flow-time: Upper and lower bounds\n", "abstract": " We consider the problem of minimizing average flow time on multiple machines when each job can be assigned only to a specified subset of the machines. This is a special case of scheduling on unrelated machines and we show that no online algorithm can have a bounded competitive ratio. We provide an O(log P)-approximation algorithm by modifying the single-source unsplittable flow algorithm of Dinitz, et.al. Here P is the ratio of the maximum to the minimum processing times. We establish an Omega(log P)-integrality gap for our LP-relaxation and use this to show an Omega(log P/log log P) lower bound on the approximability of the problem. We then extend the hardness results to the problem of minimizing flow time on parallel machines and establish the first non-trivial lower bounds on the approximability; we show that the problem cannot be approximated to within Omega(radiclog P/log log P).", "num_citations": "54\n", "authors": ["188"]}
{"title": "Decreased O-linked GlcNAcylation protects from cytotoxicity mediated by huntingtin exon1 protein fragment\n", "abstract": " O-GlcNAcylation is an important post-translational modification of proteins and is known to regulate a number of pathways involved in cellular homeostasis. This involves dynamic and reversible modification of serine/threonine residues of different cellular proteins catalyzed by O-linked N-acetylglucosaminyltransferase and O-linked N-acetylglucosaminidase in an antagonistic manner. We report here that decreasing O-GlcNAcylation enhances the viability of neuronal cells expressing polyglutamine-expanded huntingtin exon 1 protein fragment (mHtt). We further show that O-GlcNAcylation regulates the basal autophagic process and that suppression of O-GlcNAcylation significantly increases autophagic flux by enhancing the fusion of autophagosome with lysosome. This regulation considerably reduces toxic mHtt aggregates in eye imaginal discs and partially restores rhabdomere morphology and vision in a fly …", "num_citations": "52\n", "authors": ["188"]}
{"title": "The matroid median problem\n", "abstract": " In the classical k-median problem, we are given a metric space and would like to open k centers so as to minimize the sum (over all the vertices) of the distance of each vertex to its nearest open center. In this paper, we consider the following generalization of the problem: instead of opening at most k centers, what if each center belongs to one of T different types, and we are allowed to open at most ki centers of type i (for each i = 1, 2, …, T). The case T = 1 is the classical k-median, and the case of T = 2 is the red-blue median problem for which Hajiaghayi et al. [ESA 2010] recently gave a constant-factor approximation algorithm. Even more generally, what if the set of open centers had to form an independent set from a matroid? In this paper, we give a constant factor approximation algorithm for such matroid median problems. Our algorithm is based on rounding a natural LP relaxation in two stages: in the first step …", "num_citations": "51\n", "authors": ["188"]}
{"title": "Order scheduling models: hardness and algorithms\n", "abstract": " We consider scheduling problems in which a job consists of components of different types to be processed on m machines. Each machine is capable of processing components of a single type. Different components of a job are independent and can be processed in parallel on different machines. A job is considered as completed only when all its components have been completed. We study both completion time and flowtime aspects of such problems. We show both lowerbounds and upperbounds for the completion time problem. We first show that even the unweighted completion time with single release date is MAX-SNP hard. We give an approximation algorithm based on linear programming which has an approximation ratio of 3 for weighted completion time with multiple release dates. We give online algorithms for the weighted completion time which are constant factor competitive. For the flowtime, we give …", "num_citations": "51\n", "authors": ["188"]}
{"title": "The power of deferral: maintaining a constant-competitive steiner tree online\n", "abstract": " In the online Steiner tree problem, a sequence of points is revealed one-by-one: when a point arrives, we only have time to add a single edge connecting this point to the previous ones, and we want to minimize the total length of edges added. Here, a tight bound has been known for two decades: the greedy algorithm maintains a tree whose cost is  times the Steiner tree cost, and this is the best possible. But suppose, in addition to the new edge we add, we have time to change a single edge from the previous set of edges: can we do much better? Can we, e.g., maintain a tree that is constant-competitive? We answer this question in the affirmative. We give a primal-dual algorithm that makes only a single swap per step (in addition to adding the edge connecting the new point to the previous ones), and such that the tree's cost is only a constant times the optimal cost. Our dual-based analysis is quite different from previous …", "num_citations": "47\n", "authors": ["188"]}
{"title": "Maintaining assignments online: Matching, scheduling, and flows\n", "abstract": " Consider the following edge-orientation problem: edges of a graph appear online one-by-one and they to be directed—given an “orientation”. We want to ensure that the in-degree of each vertex remains low. (This is a simple case of scheduling unit-sized jobs on machines, where each job can only go on one of two machines.) If the edge-orientations we assign are irrevocable, we suffer a significant loss in quality due to online decision-making (as compared to the offline performance). For instance the best online competitive ratio achievable is Θ(log m) for even this toy problem. But what if the decisions are not irrevocable — what if we allow a limited number of reassignments? Can we do much better? We show that indeed we can. For instance, for edge-orientation, we can achieve a constant-competitive load while doing only a constant number of re-orientations per edge (in an amortized sense). For more …", "num_citations": "47\n", "authors": ["188"]}
{"title": "A Simple D               2-Sampling Based PTAS for k-Means and Other Clustering Problems\n", "abstract": " Given a set of points , the k-means clustering problem is to find a set of k                 centers                 , such that the objective function ∑                   x∈P                                  e(x,C)2, where e(x,C) denotes the Euclidean distance between x and the closest center in C, is minimized. This is one of the most prominent objective functions that has been studied with respect to clustering.                                D                 2-sampling (Arthur and Vassilvitskii, Proceedings of the Eighteenth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA’07, pp. 1027–1035, SIAM, Philadelphia, 2007) is a simple non-uniform sampling technique for choosing points from a set of points. It works as follows: given a set of points , the first point is chosen uniformly at random from P. Subsequently, a point from P is chosen as the next sample with probability proportional to the square of the distance of this …", "num_citations": "46\n", "authors": ["188"]}
{"title": "RM approach for ranking of generalized trapezoidal fuzzy numbers\n", "abstract": " Ranking of fuzzy numbers play an important role in decision making, optimization and forecasting etc. Fuzzy numbers must be ranked before an action is taken by a decision maker. In this paper, with the help of several counter examples, it is proved that ranking method proposed by Chen and Chen (Expert Systems with Applications 36(3): 6833) is incorrect. The main aim of this paper is to propose a new approach for the ranking of generalized trapezoidal fuzzy numbers. The proposed ranking approach is based on rank and mode so it is named as an RM approach. The main advantage of the proposed approach is that the proposed approach provides the correct ordering of generalized and normal trapezoidal fuzzy numbers and also the proposed approach is very simple and easy to apply in the real life problems. It is shown that proposed ranking function satisfies all the reasonable properties of fuzzy quantities …", "num_citations": "42\n", "authors": ["188"]}
{"title": "Linear time algorithms for clustering problems in any dimensions\n", "abstract": " We generalize the k-means algorithm presented by the authors [14] and show that the resulting algorithm can solve a larger class of clustering problems that satisfy certain properties (existence of a random sampling procedure and tightness). We prove these properties for the k-median and the discrete k-means clustering problems, resulting in O(2(k/ε)O(1)                         dn) time (1+ε)-approximation algorithms for these problems. These are the first algorithms for these problems linear in the size of the input (nd for n points in d dimensions), independent of dimensions in the exponent, assuming k and ε to be fixed. A key ingredient of the k-median result is a (1+ε)-approximation algorithm for the 1-median problem which has running time O(2(1/ε)O(1)                         d). The previous best known algorithm for this problem had linear running time.", "num_citations": "42\n", "authors": ["188"]}
{"title": "Exploring the trade-off between label size and stack depth in MPLS routing\n", "abstract": " Multiprotocol label switching or MPLS technology is being increasingly deployed by several of the largest Internet service providers to solve problems such as traffic engineering and to offer IP services like virtual private networks (VPNs). In MPLS, the analysis of the packet (network layer) header is performed just once, and each packet is assigned a stack of labels, which is examined by subsequent routers when making forwarding decisions. Despite the fact that MPLS is becoming widespread on the Internet, we know essentially very little about the performance one can achieve with it, and about the intrinsic trade-offs in its use of resources. In this paper, we undertake a comprehensive study of the label size versus stack depth trade-off for MPLS routing protocols on lines and trees. We show that in addition to LSP tunneling, label stacks can also be used to dramatically reduce the number of labels required for setting …", "num_citations": "42\n", "authors": ["188"]}
{"title": "New approximation schemes for unsplittable flow on a path\n", "abstract": " We study the unsplittable flow on a path problem which has received a lot of attention in the research community recently. Given is a path with capacities on its edges and a set of tasks where each task is characterized by a source and a sink vertex, a demand, and a profit. The goal is to find a subset of the tasks of maximum total profit such that all task demands from this subset can be routed simultaneously without violating the capacity constraints. The best known approximation results are a quasi-polynomial time-approximation scheme if the task demands are in a quasi-polynomial range [Bansal et al., STOC 2006] and a polynomial time (2 + ∊)-approximation algorithm [Anagnostopoulos et al., SODA 2014]. Finding a PTAS for it has remained an important open question. In this paper we make progress towards this goal. When the task densities—defined as the ratio of a task's profit and demand—lie in a constant …", "num_citations": "41\n", "authors": ["188"]}
{"title": "A new computational method for solving fully fuzzy linear systems of triangular fuzzy numbers\n", "abstract": " In this paper, a new computational method is proposed to solve fully fuzzy linear systems (FFLS) of triangular fuzzy numbers based on the computation of row reduced echelon form for solving the crisp linear system of equations. The method is illustrated by solving three numerical examples. As compared to the existing methods, the proposed method is easy to understand and to apply for solving FFLS occurring in real life situations and scientific applications. The primary advantage of the proposed method is that, by using it, the consistency of the FFLS can be checked easily and nature of the solutions of an FFLS can also be obtained which may be unique or infinite.", "num_citations": "41\n", "authors": ["188"]}
{"title": "Methods and devices for routing traffic using a configurable access wireless network\n", "abstract": " A configurable access network (CAN) architecture is used to identify primary routing paths that allows each wireless station within a static, multi-hop wireless CAN to route packetized data in a way that simplifies the operation of each station and makes more efficient use of the limited energy available to each station.", "num_citations": "41\n", "authors": ["188"]}
{"title": "Sorting and selection with structured costs\n", "abstract": " The study of the effect of priced information on basic algorithmic problems was initiated by M. Charikar et al. (2000). The authors continue the study of sorting and selection in the priced comparison model, i.e., when each comparison has an associated cost, and answer some of the open problems suggested by Charikar et al. If the comparison costs are allowed to be arbitrary, we show that one cannot get good approximation ratios. A different way to assign costs is based on the idea that one can distill out an intrinsic value for each item being compared, such that the cost of comparing two elements is some \"well-behaved\" or \"structured\" function of their values. We feel that most practical applications will have some structured cost property. The authors study the problems of sorting and selection (which includes finding the maximum and the median) in the structured cost model. We get a variety of approximation …", "num_citations": "40\n", "authors": ["188"]}
{"title": "A ranking approach for intuitionistic fuzzy numbers and its application\n", "abstract": " To the best of our knowledge very few methods have been proposed in previous studies for comparing intuitionistic fuzzy (IF) numbers. In this paper, the limitations and the shortcomings of all these existing methods are pointed out. In order to overcome these limitations and shortcomings a new ranking approach—by modifying an existing ranking approach—is proposed for comparing IF numbers. Thus, with the help of proposed the ranking approach, a new method is proposed to find the optimal solution of such unbalanced minimum cost flow (MCF) problems in which all the parameters are represented by IF numbers.", "num_citations": "39\n", "authors": ["188"]}
{"title": "Solving fully fuzzy linear system with arbitrary triangular fuzzy numbers \n", "abstract": " In this paper, we discuss some new numerical methods to solve a fully fuzzy linear system (FFLS) with triangular fuzzy numbers of the form . Almost every existing method that intends to solve a FFLS confines the coefficient matrix and the solutions to be non-negative fuzzy numbers. The main intent of the proposed methods is to remove these restrictions and widen the scope of fuzzy linear systems in scientific applications. The methods are illustrated with the help of numerical examples and are conceptually easy to understand and apply in real life situations.", "num_citations": "39\n", "authors": ["188"]}
{"title": "Fairness measures for resource allocation\n", "abstract": " In many optimization problems, one seeks to allocate a limited set of resources to a set of individuals with demands. Thus, such allocations can naturally be viewed as vectors, with one coordinate representing each individual. Motivated by work in network routing and bandwidth assignment, we consider the problem of producing solutions that simultaneously approximate all feasible allocations in a coordinate‐wise sense. This is a very strong type of “global” approximation guarantee, and we explore its consequences in a wide range of discrete optimization problems, including facility location, scheduling, and bandwidth assignment in networks. A fundamental issue—one not encountered in the traditional design of approximation algorithms—is that good approximations in this global sense need not exist for every problem instance; there is no a priori reason why there should be an allocation that simultaneously …", "num_citations": "38\n", "authors": ["188"]}
{"title": "Faster Algorithms for the Constrained k-means Problem\n", "abstract": " The classical center based clustering problems such as k-means/median/center assume that the optimal clusters satisfy the locality property that the points in the same cluster are close to each other. A number of clustering problems arise in machine learning where the optimal clusters do not follow such a locality property. For instance, consider the r                 -gather clustering problem where there is an additional constraint that each of the clusters should have at least r points or the capacitated clustering problem where there is an upper bound on the cluster sizes. Consider a variant of the k-means problem that may be regarded as a general version of such problems. Here, the optimal clusters O                 1, ..., O                                    k                  are an arbitrary partition of the dataset and the goal is to output k-centers c                 1, ..., c                                    k                  such that the objective function  is …", "num_citations": "37\n", "authors": ["188"]}
{"title": "A new approach for ranking nonnormal p-norm trapezoidal fuzzy numbers\n", "abstract": " Ranking of fuzzy numbers play an important role in decision-making, optimization, forecasting etc. Fuzzy numbers must be ranked before an action is taken by a decision maker. In this paper, with the help of several counter examples it is proved that the results proposed by Chen and Tang [CC Chen, HC Tang, Ranking of nonnormal p-norm trapezoidal fuzzy numbers with integral value, Computers and Mathematics with Applications 56 (2008) 2340–2346] are applicable only for the nonnormal p-norm trapezoidal fuzzy numbers with equal heights and a new approach is proposed for the ranking of nonnormal p-norm trapezoidal fuzzy numbers with different heights. The results proposed by Chen and Tang are modified and to illustrate the proposed approach the counter examples are solved using the proposed approach. It is also shown that the proposed approach and the results, obtained by using the proposed …", "num_citations": "37\n", "authors": ["188"]}
{"title": "Application of classical transportation methods to find the fuzzy optimal solution of fuzzy transportation problems\n", "abstract": " To the best of our knowledge till now there is no method in the literature to find the exact fuzzy optimal solution of unbalanced fully fuzzy transportation problems. In this paper, the shortcomings and limitations of some of the existing methods for solving the problems are pointed out and to overcome these shortcomings and limitations, two new methods are proposed to find the exact fuzzy optimal solution of unbalanced fuzzy transportation problems by representing all the parameters as LR flat fuzzy numbers. To show the advantages of the proposed methods over existing methods, a fully fuzzy transportation problem which may not be solved by using any of the existing methods, is solved by using the proposed methods and by comparing the results, obtained by using the existing methods and proposed methods. It is shown that it is better to use proposed methods as compared to existing methods.", "num_citations": "35\n", "authors": ["188"]}
{"title": "Building edge-failure resilient networks\n", "abstract": " We consider the design of resilient networks that are fault tolerant against single link failures. Resilience against single link failures can be built into the network by providing backup paths, which are used when an edge failure occurs on a primary path. We consider several network design problems in this context: the goal is to provision primary and backup bandwidth while minimizing cost. Our models are motivated by current high speed optical networks and we provide approximation algorithms for the problems below.             The main problem we consider is that of backup allocation. In this problem, we are given an already provisioned (primary) network, and we want to reserve backup capacity on the edges of the underlying network so that all the demand can be routed even in the case of a single edge failure. We also consider a variant where the primary network has a tree topology and it is required that …", "num_citations": "35\n", "authors": ["188"]}
{"title": "A method for unbalanced transportation problems in fuzzy environment\n", "abstract": " In this paper, we consider the fully fuzzy unbalanced transportation problem in which the total availability/production is more than the total demand and propose a method to solve it. Such problems are usually solved by adding a dummy destination. Since the dummy destination has no existence in reality, the excess availability is not transported at all and is held back at one or more origins. The method proposed in this paper gives the additional information that to which of the destination(s) the excess availability be transported for future demand at minimum cost. The advantage of the proposed method over the existing method is that the fuzzy optimal solution obtained does not involve the dummy destination. The method has been illustrated with the help of an example.", "num_citations": "34\n", "authors": ["188"]}
{"title": "Methods for solving unbalanced fuzzy transportation problems\n", "abstract": " In this paper, two new methods (based on fuzzy linear programming formulation and classical transportation methods) are proposed to find the fuzzy optimal solution of unbalanced fuzzy transportation problems occurring in real life situations. Also, a new representation of trapezoidal fuzzy numbers is proposed. The advantages of the proposed methods over existing methods and the proposed representation of trapezoidal fuzzy numbers over existing representation are also discussed. To illustrate the proposed methods an unbalanced fuzzy transportation problem is solved by using both the proposed methods and it is shown that the obtained results are same.", "num_citations": "34\n", "authors": ["188"]}
{"title": "Advanced application of statistical and fuzzy control to textile processes\n", "abstract": " A new control strategy is proposed to optimize the slasher control parameters and the slashing operation during normal, transient and creep speed. An expert system detects and identifies off-limits or failure conditions and generates command signals for low level control of slasher components such as creel, size box drying section and beamer drive. It also addresses the issues of system integration between warping and weaving at a hierarchical level. Simple process models for each section of a slasher are simulated on computers. Simulated results from these models demonstrate that the control strategy is efficient and robust.< >", "num_citations": "34\n", "authors": ["188"]}
{"title": "Exact fuzzy optimal solution of fully fuzzy linear programming problems with unrestricted fuzzy variables\n", "abstract": " Kumar et al. (Appl. Math. Model. 35:817–823, 2011) pointed out that there is no method in literature to find the exact fuzzy optimal solution of fully fuzzy linear programming (FFLP) problems and proposed a new method to find the fuzzy optimal solution of FFLP problems with equality constraints having non-negative fuzzy variables and unrestricted fuzzy coefficients. There may exist several FFLP problems with equality constraints in which no restriction can be applied on all or some of the fuzzy variables but due to the limitation of the existing method these types of problems can not be solved by using the existing method. In this paper a new method is proposed to find the exact fuzzy optimal solution of FFLP problems with equality constraints having non-negative fuzzy coefficients and unrestricted fuzzy variables. The proposed method can also be used to solve the FFLP problems with equality constraints …", "num_citations": "32\n", "authors": ["188"]}
{"title": "Express virtual channels with capacitively driven global links\n", "abstract": " Networks on chip must deliver high bandwidth at low latencies while keeping within a tight power envelope. Using express virtual channels for flow control improves energy-delay throughput by letting packets bypass intermediate routers, but EVCS have key limitations. Nochi (NoC with hybrid interconnect) overcomes these limitations by transporting data payloads and control information on separate planes, optimized for bandwidth and latency respectively.", "num_citations": "32\n", "authors": ["188"]}
{"title": "Fuzzy system reliability using different types of vague sets\n", "abstract": " Till now, in the literature, arithmetic operations between same types of vague sets are discussed. Also to analyze the fuzzy system reliability, it is assumed that the reliability of all components of a system follows the same membership function. However, in practical problems, such type of situations rarely occurs. Therefore, there is need of a method by which we can also find the fuzzy reliability of systems having components following different type of membership functions. In the present paper, a new algorithm has been introduced to perform various arithmetic operations between different types of vague sets. Further using the proposed algorithm, the methods are obtained to analyze the fuzzy reliability of various systems. Our study generalize the various work [6-8, 10-15] of the literature.", "num_citations": "31\n", "authors": ["188"]}
{"title": "Commentary on “Evaluating the criteria for human resource for science and technology (HRST) based on an integrated fuzzy AHP and fuzzy DEMATEL approach”\n", "abstract": " Chou et al. (Applied Soft Computing 12 (2012) 64–71) used combination of fuzzy AHP (Analytic Hierarchy Process) and fuzzy DEMATEL (Decision Making Trial and Evaluation Laboratory) in human resource for science and technology (HRST). For applying the fuzzy DEMATEL method there is a need to find the multiplicative inverse of a fuzzy matrix. In this paper, it is pointed out that the method, used by Chou et al. for evaluating the multiplicative inverse of a fuzzy matrix, is not valid. Hence, the method, proposed by Chou et al., is not valid. Furthermore, it is pointed out that this flaw can be resolved by using the existing method (International Journal of Computer Mathematics, 86 (8), (2009) 1433–1452) to find the multiplicative inverse of a fuzzy matrix.", "num_citations": "29\n", "authors": ["188"]}
{"title": "Solution of fuzzy maximal flow problems using fuzzy linear programming\n", "abstract": " In this paper, the fuzzy linear programming formulation of fuzzy maximal flow problems are proposed and on the basis of the proposed formulation a method is proposed to find the fuzzy optimal solution of fuzzy maximal flow problems. In the proposed method all the parameters are represented by triangular fuzzy numbers. By using the proposed method the fuzzy optimal solution of fuzzy maximal flow problems can be easily obtained. To illustrate the proposed method a numerical example is solved and the obtained results are discussed.", "num_citations": "29\n", "authors": ["188"]}
{"title": "Linear programming approach for solving fuzzy critical path problems with fuzzy parameters\n", "abstract": " To the best of our knowledge, there is no method in the literature to find the fuzzy optimal solution of fully fuzzy critical path (FFCP) problems i.e., critical path problems in which all the parameters are represented by LR flat fuzzy numbers. In this paper, a new method is proposed for the same. Also, it is shown that it is better to use JMD representation of LR flat fuzzy numbers in the proposed method as compared to the other representation of LR flat fuzzy numbers.", "num_citations": "28\n", "authors": ["188"]}
{"title": "On LP-based approximability for strict CSPs\n", "abstract": " In a beautiful result, Raghavendra established optimal Unique Games Conjecture (UGC)-based inapproximability for a large class of constraint satisfaction problems (CSPs). In the class of CSPs he considers, of which Maximum Cut is a prominent example, the goal is to find an assignment which maximizes a weighted fraction of constraints satisfied. He gave a generic semi-definite program (SDP) for this class of problems and showed how the approximability of each problem is determined by the corresponding SDP (upto an arbitrarily small additive error) assuming the UGC. He noted that his techniques do no apply to CSPs with strict constraints (all of which must be satisfied) such as Vertex Cover. In this paper we address the approximability of these strict-CSPs. In the class of CSPs we consider, one is given a set of constraints over a set of variables, and a cost function over the assignments, the goal is to find an …", "num_citations": "28\n", "authors": ["188"]}
{"title": "A new approach for solving fully fuzzy linear systems\n", "abstract": " Several authors have proposed different methods to find the solution of fully fuzzy linear systems (FFLSs) that is, fuzzy linear system with fuzzy coefficients involving fuzzy variables. But all the existing methods are based on the assumption that all the fuzzy coefficients and the fuzzy variables are nonnegative fuzzy numbers. In this paper a new method is proposed to solve an FFLS with arbitrary coefficients and arbitrary solution vector, that is, there is no restriction on the elements that have been used in the FFLS. The primary objective of this paper is thus to introduce the concept and a computational method for solving FFLS with no non negative constraint on the parameters. The method incorporates the principles of linear programming in solving an FFLS with arbitrary coefficients and is not only easier to understand but also widens the scope of fuzzy linear equations in scientific applications. To show the advantages of the proposed method over existing methods we solve three FFLSs.", "num_citations": "28\n", "authors": ["188"]}
{"title": "Scheduling with outliers\n", "abstract": " In classical scheduling problems, we are given jobs and machines, and have to schedule all the jobs to minimize some objective function. What if each job has a specified profit, and we are no longer required to process all jobs? Instead, we can schedule any subset of jobs whose total profit is at least a (hard) target profit requirement, while still trying to approximately minimize the objective function.               We refer to this class of problems as scheduling with outliers. This model was initiated by Charikar and Khuller (SODA ’06) for minimum max-response time in broadcast scheduling. In this paper, we consider three other well-studied scheduling objectives: the generalized assignment problem, average weighted completion time, and average flow time, for which LP-based approximation algorithms are provided. Our main results are:                                                                        For the minimum average flow time …", "num_citations": "28\n", "authors": ["188"]}
{"title": "Online steiner tree with deletions\n", "abstract": " In the online Steiner tree problem, the input is a set of vertices that appear one-by-one, and we have to maintain a Steiner tree on the current set of vertices. The cost of the tree is the total length of edges in the tree, and we want this cost to be close to the cost of the optimal Steiner tree at all points in time. If we are allowed to only add edges, a tight bound of Θ(log n) on the competitiveness has been known for two decades. Recently it was shown that if we can add one new edge and make one edge swap upon every vertex arrival, we can still maintain a constant-competitive tree online. But what if the set of vertices sees both additions and deletions? Again, we would like to obtain a low-cost Steiner tree with as few edge changes as possible. The original paper of Imase and Waxman (SIAM J. Disc. Math, 4(3):369–384, 1991) had also considered this model, and it gave an algorithm that made at most O(n3/2) edge …", "num_citations": "27\n", "authors": ["188"]}
{"title": "Application of classical transportation methods for solving fuzzy transportation problems\n", "abstract": " There are several methods, in the literature, for finding a fuzzy optimal solution to fully fuzzy transportation problems (transportation problems in which all the parameters are represented by fuzzy numbers). In this study, the shortcomings of some existing methods are pointed out, and to overcome these shortcomings, two new methods (based on fuzzy linear programming formulation and classical transportation methods) are proposed to find a fuzzy optimal solution to fuzzy transportation problems with a new representation of trapezoidal fuzzy numbers. The advantages of the proposed methods over existing methods are discussed. Also, it is shown that it is better to use the proposed representation of trapezoidal fuzzy numbers instead of the existing representation of trapezoidal fuzzy numbers for finding a fuzzy optimal solution to fuzzy transportation problems. To illustrate the proposed methods, a fuzzy …", "num_citations": "27\n", "authors": ["188"]}
{"title": "A new algorithm for solving shortest path problem on a network with imprecise edge weight\n", "abstract": " Nayeem and Pal (Shortest path problem on a network with imprecise edge weight, Fuzzy Optimization and Decision Making 4, 293-312, 2005) proposed a new algorithm for solving shortest path problem on a network with imprecise edge weight. In this paper the shortcomings of the existing algorithm,(Nayeem and Pal, 2005) are pointed out and to overcome these shortcomings a new algorithm is proposed. To show the advantages of the proposed algorithm over existing algorithm the numerical examples presented in (Nayeem and Pal, 2005) are solved using the proposed algorithm and obtained results are discussed.", "num_citations": "27\n", "authors": ["188"]}
{"title": "Approximate clustering with same-cluster queries\n", "abstract": " Ashtiani et al. proposed a Semi-Supervised Active Clustering framework (SSAC), where the learner is allowed to make adaptive queries to a domain expert. The queries are of the kind \"do two given points belong to the same optimal cluster?\" There are many clustering contexts where such same-cluster queries are feasible. Ashtiani et al. exhibited the power of such queries by showing that any instance of the -means clustering problem, with additional margin assumption, can be solved efficiently if one is allowed  same-cluster queries. This is interesting since the -means problem, even with the margin assumption, is -hard. In this paper, we extend the work of Ashtiani et al. to the approximation setting showing that a few of such same-cluster queries enables one to get a polynomial-time -approximation algorithm for the -means problem without any margin assumption on the input dataset. Again, this is interesting since the -means problem is -hard to approximate within a factor  for a fixed constant . The number of same-cluster queries used is  which is independent of the size  of the dataset. Our algorithm is based on the -sampling technique. We also give a conditional lower bound on the number of same-cluster queries showing that if the Exponential Time Hypothesis (ETH) holds, then any such efficient query algorithm needs to make  same-cluster queries. Our algorithm can be extended for the case when the oracle is faulty. Another result we show with respect to the -means++ seeding algorithm is that a small modification to the -means++ seeding algorithm within the SSAC …", "num_citations": "25\n", "authors": ["188"]}
{"title": "A note on “A new algorithm to solve fully fuzzy linear programming problems using the MOLP problem”\n", "abstract": " Ezzati et al. (2013) proposed a method for comparing triangular fuzzy numbers and using it, propose a new algorithm to find the fuzzy optimal solution of fully fuzzy linear programming problems with equality constraints. Ezzati et al. also claimed that the fuzzy optimal solution of fully fuzzy linear programming problems with inequality constraints can also be obtained by the same algorithm by transforming it into fully fuzzy linear programming problems with equality constraints. In this note, it is proved that the fully fuzzy linear programming problems with inequality constraints cannot be transformed into fully fuzzy linear programming problems with equality constraints and hence, the algorithm, proposed by Ezzati et al. to find the fuzzy optimal solution of fully fuzzy linear programming problems with equality constraints, cannot be used for finding the fuzzy optimal solution of fully fuzzy linear programming problems with …", "num_citations": "25\n", "authors": ["188"]}
{"title": "Better algorithms for minimizing average flow-time on related machines\n", "abstract": " We consider the problem of minimising flow time on related machines and give an O(logP)-approximation algorithm for the offline case and an O(log2                         P)-competitive algorithm for the online version. This improves upon the previous best bound of O(log2                         P logS) on the competitive ratio. Here P is the ratio of the maximum to the minimum processing time of a job and S is the ratio of the maximum to the minimum speed of a machine.", "num_citations": "25\n", "authors": ["188"]}
{"title": "Fuzzy optimal solution of fully fuzzy linear programming problems using ranking function\n", "abstract": " In this paper, a new method is proposed to find the fuzzy optimal solution of fully fuzzy linear programming (FFLP) problems with mixed constraints. By using the proposed method the fuzzy optimal solution of FFLP problems with mixed constraints occurring in real life situations can be easily obtained. To illustrate the proposed method a numerical example is solved. The proposed method can be easily applied to find the fuzzy optimal solution of FFLP problems occurring in real life situations.", "num_citations": "24\n", "authors": ["188"]}
{"title": "RM approach for ranking of L–R type generalized fuzzy numbers\n", "abstract": " Ranking of fuzzy numbers play an important role in decision making, optimization, forecasting etc. Fuzzy numbers must be ranked before an action is taken by a decision maker. In this paper, with the help of several counter examples it is proved that ranking method proposed by Chen and Chen (Expert Syst Appl 36:6833–6842, 2009) is incorrect. The main aim of this paper is to propose a new approach for the ranking of L–R type generalized fuzzy numbers. The proposed ranking approach is based on rank and mode so it is named as RM approach. The main advantage of the proposed approach is that  it provides the correct ordering of generalized and normal fuzzy numbers and it is very simple and easy to apply in the real life problems. It is shown that proposed ranking function satisfies all the reasonable properties of fuzzy quantities proposed by Wang and Kerre (Fuzzy Sets Syst 118:375–385, 2001).", "num_citations": "24\n", "authors": ["188"]}
{"title": "Anaesthesia for non-cardiac surgery in a cardiac transplant recipient\n", "abstract": " Cardiac transplantation has become the standard therapy for idiopathic dilated cardiomyopathy and end-stage ischaemic heart disease. With the introduction of newer immunosuppressants, together with better patient selection, improved perioperative monitoring and care, the overall survival of recipients has improved. An increasing number of patients who received a transplant present for either elective or emergency non-cardiac surgery. We hereby discuss the perioperative management of such a patient who came to our set-up for bipolar haemiarthroplasty.", "num_citations": "23\n", "authors": ["188"]}
{"title": "A new algorithm for solving network flow problems with fuzzy arc lengths\n", "abstract": " In conventional shortest path problems, it is assumed that decision maker is certain about the parameters (distance, time etc.) between different nodes. But in real life situations, there always exist uncertainty about the parameters between different nodes. In such cases, the parameters are represented by fuzzy numbers. In this paper the shortcomings of the existing algorithm are pointed out and to overcome these shortcomings a new algorithm is proposed. By using the proposed algorithm a decision maker can obtain both the fuzzy shortest path and fuzzy shortest distance of each node from source node.", "num_citations": "23\n", "authors": ["188"]}
{"title": "A new method for fuzzy critical path analysis in project networks with a new representation of triangular fuzzy numbers\n", "abstract": " The method for finding fuzzy optimal solution of fully fuzzy critical path (FFCP) problems ie, critical path problems in which all the parameters are represented by fuzzy numbers, is at best scant; possibly non-existent. In this paper, a method is proposed to find the fuzzy optimal solution of FFCP problems, together with a new representation of triangular fuzzy numbers. This paper will show the advantages of using, the proposed representation over the existing representations of triangular fuzzy numbers and will present with great clarity the proposed method and illustrate its application to FFCP problems occurring in real life situations.", "num_citations": "23\n", "authors": ["188"]}
{"title": "Generalized simplex algorithm to solve fuzzy linear programming problems with ranking of generalized fuzzy numbers\n", "abstract": " In this paper the shortcomings of an existing method for comparing the generalized fuzzy numbers are pointed out and a new method is proposed for same. Also using the proposed ranking method, a generalized simplex algorithm is proposed for solving a special type of fuzzy linear programming (FLP) problems. To illustrate the proposed algorithm a numerical example is solved and the advantages of the proposed algorithm are discussed. Since the proposed algorithm is a direct extension of classical algorithm so it is very easy to understand and apply the proposed algorithm to find the fuzzy optimal solution of FLP problems occurring in the real life situations.", "num_citations": "22\n", "authors": ["188"]}
{"title": "Join-distinct aggregate estimation over update streams\n", "abstract": " There is growing interest in algorithms for processing and querying continuous data streams (ie, data that is seen only once in a fixed order) with limited memory resources. Providing (perhaps approximate) answers to queries over such streams is a crucial requirement for many application environments; examples include large IP network installations where performance data from different parts of the network needs to be continuously collected and analyzed.", "num_citations": "22\n", "authors": ["188"]}
{"title": "Ambika methods for solving matrix games with Atanassov's intuitionistic fuzzy payoffs\n", "abstract": " In the last few years, a lot of researchers have proposed different methods, to solve the mathematical programming problem of matrix games with Atanassov's intuitionistic fuzzy payoffs. In this paper, the flaws of the existing methods for solving matrix games with Atanassov's intuitionistic fuzzy payoffs (matrix games in which payoffs are represented by Atanassov's intuitionistic fuzzy numbers) are pointed out. Also, to resolve these flaws, new methods (named as Ambika methods) are proposed to obtain the optimal strategies as well as minimum expected gain of Player I and maximum expected loss of Player II for matrix games with Atanassov's intuitionistic fuzzy payoffs. To illustrate proposed Ambika methods, some existing numerical problems of matrix games with Atanassov's intuitionistic fuzzy payoffs are solved by proposed Ambika methods.", "num_citations": "21\n", "authors": ["188"]}
{"title": "Constant factor approximation algorithm for the knapsack median problem\n", "abstract": " We give a constant factor approximation algorithm for the following generalization of the k-median problem. We are given a set of clients and facilities in a metric space. Each facility has a facility opening cost, and we are also given a budget B. The objective is to open a subset of facilities of total cost at most B, and minimize the total connection cost of the clients. This settles an open problem of Krishnaswamy-Kumar-Nagarajan-Sabharwal-Saha. The natural linear programming relaxation for this problem has unbounded integrality gap. Our algorithm strengthens this relaxation by adding constraints which stipulate which facilities a client can get assigned to. We show that after suitably modifying a fractional solution, one can get rich structural properties which allow us to get the desired approximation ratio.", "num_citations": "21\n", "authors": ["188"]}
{"title": "All-Norms and All-Lp-Norms Approximation Algorithms\n", "abstract": " In many optimization problems, a solution can be viewed as ascribing a``cost\\'\\'to each client, and the goal is to optimize some aggregation of the per-client costs. We often optimize some -norm (or some other symmetric convex function or norm) of the vector of costs---though different applications may suggest different norms to use. Ideally, we could obtain a solution that optimizes several norms simultaneously. In this paper, we examine approximation algorithms that simultaneously perform well on all norms, or on all  norms. A natural problem in this framework is the  Set Cover problem, which generalizes\\textsc {Set Cover} and\\textsc {Min-Sum Set Cover}. We show that the greedy algorithm\\emph {simultaneously gives a -approximation for all , and show that this approximation ratio is optimal up to constants} under reasonable complexity-theoretic assumptions. We additionally show how to use our analysis techniques to give similar results for the more general\\emph {submodular set cover}, and prove some results for the so-called\\emph {pipelined set cover} problem. We then go on to examine approximation algorithms in the``all-norms\\'\\'and the``all--norms\\'\\'frameworks more broadly, and present algorithms and structural results for other problems such as -facility-location, TSP, and average flow-time minimization, extending and unifying previously known results.", "num_citations": "21\n", "authors": ["188"]}
{"title": "Minimizing maximum (weighted) flow-time on related and unrelated machines\n", "abstract": " In this paper we initiate the study of job scheduling on related and unrelated machines so as to minimize the maximum flow time or the maximum weighted flow time (when each job has an associated weight). Previous work for these metrics considered only the setting of parallel machines, while previous work for scheduling on unrelated machines only considered  norms. Our main results are: (1) we give an -competitive algorithm to minimize maximum weighted flow time on related machines where we assume that the machines of the online algorithm can process  units of a job in 1 time-unit ( speed augmentation). (2) For the objective of minimizing maximum flow time on unrelated machines we give a simple -competitive algorithm when we augment the speed by . For m machines we show a lower bound of  on the competitive ratio if speed augmentation is not permitted. Our algorithm does not assign …", "num_citations": "20\n", "authors": ["188"]}
{"title": "Greedy algorithms for steiner forest\n", "abstract": " In the Steiner Forest problem, we are given terminal pairs s i, t i, and need to find the cheapest subgraph which connects each of the terminal pairs together. In 1991, Agrawal, Klein, and Ravi gave a primal-dual constant-factor approximation algorithm for this problem. Until this work, the only constant-factor approximations we know are via linear programming relaxations.", "num_citations": "19\n", "authors": ["188"]}
{"title": "Approximation algorithms for the unsplittable flow problem on paths and trees\n", "abstract": " We study the Unsplittable Flow Problem (UFP) and related variants, namely UFP with Bag Constraints and UFP with Rounds, on paths and trees. We provide improved constant factor approximation algorithms for all these problems under the no bottleneck assumption (NBA), which says that the maximum demand for any source-sink pair is at most the minimum capacity of any edge. We obtain these improved results by expressing a feasible solution to a natural LP relaxation of the UFP as a near-convex combination of feasible integral solutions.", "num_citations": "19\n", "authors": ["188"]}
{"title": "A new method to find the unique fuzzy optimal value of fuzzy linear programming problems\n", "abstract": " In this paper, shortcomings and limitations of the existing methods for solving fuzzy linear programming (FLP) problems are pointed out. To overcome the limitations as well as to resolve the shortcomings, a new method is proposed for solving FLP problems. To show the advantage of the proposed method over existing methods, a FLP problem is solved by the existing methods as well as the proposed method, and the obtained results are compared.", "num_citations": "18\n", "authors": ["188"]}
{"title": "Fuzzy modeling, control and optimization of textile processes\n", "abstract": " A new hierarchical fuzzy control strategy is proposed to optimize the slasher-a typical textile process employed to prepare yarn before it is woven into fabric. A genetic algorithm is used to decide upon global optimal set points for the slasher. A fuzzy expert system detects and identifies off-limits or failure conditions and generates command signals for low level control routines of such slasher components as the creel section, size box, the drying section and the beamer drive. The paper also addresses the issue of system integration between warping and weaving at a hierarchical level. Simple process models for each section of the slasher are used for computer simulation purposes. Simulation results from these models demonstrate that the proposed control strategy is efficient and robust.< >", "num_citations": "18\n", "authors": ["188"]}
{"title": "A constant-factor approximation for stochastic Steiner forest\n", "abstract": " We consider the stochastic Steiner forest problem: suppose we were given a collection of Steiner forest instances, and were guaranteed that a random one of these instances would appear tomorrow; moreover, the cost of edges tomorrow will be λ times the cost of edges today. Which edges should we buy today so that we can extend it to a solution for the instance arriving tomorrow, to minimize the expected total cost? While very general results have been developed for many problems in stochastic discrete optimization over the past years, the approximation status of the stochastic Steiner Forest problem has remained open, with previous works yielding constant-factor approximations only for special cases. We resolve the status of this problem by giving a constant-factor primal-dual based approximation algorithm.", "num_citations": "17\n", "authors": ["188"]}
{"title": "Minimizing total flow-time: The unrelated case\n", "abstract": " We consider the problem of minimizing flow-time in the unrelated machines setting. We introduce a notion of (α, β) variability to capture settings where processing times of jobs on machines are not completely arbitrary and give an O (β log α) approximation for this setting. As special cases, we get (1) an O (k) approximation when there are only k different processing times (2) an O (log P)-approximation if each job can only go on a specified subset of machines, but has the same processing requirement on each such machine. Further, the machines can have different speeds. Here P is the ratio of the largest to the smallest processing requirement,(3) an-approximation algorithm for unrelated machines if we assume that our algorithm has machines which are an ε-factor faster than the optimum algorithm’s machines. We also improve the lower bound on the approximability for the problem of minimizing flow time on …", "num_citations": "16\n", "authors": ["188"]}
{"title": "Stochastic Steiner tree with non-uniform inflation\n", "abstract": " We study the Steiner Tree problem in the model of two-stage stochastic optimization with non-uniform inflation factors, and give a poly-logarithmic approximation factor for this problem. In this problem, we are given a graph G = (V,E), with each edge having two costs c                                            M                  and c                                            T                  (the costs for Monday and Tuesday, respectively). We are also given a probability distribution π: 2                   V                  →[0,1] over subsets of V, and will be given a client set                         S drawn from this distribution on Tuesday. The algorithm has to buy a set of edges E                                            M                  on Monday, and after the client set S is revealed on Tuesday, it has to buy a (possibly empty) set of edges E                                            T                 (S) so that the edges in E                                            M                  ∪ E                                            T                 (S) connect all the …", "num_citations": "16\n", "authors": ["188"]}
{"title": "Solution of fully fuzzy linear system with arbitrary coefficients\n", "abstract": " Different methods are proposed for finding the non negative solution of fully fuzzy linear system (FFLS) i.e. fuzzy linear system with fuzzy coefficients involving fuzzy variables. To the best of our knowledge, there is no method in the literature for finding the non negative solution of FFLS without any restriction on the coefficient matrix. In this paper a new computational method is proposed to solve FFLS with arbitrary coefficients. To illustrate the proposed method, numerical examples are solved.", "num_citations": "15\n", "authors": ["188"]}
{"title": "A new approach for solving fuzzy maximal flow problems\n", "abstract": " In conventional maximal flow problems, it is assumed that decision maker is certain about the flows between different nodes. But in real life situations, there always exist uncertainty about the flows between different nodes. In such cases, the flows may be represented by fuzzy numbers. In literature, there are several methods to solve such type of problems. Till now, no one has used ranking function to solve above type of problems. In this paper, a new algorithm is proposed to find fuzzy maximal flow between source and sink by using ranking function. To illustrate the algorithm a numerical example is solved and result is explained. If there is no uncertainty about the flow between source and sink then the proposed algorithm gives the same result as in crisp maximal flow problems.", "num_citations": "15\n", "authors": ["188"]}
{"title": "A system-level perspective for efficient NoC design\n", "abstract": " With the advent of chip multiprocessors (CMPs) in mainstream systems, the on-chip network that connects different processing cores becomes a critical part of the design. There has been significant work in the recent past on designing these networks for efficiency and scalability. However, most network design evaluations use a stand-alone network simulator which fails to capture the system-level implications of the design. New design innovations, which might yield promising results when evaluated using such stand-alone models, may not look that attractive when evaluated in a full-system simulation framework. In this work, we present GARNET, a detailed network model incorporated inside a full-system simulator which enables system-level performance and power modeling of network-level techniques. GARNET also facilitates accurate evaluation of techniques that simultaneously leverage the memory hierarchy …", "num_citations": "15\n", "authors": ["188"]}
{"title": "Fuzzy system reliability analysis using Tω (the weakest t-norm) based arithmetic operations on L-R type interval valued vague sets\n", "abstract": " Purpose – The purpose of this research is to develop a new approach for analyzing the fuzzy reliability of a series and parallel system. Also to introduce definition of L‐R type interval valued triangular vague set and certain Tω‐based arithmetic operations between two L‐R type interval valued triangular vague sets.Design/methodology/approach – In the proposed approach using a fault tree an interval valued vague fault tree is developed for the system in which the fuzzy reliability of each component of the system is represented by a L‐R type interval valued triangular vague set. Then with the help of a developed interval valued vague fault tree an algorithm is developed to analyze the fuzzy system reliability.Findings – For numerical verification of the proposed approach the fuzzy reliability of the basement flooding has been analyzed using the existing approaches and the proposed approach. Comparing the results …", "num_citations": "15\n", "authors": ["188"]}
{"title": "A note on the paper “A simplified novel technique for solving fully fuzzy linear programming problems”\n", "abstract": " In this note, it is shown that there is error in the existing technique (Khan, I.U., Ahmad, T., Maan, N: A simplified novel technique for solving fully fuzzy linear programming problems. J. Optim. Theory Appl. 159:536–546, 2013).", "num_citations": "14\n", "authors": ["188"]}
{"title": "Reliability evaluation of condensate system using fuzzy Markov model\n", "abstract": " Traditional reliability studies assume that transition rates or probabilities in Markov models are accurate. However, in reality, reliability data is either insufficient or mixed with uncertainty. The purpose of this paper is to evaluate the fuzzy reliability of condensate system. In this paper, the fuzzy Kolmogorov’s differential equations are developed by using fuzzy Markov model of condensate system and to evaluate the fuzzy reliability of condensate system, the fuzzy Kolmogorov’s differential equations are solved by an existing analytical method for solving nth order fuzzy linear differential equations.", "num_citations": "14\n", "authors": ["188"]}
{"title": "Resource allocation for covering time varying demands\n", "abstract": " We consider the problem of allocating resources to satisfy demand requirements varying over time. The input specifies a demand for each timeslot. Each resource is specified by a start-time, end-time, an associated cost and a capacity. A feasible solution is a multiset of resources such that at any point of time, the sum of the capacities offered by the resources is at least the demand requirement at that point of time. The goal is to minimize the total cost of the resources included in the solution. This problem arises naturally in many scenarios such as workforce management, sensor networks, cloud computing, energy management and distributed computing. We study this problem under the partial cover setting and the zero-one setting. In the former scenario, the input also includes a number k and the goal is to choose a minimum cost solution that satisfies the demand requirements of at least k timeslots. For this …", "num_citations": "14\n", "authors": ["188"]}
{"title": "A new approach for ranking of generalized trapezoidal fuzzy numbers\n", "abstract": " Ranking of fuzzy numbers play an important role in decision making, optimization, forecasting etc. Fuzzy numbers must be ranked before an action is taken by a decision maker. In this paper, with the help of several counter examples it is proved that ranking method proposed by Chen and Chen (Expert Systems with Applications 36 (2009) 6833-6842) is incorrect. The main aim of this paper is to propose a new approach for the ranking of generalized trapezoidal fuzzy numbers. The main advantage of the proposed approach is that the proposed approach provide the correct ordering of generalized and normal trapezoidal fuzzy numbers and also the proposed approach is very simple and easy to apply in the real life problems. It is shown that proposed ranking function satisfies all the reasonable properties of fuzzy quantities proposed by Wang and Kerre (Fuzzy Sets and Systems 118 (2001) 375-385).", "num_citations": "14\n", "authors": ["188"]}
{"title": "Solving fully fuzzy linear programming problems with inequality constraints\n", "abstract": " SID.ir | SOLVING FULLY FUZZY LINEAR PROGRAMMING PROBLEMS WITH INEQUALITY CONSTRAINTS Click for new scientific resources and news about Corona[COVID-19] Use Online Translation Powered By Click Here STRS STRS www.SID.ir Home Journals Authors ISI Iranian Journals Updated Journals JCR About Us Contact Us Help Others Scientific Information Databases بانک نشریات فارسی ایران بانک همایش های علمی فارسی ایران بانک طرح های پژوهشی فارسی ایران مراکز علمی تخصصی ایران English Journals Database of Iran English Seminars Database of Iran Today: 6/17/2021 Advanced Search Papers ... English فارسی Paper Information Journal: INTERNATIONAL JOURNAL OF PHYSICAL AND MATHEMATICAL SCIENCES 2010 , Volume 1 , Number -; Page(s) 6 To 18. Paper: SOLVING FULLY FUZZY LINEAR PROGRAMMING PROBLEMS WITH INEQUALITY CONSTRAINTS Author(s): KUMAR A., J., P…", "num_citations": "14\n", "authors": ["188"]}
{"title": "Minimizing average flow time on related machines\n", "abstract": " We give the first on-line poly-logarithmic competitve algorithm for minimizing average flow time with preemption on related machines, ie, when machines can have different speeds. This also yields the first poly-logarithmic polynomial time approximation algorithm for this problem. More specifically, we give an O (log 2 P• log S)-competitive algorithm, where P is the ratio of the biggest and the smallest processing time of a job, and S is the ratio of the highest and the smallest speed of a machine. Our algorithm also has the nice property that it is non-migratory. The scheduling algorithm is based on the concept of making jobs wait for a long enough time before scheduling them on slow machines.", "num_citations": "14\n", "authors": ["188"]}
{"title": "Tree based MPLS routing\n", "abstract": " MPLS (MultiProtocol Label Switching) is a new technology proposed by the IETF [4, 10] for network routing, and is being increasingly deployed by the largest Internet service providers. The MPLS technology differs from conventional network protocols in a crucial way: instead of reading the entire packet header at all switching points, the analysis of the packet header is done just once, when the packet header is assigned a stack of labels, and thenceforth, each switching point or router just gets to look at the label at the top of the stack (and the ingress edge), and based only on this information, it has to make a decision about the next-hop node [17, 16]. In another departure from conventional routing and in particular from IP source routing, where the entire packet route is explicitly put in the header and popped off along the route, the router can not only pop the top label, it can push other labels on top of the stack. The …", "num_citations": "14\n", "authors": ["188"]}
{"title": "A novel general approach to evaluating the reliability of gas turbine system\n", "abstract": " In this paper, a new methodology named as vague lambda–tau, is proposed for reliability analysis of the repairable systems based on a trapezoidal vague set with different left and right heights. In this methodology, the trapezoidal vague set with different left and right heights is coupled with the conventional lambda–tau method to evaluate the vague expressions for OR-transition of the Petri Nets model. The qualitative and quantitative analysis of gas turbine system has been discussed in this work. In qualitative analysis, the Petri Net model is obtained from its equivalent Fault Tree and in quantitative analysis, the reliability parameters are evaluated using the vague lambda–tau methodology. The system reliability can be analyzed in a more flexible and intelligent manner by using the proposed approach.", "num_citations": "13\n", "authors": ["188"]}
{"title": "Fully fuzzy linear systems of triangular fuzzy numbers (a, b, c)\n", "abstract": " Purpose – The purpose of this paper is to study a nascent theory and an emerging concept of solving a fully fuzzy linear system (FFLS) with no non negative restrictions on the triangular fuzzy numbers chosen as parameters. Two new simplified computational methods are proposed to solve a FFLS without any sign restrictions. The first method eliminates the non‐negativity constraint from the coefficient matrix while the second method eliminates the constraint of non‐negativity on the solution vector. The methods are introduced with an objective to broaden the domain of fuzzy linear systems to encompass a wide range of problems occurring in reality.Design/methodology/approach – The design of numerical methods is motivated by decomposing the fuzzy based linear system into its equivalent crisp linear form which can be further solved by variety of classical methods to solve a crisp linear system. Further the paper …", "num_citations": "13\n", "authors": ["188"]}
{"title": "Single-path routing for life time maximization in multi-hop wireless networks\n", "abstract": " Energy-aware routing is important in multi-hop wireless networks that are powered by battery, e.g., wireless sensor networks. To maximize the network survivability, the energy efficiency of paths must be taken into account for route selection. Simple heuristics such as choosing paths with minimal energy consumption are ineffective, because the energy of the nodes on such paths may deplete quickly. The issue is particularly serious for the networks with regular traffic pattern as in monitoring sensor applications. Existing solutions to this issue typically adopt the multi-path routing approach, in which multiple paths are set up between source and destination and one (or all) of the paths is (are) used at a certain moment. However, this approach involves high overhead for establishment and management of multiple paths. In this paper, we present a static single-path routing scheme which uses one energy …", "num_citations": "13\n", "authors": ["188"]}
{"title": "Approximation algorithms for the partition vertex cover problem\n", "abstract": " We consider a natural generalization of the Partial Vertex Cover problem. Here an instance consists of a graph G=(V, E), a cost function c: V→ Z+, a partition P 1,…, P r of the edge set E, and a parameter k i for each partition P i. The objective is to find a minimum cost set of vertices which cover at least k i edges from the partition P i. We call this the Partition-VC problem. In this paper, we give matching upper and lower bound on the approximability of this problem. Our algorithm is based on a novel LP relaxation for this problem. This LP relaxation is obtained by adding knapsack cover inequalities to a natural LP relaxation of the problem. We show that this LP has integrality gap of O (log⁡ r), where r is the number of sets in the partition of the edge set. We also extend our result to more general settings. For example we consider a problem where additionally edges have profits, and we would like to pick a minimum cost …", "num_citations": "12\n", "authors": ["188"]}
{"title": "Optimal way of selecting cities and conveyances for supplying coal in uncertain environment\n", "abstract": " In this paper, the limitations and shortcomings of the existing methods for solving fuzzy solid transportation problem are pointed out and to overcome these shortcomings, a new method is proposed for solving fuzzy solid transportation problem. The advantages of the proposed method over the existing methods are discussed. To illustrate the proposed method, an existing fuzzy solid transportation problem is solved. Also, to show the application of the proposed method in real life problems an existing real life fuzzy solid transportation problem is solved by the proposed method.", "num_citations": "12\n", "authors": ["188"]}
{"title": "Express virtual channels in a packet switched on-chip interconnection network\n", "abstract": " A method, router node, and set of instructions for using express virtual channels in a component network on a chip. An input link 302 may receive an express flow control unit from a source node 102 in a packet-switched network via an express virtual channel 110. An output link 306 may send the express flow control unit to a sink node 106. A switch allocator 322 may forward the express flow control unit directly to the output link 306.", "num_citations": "12\n", "authors": ["188"]}
{"title": "Methods and devices for scheduling the transmission of packets in configurable access wireless networks that provide Quality-of-Service guarantees\n", "abstract": " A more energy efficient, medium access control (MAC) layer of a multi-hop wireless network is provided using scheduling techniques which reduce packet collisions, and therefore the need for packet re-transmissions, while ensuring both bandwidth and delay, Quality-of-Service (QoS) guarantees. The techniques are used in conjunction with the formation of a multi-hop, configurable access wireless network (CAN).", "num_citations": "12\n", "authors": ["188"]}
{"title": "A Local-Search Algorithm for Steiner Forest\n", "abstract": " In the Steiner Forest problem, we are given a graph and a collection of source-sink pairs, and the goal is to find a subgraph of minimum total length such that all pairs are connected. The problem is APX-Hard and can be 2-approximated by, e.g., the elegant primal-dual algorithm of Agrawal, Klein, and Ravi from 1995. We give a local-search-based constant-factor approximation for the problem. Local search brings in new techniques to an area that has for long not seen any improvements and might be a step towards a combinatorial algorithm for the more general survivable network design problem. Moreover, local search was an essential tool to tackle the dynamic MST/Steiner Tree problem, whereas dynamic Steiner Forest is still wide open. It is easy to see that any constant factor local search algorithm requires steps that add/drop many edges together. We propose natural local moves which, at each step, either (a) add a shortest path in the current graph and then drop a bunch of inessential edges, or (b) add a set of edges to the current solution. This second type of moves is motivated by the potential function we use to measure progress, combining the cost of the solution with a penalty for each connected component. Our carefully-chosen local moves and potential function work in tandem to eliminate bad local minima that arise when using more traditional local moves.", "num_citations": "11\n", "authors": ["188"]}
{"title": "General form of linear programming problems with fuzzy parameters\n", "abstract": " In this paper, it is pointed out that the existing general form of such fully fuzzy linear programming problems in which all the parameters are represented by such flat fuzzy numbers for which is valid only if there is not a negative sign. However, if there is a negative sign, then the existing general form of fully fuzzy linear programming problems is not valid. Thus, a new general form is proposed.", "num_citations": "11\n", "authors": ["188"]}
{"title": "A new method for sensitivity analysis of fuzzy transportation problems\n", "abstract": " In the literatures, the sensitivity analysis of fuzzy transportation problems has not been explored like other mathematical programming problems. In this paper, a new method is proposed for the same. To illustrate the proposed method a numerical example is solved by using the proposed method.", "num_citations": "11\n", "authors": ["188"]}
{"title": "A Note on “A New Method for Solving Fuzzy Linear Programming Problems Based on the Fuzzy Linear Complementary Problem (FLCP)”\n", "abstract": " Mottaghi et al. (Int J Fuzzy Syst 17:236–245, 2015) proposed some results by considering a pair of fuzzy linear programming problems as a primal—dual pair. In this paper, it is pointed out that the pair of fuzzy linear programming problems, considered by Mottaghi et al. as a primal—dual pair, is not a primal—dual pair. Hence, all the results, proposed by Mottaghi et al. by considering the pair of fuzzy linear programming problems as a primal—dual pair, are not valid.", "num_citations": "10\n", "authors": ["188"]}
{"title": "Method for solving unbalanced fully fuzzy multi-objective solid minimal cost flow problems\n", "abstract": " In fuzzy single and multi-objective minimal cost flow (MCF) problems, it is assumed that there is only one conveyance which can be used for transporting the product. However, in real life problems, more than one conveyance is used for transporting the product. To the best of our knowledge untill now no method is proposed in the literature for solving such fuzzy single and multi-objective MCF problems in which more than one conveyance is used for transporting the product and all the parameters, as well as all the decision variables that are represented by fuzzy numbers. In this paper, these types of fuzzy multi-objective MCF problems are called fully fuzzy multi-objective solid minimal cost flow (SMCF) problems and a new method is proposed for solving these problems. The advantages of the proposed methods are also discussed.", "num_citations": "10\n", "authors": ["188"]}
{"title": "Mehar’s method for solving fuzzy sensitivity analysis problems with LR flat fuzzy numbers\n", "abstract": " In published works on fuzzy linear programming there are only few papers dealing with stability or sensitivity analysis in fuzzy mathematical programming. To the best of our knowledge, till now there is no method in the literature to deal with the sensitivity analysis of such fuzzy linear programming problems in which all the parameters are represented by LR flat fuzzy numbers. In this paper, a new method, named as Mehar’s method, is proposed for the same. To show the advantages of proposed method over existing methods, some fuzzy sensitivity analysis problems which may or may not be solved by the existing methods are solved by using the proposed method.", "num_citations": "10\n", "authors": ["188"]}
{"title": "Optimization for different types of transportation problems with fuzzy coefficients in the objective function\n", "abstract": " To the best of our knowledge, there is no method in the literature for solving such fuzzy transportation problems in which the different cost parameters are represented by different type of LR flat fuzzy numbers. In this paper, a new method is proposed for solving similar type of fuzzy transportation problems. To illustrate the proposed method and also to show the advantages of the proposed method some fuzzy transportation problems which can not be solved by using any of the existing method are solved. Also, it is shown that the fuzzy transportation problems which can be solved by the existing methods can also be solved by using the proposed method and the same results are obtained.", "num_citations": "10\n", "authors": ["188"]}
{"title": "A new method for solving sensitivity analysis for fuzzy linear programming problems\n", "abstract": " The fuzzy set theory is being applied massively in many fields these days. One of these is linear programming problems. Kheirfam and Hasani (Sensitivity analysis for fuzzy linear programming problems with fuzzy variables, Advanced Modeling and Optimization, 12 (2010) 257-272), proposed a method for the sensitivity analysis for fuzzy linear programming (FLP) problems with fuzzy variables. There are some important cases that are not considered by Kheirfam and Hasani. In this paper, those cases are considered and numerical examples are solved.", "num_citations": "10\n", "authors": ["188"]}
{"title": "Minimum cost resource allocation for meeting job requirements\n", "abstract": " We consider the problem of allocating resources for completing a collection of jobs. Each resource is specified by a start-time, finish-time and the capacity of resource available and has an associated cost, and each job is specified by a start-time, finish-time and the amount of the resource required (demand) during this interval. A feasible solution is a multiset of resources (i.e., multiple units of each resource may be picked) such that at any point of time, the sum of the capacities offered by the resources is at least the total demand of the jobs active at that point of time. The cost of the solution is the sum of the costs of the resources included in the solution (taking into account the units of the resources). The goal is to find a feasible solution of minimum cost. This problem arises naturally in many scenarios. For example, given a set of jobs, we would like to allocate some resource such as machines, memory or bandwidth in …", "num_citations": "10\n", "authors": ["188"]}
{"title": "Application of linear programming for solving fuzzy transportation problems\n", "abstract": " There are several methods, in the literature, for finding the fuzzy optimal solution of fully fuzzy transportation problems (transportation problems in which all the parameters are represented by fuzzy numbers). In this paper, the shortcomings of some existing methods are pointed out and to overcome these shortcomings, a new method (based on fuzzy linear programming formulation) is proposed to find the fuzzy optimal solution of unbalanced fuzzy transportation problems with a new representation of trapezoidal fuzzy numbers. The advantages of the proposed method over existing method are discussed. Also, it is shown that it is better to use the proposed representation of trapezoidal fuzzy numbers instead of existing representation of trapezoidal fuzzy numbers for finding the fuzzy optimal solution of fuzzy transportation problems. To illustrate the proposed method a fuzzy transportation problem (FTP) is solved by using the proposed method and the obtained results are discussed. The proposed method is easy to understand and to apply for finding the fuzzy optimal solution of fuzzy transportation problems occurring in real life situations.", "num_citations": "10\n", "authors": ["188"]}
{"title": "A new approach for fuzzy critical path analysis\n", "abstract": " A new method, named as Mehar's method is proposed to solve fuzzy critical path problems. To show the advantages of the Mehar's method over an existing method the results of a fuzzy critical path problem, obtained by using the existing and Mehar's method, are compared. Also, it is shown that although the results, obtained by using the existing and Mehar's method, are mathematically correct but the obtained and the existing results have no physical meaning. To overcome this shortcoming a new subtraction operation, named as Mehar's subtraction, is introduced and the Mehar's method is further modified with Mehar's subtraction.", "num_citations": "9\n", "authors": ["188"]}
{"title": "Building edge-failure resilient networks\n", "abstract": " We consider the design of resilient networks that are fault tolerant   against link failures.  Resilience against link failures can be built   into the network by providing backup paths, which are used in   the eventuality of an edge failure occurring on a primary path in the   network. We consider several network design problems in this context;   these problems are motivated by the requirements of current high-speed   optical networks. In all the following problems the objective is to   provide resilience in networks while minimizing the cost incurred.    The main problem under consideration in this paper is that of backup   allocation: this problem takes as its input an already provisioned    primary network and a parameter k, and allocates backup capacity    on the edges of the underlying network so that all the demand can be    routed even in the presence of k edge failures. We also consider a    variant of this problem …", "num_citations": "9\n", "authors": ["188"]}
{"title": "Anesthetic management of a child with Hunter's syndrome\n", "abstract": " Hunter's syndrome is a member of a group of recessively inherited metabolic disorders termed mucopolysaccharidoses, caused by deficiency of lysosomal enzymes required for degradation of mucopolysaccharides or glycosaminoglycans, leading to accumulation of partially degraded glycosaminoglycans in various tissues. This leads to various anatomical abnormalities and systemic involvement, posing a challenge to an anesthetist. We present the anesthetic management of a 4-year old child with Hunter's disease with anticipated difficult airway, who presented for adenotonsillectomy and repair of umbilical and inguinal hernia.", "num_citations": "8\n", "authors": ["188"]}
{"title": "Reliability analysis of piston manufacturing system\n", "abstract": " Now days, internal combustion engines are used in most of the automobiles and mechanical machineries. The piston is a part without which no internal combustion engine can work ie, piston plays a vital role in almost all types of vehicles. So, the reliability of piston manufacturing system is most essential for the proper functioning of vehicles. In this paper, fault tree method is used to analyze the reliability of piston manufacturing system. Also, risk reduction worth is adopted as a measure of importance for identifying the crucial element that has significant impact on the reliability.", "num_citations": "8\n", "authors": ["188"]}
{"title": "A new method for solving fuzzy sensitivity analysis problems\n", "abstract": " ABSTRACT  Kheirfam and Hasani (Sensitivity analysis for fuzzy linear programming problems with fuzzy variables, Advanced Modeling and Optimization, 12 (2010) 257-272), proposed a new method to deal with the sensitivity analysis of such fuzzy linear programming (FLP) problems in which all the elements of coefficient matrix of the constraints and the coefficients of the decision variables in the objective function are represented by real numbers and remaining parameters are represented by trapezoidal fuzzy numbers. In this paper, it is shown that the existing method can’t be used for solving sensitivity analysis of such FLP problems in which only the elements coefficient matrix of constraints are represented by real numbers and other parameters are represented by trapezoidal fuzzy numbers. To overcome this limitation of existing method, a new method, named as Mehar’s method, is proposed to deal with the sensitivity analysis of FLP problems. The main advantage of Mehar’s method over existing method is that Mehar’s method is easy to apply as compare to existing method and can be used to deal with the sensitivity analysis of both type of fuzzy sensitivity analysis problem. To show the advantages of the Mehar’s method over existing method some fuzzy sensitivity analysis problems, which may or may not be solved by using existing methods, are solved by using Mehar’s method.", "num_citations": "8\n", "authors": ["188"]}
{"title": "Fault-tree analysis of different systems\n", "abstract": " This thesis is devoted to fault tree analysis of different systems, the qualitative and quantitative analysis of their fault trees. The fault tree analysis is a deductive failure based approach, where an undesired state of the system is specified and analyzed to find the ways in which the system can reach that state. The main topics are the introduction to fault tree analysis, qualitative and quantitative analysis of Computer System, Lathe Machine & Printing Circuit Board Assembly. The chapter-wise summary of the thesis is as follows: Chapter 1 is introductory in nature. This chapter includes basic definitions, operations and concepts used throughout the work. Chapter 2 presents brief review of the work done in the area of fault tree analysis, qualitative and quantitative analysis of fault tree. In Chapter 3, the basic reasons for the failure of computer system have been studied. Fault tree has been constructed on the basis of this study and qualitative and quantitative analysis has been done. In Chapter 4, the basic reasons for the failure of tool broken of the lathe machine has been studied. Fault tree has been constructed on the basis of this study and qualitative and quantitative analysis has been done. In the last chapter, the basic reasons for the failure of PCBA system have been studied. Fault tree has been constructed on the basis of this study and qualitative and quantitative analysis has been done.", "num_citations": "8\n", "authors": ["188"]}
{"title": "Optimal configuration of OSPF aggregates\n", "abstract": " Open Shortest Path First (OSPF) is a popular protocol for routing within an Autonomous System (AS) domain. In order to scale for large networks containing hundreds and thousands of subnets, OSPF supports a twolevel hierarchical routing scheme through the use of OSPF areas. Each area consists of a set of interconnected subnets and traffic across areas is handled by routers attached to two or more areas, known as Area Border Routers (ABRs). OSPF ABRs are typically configured to aggregate the subnet addresses in their areas and to advertise these aggregates in the remainder of the network instead of individual subnet addresses. Address aggregation within areas is a crucial requirement for scaling OSPF to large AS domains, as it results in significant reductions in routing table sizes, smaller link-state databases, and less network traffic to synchronize the router link-state databases. On the other hand, address aggregation also implies loss of information about the length of the shortest path from the ABR to each subnet; typically, an ABR associates each advertised aggregate with a single weight that is common for all subnets covered by the aggregate. This, in turn, can lead to the selection of significantly suboptimal OSPF routing paths between source-destination subnet pairs that span different areas. In this paper, we address the important practical problem of configuring OSPF aggregates to minimize the error in OSPF shortest path computations due to subnet aggregation. We first develop an optimal dynamic programming algorithm that, given an upper bound k on the number of aggregates to be advertised by the ABRs and a weight …", "num_citations": "8\n", "authors": ["188"]}
{"title": "Facility Location with Matroid or Knapsack Constraints\n", "abstract": " In the classical k-median problem, we are given a metric space and want to open k centers so as to minimize the sum (over all the vertices) of the distance of each vertex to its nearest open center. In this paper we present the first constant-factor approximation algorithms for two natural generalizations of this problem that handle matroid or knapsack constraints. In the matroid median problem, there is an underlying matroid on the vertices and the set of open centers is constrained to be independent in this matroid. When the matroid is uniform, we recover the k-median problem. Another previously studied special case is the red-blue median problem where we have a partition matroid with two parts. Our algorithm for matroid median is based on rounding a natural linear programming relaxation in two stages, and it relies on a connection to matroid intersection. In the knapsack median problem, centers have weights and …", "num_citations": "7\n", "authors": ["188"]}
{"title": "Mehar methods for fuzzy optimal solution and sensitivity analysis of fuzzy linear programming with symmetric trapezoidal fuzzy numbers\n", "abstract": " The drawbacks of the existing methods to obtain the fuzzy optimal solution of such linear programming problems, in which coefficients of the constraints are represented by real numbers and all the other parameters as well as variables are represented by symmetric trapezoidal fuzzy numbers, are pointed out, and to resolve these drawbacks, a new method (named as Mehar method) is proposed for the same linear programming problems. Also, with the help of proposed Mehar method, a new method, much easy as compared to the existing methods, is proposed to deal with the sensitivity analysis of the same type of linear programming problems.", "num_citations": "7\n", "authors": ["188"]}
{"title": "Optimal compromise solution of multi-objective minimal cost flow problems in fuzzy environment\n", "abstract": " Ghatee and Hashemi [M. Ghatee, S.M. Hashemi, Ranking function-based solutions of fully fuzzified minimal cost flow problem, Inform. Sci. 177 (2007) 4271–4294] transformed the fuzzy linear programming formulation of fully fuzzy minimal cost flow (FFMCF) problems into crisp linear programming formulation and used it to find the fuzzy optimal solution of balanced FFMCF problems. In this paper, it is pointed out that the method for transforming the fuzzy linear programming formulation into crisp linear programming formulation, used by Ghatee and Hashemi, is not appropriate and a new method is proposed to find the fuzzy optimal solution of multi-objective FFMCF problems. The proposed method can also be used to find the fuzzy optimal solution of single-objective FFMCF problems. To show the application of proposed method in real life problems an existing real life FFMCF problem is solved.", "num_citations": "7\n", "authors": ["188"]}
{"title": "Exact detection of optic disc in retinal images using segmentation based on level set method and morphological operations\n", "abstract": " In this thesis we tried to localize the most important region of eye – optic disc using an approach based on level set method of segmentation. The optic disc is the region on the retina at which optic nerve axons enter and leave the eye. Changes in optic disc shape and area may indicate disease processes, particularly glaucoma, and accurate identification of the disk boundary may be used to quantify changes. The proposed algorithm consists of two steps – in first step, preprocessing of image is done using morphology operations and in second step, boundary of optic disc is detected using level set method. These pre-processing operations minimize erroneous boundary detection of optic disc due to blood vessels crossing it. Preprocessing techniques based on morphological operations of dilation, erosion and reconstruction are developed. After pre-processing, the optic disk boundary was determined using level set method.", "num_citations": "7\n", "authors": ["188"]}
{"title": "Unique fuzzy optimal value of fully fuzzy linear programming problems\n", "abstract": " Kumar, Kaur and Singh (2011), proposed a new method to find the exact fuzzy optimal solution of fully fuzzy linear programming (FFLP) problems with equality constraints. In this paper, an FFLP problem is chosen to show that the fuzzy optimal value, obtained by using the existing method, is not necessarily a unique fuzzy number ie, the fuzzy optimal value of the FFLP problem, obtained by the existing method, does not conform to the uniqueness property of fuzzy optimal value. To overcome this shortcoming of the existing method, a new method is proposed for solving FFLP problems with equality constraints. To show the advantage of the proposed method the results of the chosen FFLP problem, obtained by using the existing and the proposed methods, are compared.", "num_citations": "7\n", "authors": ["188"]}
{"title": "Fuzzy fault tree approach for analysing the fuzzy reliability of a gas power plant\n", "abstract": " In conventional reliability analysis, the failure probabilities of the components of a system are treated as exact values. It is often difficult to obtain data for failure probabilities under changing environmental conditions. Hence, fuzzy sets are used to analyse the fuzzy system reliability, where a fuzzy number represents the reliability of each component. In this paper, on the basis of the failure modes for the components of gas power plant, a fault tree is constructed and then an expression for probability of failure of gas power plant, in terms of minimal cut sets, is obtained using minimal cut set approach. Due to uncertainty in the collected data, all the failure probabilities are represented by trapezoidal fuzzy numbers and fuzzy reliability of gas power plant is evaluated using the obtained expression and fuzzy arithmetic. On the basis of the obtained result it is concluded that reliability result obtained from this approach is more …", "num_citations": "7\n", "authors": ["188"]}
{"title": "An Improved Algorithmfor Solving Fuzzy Maximal Flow Problems\n", "abstract": " Kumar et al.(A new approach for solving fuzzy maximal flow problems; Lecture Notes in Computer Science, Springer-Verlag; Berlin Heidelberg, 5908,(2009) 278-286) proposed a new algorithm for solving the fuzzy maximal flow problems. In the numerical example solved by Kumar et al., by using the proposed algorithm, there exist negative part in the obtained triangular fuzzy numbers which represents that the flow between two nodes may be negative. Although it is mathematically correct according to properties of ranking function. But in real life problems the negative quantity of the flow has no physical meaning. To overcome this shortcoming the algorithm, proposed by Kumar et al., is improved.", "num_citations": "7\n", "authors": ["188"]}
{"title": "New approach for electric robot fuzzy reliability analysis\n", "abstract": " In this paper, definition of LR type triangular fuzzy set is extended by LR type triangular vague set. Also T w (the weakest t-norm)-based arithmetic operations between two LR type triangular vague sets and vague success tree are introduced. Further a new approach has been developed for analyzing the fuzzy reliability of a series and parallel system using T w-based arithmetic operations on LR type triangular vague sets. For the justification of the proposed approach the fuzzy reliability of the desirable movement of an electric robot has been analyzed using the existing approaches [1, 3, 5] and the proposed approach. Comparing the results of existing approaches and the proposed approach, it has been shown that the uncertainty about the reliability is minimized using the proposed approach and the results are exact. While using the existing approaches the results are approximate due to approximate product of triangular fuzzy sets and triangular vague sets.", "num_citations": "7\n", "authors": ["188"]}
{"title": "A novel method for ranking of vague sets for handling the risk analysis of compressor system\n", "abstract": " Vague sets were first proposed by Gau and Buehrer [11] as an extension of fuzzy sets which encompass fuzzy sets, inter-valued fuzzy sets, as special cases. Vague sets consist of two parts, that is, the membership function and nonmembership function. Therefore, in accordance with practical demand these sets are more flexible than the existing fuzzy sets and provide much more information about the situation. In this paper, a new approach for the ranking of trapezoidal vague sets is introduced. Shortcomings in some existing ranking approaches have been pointed out. Validation of the proposed ranking method has been established through the reasonable properties of the fuzzy quantities. Further, the proposed ranking approach is applied to develop a new method for dealing with vague risk analysis problems to find the probability of failure, of each component of compressor system, which could be used for …", "num_citations": "6\n", "authors": ["188"]}
{"title": "Minimizing weighted lp-norm of flow-time in the rejection model\n", "abstract": " We consider the online scheduling problem to minimize the weighted ell_p-norm of flow-time of jobs. We study this problem under the rejection model introduced by Choudhury et al.(SODA 2015)-here the online algorithm is allowed to not serve an eps-fraction of the requests. We consider the restricted assignments setting where each job can go to a specified subset of machines. Our main result is an immediate dispatch non-migratory 1/eps^{O (1)}-competitive algorithm for this problem when one is allowed to reject at most eps-fraction of the total weight of jobs arriving. This is in contrast with the speed augmentation model under which no online algorithm for this problem can achieve a competitive ratio independent of p.", "num_citations": "6\n", "authors": ["188"]}
{"title": "A note on “Generalized fuzzy linear programming for decision making under uncertainty: feasibility of fuzzy solutions and solving approach”\n", "abstract": " In this short note, we point out that the paper entitled above suffers from certain mistakes.", "num_citations": "6\n", "authors": ["188"]}
{"title": "Risk analysis of combustion system using vague ranking method\n", "abstract": " A new approach for vague risk analysis based on the ranking of trapezoidal vague sets is proposed. Firstly, a new method for ranking of vague sets is presented. Then, the proposed method is applied to developed a new method for dealing with vague risk analysis problems. This analysis helps us to find out the probability of failure of each components of combustion system, which could be used for managerial decision making and future system maintenance strategy. The proposed method provides a useful way for handling vague risk analysis problems.", "num_citations": "6\n", "authors": ["188"]}
{"title": "Algorithms for Some Fuzzy Network Problems Using Ranking Function\n", "abstract": " This thesis is devoted to different type of fuzzy networks which occur in real life problems. The analysis of these networks has been done from different angles. The main topics are Fuzzy minimal spanning tree problem, Fuzzy shortest path problem and Fuzzy maximal flow problem. The chapter-wise summary of the thesis is as follows: Chapter 1 is introductory in nature. This chapter includes basic definitions, operations and concepts used throughout the work. Chapter 2 presents a brief review of the work done in the area of fuzzy minimal spanning tree problem, fuzzy shortest path problem and fuzzy maximal flow problem.In Chapter 3 the fuzzy minimal spanning tree problem in a given connected graph is considered. It is assumed that the edge costs are not precisely known and they are specified as triangular fuzzy numbers. A new algorithm has been proposed to characterize the optimality of edges of the graph and to choose a spanning tree under fuzzy costs and results are discussed based on the present study, conclusions are drawn.", "num_citations": "6\n", "authors": ["188"]}
{"title": "Sustainable energy planning decision using the intuitionistic fuzzy analytic hierarchy process: choosing energy technology in Malaysia: necessary modifications\n", "abstract": " Recently, Abdullah and Najib (International Journal of Sustainable Energy 35(4): 360–377, 2016) proposed an intuitionistic fuzzy analytic hierarchy process to deal with uncertainty in decision-making and applied it to establish preference in the sustainable energy planning decision-making of Malaysia. This work may attract the researchers of other countries to choose energy technology for their countries. However, after a deep study of the published paper (International Journal of Sustainable Energy 35(4): 362–377, 2016), it is noticed that the expression used by Abdullah and Najib in Step 6 of their proposed method for evaluating the intuitionistic fuzzy entropy of each aggregate of each row of intuitionistic fuzzy matrix is not valid. Therefore, it is not genuine to use the method proposed by Abdullah and Najib for solving real-life problems. The aim of this paper was to suggest the required necessary modifications for …", "num_citations": "5\n", "authors": ["188"]}
{"title": "Identifying and prioritizing critical instructions within processor circuitry\n", "abstract": " In one embodiment, the present invention includes a method for identifying a memory request corresponding to a load instruction as a critical transaction if an instruction pointer of the load instruction is present in a critical instruction table associated with a processor core, sending the memory request to a system agent of the processor with a critical indicator to identify the memory request as a critical transaction, and prioritizing the memory request ahead of other pending transactions responsive to the critical indicator. Other embodiments are described and claimed.", "num_citations": "5\n", "authors": ["188"]}
{"title": "A new analytical method for solving fuzzy differential equations\n", "abstract": " In the literature, several numerical methods are proposed for solvingnth-order fuzzy linear diff erential equations. However, till now there areonly two analytical methods for the same. In this paper, the fuzzy Kolmogorov'sdi fferential equations, obtained with the help of fuzzy Markov modelof piston manufacturing system, are solved by one of these analytical methodsand illustrated that the obtained solution does not represent a fuzzy number.To resolve the drawback of existing method, a new analytical method is proposedfor solving nth-order fuzzy linear di fferential equations. Furthermore,the advantage of proposed method over existing method is also discussed.", "num_citations": "5\n", "authors": ["188"]}
{"title": "Application of non-normal p-norm trapezoidal fuzzy number in reliability evaluation of electrical substations\n", "abstract": " This paper presented a non-normal p-norm trapezoidal fuzzy number–based fault tree technique to obtain the reliability analysis for substations system. Due to uncertainty in the collected data, all the failure probabilities are represented by non-normal p-norm trapezoidal fuzzy number. In this paper, the fault tree incorporated with the non-normal p-norm trapezoidal fuzzy number and minimal cut sets approach are used for reliability assessment of substations. An example of 66/11 kV substation is given to demonstrate the method. Further, fuzzy risk analysis problems are described to find out the probability of failure of each components of the system using linguistic variables, which could be used for managerial decision making and future system maintenance strategy.", "num_citations": "5\n", "authors": ["188"]}
{"title": "A new computational method to solve fully fuzzy linear systems for negative coefficient matrix\n", "abstract": " In this paper, new computational methods for solving fully fuzzy linear systems (FFLS) when the coefficient matrix is negative are proposed. The proposed methods are very easy to understand and to apply for solving fully fuzzy linear systems occurring in real life situations. The methods are illustrated by solving numerical examples.", "num_citations": "5\n", "authors": ["188"]}
{"title": "Fuzzy optimal solution for unbalanced fully fuzzy minimal cost flow problems\n", "abstract": " To the best of our knowledge, till now there is no method in the literature to find the fuzzy optimal solution of unbalanced fully fuzzy minimal cost flow (FFMCF) problems. In this paper, a new method is proposed to find the fuzzy optimal solution of these problems. The proposed method is illustrated with the help of a numerical example. Also, the proposed method is used to find the fuzzy optimal solution of an unbalanced real life FFMCF problem.", "num_citations": "5\n", "authors": ["188"]}
{"title": "Sensitivity analysis for fuzzy linear programming problems based on interval-valued fuzzy numbers\n", "abstract": " In the literature, it is pointed that in several situations it is better to use interval-valued fuzzy numbers instead of triangular or trapezoidal fuzzy numbers. But to the best of our knowledge, till now there is method that deals with the sensitivity analysis of such linear programming problems in which some or all the parameters are represented by interval-valued fuzzy numbers. In this paper, a new method is proposed for the same. To illustrate the proposed method an interval-valued fuzzy sensitivity analysis problem which can’t be solved by any of the existing methods is solved by using the proposed method.", "num_citations": "5\n", "authors": ["188"]}
{"title": "Sensitivity analysis for fuzzy linear programming problems\n", "abstract": " Kheirfam and Hasani [5] proposed a method for the sensitivity analysis for fuzzy linear programming problem with fuzzy variables. In this paper, a new method is proposed for solving same type of problems. The main advantage of proposed method over the existing method is that if the same problems are solved by both the existing as well as proposed method then the obtained results will be same, while, it is easy and less time consuming to apply the proposed method as compared to existing method. To illustrate the proposed method and to show the advantage of proposed method the numerical examples, solved by Kheirfam and Hasani, are solved by the proposed method and the obtained results are compared.", "num_citations": "5\n", "authors": ["188"]}
{"title": "Mehar’s method for analyzing the fuzzy reliability of piston manufacturing system\n", "abstract": " To the best of our knowledge till now there are only two analytical methods for finding the exact solution of fuzzy differential equations. In this paper, the shortcoming of one of these existing methods is pointed out. To overcome the shortcoming of the existing method, a new method, named as Mehar’s method, is proposed for solving fuzzy differential equations. To show the advantage of Mehar’s method over existing method the fuzzy Kolmogorov’s differential equations, developed by using fuzzy Markov model of piston manufacturing system, are solved by using the existing and Mehar’s method and it is shown that the results, obtained by using the existing method, may or may not be fuzzy number while the results, obtained by using Mehar’s method, are always fuzzy number.", "num_citations": "5\n", "authors": ["188"]}
{"title": "Generalization of trapezoidal vague set and its use for analyzing the fuzzy system reliability\n", "abstract": " In this paper, definition of trapezoidal vague set (A. Kumar et al.) is generalized and by considering several cases it is shown that definitions of triangular vague set (S.M. Chen, 1997), trapezoidal vague set (A. Kumar et al.), triangular fuzzy number (G.J. Klir and B. Yuan, 1995), (H-J. Zimmermann, 1996) and trapezoidal fuzzy number (G.J. Klir and B. Yuan, 1995), (H-J. Zimmermann, 1996) are the particular cases of the definition of trapezoidal vague set introduced in this paper. Also arithmetic operations between two trapezoidal vague sets are introduced. Further new methods are developed for analyzing the fuzzy reliability of series and parallel systems. The developed methods are applied to analyze the fuzzy reliability of a radar warning receiver.", "num_citations": "5\n", "authors": ["188"]}
{"title": "On Configuring BGP route reflectors\n", "abstract": " The Border Gateway Protocol (BGP) is the standard protocol for exchanging routing information between border routers of Autonomous Systems (ASes) in today's Internet. Within an AS, border routers exchange externally-learned BGP route advertisements via Internal-BGP (I-BGP) peerings. Naive solutions for these I-BGP peering sessions (e.g., based on full-mesh topologies) simply cannot scale to the sizes of modern AS networks. Carefully designed route-reflector configurations can drastically reduce the total number and connection cost of the required I-BGP sessions. Nevertheless, no principled algorithmic approaches exist for designing such configurations, and current practice relies on manual reflector selection using simple, ad-hoc rules. In this paper, we address the novel and challenging optimization problems involved in designing effective BGP route-reflector configurations for AS networks. More …", "num_citations": "5\n", "authors": ["188"]}
{"title": "Sampling in Space Restricted Settings\n", "abstract": " Space efficient algorithms play an important role in dealing with large amount of data. In such settings, one would like to analyze the large data using small amount of “working space”. One of the key steps in many algorithms for analyzing large data is to maintain a (or a small number) random sample from the data points. In this paper, we consider two space restricted settings—(i) the streaming model, where data arrives over time and one can use only a small amount of storage, and (ii) the query model, where we can structure the data in low space and answer sampling queries. In this paper, we prove the following results in the above two settings:                                        In the streaming setting, we would like to maintain a random sample from the elements seen so far. We prove that one can maintain a random sample using  random bits and  bits of space, where n is the number of elements seen so far. We can …", "num_citations": "4\n", "authors": ["188"]}
{"title": "Performance evaluation of outsourcing decision using a BSC and fuzzy AHP approach: A case of the Indian coal mining organization by M., Modak, K., Pathak, KK, Ghosh [Resour …\n", "abstract": " Modak et al. (Resour. Policy 52 (2017) 181–191) proposed an effective performance evaluation framework based on the balanced scorecard (BSC) and fuzzy analytic hierarchy process (FAHP) to measure the performance of the Indian coal mining organization on account of an outsourcing decision. In this approach, firstly a fuzzy pairwise comparison matrix is transformed into a crisp matrix and then the existing crisp analytic hierarchy process (AHP) approach is applied on the transformed crisp matrix. It is well-known fact that the crisp AHP approach can be applied only on the crisp pairwise comparison matrix. While, the crisp matrix, transformed by Modak et al. approach, is not a pairwise comparison matrix. Therefore, it is mathematically incorrect to use the approach, proposed by Modak et al., in its present form. It is pertinent to mention that Modak et al. approach will be valid only if the transformed crisp matrix is …", "num_citations": "4\n", "authors": ["188"]}
{"title": "A note on “A new fuzzy regression model based on absolute deviation”\n", "abstract": " Li et al. (2016) proposed a least absolute deviation method to find such fuzzy regression models whose all the parameters are trapezoidal fuzzy numbers. Since, the method, proposed by Li et al., is published in Engineering Applications of Artificial Intelligence (a very reputed International Journal) as well as it is easy to apply Li et al. method in real life problems. So, other researchers may be attracted to apply the method, proposed by Li et al., to find the solution of real life problems. However, after a deep study of the work done by Li et al., it is noticed that the multiplication of two trapezoidal fuzzy numbers, proposed by Li et al. as well as used in this method, is not valid. Hence, the aim of this note is to make the researchers aware about the valid multiplication of trapezoidal fuzzy numbers that should be used in Li et al. method.", "num_citations": "4\n", "authors": ["188"]}
{"title": "The Heterogeneous Capacitated k-Center Problem\n", "abstract": " In this paper we initiate the study of the heterogeneous capacitated k         -center problem: we are given a metric space , and a collection of capacities. The goal is to open each capacity at a unique facility location in F, and also to assign clients to facilities so that the number of clients assigned to any facility is at most the capacity installed; the objective is then to minimize the maximum distance between a client and its assigned facility. If all the capacities ’s are identical, the problem becomes the well-studied uniform capacitated k         -center problem for which constant-factor approximations are known [7, 22]. The additional choice of determining which capacity should be installed in which location makes our problem considerably different from this problem and the non-uniform generalizations studied thus far in literature. In fact, one of our contributions is in relating the heterogeneous problem to special-cases …", "num_citations": "4\n", "authors": ["188"]}
{"title": "A note on “A fuzzy approach to transport optimization problem”\n", "abstract": " Sudhagar and Ganesan (Optim Eng, 2012, doi:                   10.1007/s11081-012-9202-6                                    ) proposed an approach to find the fuzzy optimal solution of such fuzzy transportation problems in which all the parameters are represented by fuzzy numbers. In this note, it is pointed out that the authors have used some mathematical incorrect assumptions in their proposed method.", "num_citations": "4\n", "authors": ["188"]}
{"title": "A Note on “A Lexicographic Method for Matrix Games with Payoffs of Triangular Intuitionistic Fuzzy Numbers”\n", "abstract": " Nan et al. [J.-X. Nan, D.-F. Li and M.-J. Zhang, A lexicographic method for matrix games with payoffs of triangular intuitionistic fuzzy numbers, International Journal of Computational Intelligence Systems 3(3) (2010) 280-289] pointed out that there is no method in the literature to find the solution of such matrix games in which payoffs are represented by triangular intuitionistic fuzzy numbers and proposed a method for the same. In this paper, it is pointed out that Nan et al. have used some mathematical incorrect assumptions in their proposed method and the existing method is also modified.", "num_citations": "4\n", "authors": ["188"]}
{"title": "A Novel Approach to the Solution of Matrix Games with Payoffs Expressed by Trapezoidal Intuitionistic Fuzzy Numbers\n", "abstract": " We propose a novel approach to the solution of fuzzy matrix games with payoffs given as trapezoidal intuitionistic fuzzy numbers. We extend Li’s [36, Chapter 9] work based on a cut-set based method for finding an optimal solution to overcome the fact that the assumptions and properties assumed therein do not guarantee in general, first, the very existence of an optimal solution, and second, its attainment via a mathematical programming formulation proposed. We first briefly mention those problems in Li’s [36] approach, and then propose a new, corrected and general method, called the Mehar mehod, based on a modified mathematical pro- gramming formulation of a matrix game with payoffs represented by trapezoid intuitionistic fuzzy numbers. For illustration, we solve Li’s [36] example, and compare his and our results.", "num_citations": "4\n", "authors": ["188"]}
{"title": "Modified difference-index based ranking bilinear programming approach to solving bimatrix games with payoffs of trapezoidal intuitionistic fuzzy numbers\n", "abstract": " Li and Yang [DF Li and J. Yang, A difference-index based ranking bilinear programming approach to solving bimatrix games with payoffs of trapezoidal intuitionistic fuzzy numbers, Journal of Applied Mathematics 2013 (2013), 1–10] pointed out that there is no method in the literature for solving such bimatrix games in which payoffs are represented by intuitionistic fuzzy numbers and proposed a method for the same. In this paper, it is pointed out that Li and Yang have considered some mathematical incorrect assumptions in their proposed method. For resolving the shortcomings of Li and Yang’s method, a new method (named as Mehar method) is proposed. Also, the exact optimal solution of the numerical problem, solved by Li and Yang by their proposed method, is obtained by the proposed Mehar method.", "num_citations": "4\n", "authors": ["188"]}
{"title": "A new method for solving single and multi-objective fuzzy minimum cost flow problems with different membership functions\n", "abstract": " Several authors have proposed different methods for solving fuzzy minimum cost flow (MCF) problems. In this paper, some single and multi-objective fuzzy MCF problems are chosen which cannot be solved by using any of the existing methods and a new method is proposed for solving such type of problems. The main advantage of the proposed method over existing methods is that the fuzzy MCF problems which can be solved by using the existing methods can also be solved by the proposed method. But, there exist several fuzzy MCF problems which can be solved only by using the proposed method i.e., it is not possible to solve these problems by using the existing methods. To illustrate the proposed method and also to show the advantages of the proposed method over existing methods some single and multi-objective fuzzy MCF problems which cannot be solved by using the existing methods are …", "num_citations": "4\n", "authors": ["188"]}
{"title": "Some New Computational Methods To Solve Dual Fully Fuzzy Linear System Of Arbitrary Triangular Fuzzy Numbers\n", "abstract": " In this paper, we discuss two new computational techniques for solving a generalized fully fuzzy linear system (FFLS) with arbitrary triangular fuzzy numbers (m,α,β). The methods eliminate the non-negative restriction on the fuzzy coefficient matrix that has been considered by almost every method in the literature and relies on the decomposition of the dual FFLS into a crisp linear system that can be further solved by a variety of classical methods. To illustrate the proposed methods, numerical examples are solved and the obtained results are discussed. The methods pose several advantages over the existing methods to solve a simple or dual FFLS.", "num_citations": "4\n", "authors": ["188"]}
{"title": "Linear programming approach to find the solution of fully fuzzy linear systems with arbitrary fuzzy coefficients\n", "abstract": " In this paper limitations of an existing method (M. Otadi and M. Mosleh, Solving fully fuzzy matrix equations, Applied Mathematical Modelling 2012) are pointed out and to overcome these limitations a new method is proposed. To illustrate the proposed method numerical examples are solved and the obtained results are discussed.", "num_citations": "4\n", "authors": ["188"]}
{"title": "Strict sensitivity analysis for fuzzy linear programming problem\n", "abstract": " The fuzzy set theory is being applied massively in many fields these days. One of these is linear programming problems. Upto best of our knowledge, in literature, sensitivity analysis for FVLP (Fuzzy Variable Linear Programming) problem has never been treated using ranking function. In this paper the sensitivity analysis for FVLP problems is studied using ranking function. Purpose is to introduce a simpler and convenient way to tackle the sensitivity analysis for FVLP problems. At the end it is shown that if in a FVLP problem both ‘cost’and ‘decision variables’ are fuzzy numbers, then accuracy upto only rank can be obtained.", "num_citations": "4\n", "authors": ["188"]}
{"title": "Fuzzy optimal solution of fully fuzzy project crashing problems with new representation of LR flat fuzzy numbers\n", "abstract": " In this paper, a new method, named as Mehar’s method, is proposed for solving fully fuzzy project crashing problems and a new representation of LR flat fuzzy numbers, named as JMD representation of LR flat fuzzy numbers, are introduced. Also, it is shown that it is better to use JMD representation of LR flat fuzzy numbers as compared to the existing representation of LR flat fuzzy numbers.", "num_citations": "4\n", "authors": ["188"]}
{"title": "Fuzzy optimal solution of fuzzy transportation problems with transshipments\n", "abstract": " In this paper a new method, named as Mehar’s method, is proposed for solving fuzzy transportation problems with transshipments. Also, it is shown that it is better to use Mehar’s method as compared to the existing method.", "num_citations": "4\n", "authors": ["188"]}
{"title": "On the optimality of a class of LP-based algorithms\n", "abstract": " In this paper we will be concerned with a class of packing and covering problems which includes Vertex Cover and Independent Set. Typically, one can write an LP relaxation and then round the solution. In this paper, we explain why the simple LP-based rounding algorithm for the \\\\VC problem is optimal assuming the UGC. Complementing Raghavendra's result, our result generalizes to a class of strict, covering/packing type CSPs.", "num_citations": "4\n", "authors": ["188"]}
{"title": "On a bidirected relaxation for the MULTIWAY CUT problem\n", "abstract": " Abstract In the M ULTIWAY C UT problem, we are given an undirected edge-weighted graph G=(V, E) with c e denoting the cost (weight) of edge e. We are also given a subset S of V, of size k, called the terminals. The objective is to find a minimum cost set of edges whose removal ensures that the terminals are disconnected. In this paper, we study a bidirected linear programming relaxation of M ULTIWAY C UT. We resolve an open problem posed by Vazirani [Approximation Algorithms, first ed., Springer, Berlin, Heidelberg, 2001], and show that the integrality gap of this relaxation is not better than that for a geometric linear programming relaxation given by Caˇlinescu et al.[J. Comput. System Sci. 60 (3)(2000) 564–574], and may be strictly worse on some instances.", "num_citations": "4\n", "authors": ["188"]}
{"title": "Where’s the winner? Max-finding and sorting with metric costs\n", "abstract": " Traditionally, a fundamental assumption in evaluating the performance of algorithms for sorting and selection has been that comparing any two elements costs one unit (of time, work, etc.); the goal of an algorithm is to minimize the total cost incurred. However, a body of recent work has attempted to find ways to weaken this assumption – in particular, new algorithms have been given for these basic problems of searching, sorting and selection, when comparisons between different pairs of elements have different associated costs.               In this paper, we further these investigations, and address the questions of max-finding and sorting when the comparison costs form a metric; i.e., the comparison costs c                                            uv                  respect the triangle inequality c                                            uv                  + c                                            vw                  ≥ c                                            uw                  for all input elements …", "num_citations": "4\n", "authors": ["188"]}
{"title": "Rejecting jobs to minimize load and maximum flow-time\n", "abstract": " The notion of competitive ratio often turns out to be too pessimistic for the analysis of online algorithms. Although the approach of resource augmentation (introduced by Kalyanasundaram and Pruhs) has been very successful in dealing with a variety of objective functions, there are problems for which even a (arbitrary) constant speedup cannot lead to a constant competitive algorithm. Here we propose a rejection model which permits the online algorithm to not serve epsilon-fraction of requests. We present O (log 2⁡ 1/ε) and O (1/ε 4)-competitive algorithms for the problems of load balancing and minimizing maximum flow time in the restricted assignment setting.", "num_citations": "3\n", "authors": ["188"]}
{"title": "A New Fuzzy CCR Data Envelopment Analysis Model and Its Application to Manufacturing Enterprises\n", "abstract": " Wang et al. (Expert Syst Appl 36:5205–5211, 2009, [26]) pointed out that in the literature the solution of a fuzzy CCR data envelopment analysis (DEA) model which is a fuzzy fractional programming problem, is obtained by transforming it into a fuzzy linear programming problem. While, due to the property , where  is a fuzzy number, the fuzzy CCR DEA model cannot be transformed into a fuzzy linear programming problem. To resolve this flaw of the existing methods, Wang et al. proposed two new methods to solve the fuzzy CCR DEA model without transforming it into a fuzzy linear programming problem. In this chapter, flaws in the methods, proposed by Wang et al. as well as flaws in the fuzzy CCR DEA model, proposed by Wang et al., are pointed out. To resolve these flaws, a new fuzzy CCR DEA model as well as a new method to solve fuzzy CCR DEA model are proposed. To illustrate the …", "num_citations": "3\n", "authors": ["188"]}
{"title": "A note on “approximate solution of dual fuzzy matrix equations”\n", "abstract": " Gong et al. (Information Sciences 266 (2014) 112–133) proposed a method of solving dual fuzzy matrix equations. The aim of this note is to make the researchers aware that the method proposed by Gong et al. is valid only for certain specific types of dual fuzzy matrix equations. It must be noted however, that proposing a method for finding a solution of these equations, considered by Gong et al., is still an open challenging research problem.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Commentary on “On solving a multiobjective fixed charge problem with imprecise fractional objectives”\n", "abstract": " Upmanyu and Saxena (Applied Soft Computing 40 (2016) 64–69) proposed a method for solving a multiobjective fixed charge problem having multiple fractional objective functions which are all of a fuzzy nature. The aim of this note is to aware the researchers that the method, proposed by Upmanyu and Saxena, is not valid and hence, to propose a method for solving this type of fixed charge problem is still an open challenging research problem.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Commentary on “Calculating fuzzy inverse matrix using fuzzy linear equation system”\n", "abstract": " Basaran [Calculating fuzzy inverse matrix using fuzzy linear equation system, Applied Soft Computing, 12 (2012), 1810–1813] proposed a method for finding the inverse of a fuzzy matrix by assuming all the elements of the fuzzy inverse matrix as non-negative fuzzy numbers, while some of the elements of fuzzy matrix inverse may also be negative fuzzy numbers. Keeping the same in mind, Mosleh and Otadi [A discussion on “Calculating fuzzy inverse matrix using fuzzy linear equation system”, Applied Soft Computing, 28 (2015), 511–513] assumed (i, j) element x˜ ij=(x ij, α ij, β ij) of the fuzzy inverse matrix as a non-negative fuzzy number if the value of x ij obtained by Basaran's approach, is a non-negative real number and a negative fuzzy number if the value of x ij is negative real number. In this paper, it is shown that the fuzzy multiplicative inverse of a fuzzy matrix, obtained by considering this assumption, is also …", "num_citations": "3\n", "authors": ["188"]}
{"title": "A Note on the Paper “Duality Theory for Optimization Problems with Interval-Valued Objective Functions”\n", "abstract": " With this note, we want to open a discussion on the duality theory for Interval Optimization. We begin by showing that some duality results Wu ( J Optim Theory Appl 144:615–628, 2010) are useless.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Unique Fuzzy Optimal Value of Fully Fuzzy Linear Programming Problems with Equality Constraints Having LR Flat Fuzzy Numbers\n", "abstract": " In this chapter, it is shown that the fuzzy optimal value, obtained by using the method, presented in Chap.                  4                                , is not necessarily a unique fuzzy number. So, it does not conform to the uniqueness property of fuzzy optimal value.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Fuzzy Optimal Solution of Fully Fuzzy Linear Programming Problems with Equality Constrains\n", "abstract": " In this chapter, the limitations of the method, presented in Chap.                  2                                , are pointed out and to overcome these limitations, Kaur and Kumar’s method [1] is presented for solving fully fuzzy linear programming problems with equality constraints. To show the application of Kaur and Kumar’s method [1] a real life problem, which cannot be solved by using the method, presented in Chap.                  2                                , is solved by using the Kaur and Kumar’s method [1].", "num_citations": "3\n", "authors": ["188"]}
{"title": "Application of the weakest t-norm (T ω) based vague lambda-tau methodology for reliability analysis of gas turbine system\n", "abstract": " In general, the vague lambda-tau methodology based on interval arithmetic operation is used to analyze the reliability of repairable system. The reliability analysis of complex systems based on the interval arithmetic operations are not effectively assessed under the vague environment. Therefore, in order to overcome the above mentioned limitation, this research adopts the weakest t-norm based arithmetic operations over vague lambda-tau methodology. The proposed arithmetic operations provide control on fuzzy spread during complicated calculation of complex system under the vague environment and also it effectively preserve the original shape of a membership function. An example of gas turbine system is given to demonstrate the methods described in this paper.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Efficient on-line algorithm for maintaining k-cover of sparse bit-strings\n", "abstract": " We consider the on-line problem of representing a sparse bit string by a set of k intervals, where k is much smaller than the length of the string. The goal is to minimize the total length of these intervals under the condition that each 1-bit must be in one of these intervals. We give an efficient greedy algorithm which takes time O (log k) per update (an update involves converting a 0-bit to a 1-bit), which is independent of the size of the entire string. We prove that this greedy algorithm is 2-competitive. We use a natural linear programming relaxation for this problem, and analyze the algorithm by finding a dual feasible solution whose value matches the cost of the greedy algorithm.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Contact center scheduling with strict resource requirements\n", "abstract": " Consider the following problem which often arises in contact center scheduling scenarios. We are given a set of employees where each employee can be deployed for shifts consisting of L consecutive time units. Further, each employee specifies a set of possible start times, and can be deployed for a bounded number of shifts only. At each point of time t, we are also given a lower bound r                                       t                on the number of employees that should be present at this time. The goal is to find a schedule for the employees such that the number of time slots whose requirements are met is maximized. Such problems naturally arise in many other situations, e.g., sensor networks and cloud computing.             The strict nature of the resource requirement makes this problem very hard to approximate. In this paper, we give a bicriteria approximation algorithm for this problem. Given a parameter ε > 0, we give an O …", "num_citations": "3\n", "authors": ["188"]}
{"title": "Two Phase Method for Solving Fuzzy Linear Programming Problems using Ranking of Generalized Fuzzy Numbers\n", "abstract": " Ranking of fuzzy numbers play an important role in decision making problems. Fuzzy numbers must be ranked before an action is taken by a decision maker. Chen (Operations on fuzzy numbers with function principal, Tamkang Journal of Management Science 6 (1985) 13-25) pointed out that in many cases it is not to possible to restrict the membership function to the normal form and proposed the concept of generalized fuzzy numbers. In this paper two phase method is proposed for solving a special type of fuzzy linear programming (FLP) problems using generalized fuzzy numbers. To illustrate the proposed method a numerical example is solved and the advantages of the proposed method are discussed. Since the proposed method is a direct extension of classical method so it is very easy to understand and apply the proposed method to find the fuzzy optimal solution of FLP problems occurring in the real life situations.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Similarity Measure of Different Types of Fuzzy Sets\n", "abstract": " In today’s highly competitive world, all the people compare the things with each other. Similarity measure is the concept which helps us to know how much two things are similar. For this we, firstly calculate the degree of similarity. Higher is the degree of similarity between two things, they are more similar to each other. In this thesis, similarity measure between different types of fuzzy numbers is calculated. The chapter-wise summary of the thesis is as follows:  Chapter 1 is introductory in nature. This chapter includes basics, and concepts used throughout the work.  Chapter 2 presents brief review of the work done in the area of fuzzy similarity measure problem.  In Chapter 3 we studied the similarity measure between generalized fuzzy numbers. To illustrate the presented method a numerical example is solved and also some properties of similarity measure of generalized fuzzy numbers are proved.  In Chapter 4 Similarity measure between interval-valued fuzzy sets is studied. The presented method is illustrated by solving a numerical example and some properties are proved.  Chapter 5 In this chapter similarity measure between intuitionistic fuzzy sets has been studied. Also in this chapter we give the shortcomings of some already proposed methods and to overcome those shortcomings other methods are presented. The presented method is illustrated by solving a numerical example and some properties are proved.", "num_citations": "3\n", "authors": ["188"]}
{"title": "Nochi: Network-on-chip with hybrid interconnect\n", "abstract": " As processor core counts increase, networks-on-chip (NoCs) are becoming an increasingly popular interconnection fabric due to their ability to supply high bandwidth. However, NoCs need to deliver this high bandwidth at low latencies, while keeping within a tight power envelope. In this paper, we present a novel NoC with hybrid interconnect that leverages multiple types of interconnects-&# 150; specically, conventional full-swing short-range wires for the datapath, in conjunction with low-swing, multi-drop wires with long range, ultra-low-latency communication for the flow control signals. We show how this proposed system can be used to overcome key limitations of express virtual channels (EVC), a recently proposed flow control technique that allows packets to bypass intermediate routers to simultaneously improve energy-delay-throughput. Our preliminary results show up to a 8.8&# x0025; reduction in power …", "num_citations": "3\n", "authors": ["188"]}
{"title": "Transportation Problems in Intuitionistic Fuzzy Environment\n", "abstract": " In the last few years, several methods have been proposed for solving different types of intuitionistic fuzzy transportation problems. In this thesis, limitations and flaws of these existing methods are pointed out. Also, to resolve the flaws as well as to overcome the limitations of the existing method, new methods are proposed. The thesis comprises seven chapters. A brief outline of the chapters is as follows: Chapter 1 Introduction Chapter 1 is introductory in nature. In this chapter, a need of intuitionistic fuzzy transportation problem as well as different types of intuitionistic fuzzy transportation problems are discussed. Furthermore, the existing methods [131,132] for solving intuitionistic fuzzy transportation problems are presented in a detailed manner. Chapter 2 A simplified method for solving intuitionistic fuzzy transportation problems of type – I In this chapter, an alternative method for solving intuitionistic fuzzy transportation problems of type – I is proposed. Also, the advantages of proposed method over the existing methods [9,46,48,64-66,118,132] are discussed. Furthermore, to illustrate the proposed method, the numerical examples, considered by Singh and Yadav [132], are solved by the proposed method. Chapter 3 A simplified method for solving intuitionistic fuzzy transportation problems of type – II In this chapter, an alternative method for solving intuitionistic fuzzy transportation prob- lems of type – II is proposed. Also, the advantages of proposed method over the existing methods [1,3,119,131], are discussed. Furthermore, to illustrate the proposed method, the numerical examples, considered by Singh and Yadav [131], are solved by the proposed …", "num_citations": "2\n", "authors": ["188"]}
{"title": "Mehar’s methods for fuzzy assignment problems with restrictions\n", "abstract": " In this paper, limitations of existing methods [5, 11] for solving fuzzy assignment problems (FAPs) are pointed out. In order to overcome the limitations of existing methods, two new methods named Mehar's methods are proposed. To show the advantages of Mehar's methods over existing methods, some FAPs are solved. The Mehar's methods can solve the problems solved by existing methods as well as those which cannot be solved by existing methods.", "num_citations": "2\n", "authors": ["188"]}
{"title": "Method for solving linear programming problems with fuzzy parameters\n", "abstract": " In this thesis, the shortcomings and limitations of some existing methods for solving linear programming problems with fuzzy parameters are pointed out and new methods are proposed to overcome the shortcomings and limitations of existing methods.", "num_citations": "2\n", "authors": ["188"]}
{"title": "Linear Programming Problems with Generalized Fuzzy Sets\n", "abstract": " In this thesis, the limitations and shortcomings of existing methods for solving linear programming problems with fuzzy sets are pointed out. To overcome the limitations and shortcomings of existing methods, some new ranking approaches are proposed for comparing generalized fuzzy sets and vague sets. On the basis of proposed ranking approaches, some new methods are proposed to  nd the appropriate solution of such linear programming problems with generalized fuzzy sets and vague sets in which only the parameters cost (or pro t) are represented by fuzzy sets or vague sets. The chapter wise summary of the thesis is as follows: In Chapter 1, a brief review of the work done in the area of linear programming problems with fuzzy sets is presented. In Chapter 2, it is shown that the existing method for solving linear programming problems with fuzzy sets can be used only for solving such linear programming problems in which either the parameters are represented by normal fuzzy sets or generalized fuzzy sets having equal height. Although, the limitations of the existing method can be removed by replacing an appropriate ranking approach instead of already used existing ranking approach for comparing fuzzy sets but there are some shortcomings in all the existing ranking approaches so none of the existing ranking iii iv approach can be used to overcome the limitations of existing method. To overcome the limitations of existing method, a new ranking approach is proposed for comparing generalized trapezoidal fuzzy sets and on the basis of proposed ranking approach a new method is proposed for solving linear programming problems with …", "num_citations": "2\n", "authors": ["188"]}
{"title": "WALCOM: Algorithms and Computation: 5th International Workshop, WALCOM 2011, New Delhi, India, February 18-20, 2011, Proceedings\n", "abstract": " This book constitutes the proceedings of the 5th International Workshop on Algorithms and Computation, WALCOM 2011, held in New Delhi, India, in February 2011. The 20 papers presented in this volume were carefully reviewed and selected from 57 submissions. The papers are grouped in topical sections on approximation algorithms, hardness, algorithm engineering, computational geometry, string algorithms, and graph algorithms.", "num_citations": "2\n", "authors": ["188"]}
{"title": "Some Methods for Analyzing the Fuzzy Critical Path for a Project Network\n", "abstract": " In today's highly competitive business environment, project management's ability to schedule activities and monitor progress within strict cost, time and performance guidelines is becoming increasingly important to obtain competitive priorities such as on-time delivery and customization. When the activity times in the project are deterministic and known, critical path method (CPM) has been demonstrated to be a useful tool in managing projects in an efficient manner to meet this challenge. However, in practical situations this requirement is usually hard to fulfill, since many of the activities will be executed for the first time. So when project activity times cannot be specified with certainty due to the lack of duration information or poor definitions of the activity, then to deal with such real life situations, Zadeh (1965) introduced the concept of fuzzy set. Since there is always uncertainty about the time duration of activities in the network planning, so fuzzy critical path method (FCPM) was proposed since the late 1970s. This thesis is devoted to critical path analysis under fuzzy environment. The chapter-wise summary of the thesis is as follows: Chapter 1 is introductory in nature. This chapter includes basic concepts used throughout the work. Chapter 2 presents brief review of the work done in the area of finding the critical path under fuzzy environment. In Chapter 3, a method based on the ranking value of a fuzzy number is presented to perform critical path analysis in a fuzzy environment. The trapezoidal fuzzy numbers, given by decision makers or characterized by historical data, are utilized to assess the activity times in a project network. To illustrate the …", "num_citations": "2\n", "authors": ["188"]}
{"title": "The priority k-median problem\n", "abstract": " In this paper, we consider a generalized version of the k-median problem in metric spaces, called the priority k-median problem in which demands and facilities have priorities associated with them and a demand can only be assigned to a facility that has the same priority or better. We show that there exists a polynomial time constant factor approximation algorithm for this problem when there are two priorities. We also show that the natural integer program for the problem has an arbitrarily large integrality gap when there are four or more priorities.", "num_citations": "2\n", "authors": ["188"]}
{"title": "Approximating Airports and Railways\n", "abstract": " In this paper we consider the airport and railway problem (AR), which combines capacitated facility location with network design, both in the general metric and the two-dimensional Euclidean space. An instance of the airport and railway problem consists of a set of points in the corresponding metric, together with a non-negative weight for each point, and a parameter k. The points represent cities, the weights denote costs of opening an airport in the corresponding city, and the parameter k is a maximum capacity of an airport. The goal is to construct a minimum cost network of airports and railways connecting all the cities, where railways correspond to edges connecting pairs of points, and the cost of a railway is equal to the distance between the corresponding points. The network is partitioned into components, where each component contains an open airport, and spans at most k cities. For the Euclidean case, any points in the plane can be used as Steiner vertices of the network. We obtain the first bicriteria approximation algorithm for AR for the general metric case, which yields a 4-approximate solution with a resource augmentation of the airport capacity k by a factor of 2. More generally, for any parameter 0< p<= 1 where pk is an integer we develop a (4/3)(2+ 1/p)-approximation algorithm for metric AR with a resource augmentation by a factor of 1+ p. Furthermore, we obtain the first constant factor approximation algorithm that does not resort to resource augmentation for AR in the Euclidean plane. Additionally, for the Euclidean setting we provide a quasi-polynomial time approximation scheme for the same problem with a resource augmentation …", "num_citations": "1\n", "authors": ["188"]}
{"title": "SpectraMap: Efficiently Constructing a Spatio-temporal RF Spectrum Occupancy Map\n", "abstract": " The RF spectrum is typically monitored from a single, or few, vantage points. A larger spatio-temporal view of spectrum occupancy, such as over a few weeks on a city-wide scale, would be beneficial for several applications, for example, spectrum inventory by regulators or spectrum monitoring by wireless carriers. However, achieving such a view requires a dense deployment of spectrum analyzers, both in space and time, which is prohibitively expensive.                 In this paper, we present a novel efficient approach to obtain an accurate extrapolated spatio-temporal view of spectrum occupancy. Our method uses RSSI measurements alone and does not require a-priori information of terrain, transmitter location, transmit power or path-loss model. We present our method as an algorithmic framework, called SpectraMap, which through targeted deployment of both static and mobile spectrum analyzers, gives a …", "num_citations": "1\n", "authors": ["188"]}
{"title": "Express virtual channels in an on-chip interconnection network\n", "abstract": " A method, router node, and set of instructions for using express virtual channels in a component network on a chip are disclosed. An input link 302 may receive an express flow control unit from a source node 102 in a packet-switched network via an express virtual channel 110. An output link 306 may send the express flow control unit to a sink node 106. A switch allocator 322 may forward the express flow control unit directly to the output link 306.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Fuzzy Optimal Solution of Fully Fuzzy Linear Programming Problems with Inequality Constraints Having LR Flat Fuzzy Numbers\n", "abstract": " In this chapter, limitations of the existing methods for solving fuzzy linear programming problems and fully fuzzy linear programming problems with inequality constraints are pointed out.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Future Scope\n", "abstract": " The method presented in Chap.                  6                                 can be used to find the unique fuzzy optimal value of fully fuzzy linear programming problems with equality constraints. However, this method cannot be used to find the unique fuzzy optimal value of fully fuzzy linear programming problems with inequality constraints. In future, it may be tried to develop a method for the same.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Sampling in space restricted settings\n", "abstract": " Space efficient algorithms play a central role in dealing with large amount of data. In such settings, one would like to analyse the large data using small amount of “working space”. One of the key steps in many algorithms for analysing large data is to maintain a (or a small number) random sample from the data points. In this paper, we consider two space restricted settings – (i) streaming model, where data arrives over time and one can use only a small amount of storage, and (ii) query model, where we can structure the data in low space and answer sampling queries. In this paper, we prove the following results in above two settings:                                            In the streaming setting, we would like to maintain a random sample from the elements seen so far. We prove that one can maintain a random sample using  random bits and  space, where n is the number of elements seen so far. We can extend this to the …", "num_citations": "1\n", "authors": ["188"]}
{"title": "A Constraint Analysis based Communication Model to Optimize VANET Architecture\n", "abstract": " Security is always the critical challenge for any open area network. VANET is also such type of network in which the criticalities includes because of sensor specific restriction and communication limitations. In this work, the optimized communication is provided by combining the V2V and V2I communication. The proposed model has with inclusive authentication based and preventive approach. The work has provided the generation of safe path under probabilistic analysis. The analysis is here performed on communication adaptive parameters. The simulation result shows that the work has improved the network communication and network throughput.", "num_citations": "1\n", "authors": ["188"]}
{"title": "SOME LINEAR PROGRAMMING TECHNIQUES IN FUZZY ENVIRONMENT\n", "abstract": " In this thesis, shortcomings and limitations of the existing methods for solving as well as the existing methods to deal with the sensitivity analysis of such linear programming problems in which parameters or decision variables or both are represented by fuzzy numbers are pointed out. Also, some new methods are proposed to resolve these shortcomings as well as to overcome these limitations.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Some algorithms for solving scheduling problems in fuzzy environment using CPM\n", "abstract": " In this thesis, the shortcomings and limitations of the existing methods for fi nding the optimal fuzzy project completion time as well as for fi nding minimum fuzzy crashing cost corresponding to specifi c fuzzy project completion time are pointed out. Also, new methods are proposed to overcome the limitations as well as to resolve the shortcomings of the existing methods.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Study on fuzzy shortest path problems\n", "abstract": " In 1st chapter-literature review In 2nd chapter-Nayeem and Pal[19] proposed a new algorithm for solving shortest path problem on a network with imprecise edge weight.Kumar and kaur[8] pointed out the shortcoming of the existing algorithm[19] and proposed a new algorithm to overcome these shortcoming.in this chapter,the existing method[8] is presented. In 3rd chapter-Kumar and Kaur[7] pointed out the shortcoming of the existing algorithm[15]  proposed a new algorithm to overcome these shortcoming. in this chapter,the existing method[7] is presented.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Efficient algorithms for solving some fuzzy network flow problems\n", "abstract": " In this thesis, shortcomings and limitations of existing methods for solving fuzzy maximum flow problems (maximum flow problems in which each arc capacity is represented by a fuzzy number) as well as the shortcomings and the limitations of the existing methods for solving fully fuzzy capacitated minimum cost flow problems (capacitated minimum cost flow problems in which all the parameters as well as the decision variables are represented by fuzzy numbers) are pointed out. To overcome the limitations of the existing methods as well as to resolve the shortcomings of the existing methods, new methods are proposed for solving fuzzy maximum flow problems, fully fuzzy single objective capacitated minimum cost flow problems, fully fuzzy multi-objective capacitated minimum cost flow problems, fully fuzzy multi-objective capacitated solid minimum cost flow problems and intuitionistic fully fuzzy single and multi-objective capacitated solid minimum cost flow problems.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Vague reliability analysis using vague differential equations\n", "abstract": " In this paper, the concept of fuzzy differential equations (FDEs) is extended by vague differential equations (VDEs) and a new method to find the analytical solution of VDEs with new representation of trapezoidal vague set (TrVS), named as JMD TrVS, is proposed. To show the application of proposed method in real life problems the vague Kolmogorov's differential equations (VKDEs), obtained by using Markov model of piston manufacturing system (PMS), are solved by proposed method and with the help of obtained solution vague reliability of PMS is evaluated.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Some algorithms for solving transportation problems in fuzzy environment\n", "abstract": " In this thesis, the shortcomings and limitations of some existing methods for solving fully fuzzy transportation problems, fully fuzzy transshipment problems and fully fuzzy solid transportation problems are pointed out and new methods are proposed to overcome the shortcomings and limitations of existing methods.", "num_citations": "1\n", "authors": ["188"]}
{"title": "A modified ranking approach for solving fuzzy critical path problems with LR flat fuzzy numbers\n", "abstract": " There are several fuzzy critical path methods for solving fuzzy critical path problems in which ranking approaches are used for comparing fuzzy numbers. In this paper, it is shown that if the existing ranking approaches are used for solving such fuzzy critical path problems in which duration times of activities are represented by LR flat fuzzy numbers, then more than one fuzzy numbers, representing the fuzzy project completion time, are obtained and a new ranking approach for comparing LR flat fuzzy numbers is proposed. Also, it is proved that if the proposed ranking approach is used for solving fuzzy critical path problems then a unique fuzzy number, representing the fuzzy project completion time, is obtained.", "num_citations": "1\n", "authors": ["188"]}
{"title": "Enhanced Distributed Hash Tables for Complex Queries\n", "abstract": " Peer-to-peer file sharing systems have become a very popular way of sharing large number of files over a distributed environment. One of the principal ingredients of such systems is a lookup service which maps a key denoting a file to a location storing the file. Dynamic hash tables (DHT's) were recently proposed as a means of supporting such a lookup service in a completely distributed manner. They have many desirable properties, but suffer from one serious drawback-in order to locate a file, we must have a precise knowledge of the key representing it. In this paper, we propose a lookup service which supports complex queries and has all the advantages of DHT's. We also compare our proposed method with PIER , another recently proposed peer-to-peer system for answering complex queries. Our experiments show that our method results in better utilization of the network than PIER", "num_citations": "1\n", "authors": ["188"]}