{"title": "Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia\n", "abstract": " Traditional activities change in surprising ways when computer-mediated communication becomes a component of the activity system. In this descriptive study, we leverage two perspectives on social activity to understand the experiences of individuals who became active collaborators in Wikipedia, a prolific, cooperatively-authored online encyclopedia. Legitimate peripheral participation provides a lens for understanding participation in a community as an adaptable process that evolves over time. We use ideas from activity theory as a framework to describe our results. Finally, we describe how activity on the Wikipedia stands in striking contrast to traditional publishing and suggests a new paradigm for collaborative systems.", "num_citations": "1033\n", "authors": ["1195"]}
{"title": "Gender swapping on the Internet\n", "abstract": " On the television show Saturday Night Live, a series of skits concerned a character named Pat, who has no apparent gender. The audience is tempted with the promise of clues. In one episode, Pat gets his or her hair cut. A sign in the salon says that men's haircuts are $7, and women's haircuts are $9. The audience waits in suspense: when Pat goes to pay, his or her true gender will be revealed. The humor of the series lies in the fact that those hopes are constantly foiled; in this instance, Pat leaves $10 and says to keep the change.", "num_citations": "564\n", "authors": ["1195"]}
{"title": "Studying the amateur artist: A perspective on disguising data collected in human subjects research on the Internet\n", "abstract": " In the mid-1990s, the Internet rapidly changedfrom a venue used by a small number ofscientists to a popular phenomena affecting allaspects of life in industrialized nations. Scholars from diverse disciplines have taken aninterest in trying to understand the Internetand Internet users. However, as a variety ofresearchers have noted, guidelines for ethicalresearch on human subjects written before theInternet's growth can be difficult to extend toresearch on Internet users.In this paper, I focus on one ethicalissue: whether and to what extent to disguisematerial collected online in publishedaccounts. While some people argue thatvulnerable human subjects must always be madeanonymous in publications for their ownprotection, others argue that Internet usersdeserve credit for their creative andintellectual work. Still others argue thatmuch material available online should betreated as ``published.'' To attempt to …", "num_citations": "395\n", "authors": ["1195"]}
{"title": "MOOSE crossing: Construction, community and learning in a networked virtual world for kids\n", "abstract": " In research about the Internet, too much attention is paid to its ability to provide access to information. This thesis argues that the Internet can be used not just as a conduit for information, but as a context for learning through community-supported collaborative construction. A\" constructionist\" approach to use of the Internet makes particularly good use of its educational potential. The Internet provides opportunities to move beyond the creation of constructionist tools and activities to the creation of\" constructionist cultures.\" These issues are explored through a specific example: MOOSE Crossing, a text-based virtual world (or\" MUD\") designed to be a constructionist learning environment for children ages 8 to 13. On MOOSE Crossing, children have constructed a virtual world together, making new places, objects, and creatures. Kids have made baby penguins that respond differently to five kinds of food, fortune tellers who predict the future, and the place at the end of the rainbowanswer a riddle, and you get the pot of gold.", "num_citations": "364\n", "authors": ["1195"]}
{"title": "Community support for constructionist learning\n", "abstract": " MOOSE Crossing is a text-based virtual reality environment (or “MUD”) designed to be a constructionist learning environment for children ages eight to thirteen. The constructionist philosophy of education argues that learning through designing and constructing personally meaningful projects is better than learning by being told. Children on MOOSE Crossing learn computer programming and improve their reading and writing by working on self-selected projects in a self-motivated, peer-supported fashion. In experience with over 180 children and 90 adults using the system since October 1995, we have found that the community provides essential support for the children's learning experiences. The community provides role models; situated, ubiquitous project models; emotional support to overcome technophobia; technical support; and an appreciative audience for completed work. This paper examines the …", "num_citations": "350\n", "authors": ["1195"]}
{"title": "The MediaMOO project: Constructionism and professional community\n", "abstract": " Once or twice a year we stand with name badges on, sipping coffee in a corridor, exchange ideas over expense-accounted lunches, and maybe attend a few talks. Friendships are made and projects hatched. Then it is back home to file for expenses, perhaps write a trip report, and get back to\" real work\" and relative isolation.ABSTRACT", "num_citations": "346\n", "authors": ["1195"]}
{"title": "Decentralization in Wikipedia governance\n", "abstract": " How does \"self-governance\" happen in Wikipedia? Through in-depth interviews with 20 individuals who have held a variety of responsibilities in the English-language Wikipedia, we obtained rich descriptions of how various forces produce and regulate social structures on the site. Although Wikipedia is sometimes portrayed as lacking oversight, our analysis describes Wikipedia as an organization with highly refined policies, norms, and a technological architecture that supports organizational ideals of consensus building and discussion. We describe how governance on the site is becoming increasingly decentralized as the community grows and how this is predicted by theories of commons-based governance developed in offline contexts. We also briefly examine local governance structures called WikiProjects through the example of WikiProject Military History, one of the oldest and most prolific projects on the site.", "num_citations": "329\n", "authors": ["1195"]}
{"title": "Pianos not stereos: Creating computational construction kits\n", "abstract": " MIT Media Laboratory 20 Ames Street Cambridge, MA 02139 http://el. www. media. mit. edu/groups/el/5 o, too, with computers. Educational technology has too heavily emphasized the equivalent of stereos and CDs and not emphasized computational pianos enough. In our research group at the MIT Media Lab, we are developing a new generation of\" computational construction kits\" that, like pianos, enable people to express themselves in increasingly ever-more complex ways, deepening their relationships with new domains of knowledge. To guide the development of these computational construction kits, we are developing a theory of constructional design. Whereas the traditional field of instructional design focuses on strategies and materials to help teachers instruct, our theory of constructional design focuses on strategies and materials to help students construct and learn. Constructional design is a type of …", "num_citations": "297\n", "authors": ["1195"]}
{"title": "From Wikipedia to the classroom: Exploring online publication and learning\n", "abstract": " Wikipedia represents an intriguing new publishing paradigm--can it be used to engage students in authentic collaborative writing activities? How can we design wiki publishing tools and curricula to support learning among student authors? We suggest that wiki publishing environments can create learning opportunities that address four dimensions of authenticity: personal, real world, disciplinary, and assessment. We have begun a series of design studies to investigate links between wiki publishing experiences and writing-to-learn. The results of an initial study in an undergraduate government course indicate that perceived audience plays an important role in helping students monitor the quality of writing; however, students' perception of audience on the Internet is not straightforward. This preliminary iteration resulted in several guidelines that are shaping efforts to design and implement new wiki publishing tools and curricula for students and teachers.", "num_citations": "288\n", "authors": ["1195"]}
{"title": "“Go away”: participant objections to being studied and the ethics of chatroom research\n", "abstract": " In this article we present an empirical study aimed at better understanding the potential for harm when conducting research in chatrooms. For this study, we entered IRC chatrooms on the ICQ network and posted one of three messages to tell participants that we were recording them: a recording message, an opt-in message, or an opt-out message. In the fourth condition, we entered the chatroom but did not post a message. We recorded and analyzed how subjects responded to being studied. Results of a regression analysis indicate significantly more hostility in the three conditions where we said something than in the control condition. We were kicked out of 63.3% of the chatrooms we entered in the three message conditions compared with 29% of the chatrooms in the control condition. There were no significant differences between any of these three conditions. Notably, when given a chance to opt in, only 4 of 766 …", "num_citations": "285\n", "authors": ["1195"]}
{"title": "Human-computer interaction for kids\n", "abstract": " As people develop from infants to adults, their physical and cognitive abilities increase over time (Kail 1991; Miller and Vernon 1997; Thomas 1980). The Swiss psychologist Jean Piaget was a leading figure in analyzing how children’s cognition evolves (Piaget 1970, pp. 29–33). Piaget showed that children do not just lack knowledge and experience, but also fundamentally experience and understand the world differently than adults. He divided children’s development into a series of stages, as follows:", "num_citations": "235\n", "authors": ["1195"]}
{"title": "Why do people write for Wikipedia? Incentives to contribute to open–content publishing\n", "abstract": " When people learn that we have spoken to individuals who spend up to 30 hours a week volunteering their time to research and write for an open-content encyclopedia, we often hear the same question:“Why do they do it?“The fact that this encyclopedia does not provide bylines to credit authors for their hard work makes the scenario still less fathomable. Two rounds of interviews with 22 volunteer encyclopedia writers in the fall of 2004 and spring of 2005 revealed that, in some respects, the incentive system that motivates contributions to the opencontent encyclopedia Wikipedia resembles that of the scientific community. Like scientists, contributors to Wikipedia seek to collaboratively identify and publish true facts about the world. Research on the sociology of science provides a useful touchstone for considering the incentive systems embedded in the technology and culture of online communities of collaborative authorship. In this paper we describe some of our findings in the context of Latour and Woolgar’s seminal work on the incentive systems that motivate publishing scientists. We suggest that minimizing reliance on “hard coded,“stratified user privileges and providing indicators of engagement in desirable activities can help support the growth of incentive economies in online communities.", "num_citations": "221\n", "authors": ["1195"]}
{"title": "Domestic violence and information communication technologies\n", "abstract": " Physical violence against women is pervasive through out the world and domestic violence has been a longstanding issue in feminist activism and research. Yet, these experiences are often not represented in technological research or design. In the move to consider HCI at the margins, in this paper, we ask: how have ICTs affected the experiences of domestic violence survivors? We interviewed female survivors living in a domestic violence shelter about their experiences with technology. Participants reported that they were harassed with mobile phones, experienced additional harassment (but also support) via social networking sites, and tried to resist using their knowledge of security and privacy.", "num_citations": "220\n", "authors": ["1195"]}
{"title": "Hollaback! The role of storytelling online in a social movement organization\n", "abstract": " CSCW systems are playing an increasing role in activism. How can new communications technologies support social movements? The possibilities are intriguing, but as yet not fully understood. One key technique traditionally leveraged by social movements is storytelling. In this paper, we examine the use of collective storytelling online in the context of a social movement organization called Hollaback, an organization working to stop street harassment. Can sharing a story of experienced harassment really make a difference to an individual or a community? Using Emancipatory Action Research and qualitative methods, we interviewed people who contributed stories of harassment online. We found that sharing stories shifted participants' cognitive and emotional orientation towards their experience. The theory of\" framing\" from social movement research explains the surprising power of this experience for Hollaback …", "num_citations": "212\n", "authors": ["1195"]}
{"title": "Can educational be fun\n", "abstract": " Most attempts at making software both educational and fun end up being neither. Fun is often treated like a sugar coating to be added to an educational core. Which makes about as much sense as chocolate-dipped broccoli. The problem is that too many game designers are using long-outmoded models of what it means to be\" educational.\" This paper reviews some useful ideas from contemporary educational theory, providing concrete advice for making games both fun and educational.Beyond Sugar Coating When I'm not doing research on how to design better educational software, l review it for Wired. Companies are always sending me things to review–the stuff piles up in my office. Most of the time, l don't even open the packages. lt all pretty much the same old junk: drill and practice.", "num_citations": "207\n", "authors": ["1195"]}
{"title": "Scaling consensus: Increasing decentralization in Wikipedia governance\n", "abstract": " How does \"self-governance\" happen in Wikipedia? Through in-depth interviews with eleven individuals who have held a variety of responsibilities in the English Wikipedia, we obtained rich descriptions of how various forces produce and regulate social structures on the site. Our analysis describes Wikipedia as an organization with highly refined policies, norms, and a technological architecture that supports organizational ideals of consensus building and discussion. We describe how governance in the site is becoming increasingly decentralized as the community grows and how this is predicted by theories of commons-based governance developed in offline contexts. The trend of decentralization is noticeable with respect to both content-related decision making processes and social structures that regulate user behavior.", "num_citations": "202\n", "authors": ["1195"]}
{"title": "Social and technical challenges in parenting teens' social media use\n", "abstract": " With millions of teenagers on the Internet, millions of parents are trying to understand what their teens are doing and why. Understanding how technology use impacts teens' learning, growth, and social development is critical for their health and wellbeing and for the welfare of the family. Yet, balancing parent authority with teen privacy and autonomy is difficult. We conducted an interview study with 16 parents to examine challenges in\" technoparenting\"-parenting teens' technology use. Parents said they wanted more transparency in their teens' use of cell phones and the Internet and they struggled with their own unfamiliarity with technology. Technoparenting is a distributed problem and, surprisingly, parents wanted support and collaboration from the broader community. We conclude with design implications for a socially translucent\" digital window\".", "num_citations": "178\n", "authors": ["1195"]}
{"title": "Constructing text: Wiki as a toolkit for (collaborative?) learning\n", "abstract": " Writing a book from which others can learn is itself a powerful learning experience. Based on this proposition, we have launched Science Online, a wiki to support learning in high school science classrooms through the collaborative production of an online science resource. Our approach to designing educational uses of technology is based on an approach to education called constructionism, which advocates learning by working on personally meaningful projects. Our research examines the ways that constructionism connects to collective models of knowledge production and learning such as Knowledge Building. In this paper, we explore ways that collaboration using wiki tools fits into the constructionist approach, we examine learning goals for youth growing up in a read-write culture, and we discuss preliminary findings in an ongoing year-long study of Science Online in the classroom. Despite the radically …", "num_citations": "167\n", "authors": ["1195"]}
{"title": "What is computing? Bridging the gap between teenagers' perceptions and graduate students' experiences\n", "abstract": " Studies show that teenagers perceive computing to be boring, antisocial, and irrelevant to their lives. We interviewed 13 teenagers from local Atlanta schools and observed over 40 teenagers in after-school technology programs to learn more about their perceptions of computing. We then interviewed 22 graduate students in the Human-Centered Computing and Human-Computer Interaction programs at Georgia Tech in order to learn about the factors that motivated them to pursue degrees in computing. We found that teenagers perceived computing to be boring, solitary, and lacking real-world context, yet graduate students described their research as exciting, social, and having a direct and meaningful impact on the world around them. Our results suggest that there is an opportunity to increase interest in computing among teenagers by bridging the gap between their perceptions of computing and the actual …", "num_citations": "161\n", "authors": ["1195"]}
{"title": "Ethical guidelines for research online\n", "abstract": " 1. You may freely quote and analyze online information without consent if: o It is officially, publicly archived. o No password is required for archive access. o No site policy prohibits it. o The topic is not highly sensitive. 2. For everything else not covered by 1, you typically need consent. 3. The process of requesting consent must not disrupt normal group activity. o Note that in real-time chatrooms:", "num_citations": "158\n", "authors": ["1195"]}
{"title": "IRC Francais: The creation of an Internet-based SLA community\n", "abstract": " Research into text-based chat environments for foreign language learning has shown that discussions online have a significantly different character from those in the classroom. In this paper, we begin with a brief design history of one of these environments: IRC Français. Our experience both illustrates the challenges involved in moving these chat environments from the language lab to the Internet and offers insight into some of the causes of these changes in conversation. The initial challenges we encountered ranged from ethical difficulties in doing research in Internet-based chat environments to bootstrapping a synchronous community. After exploring these challenges, we present a study taking a closer look at the interactions online and in the classroom over the course of a semester. During this semester, classroom interaction was largely teacher-oriented, despite the best efforts of the teachers involved. Even …", "num_citations": "154\n", "authors": ["1195"]}
{"title": "The bystander effect: A lens for understanding patterns of participation\n", "abstract": " A number of studies have shown that students are often more willing to participate in educational conversations online than in the classroom. However, other studies have shown that online environments have poor student participation Why is this the case? What causes participation to vary from one environment to another? To explore these phenomena, we borrow a concept from social psychology, the bystander effect, which explains why individuals are less likely to help in an emergency if others are present. Although the bystander effect specifically applies to helping behavior in emergency situations, we use this construct as a lens through which to view nonemergency situations such as educational environments. The bystander effect has 4 key components: self-awareness, social cues, blocking mechanisms, and diffuse responsibility. Focusing on these mechanisms can help us more fully characterize …", "num_citations": "145\n", "authors": ["1195"]}
{"title": "The future of e-learning communities\n", "abstract": " The learning potential of Internet technology can come from the most familiar sources---peers and elders.", "num_citations": "145\n", "authors": ["1195"]}
{"title": "Income, race, and class: exploring socioeconomic differences in family technology use\n", "abstract": " Minorities are the fastest growing demographic in the US and the poverty level in the US is the highest it has been in 50 years. We interviewed middle to upper class, suburban, white American parents and low-income, urban, African-American parents to understand how each group incorporates technology into their lives. Participants had teens in their homes and devices like computers and cell phones played a powerful and preeminent role in family life. Our results show that socioeconomic differences both reflect and reinforce technology use at home. Specifically, low socioeconomic status families share devices more often and low socioeconomic status teens have more responsibility and independence in their technology use. We argue that that as low socioeconomic status families become the majority demographic, the CHI community needs to better understand how to design for these groups.", "num_citations": "125\n", "authors": ["1195"]}
{"title": "The Turing Game: Exploring identity in an online environment\n", "abstract": " Do men and women behave differently online? Can you tell how old someone is, or                 determine their race or national origin based on how they communicate on the                 internet? Issues of personal identity affect how we relate to others in everyday                 life, both online and offline. However, identity in this new medium is still poorly                 understood by internet users.", "num_citations": "124\n", "authors": ["1195"]}
{"title": "Learning in online communities\n", "abstract": " [I] t is fanciful (but nonetheless exciting) to contemplate advantages of having communal structures that span the whole of the school years and that also profitably engage those in research institutes and other knowledge-creation enterprises. The fancifulness is not with the technology–recent developments make that by far the easy part. The problems to be solved are educational.(Scardamalia & Bereiter; 1994, р. 276)", "num_citations": "116\n", "authors": ["1195"]}
{"title": "No magic bullet: 3D video games in education\n", "abstract": " AquaMOOSE 3D is a graphical environment designed to support the exploration of 3D mathematical concepts. One of the underlying motivations for the AquaMOOSE project is to leverage the entertainment value of video games to provide a learning environment that engages students in more meaningful ways than are typically seen in the classroom. In this quasiexperimental comparison class study at a suburban high school, we compared the AquaMOOSE intervention to instruction using the traditional curriculum. Our results were disappointing, and call into question our underlying assumptions. In this paper, we will describe factors that contributed and discuss broader implications. Student expectations for the software were high due to the production values seen in commercial video games. In addition, the 3D aspect of the AquaMOOSE software introduced usability concerns and increased content complexity. We also encountered many classic problems of research in the classroom that affected the outcome of the study.", "num_citations": "115\n", "authors": ["1195"]}
{"title": "An archive of their own: a case study of feminist HCI and values in design\n", "abstract": " Rarely are computing systems developed entirely by members of the communities they serve, particularly when that community is underrepresented in computing. Archive of Our Own (AO3), a fan fiction archive with nearly 750,000 users and over 2 million individual works, was designed and coded primarily by women to meet the needs of the online fandom community. Their design decisions were informed by existing values and norms around issues such as accessibility, inclusivity, and identity. We conducted interviews with 28 users and developers, and with this data we detail the history and design of AO3 using the framework of feminist HCI and focusing on the successful incorporation of values into design. We conclude with considering examples of complexity in values in design work: the use of design to mitigate tensions in values and to influence value formation or change.", "num_citations": "114\n", "authors": ["1195"]}
{"title": "\" Georgia computes!\" improving the computing education pipeline\n", "abstract": " Computing education suffers from low enrollment and a lack of diversity. Both of these problems require changes across the entire computing education pipeline. The \"Georgia Computes!\" alliance, funded by the National Science Foundation's Broadening Participation in Computing program, seeks to improve the computing education pipeline in Georgia. \"Georgia Computes!\" is having a measurable effect at each stage of the pipeline, but has not yet shown an impact across the whole pipeline.", "num_citations": "103\n", "authors": ["1195"]}
{"title": "Why it works (when it works) success factors in online creative collaboration\n", "abstract": " Online creative collaboration (peer production) has enabled the creation of Wikipedia and open source software (OSS), and is rapidly expanding to encompass new domains, such as video, music, and animation. But what are the underlying principles allowing online creative collaboration to succeed, and how well do they transfer from one domain to another? In this paper, we address these questions by comparing and contrasting online, collaborative animated movies, called collabs, with OSS projects. First, we use qualitative methods to solicit potential success factors from collab participants. Then, we test these predictions by quantitatively analyzing a data set of nearly 900 collabs. Finally, we compare and contrast our results with the literature on OSS development and propose broader theoretical implications. Our findings offer a starting point for a systematic research agenda seeking to unlock the potential of …", "num_citations": "100\n", "authors": ["1195"]}
{"title": "Situated support for learning: Storm's weekend with Rachael\n", "abstract": " Although much attention has been paid to the content of support for learning, less attention has been given to its context. This article introduces the notion of \"situated support,\" and argues that the identity of the source of support and the connectedness of that support to other elements of the learning environment are of primary importance. MOOSE Crossing is a text-based virtual reality environment designed to be a constructionist learning environment for children 8 to 13 years of age. A microanalysis is presented of the situated nature of support for learning on MOOSE Crossing over the course of 1 weekend where a 12-year-old girl learned to write simple computer programs.", "num_citations": "99\n", "authors": ["1195"]}
{"title": "Finding one's own space in cyberspace\n", "abstract": " The week the last Internet porn scandal broke, my phone didn't stop ringing: \"Are women comfortable on the Net?\" \"Should women use gender-neutral names on the Net?\" \"Are women harassed on the Net?\" Reporters called from all over the country with basically the same question. I told them all: your question is ill-formed. \"The Net\" is not one thing. It's like asking: \"Are women comfortable in bars?\" That's a silly question. Which woman? Which bar? The summer I was 18, I was the computer counselor at a summer camp. After the campers were asleep, the counselors were allowed out, and would go bar hopping. First everyone would go to Maria's, an Italian restaurant with red-and-white-checked table cloths. Maria welcomed everyone from behind the bar, greeting regular customers by name. She always brought us free garlic bread. Next we'd go to the Sandpiper, a disco with good dance music. The Sandpiper seemed excitingly adult--it was a little scary at first, but then I loved it. Next, we went to the Sportsman, a leather motorcycle bar that I found absolutely terrifying. Huge, bearded men bulging out of their leather vests and pants leered at me. I hid in the corner and tried not to make eye contact with anyone, hoping my friends would get tired soon and give me a ride back to camp.", "num_citations": "98\n", "authors": ["1195"]}
{"title": "Virtual professional community: Results from the MediaMOO Project\n", "abstract": " MediaMOO is a text-based, networked, virtual reality environment designed to enhance professional community among media researchers. This paper analyzes experience with the system to date and highlights the value of Constructionist principles to virtual reality design.", "num_citations": "94\n", "authors": ["1195"]}
{"title": "Teaching students to study online communities ethically\n", "abstract": " How can we teach students to study online communities in an ethical fash-ion? This paper reviews experiences from five offerings of a graduate-level, Georgia fhstitute of Technology class “Computer Science 6470: Design of. Grline Communities” from 1998 through 2005. Our current approach includes one IRB protocol for the entire class, with a notation in the consent form that the researchers are students just learning to conduct this kind of research. Most subjects use a web-based consent form (requiring a waiver of documentation of consent), but children and vulnerable groups use a paper consent form. Degree of disguising of published accounts is dependent on the sensitivity of the information. One thorny issue concerns the use of direct quotes. If a direct quote from a public online site is used in a published account of research, a search engine may reveal the original posting, compromising the confidentiality …", "num_citations": "88\n", "authors": ["1195"]}
{"title": "Leadership in online creative collaboration\n", "abstract": " Leadership plays a central role in the success of many forms of online creative collaboration, yet little is known about the challenges leaders must manage. In this paper, we report on a qualitative study of leadership in three online communities whose members collaborate over the Internet to create computer-animated movies called\" collabs.\" Our results indicate that most collabs fail. Collab leaders face two major challenges. First, leaders must design collabora-tive projects. Second, leaders must manage artists during the collab production process. We contrast these challenges with the available empirical research on leadership in open-source software and Wikipedia, identifying four themes: originality, completion, subjectivity, and ownership. We conclude with broader implications for online creative col-laboration in its many forms.", "num_citations": "86\n", "authors": ["1195"]}
{"title": "Co-evolution of technological design and pedagogy in an online learning community\n", "abstract": " The design of any piece of technology intended for human use-whether for entertainment, work, or education-is ideally iterative and user-centered. Designers cannot anticipate all the needs of users, but most begin with a prototype and revise it based on user feedback. This is even more true of online learning communities, where designers must understand the needs not just of individual users, but of groups of users and their complex inter-relationships as facilitated by the technology. Designers begin with theory, create a prototype, test, and then revise. However, it is not just the technology that can be revised, but also the underlying theory. Technological design and pedagogy have the potential to co-evolve in this new medium. In this chapter, I will describe in detail one example of this co-evolution: a new perspective on motivation in constructionist learning environments, which evolved through quantitative and qualitative observations of an online learning community called MOOSE Crossing. These observations1 I use the word community here in the loosest possible sense: a group of people interacting in some fashion over an extended period of time. I concur with Kling et al.(this volume) that the value of “online community” is often over-hyped. One solution to this problem is, as Kling proposes, to be vigilant to only apply the word community to groups that meet appropriate criteria. A second solution is to choose to use the word community in a looser, non-value-laden way, separating the issue of value from the issue of word choice. I prefer", "num_citations": "85\n", "authors": ["1195"]}
{"title": "MOOSE goes to school: A comparison of three classrooms using a CSCL environment\n", "abstract": " MOOSE Crossing is a text-based virtual reality environment (or “MUD”) designed to give children eight to thirteen years old a meaningful context for learning reading, writing, and computer programming. It is used from home, in after-school programs, and increasingly as an in-school activity. To date, it has been used in five classrooms. This paper compares its use in three of those classrooms, and analyzes factors that made use of MOOSE Crossing more and less successful in each of these contexts. Issues highlighted include access to computers, existence of peer experts, free-form versus structured activity, and school atmosphere.", "num_citations": "81\n", "authors": ["1195"]}
{"title": "Designing palaver tree online: supporting social roles in a community of oral history\n", "abstract": " As a more diverse population of users moves online, understanding how to help those groups work together and leverage their diverse skills poses a significant challenge for human-computer interaction. This paper presents a case study of the design of an online community that supports kids interviewing elders to build up a shared database of oral history. Two pilot studies with existing technology are presented, and a software design based on those studies is described, along with future work. This work shows the value of prototyping with existing technology in order to uncover user needs in an onine environment.", "num_citations": "77\n", "authors": ["1195"]}
{"title": "Programming for Fun: MUDs as a Context for Collaborative Learning.\n", "abstract": " ABSTRACT Multi-User Dungeons (MUDs), are text-based virtual reality environments in which participants separated by great physical distances can communicate and collaborate in programming. Most MUDs started out as adventure games but are quickly being adapted for more\" serious\" endeavors. This paper presents a case study of the experiences of a MUD participant, who, in interviews with the author, explains that MUDs foster creative and technical collaboration, playfulness, the availability of an audience for completed work, and the desire to contribute to the electronic learning community. The author concludes that the success of the MUD as a learning tool for adults points to its potential as a learning environment for children.(BEW)", "num_citations": "75\n", "authors": ["1195"]}
{"title": "Qualitative data collection technologies: A comparison of instant messaging, email, and phone\n", "abstract": " With the growing body of qualitative research on HCI and social computing, it is natural that researchers may choose to conduct that research in a mediated fashion-over telephone or computer networks. In this paper we compare three different qualitative data collection technologies: phone, instant message (IM), and email. We use quantitative analysis techniques to examine the differences between the methods specifically concerning word count and qualitative codes. We find that there are differences between the methods, and that each technology has affordances that impact the data. Although phone interviews contain four times as many words on average as email and IM, we were surprised to discover that there is no significant difference in number of unique qualitative codes expressed between phone and IM.", "num_citations": "74\n", "authors": ["1195"]}
{"title": "Photo-based authentication using social networks\n", "abstract": " We present Lineup, a system that uses the social network graph in Facebook and auxiliary information (eg,\" tagged\" user photos) to build a photo-based Web site authentication framework. Lineup's underlying mechanism leverages the concept of CAPTCHAs, programs that are designed to distinguish bots from human users. Lineup extends this functionality to help a Web site ascertain a user's identity or membership in a certain group (eg, an interest group, invitees to a certain event) in order to infer some level of trust. Lineup works by presenting a user with photographs and asking the user to identify subjects in the photo whom a user with the appropriate identity or group membership should know. We present the design and implementation for Lineup, describe a preliminary prototype implementation, and discuss Lineup's security properties, including possible guarantees and threats.", "num_citations": "73\n", "authors": ["1195"]}
{"title": "Writing, citing, and participatory media: wikis as learning environments in the high school classroom\n", "abstract": " The idea of collaboration inspires people; it is, after all, a poetic concept: together, many prosper jointly where the individual may falter alone. Computer-supported forms of collaboration have long inspired researchers and educators, but in the past several years popular interest in online collaboration has bloomed with the proliferation of social software. In particular, wiki software has become a well-known and increasingly well-used tool for collaboration.“Edit this page” is the ubiquitous invitation to collaborate that defines wiki software. Wikis were conceived in the mid-1990s as a tool for fast collaborative authoring (Leuf and Cunningham 2001) and have given rise to countless collaborations since then, including Wikipedia, which, for many, has come to represent an ideal example of collaboration online. Still, no one has to collaborate on a wiki. Researchers have observed that when norms within an organization …", "num_citations": "72\n", "authors": ["1195"]}
{"title": "Reality and perception of copyright terms of service for online content creation\n", "abstract": " From amateur creativity to social media status updates, nearly every Internet user is also a content creator-but who owns that content? Policy, including intellectual property rights, is a necessary but often invisible part of online content sharing and social computing environments. We analyzed the copyright licenses contained in the Terms of Service of 30 different websites where users contribute content, then conducted a survey to match perceptions of copyright terms to the reality. We found that licensing terms vary in unpredictable ways, and that user expectations and opinions differ by license and by type of website. Moreover, the most undesirable terms, such as right to modify, appear more frequently than users expect. We argue that users care about how their content can be used yet lack critical information. Site designers should take user needs and community norms into account in creating and explaining …", "num_citations": "62\n", "authors": ["1195"]}
{"title": "Using empirical data to reason about internet research ethics\n", "abstract": " Internet technology holds significant potential to respond to business, educational, and social needs, but this same technology poses fundamentally new challenges for research ethics. To reason about ethical questions, researchers and ethics review boards typically rely on dichotomies like “public” versus “private,” “published” vs. “unpublished,” and “anonymous” vs. “identified.” However, online, these categories are blurred, and the underlying concepts require reinterpretation. How then are we to reason about ethical dilemmas about research on the Internet? To date, most work in this area has been grounded in a combination of theoretical analysis and experience gained by people in the course of conducting Internet research. In these studies, ethical insight was a welcome byproduct of research aimed primarily at exploring other ends. However, little work has used experimental methods for the primary …", "num_citations": "62\n", "authors": ["1195"]}
{"title": "Approaches to managing deviant behavior in virtual communities\n", "abstract": " It is an unfortunate fact of life that where there are multiuser computer systems, there will be antisocial behavior. On bulletin board systems (BBS S), there are those who persist in being obscene, harassing, and libelous. In virtual worlds such as MUDS, there are problems of theft, vandalism, and virtual rape.Behavior is “deviant” if it is not in accordance with community standards. How are such standards developed? Should standards be established by system administrators and accepted as a condition of participation, or should they be developed by community members? Once a particular person’s behavior is deemed unacceptable, what steps should be taken? Should such steps be taken by individuals, such as “filters” or “kill” files on BBSS, and “gagging” or “ignoring” on MUDS? Or should the administrators take action, banning an individual from the system or censoring their postings? What is the appropriate …", "num_citations": "62\n", "authors": ["1195"]}
{"title": "Design of a 3D interactive math learning environment\n", "abstract": " Can 3D graphics help high-school students learn advanced mathematics? Can we create a sufficiently compelling application such that students would choose to play with advanced math concepts for fun? What usability problems does this technology pose for novice users? AquaMOOSE 3D is a desktop 3D environment designed to help students learn about the behavior of parametric equations. AquaMOOSE is based on an educational philosophy called constructionism, which advocates learning through design and construction activities [14]. Students use mathematics to design interesting graphical forms and also create mathematical challenges to share with others. In this paper, we present our iterative design process and the results from a formative evaluation with 105 high-school students in a six-week honors summer math program. We analyse their experiences through log-file analysis, a questionnaire …", "num_citations": "61\n", "authors": ["1195"]}
{"title": "The combinatorics of storytelling: Mystery train interactive\n", "abstract": " It is difficult to imagine what a non-linear story might look like. Some modernist fiction can be viewed as non-linear. In a class on James Joyce's Ulysses, one professor advised his students to approach the work non-linearly saying,“when you get tired of Stephen's arrogance, read a little of Molly or Leopold.”[2] He was telling his students to guide their reading not by the order of the page numbers but by their desires. In a non-linear work, the viewer must be guided by his/her model of what he/she would like to know. This explains why many viewers find multimedia interesting only if they were already interested in the basic subject matter.Non-linear writing is often difficult to understand; Ulysses is accessible to a limited audience. Interactive narrative need not be elitist. The designer must provide the viewer with sufficient tools for orienting himself/herself within the work. Interactive multimedia has the power to exist on multiple levels, making it accessible to a diverse audience. A successful work reveals more on successive explorations.[3]", "num_citations": "61\n", "authors": ["1195"]}
{"title": "Saving face while geeking out: Video game testing as a justification for learning computer science\n", "abstract": " Why would individuals who are capable of learning opt not to? Learning is important for stability and success. It would seem rational that students in groups that are frequently underrepresented or marginalized would be motivated to learn. However, negotiation of multiple identities and self-beliefs can impact motivations to learn. For example, young African American males frequently adopt a “cool pose” in their approach to education. They maintain that they do not care and will not try to be a part of the existing educational system. To better understand these issues, we studied African American males in the Glitch Game Testers program. High school students in the Glitch program worked as paid game testers and took workshops in computer science. More than 65% of the participants went on to study computing after high school. We found that these students persisted with education and computing because they …", "num_citations": "60\n", "authors": ["1195"]}
{"title": "African American men constructing computing identity\n", "abstract": " Many young African American males have a passion for video games, but they don't often translate that passion into learning about computing. Part of the problem is that they do not identify with computing as a social norm within their peer group. This disidentification with computing can negatively impact academic performance and limit opportunities for upward mobility. We developed a job training program called Glitch Game Testers in which young African American men are trained to'Sbreak open the black box'of their game consoles to learn about computing. Perceptions of peers' technical competency were measured before and after the summer 2010 program. Results showed that participants were more likely to view their peers as technical resources and their overall access to technical resources increased. Broader implications for motivating technology adoption in HCI are discussed.", "num_citations": "60\n", "authors": ["1195"]}
{"title": "The game ontology project: Supporting learning while contributing authentically to game studies\n", "abstract": " Learning research has argued the importance of providing authentic contexts for learning. However, traditional learning environments are often disconnected from external communities of practice. For example, students might design and carry out scientific experiments that are valuable pedagogically, but do not contribute to science itself. In this study, we used the Game Ontology Project (GOP), a wiki-enabled hierarchy of elements of gameplay used by games studies researchers, in a game design class. Students found it useful for learning. However, encouraging sustained participation was challenging because students tended to view the GOP as a static source, rather than a participatory and editable resource. Expert analysis of the student's contributions to the ontology found them to be useful and significant. We conclude with thoughts on the importance of these kinds of authentic environments in traditional learning.", "num_citations": "60\n", "authors": ["1195"]}
{"title": "Remixers' understandings of fair use online\n", "abstract": " How do online content creators make decisions about copyright law? In the course of day-to-day online activities, Internet users are forced to make subtle judgments about one of the most confusing and nuanced areas of law, copyright and fair use. In this study, we conducted semi-structured interviews with eleven content creators who participate in remix and fan creation activities online, to try to probe their legal understandings and attitudes. We found that social norms that emerge among these content creators do not always track to what the law actually says, but are often guided more by ethical concerns. Our participants showed surprisingly similar patterns of understandings and confusions, impacting technology use and interaction online.", "num_citations": "53\n", "authors": ["1195"]}
{"title": "Should we leverage natural-language knowledge? An analysis of user errors in a natural-language-style programming language\n", "abstract": " Should programming languages use natural-language-like syntax? Under what circumstances? What sorts of errors do novice programmers make? Does using a natural-language-like programming language lead to user errors? In this study, we read the entire online interactions of sixteen children who issued a total of 35,047 commands on MOOSE Crossing, an educational MUD for children, We counted and categorized the errors made. A total d 2,970 errors were observed. We define natural-language errors as those errors in which the user failed to distinguish between English and code, issuing an incorrect command that was more English-like than the correct one. A total of 314 natural-language errors were observed. In most of those errors, the child was able to correct the problem either easily (41.1% of the time) or with some effort (20.7%). Natural-language errors were divided into five categories. In order …", "num_citations": "53\n", "authors": ["1195"]}
{"title": "Redistributing leadership in online creative collaboration\n", "abstract": " In this paper, we integrate theories of distributed leadership and distributed cognition to account for the roles of people and technology in online leadership. When leadership is distributed effectively, the result can be success stories like Wikipedia and Linux. However, finding a successful distribution is challenging. In the online community Newgrounds, hundreds of collaborative animation projects called\" collabs\" are started each year, but less than 20% are completed. We suggest that many collabs fail because leaders are overburdened and lack adequate technological support. We introduce Pipeline, a collaboration tool designed to support and transform leadership, with the goal of easing the burden on leaders of online creative projects. Through a case study of a six-week, 30-artist collaboration called Holiday Flood, we show how Pipeline supported redistributed leadership. We conclude with implications for …", "num_citations": "52\n", "authors": ["1195"]}
{"title": "Novices, gamers, and scholars: Exploring the challenges of teaching about games\n", "abstract": " Teaching about games should be easy. After all, students enjoy engaging with course content and have extensive personal experience with videogames. In reality, games education is surprisingly complex. We report on the results of a study that explored the challenges faced by instructors of games studies classes. Our results indicate that learning about games can be challenging for multiple reasons. For example, prior videogame experience often interferes with students’ abilities to reason critically and analytically about games. Students also have difficulties articulating their experiences and observations. We describe some solutions that instructors are adopting to overcome these challenges. We also describe common misconceptions about the knowledge of expert players, and provide a characterization of what it means to have a naïve understanding of videogames. Finally, we draw attention to the issue that …", "num_citations": "52\n", "authors": ["1195"]}
{"title": "When life and learning do not fit: Challenges of workload and communication in introductory computer science online\n", "abstract": " We present the results of an interview study investigating student experiences in two online introductory computer science courses. Our theoretical approach is situated at the intersection of two research traditions: distance and adult education research, which tends to be sociologically oriented, and computer science education research, which has strong connections with pedagogy and psychology. The article reviews contributions from both traditions on student failure in the context of higher education, distance and online education as well as introductory computer science. Our research relies on a combination of the two perspectives, which provides useful results for the field of computer science education in general, as well as its online or distance versions. The interviewed students exhibited great diversity in both socio-demographic and educational background. We identified no profiles that predicted student …", "num_citations": "49\n", "authors": ["1195"]}
{"title": "Analysis of log file data to understand behavior and learning in an online community\n", "abstract": " How do we study the behavior of users in online communities? Researchers from a variety of disciplines have evolved a rich set of both quantitative and qualitative approaches to studying human-computer interaction (HCI) and computer-mediated communication (CMC), and these methods are useful in the study of online communities. Unique to the study of CMC and online communities is the possibility of collecting log file data. It is possible for the computer to record every command typed by users—in some cases, every keystroke. In cases where users interact only online, we can collect a comprehensive record of all of their interactions. The completeness of the record and ease of collecting it are unprecedented.             However, log file data is more often collected than analyzed. We can save everything, but what does it mean? This chapter presents two examples of the use of log file data to understand user …", "num_citations": "47\n", "authors": ["1195"]}
{"title": "From interests to values\n", "abstract": " Computer science is not that difficult but wanting to learn it is.", "num_citations": "46\n", "authors": ["1195"]}
{"title": "Understanding copyright law in online creative communities\n", "abstract": " Copyright law is increasingly relevant to everyday interactions online, from social media status updates to artists showcasing their work. This is especially true in creative spaces where rules about reuse and remix are notoriously gray. Based on a content analysis of public forum postings in eight different online communities featuring different media types (music, video, art, and writing), we found that copyright is a frequent topic of conversation and that much of this discourse stems from problems that copyright causes for creative activities. We identify the major types of problems encountered, including chilling effects that negatively impact technology use. We find that many challenges can be explained by lack of knowledge about legal or policy rules, including breakdowns in user expectations for the sites they use. We argue that lack of clarity is a pervasive usability problem that should be considered more carefully …", "num_citations": "45\n", "authors": ["1195"]}
{"title": "Growing their own: Legitimate peripheral participation for computational learning in an online fandom community\n", "abstract": " Online communities dedicated to the creation of fanworks (eg, fiction or art inspired by media such as books or television shows) often serve as communities of practice for learning communication, artistic, and technical skills. In studying one successful fan fiction archive that was designed and built entirely by (predominantly women) fans, we observed processes of legitimate peripheral participation (LPP) in which some of these fans began in peripheral roles and came to be more involved in the technical aspects of the archive over time. In addition to outlining positive outcomes, we discuss the challenges of supporting learning within this CoP, particularly with respect to the burden on experts. We discuss potential implications and solutions for the problem of expert scarcity in CoPs, and propose that LPP within fan communities can be leveraged for broadening participation in computing among women.", "num_citations": "42\n", "authors": ["1195"]}
{"title": "Glitch Game Testers: African American Men Breaking Open the Console.\n", "abstract": " Glitch Game Testers is a research project to develop a sustainable high school job program to train and employ high school students as game testers [1]. Our goal is to leverage the passion that young urban African American men have for video games into agency with technology. The first step is to encourage these young people to see the computation behind digital games and the second step is to offer a contextualized computing curriculum [2]. In this paper, we will present findings from formative work on the play practices of young African American men, introduce the Glitch Game Testers project, and report on preliminary findings from workshops. By looking at the intersection of race and gender in gaming practices, we have developed Glitch to specifically meet the cultural needs for young African American men.", "num_citations": "41\n", "authors": ["1195"]}
{"title": "Finding one’s own in cyberspace\n", "abstract": " The week the last Internet porn scandal broke, my phone did not stop ringing:\" Are women comfortable on the Net?\"\" Should women use gender-neutral names on the Net?\"\" Are women harassed on the Net?\" Reporters called from all over the country with basically the same question. I told them all: your question is ill formed.\" The Net\" is not one thing. It is like asking:\" Are women comfortable in bars?\" That's a silly question. Which woman? Which bar?The summer I was eighteen, I was the computer counselor at a summer camp. After the campers were asleep, the counselors were allowed out and would go barhopping. First everyone would go to Maria's, an Italian restaurant with red-and-white checked tablecloths. Maria welcomed everyone from behind the bar, greeting regular customers by name. She always brought us free garlic bread. Next we would go to the Sandpiper, a disco with good dance music. The Sandpiper seemed excitingly adult—it was a little scary at first, but then I loved it. Next, we went to the Sportsman, a leather motorcycle bar that I found absolutely terrifying. Huge, bearded men bulging out of their leather vests and pants leered at me. I hid in the corner and tried not to make eye contact with anyone, hoping my friends would get tired soon and give me a ride back to camp. Each of these bars was a community, and some were more comfortable for me than others. The Net is made up of hundreds of thousands of separate communities, each with its own special character. Not only is the Net a diverse place, but women are diverse as well—there were leatherclad women who loved the Sportsman, and plenty of women revel in the …", "num_citations": "41\n", "authors": ["1195"]}
{"title": "Workifying games: Successfully engaging African American gamers with computer science\n", "abstract": " We report on the implementation and evaluation of a three-year program to increase interest in studying computer science (CS) among African American male high school students. Over the course of 3 years, the Glitch Game Tester (Glitch) program employed 25 African American male high school students. These students tested pre-release digital games, full-time in the summer and part-time in the school year, with an hour of each day dedicated to learning introductory CS. Initially, only 20% of our participants expressed interest in pursing computing as a career. After Glitch, 65% have pursued some form of post-secondary computing studies. These outcomes, and the participants' enthusiasm for engaging in computing, are in sharp contrast to the crisis in African American male education and learning motivation. The research presented in this report discusses lessons learned through implementation of the Glitch …", "num_citations": "37\n", "authors": ["1195"]}
{"title": "Constructional design: creating new construction kits for kids\n", "abstract": " Constructional design | The design of children's technology ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksThe design of children's technologyConstructional design: creating new construction kits for kids chapter Constructional design: creating new construction kits for kids Share on Authors: Mitchel Resnick profile image Mitchel Resnick MIT Media Lab MIT Media Lab View Profile , Amy Bruckman profile image Amy Bruckman Georgia Institute of Technology Georgia Institute of Technology View Profile , Fred G. Martin profile image Fred Martin MIT Media Lab MIT Media Lab View Profile Authors Info & Affiliations Publication: The …", "num_citations": "37\n", "authors": ["1195"]}
{"title": "El Paquete Semanal: The Week's Internet in Havana\n", "abstract": " We contribute a case study of El Paquete Semanal or\" The Weekly Package\"--the pervasive, offline internet in Cuba. We conducted a qualitative inquiry of El Paquete through extensive fieldwork---interviews and observations---in Havana, Cuba. Our findings highlight the human infrastructure that supports this offline internet, rendered visible through the lens of articulation work. By offering an in-depth perspective into these workings of El Paquete, we aim to challenge established notions of what an (or the) internet\" should\" look like in more and less\" developed\" contexts. We highlight how El Paquete is a non-standardized and non-neutral internet, but still human-centered. We also offer an enriched understanding of how an entirely offline internet can provide expansive information access to support leisure and livelihood, additionally serving as a locally relevant platform that affords local participation.", "num_citations": "36\n", "authors": ["1195"]}
{"title": "When should we use real names in published accounts of internet research\n", "abstract": " “John” is one of the most established members of Newgrounds, an online community of artists, programmers, and musicians with over 5 million registered members as of January 2015.1 In February 2004, John organized an event called a “time trial challenge” in which animators collaborated over the Internet to complete short movies in less than three days. The event was a huge success. Over the next 12 months, John led 12 more challenges, each more popular than the last, with the finale attracting nearly half a million views—at a time when YouTube was only a few weeks old. More importantly, John had started a phenomenon: the community animation project, or “collab.” Rarely seen before the time trial challenges, collabs were now crowding out all other discussions on the Newgrounds forums, with nearly a hundred new collabs begun in August 2006 alone. In 2007, the community celebrated “John Day” with more than 25 tribute animations created in his honor. By 2010, John had led or participated in nearly 50 collabs watched by tens of millions of viewers. That same year, Newgrounds hired him as a full-time community manager and animator.John’s real name is Luis Castañon. Considering his creative accomplishments, we argue that anonymizing him in our research accounts of his work would be unethical. In studying the Internet today, the popular conception of “human subjects research” is fundamentally outdated. Our basic assumptions need to be rethought for an age where we are studying people who deserve credit for their work, and who are entitled to respond to our representations of them.", "num_citations": "35\n", "authors": ["1195"]}
{"title": "Race and gender in play practices: young African American males\n", "abstract": " In this paper we present a study with young African American men, to gain a better understanding of the impacts of cultural and gender identity on play practices and to explore the relationship between cultural play practices and interest in computing. Our findings indicate that while young African American men play video games frequently, their objectives in playing may be unlike those who enter computer scientist fields. From this we discuss implications of this study on designing CS learning interventions that leverage video games to introduce young people to computation.", "num_citations": "35\n", "authors": ["1195"]}
{"title": "Research ethics and HCI\n", "abstract": " The expansion of human–computer interaction (HCI) to every aspect of human activity creates new challenges to the core ethical mandates of doing no harm, maintaining respect for people who participate in our studies, and weighing the costs and benefits of research, making sure that they are distributed fairly over the population. Online research adds further complications. This chapter reviews the ethical challenges and helps researchers prepare their cases for the Institutional Review Board (IRB) approval.", "num_citations": "34\n", "authors": ["1195"]}
{"title": "Situated anonymity: Impacts of anonymity, ephemerality, and hyper-locality on social media\n", "abstract": " Anonymity, ephemerality, and hyper-locality are an uncommon set of features in the design of online communities. However, these features were key to Yik Yak's initial success and popularity. In an interview-based study, we found that these three features deeply affected the identity of the community as a whole, the patterns of use, and the ways users committed to this community. We conducted interviews with 18 Yik Yak users on an urban American university campus and found that these three focal design features contributed to casual commitment, transitory use, and emergent community identity. We describe situated anonymity, which is the result of anonymity, ephemerality, and hyper-locality coexisting as focal design features of an online community. This work extends our understanding of use and identity-versus-bond based commitment, which has implications for the design and study of other atypical online …", "num_citations": "33\n", "authors": ["1195"]}
{"title": "Questioning video games' influence on CS interest\n", "abstract": " In this paper, we examine the relationship between digital games and interest in computer science. When we undertook this research, our goal was to expand upon past work that explores video games as a positive influence on students' interest in CS. We utilized both quantitative and qualitative research methods with a large technically and academically competent subject pool. We hypothesized that subjects with more years and intensity of playing video games would have a stronger interest in computer science. While we did find a small relationship, the proportion of the total responses accounted for by the relationship is only 8%. This suggests that while gaming may be correlated to an interest in CS, it is a small correlation and other variables must be considered more influential.", "num_citations": "33\n", "authors": ["1195"]}
{"title": "A new perspective on\" community\" and its implications for computer-mediated communication systems\n", "abstract": " Scholars have long argued about the nature of\" community,\" and the growth of Internet-based communication and\" online communities\" has intensified this debate. This paper argues that a new perspective on the concept\" community\" can shed light on the subject. Ideas from cognitive science, particularly category theory, can help. I suggest that community can be viewed as a prototype-based category. Prototype-based categories are defined not by simple rules of inclusion and exclusion, but instead by their prototypical members--a robin is a better example of a bird than an emu or a penguin. Items in a category are better or worse examples of the category depending on their degree of similarity to the prototypical members. I will argue that these theoretical insights can help resolve debates about the nature of community, and also can help guide designers of computer-mediated communication (CMC) systems.", "num_citations": "33\n", "authors": ["1195"]}
{"title": "The view from the other side: The border between controversial speech and harassment on Kotaku in Action\n", "abstract": " In this paper, we use mixed methods to study a controversial Internet site: The Kotaku in Action (KiA) subreddit. Members of KiA are part of GamerGate, a distributed social movement. We present an emic account of what takes place on KiA who are they, what are their goals and beliefs, and what rules do they follow. Members of GamerGate in general and KiA in particular have often been accused of harassment. However, KiA site policies explicitly prohibit such behavior, and members insist that they have been falsely accused. Underlying the controversy over whether KiA supports harassment is a complex disagreement about what \"harassment\" is, and where to draw the line between freedom of expression and censorship. We propose a model that characterizes perceptions of controversial speech, dividing it into four categories: criticism, insult, public shaming, and harassment. We also discuss design solutions that address the challenges of moderating harassment without impinging on free speech, and communicating across different ideologies.", "num_citations": "32\n", "authors": ["1195"]}
{"title": "Judging you by the company you keep: dating on social networking sites\n", "abstract": " This study examines dating strategies in Social Networking Sites (SNS) and the features that help participants achieve their dating goals. Qualitative data suggests the SNS feature, the friends list, plays a prominent role in finding potential dates, verifying credibility, and validating ongoing relationship commitment levels. Observations of how study participants use the friends list may provide design implications for social networking sites interested in facilitating romantic connection among their users. More broadly, this research shows how subtle user-interface design choices in social computing software can have a profound effect on non-trivial activities like finding a life partner.", "num_citations": "32\n", "authors": ["1195"]}
{"title": "Managing deviant behavior in online communities\n", "abstract": " Wherever groups of people gather, norms for appropriate behavior emerge, and some people chose to violate those norms. What is an exercise of free speech to one person, to another is disruptive, harassing, racist, or worse. For groups that communicate online, a range of technical and social mechanisms are available to help create a climate conducive to meeting the group's stated mission. How do designers of online systems decide what kind of conduct is acceptable? How are these expectations communicated to members? How can designers help prevent and manage deviant behavior? What are the implications of corporate control of content for ideals of free expression? This panel brings together experts from media theory, computer-supported collaborative learning (CSCL), computer-supported cooperative work (CSCW), and online entertainment to explore current issues in this complex research area.", "num_citations": "31\n", "authors": ["1195"]}
{"title": "Research Ethics in HCI: A town hall meeting\n", "abstract": " As interactive technologies evolve and reach into every aspect of modern life, research practices in human-computer interaction (HCI) have changed. The methodological and epistemological foundations of the field are shifting to reflect the diversity of contexts in which rapidly changing digital technology is being used. Alongside these changes, new ethical challenges emerge for the HCI community, both in terms of research ethics and responsible research and innovation. Open dilemmas include issues such as the shifting meaning of informed consent, anonymisation or privacy in an always-online world. The SIGCHI Ethics Committee has been established to look into the processes, practices and structures at SIGCHI venues to deal with such ethical dilemmas and how they can be addressed in a transparent, consistent and open way. This town hall style panel will be an opportunity to prompt community discussion …", "num_citations": "30\n", "authors": ["1195"]}
{"title": "An HCI approach to computing in the real world\n", "abstract": " We describe the implementation of a six-week course to teach Human-Computer Interaction (HCI) to high school students. Our goal was to explore the potential of HCI in motivating students to pursue future studies in related computing fields. Participants in our course learned to make connections between the types of technology they use in their daily lives and the design processes that went into creating these technologies. We suggest that by portraying computing through the lens of HCI, as an innovative, creative, and challenging field with authentic, real-world applications, we may be able to motivate students to become more interested in computing.", "num_citations": "30\n", "authors": ["1195"]}
{"title": "The day after net day: Approaches to educational use of the Internet\n", "abstract": " To date, popular enthusiasm for educational applications of computer networking has                 outpaced scholarly research on their educational value. This article reviews a                 variety of approaches to educational use of the internet, and divides them into four                 categories: information delivery, information retrieval, information sharing, and                 technological samba schools. The pedagogical foundations of each approach are                 analysed. As we move through these approaches in order, the emphasis shifts from                 information to ways of knowing, and there is an increasing emphasis on community.", "num_citations": "30\n", "authors": ["1195"]}
{"title": "The electronic scrapbook: towards an intelligent home-video editing system\n", "abstract": " How many people's home videos remain unedited and unwatched? Home video is a growing cultural phenomenon; however, few consumers have the time, equipment, and skills needed to edit their work. The Electronic Scrapbook is an environment designed to encourage people to use home video as a creative medium. The system and the user collaborate to create home-video stories.This work addresses issues of knowledge representation and interface design. Semantic knowledge representation is evaluated as a way to represent information about complex, temporal media. A modified form of case-based reasoning,” knowledge-based templates,” is used to explore what a computational model of a home-video story might be.", "num_citations": "30\n", "authors": ["1195"]}
{"title": "Ethics for studying online sociotechnical systems in a big data world\n", "abstract": " The evolution of social technology and research methods present ongoing challenges to studying people online. Recent high-profile cases have prompted discussion among both the research community and the general public about the ethical implications of researching humans, their information, and their activities in large-scale digital contexts. Examples of scientific and market research involving Facebook users and OKCupid clients exemplify the ethical complexities of both studying and manipulating online user behavior. When does data science become human subjects research, and what are our obligations to these subjects as researchers' Drawing from previous work around the ethics of digital research, one goal of this workshop is to work towards a set of guiding principles for CSCW scholars doing research online.", "num_citations": "29\n", "authors": ["1195"]}
{"title": "Copyright terms in online creative communities\n", "abstract": " A key usability problem for websites is the complexity of their terms and conditions. Within the HCI community, attention to this issue to date has primarily focused on privacy policies. We begin to build on this work, extending it to copyright terms. With so many people posting everything from status updates to digital art online, intellectual property rights are increasingly important to the end user. We conducted a content analysis of 30 different websites where users can share creative work, focusing on the licenses and usage rights that users grant to those websites. Due to difficult readability, legalese, and a lack of plain language explanations, it is likely that users may not know what rights they are granting. Next steps include a user survey to determine whether this is the case, and further exploration of the impact on usability.", "num_citations": "27\n", "authors": ["1195"]}
{"title": "From samba schools to computer clubhouses: Cultural institutions as learning environments\n", "abstract": " Background In this book we have considered how mathematics might be learned in settings that resemble the Brazilian samba school, in settings that are real, socially cohesive, and where experts and novices are all learning. The samba school, although not’exportable’to an alien culture, represents a set of attributes a learning environment should and could have.(Seymour Papert, Mindstorms, 1980) 1 earning rarely takes place in isolation. The learner is typically situated in a community of practice. 2 In some cases, like traditional schools, promoting learning is the community’s reason for being. In others, like the Vai and Gola tailors of West Africa studied by Lave and Wenger, the community’s purpose may be something else entirely (like making clothes). 3 Nevertheless, learning is a lifelc~ ng, ongoing practice for tailors as much as students. Furthermore, in all varieties of learning communities, social practices and …", "num_citations": "26\n", "authors": ["1195"]}
{"title": "Designing for civil conversations: Lessons learned from ChangeMyView\n", "abstract": " Research has shown that people all over the world, and particularly Americans, are divided over many issues – from immigration and gun control to economic and foreign policy. Information bubbles further contribute to these divisions: People prefer to consume content they feel familiar with and see views they agree with. Yet, pluralism and viewpoint diversity are necessary for a well-functioning democracy. In this paper, we explore how we can design interfaces that dial down partisan antipathy and allow users with opposing viewpoints to understand one another. We study ChangeMyView (CMV) subreddit, a community that encourages users to change their opinion by inviting reasoned counterarguments from other members. We use interviews with 15 CMV members to gain insights about the design mechanisms and social norms that allow this community to function well. We also explore how we can replicate such civil interactions between users with different ideologies on other platforms.", "num_citations": "25\n", "authors": ["1195"]}
{"title": "Locating the Internet in the Parks of Havana\n", "abstract": " Since March 2015, the public squares of Havana have been transformed from places where people stroll and children play to places where crowds gather to try to connect to the internet at all hours of the day and night. We present a field investigation of public WiFi hotspots in Havana, Cuba, and examine the possibilities of internet access these limited and expensive hotspots present to individuals, many of who are experiencing the internet for the first time. Drawing on fieldwork conducted in 2015-2016, we underscore the reconfigurations that have resulted from this access, as evolving internet users reconfigure their interactions with place, time, and individuals in their efforts to locate the internet. We also discuss the implications our findings have for the design of internet access interventions in Cuba and in other low-resource environments across the world, as well as the broader implications for social computing …", "num_citations": "25\n", "authors": ["1195"]}
{"title": "Towards an appropriable cscw tool ecology: Lessons from the greatest international scavenger hunt the world has ever seen\n", "abstract": " If you could accomplish a complex, collaborative work task with one tool or many tools working together, which would you choose? In this paper, we present a case study of GISHWHES (the\" Greatest International Scavenger Hunt the World Has Ever Seen\"), an annual event in which teams spend one week completing complex, creative tasks. Building on the literature of IT ecosystems, we show how teams used different collections of tools to meet their communication needs. We interviewed team members, finding that most teams used multiple tools during GISHWHES. By analyzing which tools they chose over others for each function, we gain insight into the strengths and weaknesses of these tools, and the complexity surrounding work processes. In light of this complexity, this research highlights the importance of designing appropriable tools that can work with unanticipated workflows and mesh well with other tools …", "num_citations": "25\n", "authors": ["1195"]}
{"title": "Graders as meta-reviewers: Simultaneously scaling and improving expert evaluation for large online classrooms\n", "abstract": " Large classes, both online and residential, typically demand many graders for evaluating students' written work. Some classes attempt to use autograding or peer grading, but these both present challenges to assigning grades at for-credit institutions, such as the difficulty of autograding to evaluate free-response answers and the lack of expert oversight in peer grading. In a large, online class at Georgia Tech in Summer 2015, we experimented with a new approach to grading: framing graders as meta-reviewers, charged with evaluating the original work in the context of peer reviews. To evaluate this approach, we conducted a pair of controlled experiments and a handful of qualitative analyses. We found that having access to peer reviews improves the perceived quality of feedback provided by graders without decreasing the graders' efficiency and with only a small influence on the grades assigned.", "num_citations": "24\n", "authors": ["1195"]}
{"title": "Edits & credits: exploring integration and attribution in online creative collaboration\n", "abstract": " Attribution allows online reputations to be formed and motivates many contributions to online creative collaboration. Yet, we know little about attribution practices in online creative collaboration and the technologies that shape them. This paper describes a study of online collaborative animation projects, focused on the practices surrounding integration and attribution. We found that both tasks are closely related and often completed by a single person, a process we call\" cr-editing.\" We also identify frustrations with existing practices and systems and propose design considerations for alleviating them. Our findings offer insights into the growing space of online remixing, mashups, and creativity.", "num_citations": "24\n", "authors": ["1195"]}
{"title": "GameLog: Fostering reflective gameplaying for learning\n", "abstract": " On the surface, it seems like teaching about games should be easy. After all, students are highly motivated, enjoy engaging with course content, and have extensive personal experience with videogames. Games education in reality is surprisingly complex. In game classes, students are often asked to reflect, generalize, and articulate their understanding of games as they play and analyze them. Educational research suggests that these tasks are particularly challenging for students. We report on the use of GameLog, an online blogging environment for supporting reflection on gameplaying experiences. GameLog differs from traditional blogging environments because each user maintains multiple parallel blogs, with each blog devoted to a single game. GameLog was used in two university level games-related classes. Our results indicate students perceived writing GameLogs as a positive learning experience for …", "num_citations": "23\n", "authors": ["1195"]}
{"title": "Effects of CMC on student participation patterns in a foreign language learning environment\n", "abstract": " In this paper, we describe a study examining how communication patterns compare between a traditional foreign language learning classroom and a synchronous, text-based CMC environment. We present suggesting that conversation patterns change significantly when discussions move online. The slight time delay in composing replies and the development of a sense of community seem to be important mechanisms leading to this change.", "num_citations": "23\n", "authors": ["1195"]}
{"title": "Cyberspace is not disneyland: The role of the artist in a networked world\n", "abstract": " Cyberspace is not Disneyland. It’s not a polished, perfect place built by professional designers for the public to obediently wait on line to passively experience. It’s more like a finger-painting party. Everyone is making things, there’s paint everywhere, and most work only a parent would love. Here and there, works emerge that most people would agree are achievements of note. The rich variety of work reflects the diversity of participants. And everyone would agree, the creative process and the ability for self expression matter more than the product. On the net, everyone is becoming an artist. On the World Wide Web, millions of people are constructing multimedia self-portraits on their home pages. Howard Rheingold’s home page has a collection of his essays, a\" pixel theatre\" of his paintings (including one on his greenhouse door that he finished by only painting on his birthday each year for five years), a diary from his travels (with pictures and pointers to the home pages of interesting people he visits), and a complete copy of his most recent book. Judith Donath has a home page for her car, complete with its own diary (\" New muffler today, plus tail pipe. All from Midas. It feels great to be back on the road.\") People adorn their home pages with photos of themselves and their pets, lists of their favorite things (web sites, restaurants, places to rollerblade), and news about their lives. Each home page is an expression of self. The art of the self portrait has never been so popular.", "num_citations": "23\n", "authors": ["1195"]}
{"title": "Early adopters of the Internet and social media in Cuba\n", "abstract": " Although the Cuban government has tightly controlled information access for more than half a century, a small number of Cubans have access at work. In this paper, we examine Internet and social media use by early adopters in Cuba in early 2015, as we enter a time of potential change. Specifically, we explore Cubans' access limitations and the activities they do online, as well as what Internet access means to them. We conducted interviews with 12 Cuban Internet users and observed their social media use. Our findings suggest that access limitations and slow network speeds greatly restrict Cubans' Internet use. To counter these limitations, Cubans are collaborative, often conducting online research and posting photos for friends with less access. Based on these findings, we propose future work to help meet Cuban citizens' information needs.", "num_citations": "22\n", "authors": ["1195"]}
{"title": "Disinhibition in a CSCL Environment\n", "abstract": " In this paper, we explore the IRC Français foreign language learning environment. This environment offers little more than a text-based chat system with a few features to make writing in a foreign language easier. Despite the limited structure, conversations online exhibit strong differences from conversations in the classroom, even when the teachers and students remain constant. We offer some explanations for these findings based on interviews conducted with a number of the teachers and students.", "num_citations": "22\n", "authors": ["1195"]}
{"title": "Models of educational computing@ home: New frontiers for research on technology in learning\n", "abstract": " To date, the major emphasis of educational technology researchers has been the development and use of educational technologies within school settings. Noticeably absent has been research and considerations that focus on the home as a computer-based learning environment and potential connections between school and home learning. Given the increasing presence of computers in homes, the authors argue for an explicit research focus on the various ways that computers in homes can be used to create rich learning environments or extend school-based learning environments. To that end, this article discusses various models of educational computing in the home that are linked to learning in school, along with critical issues for consideration by researchers who choose to venture into this emerging area.", "num_citations": "22\n", "authors": ["1195"]}
{"title": "MOOSE crossing: Creating a learning culture\n", "abstract": " MOOSE Crossing is text-based virtual reality environment (or\" MUD\") on the Internet designed to give kids 9 to 13 a meaningful context for reading, writing, and computer programming. The project aims use the Internet to situate constructionist learning in a supportive community context, and explores the notion of\" a learning culture.\"", "num_citations": "22\n", "authors": ["1195"]}
{"title": "Just awful enough: the functional dysfunction of the something awful forums\n", "abstract": " The Something Awful Forums (SAF) is an online community comprised of a loosely connected federation of forums, united in a distinctive brand of humor with a focus on the quality of member contributions. In this case study we find that the site has sustained success while deviating from common conventions and norms of online communities. Humor and the quality of content contributed by SAF members foster practices that seem counterintuitive to the development of a stable and thriving community. In this case study we show how design decisions are contextual and inter-dependent and together these heuristics create a different kind of online third place that challenges common practices.", "num_citations": "21\n", "authors": ["1195"]}
{"title": "Student research and the Internet\n", "abstract": " To help students understand the art of research and the reliability of sources in the age of online information, we should teach them about the nature of `truth'.", "num_citations": "21\n", "authors": ["1195"]}
{"title": "CSCW research ethics town hall: Working towards community norms\n", "abstract": " As technologies as well as research practice evolve, new ethical challenges emerge within the CSCW research community. Currently, norms around what constitutes ethical practice in research are scattered and inconsistent. We face a number of open ethical questions around issues such as informed consent, anonymization, Terms of Service, deleted content, and what constitutes public data. The SIGCHI Ethics Committee has been looking towards ways to encourage norm setting and mitigate ethical disagreement during the peer review process. This town hall style panel will be an opportunity to prompt community discussion and collect input into how we can further address these challenges.", "num_citations": "20\n", "authors": ["1195"]}
{"title": "Improving the language ability of deaf signing children through an interactive American Sign Language-based video game\n", "abstract": " We present the design of an interactive computer game-based intervention, CopyCat, in which deaf children use sign language to direct the actions of a character in the game. We conducted a study to quantify the game's impact on expressive language development using twelve participants from a local school for the deaf. Learners in the experimental group improved significantly in their receptive, expressive, and sentence repetition abilities as opposed to those in the control group.", "num_citations": "20\n", "authors": ["1195"]}
{"title": "AquaMOOSE 3D: math learning in a 3D multi-user virtual world\n", "abstract": " AquaMOOSE 3D is a multi-user, graphical, constructionist environment to help children learn about mathematics and computer programming. In this paper, we present the system design, and results from our first round of formative evaluation.", "num_citations": "20\n", "authors": ["1195"]}
{"title": "Member behavior in company online communities\n", "abstract": " A growing number of corporations have created sites where customers talk to one another. What kind of interaction takes place on these sites? In this study, we interviewed eleven members of company online communities (COC). We found that while users initially come to such sites looking for product information, they often stay to socialize, and develop meaningful friendships with other members (even turning to one-another for support in times of personal tragedy). We present case studies of interaction on two sites for Campbell's Soup, and for MINI Cooper car owners. We found that users are drawn to these sites because the product's brand image attracts a group of like-minded individuals. Adjectives used to describe the brand are also used to describe site members. Ie, Campbell's is trusting and down-to earth; MINI is fun-loving. Implications for website design are discussed.", "num_citations": "19\n", "authors": ["1195"]}
{"title": "Children and elders sharing stories: Lessons from two online oral history projects\n", "abstract": " Oral history projects provide a way for students to learn history by engaging with elders sharing stories relevant to their experience. However, these kinds of projects require a large amount of effort to undertake. We believe computing technology can help. Here, we examine the role of existing technology in allowing kids and elders to share historical stories. We present the results of two pilot studies. Lessons learned for CSCL system design and classroom implementation are presented, along with future directions.", "num_citations": "19\n", "authors": ["1195"]}
{"title": "Flash collabs: Collaborative innovation networks in online communities of animators\n", "abstract": " Collaborative innovation networks (COINs) and swarm creativity is often studied in a professional business context. We propose that studying COINs of amateurs and non-business contexts provides a crucial and complementary perspective on these phenomena. By broadening the scope of COINs research to encompass these edge cases, we can begin to identify patterns and trends that persist across different contexts. For the past three years, we have been studying COINs in a novel context: online communities of Flash animators who collaborate over the internet to create animated movies and games called “collabs.” From a quantitative analysis of nearly 900 collabs on Newgrounds. com, we found that these projects can be highly successful, attracting hundreds of thousands of Internet audience members to download the completed animations. Our analysis also demonstrated that is possible to predict the success potential of a collab by examining specific factors, including attributes of the leader, organizational structures, and activity patterns within a collab. Our focus in this research has been on the social dynamics within collabs, especially the role of leadership. Through in-depth interviews with collab participants, we found that collabs are typically created by groups of amateurs, or in some cases, animation students, often located around the world and speaking different languages. Their motivations tend to be socialpsychological―such as learning, reputation, social support, and self-efficacy―rather than financial, and almost everyone contributes as an unpaid volunteer. We also found that a shared goal of almost every collab participants …", "num_citations": "18\n", "authors": ["1195"]}
{"title": "If it Rains, Ask Grandma to Disconnect the Nano: Maintenance & Care in Havana's StreetNet\n", "abstract": " In Cuba, where internet access is severely constrained, technology enthusiasts have built StreetNet (SNET), a community network (CN) that has grown organically, reaching tens of thousands of households across Havana. Through fieldwork conducted in 2016 and 2017, we investigate participants' strategies as they engage with a network where the material elements---cables, switches, nanos, and servers---are regularly breaking down. Drawing on maintenance and care (M&C) scholarship, we present an in-depth investigation of the management and anticipation of breakdowns in SNET, foregrounding the deeply relational nature of repair work, collective efforts required for SNET's M&C, and the values and motivations underpinning these practices. Our paper contributes a unique perspective on how CNs are run locally and organically, outlining considerations for how interventions along these lines might be more …", "num_citations": "17\n", "authors": ["1195"]}
{"title": "From gamers to scholars: Challenges of teaching game studies\n", "abstract": " This article reports on the results of a study that explores the issues and challenges faced by instructors of games studies classes. Using a semi-structured protocol, we interviewed twelve professors and instructors of game studies courses. The interviews were transcribed and iteratively coded in order to refine theoretical categories, propositions and conclusions. Our results indicate that learning about games can be challenging for multiple reasons. For instance, an extensive prior videogame experience often interferes with students’ abilities to reason critically and analytically about games. They also have difficulties articulating their experiences and observations. The medium itself also presents obstacles in access. Students must be skilled at games in order to fully experience them and technological barriers make it difficult to provide older games for students to experience. The article describes many of the solutions that instructors are adopting in order to overcome these challenges. We conclude by drawing attention to the issue that current game studies courses run the risk of limiting the diversity of people who could become game scholars.", "num_citations": "17\n", "authors": ["1195"]}
{"title": "Peopled online virtual worlds: a new home for cooperating communities, a new frontier for interaction design (panel)\n", "abstract": " Multi-user virtual worlds are proliferating on the Internet. These are two and three dimensional graphical environments inhabited by users represented as digital actors called “avatars”. Through this new medium for cooperating communities, a wide variety of Internet users are participating in a large scale social experiment and collaborating on a variety of projects. The inhabited virtual world is an exciting new medium for HCI professionals including interaction and graphic designers, and educators and researchers focused on distance learning and teleworking. It also appeals to children and ordinary users of the Internet as a vast new digital playground and a venue for personal expression. This panel will present a brief overview the inhabited virtual world medium and then discuss its merits and limitations as a medium for cooperating communities and interaction design.", "num_citations": "16\n", "authors": ["1195"]}
{"title": "Identity workshop\n", "abstract": " You say\" so the anonymity isn't because you could become someone else tomorrow\" You say\" it isn't easier because you can discard your character\" You say\" most people's characters are important to them\" You say\" and what people think about the character is important\"", "num_citations": "15\n", "authors": ["1195"]}
{"title": "Designing online environments for expert/novice collaboration: Wikis to support legitimate peripheral participation\n", "abstract": " / Designing environments that can bring novices and experts together is not trivial. We explore how we can design environments where these collaborations happen in such a way that everyone benefits. We explore these questions in the context of one such environment. In this study, we used the Game Ontology Project (GOP), a wiki-enabled hierarchy of elements of gameplay used by game studies researchers, in a game design class. Students found that their participation was enjoyable and useful for learning. Also, there is evidence that they developed a deeper understanding of the medium of videogames. However, encouraging sustained participation was challenging because students tended to view the GOP as a static source, rather than a participatory and editable resource. Expert analysis of the students’ contributions to the ontology found them to be useful and significant. We conclude with thoughts on …", "num_citations": "14\n", "authors": ["1195"]}
{"title": "Encouraging attitudinal change through online oral history\n", "abstract": " Computing technology has been used extensively in the classroom to aid students in learning about math, science, and writing. Comparatively little work has focused on the sorts of history learning computing technology facilitates, if any. Can computing technology be used to facilitate history learning? What does it mean to support history learning? How do we evaluate such learning? In this paper, we give an overview of some of the key components of history learning and discuss one way to encourage them: supporting students as they explore history through direct contact with and interpretation of primary sources. We present Palaver Tree Online, a constructionist and social constructivist environment that aims to enable authentic history learning by supporting students in doing oral history projects online. We then discuss the impact of the system on the development of empathy, one of the four forms of historical thought. Specifically, analysis of the data shows that students develop an increased empathy for elders and a stronger enjoyment of learning history through participation in online oral history.", "num_citations": "14\n", "authors": ["1195"]}
{"title": "Understanding law enforcement strategies and needs for combating human trafficking\n", "abstract": " In working to rescue victims of human trafficking, law enforcement officers face a host of challenges. Working in complex, layered organizational structures, they face challenges of collaboration and communication. Online information is central to every phase of a human-trafficking investigation. With terabytes of available data such as sex work ads, policing is increasingly a big-data research problem. In this study, we interview sixteen law enforcement officers working to rescue victims of human trafficking to try to understand their computational needs. We highlight three major areas where future work in human-computer interaction can help. First, combating human trafficking requires advances in information visualization of large, complex, geospatial data, as victims are frequently forcibly moved across jurisdictions. Second, the need for unified information databases raises critical research issues of usable security …", "num_citations": "13\n", "authors": ["1195"]}
{"title": "Research Ethics for HCI: A roundtable discussion\n", "abstract": " An ongoing challenge within the HCI research community is the development of community norms for research ethics in the face of evolving technology and methods. Building upon a successful town hall meeting at CHI 2017, this panel will include members of the SIGCHI Research Ethics Committee, but will be structured to facilitate a roundtable discussion and to collect input about current challenges and processes. The panel will pose open questions and invite audience discussion of best practices focused on issues such as cultural and disciplinary differences in ethical norms. There will also be discussion of how ethical issues are handled in SIGCHI paper submission and reviews, processes for how we might create and disseminate ethics resources, and regulatory issues such as the recent IRB changes for US institutions.", "num_citations": "13\n", "authors": ["1195"]}
{"title": "The role of social computing technologies in grassroots movement building\n", "abstract": " Social movement organizing is becoming increasingly dependent on communication technologies. How can Computer-Supported Cooperative Work systems support grassroots organizations in facilitating collective action through democratic participation? In this article, we study Science for the People-Atlanta, a social movement organization dedicated to building a grassroots movement around science activism. We used action research, both participating in the organization and studying it. We use the Freirean model of participatory communication theory to unpack the movement-building process of SftP-Atlanta. The Freirean model provides a three-step, iterative process for sustainable movement building: forming a collective identity, moving toward collective action, and engaging in reflexive dialog. We analyze both the perceived strengths and weaknesses of their sociotechnical practices in supporting the …", "num_citations": "12\n", "authors": ["1195"]}
{"title": "Leadership and success factors in online creative collaboration\n", "abstract": " Social computing systems have enabled new and \"wildly successful forms of creative collaboration to take place. Two of the best-known examples are Wikipedia and the open-source software (OSS) movement. Wikipedia, the free online encyclopedia, boasts millions of articles (over 3-6 million just in English) written by thousands of volunteers col laborating via the Internet. The OSS movement, also fueled mainly by volun teer online collaboration, has produced some of the \"world's most powerful and important software applications, includ ing the Apache HTTP Server, the Linux operating system, and the Mozilla Firefox Web browser. Many Wikipedia articles and OSS projects have been demon strated to be equal or superior in quality to their commercial competitors. But how is this possible? Why do online col laborations like these succeed, and what lessons can we learn from them?", "num_citations": "12\n", "authors": ["1195"]}
{"title": "Blogging for facilitating understanding: A study of video game education\n", "abstract": " Video games are becoming an increasingly important part of people’s lives (Byron 2008). Among some groups, such as college students, video gaming is ubiquitous (Jones 2003). According to the Entertainment Software Association (ESA), 75 percent of heads of households in the United States play video games, and the average game player (not buyer) is 30 years old (ESA 2005). These statistics are strikingly similar in other countries; for example, in Great Britain 59 percent of the population between 6 and 65 years of age are gamers (Pratchett 2005). Video games are undeniably affecting our culture, the way we socialize and communicate, and how we think about the world. The increasing interest in video games has been accompanied by an explosion in the number of universities and colleges teaching “game courses” and offering game-related degrees. Colleges and universities are not only teaching classes in game analysis, design, and development; they are also wrestling with how best to do so. For instance, in many game classes, students are asked to think critically about games as they play and analyze them, something they find challenging (Zagal and Bruckman 2007). Students often confuse being insightful about a game with being successful at playing it.Given these issues, how can we support learners in developing a deeper understanding of video games? In this article we do three things. First, we provide a definition of what it means to understand games. The definition is phrased in terms of what a person who understands games should be able to do. Second, we propose blogging as a means for helping novices leverage …", "num_citations": "12\n", "authors": ["1195"]}
{"title": "Creativity, Copyright, and Close-Knit Communities: A Case Study of Social Norm Formation and Enforcement\n", "abstract": " Social norms as a regulatory mechanism often carry more weight than formal law--particularly in contexts when legal rules are gray. In online creative communities that focus on remix, community members must navigate copyright complexities regarding how they are permitted to re-use existing content. This paper focuses on one such community--transformative fandom--where strong social norms regulate behavior beyond copyright law. We conducted interviews with fan creators about their \"unwritten rules\" surrounding copying and remix and identified highly consistent social norms that have been remarkably effective in policing this community. In examining how these norms have formed over time, and how they are enforced, we conclude that the effectiveness of norms in encouraging cooperative behavior is due in part to a strong sense of social identity within the community. Furthermore, our findings suggest the …", "num_citations": "11\n", "authors": ["1195"]}
{"title": "WallStreetBets: Positions or Ban\n", "abstract": " r/wallstreetbets (WallStreetBets or WSB) is a subreddit devoted to irreverent memes and high-risk options trading. As of March 30, 2020, the subreddit boasts a usership of nearly 1.1 millions subscribers and self-describes as \"if 4chan found a Bloomberg terminal.\" This paper will utilize Amy Jo Kim's community design principles along with social psychology theory as frameworks to understand how this chaotic, oftentimes offensive community has developed one of the largest and most loyal user bases on the platform. We will further argue that humor plays a vital role in promoting in-group cohesion and in providing an unconventional third place for traders (and thinly veiled gamblers) to seek support from each other in the form of vulgar, yet good-humored taunting.", "num_citations": "10\n", "authors": ["1195"]}
{"title": "Understanding\" Bad Actors\" Online\n", "abstract": " Harassment, hate speech, and other forms of abuse remain a persistent problem in online communities today. In order to discourage misbehavior in online spaces, we must first understand why everyday people participate in abusive behaviors online. This workshop aims to bring together a diverse range of researchers, practitioners, and activists for cross-disciplinary community-building, foundational understanding, and collaborative ideation. Workshop participants will engage in practical brainstorming exercises, develop research plans and design ideas, and build relationships with other researchers, practitioners, and activists to collaboratively realize ideas generated from the workshop. This one-day workshop is led by industry and academic researchers and will accommodate up to 30 participants.", "num_citations": "10\n", "authors": ["1195"]}
{"title": "Toward a grassroots culture of technology practice\n", "abstract": " Information and Communication Technologies (ICTs) can support grassroots social movements toward greateroutreach and better day-to-day communication. In this paper, we present the results of action research with alarge-scale grassroots social movement, the Southern Movement Assembly (SMA), exploring their uses andperceptions of ICTs. We find that the ICTs chosen by the SMA are often at odds with their grassroots cultureof inclusion and participation-which results in inequitable sociotechnical realities within the movement. Forexample, people with technical skills gain more power as they start to control organizational processes. Astechnical skills are most commonly associated with racial, gender, and socioeconomic privileges, this leads toinequitable participation. We conclude by calling for a grassroots culture of technology practice rooted inanalyses of systemic exclusion with a continuous effort to …", "num_citations": "9\n", "authors": ["1195"]}
{"title": "Social support for creativity and learning online\n", "abstract": " In the mid 1990s, we began to ask some hopeful questions about the potential of the Internet to empower the individual: Can users become creators of content, rather than merely recipients? What can people learn through working on personally meaningful projects and sharing them online? If content creation is to some degree democratized, does this have broader cultural or political implications? This enthusiasm faded a bit by the dot-com bust, and many began to wonder: will it be business-as-usual after all? But then it started happening. On Wikipedia, thousands of volunteers collaborate to create a shared resource that, while not without flaws, is astonishing in its breadth and speed of adaptation. Furthermore, the process of writing this resource is truly collaborative to a degree that should make any Computer-Supported Cooperative Work (CSCW) professional envious. On sites like deviantART and Newgrounds …", "num_citations": "9\n", "authors": ["1195"]}
{"title": "\" The children's challenge: new technologies to support co-located and distributed collaboration\" report on the CSCW 2000 panel\n", "abstract": " Today's children can be found spending hours interacting with computers, playing games, sending email to friends, visiting chat rooms, and sharing games over the Internet. At the same time, if there are five computers in a room with five children, within a few minutes, half of the children will be gathered around each other's computers.They will be doing anything from sharing a game to exploring a web site together. Children are social beings. They need to collaborate—face-to-face and from afar. They reflect this need in how they use their technologies. However, what we often forget is that collaboration between children will not occur just because they share the same computer or email between two computers. Children's social interactions need to be supported and encouraged by the technologies we develop. We can so often forget that there are huge changes taking place in young children's cognitive …", "num_citations": "9\n", "authors": ["1195"]}
{"title": "Design and the Politics of Collaboration: A Grassroots Perspective\n", "abstract": " This workshop aims to advance our knowledge of how CSCW technologies can be better aligned with grassroots politics of collaboration. What politics are inherent in CSCW tools and techniques? How can we examine whether so-ciotechnical systems support collaboration in ways that lead to equitable solutions for all and not just a select few? What can we learn about collaborative systems and practices from other communities of people with lived experiences of politics of collaboration? Our workshop will incorporate communal practices of grassroots movement building to explore what it means to examine designs of CSCW arti-facts and practices for the politics they embody and pro-mote. The workshop simultaneously is about grassroots approaches, and also leverages lessons we have learned from grassroots movements in the workshop structure.", "num_citations": "8\n", "authors": ["1195"]}
{"title": "Predicting successful completion of online collaborative animation projects\n", "abstract": " Online creative collaboration projects are started every day, but many fail to produce new artifacts of value. In this poster, we address the question of why some of these projects succeed and others fail. Our quantitative analysis of 892 online collaborative animation projects, or\" collabs,\" indicates that the early presence of organizational and structural elements, particularly those of a technical nature, can predict successful completion.", "num_citations": "8\n", "authors": ["1195"]}
{"title": "Learning information literacy in the age of Wikipedia\n", "abstract": " Where does reliable information come from? Young people have difficulty assessing the quality of information sources they find on the Web (Kafai, 1997; Wallace et. al. 2000; Kuiper, 2005). Helping students learn to critically assess sources has sometimes been portrayed as a typical learning problem: expert practices need to be made accessible to a generation of learners. Research has sought to identify differences between expert and novice strategies for assessing information sources (Wineburg, 1991); however, the recent proliferation of user-generated content has complicated matters. Sometimes experts disagree altogether about what constitutes a reliable source. In the absence of agreed-upon expert practices, what should students learn? Wikipedia sits at the center of this confusion. Students, teachers, parents, and researchers alike often do not understand how to critically assess Wikipedia articles because there is no widely shared understanding of how information production is regulated in a wiki environment. The nomenclature of “Web 2.0” represents, among other things, broad recognition of new, distributed models of information production. Strategies like metacognitive prompts can help novices become more reflective about the sources they use (Stadtler & Bromme, 2007), but without a clear understanding of how publication works, it is unclear that novices can construct useful documents models on which to reflect. Before young people can learn to assess sources like Wikipedia, they need to first understand how such resources are created and maintained. Our research investigates how new publication models associated with …", "num_citations": "8\n", "authors": ["1195"]}
{"title": "What Do Kids Learn from Adults Online? Examining Student-Elder Discourse in Palaver Tree\n", "abstract": " The Internet has made it possible to incorporate adult mentors in the classroom in ways that it would have been difficult or impossible to do previously. As we move forward with such projects, it is important for us to consider what these adults contribute to the learning process. Palaver Tree Online is an online community that supports kids interviewing elders to build up a shared database of oral history. In this paper, we use two case studies of kid-elder discourse in Palaver Tree to illustrate what students learn from online adults. In addition, we propose a new role for such adults in scaffolding students having difficulty. Finally, we offer a more general classification of the types of questions kids and adults have fruitfully explored together in Palaver Tree.", "num_citations": "8\n", "authors": ["1195"]}
{"title": "\" I Am Not a Lawyer\" Copyright Q&A in Online Creative Communities\n", "abstract": " Once referred to by the Supreme Court as the\" metaphysics\" of law, many parts of copyright policy are historically confusing. Therefore, it isn't surprising that in communities where amateur content creators work within a legal gray area, copyright is a frequent topic of conversation. Here, people with often little knowledge of the letter of the law are asking and answering complex legal questions in the context of their creative activities. Working from a content analysis of public forum conversations in eight different online communities, we have examined these questions and answers more closely. By studying these interactions, what can we learn about how people engage with the law and how non-expert advice affects behavior and knowledge?", "num_citations": "7\n", "authors": ["1195"]}
{"title": "Georgia computes: Improving the entire computing education pipeline\n", "abstract": " Computing education suffers from low enrollment and a lack of diversity. Both of these problems require changes across the entire computing education pipeline. The “Georgia Computes!” alliance, funded by the National Science Foundation’s Broadening Participation in Computing program, seeks to improve the entire computing education pipeline in the state of Georgia. We are having a measurable effect at each stage of the pipeline, but have not yet shown an impact across the whole pipeline.", "num_citations": "7\n", "authors": ["1195"]}
{"title": "The human infrastructure of El Paquete, Cuba's offline internet\n", "abstract": " Los Paqueteros (The Packagers). On a narrow street in Havana Vieja, we visited a bottom-floor apartment with a blinking, rainbow-colored sign that read OPEN. The front room of this house had been converted into a shop with a desk, couch, and a wall full of DVDs packaged in colorful paper envelopes. Ricardo, one of the shop owners, sat behind the desk scrolling through digital files on his Dell desktop computer as his colleague, Aileen, looked on.“Copy me something good,” she told him.“Whatever you recommend.” Ricardo quickly navigated several folders on his screen until he got to the soap opera section.“I’m going to put a soap opera on here for you that you’re going to like, just the first season,” he told her.“If you don’t, just bring it back and we’ll find you something else.” Aileen pulled out a USB stick from her purse and handed it to Ricardo, who got up from his chair to plug the USB into the computer tower …", "num_citations": "6\n", "authors": ["1195"]}
{"title": "Interviewing members of online communities\n", "abstract": " In an interview study of members of an online community, one of the most daunting tasks is ﬁnding people who are willing to talk to you—and doing so ethically. Since 1997, I have taught a Georgia Tech class called “Design of Online Communities,” in which students are assigned to interview at least three members of an online group and also engage in participant observation. The class began at the graduate level, and now is offered to undergraduates as well. Teams of three students study the same site and write up a detailed account ofits design. The goal of the assignment is, ﬁrst, to help students understand how designed features of an online site impact user behavior. Second, the project introduces them to inter—viewing and participant observation as research methods for understanding online behavior. As you might imagine, interesting things happen when I unleash 40 new student researchers each year.Each semester, I repeatedly warn students that getting people to talk to you is hard work, and they should expect to spend a lot of time doing it. To further complicate matters, while you must be persistent, you may not annoy community members. And all activity takes place as governed by approval from our Institutional Review Board (IRB), the committee charged with protecting human subjects in research. In this chapter, I shall share the lessons learned from shepherding stu—dents through this process for the last 12 years. Those lessons are relevant not just for student projects but also for people working on research about this medium for publication.", "num_citations": "6\n", "authors": ["1195"]}
{"title": "Modeling the flow of information in a social network\n", "abstract": " Recent measurements of online social networks have observed a number of shared structural characteristics, such as power law distributions, scale-free properties, graph evolution, and information cascades (eg [9, 2, 1]), and, more recently, real-world networks such as blogs and viral outbreaks [8] and temporal patterns in networks (eg [3]). However, these studies measure networks as a function of nodes and links rather than a function of the subjective and individual relationships in the network.There are fewer examples of real-world applications that leverage the explicitly social nature of users and content in a graph for measuring trust in distributed systems. Specifically, how do levels of trust influence who people decide to talk to and what they share? Does trustworthiness scale, such that information flow is optimized not only through friend relationships, but also by friend-of-friend associations, network affiliations (eg Atlanta, Georgia Tech), and shared groups (eg RamblinWreck Fans)? Are there ways of detecting node outliers, subgraph borders, or link decays, that cause communication breakdowns?", "num_citations": "6\n", "authors": ["1195"]}
{"title": "Dealing with Community Data: A Report on the CSCW 2000 Workshop\n", "abstract": " eCite - Dealing with Community Data: A Report on the CSCW 2000 Workshop Skip to content UTAS University of Tasmania, Australia Students Staff MyLO Contacts Search UTAS Search Menu Study Study with UTAS I am a: Future Student (Domestic) Future Student (International) Higher Degree by Research Candidate Postgraduate Coursework Student Current Student Aboriginal and Torres Strait Islander Student Parent Popular Links Applying to Study Courses Scholarships Open Day Accommodation Library Webmail Research Research at UTAS Research Office of Research Services Our Research Industry & Collaboration Research to Reality WARP Central Science Laboratory Contact Graduate Research How to Apply Elite Research Scholarships Current Candidates Integrity and Ethics iGrad Community UTAS Community Community Alumni & Friends UTAS Foundation Giving to UTAS Scholarships …", "num_citations": "6\n", "authors": ["1195"]}
{"title": "Research issues in the design of online communities\n", "abstract": " Online communities are rapidly becoming a part of how we work, play, and learn. But how are they designed? What is already known in this emerging field? What are the key questions for future research? Online communities are becoming increasingly pervasive in the personal and professional lives of people from all strata of society; however, our knowledge about them is not increasing apace. The purpose of this workshop is to bring together researchers in this new area to begin to address these questions, and to support the growth of this research field.", "num_citations": "6\n", "authors": ["1195"]}
{"title": "Providing equitable access to computing education\n", "abstract": " Seeking the best measures to reach advantaged and less-advantaged students equally.", "num_citations": "5\n", "authors": ["1195"]}
{"title": "HCI for Kids\n", "abstract": " How is designing computer software and hardware for kids different from designing for adults? Many researchers have addressed questions about the impact of technology on children; less has been said about the impact children can have on the design of technology. Methods for designing with and for children are only recently becoming widespread features of the design literature (see Jensen & Skov, 2005).ABSTRACT", "num_citations": "5\n", "authors": ["1195"]}
{"title": "Learning and research in the web 2 era: opportunities for research.\n", "abstract": " Researchers in the learning sciences have long recognized the potential of online spaces to support learning activities; however, the pervasiveness of social media construction typically associated with\" Web 2.0\" represents a new context for the research of learning and instruction. Wikis, for example, have popularized a social approach to constructing knowledge that was very difficult to achieve with previous technologies. Social networking applications like Facebook that interconnect people according to social or semantic relationships have become integral features of student life. Multi-user synchronous environments like Second Life provide rich, immersive experiences as well as new forms of online community. Such applications are blooming in every corner of society, influencing the ways in which people learn and exchange with one another. These four papers present distinct research applications of such technologies, illustrating how they influence not only our methods, but affect the very nature of our questions and theoretical perspectives.", "num_citations": "5\n", "authors": ["1195"]}
{"title": "Cyberspace is not Disneyland\n", "abstract": " Twelve-hundred people watched as Peter Gabriel and Laurie Anderson shifted uneasily in their chairs. Director Peter Sellars was oblivious to what was making the others uncomfortable. The event: a panel discussion on\" Active Meaning\" at the Digital Expression Symposium at the MIT Media Lab in October of 94. The panel moderator, composer Tod Machover, was leading a discussion on viewing your audience as creators of content.Everyone is becoming a creator. This is a paradigm shift. This is THE paradigm shift. The\" information age\" and the\" information superhighway\" are misnamed. People are not flocking to cyberspace because they can download stock quotes, recipes, or travel information. It has little to do with\" information\" at all. It has everything to do with community and participation. On the net, you no longer have to wait to hear what Larry King or Le Monde think of events—you can express your own …", "num_citations": "5\n", "authors": ["1195"]}
{"title": "Virtual professional community\n", "abstract": " Once or twice a year we stand with name badges on, sipping coffee in a corridor, exchange ideas over expense-accounted lunches, and maybe attend a few talks. Friendships are made and projects hatched. Then it is back home to file for expenses, perhaps write a trip report, and get back to “real work” and relative isolation.MediaMOO is a text-based, networked, virtual reality environment designed to extend to a daily activity the type of casual collaboration that occurs at conferences. Visitors to a conference share not just a set of interests, but also a place and a set of activities. Interaction is generated as much by the latter two as", "num_citations": "5\n", "authors": ["1195"]}
{"title": "The potential of end-user programmable worlds: present and future\n", "abstract": " In Vernor Vinge's 1981 science fiction classic True Names, a global multi-user virtual world underlies the functioning of government and business. Some control this world in a literal-minded filing cabinet sort of fashion, and others with more colorful metaphors. Either style of interaction is a form of end-user programming. The power of cyberspace lies in the creativity and programming talent of its inhabitants.", "num_citations": "4\n", "authors": ["1195"]}
{"title": "Dealing with community data\n", "abstract": " As communities online grow, the set of techniques to store, analyze and understand their histories has not necessarily kept pace. This workshop is primarily designed to discuss what techniques are useful and interesting, and to share methodologies, for examining online communities. We will examine technical issues of storage mechanisms, examine both qualitative and quantitative analysis, and consider ways to feed back results of analysis into the community.", "num_citations": "4\n", "authors": ["1195"]}
{"title": "Computers, kids, and creativity: what does the future hold?\n", "abstract": " Our children are fast becoming one of the largest new user groups taking advantage of emerging technologies. How our children learn, play, and communicate are quickly changing. This panel will not ask the question whether technology will be a part of our children's lives. The panel participants believe this is a given. Instead, the panelists, professionals in developing new technologies for children, will consider the impact and possible changes that may be in store for our children and their future technologies. Once the panelists have offered brief statements on their visions of the future, children from the CHIkids program will be discussants and ask questions that concern them about the future of new technologies for children.", "num_citations": "4\n", "authors": ["1195"]}
{"title": "Evaluating the effectiveness of deplatforming as a moderation strategy on twitter\n", "abstract": " Deplatforming refers to the permanent ban of controversial public figures with large followings on social media sites. In recent years, platforms like Facebook, Twitter and YouTube have deplatformed many influencers to curb the spread of offensive speech. We present a case study of three high-profile influencers who were deplatformed on Twitter---Alex Jones, Milo Yiannopoulos, and Owen Benjamin. Working with over 49M tweets, we found that deplatforming significantly reduced the number of conversations about all three individuals on Twitter. Further, analyzing the Twitter-wide activity of these influencers' supporters, we show that the overall activity and toxicity levels of supporters declined after deplatforming. We contribute a methodological framework to systematically examine the effectiveness of moderation interventions and discuss broader implications of using deplatforming as a moderation strategy.", "num_citations": "3\n", "authors": ["1195"]}
{"title": "Get off my e-lawn: Mulching youth and technology\n", "abstract": " Social media is a blanket term used cover a range of sociotechnical systems that facilitate interactions between individuals. Primary examples of these systems include blogs, wikis, and social network sites.Youth, who are commonly defined as being between the ages of 12 and 17, and young adults, between the ages of 18 and 24 have been noted for their high rates of use of social media, in particular social network sites. Work by the Pew Internet & American Life project showed that in 2007, 61% of youth aged 12-17 used social network sites [1], while in 2009 only 35% of adults used social network sites, with the preponderance of those adults being in the 18-24 bracket [2].", "num_citations": "3\n", "authors": ["1195"]}
{"title": "Teens as designers of social networks\n", "abstract": " What happens when teens design their own social networks online? What kinds of communities will form and what patterns of participation might emerge? We are designing a series of workshops with Atlanta teens to teach them to build their own social networks using the website Ning. com. Our goal is to broaden participation on the Web by engaging teens as designers of social networks and to examine what the next generation of social networking sites might look like.", "num_citations": "3\n", "authors": ["1195"]}
{"title": "The effects of conversations with regulars and administrators on the participation of new users in a virtual learning community\n", "abstract": " Recent interest in synchronous collaborative learning environments prompts an examination of users' participation, social roles, and social interactions in these spaces. We analyze new users' participation rates on MOOSE Crossing, a collaborative educational environment that has been operating for over ten years. We examine how interactions with MOOSE Crossing regulars - highly active users who set the tone for the community - and its administrators, may influence the participation of new users. New users who conversed with regulars or administrators soon after joining are found to exhibit more social activity and stay involved with MOOSE Crossing longer than new users who did not. Regulars are apparently better at eliciting participation than administrators, but a synergistic effect is also detected - new users who interacted with both administrators and regulars exhibit especially high rates of participation.", "num_citations": "3\n", "authors": ["1195"]}
{"title": "Audience in computer learning: a constructionist interpretation\n", "abstract": " Adolescents often anticipate the reactions of other people in social situations. We believe this construction of imaginary audiences serves as a stimulant to youth engagement in activities and their abilities to become proficient in the use of technology. In this paper, we examine the role of audience at one Intel Computer Clubhouse, a radical constructionist learning environment.", "num_citations": "3\n", "authors": ["1195"]}
{"title": "Different Achievement in Online Oral History\n", "abstract": " The Internet has made it possible to incorporate adult mentors in the classroom in ways that it would have been difficult or impossible to do previously. As we move forward with such projects, it is important for us to consider what these adults contribute to the learning process. Palaver Tree Online is an online community that supports kids interviewing elders to build up a shared database of oral history. In this paper, we give a brief overview of two case studies of kids in Palaver Tree. In addition, we propose a new role for adults in aiding students having difficulty.", "num_citations": "3\n", "authors": ["1195"]}
{"title": "'Have you thought about…' talking about ethical implications of research\n", "abstract": " Considering the good and the bad effects of technology.", "num_citations": "2\n", "authors": ["1195"]}
{"title": "ProveIt: a new tool for supporting citation in MediaWiki\n", "abstract": " ProveIt is an extension to the Mozilla Firefox browser designed to support editors in citing sources in Wikipedia and other projects that use the MediaWiki platform.", "num_citations": "2\n", "authors": ["1195"]}
{"title": "Opening the black box: four views of transparency in remix culture\n", "abstract": " Opportunities for reuse, remix, and mashup creation online occur most felicitously when newcomers can easily learn to participate in the community. In this paper, we analyze four online communities: Jumpcut, MySpace, Newgrounds, and Facebook. Each of these sites is quite popular, but offers different kinds of opportunities for consumption and production of content. Specifically, the extent to which remixing is facilitated depends on transparency of process in the site. Providing visible accessibility of process facilitates a cognitive apprenticeship model of learning, where newcomers can come to participate as experts within the site. We examine how newcomers can learn to remix videos and cut and paste profile pages through observation, participation, and appropriation of remixed content. We suggest that sites that facilitate transparency of code and process may broaden access to casual users and enable them to more easily participate in remix culture.", "num_citations": "2\n", "authors": ["1195"]}
{"title": "Social and Technical Factors Contributing to Successful 3D Animation Authoring by Kids\n", "abstract": " Creating 3D animations has traditionally been restricted to adult experts. With the advent of easy-to-use software packages like Alice, we can now imagine animations being created by end users with no formal training in this area. Does this work in practice? Supporting real people in the successful use of complex multimedia authoring environments requires not only quality software, but also a supportive social context. What might such a supportive social context look like? In this paper, we report on a workshop in which seventeen children ages 11-12, working in pairs, were asked to make their own animations using Alice. Students were part of a language arts class studying fables, and were asked to retell a fable of their choice in 3D animation. This assignment proved to be an appropriate size and scope for the time available, skills of the students, and affordances of the software. The students found the assignment motivating, and their teacher was pleased with learning outcomes. We discuss social and technical factors that helped students create successful animated fables.", "num_citations": "2\n", "authors": ["1195"]}
{"title": "Exploring Video Game’s Relationship to CS Interest\n", "abstract": " The possible causal relationship between playing digital games and interest in computer science has been explored by researchers and outreach programs working on broadening participation in CS. This paper reviews empirical data from over 1,000 students at a technical university regarding their interest in CS and their frequency of game play. The data suggest that gaming is a significant, but small factor in students’ interest in CS.", "num_citations": "2\n", "authors": ["1195"]}
{"title": "Research issues in the design of online communities: report on the CHI 99 workshop\n", "abstract": " Online communities are rapidly becoming a part of how we work, play, and learn. But how are they designed? What is already known in this emerging field? What are the key questions for future research? These were the questions with which we began our CH199 workshop on\" Research Issues in the Design of Online Communities.\"", "num_citations": "2\n", "authors": ["1195"]}
{"title": "Building a community of history\n", "abstract": " This paper describes a virtual community tentatively entitled American Timewarp, which aims to bring kids and seniors together, both online and in person, to create shared historical artifacts. The beginnings of the project and future directions are discussed.", "num_citations": "2\n", "authors": ["1195"]}
{"title": "The Turing Game\n", "abstract": " Do men and women behave differently online? Can you tell how old someone is, or determine their race or national origin based on how they communicate on the internet? Issues of personal identity affect how we relate to others in everyday life, both online and offline. However, identity in this new medium is still poorly understood by internet users.An online environment, The Turing Game, helps internet users to explore these issues. 11,158 people used it over a one-year period. Players from 81 countries on all seven continents used the game to learn about issues of identity and diversity online through direct experience. We studied these interactions through logfile analysis, participant observation and qualitative interviewing. In this paper, we present an indepth discussion of a single evening in the environment. Our primary goal is to show how internet users learn about identity in this environment. Identity was once a concept reflected on primarily by scholars, but is increasingly a subject of fascination and concern for members of the general public. What concerns about identity do people bring to such a game? What are they curious about, and what do they find surprising? Is it possible to support a kind of philosophical play that promotes reflection by participants?", "num_citations": "2\n", "authors": ["1195"]}
{"title": "Digital Perfection.\n", "abstract": " Children are under constant pressure to excel, and the computer could be intensifying this pressure, fostering a generation who will never live up to their own expectations. This article argues that the solution is not to get rid of computers but to put less pressure on children, to encourage their interests but not expect them to be perfect.(PEN)", "num_citations": "2\n", "authors": ["1195"]}
{"title": "“Is This Okay?”: Copyright Engagement Among Online Content Creators\n", "abstract": " The Internet is a rich medium for a vast spectrum of creative activity, for which the raw material is a combination of original ideas and existing content. Many content creators engage with copyright law regularly, especially when making decisions about what is permissive in remix and appropriation. This is also an area of the law that is historically confusing and inconsistent. Where legal knowledge is imperfect, ethical intuitions and community norms often fill in the gaps, and content creators use online spaces to engage with one another about these issues and to make inquiries about what is and is not permissible. In these online communities, normal people with little knowledge of the letter of the law are asking and answering complex legal questions in the context of their creative work. By studying these interactions, what can we learn about how people engage with the law and how non-expert advice affects behavior and knowledge?", "num_citations": "1\n", "authors": ["1195"]}
{"title": "If we build it, will they come? Designing a community-based online site for parents\n", "abstract": " Parents are busy people. Designing social software for parents requires understanding the particular needs and constraints governing their lives. In this paper, we present a study of a community-based site called ParentNet. Based on prior formative work, ParentNet was designed to support parents in keeping up with their children’s social media use. With 10 months of deployment and 133 participants, ParentNet was successful in some regards and unsuccessful in others. Drawing from log data and focus groups, we arrive at three findings. First, parents may not easily switch from existing school communication platforms that they are already familiar with. Second, school support was critical for promoting adoption. Third, parents felt like they had too much technology in their lives and were not looking for more platforms to keep up with. We conclude with lessons for designing for parents and a discussion of technology overuse as a design constraint.", "num_citations": "1\n", "authors": ["1195"]}
{"title": "Kids Telling Fables Through 3D Animation\n", "abstract": " Creating 3D animations has traditionally been restricted to adult experts. With the advent of easy-to-use software packages like Alice, we can now imagine animations being created by end users with no formal training in this area. Does this work in practice? Supporting real people in the successful use of complex multimedia authoring environments requires not only quality software, but also a supportive social context. What might such a supportive social context look like? In this paper, we report on a workshop in which seventeen children ages 11-12, working in pairs, were asked to make their own animations using Alice. Students were part of a language arts class studying fables, and were asked to retell a fable of their choice in 3D animation. This assignment proved to be an appropriate size and scope for the time available, skills of the students, and affordances of the software. The students found the assignment motivating, and their teacher was pleased with learning outcomes. We discuss social and technical factors that helped students create successful animated fables.", "num_citations": "1\n", "authors": ["1195"]}
{"title": "Internet Research Ethics\n", "abstract": " In the mid-1990s, the Internet rapidly changed from a venue used by a small number of scientists to popular phenomena affecting all aspects of life in industrialized nations. Scholars from diverse disciplines have taken an interest in trying to understand the Internet and Internet users. However, as a variety of researchers have noted, guidelines for ethical research on human subjects written before the Internet's growth can be difficult to extend to research on Internet users. In this paper, I focus on one ethical issue: whether and to what extent to disguise material collected online in published accounts. While some people argue that vulnerable human subjects must always be made anonymous in publications for their own protection, others argue that Internet users deserve credit for their creative and intellectual work. Still others argue that much material available online should be treated as\" published,\" To attempt to …", "num_citations": "1\n", "authors": ["1195"]}
{"title": "The children's challenge: new technologies to support co-located and distributed collaboration\n", "abstract": " The popularity of Instant Messaging (IM) in online socializing has begun to migrate to use in the workplace. Many users are finding that the awareness and immediate contact that IM offers fills a missing niche in the technologies traditionally used in corporate settings to help keep colleagues connected over distance. Yet IM use in the workplace may have different design requirements than the online socializing context. This panel brings together representatives of some of the commercially popular IM systems and people who use IM in the workplace to raise the question of how the design of IM systems might need to evolve to meet the needs of workplace users.", "num_citations": "1\n", "authors": ["1195"]}
{"title": "The electronic scrapbook: knowledge representation and interface design for desktop video\n", "abstract": " Video is increasingly being manipulated on computer systems. Can an interface for video manipulation be made sufficiently simple and powerful to free the user's attention to focus on creative aspects of the medium? How are images to be described so that they can be retrieved? How is this representation to be presented to the user? Issues of knowledge representation and interface design are tightly linked.", "num_citations": "1\n", "authors": ["1195"]}