{"title": "Evolution of genes and genomes on the Drosophila phylogeny\n", "abstract": " Comparative analysis of multiple genomes in a phylogenetic framework dramatically improves the precision and sensitivity of evolutionary inference, producing more robust results than single-genome analyses can provide. The genomes of 12 Drosophila species, ten of which are presented here for the first time (sechellia, simulans, yakuba, erecta, ananassae, persimilis, willistoni, mojavensis, virilis and grimshawi), illustrate how rates and patterns of sequence divergence across taxa can illuminate evolutionary processes on a genomic scale. These genome sequences augment the formidable genetic tools that have made Drosophila melanogaster a pre-eminent model for animal genetics, and will further catalyse fundamental research on mechanisms of development, cell biology, genetics, disease, neurobiology, behaviour, physiology and evolution. Despite remarkable similarities among these Drosophila species, we identified many putatively non-neutral changes in protein-coding genes, non-coding RNA genes, and cis-regulatory regions. These may prove to underlie differences in the ecology and behaviour of these diverse species.", "num_citations": "2052\n", "authors": ["847"]}
{"title": "Discovery of functional elements in 12 Drosophila genomes using evolutionary signatures\n", "abstract": " Sequencing of multiple related species followed by comparative genomics analysis constitutes a powerful approach for the systematic understanding of any genome. Here, we use the genomes of 12 Drosophila species for the de novo discovery of functional elements in the fly. Each type of functional element shows characteristic patterns of change, or ‘evolutionary signatures’, dictated by its precise selective constraints. Such signatures enable recognition of new protein-coding genes and exons, spurious and incorrect gene annotations, and numerous unusual gene structures, including abundant stop-codon readthrough. Similarly, we predict non-protein-coding RNA genes and structures, and new microRNA (miRNA) genes. We provide evidence of miRNA processing and functionality from both hairpin arms and both DNA strands. We identify several classes of pre-and post-transcriptional regulatory motifs, and …", "num_citations": "679\n", "authors": ["847"]}
{"title": "Espnet: Efficient spatial pyramid of dilated convolutions for semantic segmentation\n", "abstract": " We introduce a fast and efficient convolutional neural network, ESPNet, for semantic segmentation of high resolution images under resource constraints. ESPNet is based on a new convolutional module, efficient spatial pyramid (ESP), which is efficient in terms of computation, memory, and power. ESPNet is 22 times faster (on a standard GPU) and 180 times smaller than the state-of-the-art semantic segmentation network PSPNet, while its category-wise accuracy is only 8% less. We evaluated EPSNet on a variety of semantic segmentation datasets including Cityscapes, PASCAL VOC, and a breast biopsy whole slide image dataset. Under the same constraints on memory and computation, ESPNet outperforms all the current efficient CNN networks such as MobileNet, ShuffleNet, and ENet on both standard metrics and our newly introduced performance metrics that measure efficiency on edge devices. Our network can process high resolution images at a rate of 112 and 9 frames per second on a standard GPU and edge device, respectively.", "num_citations": "399\n", "authors": ["847"]}
{"title": "Graphical user interface for display of anatomical information\n", "abstract": " A computer-aided diagnostic method and system provide image annotation information that can include an assessment of the probability, likelihood or predictive value of detected or identified suspected abnormalities as an additional aid to the radiologist. More specifically, probability values, in numerical form and/or analog form, are added to the locational markers of the detected and suspected abnormalities. The task of a physician using such a system as disclosed is believed to be made easier by displaying markers representing different regions of interest.", "num_citations": "227\n", "authors": ["847"]}
{"title": "Identification of transposable elements using multiple alignments of related genomes\n", "abstract": " Accurate genome-wide cataloging of transposable elements (TEs) will facilitate our understanding of mobile DNA evolution, expose the genomic effects of TEs on the host genome, and improve the quality of assembled genomes. Using the availability of several nearly complete Drosophila genomes and developments in whole genome alignment methods, we introduce a large-scale comparative method for identifying repetitive mobile DNA regions. These regions are highly enriched for transposable elements. Our method has two main features distinguishing it from other repeat-finding methods. First, rather than relying on sequence similarity to determine the location of repeats, the genomic artifacts of the transposition mechanism itself are systematically tracked in the context of multiple alignments. Second, we can derive bounds on the age of each repeat instance based on the phylogenetic species tree. We report …", "num_citations": "73\n", "authors": ["847"]}
{"title": "Automated registration of 3-D medical scans of similar anatomical structures\n", "abstract": " The invention provides a hierarchical method that is based on multi-scale computation and motion-tracking algorithms to register images. A hierarchical registration algorithm is used to address extrinsic and intrinsic variations. In particular, a global similarity transformation is applied to align anatomical structures in a global manner. Next, a local similarity transformation is applied to fine-tune and adjust internal details. The registration output provides the input necessary for other automated computations, such as volume and size comparisons and measurements.", "num_citations": "72\n", "authors": ["847"]}
{"title": "Interaction proxies for runtime repair and enhancement of mobile application accessibility\n", "abstract": " We introduce interaction proxies as a strategy for runtime repair and enhancement of the accessibility of mobile applications. Conceptually, interaction proxies are inserted between an application's original interface and the manifest interface that a person uses to perceive and manipulate the application. This strategy allows third-party developers and researchers to modify an interaction without an application's source code, without rooting the phone, without otherwise modifying an application, while retaining all capabilities of the system (eg, Android's full implementation of the TalkBack screen reader). This paper introduces interaction proxies, defines a design space of interaction re-mappings, identifies necessary implementation abstractions, presents details of implementing those abstractions in Android, and demonstrates a set of Android implementations of interaction proxies from throughout our design space …", "num_citations": "42\n", "authors": ["847"]}
{"title": "Grand challenges in accessible maps\n", "abstract": " In this forum we celebrate research that helps to successfully bring the benefits of computing technologies to children, older adults, people with disabilities, and other populations that are often ignored in the design of mass-marketed products. --- Juan Pablo Hourcade, Editor", "num_citations": "28\n", "authors": ["847"]}
{"title": "Is more autonomy always better? exploring preferences of users with mobility impairments in robot-assisted feeding\n", "abstract": " A robot-assisted feeding system can potentially help a user with upper-body mobility impairments eat independently. However, autonomous assistance in the real world is challenging because of varying user preferences, impairment constraints, and possibility of errors in uncertain and unstructured environments. An autonomous robot-assisted feeding system needs to decide the appropriate strategy to acquire a bite of hard-to-model deformable food items, the right time to bring the bite close to the mouth, and the appropriate strategy to transfer the bite easily. Our key insight is that a system should be designed based on a user's preference about these various challenging aspects of the task. In this work, we explore user preferences for different modes of autonomy given perceived error risks and also analyze the effect of input modalities on technology acceptance. We found that more autonomy is not always better …", "num_citations": "15\n", "authors": ["847"]}
{"title": "A pedestrian-centered data approach for equitable access to urban infrastructure environments\n", "abstract": " Crucial for a barrier-free city,  equitable pedestrian access  allows people with different abilities to independently access streets and services using relevant information. Pedestrians require both static and transient information regarding the street environment. Government stakeholders—such as municipalities, transportation agencies, and city planners—require accurate descriptions of the urban pedestrian environment to equitably carry out their mandates. However, pedestrian-centric data are generally unavailable in a standardized format, making it challenging to maintain and disseminate relevant information. In this paper, we describe these challenges in the context of AccessMap, a customizable routing solution for pedestrians with limited mobility. Because existing routing solutions do not account for most barriers to accessibility, the information needs of these users are largely unmet. Using AccessMap as a …", "num_citations": "14\n", "authors": ["847"]}
{"title": "Sig: Making maps accessible and putting accessibility in maps\n", "abstract": " Digital maps represent an incredible HCI success-they have transformed the way people navigate in and access information about the world. While these platforms contain terabytes of data about road networks and points of interest (POIs), their information about physical accessibility is commensurately poor. Moreover, because of their highly graphical nature and reliance on gesture and mouse input, digital maps can be inaccessible to some user groups (eg, those with visual or motor impairments). While there is active HCI work towards addressing both concerns, to our knowledge, there has been no direct effort to unite this research community. The goal of this SIG is threefold: first, to bring together and network scholars and practitioners who are broadly working in the area of accessible maps; second, to identify grand challenges and open problems; third, to help better establish accessible maps as a valuable …", "num_citations": "13\n", "authors": ["847"]}
{"title": "Urban sidewalks: visualization and routing for individuals with limited mobility\n", "abstract": " People with limited mobility in the US (defined as having difficulty or inability to walk a quarter of a mile without help and without the use of special equipment) face a growing informational gap: while pedestrian routing algorithms are getting faster and more informative, planning a route with a wheeled device in urban centers is very difficult due to lack of integrated pertinent information regarding accessibility along the route. Moreover, reducing access to street-spaces translates to reduced access to other public information and services that are increasingly made available to the public along urban streets. To adequately plan a commute, a traveler with limited or wheeled mobility must know whether her path may be blocked by construction, whether the sidewalk would be too steep or rendered unusable due to poor conditions, whether the street can be crossed or a highway is blocking the way, or whether there is a …", "num_citations": "12\n", "authors": ["847"]}
{"title": "A Community-Centered Design Framework for Robot-Assisted Feeding Systems\n", "abstract": " Robot-assisted feeding (RAF) systems offer enormous potential benefits to community-centered care-giving environments. However, developers of RAF technologies often focus on evaluating their standard transactional functionality, omitting the impact of such technologies in contexts that extend past the interaction of the robot and food receiver. RAF technologies have complex social, cultural and self-identity implications, since a\" meal\" extends well beyond the simple provisioning of nourishment. To better understand these implications we conducted a contextual inquiry in an assisted-living community with five potential care recipients and five caregivers, as well as interviews with fifteen domain experts including occupational therapists and feeding specialists. Based on our findings from these studies, we developed a new framework for RAF technologies that formulates this vital task as a community-centered …", "num_citations": "8\n", "authors": ["847"]}
{"title": "Stereo imagery based depth sensing in diverse outdoor environments: Practical considerations\n", "abstract": " Urban mapping for street-side environments (ie, sidewalk environments rather than auto-centric ones) is just one of many new applications requiring simultaneous object detection and localization in outdoor scenes. Automated mapping has focused on car environments in support of vehicle travel, though pedestrian infrastructure maps, historical structure maps and recreational trail maps are as important in supporting urban life. Unfortunately, many of the auto-centric automated approaches cannot be leveraged in other outdoor use cases due to challenging and cost-prohibitive depth sensing hardware involving LiDar sensors and large computing resources. Using depth-sensing stereo cameras is cost-efficient, but little information is available detailing the best uses and efficacy of different systems in diverse outdoor environments. Our review highlights the complexity of localizing objects in real outdoor …", "num_citations": "5\n", "authors": ["847"]}
{"title": "Mapping for accessibility: A case study of ethics in data science for social good\n", "abstract": " Ethics in the emerging world of data science are often discussed through cautionary tales about the dire consequences of missteps taken by high profile companies or organizations. We take a different approach by foregrounding the ways that ethics are implicated in the day-to-day work of data science, focusing on instances in which data scientists recognize, grapple with, and conscientiously respond to ethical challenges. This paper presents a case study of ethical dilemmas that arose in a \"data science for social good\" (DSSG) project focused on improving navigation for people with limited mobility. We describe how this particular DSSG team responded to those dilemmas, and how those responses gave rise to still more dilemmas. While the details of the case discussed here are unique, the ethical dilemmas they illuminate can commonly be found across many DSSG projects. These include: the risk of exacerbating disparities; the thorniness of algorithmic accountability; the evolving opportunities for mischief presented by new technologies; the subjective and value- laden interpretations at the heart of any data-intensive project; the potential for data to amplify or mute particular voices; the possibility of privacy violations; and the folly of technological solutionism. Based on our tracing of the team's responses to these dilemmas, we distill lessons for an ethical data science practice that can be more generally applied across DSSG projects. Specifically, this case experience highlights the importance of: 1) Setting the scene early on for ethical thinking 2) Recognizing ethical decision-making as an emergent phenomenon intertwined with the quotidian …", "num_citations": "4\n", "authors": ["847"]}
{"title": "Rethinking Semantic Segmentation Evaluation for Explainability and Model Selection\n", "abstract": " Semantic segmentation aims to robustly predict coherent class labels for entire regions of an image. It is a scene understanding task that powers real-world applications (e.g., autonomous navigation). One important application, the use of imagery for automated semantic understanding of pedestrian environments, provides remote mapping of accessibility features in street environments. This application (and others like it) require detailed geometric information of geographical objects. Semantic segmentation is a prerequisite for this task since it maps contiguous regions of the same class as single entities. Importantly, semantic segmentation uses like ours are not pixel-wise outcomes; however, most of their quantitative evaluation metrics (e.g., mean Intersection Over Union) are based on pixel-wise similarities to a ground-truth, which fails to emphasize over- and under-segmentation properties of a segmentation model. Here, we introduce a new metric to assess region-based over- and under-segmentation. We analyze and compare it to other metrics, demonstrating that the use of our metric lends greater explainability to semantic segmentation model performance in real-world applications.", "num_citations": "3\n", "authors": ["847"]}
{"title": "Toy Adaptation in Undergraduate Education and Outreach: An Initial Examination into Participant Experience and Perceptions\n", "abstract": " Heather Feldner received her BS in Human Biology and Master’s degree in Physical Therapy from Marquette University. She has been a practicing pediatric physical therapist for 16 years, and began teaching in the University of Illinois at Chicago’s DPT program in 2010. She became a board certified pediatric clinical specialist in 2012, completed her Assistive Technology Certificate from UIC in 2015, and earned her PhD in Disability Studies from UIC in 2016. She joined the University of Washington’s Department of Mechanical Engineering as a postdoctoral researcher in September of 2016. Heather has a special interest in user-centered design and participatory research, and has been a lab member of the GoBabyGo program, which creates custom safety and accessibility modifications to commercially available battery powered toy ride-on cars for children with disabilities, since 2012. Heather’s research focuses on investigating the impact of traditional and alternative mobility technologies on the experiences of people with disabilities and their families, and the direct and indirect influences of physical and social environments, technology design, industry, and disability orientation on those experiences.", "num_citations": "3\n", "authors": ["847"]}
{"title": "AccessMap Website Demonstration: Individualized, Accessible Pedestrian Trip Planning at Scale\n", "abstract": " Despite significant heterogeneity in pedestrian mobility, maps and trip planning services have traditionally treated pedestrians as a monolithic, limited extension to street traffic-centric approaches. Here, we present a demonstration of the AccessMap website, an open source, city-scale, interactive web map based on open data that provides individualized pedestrian infrastructure information and automatic trip planning services. Via the AccessMap website, customizable settings instigate real-time visual feedback of infrastructure accessibility and are used to automatically generate bespoke trip plans via an open API.", "num_citations": "2\n", "authors": ["847"]}
{"title": "Homology mapping with Markov random fields\n", "abstract": " 1 Background.Evolution through divergence gives rise to different, though related, present-day genomes that shared common ancestors. Portions of genomes could be seen as genomic entities spawned through some dynamic changes in content and order of the ancestral genome. Certain regions, through selection, are conserved over time. Such genomic portions (be they gene-coding regions, conserved non-coding regions, etc.) that are related due to their derivation from the same element in a common ancestral genome are termed homologs. Comparative genomic techniques aim to infer genome organization and structure, as well as the evolutionary mechanisms that shaped present day genomes. Since much of our understanding of evolution comes from a comparative framework, it is important to accurately identify homologs in order to compare components that are actually linked by common ancestry. The challenge in pairwise and multiple sequence comparison is to develop methods that are both biologically relevant (ie, that account for the multitude of known evolutionary mechanisms) and that are also statistically sound (ie, there should be a meaningful framework within which to compare alignments, and with which to evaluate the significance of an alignment). Furthermore, methods need to be practical for whole genome comparison.", "num_citations": "2\n", "authors": ["847"]}
{"title": "Towards routine, city-scale accessibility metrics: Graph theoretic interpretations of pedestrian access using personalized pedestrian network analysis\n", "abstract": " A wide range of analytical methods applied to urban systems address the modeling of pedestrian behavior. These include methods for multimodal trip service areas, access to businesses and public services, diverse metrics of “walkability”, and the interpretation of location data. Infrastructure performance metrics in particular are an increasingly important means by which to understand and provide services to an urbanizing population. In contrast to traditional one-size-fits all analyses of street networks, as more detailed pedestrian-specific transportation network data becomes available, the opportunity arises to model the pedestrian network in terms of individual experiences. Here, we present a formalized and city-scale framework, personalized pedestrian network analysis (PPNA), for embedding and retrieving pedestrian experiences. PPNA enables evaluation of new, detailed, and open pedestrian transportation network data using a quantitative parameterization of a pedestrian’s preferences and requirements, producing one or more weighted network(s) that provide a basis for posing varied urban pedestrian experience research questions, with four approaches provided as examples. We introduce normalized sidewalk reach (NSR), a walkshed-based metric of individual pedestrian access to the sidewalk network, and sidewalk reach quotient (SRQ), an estimate of inequity based on comparing the normalized sidewalk reach values for different pedestrian profiles at the same location. Next, we investigate a higher-order and combinatorial research question that enumerates pedestrian network-based amenity access between pedestrians. Finally …", "num_citations": "1\n", "authors": ["847"]}
{"title": "Engagement in Practice: Toy Adaptation for Children with Disabilities: Engaging the Community through Educational Outreach and Toy Donation\n", "abstract": " Play is critical in cognitive, physical, and social development in childhood. However, many offthe-shelf toys are inaccessible to a diverse population of users with disabilities thereby excluding them from realizing these same benefits. Toy adaptation, a process of installing a universal activation port into battery-operated children’s toys, addresses a community need for accessible play technology, as it allows for toys to be activated via alternative switches that better meet the needs of the user. Over the last two years, HuskyADAPT (Accessible Design And Play Technology) at the University of Washington has built a sustainable architecture for toy adaptation and distribution to increase community awareness and improve the accessibility of adapted toys in Washington. This paper describes lessons learned and best practices in engaging the community through toy adaptation in two contexts: 1) education outreach and 2) toy donation to families, clinics, and schools.", "num_citations": "1\n", "authors": ["847"]}