{"title": "An effective approach for software project effort and duration estimation with machine learning algorithms\n", "abstract": " During the last two decades, there has been substantial research performed in the field of software estimation using machine learning algorithms that aimed to tackle deficiencies of traditional and parametric estimation techniques, increase project success rates and align with modern development and project management approaches. Nevertheless, mostly due to inconclusive results and vague model building approaches, there are few or none deployments in practice.The purpose of this article is to narrow the gap between up-to-date research results and implementations within organisations by proposing effective and practical machine learning deployment and maintenance approaches by utilization of research findings and industry best practices. This was achieved by applying ISBSG dataset, smart data preparation, an ensemble averaging of three machine learning algorithms (Support Vector Machines …", "num_citations": "108\n", "authors": ["1235"]}
{"title": "Modele jakości produktów i procesów programowych\n", "abstract": " Podjęto próbę uporządkowania modeli jakości produktów i procesów programowych, zaproponowano własny model jakości produktu oraz autorski schemat ewaluacji istniejących modeli oceny procesów. Dokonano usystematyzowania różnych definicji jakości, szczególnie w odniesieniu do produktu programowego. Opracowano schemat ewolucji nastawienia wytwórcy i nabywcy wobec jakości oprogramowania. Opisano budowę typowych modeli jakości technicznej oprogramowania. Przedstawiono przykłady modeli jakości oprogramowania. Omówiono problemy i najważniejsze cechy jakości oprogramowania, zarządzanie jakością procesów programowych. Dokonano przeglądu metod oceny i doskonalenia procesów programowych oraz ich konfrontacji przy wykorzystaniu schematu porównawczego MCS. Przedstawiono także relacje między procesami a produktami programowymi.", "num_citations": "35\n", "authors": ["1235"]}
{"title": "ISO/IEC 9126–Analiza modelu jakości produktów programowych\n", "abstract": " W minionym ćwierćwieczu powstało kilka modeli jakości technicznej oprogramowania. WyróŜniają one najistotniejsze atrybuty jakości (charakterystyki), atrybuty podrzędne (podcharakterystyki) i miary (metryki) oprogramowania. W pracy przedstawiono ogólną budowę modeli jakości oprogramowania i zaprezentowano historię powstania i budowę modelu opisanego w normie międzynarodowej ISO/IEC 9126.", "num_citations": "13\n", "authors": ["1235"]}
{"title": "Internet przedmiotów: szanse i zagrożenia\n", "abstract": " Od kiedy na przełomie lat 2008/2009 liczba urządzeń podłączonych do Internetu przekroczyła liczbę mieszkańców Ziemi uznaje się, że mamy do czynienia z Internetem przedmiotów (rzeczy). Połączenie z jedną heterogeniczną sieć ta dużej liczby inteligentnych obiektów stwarza niedostępne dotychczas możliwości. z drugiej strony, niesie też zagrożenia szczególnie dotyczące bezpieczeństwa i utraty prywatności. Powstaje też kwestia wielu innych problemów, które wymagają rozwiązania (np. standaryzacji). Celem pracy jest prezentacja możliwości i korzyści, jakie są do uzyskania w efekcie wdrożenia koncepcji Internetu przedmiotów, jak również potencjalnych zagrożeń i wyzwań, jakie są z tym związane.(abstrakt autora)", "num_citations": "11\n", "authors": ["1235"]}
{"title": "Quality management reference models for Business Intelligence–class Systems\n", "abstract": " The issue of software quality in Business Intelligence (BI) systems presents challenges of far greater complexity than in the case of typical software applications the code of which software developers are most commonly tasked with writing. In the latter case, quality evaluation can be based on the quality of the resulting software product itself. Products designed for Business Intelligence class systems, however, are much more complex in character as they include not only software products, but also final products (analytical reports), which are created in codeless mode. In both instances, the quality of final products is also influenced by the quality of intermediate products (analysis and project documentation), the creation of which is usually aided through the use of CASE tools. The purpose of the present article is to demonstrate the results of research projects which endeavoured to evaluate the quality of BI products by constructing reference models. The endeavours referred to above were made in cooperation with the architects of BI-class solutions.", "num_citations": "8\n", "authors": ["1235"]}
{"title": "Miary oprogramowania\n", "abstract": " Miary oprogramowania × Close The Infona portal uses cookies, ie strings of text saved by a browser on the user's device. The portal can access those files and use them to remember the user's data, such as their chosen settings (screen view, interface language, etc.), or their login data. By using the Infona portal the user accepts automatic saving and using this information for portal operation purposes. More information on the subject can be found in the Privacy Policy and Terms of Service. By closing this window the user confirms that they have read the information on cookie usage, and they accept the privacy policy and the way cookies are used by the portal. You can change the cookie settings in your browser. I accept Polski English Login or register account remember me Password recovery INFONA - science communication portal INFONA Search advanced search Browse series books journals articles …", "num_citations": "5\n", "authors": ["1235"]}
{"title": "Application of function points and data mining techniques for software estimation-a combined approach\n", "abstract": " Project estimation is recognized as one of the most challenging processes in software project management on which project success is dependable. Traditional estimation methods based on expert knowledge and analogy tend to be error prone and deliver overoptimistic assessments. Methods derived from function points are good sizing tools but do not reflect organizations’ specific project management culture. Due to those deficiencies in recent years data mining techniques are explored as an alternative estimation method. The aim of this paper is to present a combined approach of functional sizing measurement and three data mining techniques for effort and duration estimation at project early stages: generalized linear models, artificial neural networks and CHAID decision trees. The estimation accuracy of these models is compared in order to determine their potential usefulness for deployment within …", "num_citations": "4\n", "authors": ["1235"]}
{"title": "Wzorcowy program studiów licencjackich kierunku informatyka ekononomiczna–koncepcja wstępna\n", "abstract": " This work has been initiated bu the NTIE (National Association of Business Informatics) that is heading to make considerabe effort to engage the broader busines informatics community in a dialog to promote Business Informatics as a scientific discipline and to improve educational programs. This article is an attempt to sketch the curricula guidelines for undergraduate study in Business Informatics. In the article the current curricula in Business Informatics at the leading Polish universities of economics have been described and analyzed. To provide concrete guidance on curricular structure and future developments the proposition of undergraduate study has been presented with a few exemples of actual core courses.", "num_citations": "4\n", "authors": ["1235"]}
{"title": "Produkty i procesy programowe-dwa punkty widzenia na ocenę jakości oprogramowania\n", "abstract": " Z niedostateczną jakością produktów programowych stykamy się na każdym kroku. Produkty programowe są efektem realizacji procesów programowych. W pracy krótko zaprezentowano sposoby oceny jakości produktów programowych w konfrontacji z metodami oceny procesów programowych. Przedstawione zostały argumenty w dyskusji, co jest ważniejsze-dobra jakość produktów, czy też procesów programowych.(abstrakt oryginalny)", "num_citations": "4\n", "authors": ["1235"]}
{"title": "Definiowanie jakości produktu programowego-podejście ewolucyjne\n", "abstract": " Pojęcie jakości jest trudne do jednoznacznego zdefiniowania. W pracy przedstawiono wiele definicji jakości: idealną, techniczną, marketingową, ukierunkowaną na odbiorcę, producenta i wartość. Każdą z definicji omówiono w kontekście produkcji oprogramowania. Od lat odbiorcy oprogramowania narzekają na niedotrzymywanie przez producentów kosztorysu i harmonogramu, a także kwestionują jakość dostarczonego produktu, natomiast wytwórcy narzekają na trudności w wyspecyfikowaniu wymagań i późniejsze ciągłe zmiany wymagań przez klienta. Wiele nieporozumień dotyczących jakości dostarczanego produktu można uzasadnić odmiennym pojmowaniem jakości przez obie zainteresowane strony (klienta i producenta), ewoluującym w trakcie przebiegu prac rozwojowych.(abstrakt oryginalny)", "num_citations": "4\n", "authors": ["1235"]}
{"title": "Standardy oceny i doskonalenia procesów produkcji oprogramowania-próba porównania\n", "abstract": " A software product is often behind schedule, over budget, non-conforming to requirements and of poor quality. Controlling and improving the processes used to develop software has been proposed as a primary remedy to these problems. Companies ready to start an improvement program have to select software process improvement method from a number of different approaches. Four most popular standards: ISO 9001 and 9000-3, Capability Maturity Model (CMM), BOOTSTRAP and ISO/IEC 15504 (SPICE-Software Process Improvement and Capability dEtermination) are summarized and compared below.(original abstract)", "num_citations": "4\n", "authors": ["1235"]}
{"title": "ZASTOSOWANIE TECHNIK EKSPLORACJI DANYCH DO ESTYMACJI PRACOCHàONNOĝCI PROJEKTÓW INFORMATYCZNYCH\n", "abstract": " W dzisiejszym Ğwiecie opartym na wiedzy, informacja stanowi o przewadze konkurencyjnej i decyduje o szybkoĞci adaptacji do wymagaĔ rynku. W ostatnich latach techniki pozyskiwania wiedzy, takie jak eksploracja danych (ang. data mining), znalazáy powszechne zastosowanie w róĪnorodnych dyscyplinach jako narzĊdzia wsparcia procesu decyzyjnego, dostarczając kluczowych informacji zarządczych. Są one wykorzystywane w szczególnoĞci do problematyki, gdzie wystĊpuje duĪa niepewnoĞü i prawdopodobieĔstwo zaistnienia niekorzystnych zjawisk. W odniesieniu do zarządzania projektami informatycznymi, techniki eksploracji danych umoĪliwiają szeroki zakres zastosowaĔ, w tym przede wszystkim do rozwiązywania problemów pojawiających siĊ w początkowych fazach przedsiĊwziĊü informatycznych, a związanych z planowaniem zasobów niezbĊdnych do zakoĔczenia projektu sukcesem. Celem tego artykuáu jest przedstawienie moĪliwoĞci zastosowania algorytmów data mining do estymacji pracocháonnoĞci inicjatyw informatycznych we wstĊpnych etapach realizacji projektów, gdy informacja o wytwarzanym produkcie koĔcowym jest niepeána. W pracy dokonano porównania dokáadnoĞci szacunków otrzymanych przy pomocy trzech powszechnie uznawanych za efektywne technik predykcyjnych: ogólnych modeli liniowych, sieci neuronowych i drzew decyzyjnych CHAID. Omówiono moĪliwoĞü wdroĪenia tych technik w praktyce, jako narzĊdzi wsparcia decyzyjnego.", "num_citations": "3\n", "authors": ["1235"]}
{"title": "Ewolucja norm jakości produktu programowego\n", "abstract": " Kwestia jakości oprogramowania budzi wiele kontrowersji: wprawdzie wszyscy oczekują oprogramowania dobrej jakości, ale poszczególne grupy zainteresowanych osób mogą różnić się swym stosunkiem do problemu jakości. Dla niektórych użytkowników dobrym jakościowo oprogramowaniem jest to, które jest niezawodne i rzadko ulega awariom, dla innych istotne jest, by było intuicyjne w użyciu i przyjazne, jeszcze inni zwracają szczególną uwagę na to, by było dobrze dostosowane do ich potrzeb, zapewniając odpowiedni zestaw funkcjonalności. Użytkownicy, których dotyczą ograniczenia finansowe, chcą, aby nie wiązały się z nim wygórowane wymagania sprzętowe i aby działało szybko nawet na gorszym sprzęcie, a dodatkowo, by było tanie, a jeszcze lepiej bezpłatne. Niektóre osoby, szczególnie uwrażliwione na kwestię prywatności, mogą uznać, że najważniejsze w oprogramowaniu jest to, by było ono bezpieczne. Z kolei osoby, których zakres obowiązków obejmuje konserwację (pielęgnację, utrzymanie, ang. maintenence) oprogramowania, mogą uważać, że dobrym jakościowo oprogramowaniem jest takie, które jest łatwe w utrzymaniu-łatwo się z niego usuwa zgłaszane błędy, dostosowuje je do zmieniających uwarunkowań zewnętrznych (zmian w prawie, zmian sprzętu i oprogramowania systemowego), wbudowuje w nie nowe funkcjonalności.(fragment tekstu)", "num_citations": "3\n", "authors": ["1235"]}
{"title": "The Simulation of Software Processes in the Integrated Computer Environment in the Case of Telco Sector\n", "abstract": " In the paper the examples of software process simulations in an integrated IT environment are described. All examples come from an integrated IT environment in one of the biggest Polish firms in TELCO sector. Simulation models description is based on BPMN standard and ARIS Business Simulator was used as a tool to conduct experiments. These models describe the process of introducing a new product/service to the integrated IT environment. Models can be used to mold the behavior of the environment in case of any changes to it, as well as to optimize parameters such as processes execution times, waiting times for the event initiating an instance of the process, resources and costs due the process.", "num_citations": "3\n", "authors": ["1235"]}
{"title": "Software Measurement\n", "abstract": " The pressure for more efficient software development and maintenance processes, delivering appropriate quality software within a certain budget and time frame, is constantly increasing. Software measurement is a key tool in helping to manage and to control software development and maintenance projects. Measurement is essential to any engineering activity, by increasing the scientific and technical knowledge for both the practice of software development and maintenance and for empirical research in software technology. For this reason, there appeared a need to organize a forum where new ideas from the world of academic research on software measurement could meet up with practical improvements from industry. The IWSM Mensura conference is the result of the joining of forces of the International Workshop on Software Measurement (IWSM) and the International Conference on Software Process and …", "num_citations": "2\n", "authors": ["1235"]}
{"title": "The Relationships between Software Development Processes and Software Product Quality\n", "abstract": " The main motivation for software process assessment and improvement (i.e. performed in accordance with standard ISO/IEC 15504) is that the software product, developed according to improved processes, will be of higher quality (determined by ISO/IEC 25010). ISO/IEC 15504 refer to the ISO/IEC 12207 which describes processes performed in software acquiring or developing organizations. The relations between software processes and quality characteristics seem intuitive but there is little empirical evidence to prove its validity. The paper describes the first stage of research where practitioners try to find and explain relationships between software quality characteristics (ISO/IEC 25010) and software life cycle processes (ISO/IEC 12207). The motivation for the research lies in the assumption that if the acquirer is particularly interested in a certain quality characteristic of the product, the supplier may put …", "num_citations": "2\n", "authors": ["1235"]}
{"title": "Modele referencyjne zarządzania jakością w systemach klasy Business Intelligence\n", "abstract": " Problem jakości oprogramowania w systemach klasy Business Intelligence (BI) jest zagadnieniem bardziej złożonym niż w typowych aplikacjach, w których programiści piszą kod. W tym drugim przypadku jakość powstałego produktu można zweryfikować poprzez oceną jakości powstałego oprogramowania. Jednakże produkty dla systemów klasy Business Intelligence mają charakter bardziej złożony, bowiem zawierają nie tylko produkty programowe, ale także produkty końcowe (raporty analityczne), które tworzone są w trybie bezkodowym. W obu przypadkach na jakość produktów końcowych wpływa również jakość produktów pośrednich (dokumentów analizy i projektu), które tworzone są zazwyczaj przy wsparciu narządzi CASE. Celem artykułu jest przedstawienie rezultatów prac badawczych, w których dokonano próby rozwiązania problemu oceny jakości produktów BI, poprzez budową modeli referencyjnych. Próbą tą podjęto we współpracy z twórcami rozwiązań klasy BI.(abstrakt oryginalny)", "num_citations": "2\n", "authors": ["1235"]}
{"title": "Agregatory wiadomości-remedium na przeładowanie informacyjne?\n", "abstract": " Internet, which is a tremendous resource of information is growing constantly. This leads to information overload, when people are not able to control the excess of available content. One of the solutions to the problem are news aggregators–tools that filter news from multiple web sources and present selected information in one place. The selection process is carried out by journalists supported by the machine learning algorithms, which leads to personalize content presented to the particular customers.", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Rola i zasięg standardów w rozwoju oprogramowania\n", "abstract": " Standaryzacja w naszym codziennym życiu jest niedostrzegalna. Ale chociaż tak się do niej przyzwyczailiśmy, że jej nie zauważamy, to jest ona obecna we wszystkich aspektach naszej egzystencji. Jej zawdzięczamy przystępne ceny, prostotę obsługi, przewidywalność, bezpieczeństwo. Kiedy kupujemy komputer od dowolnego z setek dostawców, to możemy mieć pewność, że da się na nim zainstalować nasz ulubiony system operacyjny. Kiedy dostaniemy plik w formacie RTF, to możemy mieć pewność, że da się przeczytać przy pomocy dowolnego edytora tekstów. Kiedy kupujemy żarówkę z dużym gwintem, to mamy pewność, że będzie pasowała do naszej przedwojennej jeszcze lampy. Kiedy jedziemy samochodem-ufamy, że inni użytkownicy drogi, podobnie jak i my, będą się zachowywać w sposób ustandaryzowany, opisany w ustawie, nie powodując zagrożenia. Standaryzacja jako koncepcja rozwoju cywilizacji od setek lat wykazuje swoją skuteczność i stała się kluczem do postępu (fragment tekstu)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Cloud Computing and Economic Growth in the Baltic Sea Region Countries\n", "abstract": " For small and medium-size enterprises cloud computing (CC) delivers ICT resources flexibly, depending on required needs. Analysis of data from the Baltic Sea Region countries indicates that the prevalence of the CC model can contribute to higher economic growth. At the same time SMEs are asking many questions whose answers we do not know so far, but in the near future we will have to answer them.", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Ewolucja trendów w rankingach nowych technologii\n", "abstract": " Celem artykułu jest analiza roli, jaką odgrywają publikowane prognozy dotyczące dalszego kierunku rozwoju informatyki i najbardziej obiecujących technologii. Uzasadnia się, że mogą być one bardzo przydatne podczas realizacji procesu zarządzania strategicznego w większości organizacji, aw szczególności w działaniach CIO. Wskazuje się również, które z technologii z list z lat ubiegłych nie były efemerydami i okazały się na tyle trwałe, że w przekonaniu autora można je uznać za\" megatrendy technologiczne\".(fragment tekstu)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Fenomen CLOUD COMPUTINGU\n", "abstract": " Istnieje wiele zalet rozwiązań opartych na idei cloud computingu. Niewątpliwie spowodują one, że podejście to będzie zdobywało coraz większą popularność. Już dzisiaj większość z nas korzysta z bezpłatnych rozwiązań tego typu, np. Gmail lub Google Apps. Powszechność dostępu do szerokopasmowego Internetu z jednej strony, az drugiej-bezustannie rosnąca ilość usług i aplikacji udostępnianych poprzez sieć powoduje, że coraz łatwiej wyobrazić sobie sytuację, kiedy to na wykorzystywanych przez nas komputerach nie ma zainstalowanego oprogramowania aplikacyjnego, a dane przechowywane są w zdalnie dostępnych centrach danych; PC-ty stają się terminalami, z których uzyskujemy dostęp do zdalnie wykonywanych programów i gromadzonych danych. Ale trzeba zdawać sobie sprawę z tego, że idea zcentralizowanego dostępu do danych i programów nie jest nowa-od niej rozpoczęła się historia komercyjnego wykorzystywania komputerów. Historia zatoczyła krąg i rozwiązania sprzed pół wieku w zmodyfikowanej formie uważane są za nowatorskie. Inną sprawą jest sam termin cloud computing, wraz z wariantami IaaS, PaaS i SaaS. Pojawił się około dówch lat temu, zyskał znaczną popularność, a jak zostało wykazane w artykule-zadziwiająco szybko wyparł dotychczas stosowane pojęcia computing on-demand, utility computing i ASP. Budzi to nieodparte podejrzenie, że więcej w tym PR-u niż kwestii merytorycznych.(fragment tekstu)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Problematyka złożoności w budowie systemów oprogramowania\n", "abstract": " Zaprezentowano słownikową definicję pojęcia złożoności, a następnie przedstawiono różnice złożoności przejawiane przez produkty materialne w konfrontacji z produktami programowymi, praktyczne konsekwencje złożoności oprogramowania, a także różne sposoby postrzegania problemu złożoności i metody jej ograniczenia.(fragm. wstępu)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Porównanie ciągłych i etapowych modeli oceny i doskonalenia procesów programowych\n", "abstract": " Celem pracy jest porównanie oraz ukazanie cech charakterystycznych, zalet i wad obu typów modeli: etapowych i ciągłych.(fragment tekstu)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Dekompozycja atrybutu\" łatwość konserwacji\" produktu programowego\n", "abstract": " W procesie wytwórczym dedykowanego produktu programowego, kiedy po przejściu testów akceptacyjnych oprogramowanie trafia do klienta, albo w przypadku produktu sprzedawanego na skalę masową–po przejściu testów beta, produkt wprowadzany jest do dystrybucji, dla twórców oprogramowania rozpoczyna się etap konserwacji (pielęgnacji, utrzymania, ang. maintenance). Wszystkie zmiany dokonane od tej pory w produkcie programowym1 zaliczają się do działań konserwacyjnych.", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Schemat porównawczy modeli oceny i doskonalenia procesów programowych\n", "abstract": " Do oceny realizacji oraz doskonalenia procesów programowych w organizacjach wytwarzających oprogramowanie stosowanych jest wiele modeli: ISO 9000, CMM, BOOTSTRAP, Trillium, ISO/IEC 15504, kryteria nagród jakości i in. Przed organizacją decydującą się na poddanie procesowi audytu stoi problem wyboru modelu, który byłby najodpowiedniejszy w jej sytuacji. W pracy zaproponowano schemat pozwalający dokonać porównania wielu alternatywnych modeli, ułatwiający organizacji podjęcie decyzji co do modelu, który ma zastosować.(abstrakt oryginalny)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Jakość oprogramowania-modele oceny\n", "abstract": " Jeśli odbiorca chce być pewien (lub przynajmniej zwiększyć prawdopodobieństwo), że nabędzie zadowalający go produkt programowy, powinien na wstępie wyszczególnić wymagania jakościowe, czyli podać dostateczne natężenie wszystkich lub najistotniejszych dla niego atrybutów jakościowych. Ten zbiór parametrów (wartości charakterystyk) składa się na jakość techniczną produktu programowego. W minionym ćwierćwieczu powstało kilka modeli jakości, które opisują powiązania tych charakterystyk i związki pomiędzy nimi. Celem pracy jest opis trzech najszerzej znanych z literatury światowej modeli jakości technicznej produktów programowych. Wszystkie one zakładają statyczną budowę modelu i mają podobna budowę.(fragment tekstu)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Porównanie programu nauczania informatyki gospodarczej w Szkole Głównej Handlowej w Warszawie z modelowym Curriculum IS 2002\n", "abstract": " Porównano program nauczania dla kierunku Systemy Informacyjne realizowanym w Szkole Głównej Handlowej z nowym, modelowym curriculum IS 2002, stworzonym w ramach współpracy przez ACM, AIS i AITP.", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Ewaluacja modyfikowalności oprogramowania\n", "abstract": " Modyfikowalność oprogramowania (ang. maintainability) jest jednym z podstawowych atrybutów jakości oprogramowania. Atrybut ten jest pierwotnie kształtowany w trakcie tworzenia oprogramowania, a później zmieniany w fazie utrzymania. Artykuł ten stanowi próbę analizy moŜliwości kontrolowania atrybutu modyfikowalności we wszystkich fazach cyklu Ŝycia oprogramowania, ze szczególnym uwzględnieniem projektowania architektonicznego. Zaprezentowane są przykładowe miary poszczególnych charakterystyk tego atrybutu jakości.", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Koncepcja\" dostatecznie dobrej jakości\" w praktyce wytwarzania oprogramowania\n", "abstract": " W ostatniej dekadzie znaczną popularność zdobyło pojęcie\" dostatecznie dobrej jakości\" w odniesieniu do oprogramowania. Oznacza ono oddawanie klientom do użytku oprogramowania, w którym znajdują się znane błędy. Postawa taka z punktu widzenia dotychczasowej praktyki wytwarzania oprogramowania była niedopuszczalna, natomiast ostatnio znacznie się rozpowszechniła. Autor wyjaśnia, że konflikt między zwolennikami dotychczasowego a nowego podejścia wynika z odmiennego pojmowania pojęcia\" jakość\". Nowe podejście da się logicznie uzasadnić na gruncie teorii ekonomii oraz rachunku kosztów jakości.(abstrakt oryginalny)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "Utrzymalność oprogramowania\n", "abstract": " Utrzymanie oprogramowania (ang. software maintenance) jest jednym z procesów cyklu życia systemu. Prace wykonywane w ramach tego procesu trwają najdłuższy okres czasu. Koszty tych prac mogą się kształtować różnie w zależności od wielu czynników. Czynniki kształtujące je można sklasyfikować na zewnętrzne i wewnętrzne. Wewnętrzne stanowią o możliwościach łatwej modyfikacji systemu w celu ulepszenia go lub dostosowania do zmieniającego się otoczenia gospodarczego. Własność ta określana jest terminem utrzymalność oprogramowania (ang. maintainability).(abstrakt oryginalny)", "num_citations": "1\n", "authors": ["1235"]}
{"title": "ISO/IEC 15504 (SPICE)-analiza modelu oceny i doskonalenia procesów programowych\n", "abstract": " W artykule opisano i przeanalizowano model SPICE (ISO/IEC 15504). Dotyczy on oceny i poprawności procesów programowania.", "num_citations": "1\n", "authors": ["1235"]}