{"title": "Is requirements engineering useless in game development?\n", "abstract": " [Context/motivation] Game development is characterized by a high level of creativity when compared to other fields of software development. Games cover a multitude of themes and genres, and represent a heterogeneous group of different products with varying requirements and business goals. [Question/problem] Requirements engineering (RE) should be relevant to game development, but is this true and if it is, how does game industry apply RE in practice? [Principal ideas/Results] We interviewed 27 software professionals in seven organizations to understand how requirements engineering is applied in game developing organizations. The results suggest that in game development business practicalities and drive for “fun” dominate the areas associated with requirements engineering. Additionally, game development organizations apply approaches and methods that are comparable to …", "num_citations": "42\n", "authors": ["1540"]}
{"title": "What do we know about software product management?-a systematic mapping study\n", "abstract": " Software product management (SPM) offers tools and practices for achieving business goals of a company as well as for increasing the predictability and profitability of software product development. Despite the importance of this topic, the studies of SPM have this far been fragmented. The goal of the present study is to summarize the existing knowledge in software product management and identify the areas which need further research. The paper reports the conduct and the results of a systematic mapping study which identified 25 studies on SPM. Still, most of the papers had only hypotheses and theories that were not empirically confirmed or the confirmation was based on a small set of cases. The existing knowledge of software product management consists of small and unconnected pieces. In addition to this, our specific interest, software product management in the cloud environment has not been studied at …", "num_citations": "39\n", "authors": ["1540"]}
{"title": "Lean solutions to software product management problems\n", "abstract": " Although the discipline of software product management plays an important role in the development of successful products, each company adopts its practices in its own way. Regardless of variations, companies face common problems. This article identifies five problems that lean principles to software product management can help organizations avoid or solve.", "num_citations": "26\n", "authors": ["1540"]}
{"title": "Open government data in russian federation\n", "abstract": " Open data can increase transparency and accountability of a country government, leading to free information sharing and stimulation of new innovations. This paper analyses government open data policy as well as open data initiatives and trends in Russian Federation. The OCDE analytical framework for national open government data portals and supporting initiatives is used as the bases for the study. The key issues of Russian open government data movement are summarized and aggregated. The paper argues the necessity of systematic development of the open data ecosystem, the leading role of the government in data release, a deeper business involvement, and a reduction of bureaucratic barriers.", "num_citations": "23\n", "authors": ["1540"]}
{"title": "What are the roles of software product managers? An empirical investigation\n", "abstract": " Software product management covers both technical and business activities to management of products like roadmaps, strategic, tactical, and release planning. In practice, one product manager is seldom responsible for all these activities but several persons share the responsibilities. Therefore, it is important to understand the boundaries of product managers’ work in managing software products, as well as the impact a product manager has on the company business. The purpose of the study is to clarify what roles of software product managers exist and understand how these roles are interrelated with each other and the whole structure and business of an organization. The study is designed as an interpretative qualitative study using grounded theory as the research method. Based on the gathered data we developed a framework that reveals the role of a product manager in the organization and shows how this …", "num_citations": "23\n", "authors": ["1540"]}
{"title": "What do practitioners mean when they talk about product management?\n", "abstract": " This industrial experience paper presents the results of a survey with an open-ended question designed to clarify how product management practitioners understand the term product management. The survey was conducted through a public LinkedIn group for a period of nine months. During this timeframe it received 201 responses. The responses were analyzed qualitatively to identify the essential components and properties of product management from the practitioners' viewpoint. In comparison with the existing product management frameworks and definitions, the responses showed a tendency to mix product management and product marketing. Although the respondents had difficulties in naming all product management activities, we identified six that represent the core activities of product managers in the industry. The findings have implications for the evolution of product management frameworks to address …", "num_citations": "13\n", "authors": ["1540"]}
{"title": "Comparison of two models of success prediction in software development projects\n", "abstract": " Background: The size and complexity of software development projects are growing. At the same time, the proportion of successful projects is still quite low according to the previous research. One way to approach this problem is to develop and use methods that can predict project success beforehand and act accordingly. Aim: The objective of this study is to compare two existing models of success prediction (The Standish Group and McConnell models) and to determine their strengths and weaknesses. Method: The research was done as an empirical study. A survey with structured forms and theme-based interviews were used as the data collection methods. The comparison is made with observations from 48 projects in Russia, Belarus, and Ukraine. In addition, 19 interviews were conducted during the study. Conclusions: The results show that The Standish Group has a tendency to overestimate the problems in a …", "num_citations": "12\n", "authors": ["1540"]}
{"title": "Lack of integration governance in ERP development: a case study on causes and effects\n", "abstract": " The development of an enterprise resource planning (ERP) system starts actually after it has been implemented and taken into use. It is necessary to integrate ERP with other business information systems inside and outside the company. With the grounded theory, we aim to understand how integration challenges emerged in a large manufacturing enterprise when the long-term ERP system reached the beginning of its retirement. Structural changes, an information technology governance model, lack of organisational vision, having no architectural descriptions, lack of collaboration, cost cutting, and organisational culture made integration governance troublesome. As a consequence, the enterprise suffered from several undesired effects, such as complex integration scenarios between internal systems, and failing to provide its customers the needed information. The reduction of costs strengthened the …", "num_citations": "8\n", "authors": ["1540"]}
{"title": "Comparison of Software Product Management Practices in SMEs and Large Enterprises\n", "abstract": " The aim of this interpretive qualitative study was to understand how software product management (SPM) activities differ in SMEs (small and medium-sized enterprises) and in large enterprises (LEs). We studied thirteen software organizations representing various types of software products and analyzed the collected data by applying the grounded theory method. As a result, we summarized the observations, explaining the main differences between SMEs and LEs and identified SPM activities that are size-dependent, size-independent, and specific for SMEs and LEs only. Our results indicate that the company size affects goals and activities of SPM. Therefore, companies of different size require different approaches in the adoption of SPM activities.", "num_citations": "8\n", "authors": ["1540"]}
{"title": "The Life Cycle Challenge of ERP System Integration\n", "abstract": " To serve its purpose as a backbone for business integration, Enterprise Resource Planning (ERP) systems need to be integrated with other information systems inside and outside the boundaries of an enterprise. An inductive case study was made to examine a long-term ERP system of a large manufacturing enterprise to better understand the nature and importance of ERP system integration. Our results can be summarized as four findings about the current life cycle models: 1) integration should be a major consideration when choosing ERPs, 2) deployments are continuous, 3) external integration is not just an extension phase after the project and 4) integration remains as a continuous challenge which is never fully achieved due to the constantly changing business requirements and organizational landscape. The results can help managers when making decisions on integration issues, yet effective approaches for integration governance are needed in order to avoid the increased costs and complexity.", "num_citations": "6\n", "authors": ["1540"]}
{"title": "What do we know about ERP integration?\n", "abstract": " Enterprise Resource Planning (ERP) systems have been the major interest of companies to improve the business performance with integrated business systems during the last 15 years. As demands for collaborative business through supply chain increased, so did the integration requirements for ERPs that are today connected externally with customers, suppliers and business partners and internally with continuously changing system landscape of the enterprise. We conducted a systematic mapping study to investigate how ERP integration has been studied by the academia from 1998 to 2012. Studies about technological issues are mostly dealing with systems inside a company whereas studies on methodological issues focus on the integration of the supply chain management and e-business. However, these studies are often either carried out without a rigorous empirical research method or they are …", "num_citations": "6\n", "authors": ["1540"]}
{"title": "Software Business: First International Conference, ICSOB 2010, Jyväskylä, Finland, June 21-23, 2010, Proceedings\n", "abstract": " The advancementof the softwareindustry has hada substantialimpact notonly onproductivityandonGDPgrowthglobally, butalsoonourdailyworkandlife. Software business refers to commercial activity of the software industry, aimed at generating income from delivery of software products and software services. Although software business shares common features with other international knowledge-intensive businesses, it carries many inherent features making it an intriguing and challenging domain for research. Until now, however, software business has received little attention from the academic community. The First International Conference on Software Business (ICSOB 2010) was organized in Jyv ̈ askyl ̈ a during June 21–23, 2010. This inaugural conference brought together a strong Program Committee of 52 members with research disciplines from various? elds of business management and technology mana-mentaswellasinternational? avorwithmemberscomingfrom17countriesfrom South and North America to Europe, India and Australia. Wereceived35researchpapersubmissions. Thepaperswentthroughadoub-blind review process producing at least three reviews for each accepted paper. The ProgramCommittee accepted 13 submissions to be presented as full papers in the conference, equaling 37% of the submissions. In addition, ten papers were accepted as short papers. The accepted papers represent the wide variety of-searchactivityonsoftwarebusiness. Forthepurposesoftheconferenceprogram, the papers were organized under eight themes: business models, business m-agement, ecosystems, education and research …", "num_citations": "5\n", "authors": ["1540"]}
{"title": "ERP System Integration: An Inter-organizational Challenge in the Dynamic Business Environment\n", "abstract": " The number of ERP system integration challenges has recently increased as ERP systems need to be integrated not only with the other business information systems inside the organization but also with the systems of business partners. We examined the development and integration of a customized ERP system used by a global manufacturing enterprise by interviewing 21 industrial experts. By using Grounded Theory as the data analysis approach, four groups of factors influencing ERP system integration were revealed. Business environment sets the constraints for integration that is governed in a dynamic organizational landscape, hindered by political agendas. Besides the ERP system vendor, many other ERP development network partners contribute to ERP system integration. The complexity of system level can further distract the integration efforts. Our findings can help managers to guide their …", "num_citations": "3\n", "authors": ["1540"]}
{"title": "Overcoming the complexity of software product management\n", "abstract": " This thesis describes an approach to overcoming the complexity of software product management (SPM) and consists of several studies that investigate the activities and roles in product management, as well as issues related to the adoption of software product management. The thesis focuses on organizations that have started the adoption of SPM but faced difficulties due to its complexity and fuzziness and suggests the frameworks for overcoming these challenges using the principles of decomposition and iterative improvements.  The research process consisted of three phases, each of which provided complementary results and empirical observation to the  problem of overcoming the complexity of SPM. Overall, product management processes and practices in 13 companies were studied and analysed. Moreover, additional data was collected with a survey conducted worldwide. The collected data were analysed using the grounded theory (GT) to identify the possible ways to overcome the complexity of  SPM. Complementary research methods, like elements of the Theory of Constraints were used for deeper data analysis.  The results of the thesis indicate that the decomposition of SPM activities depending on the specific characteristics of companies and roles is a useful approach for simplifying the existing SPM frameworks. Companies would benefit from the results by adopting SPM activities more efficiently and effectively and spending fewer resources on its adoption by concentrating on the most important SPM activities.", "num_citations": "3\n", "authors": ["1540"]}
{"title": "Software Product Management in the Russian Companies\n", "abstract": " Software product management discipline helps in managing software products from its beginning to support. It covers strategic issues of managing products including technical and business roadmapping, resource planning as well as strategic and tactical planning. In this qualitative study, we interviewed six organizations to understand how software product management is implemented in the organizations. Based on our observations, we conclude that organizations understand importance of product management processes and want to improve them but these processes are still immature. The companies need guidelines and models in product management to avoid the problems identified during the study.", "num_citations": "3\n", "authors": ["1540"]}
{"title": "Evaluating the success of software development projects in Russia, Ukraine, and Belarus\n", "abstract": " The size and complexity of projects in the software development are growing very fast. At the same time, the proportion of successful projects is still quite low according to the previous research. Although almost every project's team knows main areas of responsibility which would help to finish project on time and on budget, this knowledge is rarely used in practice. So it is important to evaluate the success of existing software development projects and to suggest a method for evaluating success chances which can be used in the software development projects.   The main aim of this study is to evaluate the success of projects in the selected geographical region (Russia-Ukraine-Belarus). The second aim is to compare existing models of success prediction and to determine their strengths and weaknesses.   Research was done as an empirical study. A survey with structured forms and theme-based interviews were used as the data collection methods. The information gathering was done in two stages. At the first stage, project manager or someone with similar responsibilities answered the questions over Internet. At the second stage, the participant was interviewed; his or her answers were discussed and refined. It made possible to get accurate information about each project and to avoid errors.  It was found out that there are many problems in the software development projects. These problems are widely known and were discussed in literature many times. The research showed that most of the projects have problems with schedule, requirements, architecture, quality, and budget. Comparison of two models of success prediction presented that The …", "num_citations": "2\n", "authors": ["1540"]}
{"title": "Eight types of relationships between stakeholders in ERP development networks: A case study of three large enterprises\n", "abstract": " ERP projects are complex socio-technical endeavors that cannot be implemented and used in isolation. Instead, many stakeholders are involved in the implementation of ERP systems. However, the ERP research often concentrates on relationships between two stakeholders only. In this study we take a broader viewpoint to relationships between external stakeholders in ERP development networks. We investigated the ERP development networks of three global enterprises and revealed eight types of relationships between the stakeholders. Understanding of what types of relationships exist is important for locating potential problems. As an example, we describe how an overtrusted relationship can lead to technical challenges.", "num_citations": "1\n", "authors": ["1540"]}