{"title": "Designing business models for cloud platforms\n", "abstract": " Platform as a service (PaaS) has become a strategic option for software vendors who expect to benefit from value co‐creation with partners by developing complementary components and applications. In reality, however, established and new software vendors are battling to redefine their offering to embrace PaaS. They face the challenges of transforming, configuring and calibrating their PaaS business models to align them with existing business models, customer expectations and competitive pressures. This motivates our research question: How can software providers design viable business models for PaaS? Our study develops a design theory for PaaS business models. This theory is grounded on a 12‐month action design research study at one of the largest global software companies (here called Alpha) with mixed PaaS experiences in the past. Our primary research contribution is a set of design principles …", "num_citations": "74\n", "authors": ["1962"]}
{"title": "Business models of platform as a service (PaaS) providers: current state and future directions\n", "abstract": " Cloud computing, Software as a Service (SaaS), Platform as a Service (PaaS), and Infrastructure as a Service (laaS) are terms that denote new developments in the software industry that are completely changing the way software is produced, consumed, and distributed. In particular new PaaS business models have a disruptive effect on existing business models and require thorough business model innovation in the software industry. Despite their impact, PaaS business models have not been considered in a sufficient manner in literature yet. The paper at hand contributes to this gap by providing an overview of typical characteristics of PaaS based on a systematic literature review, a classification model of existing PaaS business models based on case studies, and an overview of the current state and future development directions of PaaS.[PUBLICATION ABSTRACT]", "num_citations": "63\n", "authors": ["1962"]}
{"title": "Platform as a Service – A Conjoint Study on Consumers’ Preferences\n", "abstract": " Platform as a Service (PaaS) solutions are changing the way that software is produced, distributed, consumed, and priced. PaaS, also known as cloud platform, offer an execution environment based on software platforms. To be competitive on the market, PaaS providers have to be aware of drivers of successful platforms and design or adjust their business models accordingly. Surprisingly, prior research has made little attempt to investigate consumers’ preferences on PaaS that influence developers’ choice on PaaS solutions. This paper examines this understudied issue through a conjoint study. First a comprehensive literature analysis on PaaS has been conducted in order to build the study design on a rigorous foundation. The conducted conjoint survey contained ten attributes together with 26 corresponding attribute levels and has been completed by 103 participants. Based on the results, a prioritized list of customers’ preferences for PaaS has been created.", "num_citations": "59\n", "authors": ["1962"]}
{"title": "Mobile Enterprise Applications - Current State and Future Directions\n", "abstract": " The 2nd generation of mobile applications (apps) based on Smart phone's and tablet PCs are completely changing the way mobile software is developed, distributed and consumed. In particular mobile enterprise applications (MEA) have a disruptive effect on existing enterprise software and require rethinking in the software industry. Despite their impact, MEA have not been considered sufficiently in literature. This paper contributes to fill this gap by investigating more than 500 existing MEA, by providing an overview of typical characteristics of MEA, and extracting of both future directions in the MEA market and a related research agenda.", "num_citations": "57\n", "authors": ["1962"]}
{"title": "Revenue Streams of Cloud-based Platforms: Current State and Future Directions.\n", "abstract": " Platform as a Service is at the peak of inflated expectations. The term denotes some of the latest developments in the Information and Communication Technology industry, which are significantly changing the way services are produced, consumed, and deployed. While companies are investing in the underlying technology of cloud-based platforms, the emphasis on business model innovation and re-thinking the revenue streams falls behind. This study shows that current revenue streams of cloud-based platforms are unpretentious and follow simple patterns. Most cloud-based platform providers focus only on direct revenue streams, which are typically based upon subscription fees. Multi-sided business models and innovative ways of revenue generation are rarely present, even though the manner in which cloud platforms are commercialized is the deciding factor for the economic outcome.", "num_citations": "46\n", "authors": ["1962"]}
{"title": "4CaaSt marketplace: An advanced business environment for trading cloud services\n", "abstract": " As Clouds mature and become ubiquitous, marketplace environments are developed facilitating the provision of services in a manner that emphasizes on the modular composition of individual services across different providers that crosscut the cloud service stack layers (i.e. composition of XaaS) to fulfil customers’ requirements. Besides acting as intermediaries for the search, selection and trading of services, such marketplaces should also support the complete service lifecycle and the consolidation of offerings from different providers with varying and often contradicting business goals. In this paper we present a one-stop cloud marketplace solution that addresses the aforementioned challenges while enabling the simulation of different business cases to optimize service offerings according to a wide and dynamic set of parameters. Moreover, the proposed solution introduces advanced aggregated price models …", "num_citations": "44\n", "authors": ["1962"]}
{"title": "4CaaSt: Comprehensive management of Cloud services through a PaaS\n", "abstract": " The 4CaaSt project aims at developing a PaaS framework that enables flexible definition, marketing, deployment and management of Cloud-based services and applications. The major innovations proposed by 4CaaSt are the blueprint and its management and lifecycle, a one stop shop for Cloud services and the management of resources in the PaaS level (including elasticity). 4CaaSt also provides a portfolio of ready to use Cloud native services and Cloud- aware immigrant technologies.", "num_citations": "37\n", "authors": ["1962"]}
{"title": "Leveraging the Software Ecosystem-Towards a Business Model Framework for Marketplaces.\n", "abstract": " Software platforms in the form of marketplaces like Salesforce.com`s AppExchange, Netsuite`s SuiteApp or SAP`s Commercial Platform are changing the way how software and services are distributed, consumed, and priced. Technical innovations in the underlying platforms receive high attention, while innovative business models that build on and commercialize a flourishing ecosystem are neglected. In this paper we investigate the question which marketplace business model options are available to software platform owners that want to commercialize their ecosystem's products and services. We present a framework of ten possible models that is derived from both theory and practice. The options are clustered by the required level of product/service standardization to guide the choice of business model. The framework may serve decision makers as a starting point for their business model innovation plans.", "num_citations": "20\n", "authors": ["1962"]}
{"title": "A marketplace framework for trading cloud-based services\n", "abstract": " The importance of marketplace frameworks, where demand and supply for electronic services meet, has gained momentum with the recent technological innovations of cloud computing. In particular the emerging market for cloud and XaaS offerings is, in the current early stage of development, scattered and represented by many single offerings. New intermediaries are required for the consolidation of the available service offerings and for providing a one-stop-shopping opportunity for customers. This paper proposes a new cloud marketplace solution that enables on the one hand an integrated platform for the development and selling of XaaS products and on the other hand a one-stop-shopping for customers interested in services. Service providers can merchandise and sell their products through the marketplace supporting the whole lifecycle of these products. Service consumers are provided with a …", "num_citations": "20\n", "authors": ["1962"]}
{"title": "What are the Business Benefits of Enterprise Mashups?\n", "abstract": " Enterprise mashups (EMs) are a new technology that enables the automation of situational needs of knowledge workers. EMs imply a new development paradigm based on the peer production philosophy and empower end users to create individual applications without the involvement of the IT department. So far, there is insufficient research on potential benefits of EMs. This paper contributes to fill this gap by designing an EM benefit model. By following the design science approach, the balance scorecard concept is leveraged to identify and structure potential benefits of EMs. By means of a laboratory experiment and a case study, the applicability of the designed benefit model is demonstrated.", "num_citations": "17\n", "authors": ["1962"]}
{"title": "Towards a better Understanding of the Dynamics of Platform as a Service Business Models\n", "abstract": " Platform as a Service (PaaS) solutions are changing the way software is produced, distributed, used, and priced. However, there has been little research into understanding the dynamics of PaaS business models and how these business models should be designed to establish a flourishing ecosystem around these platforms. Using design science research (DSR) we first identified the main design elements of PaaS business models as well as their relationships by investigating 24 PaaS providers. The resulting classification scheme as well as the qualitative systems dynamics model (in form of a causal loop diagram (CLD)) facilitates a better understanding of the adoption dynamics of PaaS business models. By focusing on the adoption dynamics of PaaS business models, our research goes beyond previous approaches for studying PaaS.", "num_citations": "15\n", "authors": ["1962"]}
{"title": "A Method For Simulating Cloud Business Models: A Case Study On Platform As A Service.\n", "abstract": " Cloud computing has changed how software is produced, distributed, consumed, and priced. The cloud paradigm has had a disruptive effect on existing business models and elicited a need for more thoroughly defined business models as well as the tools to represent and compare business models. In this paper, we address this research gap and present a structured approach that allows a systematic design of business models for cloud computing and provides tools to facilitate the business model design process through simulation. The resulting method is specified by means of a meta-model as well as a procedure model and is demonstrated by a software prototype. The developed method has been evaluated in three case studies in the context of Platform as a Service business models.", "num_citations": "15\n", "authors": ["1962"]}
{"title": "Designing business models for platform as a service: towards a design theory\n", "abstract": " Platform as a Service (PaaS) solutions are changing the ways that software is produced, distributed, consumed, and priced. Unlike Software as a Service (SaaS) or Infrastructure as a Service (IaaS), PaaS allows for value co-creation by offering complementary components and applications that are developed in emerging ecosystems of third party developers. Despite increasing interest among practitioners and researchers, there has been little work in understanding how PaaS business models should be designed to establish a flourishing ecosystem. We seek to develop a design theory that facilitates the design of PaaS business models, taking into account the specifics of multisided business models. Four meta-requirements describe the purpose and scope of our design theory, and six design principles guide PaaS providers in designing effective business models. By focusing on designing business models, our research goes beyond previous approaches for studying PaaS.", "num_citations": "12\n", "authors": ["1962"]}
{"title": "What are Developers' Preferences on Platform as a Service? An Empirical Investigation\n", "abstract": " Platform as a service (PaaS) solutions are changing the way how software is produced, distributed, consumed, and priced. Due to the wide variety of approaches to PaaS and the absence of a formula that represents the drivers of successful platforms, the goal of this paper is to identify developers' preferences on PaaS. An adaptive choice-based conjoint analysis has been performed and was completed by 103 participants. Based on the results, a prioritized list of developers' preferences for PaaS has been created. The results of the survey indicate that, third-party developers' preferences also depend on phase of the software lifecycle in which they are (Development, Distribution, and Operation).", "num_citations": "12\n", "authors": ["1962"]}
{"title": "Quality metrics for mashups\n", "abstract": " Mashups combine disparate resources in order to create content in new ways from heterogeneous resources. Mashups are created in an ad-hoc manner due to, among other things, missing metrics that should give Mashup composers feedback about their application. The aim of this paper is to discuss application areas of metrics for Mashups. In particular, we will discuss Mashup metrics for design engineering and for corporate environments.", "num_citations": "6\n", "authors": ["1962"]}
{"title": "Do End Users Accept End User Development?\n", "abstract": " Do end-users accept end-user development by using enterprise mashups? Using the technology acceptance model, this research investigates the acceptance of the FAST platform, which enables endusers to build their own application by simply drag and drop graphical building blocks onto a canvas. An evaluation workshop of 159 individuals in various countries and locations found strong support of the idea. It was revealed that perceived usefulness strongly affected the attitude towards using enterprise mashups for end-user development. In turn, perceived ease of use did not. With respect to the developed mashup platform it was found that the available content within a mashup platform is the main influencing factor on the acceptance of end-user development by using mashups.", "num_citations": "5\n", "authors": ["1962"]}
{"title": "Implementing Cross-Organizational Business Processes with Enterprise Mashups: Hype or Reality?\n", "abstract": " Many cross-organizational business processes are implemented by hubs and integration platforms which support the electronic collaboration of multiple organizations. The available concepts and solutions based on service-oriented architectures focus on the automatization of long-term business relationships. However, they often do not provide intuitive ways to modify them according to situational needs. In particular, small and medium-sized enterprises characterized by limited know-how and resources are excluded in such electronic collaborations. This paper demonstrates how the user-driven development paradigm of enterprise mashups could be leveraged for implementing cross-organizational business processes. By means of a case study, we report about the experiences of a real-world scenario we have implemented in the frame of the EU-funded research project FAST. A business value analysis …", "num_citations": "4\n", "authors": ["1962"]}
{"title": "Incorporating the voice of the customer into mass-market software product management\n", "abstract": " Mass-market software products, such as cloud or mobile services, target distributed and heterogeneous users with changing and evolving requirements. They impose several challenges on the software development process in terms of requirements elicitation and prioritization. Classical requirements engineering methods that rely on close interactions with users are difficult to apply for these mass-market scenarios. Therefore, new methods are required to assist product managers in designing their products while integrating the\" voice of the customer\". In this paper, we argue for using market research techniques in software product management to add user preference measurements, identify market segments and analyze users' willingness-to-pay. Following method engineering guidelines, we develop a method component 1 that refines conjoint analysis (CA) for the use in software product management. We present …", "num_citations": "2\n", "authors": ["1962"]}