{"title": "Demonstration of a quantum error detection code using a square lattice of four superconducting qubits\n", "abstract": " The ability to detect and deal with errors when manipulating quantum systems is a fundamental requirement for fault-tolerant quantum computing. Unlike classical bits that are subject to only digital bit-flip errors, quantum bits are susceptible to a much larger spectrum of errors, for which any complete quantum error-correcting code must account. Whilst classical bit-flip detection can be realized via a linear array of qubits, a general fault-tolerant quantum error-correcting code requires extending into a higher-dimensional lattice. Here we present a quantum error detection protocol on a two-by-two planar lattice of superconducting qubits. The protocol detects an arbitrary quantum error on an encoded two-qubit entangled state via quantum non-demolition parity measurements on another pair of error syndrome qubits. This result represents a building block towards larger lattices amenable to fault-tolerant quantum error …", "num_citations": "511\n", "authors": ["534"]}
{"title": "Quantum optimization using variational algorithms on near-term quantum devices\n", "abstract": " Universal fault-tolerant quantum computers will require error-free execution of long sequences of quantum gate operations, which is expected to involve millions of physical qubits. Before the full power of such machines will be available, near-term quantum devices will provide several hundred qubits and limited error correction. Still, there is a realistic prospect to run useful algorithms within the limited circuit depth of such devices. Particularly promising are optimization algorithms that follow a hybrid approach: the aim is to steer a highly entangled state on a quantum system to a target state that minimizes a cost function via variation of some gate parameters. This variational approach can be used both for classical optimization problems as well as for problems in quantum chemistry. The challenge is to converge to the target state given the limited coherence time and connectivity of the qubits. In this context, the …", "num_citations": "317\n", "authors": ["534"]}
{"title": "Implementing a strand of a scalable fault-tolerant quantum computing fabric\n", "abstract": " With favourable error thresholds and requiring only nearest-neighbour interactions on a lattice, the surface code is an error-correcting code that has garnered considerable attention. At the heart of this code is the ability to perform a low-weight parity measurement of local code qubits. Here we demonstrate high-fidelity parity detection of two code qubits via measurement of a third syndrome qubit. With high-fidelity gates, we generate entanglement distributed across three superconducting qubits in a lattice where each code qubit is coupled to two bus resonators. Via high-fidelity measurement of the syndrome qubit, we deterministically entangle the code qubits in either an even or odd parity Bell state, conditioned on the syndrome qubit state. Finally, to fully characterize this parity readout, we develop a measurement tomography protocol. The lattice presented naturally extends to larger networks of qubits, outlining a …", "num_citations": "258\n", "authors": ["534"]}
{"title": "Open quantum assembly language\n", "abstract": " This document describes a quantum assembly language (QASM) called OpenQASM that is used to implement experiments with low depth quantum circuits. OpenQASM represents universal physical circuits over the CNOT plus SU(2) basis with straight-line code that includes measurement, reset, fast feedback, and gate subroutines. The simple text language can be written by hand or by higher level tools and may be executed on the IBM Q Experience.", "num_citations": "247\n", "authors": ["534"]}
{"title": "Validating quantum computers using randomized model circuits\n", "abstract": " We introduce a single-number metric, quantum volume, that can be measured using a concrete protocol on near-term quantum computers of modest size (n≲ 50), and measure it on several state-of-the-art transmon devices, finding values as high as 16. The quantum volume is linked to system error rates, and is empirically reduced by uncontrolled interactions within the system. It quantifies the largest random circuit of equal width and depth that the computer successfully implements. Quantum computing systems with high-fidelity operations, high connectivity, large calibrated gate sets, and circuit rewriting toolchains are expected to have higher quantum volumes. The quantum volume is a pragmatic way to measure and compare progress toward improved system-wide gate error rates for near-term quantum computation and error-correction experiments.", "num_citations": "241\n", "authors": ["534"]}
{"title": "Subsystem fault tolerance with the Bacon-Shor code\n", "abstract": " We discuss how the presence of gauge subsystems in the Bacon-Shor code [D. Bacon, Phys. Rev. A 73, 012340 (2006)] leads to remarkably simple and efficient methods for fault-tolerant error correction (FTEC). Most notably, FTEC does not require entangled ancillary states, and it can be implemented with nearest-neighbor two-qubit measurements. By using these methods, we prove a lower bound on the quantum accuracy threshold, 1.94× 10− 4 for adversarial stochastic noise, that improves previous lower bounds by nearly an order of magnitude.", "num_citations": "204\n", "authors": ["534"]}
{"title": "Demonstration of weight-four parity measurements in the surface code architecture\n", "abstract": " We present parity measurements on a five-qubit lattice with connectivity amenable to the surface code quantum error correction architecture. Using all-microwave controls of superconducting qubits coupled via resonators, we encode the parities of four data qubit states in either the X or the Z basis. Given the connectivity of the lattice, we perform a full characterization of the static Z interactions within the set of five qubits, as well as dynamical Z interactions brought along by single-and two-qubit microwave drives. The parity measurements are significantly improved by modifying the microwave two-qubit gates to dynamically remove nonideal Z errors.", "num_citations": "162\n", "authors": ["534"]}
{"title": "A layered software architecture for quantum computing design tools\n", "abstract": " Compilers and computer-aided design tools are essential for fine-grained control of nanoscale quantum-mechanical systems. A proposed four-phase design flow assists with computations by transforming a quantum algorithm from a high-level language program into precisely scheduled physical actions.", "num_citations": "154\n", "authors": ["534"]}
{"title": "Experimental demonstration of fault-tolerant state preparation with superconducting qubits\n", "abstract": " Robust quantum computation requires encoding delicate quantum information into degrees of freedom that are hard for the environment to change. Quantum encodings have been demonstrated in many physical systems by observing and correcting storage errors, but applications require not just storing information; we must accurately compute even with faulty operations. The theory of fault-tolerant quantum computing illuminates a way forward by providing a foundation and collection of techniques for limiting the spread of errors. Here we implement one of the smallest quantum codes in a five-qubit superconducting transmon device and demonstrate fault-tolerant state preparation. We characterize the resulting code words through quantum process tomography and study the free evolution of the logical observables. Our results are consistent with fault-tolerant state preparation in a protected qubit subspace.", "num_citations": "143\n", "authors": ["534"]}
{"title": "Codeword stabilized quantum codes\n", "abstract": " We present a unifying approach to quantum error correcting code design that encompasses additive (stabilizer) codes, as well as all known examples of nonadditive codes with good parameters. We use this framework to generate new codes with superior parameters to any previously known. In particular, we find ((10, 18, 3)) and ((10, 20, 3)) codes. We also show how to construct encoding circuits for all codes within our framework.", "num_citations": "129\n", "authors": ["534"]}
{"title": "Transversality versus universality for additive quantum codes\n", "abstract": " Logic gates can be performed on data encoded in quantum code blocks such that errors introduced by faulty gates can be corrected. The important class of transversal gates acts bitwise between corresponding qubits of code blocks and thus limits error propagation. If any quantum gate could be implemented using transversal gates, the set would be universal. We study the structure of  GF (4)-additive quantum codes and prove that no universal set of transversal logic gates exists for these codes. This result is in stark contrast with the classical case, where universal transversal gate sets exist, and strongly supports the idea that additional quantum techniques, based, for example, on quantum teleportation or magic state distillation, are necessary to achieve universal fault-tolerant quantum computation on additive codes.", "num_citations": "120\n", "authors": ["534"]}
{"title": "Investigating the limits of randomized benchmarking protocols\n", "abstract": " In this paper, we analyze the performance of randomized benchmarking protocols on gate sets under a variety of realistic error models that include systematic rotations, amplitude damping, leakage to higher levels, and 1/f noise. We find that, in almost all cases, benchmarking provides better than a factor-of-2 estimate of average error rate, suggesting that randomized benchmarking protocols are a valuable tool for verification and validation of quantum operations. In addition, we derive models for fidelity decay curves under certain types of non-Markovian noise models such as 1/f and leakage errors. We also show that, provided the standard error of the fidelity measurements is small, only a small number of trials are required for high-confidence estimation of gate errors.", "num_citations": "118\n", "authors": ["534"]}
{"title": "A comparative code study for quantum fault-tolerance\n", "abstract": " We study a comprehensive list of quantum codes as candidates of codes to be used at the bottom, physical, level in a fault-tolerant code architecture. Using the Aliferis-Gottesman-Preskill (AGP) ex-Rec method we calculate the pseudo-threshold for these codes against depolarizing noise at various levels of overhead. We estimate the logical noise rate as a function of overhead at a physical error rate of . The Bacon-Shor codes and the Golay code are the best performers in our study.", "num_citations": "108\n", "authors": ["534"]}
{"title": "A quantum logic array microarchitecture: Scalable quantum data movement and computation\n", "abstract": " Recent experimental advances have demonstrated technologies capable of supporting scalable quantum computation. A critical next step is how to put those technologies together into a scalable, fault-tolerant system that is also feasible. We propose a quantum logic array (QLA) microarchitecture that forms the foundation of such a system. The QLA focuses on the communication resources necessary to efficiently support fault-tolerant computations. We leverage the extensive groundwork in quantum error correction theory and provide analysis that shows that our system is both asymptotically and empirically fault tolerant. Specifically, we use the QLA to implement a hierarchical, array-based design and a logarithmic expense quantum-teleportation communication protocol. Our goal is to overcome the primary scalability challenges of reliability, communication, and quantum resource distribution that plague current …", "num_citations": "100\n", "authors": ["534"]}
{"title": "Microwave-activated conditional-phase gate for superconducting qubits\n", "abstract": " We introduce a new entangling gate between two fixed-frequency qubits statically coupled via a microwave resonator bus which combines the following desirable qualities: all-microwave control, appreciable qubit separation for reduction of crosstalk and leakage errors and the ability to function as a two-qubit conditional-phase gate. A fixed, always-on interaction is explicitly designed between higher energy (non-computational) states of two transmon qubits, and then a conditional-phase gate is' activated'on the otherwise unperturbed qubit subspace via a microwave drive. We implement this microwave-activated conditional-phase gate with a fidelity from quantum process tomography of~ 87%.", "num_citations": "98\n", "authors": ["534"]}
{"title": "Demonstration of quantum advantage in machine learning\n", "abstract": " The main promise of quantum computing is to efficiently solve certain problems that are prohibitively expensive for a classical computer. Most problems with a proven quantum advantage involve the repeated use of a black box, or oracle, whose structure encodes the solution. One measure of the algorithmic performance is the query complexity, ie, the scaling of the number of oracle calls needed to find the solution with a given probability. Few-qubit demonstrations of quantum algorithms, such as Deutsch–Jozsa and Grover, have been implemented across diverse physical systems such as nuclear magnetic resonance, trapped ions, optical systems, and superconducting circuits. However, at the small scale, these problems can already be solved classically with a few oracle queries, limiting the obtained advantage. Here we solve an oracle-based problem, known as learning parity with noise, on a five-qubit …", "num_citations": "97\n", "authors": ["534"]}
{"title": "Experimental demonstration of a resonator-induced phase gate in a multiqubit circuit-qed system\n", "abstract": " The resonator-induced phase (RIP) gate is an all-microwave multiqubit entangling gate that allows a high degree of flexibility in qubit frequencies, making it attractive for quantum operations in large-scale architectures. We experimentally realize the RIP gate with four superconducting qubits in a three-dimensional circuit-QED architecture, demonstrating high-fidelity controlled-z (cz) gates between all possible pairs of qubits from two different 4-qubit devices in pair subspaces. These qubits are arranged within a wide range of frequency detunings, up to as large as 1.8 GHz. We further show a dynamical multiqubit refocusing scheme in order to isolate out 2-qubit interactions, and combine them to generate a 4-qubit Greenberger-Horne-Zeilinger state.", "num_citations": "89\n", "authors": ["534"]}
{"title": "Toward a scalable, silicon-based quantum computing architecture\n", "abstract": " Advances in quantum devices have brought scalable quantum computation closer to reality. We focus on the system-level issues of how quantum devices can be brought together to form a scalable architecture. In particular, we examine promising silicon-based proposals. We discover that communication of quantum data is a critical resource in such proposals. We find that traditional techniques using quantum SWAP gates are exponentially expensive as distances increase and propose quantum teleportation as a means to communicate data over longer distances on a chip. Furthermore, we find that realistic quantum error-correction circuits use a recursive structure that benefits from using teleportation for long-distance communication. We identify a set of important architectural building blocks necessary for constructing scalable communication and computation. Finally, we explore an actual layout scheme for …", "num_citations": "89\n", "authors": ["534"]}
{"title": "The IBM Q experience and QISKit open-source quantum computing software\n", "abstract": " The IBM Q experience is a cloud-based quantum computing system that was made publicly available in the summer of 2016. Since then, more than 60,000 users across all seven continents have run over 1.7 million remote experiments on IBM's superconducting transmon devices and online simulators. Students and educators have successfully incorporated the IBM Q experience into classroom and summer school curricula. Researchers have used the system to investigate quantum computing, error correction, and validation techniques and metrics. In this talk, I will discuss the most recent developments around the IBM Q experience and QISKit open-source software for quantum computing.", "num_citations": "82\n", "authors": ["534"]}
{"title": "Quantum learning robust against noise\n", "abstract": " Noise is often regarded as anathema to quantum computation, but in some settings it can be an unlikely ally. We consider the problem of learning the class of n-bit parity functions by making queries to a quantum example oracle. In the absence of noise, quantum and classical parity learning are easy and almost equally powerful, both information-theoretically and computationally. We show that in the presence of noise this story changes dramatically. Indeed, the classical learning problem is believed to be intractable, while the quantum version remains efficient. Depolarizing the qubits at the oracle's output at any constant nonzero rate does not increase the computational (or query) complexity of quantum learning more than logarithmically. However, the problem of learning from corresponding classical examples is the learning parity with noise problem, for which the best known algorithms have superpolynomial …", "num_citations": "82\n", "authors": ["534"]}
{"title": "Topological and subsystem codes on low-degree graphs with flag qubits\n", "abstract": " In this work we introduce two code families, which we call the heavy-hexagon code and the heavy-square code. Both code families are implemented by assigning physical data and ancilla qubits to both vertices and edges of low-degree graphs. Such a layout is particularly suitable for superconducting qubit architectures to minimize frequency collisions and cross talk. In some cases, frequency collisions can be reduced by several orders of magnitude. The heavy-hexagon code is a hybrid surface and Bacon-Shor code mapped onto a (heavy-) hexagonal lattice, whereas the heavy-square code is the surface code mapped onto a (heavy-) square lattice. In both cases, the lattice includes all the ancilla qubits required for fault-tolerant error correction. Naively, the limited qubit connectivity might be thought to limit the error-correcting capability of the code to less than its full distance. Therefore, essential to our construction …", "num_citations": "76\n", "authors": ["534"]}
{"title": "Quantum memory hierarchies: Efficient designs to match available parallelism in quantum computing\n", "abstract": " The assumption of maximum parallelism support for the successful realization of scalable quantum computers has led to homogeneous, \"sea-of-qubits\" architectures. The resulting architectures overcome the primary challenges of reliability and scalability at the cost of physically unacceptable system area. We find that by exploiting the natural serialization at both the application and the physical microarchitecture level of a quantum computer, we can reduce the area requirement while improving performance. In particular we present a scalable quantum architecture design that employs specialization of the system into memory and computational regions, each individually optimized to match hardware support to the available parallelism. Through careful application and system analysis, we find that our new architecture can yield up to a factor of thirteen savings in area due to specialization. In addition, by providing a …", "num_citations": "72\n", "authors": ["534"]}
{"title": "Challenges and opportunities of near-term quantum computing systems\n", "abstract": " The concept of quantum computing has inspired a whole new generation of scientists, including physicists, engineers, and computer scientists, to fundamentally change the landscape of information technology. With experimental demonstrations stretching back more than two decades, the quantum computing community has achieved a major milestone over the past few years: the ability to build systems that are stretching the limits of what can be classically simulated, and which enable cloud-based research for a wide range of scientists, thus increasing the pool of talent exploring early quantum systems. While such noisy near-term quantum computing systems fall far short of the requirements for fault-tolerant systems, they provide unique testbeds for exploring the opportunities for quantum applications. Here we highlight the facets associated with these systems, including quantum software, cloud access, benchmarking quantum systems, error correction and mitigation in such systems, and understanding the complexity of quantum circuits and how early quantum applications can run on near term quantum computers.", "num_citations": "61\n", "authors": ["534"]}
{"title": "Quantum volume\n", "abstract": " As we build larger quantum computing devices capable of performing more complicated algorithms, it is important to quantify their power. The origin of a quantum computer’s power is already subtle, and a quantum computer’s performance depends on many factors that can make assessing its power challenging. These factors include: 1. The number of physical qubits;", "num_citations": "53\n", "authors": ["534"]}
{"title": "Scalable randomised benchmarking of non-clifford gates\n", "abstract": " Randomised benchmarking is a widely used experimental technique to characterise the average error of quantum operations. Benchmarking procedures that scale to enable the characterisation of n-qubit circuits rely on efficient procedures for manipulating those circuits and, as such, have been limited to subgroups of the Clifford group. However, universal quantum computers require additional, non-Clifford gates to approximate arbitrary unitary transformations. We define a scalable randomised benchmarking procedure over n-qubit unitary matrices that correspond to protected non-Clifford gates for a class of stabiliser codes. We present efficient methods for representing and composing group elements, sampling them uniformly and synthesising corresponding poly (n)-sized circuits. The procedure provides experimental access to two independent parameters that together characterise the average gate fidelity of a …", "num_citations": "53\n", "authors": ["534"]}
{"title": "Optimized pulse shapes for a resonator-induced phase gate\n", "abstract": " The resonator-induced phase gate is a multiqubit controlled-phase gate for fixed-frequency superconducting qubits. Through off-resonant driving of a bus resonator, statically coupled qubits acquire a state-dependent phase. However, photon loss leads to dephasing during the gate, and any residual entanglement between the resonator and qubits after the gate leads to decoherence. Here we consider how to shape the drive pulse to minimize these unwanted effects. First, we review how the gate's entangling and dephasing rates depend on the system parameters and validate closed-form solutions against direct numerical solution of a master equation. Next, we propose spline pulse shapes that reduce residual qubit-bus entanglement, are robust to imprecise knowledge of the resonator shift, and can be shortened by using higher-degree polynomials. Finally, we present a procedure that optimizes over the …", "num_citations": "53\n", "authors": ["534"]}
{"title": "Scheduling physical operations in a quantum information processor\n", "abstract": " Irrespective of the underlying technology used to implement a large-scale quantum architecture system, one of the central challenges of accurately modeling the architecture is the ability to map and schedule a quantum application onto a physical grid while taking into account the cost of communication, the classical resources, and the maximum exploitable parallelism. In this paper we introduce and evaluate a physical operations scheduler for arbitrary quantum circuits. Our scheduler accepts a description of a circuit together with a description of a specific physical layout and outputs a sequence of operations that expose the required communication and available parallelism in the circuit. The output of the scheduler is a quantum assembly language file that can directly be simulated on a set of available tools.", "num_citations": "50\n", "authors": ["534"]}
{"title": "Subsystem stabilizer codes cannot have a universal set of transversal gates for even one encoded qudit\n", "abstract": " A long-standing open problem in fault-tolerant quantum computation has been to find a universal set of transversal gates. As shown by Zeng et al.(e-print arXiv: 0706.1382), such a set does not exist for binary stabilizer codes. Here we generalize our work to show that for subsystem stabilizer codes in d-dimensional Hilbert space, such a universal set of transversal gates cannot exist for even one encoded qudit, for any dimension d, prime or nonprime. This result strongly supports the idea that other primitives, such as quantum teleportation, are necessary for universal fault-tolerant quantum computation, and may be an important factor for fault-tolerance noise thresholds.", "num_citations": "45\n", "authors": ["534"]}
{"title": "Fault-tolerant preparation of approximate GKP states\n", "abstract": " Gottesman–Kitaev–Preskill (GKP) states appear to be amongst the leading candidates for correcting errors when encoding qubits into oscillators. However the preparation of GKP states remains a significant theoretical and experimental challenge. Until now, no clear definitions for fault-tolerantly preparing GKP states have been provided. Without careful consideration, a small number of faults can lead to large uncorrectable shift errors. After proposing a metric to compare approximate GKP states, we provide rigorous definitions of fault-tolerance and introduce a fault-tolerant phase estimation protocol for preparing such states. The fault-tolerant protocol uses one flag qubit and accepts only a subset of states in order to prevent measurement readout errors from causing large shift errors. We then show how the protocol can be implemented using circuit QED. In doing so, we derive analytic expressions which describe …", "num_citations": "41\n", "authors": ["534"]}
{"title": "Fault-tolerant magic state preparation with flag qubits\n", "abstract": " Magic state distillation is one of the leading candidates for implementing universal fault-tolerant logical gates. However, the distillation circuits themselves are not fault-tolerant, so there is additional cost to first implement encoded Clifford gates with negligible error. In this paper we present a scheme to fault-tolerantly and directly prepare magic states using flag qubits. One of these schemes requires only three ancilla qubits, even with noisy Clifford gates. We compare the physical qubit and gate cost of our scheme to the magic state distillation protocol of Meier, Eastin, and Knill (MEK), which is efficient and uses a small stabilizer circuit. For low enough noise rates, we show that in some regimes the overhead can be improved by several orders of magnitude compared to the MEK scheme which uses Clifford operations encoded in the codes considered in this work.", "num_citations": "37\n", "authors": ["534"]}
{"title": "Local unitary versus local Clifford equivalence of stabilizer and graph states\n", "abstract": " The equivalence of stabilizer states under local transformations is of fundamental interest in understanding properties and uses of entanglement. Two stabilizer states are equivalent under the usual stochastic local operations and classical communication criterion if and only if they are equivalent under local unitary (LU) operations. More surprisingly, under certain conditions, two LU-equivalent stabilizer states are also equivalent under local Clifford (LC) operations, as was shown by Van den Nest et al.[Phys. Rev. A 71, 062323 (2005)]. Here, we broaden the class of stabilizer states for which LU equivalence implies LC equivalence (LU⇔ LC) to include all stabilizer states represented by graphs with cycles of length neither 3 nor 4. To compare our result with Van den Nest et al.’s, we show that any stabilizer state of distance δ= 2 is beyond their criterion. We then further prove that LU⇔ LC holds for a more general …", "num_citations": "37\n", "authors": ["534"]}
{"title": "A flow-map model for analyzing pseudothresholds in fault-tolerant quantum computing\n", "abstract": " An arbitrarily reliable quantum computer can be efficiently constructed from noisy components using a recursive simulation procedure, provided that those components fail with probability less than the fault-tolerance threshold. Recent estimates of the threshold are near some experimentally achieved gate fidelities. However, the landscape of threshold estimates includes pseudothresholds, threshold estimates based on a subset of components and a low level of recursion. In this paper, we observe that pseudothresholds are a generic phenomenon in fault-tolerant computation. We define pseudothresholds and present classical and quantum fault-tolerant circuits exhibiting pseudothresholds that differ by a factor of 4 from fault-tolerance thresholds for typical relationships between component failure rates. We develop tools for visualizing how reliability is influenced by recursive simulation in order to determine the asymptotic threshold. Finally, we conjecture that refinements of these methods may establish upper bounds on the fault-tolerance threshold for particular codes and noise models.", "num_citations": "37\n", "authors": ["534"]}
{"title": "Leakage suppression in the toric code\n", "abstract": " Quantum codes excel at correcting local noise but fail to correct leakage faults that excite qubits to states outside the computational space. Aliferis and Terhal have shown that an accuracy threshold exists for leakage faults using gadgets called leakage reduction units (LRUs). However, these gadgets reduce the threshold and increase experimental complexity, and the costs have not been thoroughly understood. We explore a variety of techniques for leakage resilience in topological codes. Our contributions are threefold. First, we develop a leakage model that is physically motivated and efficient to simulate. Second, we use Monte-Carlo simulations to survey several syndrome extraction circuits. Third, given the capability to perform 3-outcome measurements, we present a dramatically improved syndrome processing algorithm. Our simulations show that simple circuits with one extra CNOT per qubit reduce the …", "num_citations": "36\n", "authors": ["534"]}
{"title": "On the geometry of stabilizer states\n", "abstract": " Large-scale quantum computation is likely to require massive quantum error correction (QEC). QEC codes and circuits are described via the stabilizer formalism, which represents stabilizer states by keeping track of the operators that preserve them. Such states are obtained by stabilizer circuits (consisting of CNOT, Hadamard and Phase gates) and can be represented compactly on conventional computers using  bits, where  is the number of qubits. As an additional application, the work by Aaronson and Gottesman suggests the use of superpositions of stabilizer states to represent arbitrary quantum states. To aid in such applications and improve our understanding of stabilizer states, we characterize and count nearest-neighbor stabilizer states, quantify the distribution of angles between pairs of stabilizer states, study succinct stabilizer superpositions and stabilizer bivectors, explore the approximation of non-stabilizer states by single stabilizer states and short linear combinations of stabilizer states, develop an improved inner-product computation for stabilizer states via synthesis of compact canonical stabilizer circuits, propose an orthogonalization procedure for stabilizer states, and evaluate several of these algorithms empirically.", "num_citations": "34\n", "authors": ["534"]}
{"title": "Doubled color codes\n", "abstract": " We show how to perform a fault-tolerant universal quantum computation in 2D architectures using only transversal unitary operators and local syndrome measurements. Our approach is based on a doubled version of the 2D color code. It enables a transversal implementation of all logical gates in the Clifford+T basis using the gauge fixing method proposed recently by Paetznick and Reichardt. The gauge fixing requires six-qubit parity measurements for Pauli operators supported on faces of the honeycomb lattice with two qubits per site. Doubled color codes are promising candidates for the experimental demonstration of logical gates since they do not require state distillation. Secondly, we propose a Maximum Likelihood algorithm for the error correction and gauge fixing tasks that enables a numerical simulation of logical circuits in the Clifford+T basis. The algorithm can be used in the online regime such that a new error syndrome is revealed at each time step. We estimate the average number of logical gates that can be implemented reliably for the smallest doubled color code and a toy noise model that includes depolarizing memory errors and syndrome measurement errors.", "num_citations": "33\n", "authors": ["534"]}
{"title": "Codeword stabilized quantum codes: Algorithm and structure\n", "abstract": " The codeword stabilized (CWS) quantum code formalism presents a unifying approach to both additive and nonadditive quantum error-correcting codes [IEEE Trans. Inf. Theory 55, 433 (2009)]. This formalism reduces the problem of constructing such quantum codes to finding a binary classical code correcting an error pattern induced by a graph state. Finding such a classical code can be very difficult. Here, we consider an algorithm which maps the search for CWS codes to a problem of identifying maximum cliques in a graph. While solving this problem is in general very hard, we provide three structure theorems which reduce the search space, specifying certain admissible and optimal ((n,K,d)) additive codes. In particular, we find that the re does not exist any ((7,3,3)) CWS code though the linear programming bound does not rule it out. The complexity of the CWS-search algorithm is compared with the contrasting …", "num_citations": "33\n", "authors": ["534"]}
{"title": "Preliminary results on simulating a scalable fault tolerant ion-trap system for quantum computation\n", "abstract": " Quantum information processors face the challenge of operating reliably despite the intrinsic component unreliability due to decoherence. This can be avoided by strategic use of quantum error correction to build a fault-tolerant quantum computer, as long as the component failure probability p 0 is less than a critical threshold p th. This threshold value is an excellent, comprehensive measure of the scalability of a particular physical implementation, and although it can theoretically be as high as 10− 3, its actual value depends highly on implementation specifics, such as T 1 and T 2 lifetime parameters, qubit couplings, and control and communication errors. Here, we numerically evaluate p th for a an ion trap quantum computer architecture, using a Monte-Carlo simulation built on existing experimentally determined performance parameters, including geometric layout constraints, and techniques adopted from classical …", "num_citations": "20\n", "authors": ["534"]}
{"title": "Quantum circuit compilers using gate commutation rules\n", "abstract": " The use of noisy intermediate-scale quantum computers (NISQCs), which consist of dozens of noisy qubits with limited coupling constraints, has been increasing. A circuit compiler, which transforms an input circuit into an equivalent output circuit conforming the coupling constraints with as few additional gates as possible, is essential for running applications on NISQCs. We propose a formulation and two algorithms exploiting gate commutation rules to obtain a better circuit compiler.", "num_citations": "18\n", "authors": ["534"]}
{"title": "Synthesis and evaluation of fault-tolerant quantum computer architectures\n", "abstract": " Fault-tolerance is the cornerstone of practical, large-scale quantum computing, pushed into its prominent position with heroic theoretical efforts. The fault-tolerance threshold, which is the component failure probability below which arbitrarily reliable quantum computation becomes possible, is one standard quality measure of fault-tolerant designs based on recursive simulation. However, there is a gulf between theoretical achievements and the physical reality and complexity of envisioned quantum computing systems. This thesis takes a step toward bridging that gap. We develop a new experimental method for estimating fault-tolerance thresholds that applies to realistic models of quantum computer architectures, and demonstrate this technique numerically. We clarify a central problem for experimental approaches to fault-tolerance evaluation--namely, distinguishing between potentially optimistic pseudo-thresholds and actual thresholds that determine scalability. Next, we create a system architecture model for the trapped-ion quantum computer, discuss potential layouts, and numerically estimate the fault-tolerance threshold for this system when it is constrained to a local layout. Finally, we place the problem of evaluation and synthesis of fault-tolerant quantum computers into a broader framework by considering a software architecture for quantum computer design.", "num_citations": "17\n", "authors": ["534"]}
{"title": "A general purpose architectural layout for arbitrary quantum computations\n", "abstract": " Exploiting recent advances in quantum trapped-ion technologies, we propose a scalable, fault-tolerant quantum computing architecture that overcomes the fundamental challenges of building a full-scale  quantum computer and leaves the fabrication a daunting but primarily  an engineering concern. Using a hierarchical array-based design and a  quantum teleportation communication protocol, we are able to  overcome the primary scalability challenges of reliability, communication, and quantum resource distribution.   In particular, we present a reconfigurable quantum circuit substrate, or \"quantum FPGA'' (qFPGA) which allows efficient implementation of universal quantum gates and error correction.  We  use this qFPGA as a basic building block for an array structure that scalably provides communication channels and quantum resource  distribution.  We exploit a hierarchical combination of ballistic transport of data …", "num_citations": "15\n", "authors": ["534"]}
{"title": "Experimental implementation of non-Clifford interleaved randomized benchmarking with a controlled- gate\n", "abstract": " Hardware-efficient transpilation of quantum circuits to a quantum device native gate set is essential for the execution of quantum algorithms on noisy quantum computers. Typical quantum devices utilize a gate set with a single two-qubit Clifford entangling gate per pair of coupled qubits; however, in some applications access to a non-Clifford two-qubit gate can result in more optimal circuit decompositions and also allows more flexibility in optimizing over noise. We demonstrate calibration of a low-error non-Clifford controlled-π 2 phase (cs) gate on a cloud-based IBM Quantum system using the Qiskit Pulse framework. To measure the gate error of the calibrated cs gate we perform non-Clifford cnot-dihedral interleaved randomized benchmarking. We are able to obtain a gate error of 5.9 (7)× 10− 3 at a gate length 263 ns, which is close to the coherence limit of the associated qubits, and lower error than the back-end …", "num_citations": "12\n", "authors": ["534"]}
{"title": "OpenQASM 3: A broader and deeper quantum assembly language\n", "abstract": " Quantum assembly languages are machine-independent languages that traditionally describe quantum computation in the circuit model. Open quantum assembly language (OpenQASM 2) was proposed as an imperative programming language for quantum circuits based on earlier QASM dialects. In principle, any quantum computation could be described using OpenQASM 2, but there is a need to describe a broader set of quantum circuits beyond the language of qubits and gates. By examining interactive use cases, we recognize two different timescales of quantum-classical interactions: real-time classical computations that must be performed within the coherence times of the qubits, and near-time computations with less stringent timing. Since the near-time domain is adequately described by existing programming frameworks, we choose in OpenQASM 3 to focus on the real-time domain, which must be more tightly coupled to the execution of quantum operations. Motivated by the need for real-time classical computation, we add support for arbitrary control flow as well as calling external classical functions. In addition, we recognize the need to describe circuits at multiple levels of specificity, and therefore we extend the language to include timing, pulse control, and gate modifiers. These new language features create a multi-level intermediate representation for circuit development and optimization, as well as control sequence implementation for calibration, characterization, and error mitigation.", "num_citations": "11\n", "authors": ["534"]}
{"title": "Correlated randomized benchmarking\n", "abstract": " To improve the performance of multi-qubit algorithms on quantum devices it is critical to have methods for characterizing non-local quantum errors such as crosstalk. To address this issue, we propose and test an extension to the analysis of simultaneous randomized benchmarking data -- correlated randomized benchmarking. We fit the decay of correlated polarizations to a composition of fixed-weight depolarizing maps to characterize the locality and weight of crosstalk errors. From these errors we introduce a crosstalk metric which indicates the distance to the closest map with only local errors. We demonstrate this technique experimentally with a four-qubit superconducting device and utilize correlated RB to validate crosstalk reduction when we implement an echo sequence.", "num_citations": "11\n", "authors": ["534"]}
{"title": "Contract-based verification of a realistic quantum compiler\n", "abstract": " In this paper, we present CertiQ, a mostly-automated verification framework for the Qiskit quantum compiler. To our knowledge, CertiQ is the first effort to apply formal verification and SMT reasoning to a real-world quantum compiler. Qiskit is currently the most complete and widely-used open-source quantum software stack from low-level compilation to high-level quantum algorithms. With growing community contributions, the Qiskit compiler is in need of code quality control and verification down to the compilation level to guarantee reliability of scientific work that uses it. CertiQ is deeply integrated into the Qiskit compiler (called Terra), providing abstract specifications for quantum compiler data structures and offering verifiable contracts that specify the behaviors of compilation phases with heavy optimizations. CertiQ enables verification of the existing implementation of the Qiskit compiler and future code submissions …", "num_citations": "11\n", "authors": ["534"]}
{"title": "High-level interconnect model for the quantum logic array architecture\n", "abstract": " We summarize the main characteristics of the quantum logic array (QLA) architecture with a careful look at the key issues not described in the original conference publications: primarily, the teleportation-based logical interconnect. The design goal of the the quantum logic array architecture is to illustrate a model for a large-scale quantum architecture that solves the primary challenges of system-level reliability and data distribution over large distances. The QLA's logical interconnect design, which employs the quantum repeater protocol, is in principle capable of supporting the communication requirements for applications as large as the factoring of a 2048-bit number using Shor's quantum factoring algorithm. Our physical-level assumptions and architectural component validations are based on the trapped ion technology for implementing quantum computing.", "num_citations": "10\n", "authors": ["534"]}
{"title": "Uniform additivity in classical and quantum information\n", "abstract": " Information theory quantifies the optimal rates of resource interconversions, usually in terms of entropies. However, nonadditivity often makes evaluating entropic formulas intractable. In a few auspicious cases, additivity allows a full characterization of optimal rates. We study uniform additivity of formulas, which is easily evaluated and captures all known additive quantum formulas. Our complete characterization of uniform additivity exposes an intriguing new additive quantity and identifies a remarkable coincidence—the classical and quantum uniformly additive functions with one auxiliary variable are identical.", "num_citations": "9\n", "authors": ["534"]}
{"title": "Three-dimensional simulation of traveling-wave tube cold-test characteristics using CST MICROWAVE STUDIO\n", "abstract": " The electromagnetic field simulation software package CST MICROWAVE STUDIO (MWS) was used to compute the cold-test parameters—frequency-phase dispersion, on-axis impedance, and attenuation—for a traveling-wave tube (TWT) slow-wave circuit. The results were compared to experimental data, as well as to results from MAFIA, another three-dimensional simulation code from CST currently used at the NASA Glenn Research Center (GRC). The strong agreement between cold-test parameters simulated with MWS and those measured experimentally demonstrates the potential of this code to reduce the time and cost of TWT development.", "num_citations": "9\n", "authors": ["534"]}
{"title": "Resource-Efficient Quantum Computing by Breaking Abstractions\n", "abstract": " Building a quantum computer that surpasses the computational power of its classical counterpart is a great engineering challenge. Quantum software optimizations can provide an accelerated pathway to the first generation of quantum computing (QC) applications that might save years of engineering effort. Current quantum software stacks follow a layered approach similar to the stack of classical computers, which was designed to manage the complexity. In this review, we point out that greater efficiency of QC systems can be achieved by breaking the abstractions between these layers. We review several works along this line, including two hardware-aware compilation optimizations that break the quantum instruction set architecture (ISA) abstraction and two error-correction/information-processing schemes that break the qubit abstraction. Last, we discuss several possible future directions.", "num_citations": "7\n", "authors": ["534"]}
{"title": "A comparison of three-dimensional simulations of traveling-wave tube cold-test characteristics using CST MICROWAVE STUDIO and MAFIA\n", "abstract": " Previously, it was shown that MAFIA (solutions of Maxwell's equations by the Finite Integration Algorithm), a three-dimensional simulation code, can be used to produce accurate cold-test characteristics including frequency-phase dispersion, interaction impedance, and attenuation for traveling-wave tube (TWT) slow-wave structures. In an effort to improve user-friendliness and simulation time, a model was developed to compute the cold-test parameters using the electromagnetic field simulation software package CST MICROWAVE STUDIO (MWS). Cold-test parameters were calculated for several slow-wave circuits including a ferruled coupled-cavity, a folded waveguide, and a novel finned-ladder circuit using both MWS and MAFIA. Comparisons indicate that MWS provides more accurate cold-test data with significantly reduced simulation times.", "num_citations": "6\n", "authors": ["534"]}
{"title": "Fault-tolerant quantum computer architectures using hierarchies of quantum error-correcting codes\n", "abstract": " Quantum computers have been shown to efficiently solve a class of problems for which no efficient solution is otherwise known. Physical systems can implement quantum computation, but devising realistic schemes is an extremely challenging problem largely due to the effect of noise. A quantum computer that is capable of correctly solving problems more rapidly than modern digital computers requires some use of so-called fault-tolerant components. Code-based fault-tolerance using quantum error-correcting codes is one of the most promising and versatile of the known routes for fault-tolerant quantum computation. This dissertation presents three main, new results about code-based fault-tolerant quantum computer architectures. The first result is a large new family of quantum codes that go beyond stabilizer codes, the most well-studied family of quantum codes. Our new family of codeword stabilized codes contains all known codes with optimal parameters. Furthermore, we show how to systematically find, construct, and understand such codes as a pair of codes: an additive quantum code and a classical (nonlinear) code. Second, we resolve an open question about universality of so-called transversal gates acting on stabilizer codes. Such gates are universal for classical fault-tolerant computation, but they were conjectured to be insufficient for universal fault-tolerant quantum computation. We show that transversal gates have a restricted form and prove that some important families of them cannot be quantum universal. This is strong evidence that so-called quantum software is necessary to achieve universality, and, therefore, fault-tolerant …", "num_citations": "5\n", "authors": ["534"]}
{"title": "Job processing in quantum computing enabled cloud environments\n", "abstract": " A compatibility is ascertained between a configuration of a quantum processor (q-processor) of a quantum cloud compute node (QCCN) in a quantum cloud environment (QCE) and an operation requested in a first instruction in a portion (q-portion) of a job submitted to the QCE, the QCE including the QCCN and a conventional compute node (CCN), the CCN including a conventional processor configured for binary computations. In response to the ascertaining, a quantum instruction (q-instruction) is constructed corresponding to the first instruction. The q-instruction is executed using the q-processor of the QCCN to produce a quantum output signal (q-signal). The q-signal is transformed into a corresponding quantum computing result (q-result). A final result is returned to a submitting system that submitted the job, wherein the final result comprises the q-result.", "num_citations": "3\n", "authors": ["534"]}
{"title": "Critical faults of leakage errors on the surface code\n", "abstract": " Leakage is a particularly damaging error that occurs when a qubit leaves the defined computational subspace. Leakage errors limit the effectiveness of quantum error correcting codes by spreading additional errors to other qubits and corrupting syndrome measurements. The effects of leakage errors on the surface code has been studied in various contexts. However, the effects of a leaked data qubit versus a leaked ancilla qubit can be quite different. Here, we study the effects of data leakage and ancilla leakage separately. We find that data leakage is much less damaging. We show that the surface code maintains its distance in the presence of leakage by either confining leakage to data qubits or eliminating ancilla qubit leakage at the critical fault location. To demonstrate this, we introduce new techniques for handling leakage: taking advantage of gates with one-sided leakage, effectively isolating leakage events …", "num_citations": "3\n", "authors": ["534"]}
{"title": "Interactive user interface for composing quantum circuits\n", "abstract": " Systems, methods, and computer-readable media are disclosed for composing quantum circuits and rendering graphical representations thereof within an interactive user interface. The user interface may be a quantum circuits composer interface into which a quantum circuit can be written via drag-and-drop user interactions with the interface that involve placing symbols representative of quantum operations (gates and measurements) on interactive elements (eg, linear elements) representing qubits and/or classical bits, or more specifically, the state of qubits/classical bits over time. Quantum circuits created using the quantum circuits composer interface can be translated into a scripting language. In addition, user commands provided via a command line interface (CLI) can be translated into a corresponding quantum circuit and a graphical representation thereof can be dynamically generated. Modifications to the …", "num_citations": "3\n", "authors": ["534"]}
{"title": "Facilitating quantum tomography\n", "abstract": " Techniques for facilitating quantum tomography are provided. In one example, a system includes a circuit generation component and a tomography analysis component. The circuit generation component generates tomography experiment data indicative of information for a set of tomography experiments based on quantum circuit data indicative of a machine-readable description of a quantum circuit. The tomography analysis component generates tomogram data based on experimental result data indicative of information associated with the tomography experiment data.", "num_citations": "2\n", "authors": ["534"]}
{"title": "Synthesis of CNOT-Dihedral circuits with optimal number of two qubit gates\n", "abstract": " In this note we present explicit canonical forms for all the elements in the two-qubit CNOT-Dihedral group, with minimal numbers of controlled-() and controlled-() gates, using the generating set of quantum gates . We provide an algorithm to successively construct the -qubit CNOT-Dihedral group, asserting an optimal number of controlled-() gates. These results are needed to estimate gate errors via non-Clifford randomized benchmarking and may have further applications to circuit optimization over fault-tolerant gate sets.", "num_citations": "2\n", "authors": ["534"]}
{"title": "On the Structure of the CNOT-Dihedral Group\n", "abstract": " In this note we present explicit canonical forms for all the elements in the -qubit CNOT-Dihedral group, with minimal numbers of controlled-() and controlled-() gates, using the generating set of quantum gates . We provide an efficient algorithm, with a sharp bound, to successively construct the -qubit CNOT-Dihedral group, asserting an optimal number of controlled-() gates. These results are needed to estimate gate errors via non-Clifford randomized benchmarking and may have further applications to circuit optimization over fault tolerant gate sets.", "num_citations": "2\n", "authors": ["534"]}
{"title": "QLA: Quantum logic array microarchitecture, a brief overview\n", "abstract": " Recent experimental advances have demonstrated technologies capable of supporting scalable quantum computation. A critical next step is how to put those technologies together into a scalable, faulttolerant system that is also feasible. We propose a Quantum Logic Array (QLA) microarchitecture that forms the foundation of such a system. QLA is a quantum computer architecture designed for efficient error-correction and error-free communication, regardless of distance. Our designs are validated by analytical reasoning and also by simulation. We emphasize the importance of a datapath oriented large-scale quantum architecture for solving realistic problems, and show how the QLA achieves such design goals. In addition, we introduce ARQ, a tool used to map quantum applications to faulttolerant architectures.", "num_citations": "2\n", "authors": ["534"]}
{"title": "Debugging quantum circuits by circuit rewriting\n", "abstract": " Techniques for automating quantum circuit debugging are provided that simulate standard debugging behaviors. The technology includes rewriting a source quantum circuit into instrumented circuits based on instrumentation instruction information inserted into software code that corresponds to the source quantum circuit. The instrumented circuits can executed to obtain measurement data corresponding to different state data of qubits within the source quantum circuit. The measurement data can be processed to output generated information corresponding to one or more internal states or processes of a quantum computer associated with the source quantum circuit.", "num_citations": "1\n", "authors": ["534"]}
{"title": "A Design Overview for a Simulation Infrastructure for Exploring Quantum Architectures\n", "abstract": " Quantum architectural research has been hindered by the lack of scalable simulation tools. This deficiency is understandable, since the amount of information required to accurately simulate a quantum system grows exponentially. However, it is possible to obtain accurate statistical information about a quantum architecture, without fully simulating a quantum algorithm. Some interesting questions for architects are: how fast does it run? how many operations are performed? how reliable is the result? To answer these questions, a quantum simulator doesn’t require complete state information. This paper is a proposal for a scalable quantum architectural simulator, based on a hierarchy of modeling abstractions, that works across a few different proposed silicon-based quantum device technologies.", "num_citations": "1\n", "authors": ["534"]}