{"title": "The role of IT-management in the digital transformation of Russian companies\n", "abstract": " Nowadays many business models rely heavily upon adequate IT management practices. Quite often in developed economies, the role of IT has organically evolved over decades from a mere business support function to an efficiency driver and enabler, and finally (at least in some cases) to a driver of business innovation and digital transformation. Unlike developed countries, little is known about the role of IT in companies of countries with transitional economies, such as Russia. Historical, political, and geographical reasons have in many areas of life led to a “Russian way of doing things”. Does this also hold true for IT management? By way of case study research, this contribution investigates the features of the IT-role and use in large Russian companies that are aware of the need for digital business transformation. The obtained results allow one to not only gain a better understanding of the situation in Russian companies through the prism of IT management practices but also to identify possible trends and challenges that appear relevant for organizations in other countries in economic transition or even in developed economies as well.", "num_citations": "60\n", "authors": ["1542"]}
{"title": "Higher education funding models and institutional effectiveness: Empirical research of European experience and Russian Trends\n", "abstract": " World Bank data shows that education accounts for, on average, 13% of government expenditure in the world, effective spending being a priority. Position in international academic rankings has been a universally accepted, yet criticized, criterion of institutional effectiveness. No consistent positive correlation was revealed during research on how the size of government subsidies affected university ranking. Assessment methodology is adjusted to study the influence of public funding mechanisms on university ranking. Three mechanisms are investigated: formula-based funding, outcome-based funding, and negotiated funding. The sample includes 107 European universities from 27 countries. For each of them, information on the funding model (or a combination of models), total annual revenue, proportion of public subsidies, ranking and ranking movements over the last decade is collected. Analysis results are used to group universities into two major categories: low-ranking universities (ranked in the top 200–500), which are mostly funded using formal mechanisms (formulaand outcomes-based funding), and high-rankings universities (the top 100), which largely use the negotiated funding model (either alone or combined with formal models). This confirms previous research findings that the size of government subsidies has no impact on university ranking. A qualitative analysis of higher education funding patterns in Russia is performed. Formalization of all sources of university funding has become a major trend, yet this empirical study demonstrates that prioritization of formal criteria may be ineffective if Russian universities want to reach their …", "num_citations": "45\n", "authors": ["1542"]}
{"title": "Likert-scale questionnaires as an educational tool in teaching discrete mathematics\n", "abstract": " In this paper, we report on the results of an experiment in teaching discrete mathematics to students majoring in business informatics. We supplemented our problem-based approach to teaching the course with a set of Likert-scale surveys or questionnaires that helped improve the students’ performance. On the one hand, these surveys gave us feedback and, on the other, encouraged the students to reflect on the subject-matter. The experiment was quite successful, as the grades obtained by the students on the exam were significantly higher than usual. Here, we describe the structure of the surveys and the method of evaluation of the experimental results.", "num_citations": "17\n", "authors": ["1542"]}
{"title": "Discrete mathematics course supported by CAS MATHEMATICA\n", "abstract": " In this paper, we discuss examples of assignments for a course in discrete mathematics for undergraduate students majoring in business informatics. We consider several problems with computer-based solutions and discuss general strategies for using computers in teaching mathematics and its applications. In order to evaluate the effectiveness of our approach, we conducted an anonymous survey. The results of the survey provide evidence that our approach contributes to high outcomes and aligns with the course aims and objectives.", "num_citations": "14\n", "authors": ["1542"]}
{"title": "Bridging the state-of-the-art and the state-of-the-practice of SaaS pricing: A multivocal literature review\n", "abstract": " ContextPricing is an essential element of software business strategy and tactics. Informed pricing decision-making requires the involvement of different stakeholders and comprehensive data analysis. Achieving both appears to be challenging, and pricing remains one of the most under-managed processes in the software business. Simultaneously, a coherent SaaS pricing body of knowledge and verified solutions to assist SaaS providers while designing and implementing pricing are missing.ObjectiveThere is a lack of integration among different research areas focused on SaaS pricing and, more importantly, between academia and industry. The primary aim of this paper is to clarify this misconception by classifying, thematically analyzing, and putting in correspondent academic state-of-the-art and industrial state-of-the-practice of SaaS pricing.MethodA multivocal literature review (MLR) approach was used for the …", "num_citations": "7\n", "authors": ["1542"]}
{"title": "Do we know how to price SaaS: a multi-vocal literature review\n", "abstract": " Cloud computing and the service-oriented business model are transforming the way software is developed, delivered, and used. Servicization of digital products creates new challenges for software companies to be able to reap the benefits of this change. Pricing is recognized as an essential component of software product management that affects the overall performance of the product and the company. Existing academic research on SaaS pricing is fragmented and separated from a wide range of practitioner literature. As a result, a comprehensive body of knowledge on SaaS pricing is missing. Our paper reports the results of a multi-vocal literature review on 76 identified pieces of``white''academic literature and 149 items that belong to``grey''literature. The goal of our study is to answer the question on whether we know how to price SaaS by summarizing the existing knowledge from different research areas and …", "num_citations": "4\n", "authors": ["1542"]}
{"title": "Engineering and business aspects of SaaS model adoption: Insights from a mapping study.\n", "abstract": " Transition to Software-as-a-Service (SaaS) model is revolutionizing the software market with significant impact on both SaaS providers and consumers. Research on business aspects of SaaS was usually limited to exploring adoption factors from a consumer perspective. Research on engineering aspects of SaaS focuses primarily on cloud computing architecture and software development. The prime aim of this paper is to assemble these engineering and business aspects of SaaS while building a better understanding of the servitization transformation of software companies as well as classifying, analyzing and putting in correspondence state-of-the-art studies focused on SaaS product and project management, business practices and engineering processes. The mapping study findings and interpretations are summarized to emphasize the significant research challenges regarding the required engineering and business efforts needed for the adoption service-oriented model. The performed study creates an appropriate basis for the further research.", "num_citations": "4\n", "authors": ["1542"]}
{"title": "Harnessing hydrocarbon revenues: reflections on Russia\n", "abstract": " Economies, like Russia, blessed with resource abundance, do not usually perform well during the period of commodity price boom. The optimal policy of managing resource revenues prescribes to commit the permanent income rule to smooth the resource dividend in efficiency units and to smooth the real exchange rate. During the commodity price boom, Russia followed partially this prescribed policy, but the situation changed after the crash of oil and gas prices in 2014. Possible ways to overcome the consequences of low oil and gas prices are discussed, paying particular attention to the lack of economic complexity and the need for diversification and capabilities for growth and development of the Russian economy. Refs 29. Figs 3.", "num_citations": "4\n", "authors": ["1542"]}
{"title": "A dynamic pricing model for software products incorporating human experiences\n", "abstract": " At the age of software as a service (SasS) and cloud computing as compared to what is used to be earlier, designing product strategies is a challenging concern for software product management researchers. Comparative statics models are considered to identify software market characteristics while assessing the managerial decisions during the software product strategy design. However, their applicability in dynamic market analysis is rather limited. Important concerns in dynamic market such as dynamic pricing cannot be fully estimated. This motivated the development of a simulation-based dynamic model to evaluate the efficiency and effectiveness of using different pricing models. The proposed (simulation) approach given in details in this paper can be used in conducting complex analysis of software product strategy that involves consideration of product strategy as a portfolio of interrelated solutions …", "num_citations": "4\n", "authors": ["1542"]}
{"title": "The Role and Tasks of IT in Russian Companies–A Survey of the Status Quo\n", "abstract": " IT penetration of the core business processes in companies in recent decades has increased continuously. Moreover, the business agility is strongly influenced by the IT agility, making IT an important factor that can contribute to the competitiveness of a firm in its markets. Increasingly, this requires IT to be no longer merely\" enabler\" of business processes, but also to contribute to innovation in the technical side of the business. Thus, the role of IT has changed considerably over time, at least from an academic point of view. This paper explores the current role of IT in Russian companies. In particular, whether companies really adopted this broader perspective that views IT as more than just a cost factor or, at best, reactive enabler of business.", "num_citations": "3\n", "authors": ["1542"]}
{"title": "Comparing bachelor studies in business informatics at universities in Russia and Germany\n", "abstract": " Business informatics is a relatively young academic discipline. During the last years several efforts have been made to compare the German discipline Wirtschaftsinformatik with the Anglo-American sister discipline information systems. However, these studies have mainly focused on research activities; they have not attempted to compare curricula in both disciplines.With the change of the political and economic system in the former Soviet Union and the introduction of courses of studies in business informatics in Russia it may be helpful to compare the German with the Russian approach to teaching business informatics.The objective of this paper is to compare bachelor studies in business informatics at selected universities in Russia and Germany.This paper contains the outline of the history of business informatics as a scientific discipline in Russia and Germany, a description of professional organizations, standards, and guidelines relevant for business informatics in both countries. Special attention is given to an overview of students studying business informatics, a description of time scales and grading scales and the structure of teaching plans in Russia and Germany. The paper contains the explanation of the method used to analyze and compare bachelor studies at ten German and ten Russian universities. Findings of the analysis concern details of bachelor studies in business informatics at German and Russian universities and highlight similarities and differences.", "num_citations": "3\n", "authors": ["1542"]}
{"title": "Моделирование современного рынка программного обеспечения\n", "abstract": " Повсеместное развитие информационных технологий привело к тому, что уже сейчас рынок программных продуктов вышел на одно из первых мест по приоритетности развития, прибыльности и скорости роста. В связи с этим необходимость систематического изучения этого рынка, выявления основных детерминант его функционирования с целью анализа становится все более актуальной. Одним из ключевых факторов, сдерживающих развитие отрасли, является наличие развитого рынка пиратского программного обеспечения. Вопреки расхожему мнению, от наличия пиратских версии программных продуктов страдают не только сами разработчики программного обеспечения. Чем больше распространена нелицензионная продукция, тем ниже темпы развития ИT-индустрии и меньше инновационных решений внедряется в экономику. В свою очередь результаты отставания этой отрасли напрямую сказываются и на экономике в целом: речь идет о колоссальных финансовых потерях государственного бюджета, упущенных возможностях для роста экономики, технологическом отставании от других государств. В статье представлены две модели, описывающие поведение участников рынка программного обеспечения, которые позволяют учитывать подходы к ценообразованию на рынке, включающем не только лицензионные продукты, но и пиратские копии. Оценка результатов моделирования проведена на примерах, отражающих возможные стратегии продвижения программных продуктов со стороны компаний-разработчиков.", "num_citations": "3\n", "authors": ["1542"]}
{"title": "Моделирование рынка программного обеспечения при наличии внешнего сетевого эффекта и компьютерного пиратства\n", "abstract": " Интенсивный рост применения продуктов информационной сферы сопровождается и такими негативными последствиями, как пиратство. Помимо известных способов борьбы с этим явлением значительным потенциалом обладают меры, применяемые компаниями-производителями и основанные на результатах научных методов анализа.", "num_citations": "3\n", "authors": ["1542"]}
{"title": "How SaaS Companies Price Their Products: Insights from an Industry Study\n", "abstract": " Pricing is one of the business and product strategy elements to achieve both financial performance and competitive advantage. The transition towards the Software-as-a-Service model has unlocked new opportunities for pricing software products. Conflicting recommendations from existing studies and industry experts make it challenging for SaaS providers to design and implement the pricing of their services. SaaS providers have come a long way in adapting their pricing practices to the new paradigm that assumes the offering of service instead of selling software as a product. This paper explores how SaaS providers package and price their products by reviewing the pricing information of 220 SaaS providers. The study reveals that SaaS companies are relatively heterogeneous in the way they price their products and the pricing practices of SaaS providers within the same size and product type could differ …", "num_citations": "2\n", "authors": ["1542"]}
{"title": "Towards a SaaS pricing cookbook: a multi-vocal literature review\n", "abstract": " Informed SaaS pricing decision-making requires the involvement of different business units and integrated pricing approaches. Achieving both appears to be challenging for a lot of SaaS providers, and despite its declared importance, pricing is one of the most under-managed business processes. Small and medium-sized companies do not have the resources for or the understanding of how to make informed decisions on pricing strategy and tactics. Pricing is a topic of interest in several research domains including economics, management science, digital and service marketing, and, increasingly, in software engineering. Still, the lack of integration between studies creates inconsistency in research. A comprehensive SaaS pricing body of knowledge is missing, as is a coherent action-oriented “Cookbook”. This multi-vocal literature review both brings together results from these research domains and …", "num_citations": "2\n", "authors": ["1542"]}
{"title": "Decision-making in software product management: Identifying research directions from practice.\n", "abstract": " Previous studies on software product management (SPM) domain have provided an extensive picture of the work of a software product manager. Still, little evidence exists about what principles should guide their decisions. A product manager’s decision-making has a certain level of subjectivity based on managerial intuition. However, sustainable software product development requires effective long-term decision-making practices. Requirements engineering, as well as release planning and roadmapping, are SPM areas with the highest level of evidence-based decision-making. Still, the clear understanding of evidencebased decision-making practices is missing. The paper provides an analysis of decision-making related to SPM, reveals a spectrum of attitudes and approaches and reports assumptions on whether SPM is based on intuition or if it is evidencebased.", "num_citations": "2\n", "authors": ["1542"]}
{"title": "Продуктовая стратегия компании-производителя программного обеспечения при наличии внешнего сетевого эффекта и компьютерного пиратства\n", "abstract": " В статье представлена модель, в динамике описывающая процесс взаимодействия между компанией-производителем программного продукта (ПП) и пользователей на рынке в случае наличия сетевого эффекта и компьютерного пиратства. Предложенная модель используется для анализа и формирования оптимальной стратегии компании-производителя в отношении политики выпуска бесплатных ознакомительных версий ПП. Выпуск на рынок бесплатной ознакомительной версии ПП может оказаться эффективным инструментом повышения его распространения, борьбы с пиратством и повышения выручки от продажи коммерческих версий ПП. Как правило, потенциальные пользователи могут оценить полезность применения ПП лишь после его использования в течение некоторого промежутка времени. И зачастую потребители принимают решение об использовании пиратской версии из-за желания безвозмездно попробовать тот или иной ПП. Кроме того, следует отметить, что из-за наличия сетевого эффекта общая ценность программного продукта для пользователя зависит от общего числа пользователей данного ПП. В этой ситуации компании-производителю ПП может быть выгодно выпустить на рынок помимо коммерческой версии еще и бесплатную ознакомительную его версию. Анализ модели позволяет сделать однозначный вывод о том, что на ранней стадии распространения ПП наличие бесплатных версий может снизить спрос на его коммерческие версии, но это приведет к увеличению общего числа пользователей ПП и в конечном …", "num_citations": "2\n", "authors": ["1542"]}