{"title": "Sexual dimorphism and sexual segregation in foraging strategies of northern giant petrels, Macronectes halli, during incubation\n", "abstract": " Giant petrels (Macronectes spp.) are the most sexually dimorphic of all seabirds. We used satellite‐tracking and mass change during incubation to investigate the influence of sexual size dimorphism, in terms of the intersexual food competition hypothesis, on foraging and fasting strategies of northern giant petrels at South Georgia. Females foraged at sea whereas males foraged mainly on the South Georgia coast, scavenging on seal and penguin carcasses. Foraging effort (flight speed, distance covered, duration of foraging trips) was greater for females than for males. In contrast, foraging efficiency (proportionate daily mass gain while foraging) was significantly greater for males than for females. Females were significantly closer to the desertion mass threshold than males and could not compensate for the mass loss during the incubation fast while foraging, suggesting greater incubation costs for females than for …", "num_citations": "293\n", "authors": ["901"]}
{"title": "Satellite tracking of wandering albatrosses (Diomedea exulans) in the South Atlantic\n", "abstract": " The movements of two wandering albatrosses, one of each sex, breeding at South Georgia, were tracked using satellite telemetry, particularly to assess whether such birds could be at risk from longline fishing operations in the subtropics. Full details of the performance (number and quality of uplinks) of the Toyocom transmitters are provided, together with data on flight speeds and night and daytime travel by the albatrosses. The female, tracked for seventeen days—covering three foraging trips totalling 13951 km - had a much more northerly distribution than the male, which made two trips to sea during the same period and travelled a minimum distance of 9280 km. On one trip the female frequented the area off Brazil known to be used for longline fisheries. The distributional differences between the sexes support earlier suggestions, based on at-sea observations, that the observed high mortality rates of South …", "num_citations": "213\n", "authors": ["901"]}
{"title": "Population dynamics of Black‐browed and Grey‐headed Albatrosses Diomedea melanophris and D. chrysostoma at Bird Island, South Georgia\n", "abstract": " Population dynamics of Black-browed and Grey-headed Albatrosses Diomedea melanophris and D. chrysostoma were studied at Bird Island, South Georgia, for 17 consecutive years (1975-1991). Over this period, almost all the Grey-headed Albatross colonies decreased at an average rate of 1.8% per annum. Although the total Black-browed Albatross population increased (at 0.8% pa), 14 of the 23 colonies (including both study colonies) decreased. Black-browed Albatrosses follow an annual breeding cycle: over 80% of birds successful in rearing a chick and 75% of those failing to do so returned to breed the next year, 5-10% of both categories delayed one further year (even when still paired). Greyheaded Albatrosses are essentially biennial:< 1% of successful birds bred the next year, 68% returned to breed 2 years later, 11% the next and 5% not until the fourth year. In contrast, over 50% of birds that failed to …", "num_citations": "196\n", "authors": ["901"]}
{"title": "The pelagic distribution of South Georgia albatrosses and their relationships with fisheries\n", "abstract": " The pelagic distribution of South Georgia albatrosses and their relationships with fisheries - NERC Open Research Archive nerc.ac.uk Natural Environment Research Council NERC open research archive Home About Browse Search Latest Additions Policies Statistics Help Contact Us ORCID Staff Login The pelagic distribution of South Georgia albatrosses and their relationships with fisheries Prince, PA; Croxall, JP; Trathan, PN; Wood, AG. 1998 The pelagic distribution of South Georgia albatrosses and their relationships with fisheries. In: Robertson, G.; Gales, R., (eds.) Albatross biology and conservation. Chipping Norton, NSW, Surrey Beatty, 137-167. Full text not available from this repository. (Request a copy) Item Type: Publication - Book Section Programmes: BAS Programmes > Pre 2000 programme Date made live: 11 Dec 2013 12:24 +0 (UTC) URI: http://nora.nerc.ac.uk/id/eprint/504235 Actions (login required…", "num_citations": "195\n", "authors": ["901"]}
{"title": "Quantifying habitat use in satellite‐tracked pelagic seabirds: application of kernel estimation to albatross locations\n", "abstract": " We develop a new approach to quantifying habitat use within the foraging ranges of satellite‐tracked seabirds. We applied kernel estimation techniques to 167 days (3738 locations) of data from Black‐browed and Grey‐headed albatrosses Diomedea melanophris and  D. chrysostoma during the chick‐rearing period of the breeding  cycle at South Georgia. At this time the activity range of these two  species covers an estimated 440 000 and 640 000  km2, respectively, with very substantial overlap. In contrast,  kernel estimation reveals that the main foraging areas of these two  sympatric, congeneric species are very distinct. Based on location  density categories accounting for 50% of locations, the foraging areas  cover c. 81 500 and c. 119 700 km2, respectively, with 42% and 50% of the range of one species overlapping with that of the other.", "num_citations": "191\n", "authors": ["901"]}
{"title": "Contrasting foraging strategies of gannets Morus bassanus at two North Atlantic colonies: foraging trip duration and foraging area fidelity\n", "abstract": " Seabirds may be able to increase their foraging efficiency by learning the whereabouts of predictable sources of prey and returning repeatedly to these locations. The occurrence of such foraging area fidelity has been little studied, particularly for pelagic species. We used satellite telemetry to study foraging behaviour and foraging area fidelity of individual chick-rearing gannets in the North Sea (at the Bass Rock, SE Scotland) and in the Celtic Sea (at Great Saltee, SE Ireland), 2 areas that differ in the distribution of prey. Foraging ranges of adults covered a wide area of ocean up to a maximum range of 540 km at the Bass Rock and 240 km at Great Saltee. At the Bass Rock, individual birds foraged in a single direction or at most in 2 distinct directions, with very similar bearings on successive trips in each direction, significant differences in bearings between individuals and significant repeatability in distances travelled …", "num_citations": "176\n", "authors": ["901"]}
{"title": "Foraging partitioning between giant petrels Macronectes spp. and its relationship with breeding population changes at Bird Island, South Georgia\n", "abstract": " We satellite-tracked the foraging trips of males and females of the 2 sibling species of giant petrels, Macronectes halli and M. giganteus, breeding sympatrically at Bird Island (South Georgia, Antarctica), during the incubation period (November-December). Size of the activity range in addition to speed and distance covered on foraging trips were similar between the species, but were lower for males than for females in both species. Sex-specific differences agree with previous observations on diets and on attendance at seal carcasses, suggesting that females mainly forage at sea, whereas males mainly scavenge on the coast. Overall, however, the foraging ecology of both species seems very similar. Interspecific and intersexual competition may be reduced by the limited overlap in the at-sea range, with southern giant petrels foraging further south than did northern giant petrels, and females further west than males …", "num_citations": "165\n", "authors": ["901"]}
{"title": "Foraging ranges, diets and feeding locations of gannets Morus bassanus in the North Sea: evidence from satellite telemetry\n", "abstract": " We used satellite telemetry to examine the foraging ranges, feeding locations and travel speeds of 17 chick-rearing gannets Morus bassanus from the Bass Rock, SE Scotland. Regurgitates indicated that birds at the colony exploited a wide range of prey, frequently including 0-group sandeels (< 10 cm in length) and mature mackerel and herring (up to 33 cm) in the diet. The maximum foraging range was 540 km, and the mean distance to the furthest point from the colony on any one trip was 232 km. Destinations of foraging trips covered a wide area of the North Sea, with a non-random distribution and a higher than expected proportion of trips to the NE (generally in the vicinity of Buchan Deep and Halibut Bank) and to the SE (mostly between Farne Deep, Dogger Bank and Outer Silver Pit) of the colony. Foraging trips lasted 13 to 84 h, and trip duration explained 94% of the variance in maximum distance from the …", "num_citations": "165\n", "authors": ["901"]}
{"title": "Population changes in albatross at South Georgia\n", "abstract": " CiNii 論文 - Population changes in albatross at South Georgia CiNii 国立情報学研究所 学術情報 ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規 登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務 の再開について Population changes in albatross at South Georgia CROXALL JP 被引用文献: 1件 著者 CROXALL JP 収録刊行物 Albatross Biology and Conservation Albatross Biology and Conservation, 1998 Surrey Beatty and Sons 被引用文献: 1件中 1-1件を 表示 1 Interannual variability of the South Georgia marine ecosystem : biological and physical sources of variation in the abundance of krill MURPHY EJ , WATKINS JL , REID K. , TRATHAN PN , EVERSON I. , CROXALL JP , PRIDDLE J. , BRANDON MA , BRIERLEY AS , HOFMANN E. …", "num_citations": "159\n", "authors": ["901"]}
{"title": "The importance of the Patagonian Shelf for top predator species breeding at South Georgia\n", "abstract": " 1. The rich zooplankton, fish and squid resources on the Patagonian Shelf sustain substantial populations of largely resident seabirds and marine mammals. These habitats are also visited seasonally by similar species from elsewhere but few data exist on their status and origin. Recent studies, using satellite‐tracking to determine foraging ranges and feeding areas of seabirds and marine mammals breeding at South Georgia, have shown that several species make substantial use of the waters of the Patagonian Shelf.  2. Wandering albatrosses use shelf‐edge areas year‐round with direct observations of both sexes of almost all age classes, including, breeding, pre‐breeding and non‐breeding individuals. White‐chinned petrels and female Northern and Southern giant petrels mainly visit during incubation and post‐breeding, particularly to the Falklands Current (White‐chinned petrels) and to upwelling areas …", "num_citations": "145\n", "authors": ["901"]}
{"title": "Foraging ecology and interactions with fisheries of wandering albatrosses (Diomedea exulans) breeding at South Georgia\n", "abstract": " Knowledge about the areas used by the foraging wandering albatross, Diomedea exulans, its prey and overlap with longline fisheries is important information not only for the conservation of this species but also for furthering our understanding of the ecology of its prey. We attached satellite‐tracking devices and activity recorders to wandering albatrosses between May and July of 1999 and 2000 (years of differing food availability around South Georgia) in order to assess inter‐annual variation in the main foraging areas, association with oceanographic features (i.e. fronts, bathymetry), diet and interactions with fisheries. The overall foraging patterns of the tracked birds were similar in 1999 and 2000, ranging between southern Brazil (28°S) and the Antarctic Peninsula (63°S) and between the waters off Tristan da Cunha (19°W) and the Patagonian Shelf and oceanic waters south of Cape Horn (68°W) in the South …", "num_citations": "108\n", "authors": ["901"]}
{"title": "Age‐related variation in reproductive traits in the wandering albatross: Evidence for terminal improvement following senescence\n", "abstract": " The processes driving age‐related variation in demographic rates are central to understanding population and evolutionary ecology. An increasing number of studies in wild vertebrates find evidence for improvements in reproductive performance traits in early adulthood, followed by senescent declines in later life. However, life history theory predicts that reproductive investment should increase with age as future survival prospects diminish, and that raised reproductive investment may have associated survival costs. These non‐mutually exclusive processes both predict an increase in breeding performance at the terminal breeding attempt. Here, we use a 30‐year study of wandering albatrosses (Diomedea exulans) to disentangle the processes underpinning age‐related variation in reproduction. Whilst highlighting the importance of breeding experience, we reveal senescent declines in performance are followed …", "num_citations": "103\n", "authors": ["901"]}
{"title": "The summer zooplankton community at South Georgia: biomass, vertical migration and grazing\n", "abstract": " Zooplankton abundance and biomass were determined during January 1990 at two stations to the north-west of South Georgia using a Longhurst Hardy Plankton Recorder (LHPR). At both shelf and oceanic station sites, zooplankton biomass, (excluding Euphausia superba), was found to be ca. 13 g dry mass m−2. Copepods and small euphausiids dominated the catches. These estimates are over 4 times higher than values generally reported for the Southern Ocean and may reflect firstly, the high productivity of the study area, secondly, the time of year, summer, when biomass for many species is maximal, and thirdly, the high sampling efficiency of the LHPR. Principal components analysis disclosed similarities and differences between adjacent depth strata in terms of abundance, biomass and species composition. At both stations most variability occurred in the mixed layer (0–60 m) and thermocline (60 …", "num_citations": "92\n", "authors": ["901"]}
{"title": "Feeding strategies and diets of breeding grey-headed and wandering albatrosses at South Georgia\n", "abstract": " The foraging areas and diets of the grey-headed albatross Thalassarche chrysostoma and wandering albatross Diomedea exulans were studied in March/April 2000 at Bird Island, South Georgia, during their respective chick-rearing and brood-guard periods. Oceanographically, March/April 2000 was abnormal, with warm conditions close to South Georgia. These conditions affected albatross foraging behaviour, particularly that of grey-headed albatrosses. Both species tended to forage in different areas of the ocean, with significant differences in trip durations. Grey-headed albatrosses (n=9) foraged mainly in Antarctic waters (predominantly shelf waters of the South Shetland Islands and Antarctic Peninsula, and also in oceanic waters around South Georgia), feeding mainly on krill (Euphausia superba; 77% by mass). Foraging trips lasted 13.3 days (range: 5–26 days), far longer than the 1–3 days found in …", "num_citations": "83\n", "authors": ["901"]}
{"title": "Foraging location and range of White‐chinned Petrels Procellaria aequinoctialis breeding in the South Atlantic\n", "abstract": " The foraging range and principal feeding areas of White‐chinned Petrels breeding at South Georgia were determined using satellite telemetry. Foraging trips during incubation lasted 12–15 days and covered 3000–8000 km and 2–11 days and 1100–5900 km during chick‐rearing. Adults covered less distance per day during chick‐rearing (71 km) than during incubation (91 km) but the proportion covered at night (47%) was the same. Mean (31–34 km/h) and maximum (80 km/h) flight velocities were similar during both periods of the breeding season and during day and night. Between incubation shifts, White‐chinned Petrels travelled to the Patagonian shelf; during chick‐rearing they foraged more extensively. Most locations were between 30° to 55°W and 52° to 60°W around South Georgia/Shag Rocks and south to the South Orkney Islands. Diet samples from known foraging locations suggested birds fed mainly …", "num_citations": "83\n", "authors": ["901"]}
{"title": "An anticyclonic circulation above the northwest Georgia rise, Southern Ocean\n", "abstract": " Data from a variety of sources reveal a warm‐core anticyclonic circulation above the Northwest Georgia Rise (NWGR), an ∼2000‐m high bathymetric feature north of South Georgia. The sense of the circulation is opposite to the general cyclonic flow in the Georgia Basin. The circulation shows the characteristics of a stratified Taylor column: dimensional analysis shows that the local bathymetry and hydrography are conducive to the formation of such. ERS2 altimeter data show that the column, whilst not fully permanent, is nonetheless a recurring feature. High concentrations of chlorophyll‐a are observed at the centre of the circulation, indicating that the modulation of the physical environment has significant consequences for the local biogeochemical system via enhanced primary production. Enhanced chlorophyll‐a extends in a long plume from the NWGR along pathways indicated by drifters; this passive …", "num_citations": "73\n", "authors": ["901"]}
{"title": "A geographical information system (GIS) atlas of cephalopod distribution in the Southern Ocean\n", "abstract": " //static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS0954102099000097/resource/name/firstPage-S0954102099000097a.jpg", "num_citations": "70\n", "authors": ["901"]}
{"title": "Global phenological insensitivity to shifting ocean temperatures among seabirds\n", "abstract": " Reproductive timing in many taxa plays a key role in determining breeding productivity 1, and is often sensitive to climatic conditions 2. Current climate change may alter the timing of breeding at different rates across trophic levels, potentially resulting in temporal mismatch between the resource requirements of predators and their prey 3. This is of particular concern for higher-trophic-level organisms, whose longer generation times confer a lower rate of evolutionary rescue than primary producers or consumers 4. However, the disconnection between studies of ecological change in marine systems makes it difficult to detect general changes in the timing of reproduction 5. Here, we use a comprehensive meta-analysis of 209 phenological time series from 145 breeding populations to show that, on average, seabird populations worldwide have not adjusted their breeding seasons over time (− 0.020 days yr− 1) or in …", "num_citations": "62\n", "authors": ["901"]}
{"title": "Additive effects of climate and fisheries drive ongoing declines in multiple albatross species\n", "abstract": " Environmental and anthropogenic factors often drive population declines in top predators, but how their influences may combine remains unclear. Albatrosses are particularly threatened. They breed in fast-changing environments, and their extensive foraging ranges expose them to incidental mortality (bycatch) in multiple fisheries. The albatross community at South Georgia includes globally important populations of three species that have declined by 40–60% over the last 35 years. We used three steps to deeply understand the drivers of such dramatic changes: (i) describe fundamental demographic rates using multievent models, (ii) determine demographic drivers of population growth using matrix models, and (iii) identify environmental and anthropogenic drivers using ANOVAs. Each species was affected by different processes and threats in their foraging areas during the breeding and nonbreeding seasons …", "num_citations": "55\n", "authors": ["901"]}
{"title": "The foraging behaviour and energetics of wandering albatrosses brooding chicks\n", "abstract": " The energy expenditure of ten (five male, five female) wandering albatrosses (Diomedea exulans Linnaeus 1758) brooding chicks on Bird Island, South Georgia, was measured using doubly-labelled water. At-sea foraging behaviour was measured in the same individuals using satellite telemetry and leg-mounted activity recorders. Mean mass-specific daily energy expenditure was 341 kJ kg−1 day−1 during a mean of 4.12 days at sea and did not differ between the sexes. This is significantly lower than previously reported for the species and the lowest recorded for any albatross. There were no significant relationships between energy expenditure and the proportion of time spent flying (59.7%), distance flown (1448 km) or average speed (16.5 km h−1) suggesting that flying is not the most energetically expensive activity during foraging trips.", "num_citations": "50\n", "authors": ["901"]}
{"title": "A comprehensive large‐scale assessment of fisheries bycatch risk to threatened seabird populations\n", "abstract": " Incidental mortality (bycatch) in fisheries remains the greatest threat to many large marine vertebrates and is a major barrier to fisheries sustainability. Robust assessments of bycatch risk are crucial for informing effective mitigation strategies, but are hampered by missing information on the distributions of key life‐history stages (adult breeders and non‐breeders, immatures and juveniles).  Using a comprehensive biologging dataset (1,692 tracks, 788 individuals) spanning all major life‐history stages, we assessed spatial overlap of four threatened seabird populations from South Georgia, with longline and trawl fisheries in the Southern Ocean. We generated monthly population‐level distributions, weighting each life‐history stage according to population age structure based on demographic models. Specifically, we determined where and when birds were at greatest potential bycatch risk, and from which fleets …", "num_citations": "44\n", "authors": ["901"]}
{"title": "Diurnal and nocturnal territoriality in the Grey Plover at Teesmouth, as revealed by radio telemetry\n", "abstract": " METHODSThis study was carried out on the estuary of the River Tees in NE England (54037'N, 1012'W)(Fig. 1), particularly on Seal Sands, an area of 140 ha of mudflats remaining after extensive reclamation of intertidal land. Seal Sands is exposed and available to foraging shorebirds for 7-8 h in each tidal cycle. If birds cannot obtain enough food during that period of exposure, they may move to the higher tidal flats of North Gare as the tide rises.Birds were caught, individually color-ringed and had radio transmitters attached using a harness similar to that used by Brander (1968). Bird locations were monitored from the ground using an AVM LA 12 receiver and a 3 element hand-held Yagi antenna. Observations were made with 10 x 50 binoculars and a 15-60 x 60 telescope. At least 14 d elapsed before any data were used from the radio-tagged birds, to reduce the chance of including abnormal short-term effects of …", "num_citations": "42\n", "authors": ["901"]}
{"title": "The origins of knots Calidris canutus in arctic Norway in spring\n", "abstract": " Knots occurring in north Norway in spring have been presumed to breed in Siberia. We find that, based on their body size, ringing locations and migration timing, Knots in Balsfjord, north Norway, in May belong to the Nearctic breeding population C. c. islandica. Some moult in autumn on the Wash and Wadden Sea, and overwinter in Britain, notably at Teesmouth and the Wash. Some may reach Balsfjord in May after a direct flight from the Wash. 15 000-28 000 Knots are present for 2-3 wk in May, departing between 25-30 May, making Balsfjord a staging site of major international importance to Knots. The breeding origins of at least 30 000 Knots present in Porsangerfjord (250 km NE) are unknown, but migration timing and ringing location indicates possible Nearctic origin for these also.", "num_citations": "39\n", "authors": ["901"]}
{"title": "Euphausiid life cycles and distribution around South Georgia\n", "abstract": " Euphausiid life histories and distribution in the vicinity of South Georgia were studied from a series of samples taken in April 1980, November–December 1981, and July–August 1983. Size frequency data indicated a two-year life cycle for Euphausia frigida and the possibility of a three-year cycle for E. triacantha. The genus Thysanoessa was represented by a mixture of T. macrura and the dominant T. vicina. A one-year life cycle is proposed for the latter but that of the former is unknown. Spawning in E. frigida and to a lesser extent Thysanoessa spp. commenced as early as July and euphausiid calyptopes were a feature of the plankton for much of the year. E. superba eggs were found in low abundance over the shelf to the north of the island, but no hatched larvae were found. Behaviour patterns such as diurnal and seasonal migration partially confounded attempts to relate euphausiid distribution to environmental …", "num_citations": "35\n", "authors": ["901"]}
{"title": "Sex‐related variation in the vulnerability of wandering albatrosses to pelagic longline fleets\n", "abstract": " The population of wandering albatrosses Diomedea exulans at South Georgia is decreasing because of bycatch in longline fisheries. Until at least the early 1990s, the survival rate of females was lower than males, consistent with the adult female‐biased bycatch reported for fisheries operating around the Brazil‐Falklands Confluence (BFC). Here we use extensive tracking data (1990–2012) from breeding birds at South Georgia to investigate overlap with longline fishing effort reported to the International Commission for the Conservation of Atlantic Tunas (ICCAT). Using data from multiple years, we conclude that breeding females are at higher risk than males from all the main pelagic longline fleets in the south‐west Atlantic. Our overlap index (based on fishing effort and bird distributions) correlated positively with numbers of ringed birds reported dead on longliners, indicating that the metric was a good proxy of …", "num_citations": "32\n", "authors": ["901"]}
{"title": "Breeding frequency in Grey‐headed Albatrosses Thalassarche chrysostoma\n", "abstract": " Although Grey‐headed Albatrosses Thalassarche chrysostoma are usually regarded as biennial breeders, taking a year off following a successful breeding attempt, a small proportion of successful birds attempt to breed annually. This proportion was higher at Marion Island (5.4%) than at Bird Island, South Georgia (1.0%), suggesting that conditions are more favourable at Marion Island. This hypothesis is supported by higher average breeding success and shorter lags following both successful and failed breeding attempts at Marion Island. Factors favouring reproduction at Marion Island may include reduced intraspecific competition (given the much smaller breeding population) and/or more predictable food supply (owing to production of meso‐scale eddies associated with the Indian Ocean Ridge). Although annual breeding appeared to increase the risk of adult mortality, with several birds that attempted to breed …", "num_citations": "32\n", "authors": ["901"]}
{"title": "Life span and reproductive cost explain interspecific variation in the optimal onset of reproduction\n", "abstract": " Fitness can be profoundly influenced by the age at first reproduction (AFR), but to date the AFR–fitness relationship only has been investigated intraspecifically. Here, we investigated the relationship between AFR and average lifetime reproductive success (LRS) across 34 bird species. We assessed differences in the deviation of the Optimal AFR (i.e., the species‐specific AFR associated with the highest LRS) from the age at sexual maturity, considering potential effects of life history as well as social and ecological factors. Most individuals adopted the species‐specific Optimal AFR and both the mean and Optimal AFR of species correlated positively with life span. Interspecific deviations of the Optimal AFR were associated with indices reflecting a change in LRS or survival as a function of AFR: a delayed AFR was beneficial in species where early AFR was associated with a decrease in subsequent survival or …", "num_citations": "31\n", "authors": ["901"]}
{"title": "Contrasting drivers of reproductive ageing in albatrosses\n", "abstract": " 1. Age‐related variation in reproductive performance is ubiquitous in wild vertebrate populations and has important consequences for population and evolutionary dynamics.", "num_citations": "26\n", "authors": ["901"]}
{"title": "Hybridization and back-crossing in giant petrels (Macronectes giganteus and M. halli) at Bird Island, South Georgia, and a summary of hybridization in seabirds\n", "abstract": " Hybridization in natural populations provides an opportunity to study the evolutionary processes that shape divergence and genetic isolation of species. The emergence of pre-mating barriers is often the precursor to complete reproductive isolation. However, in recently diverged species, pre-mating barriers may be incomplete, leading to hybridization between seemingly distinct taxa. Here we report results of a long-term study at Bird Island, South Georgia, of the extent of hybridization, mate fidelity, timing of breeding and breeding success in mixed and conspecific pairs of the sibling species, Macronectes halli (northern giant petrel) and M. giganteus (southern giant petrel). The proportion of mixed-species pairs varied annually from 0.4–2.4% (mean of 1.5%), and showed no linear trend with time. Mean laying date in mixed-species pairs tended to be later than in northern giant petrel, and always earlier than in southern giant petrel pairs, and their breeding success (15.6%) was lower than that of conspecific pairs. By comparison, mixed-species pairs at both Marion and Macquarie islands always failed before hatching. Histories of birds in mixed-species pairs at Bird Island were variable; some bred previously or subsequently with a conspecific partner, others subsequently with a different allospecific partner, and some mixed-species pairs remained together for multiple seasons. We also report the first verified back-crossing of a hybrid giant petrel with a female northern giant petrel. We discuss the potential causes and evolutionary consequences of hybridization and back-crossing in giant petrels and summarize the incidence of back-crossing in other …", "num_citations": "26\n", "authors": ["901"]}
{"title": "The distribution of the Euchaetidae (Copepoda: Calanoida) around south Georgia\n", "abstract": " Fourteen species of the genus Euchaeta (Copepoda: Calanoida) were encountered during two cruises undertaken around South Georgia during November–December 1981 (Summer) and July–August 1983 (Winter). All 14 species were present in summer but only nine in winter. The distribution of the majority of species centered on the mesopelagic (500–1000 m) and bathypelagic (1000–2000 m) depth horizons. During both cruises, four species, Euchaeta Antarctica, E. biloba, E. rasa and E. farrani were numerically dominant. Although all four species had a wide depth distribution, E. Antarctica and E. biloba had distributions centered around the 250–500 m (epi-mesopelagic) and mesopelagic depth horizons. E. rasa was most abundant in the mesopelagic whereas E. farrani, the largest species encountered, was centered on the mesopelagic and bathypelagic depth horizons. Two species, E. Antarctica …", "num_citations": "24\n", "authors": ["901"]}
{"title": "Changes in distribution, relative abundance, and species composition of large whales around South Georgia from opportunistic sightings: 1992 to 2011\n", "abstract": " To examine the general population trends of large whales in South Georgia waters, 2 opportunistic data sets of sightings of large whales from 1991 to 2010 around South Georgia were analyzed: the South Georgia Museum log of whale sightings and the British Antarctic Survey whale sighting reports from the Bird Island research station. Bird Island abuts the northwest tip of South Georgia. The 4 most reported species in both data sets were southern right whale Eubalaena australis, humpback whale Megaptera novaeangliae, minke whale Balaenoptera bonaerensis, and killer whale Orcinus orca. These totally independent data sets showed comparable changes in abundance through time; thus, despite a lack of sighting effort records, inferences could be drawn about changes in relative abundance. The number of reported sightings per 5 yr period from both data sets increased from the 1991 to 1995 period through …", "num_citations": "22\n", "authors": ["901"]}
{"title": "Interannual variations in cephalopod consumption by albatrosses at South Georgia: implications for future commercial exploitation of cephalopods\n", "abstract": " Assessing the consumption of prey by predators in the marine environment is key to fisheries assessment and management. Although environmental and ecological variations can affect the consumption of certain prey by albatrosses interannually, this issue has not been addressed to date. In the present study, the interannual consumption of cephalopods by grey-headed and black-browed albatrosses was assessed while breeding at South Georgia between 1996 and 2000, by comparing consumption estimates from a reparameterised version of the South Georgia Seabird Impact Assessment (SGSIA) model. The reparameterised model showed that there are considerable interannual variations in cephalopod consumption in both albatross species, with the highest consumption occurring in 1996 (5787 tonnes; for black-browed albatrosses) and 1997 (11 627 tonnes; for grey-headed albatrosses), and the lowest in …", "num_citations": "22\n", "authors": ["901"]}
{"title": "Origin, age, sex and breeding status of wandering albatrosses (Diomedea exulans), northern (Macronectes halli) and southern giant petrels (Macronectes giganteus) attending …\n", "abstract": " A total of 547 sightings of 291 banded wandering albatrosses Diomedea exulans and 21 sightings of 14 banded giant petrels Macronectes spp. were made from toothfish longliners operating on the southern Patagonian Shelf during 2001–2005. This included 25% of the wandering albatrosses with Darvic bands that bred at Bird Island (South Georgia) during this period. Thirteen of the northern Macronectes halli and southern giant petrels Macronectes  giganteus had been banded at South Georgia, and there was one sighting of a southern giant petrel from Argentina. Male and female wandering albatrosses of all age classes except young birds (<15 years old) were equally likely to attend longline vessels. Most sightings of all age classes were made during the incubation period and fewest during the brood period. Eighty-six percent of birds sighted had bred at least once before, with half currently breeding …", "num_citations": "22\n", "authors": ["901"]}
{"title": "Areas and scales of interactions between albatrosses and the marine environment: species, populations and sexes\n", "abstract": " Areas and scales of interactions between albatrosses and the marine environment: species, populations and sexes - NERC Open Research Archive nerc.ac.uk Natural Environment Research Council NERC open research archive Home About Browse Search Latest Additions Policies Statistics Help Contact Us ORCID Staff Login Areas and scales of interactions between albatrosses and the marine environment: species, populations and sexes Prince, PA; Weimerskirch, H.; Wood, AG; Croxall, JP. 1999 Areas and scales of interactions between albatrosses and the marine environment: species, populations and sexes. In: Proceedings of 22nd Ornithological congress, Durban, August 1998. Johannesburg, BirdLife South Africa, 17pp. Full text not available from this repository. (Request a copy) Item Type: Publication - Book Section Programmes: BAS Programmes > Pre 2000 programme Additional Keywords: Diomedea …", "num_citations": "19\n", "authors": ["901"]}
{"title": "Sex‐specific effects of fisheries and climate on the demography of sexually dimorphic seabirds\n", "abstract": " Many animal taxa exhibit sex‐specific variation in ecological traits, such as foraging and distribution. These differences could result in sex‐specific responses to change, but such demographic effects are poorly understood.  Here, we test for sex‐specific differences in the demography of northern (NGP, Macronectes halli) and southern (SGP, M. giganteus) giant petrels – strongly sexually size‐dimorphic birds that breed sympatrically at South Georgia, South Atlantic Ocean. Both species feed at sea or on carrion on land, but larger males (30% heavier) are more reliant on terrestrial foraging than the more pelagic females. Using multi‐event mark‐recapture models, we examine the impacts of long‐term changes in environmental conditions and commercial fishing on annual adult survival and use two‐sex matrix population models to forecast future trends.  As expected, survival of male NGP was positively affected by …", "num_citations": "18\n", "authors": ["901"]}
{"title": "Intrinsic determinants of a population trend in timing of breeding in the wandering albatross\n", "abstract": " Numerous studies of wild animal species have documented that population level responses to environmental change are underpinned by individual level phenotypic plasticity. However, where the relationship between an individual trait and a climate variable occurs when both show a trend over time, phenotypic plasticity may be confounded by ageing. We investigated between and within individual change in laying date in the wandering albatross Diomedea exulans, a long‐lived species experiencing a dramatic decline in population size. Laying date has advanced over the last three decades. A mean‐centering analysis demonstrated that this pattern was driven by within‐individual changes as opposed to appearance or disappearance of phenotypes. Furthermore, a lack of between individual effect suggested the change resulted from ageing as opposed to phenotypic plasticity. Females varied significantly in rate …", "num_citations": "18\n", "authors": ["901"]}
{"title": "Age, sex and status of wandering albatrosses Diomedea exulans L. in Falkland Islands waters\n", "abstract": " Records (by a scientific observer on a longline fishing vessel around the Falkland Islands) of 86 different individually colour-banded wandering albatrosses from South Georgia, provide new insights into the use of the waters of the Patagonian shelf slope by birds from breeding grounds some 600 km to the south-east across the Antarctic Polar Front. Birds recorded were aged from 3–39 years, almost the full range (except 1 and 2 year olds) of South Georgia colour-banded birds, about 5% of whose colour-banded population was observed during the study. Immature birds (up to age 7 years) formed only 9% of the total; this may reflect relative absence from the area but might also relate to their subordinate status to adults at fishing vessels. Most birds seen were current breeders at South Georgia, including both sexes in the month prior to arrival on the breeding grounds (October), females during the pre-laying exodus …", "num_citations": "18\n", "authors": ["901"]}
{"title": "Discriminating the sex of Sanderling Calidris alba: some results and their implications\n", "abstract": " This paper presents a method for determining the sex of adult Sanderling from measurements of bill and wing length taken in the field, using a discriminant function based on birds of known sex. Discriminantly sexed samples of birds caught at Teesmouth indicated a predominance of females in the population throughout the year. The seasonal pattern of weight changes was similar in the 2 sexes, though female birds were consistently heavier than males.", "num_citations": "18\n", "authors": ["901"]}
{"title": "Cytosolic phospholipase A2α blockade abrogates disease during the tissue-damage effector phase of experimental autoimmune encephalomyelitis by its action on APCs\n", "abstract": " Cytosolic phospholipase A2α (cPLA2α) is the rate-limiting enzyme for release of arachidonic acid, which is converted primarily to PGs via the cyclooxygenase 1 and 2 pathways and to leukotrienes via the 5-lipoxygenase pathway. We used adoptive transfer and relapsing–remitting forms of experimental autoimmune encephalomyelitis (EAE), an animal model of multiple sclerosis, in two different strains of mice (SJL or C57BL/6) to demonstrate that blockade of cPLA2α with a highly specific small-molecule inhibitor during the tissue-damage effector phase abrogates the clinical manifestation of disease. Using the adoptive transfer model in SJL mice, we demonstrated that the blockade of cPLA2α during the effector phase of disease was more efficacious in ameliorating the disease pathogenesis than the blockade of each of the downstream enzymes, cyclooxygenase-1/2 and 5-lipooxygenase. Similarly, blockade of …", "num_citations": "15\n", "authors": ["901"]}
{"title": "Food consumption by predators in a CCAMLR Integrated Study Region\n", "abstract": " A detailed description of the structure and mode of operation of a model for estimating food consumption of seabird predators is provided. This model is a development of earlier ones used in the South Georgia Integrated Study Region and incorporates new features, allowing for seasonal variation in predator weight (and hence energy requirements), diet composition and prey energy content. Specimen outputs are provided, illustrating the changes produced by using these new sub-models. Results of initial sensitivity analyses indicate particular sensitivity to estimation of metabolic energy requirements. The system is directly applicable also to fur seals and could be modified to incorporate phocid seal data, when available. Prey categories are readily modifiable to sub-divide krill into sexes and maturity stages. With existing empirical data on breeding population size, diet, activity-specific energy requirements and foraging ranges, it is possible to make realistic estimates of krill consumption of penguins and fur seals during their breeding seasons within specified areas.", "num_citations": "15\n", "authors": ["901"]}
{"title": "False Killer Whales' pseudorca crassidens': Regular Visitors to Port Essington and Darwin Harbour in the Northern Territory, Australia\n", "abstract": " False Killer Whales 'Pseudorca crassidens' are usually found in offshore marine waters and there is little information about their occurrence in waters off the coast of the Northern Territory.  In the course of surveys for dolphins, False Killer Whales were observed on eight occasions in two sheltered harbours, Port Essington and Darwin Harbour.  Groups ranged from more than eight to eighty individuals and one group contained young.  These observations suggest a resident population in shallow waters, contrary to the perception that the species is oceanic and wide-ranging.", "num_citations": "14\n", "authors": ["901"]}
{"title": "Time and energy budgets of the Grey Plover (Pluvialis squatarola) at Teesmouth\n", "abstract": " The time and energy budgets of Grey Plovers (Pluvialis squatarola) at Teesmouth were investigated by observation of birds both by day and night, supplemented by additional information from a radio telemetry study and laboratory measurements of metabolic rates. The radio telemetry study of Grey Plovers confirmed that, on Seal Sands, some birds defended low water feeding territories, whilst others were non-territorial. This behaviour was maintained both diurnally and nocturnally, with territorial birds defending the same areas at night as by day. However territorial birds occasionally vacated their territories to forage on other areas at Teesmouth. Multivariate statistical methods characterised the conditions under which these birds changed foraging locations. The low-water time budgets of territorial birds were determined for both diurnal and nocturnal periods. No statistical differences could be found between these two budgets. The birds spent an extremely high (in excess of 90%) percentage of time foraging over the low water observation period. The diurnal low water time budget of non-territorial individuals was also determined and compared with that of territorial birds. The calorific intake rates of territorial birds during the daylight hours showed significant seasonal changes, characterised by a rise to a mid-winter peak, followed by a steady decline to mid March. This pattern may have been influenced by the temperature on the day of measurement. Respirometric measurements on Grey Plovers produced an estimate of their fasting metabolic rate, together with values for lower critical temperature and the rate of increase of metabolic rate with …", "num_citations": "14\n", "authors": ["901"]}
{"title": "Importance of accounting for phylogenetic dependence in multi-species mark–recapture studies\n", "abstract": " Species in comparative demography studies often have a common phylogenetic or evolutionary ancestry and hence, they cannot fully be treated as independent samples in the statistical analysis. Although the serious implication of ignoring phylogeny has long been recognized, no attempt has been made so far to account for the lack of statistical independence due to phylogeny in multi-species mark–recapture comparative demography studies. In this paper, we propose a Bayesian hierarchical model that explicitly accounts for phylogenetic dependence among species, and to correct for imperfect detection, which is a common phenomenon in free-ranging species. We illustrate the method using individual mark–recapture data collected from 16 seabird species of the order Procellariiformes. Data on body mass and phylogeny of these species are compiled from literature. We investigate the relationship between …", "num_citations": "9\n", "authors": ["901"]}
{"title": "South Georgia blue whales five decades after the end of whaling\n", "abstract": " Blue whales Balaenoptera musculus at South Georgia were heavily exploited during 20 th century industrial whaling, to the point of local near-extirpation. Although legal whaling for blue whales ceased in the 1960s, and there were indications of blue whale recovery across the wider Southern Ocean area, blue whales were seldom seen in South Georgia waters in subsequent years. We collated 30 yr of data comprising opportunistic sightings, systematic visual and acoustic surveys and photo-identification to assess the current distribution of blue whales in the waters surrounding South Georgia. Over 34000 km of systematic survey data between 1998 and 2018 resulted in only a single blue whale sighting, although opportunistic sightings were reported over that time period. However, since 2018 there have been increases in both sightings of blue whales and detections of their vocalisations. A survey in 2020 …", "num_citations": "8\n", "authors": ["901"]}
{"title": "A potential bias in log-transformed allometric equations\n", "abstract": " Many recent studies in avian ecology have used regressions with logarithmic transformations to estimate various biological parameters, particularly metabolic rate (Lasiewski & Dawson 1967, 1969, Zar 1968, Aschoff & Pohl 1970, Kendeigh et al. 1977). This paper examines a potential bias resulting from the use of such equations, and presents the appropriate methods for converting estimates from logarithmic equations back to untransformed units.", "num_citations": "7\n", "authors": ["901"]}
{"title": "Episodic, seasonal, and long term morphological changes of Coromandel beaches\n", "abstract": " The Coromandel Peninsula was subject to subdivision and development primarily since the 1960's. Much of the development that has occurred now renders protection from the existing beach systems which have typically been altered by development. Coupled with huge populations during summer, the region is of national significance therefore an understanding of coastal impacts is paramount. Analysis of the spatial and temporal variation of beaches along the eastern Coromandel Peninsula from Whangapoua in the north to Whiritoa in the south provided results ranging from single storm events to decadal scale oscillations. Beach similarity was determined by measuring parameters such as beach length, beach connectivity to neighbouring beaches, aspect, and beach slope. The analysis of variability in beach face volumes was undertaken using an extensive beach profile database collected by R. Keith Smith, Ron Ovenden and a monitoring program maintained by Environment Waikato since 1978. The database had a higher-resolution sampling interval from 1996 until present (a maximum sampling frequency of approximately bimonthly). Results showed that short term beach volume changes were explained by the beach classification devised from the Wright and Short (1984) model and available planform morphology data. Intermediate beaches overall had a greater range of variation, but had a higher frequency of low magnitude of change events. Reflective beaches had a higher frequency of large magnitude of change events and subsequently greater short term volume changes. Beaches adjacent to harbours and two outliers were …", "num_citations": "4\n", "authors": ["901"]}
{"title": "Un-crewed aerial vehicle population survey of three sympatrically breeding seabird species at Signy Island, South Orkney Islands\n", "abstract": " Surveying seabirds in polar latitudes can be challenging due to sparse human populations, lack of infrastructure and the risk of disturbance to wildlife or damage to habitats. Counting populations using un-crewed aerial vehicles (UAVs) is a promising approach to overcoming these difficulties. However, a careful validation of the approach is needed to ensure comparability with counts collected using conventional methods. Here, we report on surveys of three Antarctic bird species breeding on Signy Island, South Orkney Islands; Chinstrap (Pygoscelis antarctica) and Gentoo (Pygoscelis papua) Penguins, and the South Georgia Shag (Leucocarbo atriceps georgianus). We show that images from low-altitude UAV surveys have sufficient resolution to allow separation of Chinstrap Penguins from contiguously breeding Adélie Penguins (Pygoscelis adéliae), which are very similar in appearance when viewed from …", "num_citations": "3\n", "authors": ["901"]}
{"title": "Variation in live-capture rates of albatrosses and petrels in fisheries, post-release survival and implications for management\n", "abstract": " Bycatch of seabirds in longline fisheries includes mortalities and live captures (mainly during hauling). Excluding outliers, the latter accounts for 5–70% (mean 40.4%) of all bycaught birds in demersal, and 3–23% (mean 10.7%) in pelagic longline fisheries. The proportion that later die from injuries is unknown, and this cryptic mortality complicates efforts to quantify fisheries impacts. Over a 26-year period at South Georgia, foul-hooking indices - birds with embedded hooks or entangled among tens of thousands checked at the colony - were broadly similar in wandering albatrosses Diomedea exulans and giant petrels Macronectes spp., an order of magnitude lower in black-browed albatrosses Thalassarche melanophris and nil in two other albatross species. This likely reflected differing degrees of overlap with fisheries and interaction with gear during hauling. Indices peaked in the early-mid 2000s, then declined …", "num_citations": "3\n", "authors": ["901"]}
{"title": "Indicator beaches on the Coromandel Peninsula, New Zealand\n", "abstract": " Audiovisual material available from this site has been copied and communicated to you under a Screenrights licence pursuant to Section 113P of the Copyright Act 1968 solely for the educational purposes of your institution. No other use is authorised. For more information please contact Screenrights at [email protected] or at www. screenrights. org.", "num_citations": "3\n", "authors": ["901"]}
{"title": "Distribution and movements of South Georgia black-browed albatrosses\n", "abstract": " Distribution and movements of South Georgia black-browed albatrosses - NERC Open Research Archive nerc.ac.uk Natural Environment Research Council NERC open research archive Home About Browse Search Latest Additions Policies Statistics Help Contact Us ORCID Staff Login Distribution and movements of South Georgia black-browed albatrosses Croxall, JP; Prince, PA; Trathan, PN; Wood, AG. 1996 Distribution and movements of South Georgia black-browed albatrosses. Warrah, 9. 7-9. Full text not available from this repository. (Request a copy) Item Type: Publication - Article Programmes: BAS Programmes > Pre 2000 programme Date made live: 02 Nov 2016 09:47 +0 (UTC) URI: http://nora.nerc.ac.uk/id/eprint/515013 Actions (login required) View Item View Item Document Downloads Downloads for past 30 days Downloads per month over past year More statistics for this item... Tools + Tools © NERC …", "num_citations": "2\n", "authors": ["901"]}
{"title": "Identifying Areas, Seasons and Fleets of Potential Highest Bycatch Risk to South Georgia Albatrosses and Petrels\n", "abstract": " This paper presents an analysis of tracking data for 4 procellariiform seabirds from South Georgia, and calculates overlap with pelagic longline fisheries in the Southern Ocean for the period 1990-2009. We used an unusually comprehensive tracking dataset from all major life-history stages (including juvenile stages), weighted according to the proportion of the population they represented (based on demographic models), in order to generate population-level distributions by month. This analysis confirms that the IOTC area is important for grey-headed and wandering albatrosses, and to a lesser extent black-browed albatrosses, with hotspots of overlap with fisheries in the southwest Indian Ocean, between the Prince Edward Islands and South Africa, and in the southeast Indian Ocean. Overlaps were particularly high with fleets from Japan and Chinese Taipei, and to a lesser extent South Korea and Spain, and highest during winter months (May–September; when fishing effort south of 30 S is greatest). The areas identified here largely match areas where high rates of bycatch have been recorded, emphasizing the need for use of bycatch mitigation measures.", "num_citations": "1\n", "authors": ["901"]}