{"title": "DDoS in the IoT: Mirai and other botnets\n", "abstract": " The Mirai botnet and its variants and imitators are a wake-up call to the industry to better secure Internet of Things devices or risk exposing the Internet infrastructure to increasingly disruptive distributed denial-of-service attacks.", "num_citations": "1275\n", "authors": ["336"]}
{"title": "Intrusion detection in 802.11 networks: empirical evaluation of threats and a public dataset\n", "abstract": " Wi-Fi has become the de facto wireless technology for achieving short- to medium-range device connectivity. While early attempts to secure this technology have been proved inadequate in several respects, the current more robust security amendments will inevitably get outperformed in the future, too. In any case, several security vulnerabilities have been spotted in virtually any version of the protocol rendering the integration of external protection mechanisms a necessity. In this context, the contribution of this paper is multifold. First, it gathers, categorizes, thoroughly evaluates the most popular attacks on 802.11 and analyzes their signatures. Second, it offers a publicly available dataset containing a rich blend of normal and attack traffic against 802.11 networks. A quite extensive first-hand evaluation of this dataset using several machine learning algorithms and data features is also provided. Given that to the best …", "num_citations": "303\n", "authors": ["336"]}
{"title": "Malware detector\n", "abstract": " A transparent proxy for malware detection includes a monitor module, a protocol determination module, a challenge generation module, a response determination module, and a data control module. The monitor module examines data originating from an application towards a remote server. The protocol determination module identifies the protocol type used for the data. The challenge generation module produces a challenge for the application based upon the protocol type, sends the challenge to the application, and maintains a state related to the data and the challenge. The response determination module makes a determination if an automatic non-interactive application response is received in response to the challenge from the application. The data control module allows the first data to continue to the remote server when the determination is valid. The data control module reports malware detection and …", "num_citations": "266\n", "authors": ["336"]}
{"title": "Malicious PDF detection using metadata and structural features\n", "abstract": " Owed to their versatile functionality and widespread adoption, PDF documents have become a popular avenue for user exploitation ranging from large-scale phishing attacks to targeted attacks. In this paper, we present a framework for robust detection of malicious documents through machine learning. Our approach is based on features extracted from document metadata and structure. Using real-world datasets, we demonstrate the the adequacy of these document properties for malware detection and the durability of these features across new malware variants. Our analysis shows that the Random Forests classification method, an ensemble classifier that randomly selects features for each individual classification tree, yields the best detection rates, even on previously unseen malware.", "num_citations": "263\n", "authors": ["336"]}
{"title": "Distributed Sensor for Detecting Malicious Software\n", "abstract": " Processor (s) for detecting malicious software. A hardware virtual machine monitor (HVMM) operates under a host OS. Container (s) initialized with network application template (s) operate under a guest OS VM. A detection module operates under the guest OS VM includes a trigger detection module, a logging module and a container command module. The trigger detection module monitors activity on container (s) for a trigger event. The logging module writes activity report (s) in response to trigger event (s). The container command module issues command (s) in response to trigger event (s). The command (s) include a container start, stop and revert commands. A virtual machine control console operates under the host OS and starts/stops the HVMM. A container control module operates under the guest OSVM and controls container (s) in response to the command (s). The server communication module sends …", "num_citations": "220\n", "authors": ["336"]}
{"title": "Using graphic turing tests to counter automated ddos attacks against web servers\n", "abstract": " We present WebSOS, a novel overlay-based architecture that provides guaranteed access to a web server that is targeted by a denial of service (DoS) attack. Our approach exploits two key characteristics of the web environment: its design around a human-centric interface, and the extensibility inherent in many browsers through downloadable\" applets.\" We guarantee access to a web server for a large number of previously unknown users, without requiring pre-existing trust relationships between users and the system. Our prototype requires no modifications to either servers or browsers, and makes use of graphical Turing tests, web proxies, and client authentication using the SSL/TLS protocol, all readily supported by modern browsers. We use the WebSOS prototype to conduct a performance evaluation over the Internet using PlanetLab, a testbed for experimentation with network overlays. We determine the end-to …", "num_citations": "217\n", "authors": ["336"]}
{"title": "Casting out demons: Sanitizing training data for anomaly sensors\n", "abstract": " The efficacy of anomaly detection (AD) sensors depends heavily on the quality of the data used to train them. Artificial or contrived training data may not provide a realistic view of the deployment environment. Most realistic data sets are dirty; that is, they contain a number of attacks or anomalous events. The size of these high-quality training data sets makes manual removal or labeling of attack data infeasible. As a result, sensors trained on this data can miss attacks and their variations. We propose extending the training phase of AD sensors (in a manner agnostic to the underlying AD algorithm) to include a sanitization phase. This phase generates multiple models conditioned on small slices of the training data. We use these \"micro- models\" to produce provisional labels for each training input, and we combine the micro-models in a voting scheme to determine which parts of the training data may represent attacks …", "num_citations": "207\n", "authors": ["336"]}
{"title": "Hypercheck: A hardware-assisted integrity monitor\n", "abstract": " Over the past few years, virtualization has been employed to environments ranging from densely populated cloud computing clusters to home desktop computers. Security researchers embraced virtual machine monitors (VMMs) as a new mechanism to guarantee deep isolation of untrusted software components. Unfortunately, their widespread adoption promoted VMMs as a prime target for attackers. In this paper, we present HyperCheck, a hardware-assisted tampering detection framework designed to protect the integrity of VMMs and, for some classes of attacks, the underlying operating system (OS). HyperCheck leverages the CPU System Management Mode (SMM), present in x86 systems, to securely generate and transmit the full state of the protected machine to an external server. Using HyperCheck, we were able to ferret-out rootkits that targeted the integrity of both the Xen hypervisor and traditional …", "num_citations": "192\n", "authors": ["336"]}
{"title": "On the infeasibility of modeling polymorphic shellcode\n", "abstract": " Polymorphic malcode remains a troubling threat. The ability formal code to automatically transform into semantically equivalent variants frustrates attempts to rapidly construct a single, simple, easily verifiable representation. We present a quantitative analysis of the strengths and limitations of shellcode polymorphism and consider its impact on current intrusion detection practice.", "num_citations": "155\n", "authors": ["336"]}
{"title": "The mirai botnet and the iot zombie armies\n", "abstract": " The rapidly growing presence of Internet of Things (IoT) devices is becoming a continuously alluring playground for malicious actors who try to harness their vast numbers and diverse locations. One of their primary goals is to assemble botnets that can serve their nefarious purposes, ranging from Denial of Service (DoS) to spam and advertisement fraud. The most recent example that highlights the severity of the problem is the Mirai family of malware, which is accountable for a plethora of massive DDoS attacks of unprecedented volume and diversity. The aim of this paper is to offer a comprehensive state-of-the-art review of the IoT botnet landscape and the underlying reasons of its success with a particular focus on Mirai and major similar worms. To this end, we provide extensive details on the internal workings of IoT malware, examine their interrelationships, and elaborate on the possible strategies for defending …", "num_citations": "146\n", "authors": ["336"]}
{"title": "Methods, media and systems for responding to a denial of service attack\n", "abstract": " Methods, media and systems for responding to a Denial of Service (DoS) attack are provided. In some embodiments, a method includes detecting a DoS attack, migrating one or more processes that provide a service to an unaffected system; authenticating users that are authorized to use the service; and routing traffic generated by authenticated users to the unaffected system.", "num_citations": "144\n", "authors": ["336"]}
{"title": "SQLProb: a proxy-based architecture towards preventing SQL injection attacks\n", "abstract": " SQL injection attacks (SQLIAs) consist of maliciously crafted SQL inputs, including control code, used against Database-connected Web applications. To curtail the attackers' ability to generate such attacks, we propose an SQL Proxy-based Blocker (SQLProb). SQLProb harnesses the effectiveness and adaptivity of genetic algorithms to dynamically detect and extract users' inputs for undesirable SQL control sequences. Compared to state-of-the-art protection mechanisms, our method does not require any code changes on either the client, the web-server or the back-end database. Rather, our system uses a proxy that seamlessly integrates with existing operational environments offering protection to front-end web servers and back-end databases. To evaluate the overhead and the detection performance of our system, we implemented a prototype of SQLProb which we tested using real SQL attacks. Our …", "num_citations": "142\n", "authors": ["336"]}
{"title": "Exploiting smart-phone usb connectivity for fun and profit\n", "abstract": " The Universal Serial Bus (USB) connection has become the de-facto standard for both charging and data transfers for smart phone devices including Google's Android and Apple's iPhone. To further enhance their functionality, smart phones are equipped with programmable USB hardware and open source operating systems that empower them to alter the default behavior of the end-to-end USB communications. Unfortunately, these new capabilities coupled with the inherent trust that users place on the USB physical connectivity and the lack of any protection mechanisms render USB a insecure link, prone to exploitation. To demonstrate this new avenue of exploitation, we introduce novel attack strategies that exploit the functional capabilities of the USB physical link. In addition, we detail how a sophisticated adversary who has under his control one of the connected devices can subvert the other. This includes …", "num_citations": "140\n", "authors": ["336"]}
{"title": "Catch me if you can: A cloud-enabled DDoS defense\n", "abstract": " We introduce a cloud-enabled defense mechanism for Internet services against network and computational Distributed Denial-of-Service (DDoS) attacks. Our approach performs selective server replication and intelligent client re-assignment, turning victim servers into moving targets for attack isolation. We introduce a novel system architecture that leverages a \"shuffling\" mechanism to compute the optimal re-assignment strategy for clients on attacked servers, effectively separating benign clients from even sophisticated adversaries that persistently follow the moving targets. We introduce a family of algorithms to optimize the runtime client-to-server re-assignment plans and minimize the number of shuffles to achieve attack mitigation. The proposed shuffling-based moving target mechanism enables effective attack containment using fewer resources than attack dilution strategies using pure server expansion. Our …", "num_citations": "127\n", "authors": ["336"]}
{"title": "A moving target DDoS defense mechanism\n", "abstract": " In this paper, we introduce a moving target defense mechanism that defends authenticated clients against Internet service DDoS attacks. Our mechanism employs a group of dynamic, hidden proxies to relay traffic between authenticated clients and servers. By continuously replacing attacked proxies with backup proxies and reassigning (shuffling) the attacked clients onto the new proxies, innocent clients are segregated from malicious insiders through a series of shuffles. To accelerate the process of insider segregation, we designed an efficient greedy algorithm which is proven to have near optimal empirical performance. In addition, the insider quarantine capability of this greedy algorithm is studied and quantified to enable defenders to estimate the resource required to defend against DDoS attacks and meet defined QoS levels under various attack scenarios. Simulations were then performed which confirmed the …", "num_citations": "125\n", "authors": ["336"]}
{"title": "Universal multi-factor authentication using graphical passwords\n", "abstract": " In this paper, we present a series of methods to authenticate a user with a graphical password. To that end, we employ the user¿s personal handheld device as the password decoder and the second factor of authentication. In our methods, a service provider challenges the user with an image password. To determine the appropriate click points and their order, the user needs some hint information transmitted only to her handheld device. We show that our method can overcome threats such as key-loggers, weak password, and shoulder surfing. With the increasing popularity of handheld devices such as cell phones, our approach can be leveraged by many organizations without forcing the user to memorize different passwords or carrying around different tokens.", "num_citations": "124\n", "authors": ["336"]}
{"title": "A lightweight, robust p2p system to handle flash crowds\n", "abstract": " Internet flash crowds (a.k.a. hot spots) are a phenomenon that result from a sudden, unpredicted increase in an on-line object's popularity. Currently, there is no efficient means within the Internet to scalably deliver Web objects under hot spot conditions to all clients that desire the object. We present PROOFS: a simple, lightweight, peer-to-peer (P2P) approach that uses randomized overlay construction and randomized, scoped searches to efficiently locate and deliver objects under heavy demand to all users that desire them. We evaluate PROOFS' robustness in environments in which clients join and leave the P2P network as well as in environments in which clients are not always fully cooperative. Through a mix of simulation and prototype experimentation in the Internet, we show that randomized approaches like PROOFS should effectively relieve flash crowd symptoms in dynamic, limited-participation environments.", "num_citations": "117\n", "authors": ["336"]}
{"title": "Motag: Moving target defense against internet denial of service attacks\n", "abstract": " Distributed Denial of Service (DDoS) attacks still pose a significant threat to critical infrastructure and Internet services alike. In this paper, we propose MOTAG, a moving target defense mechanism that secures service access for authenticated clients against flooding DDoS attacks. MOTAG employs a group of dynamic packet indirection proxies to relay data traffic between legitimate clients and the protected servers. Our design can effectively inhibit external attackers' attempts to directly bombard the network infrastructure. As a result, attackers will have to collude with malicious insiders in locating secret proxies and then initiating attacks. However, MOTAG can isolate insider attacks from innocent clients by continuously \"moving\" secret proxies to new network locations while shuffling client-to-proxy assignments. We develop a greedy shuffling algorithm to minimize the number of proxy re- allocations (shuffles) while …", "num_citations": "114\n", "authors": ["336"]}
{"title": "A study of malcode-bearing documents\n", "abstract": " By exploiting the object-oriented dynamic composability of modern document applications and formats, malcode hidden in otherwise inconspicuous documents can reach third-party applications that may harbor exploitable vulnerabilities otherwise unreachable by network-level service attacks. Such attacks can be very selective and difficult to detect compared to the typical network worm threat, owing to the complexity of these applications and data formats, as well as the multitude of document-exchange vectors. As a case study, this paper focuses on Microsoft Word documents as malcode carriers. We investigate the possibility of detecting embedded malcode in Word documents using two techniques: static content analysis using statistical models of typical document content, and run-time dynamic tests on diverse platforms. The experiments demonstrate these approaches can not only detect known …", "num_citations": "111\n", "authors": ["336"]}
{"title": "Mobile application and device power usage measurements\n", "abstract": " Reducing power consumption has become a crucial design tenet for both mobile and other small computing devices that are not constantly connected to a power source. However, unlike devices that have a limited and predefined set of functionality, recent mobile smart phone devices have a very rich set of components and can handle multiple general purpose programs that are not a-priori known or profiled. In this paper, we present a general methodology for collecting measurements and modelling power usage on smart phones. Our goal is to characterize the device subsystems and perform accurate power measurements. We implemented a system that effectively accounts for the power usage of all of the primary hardware subsystems on the phone: CPU, display, graphics, GPS, audio, microphone, and Wi-Fi. To achieve that, we make use of the per-subsystem time shares reported by the operating system's …", "num_citations": "107\n", "authors": ["336"]}
{"title": "A lightweight, robust P2P system to handle flash crowds\n", "abstract": " An Internet flash crowd (also known as hot spots) is a phenomenon that results from a sudden, unpredicted increase in an on-line object's popularity. Currently, there is no efficient means within the Internet to deliver Web objects scalably under hot spot conditions to all clients that desire the object. We present peer-to-peer (P2P) randomized overlays to obviate flash-crowd symptoms (PROOFS), a simple, lightweight, P2P approach that uses randomized overlay construction and randomized, scoped searches to locate and deliver objects efficiently under heavy demand to all users that desire them. We evaluate PROOFS' robustness in environments in which clients join and leave the P2P network, as well as in environments in which clients are not always fully cooperative. Through a mix of simulation and prototype experimentation in the Internet, we show that randomized approaches like PROOFS should effectively …", "num_citations": "106\n", "authors": ["336"]}
{"title": "Countering dos attacks with stateless multipath overlays\n", "abstract": " Indirection-based overlay networks (IONs) are a promising approach for countering distributed denial of service (DDoS) attacks. Such mechanisms are based on the assumption that attackers will attack a fixed and bounded set of overlay nodes causing service disruption to a small fraction of the users. In addition, attackers cannot eaves-drop on links inside the network or otherwise gain information that can help them focus their attacks on overlay nodes that are critical for specific communication flows. We develop an analytical model and a new class of attacks that considers both simple and advanced adversaries. We show that the impact of these simple attacks on IONs can severely disrupt communications. We propose a stateless spread-spectrum paradigm to create per-packet path diversity between each pair of end-nodes using a modified ION access protocol. Our system protects end-to-end communications …", "num_citations": "102\n", "authors": ["336"]}
{"title": "Doubleguard: Detecting intrusions in multitier web applications\n", "abstract": " Internet services and applications have become an inextricable part of daily life, enabling communication and the management of personal information from anywhere. To accommodate this increase in application and data complexity, web services have moved to a multitiered design wherein the webserver runs the application front-end logic and data are outsourced to a database or file server. In this paper, we present DoubleGuard, an IDS system that models the network behavior of user sessions across both the front-end webserver and the back-end database. By monitoring both web and subsequent database requests, we are able to ferret out attacks that an independent IDS would not be able to identify. Furthermore, we quantify the limitations of any multitier IDS in terms of training sessions and functionality coverage. We implemented DoubleGuard using an Apache webserver with MySQL and lightweight …", "num_citations": "96\n", "authors": ["336"]}
{"title": "Analysis of android applications' permissions\n", "abstract": " We developed an architecture that automatically searches for and downloads Android applications from the Android Market. Furthermore, we created a detailed mapping of Android application programming interface (API) calls to the required permission(s), if any, for each call. We then performed an analysis of 141,372 Android applications to determine if they have the appropriate set of permissions based on the static analysis of the APK bytecode of each application. Our findings indicate that the majority of mobile software developers are not using the correct permission set and that they either over-specify or under-specify their security requirements.", "num_citations": "89\n", "authors": ["336"]}
{"title": "WebSOS: an overlay-based system for protecting web servers from denial of service attacks\n", "abstract": " We present WebSOS, a novel overlay-based architecture that provides guaranteed access to a web server that is targeted by a denial of service (DoS) attack. Our approach exploits two key characteristics of the web environment: its design around a human–centric interface, and the extensibility inherent in many browsers through downloadable “applets.” We guarantee access to a web server for a large number of previously unknown users, without requiring pre-existing trust relationships between users and the system, by using reverse Graphic Turing Tests. Furthermore, our system makes it easy for service providers to charge users, providing incentives to a commercial offering of the service. Users can dynamically decide whether to use the WebSOS overlay, based on the prevailing network conditions.Our prototype requires no modifications to either servers or browsers, and makes use of Graphical Turing Tests …", "num_citations": "82\n", "authors": ["336"]}
{"title": "Using hardware features for increased debugging transparency\n", "abstract": " With the rapid proliferation of malware attacks on the Internet, understanding these malicious behaviors plays a critical role in crafting effective defense. Advanced malware analysis relies on virtualization or emulation technology to run samples in a confined environment, and to analyze malicious activities by instrumenting code execution. However, virtual machines and emulators inevitably create artifacts in the execution environment, making these approaches vulnerable to detection or subversion. In this paper, we present MALT, a debugging framework that employs System Management Mode, a CPU mode in the x86 architecture, to transparently study armored malware. MALT does not depend on virtualization or emulation and thus is immune to threats targeting such environments. Our approach reduces the attack surface at the software level, and advances state-of-the-art debugging transparency. MALT …", "num_citations": "78\n", "authors": ["336"]}
{"title": "Move: An end-to-end solution to network denial of service\n", "abstract": " We present a solution to the denial of service (DoS) problem that does not rely on network infrastructure support, conforming to the end-to-end (e2e) design principle. Our approach is to combine an overlay network, which allows us to treat authorized traffic preferentially, with a lightweight process-migration environment that allows us to move services easily between different parts of a distributed system. Functionality residing on a part of the system that is subjected to a DoS attack migrates to an unaffected location. The overlay network ensures that traffic from legitimate users, who are authenticated before they are allowed to access the service, is routed to the new location. We demonstrate the feasibility and effectiveness of our approach by measuring the performance of an experimental prototype against a series of attacks using PlanetLab, a distributed experimental testbed. Our preliminary results show that the end-toend latency remains at acceptable levels during regular operation, increasing only by a factor of 2 to 3, even for large overlays. When a process migrates due to a DoS attack, the disruption of service for the end user is in the order of a few seconds, depending on the network proximity of the servers involved in the migration.", "num_citations": "77\n", "authors": ["336"]}
{"title": "Spectre: A dependable introspection framework via system management mode\n", "abstract": " Virtual Machine Introspection (VMI) systems have been widely adopted for malware detection and analysis. VMI systems use hypervisor technology for system introspection and to expose malicious activity. However, recent malware can detect the presence of virtualization or corrupt the hypervisor state thus avoiding detection. We introduce SPECTRE, a hardware-assisted dependability framework that leverages System Management Mode (SMM) to inspect the state of a system. Contrary to VMI, our trusted code base is limited to BIOS and the SMM implementations. SPECTRE is capable of transparently and quickly examining all layers of running system code including a hypervisor, the OS, and user level applications. We demonstrate several use cases of SPECTRE including heap spray, heap overflow, and rootkit detection using real-world attacks on Windows and Linux platforms. In our experiments, full inspection …", "num_citations": "76\n", "authors": ["336"]}
{"title": "Efficiently tracking application interactions using lightweight virtualization\n", "abstract": " In this paper, we propose a general-purpose framework that harnesses the power of lightweight virtualization to track applications interactions in a scalable an efficient manner. Our goal is to use our framework for application auditing, intrusion detection, analysis, and system recovery from both malicious attacks and programmatic faults. In our framework, we construct each virtualized environment (VE) in a novel way that limits the scope and type of application events that need to be monitored.", "num_citations": "76\n", "authors": ["336"]}
{"title": "Hypercheck: A hardware-assistedintegrity monitor\n", "abstract": " The advent of cloud computing and inexpensive multi-core desktop architectures has led to the widespread adoption of virtualization technologies. Furthermore, security researchers embraced virtual machine monitors (VMMs) as a new mechanism to guarantee deep isolation of untrusted software components, which, coupled with their popularity, promoted VMMs as a prime target for exploitation. In this paper, we present HyperCheck, a hardware-assisted tampering detection framework designed to protect the integrity of hypervisors and operating systems. Our approach leverages System Management Mode (SMM), a CPU mode in ×86 architecture, to transparently and securely acquire and transmit the full state of a protected machine to a remote server. We have implement two prototypes based on our framework design: HyperCheck-I and HyperCheck-II, that vary in their security assumptions and OS code …", "num_citations": "69\n", "authors": ["336"]}
{"title": "When a Tree Falls: Using Diversity in Ensemble Classifiers to Identify Evasion in Malware Detectors.\n", "abstract": " Machine learning classifiers are a vital component of modern malware and intrusion detection systems. However, past studies have shown that classifier based detection systems are susceptible to evasion attacks in practice. Improving the evasion resistance of learning based systems is an open problem. To address this, we introduce a novel method for identifying the observations on which an ensemble classifier performs poorly. During detection, when a sufficient number of votes from individual classifiers disagree, the ensemble classifier prediction is shown to be unreliable. The proposed method, ensemble classifier mutual agreement analysis, allows the detection of many forms of classifier evasion without additional external ground truth.We evaluate our approach using PDFrate, a PDF malware detector. Applying our method to data taken from a real network, we show that the vast majority of predictions can be made with high ensemble classifier agreement. However, most classifier evasion attempts, including nine targeted mimicry scenarios from two recent studies, are given an outcome of uncertain indicating that these observations cannot be given a reliable prediction by the classifier. To show the general applicability of our approach, we tested it against the Drebin Android malware detector where an uncertain prediction was correctly given to the majority of novel attacks. Our evaluation includes over 100,000 PDF documents and 100,000 Android applications. Furthermore, we show that our approach can be generalized to weaken the effectiveness of the Gradient Descent and Kernel Density Estimation attacks against Support Vector …", "num_citations": "67\n", "authors": ["336"]}
{"title": "PAR: Payment for anonymous routing\n", "abstract": " Despite the growth of the Internet and the increasing concern for privacy of online communications, current deployments of anonymization networks depend on a very small set of nodes that volunteer their bandwidth. We believe that the main reason is not disbelief in their ability to protect anonymity, but rather the practical limitations in bandwidth and latency that stem from limited participation. This limited participation, in turn, is due to a lack of incentives to participate. We propose providing economic incentives, which historically have worked very well.             In this paper, we demonstrate a payment scheme that can be used to compensate nodes which provide anonymity in Tor, an existing onion routing, anonymizing network. We show that current anonymous payment schemes are not suitable and introduce a hybrid payment system based on a combination of the Peppercoin Micropayment system and a …", "num_citations": "65\n", "authors": ["336"]}
{"title": "E-commerce reputation manipulation: The emergence of reputation-escalation-as-a-service\n", "abstract": " In online markets, a store's reputation is closely tied to its profitability. Sellers' desire to quickly achieve high reputation has fueled a profitable underground business, which operates as a specialized crowdsourcing marketplace and accumulates wealth by allowing online sellers to harness human laborers to conduct fake transactions for improving their stores' reputations. We term such an underground market a seller-reputation-escalation (SRE) market. In this paper, we investigate the impact of the SRE service on reputation escalation by performing in-depth measurements of the prevalence of the SRE service, the business model and market size of SRE markets, and the characteristics of sellers and offered laborers. To this end, we have infiltrated five SRE markets and studied their operations using daily data collection over a continuous period of two months. We identified more than 11,000 online sellers posting at …", "num_citations": "63\n", "authors": ["336"]}
{"title": "Traffic analysis against low-latency anonymity networks using available bandwidth estimation\n", "abstract": " We introduce a novel remotely-mounted attack that can expose the network identity of an anonymous client, hidden service, and anonymizing proxies. To achieve this, we employ single-end controlled available bandwidth estimation tools and a colluding network entity that can modulate the traffic destined for the victim. To expose the circuit including the source, we inject a number of short or one large burst of traffic. Although timing attacks have been successful against anonymity networks, they require either a Global Adversary or the compromise of substantial number of anonymity nodes. Our technique does not require compromise of, or collaboration with, any such entity.               To validate our attack, we performed a series of experiments using different network conditions and locations for the adversaries on both controlled and real-world Tor circuits. Our results demonstrate that our attack is successful …", "num_citations": "62\n", "authors": ["336"]}
{"title": "Authentication Using Graphical Passwords\n", "abstract": " An authenticator may include graphical passwords. An authenticator may include a password image, which may include one or more clickable areas, and/or a key image, which may include click point data. An authenticator may include a mobile computing resource, a terminal computing resource and/or a challenger, which may be configured to communicate with each other. A mobile computing resource may be configured to receive and/or display a key image, such that click point data may be presented, determined, and/or input to a password image. A challenger may be configured to compare input click point data and a key image.", "num_citations": "59\n", "authors": ["336"]}
{"title": "Continuous authentication on mobile devices using power consumption, touch gestures and physical movement of users\n", "abstract": " Handheld devices today do not continuously verify the identity of the user while sensitive activities are performed. This enables attackers, who can either compromise the initial password or grab the device after login, full access to sensitive data and applications on the device. To mitigate this risk, we propose continuous user monitoring using a machine learning based approach comprising of an ensemble of three distinct modalities: power consumption, touch gestures, and physical movement. Users perform different activities on different applications: we consider application context when we model user behavior. We employ anomaly detection algorithms for each modality and place a bound on the fraction of anomalous events that can be considered “normal” for any given user. We evaluated our system using data collected from 73 volunteer participants. We were able to verify that our system is functional …", "num_citations": "58\n", "authors": ["336"]}
{"title": "SecureSwitch: BIOS-Assisted Isolation and Switch between Trusted and Untrusted Commodity OSes.\n", "abstract": " Protecting commodity systems running commercial Operating Systems (OSes) without significantly degrading performance or usability still remains an open problem. To make matters worse, the overall security depends on complex applications that perform multiple inter-dependent tasks with Internet-borne code. Recent research has shown the need for context-dependent trustworthy environments that can segregate different user activities to lower risk of cross-contamination and safeguard private information. In this paper, we introduce a novel BIOS-assisted mechanism for secure instantiation and management of trusted execution environments. A key design characteristic of our system is usability: the ability to quickly and securely switch between operating environments without requiring any specialized hardware or code modifications. Our aim is to eliminate any mutable, non-BIOS code sharing while securely reusing existing hardware: even when an untrusted environment is compromised, there is no potential for exfiltration or inference attacks. To safeguard against spoofing attacks, we can force the user to physically set a hardware switch, an action that cannot be reproduced by software. In addition, we provide visible indication to the user about the current running environment leveraging one of the front panel Light Emitting Diodes (LEDs). In our prototype, the entire switching process takes approximately six seconds on average. This empowers users to frequently and seamlessly alternate between trusted and untrusted environments.", "num_citations": "57\n", "authors": ["336"]}
{"title": "Implementing and optimizing an encryption filesystem on android\n", "abstract": " The recent surge in popularity of smart handheld devices, including smart-phones and tablets, has given rise to new challenges in protection of Personal Identifiable Information (PII). Indeed, modern mobile devices store PII for applications that span from email to SMS and from social media to location-based services increasing the concerns of the end user's privacy. Therefore, there is a clear need and expectation for PII data to be protected in the case of loss, theft, or capture of the portable device. In this paper, we present a novel FUSE (File system in User space) encryption file system to protect the removable and persistent storage on heterogeneous smart gadget devices running the Android platform. The proposed file system leverages NIST certified cryptographic algorithms to encrypt the data-at-rest. We present an analysis of the security and performance trade-offs in a wide-range of usage and load scenarios …", "num_citations": "54\n", "authors": ["336"]}
{"title": "Detecting malicious javascript in pdf through document instrumentation\n", "abstract": " An emerging threat vector, embedded malware inside popular document formats, has become rampant since 2008. Owed to its wide-spread use and Javascript support, PDF has been the primary vehicle for delivering embedded exploits. Unfortunately, existing defenses are limited in effectiveness, vulnerable to evasion, or computationally expensive to be employed as an on-line protection system. In this paper, we propose a context-aware approach for detection and confinement of malicious Javascript in PDF. Our approach statically extracts a set of static features and inserts context monitoring code into a document. When an instrumented document is opened, the context monitoring code inside will cooperate with our runtime monitor to detect potential infection attempts in the context of Javascript execution. Thus, our detector can identify malicious documents by using both static and runtime features. To validate …", "num_citations": "53\n", "authors": ["336"]}
{"title": "Behavioral analysis of android applications using automated instrumentation\n", "abstract": " Google's Android operating system has become one the most popular operating system for hand-held devices. Dueto its ubiquitous use, open source nature and wide-spread popularity, it has become the target of recent mobile malware. In this paper, we present our efforts on effective security inspection mechanisms for identification of malicious applications for Android mobile applications. To achieve that, we developed a comprehensive software inspection framework. Moreover, to identify potential software reliability flaws and to triggermalware, we develop a transparent instrumentation system for automating user interactions with an Android application that does not require source code. Additionally, for run-time behavior analysis of an application, we monitor the I/O system calls generated the by application under monitoring to the underlying Linux kernel. As a case study, we present two Android malware …", "num_citations": "52\n", "authors": ["336"]}
{"title": "A framework to secure peripherals at runtime\n", "abstract": " Secure hardware forms the foundation of a secure system. However, securing hardware devices remains an open research problem. In this paper, we present IOCheck, a framework to enhance the security of I/O devices at runtime. It leverages System Management Mode (SMM) to quickly check the integrity of I/O configurations and firmware. IOCheck is agnostic to the operating system. We use random-polling and event-driven approaches to switch into SMM. We implement a prototype of IOCheck and conduct extensive experiments on physical machines. Our experimental results show that IOCheck takes 10 milliseconds to check the integrity of a network card and a video card. Also, IOCheck introduces a low overhead on Windows and Linux platforms. We show that IOCheck achieves a faster switching time than the Dynamic Root of Trust Measurement approach.", "num_citations": "50\n", "authors": ["336"]}
{"title": "Hardware-assisted integrity monitor\n", "abstract": " A hardware-assisted integrity monitor may include one or more target machines and/or monitor machines. A target machine may include one or more processors, which may include one or more system management modes (SMM). A SMM may include one or more register checking modules, which may be configured to determine one or more current CPU register states. A SMM may include one or more acquiring modules, which may be configured to determine one or more current memory states. A SMM may include one or more network modules, which may be configured to direct one or more communications, for example of one or more current CPU register states and/or current memory states, to a monitor machine. A monitor machine may include one or more network modules and/or analysis modules. An analysis module may be configured to determine memory state differences and/or determine CPU register …", "num_citations": "46\n", "authors": ["336"]}
{"title": "Adaptive anomaly detection via self-calibration and dynamic updating\n", "abstract": " The deployment and use of Anomaly Detection (AD) sensors often requires the intervention of a human expert to manually calibrate and optimize their performance. Depending on the site and the type of traffic it receives, the operators might have to provide recent and sanitized training data sets, the characteristics of expected traffic (i.e. outlier ratio), and exceptions or even expected future modifications of system’s behavior. In this paper, we study the potential performance issues that stem from fully automating the AD sensors’ day-to-day maintenance and calibration. Our goal is to remove the dependence on human operator using an unlabeled, and thus potentially dirty, sample of incoming traffic.               To that end, we propose to enhance the training phase of AD sensors with a self-calibration phase, leading to the automatic determination of the optimal AD parameters. We show how this novel calibration …", "num_citations": "45\n", "authors": ["336"]}
{"title": "Identifying proxy nodes in a Tor anonymization circuit\n", "abstract": " We present a novel, practical, and effective mechanism that exposes the identity of Tor relays participating in a given circuit. Such an attack can be used by malicious or compromised nodes to identify the rest of the circuit, or as the first step in a follow-on trace-back attack. Our intuition is that by modulating the bandwidth of an anonymous connection (e.g. when the destination server, its router, or an entry point is under our control), we create observable fluctuations that propagate through the Tor network and the Internet to the end-user's host. To that end, we employ LinkWidth, a novel bandwidth-estimation technique. LinkWidth enables network edge-attached entities to estimate the available bandwidth in an arbitrary Internet link without a cooperating peer host, router, or ISP. Our approach also does not require compromise of any Tor nodes. In a series of experiments against the Tor network, we show that we can …", "num_citations": "42\n", "authors": ["336"]}
{"title": "Cross-domain collaborative anomaly detection: So far yet so close\n", "abstract": " Web applications have emerged as the primary means of access to vital and sensitive services such as online payment systems and databases storing personally identifiable information. Unfortunately, the need for ubiquitous and often anonymous access exposes web servers to adversaries. Indeed, network-borne zero-day attacks pose a critical and widespread threat to web servers that cannot be mitigated by the use of signature-based intrusion detection systems. To detect previously unseen attacks, we correlate web requests containing user submitted content across multiple web servers that is deemed abnormal by local Content Anomaly Detection (CAD) sensors. The cross-site information exchange happens in real-time leveraging privacy preserving data structures. We filter out high entropy and rarely seen legitimate requests reducing the amount of data and time an operator has to spend sifting …", "num_citations": "41\n", "authors": ["336"]}
{"title": "Firmware-assisted memory acquisition and analysis tools for digital forensics\n", "abstract": " Being able to inspect and analyze the operational state of commodity machines is crucial for modern digital forensics. Indeed, volatile system state including memory data and CPU registers contain information that cannot be directly inferred or reconstructed by acquiring the contents of the nonvolatile storage. Unfortunately, it still remains an open problem how to reliably and consistently retrieve the volatile machine state without disrupting its operation. In this paper, we propose to leverage commercial PCI network cards and the current x86 implementation of System Management Mode to reliably replicate the physical memory and critical CPU registers from commodity hardware. Furthermore, we demonstrate how remote state replication can be used for semantic reconstruction, where the analysis of memory structures enables us to interactively perform forensic analysis of the machine's memory content.", "num_citations": "40\n", "authors": ["336"]}
{"title": "On the infeasibility of modeling polymorphic shellcode\n", "abstract": " Current trends demonstrate an increasing use of polymorphism by attackers to disguise their exploits. The ability for malicious code to be easily, and automatically, transformed into semantically equivalent variants frustrates attempts to construct simple, easily verifiable representations for use in security sensors. In this paper, we present a quantitative analysis of the strengths and limitations of shellcode polymorphism, and describe the impact that these techniques have in the context of learning-based IDS systems. Our examination focuses on dual problems: shellcode encryption-based evasion methods and targeted “blending” attacks. Both techniques are currently being used in the wild, allowing real exploits to evade IDS sensors. This paper provides metrics to measure the effectiveness of modern polymorphic engines and provide insights into their designs. We describe methods to evade statistics-based …", "num_citations": "40\n", "authors": ["336"]}
{"title": "Interactive Malware Detector\n", "abstract": " An interactive detector that includes a challenger and authorizer. The challenger may send a challenge to a source application in response to an intercepted request intended for a destination application from the source application. The challenge may be configured to invoke an expected challenge response from component (s) of the source application. The authorizer may allow the request to proceed to the destination application if a received challenge response generated by the source application satisfies the expected challenge response.", "num_citations": "39\n", "authors": ["336"]}
{"title": "The ephemeral legion: producing an expert cyber-security work force from thin air\n", "abstract": " Seeking to improve the educational mechanisms for efficiently training large numbers of information security workers.", "num_citations": "38\n", "authors": ["336"]}
{"title": "Active authentication of users\n", "abstract": " Embodiments herein disclose a method and system for actively authenticating users of an electronic device in a continuous manner using a plurality of factors comprising of biometric modalities, power consumption, application usage, user interactions, user movement, and user location/travel.", "num_citations": "37\n", "authors": ["336"]}
{"title": "Towards a cyber conflict taxonomy\n", "abstract": " This paper seeks to create a practical taxonomy to describe cyber conflict events and the actors involved in them in a manner that is useful to security practitioners and researchers working in the domain of cyber operations. The proposed Cyber Conflict Taxonomy is an extensible network taxonomy organized as a plex data structure. Subjects of the taxonomy are entered as either Events or Entities and are then categorized using the categories and subcategories of Actions or Actors. Each of these categories is further subdivided into increasingly specific subcategories used to describe the defining characteristics of each subject and labeled lateral linkages are used to illustrate the associative relationships between Entities and Events. The categories are organized in both a hierarchical and associative manner to illustrate the relationships between subjects and categories. A prototype of this taxonomy was …", "num_citations": "37\n", "authors": ["336"]}
{"title": "Click fraud detection on the advertiser side\n", "abstract": " Click fraud—malicious clicks at the expense of pay-per-click advertisers—is posing a serious threat to the Internet economy. Although click fraud has attracted much attention from the security community, as the direct victims of click fraud, advertisers still lack effective defense to detect click fraud independently. In this paper, we propose a novel approach for advertisers to detect click frauds and evaluate the return on investment (ROI) of their ad campaigns without the helps from ad networks or publishers. Our key idea is to proactively test if visiting clients are full-fledged modern browsers and passively scrutinize user engagement. In particular, we introduce a new functionality test and develop an extensive characterization of user engagement. Our detection can significantly raise the bar for committing click fraud and is transparent to users. Moreover, our approach requires little effort to be deployed at the …", "num_citations": "34\n", "authors": ["336"]}
{"title": "From STEM to SEAD: Speculative execution for automated defense\n", "abstract": " Most computer defense systems crash the process that they protect as part of their response to an attack. Although recent research explores the feasibility of self-healing to automatically recover from an attack, self-healing faces some obstacles before it can protect legacy applications and COTS (Commercial Off-The-Shelf) software. Besides the practical issue of not modifying source code, self-healing must know both when to engage and how to guide a repair.", "num_citations": "34\n", "authors": ["336"]}
{"title": "Deny-by-default distributed security policy enforcement in mobile ad hoc networks\n", "abstract": " Mobile Ad-hoc Networks (MANETs) are increasingly employed in tactical military and civil rapid-deployment networks, including emergency rescue operations and ad hoc disaster-relief networks. However, this flexibility of MANETs comes at a price, when compared to wired and base station-based wireless networks: MANETs are susceptible to both insider and outsider attacks. This is mainly because of the lack of a well-defined defense perimeter preventing the effective use of wired defenses including firewalls and intrusion detection systems.               We introduce a novel distributed security policy enforcement architecture that is designed specifically for MANETs. Our approach harnesses and extends the concept of network capabilities and is especially suited for mobile and heterogeneous communication environments. Our model imposes communication restrictions between MANET nodes by enforcing …", "num_citations": "33\n", "authors": ["336"]}
{"title": "Systems, methods, and media for generating sanitized data, sanitizing anomaly detection models, and/or generating sanitized anomaly detection models\n", "abstract": " Systems, methods, and media for generating sanitized data, sanitizing anomaly detection models, and generating anomaly detection models are provided. In some embodiments, methods for generating sanitized data are provided. The methods including: dividing a first training dataset comprised of a plurality of training data items into a plurality of data subsets each including at least one training data item of the plurality of training data items of the first training dataset; based on the plurality of data subsets, generating a plurality of distinct anomaly detection micro-models; testing at least one data item of the plurality of data items of a second training dataset of training data items against each of the plurality of micro-models to produce a score for the at least one tested data item; and generating at least one output dataset based on the score for the at least one tested data item.", "num_citations": "31\n", "authors": ["336"]}
{"title": "Systems, methods, and media for recovering an application from a fault or attack\n", "abstract": " Systems, methods, and media for recovering an application from a fault or an attack are disclosed herein. In some embodiments, a method is provided for enabling a software application to recover from a fault condition. The method includes specifying constrained data items and assigning a set of repair procedures to the constrained data items. The method further includes detecting a fault condition on the constrained data items during execution of the software application, which triggers at least one repair procedure. The triggered repair procedures are executed and the execution of the software application is restored. In some embodiments, the restoring comprises providing memory rollback to a point of execution of the software application before the fault condition was detected.", "num_citations": "28\n", "authors": ["336"]}
{"title": "Pytrigger: A system to trigger & extract user-activated malware behavior\n", "abstract": " We introduce PyTrigger, a dynamic malware analysis system that automatically exercises a malware binary extracting its behavioral profile even when specific user activity or input is required. To accomplish this, we developed a novel user activity record and playback framework and a new behavior extraction approach. Unlike existing research, the activity recording and playback includes the context of every object in addition to traditional keyboard and mouse actions. The addition of the context makes the playback more accurate and avoids dependencies and pitfalls that come with pure mouse and keyboard replay. Moreover, playback can become more efficient by condensing common activities into a single action. After playback, PyTrigger analyzes the system trace using a combination of multiple states and behavior differencing to accurately extract the malware behavior and user triggered behavior from the …", "num_citations": "28\n", "authors": ["336"]}
{"title": "Methods and apparatus for application isolation\n", "abstract": " Processor (s) for detecting malicious software. A hardware virtual machine monitor (HVMM) operates under a host OS. Container (s) initialized with network application template (s) operate under a guest OS VM. A detection module operates under the guest OS VM includes a trigger detection module, a logging module and a container command module. The trigger detection module monitors activity on container (s) for a trigger event. The logging module writes activity report (s) in response to trigger event (s). The container command module issues command (s) in response to trigger event (s). The command (s) include a container start, stop and revert commands. A virtual machine control console operates under the host OS and starts/stops the HVMM. A container control module operates under the guest OSVM and controls container (s) in response to the command (s). The server communication module sends …", "num_citations": "27\n", "authors": ["336"]}
{"title": "Systems and methods for computing data transmission characteristics of a network path based on single-ended measurements\n", "abstract": " Systems and methods for computing data transmission characteristics of a network path are disclosed. In some embodiments, the network path has a sending host, at least one intermediate host, and a receiving host, and the data transmission characteristics are computed based on single-ended measurements performed at the sending host.", "num_citations": "26\n", "authors": ["336"]}
{"title": "Privacy preservation over untrusted mobile networks\n", "abstract": " The proliferation of mobile devices has given rise to novel user-centric applications and services. In current mobile systems, users gain access to remote servers over mobile network operators. These operators are typically assumed to be trusted and to manage the information they collect in a privacy-preserving way. Such information, however, is extremely sensitive and coveted by many companies, which may use it to improve their business. In this context, safeguarding the users’ privacy against the prying eyes of the network operators is an emerging requirement.             In this chapter, we first present a survey of existing state-of-the-art protection mechanisms and their challenges when deployed in the context of wired and wireless networks. Moreover, we illustrate recent and ongoing research that attempts to address different aspects of privacy in mobile applications. Furthermore, we present a new …", "num_citations": "24\n", "authors": ["336"]}
{"title": "Strict virtual call integrity checking for C++ binaries\n", "abstract": " Modern operating systems are equipped with defenses that render legacy code injection attacks inoperable. However, attackers can bypass these defenses by crafting attacks that reuse existing code in a program's memory. One of the most common classes of attacks manipulates memory data used indirectly to execute code, such as function pointers. This is especially prevalent in C++ programs, since tables of function pointers (vtables) are used by all major compilers to support polymorphism. In this paper, we propose VCI, a binary rewriting system that secures C++ binaries against vtable attacks. VCI works directly on stripped binary files. It identifies and reconstructs various C++ semantics from the binary, and constructs a strict CFI policy by resolving and pairing virtual function calls (vcalls) with precise sets of target classes. The policy is enforced by instrumenting checks into the binary at vcall sites. Experimental …", "num_citations": "22\n", "authors": ["336"]}
{"title": "Forced-path execution for android applications on x86 platforms\n", "abstract": " We present a code analysis framework that performs scalable forced-path execution of Android applications in commodity hardware. Our goal is to reveal the full application functional behavior for large commercial applications without access to source code. We do so by identifying code blocks and API calls that are deemed sensitive and provide a security report to an analyst regarding the functionality of the Android application that is under inspection. We show that our approach is scalable by allowing for the execution of each software component by numerous instances of execution modules. Each execution instance exercises a different code path through the application call-graph leading to full code and state space coverage and exposing any hidden or unwanted functionality. The output is a list of API calls, parameter values, component call graphs, and control flow graphs. We show how this can be leveraged …", "num_citations": "22\n", "authors": ["336"]}
{"title": "Evaluating a collaborative defense architecture for manets\n", "abstract": " Mobile Ad-hoc Networks (MANETs) are susceptible to both insider and outsider attacks more than wired and base station-based wireless networks. This is because of the lack of a well-defined defense perimeter in MANETs, preventing the use of defenses including firewalls or intrusion detection systems. This lack of perimeter calls for implementation of security in a distributed, collaborative manner. We recently introduced a novel deny-by-default distributed security policy enforcement architecture for MANETs by harnessing and extending the concept of network capabilities. The deny-by-default principle allows compromised nodes to access only authorized services, limiting their ability to disrupt or even interfere with end-to-end connectivity and nodes beyond their local communication radius. The enforcement of policies is done hop-by-hop, in a distributed manner. In this paper we present preliminary results …", "num_citations": "22\n", "authors": ["336"]}
{"title": "Trustlogin: Securing password-login on commodity operating systems\n", "abstract": " With the increasing prevalence of Web 2.0 and cloud computing, password-based logins play an increasingly important role on user-end systems. We use passwords to authenticate ourselves to countless applications and services. However, login credentials can be easily stolen by attackers. In this paper, we present a framework, TrustLogin, to secure password-based logins on commodity operating systems. TrustLogin leverages System Management Mode to protect the login credentials from malware even when OS is compromised. TrustLogin does not modify any system software in either client or server and is transparent to users, applications, and servers. We conduct two study cases of the framework on legacy and secure applications, and the experimental results demonstrate that TrustLogin is able to protect login credentials from real-world keyloggers on Windows and Linux platforms. TrustLogin is robust …", "num_citations": "21\n", "authors": ["336"]}
{"title": "Providing users’ anonymity in mobile hybrid networks\n", "abstract": " We present a novel hybrid communication protocol that guarantees mobile users’ anonymity against a wide-range of adversaries by exploiting the capability of handheld devices to connect to both WiFi and cellular networks. Unlike existing anonymity schemes, we consider all parties that can intercept communications between a mobile user and a server as potential privacy threats. We formally quantify the privacy exposure and the protection of our system in the presence of malicious neighboring peers, global WiFi eavesdroppers, and omniscient mobile network operators, which possibly collude to breach user’s anonymity or disrupt the communication. We also describe how a micropayment scheme that suits our mobile scenario can provide incentives for peers to collaborate in the protocol. Finally, we evaluate the network overhead and attack resiliency of our protocol using a prototype implementation deployed in …", "num_citations": "21\n", "authors": ["336"]}
{"title": "Hardware Assisted Operating System Switch\n", "abstract": " An interoperable firmware memory containing a Basic Input Output System (BIOS) and a trusted platform module (TPSM). The BIOS includes CPU System Management Mode (SMM) firmware configured as read-only at boot. The SMM firmware configured to control switching subsequent to boot between at least: a first memory and second isolated memory; and a first and second isolated non-volatile storage device. The first memory including a first operating system and the second memory including a second operating system. The first non-volatile storage device configured to be used by the first operating system and the second non-volatile storage device configured to be used by the second operating system. The trusted platform module (TPSM) configured to check the integrity of the CPU system Management Mode (SMM) during the boot process.", "num_citations": "21\n", "authors": ["336"]}
{"title": "Malware characterization using behavioral components\n", "abstract": " Over the past years, we have experienced an increase in the quantity and complexity of malware binaries. This change has been fueled by the introduction of malware generation tools and reuse of different malcode modules. Recent malware appears to be highly modular and less functionally typified. A side-effect of this “composition” of components across different malware types, a growing number of new malware samples cannot be explicitly assigned to traditional classes defined by Anti-Virus (AV) vendors. Indeed, by nature, clustering techniques capture dominant behavior that could be a manifestation of only one of the malware component failing to reveal malware similarities that depend on other, less dominant components and other evolutionary traits.               In this paper, we introduce a novel malware behavioral commonality analysis scheme that takes into consideration component-wise grouping …", "num_citations": "21\n", "authors": ["336"]}
{"title": "LinkWidth: a method to measure link capacity and available bandwidth using single-end probes\n", "abstract": " The scale and complexity of the Internet makes the task of understanding and analyzing its properties extremely difficult. The diffuse style of administration and operation means that even such basic information as topology or link capacity is spread across multiple entities with little incentive to share it. This knowledge, however, is necessary for the design and development of better management tools, communication protocols, and mechanisms that are network-related. As a concrete example, there is little information available on the distribution of access-link capacities and available bandwidth for end-users (eg, how fast can the average user send/receive data from the network). Although our interest is motivated by our work on distributed denial of service defense mechanisms [14, 24], such information is more generally useful. For example, if end users can estimate this information for different network paths then, given a choice between different mirrors, the user can choose the one with the best access characteristics. This recognition has spurred research in this area, with several efforts focusing on estimating available capacity between two hosts [10, 17, 27, 19, 22], and measuring the capacity of an arbitrary network link respectively [15, 10, 22, 8]. Most of these tools (eg. abget, PathLoad, PathChirp, IPERF etc.) use a technique called Self Loading of Periodic Streams (SLoPS). Although accurate, tools that measure the available capacity require two-ended control, ie, that the two endpoints of a path collaborate in the measurement. Thus, the utility of such tools is limited, given our goal to conduct large-scale and/or opportunistic measurements of …", "num_citations": "21\n", "authors": ["336"]}
{"title": "Data sanitization: Improving the forensic utility of anomaly detection systems\n", "abstract": " Anomaly Detection (AD) sensors have become an invaluable tool for forensic analysis and intrusion detection. Unfortunately, the detection accuracy of all learning-based ADs depends heavily on the quality of the training data, which is often poor, severely degrading their reliability as a protection and forensic analysis tool. In this paper, we propose extending the training phase of an AD to include a sanitization phase that aims to improve the quality of unlabeled training data by making them as “attack-free” and “regular” as possible in the absence of absolute ground truth. Our proposed scheme is agnostic to the underlying AD, boosting its performance based solely on training-data sanitization. Our approach is to generate multiple AD models for content-based AD sensors trained on small slices of the training data. These AD “micro-models” are used to test the training data, producing alerts for each training input. We employ voting techniques to determine which of these training items are likely attacks. Our preliminary results show that sanitization increases 0-day attack detection while maintaining a low false positive rate, increasing confidence to the AD alerts. We perform an initial characterization of the performance of our system when we deploy sanitized versus unsanitized AD systems in combination with expensive host-based attack-detection systems. Finally, we provide some preliminary evidence that our system incurs only an initial modest cost, which can be amortized over time during online operation.", "num_citations": "21\n", "authors": ["336"]}
{"title": "A pay-per-use DoS protection mechanism for the Web\n", "abstract": " Internet service providers have resisted deploying Denial-of-Service (DoS) protection mechanisms despite numerous research results in the area. This is so primarily because ISPs cannot directly charge users for the use of such mechanisms, discouraging investment in the necessary infrastructure and operational support.               We describe a pay-per-use system that provides DoS protection for web servers and clients. Our approach is based on WebSOS, an overlay-based architecture that uses reverse Turing tests to discriminate between humans and automated processes that are part of an attack. We extend WebSOS with a credential-based micropayment scheme that combines access control and payment authorization in one operation. Contrary to WebSOS, we use Graphic Turing Tests (GTTs) to prevent malicious code, such as a worm, from using a user’s micropayment wallet. Our architecture …", "num_citations": "21\n", "authors": ["336"]}
{"title": "Exposing security risks for commercial mobile devices\n", "abstract": " Recent advances in the hardware capabilities of mobile hand-held devices have fostered the development of open source operating systems and a wealth of applications for mobile phones and tablet devices. This new generation of smart devices, including iPhone and Google Android, are powerful enough to accomplish most of the user tasks previously requiring a personal computer. Moreover, mobile devices have access to Personally Identifiable Information (PII) from a full suite of sensors such as GPS, camera, microphone and others.               In this paper, we discuss the security threats that stem from these new smart device capabilities and the online application markets for mobile devices. These threats include malware, data exfiltration, exploitation through USB, and user and data tracking. We present our ongoing research efforts to defend or mitigate the impact of attacks against mobile devices. Our …", "num_citations": "20\n", "authors": ["336"]}
{"title": "End-users get maneuvered: Empirical analysis of redirection hijacking in content delivery networks\n", "abstract": " The success of Content Delivery Networks (CDNs) relies on the mapping system that leverages dynamically generated DNS records to distribute client’s request to a proximal server for achieving optimal content delivery. However, the mapping system is vulnerable to malicious hijacks, as (1) it is very difficult to provide pre-computed DNSSEC signatures for dynamically generated records and (2) even considering DNSSEC enabled, DNSSEC itself is vulnerable to replay attacks. By leveraging crafted but legitimate mapping between end-user and edge server, adversaries can hijack CDN’s request redirection and nullify the benefits offered by CDNs, such as proximal access, load balancing, and DoS protection, while remaining undetectable by existing security practices. In this paper, we investigate the security implications of dynamic mapping that remain understudied in security and CDN community. We perform a characterization of CDN’s service delivery and assess this fundamental vulnerability in DNS-based CDNs in the wild. We demonstrate that DNSSEC is ineffective to address this problem, even with the newly adopted ECDSA that is capable of achieving live signing. We then discuss practical countermeasures against such manipulation.", "num_citations": "19\n", "authors": ["336"]}
{"title": "Advancing open science with version control and blockchains\n", "abstract": " The scientific community is facing a crisis of reproducibility: confidence in scientific results is damaged by concerns regarding the integrity of experimental data and the analyses applied to that data. Experimental integrity can be compromised inadvertently when researchers overlook some important component of their experimental procedure, or intentionally by researchers or malicious third-parties who are biased towards ensuring a specific outcome of an experiment. The scientific community has pushed for \"open science\" to add transparency to the experimental process, asking researchers to publicly register their data sets and experimental procedures. We argue that the software engineering community can leverage its expertise in tracking traceability and provenance of source code and its related artifacts to simplify data management for scientists. Moreover, by leveraging smart contract and blockchain …", "num_citations": "19\n", "authors": ["336"]}
{"title": "On the DNS deployment of modern web services\n", "abstract": " Accessing Internet services relies on the Domain Name System (DNS) for translating human-readable names to routable network addresses. At the bottom level of the DNS hierarchy, the authoritative DNS (ADNS) servers maintain the actual mapping records and answer the DNS queries. Today, the increasing use of upstream ADNS services (i.e., third-party ADNS-hosting services) and Infrastructure-as-a-Service (IaaS) clouds facilitates the establishment of web services, and has been fostering the evolution of the deployment of ADNS servers. To shed light on this trend, in this paper we present a large-scale measurement to study the ADNS deployment patterns of modern web services and examine the characteristics of different deployment styles, such as performance, life-cycle of servers, and availability. Furthermore, we focus specifically on the DNS deployment for subdomains hosted in IaaS clouds.", "num_citations": "19\n", "authors": ["336"]}
{"title": "Capman: capability-based defense against multi-path denial of service (dos) attacks in manet\n", "abstract": " This paper presents a capability-based security mechanism called CapMan. Our approach is designed to prevent Denial-of-Service (DoS) attacks on wireless communications, particularly against multi-path communication in Mobile Ad-hoc Networks (MANETs). CapMan offers a mechanism for a per flow, distributed bandwidth control by all the participating nodes along multiple communication paths. By exchanging summary capability messages, each node can maintain a global view of the overall throughput of flows in the network, and then dynamically adjust local constraints to prevent potential DoS attacks against a specific node or the network. Our approach is capable of scalably curtailing sophisticated DoS attacks that target multi-path routing protocols, even in the case that both the initiator and the responder of a network flow are malicious insiders and collude to deprive the network of valuable resources. We …", "num_citations": "18\n", "authors": ["336"]}
{"title": "Breaking BLE beacons for fun but mostly profit\n", "abstract": " Bluetooth Low Energy (BLE) Beacons introduced a novel technology that enables devices to advertise their presence in an area by constantly broadcasting a static unique identifier. The aim was to enhance services with location and context awareness. Although the hardware components of typical BLE Beacons systems are able to support adequate cryptography, the design and implementation of most publicly available BLE Beacon protocols appears to render them vulnerable to a plethora of attacks. Indeed, in this paper, we were able to perform user tracking, user behavior monitoring, spoofing as well as denial of service (DoS) of many supported services. Our aim is to show that these attacks stem from design flaws of the underlying protocols and assumptions made for the BLE beacons protocols. Using a clearly defined threat model, we provide a formal analysis of the adversarial capabilities and requirements …", "num_citations": "17\n", "authors": ["336"]}
{"title": "Providing mobile users’ anonymity in hybrid networks\n", "abstract": " We present a novel hybrid communication protocol that guarantees mobile users’ k-anonymity against a wide-range of adversaries by exploiting the capability of handheld devices to connect to both WiFi and cellular networks. Unlike existing anonymity schemes, we consider all parties that can intercept communications between the mobile user and a server as potential privacy threats. We formally quantify the privacy exposure and the protection of our system in the presence of malicious neighboring peers, global WiFi eavesdroppers, and omniscient mobile network operators. We show how our system provides an automatic incentive for users to collaborate, since by forwarding packets for other peers users gain anonymity for their own traffic.", "num_citations": "17\n", "authors": ["336"]}
{"title": "Keep your friends close: the necessity for updating an anomaly sensor with legitimate environment changes\n", "abstract": " Large-scale distributed systems have dense, complex code-bases that are assumed to perform multiple and inter-dependent tasks while user interaction is present. The way users interact with systems can differ and evolve over time, as can the systems themselves. Consequently, anomaly detection (AD) sensors must be able to cope with updates to their operating environment. Otherwise, the sensor may incorrectly classify new patterns as malicious (a false positive) or assert that old or outdated patterns are normal (a false negative). This problem of\" model drift\" is an almost universally acknowledged hazard for anomaly sensors. However, relatively little work has been done to understand the process of identifying and seamlessly updating an operational network AD sensor with legal modifications like changes to a file system or back-end database.", "num_citations": "17\n", "authors": ["336"]}
{"title": "E-android: A new energy profiling tool for smartphones\n", "abstract": " As the limited battery lifetime remains a major factor restricting the applicability of a smartphone, significant research efforts have been devoted to understand the energy consumption in smartphones. Existing energy modeling methods can account energy drain in a fine-grained manner and provide well designed human-battery interfaces for users to characterize energy usage of every app in smartphones. However, in this paper, we demonstrate that there are still pitfalls in current Android energy modeling approaches, leaving collateral energy consumption unaccounted. The existence of collateral energy consumption becomes a serious energy bug. In particular, those energy bugs could be exploited to launch a new class of energy attacks, which deplete battery life and sidestep the supervision of current energy accounting. To unveil collateral energy bugs, we propose E-Android to accurately profile energy …", "num_citations": "16\n", "authors": ["336"]}
{"title": "Securely Making\" Things\" Right\n", "abstract": " The Internet of Things (IoT) promises to seamlessly bind the physical world to cyberinfrastructure, but the Internet's insecure design principles could lead to life-threatening consequences. It's time to make security an integral IoT design tenet.", "num_citations": "16\n", "authors": ["336"]}
{"title": "Attestation & authentication for usb communications\n", "abstract": " In this paper, we present the design, implementation, and software testing of USBSec, a secure extension of the vanilla USB protocol that incorporates host authentication to defend against software threats. Specifically, we force the USB host to supply authentication information to the peripheral device before enumerating the device. The peripheral validates the authentication information against its own list of authorized host keys. If both sides can validate each other, standard USB enumeration continues otherwise the connection is terminated. We have implemented a fully working prototype of USBSec based on USB implementation in Linux kernel and our experimental results demonstrate its practicality and effectiveness.", "num_citations": "16\n", "authors": ["336"]}
{"title": "Activity spoofing and its defense in Android smartphones\n", "abstract": " Smartphones have become ubiquitous in today’s digital world as a mobile platform allowing anytime access to email, social platforms, banking, and shopping. Many providers supply native applications as a method to access their services, allowing users to login directly through a downloadable app. In this paper, we first expose a security vulnerability in the Android framework that allows for third party apps to spoof native app activities, or screens. This can lead to a wide variety of security risks including the capture and silent exfiltration of login credentials and private data. We then compare current defense mechanisms, and introduce the concept of Trusted Activity Chains as a lightweight protection against common spoofing attacks. We develop a proof of concept implementation and evaluate its effectiveness and performance overhead.", "num_citations": "15\n", "authors": ["336"]}
{"title": "Verified time\n", "abstract": " A provably secure timestamping system could be achieved by combining the trustworthiness and accuracy that comes from having a set of trusted centralized timestamping authorities with the open, decentralized nature of blockchain protocols.", "num_citations": "14\n", "authors": ["336"]}
{"title": "Privacy risk assessment on online photos\n", "abstract": " With the rising popularity of cameras and people’s increasing desire to share photos, an overwhelming number of photos have been posted all over the Web. A digital photo usually contains much information in its metadata. Once published online, a photo could disclose much more information beyond what is visually depicted in the photo and what the owner expects to share. The metadata contained in digital photos could pose significant privacy threats to their owners. Our work aims to raise public awareness of privacy risks resulting from sharing photos online and subsequent photo handling conducted by contemporary media sites. To this end, we investigated the prevalence of metadata information among digital photos and assessed the potential privacy risks arising from the metadata information. We also studied the policies adopted by online media sites on handling the metadata information …", "num_citations": "14\n", "authors": ["336"]}
{"title": "Adding trust to P2P distribution of paid content\n", "abstract": " While peer-to-peer (P2P) file-sharing is a powerful and cost-effective content distribution model, most paid-for digital-content providers (CPs) use direct download to deliver their content. CPs are hesitant to rely on a P2P distribution model because it introduces a number of security concerns including content pollution by malicious peers, and lack of enforcement of authorized downloads. Furthermore, because users communicate directly with one another, the users can easily form illegal file-sharing clusters to exchange copyrighted content. Such exchange could hurt the content providers’ profits. We present a P2P system TP2P, where we introduce a notion of trusted auditors (TAs). TAs are P2P peers that police the system by covertly monitoring and taking measures against misbehaving peers. This policing allows TP2P to enable a stronger security model making P2P a viable alternative for the distribution …", "num_citations": "14\n", "authors": ["336"]}
{"title": "Quantifying Application Behavior Space for Detection and Self-Healing\n", "abstract": " The increasing sophistication of software attacks has created the need for increasingly finer-grained intrusion and anomaly detection systems, both at the network and the host level. We believe that the next generation of defense mechanisms will require a much more detailed dynamic analysis of application behavior than is currently done. We also note that the same type of behavior analysis is needed by the current embryonic attempts at self-healing systems. Because such mechanisms are currently perceived as too expensive in terms of their performance impact, questions relating to the feasibility and value of such analysis remain unexplored and unanswered.We present a new mechanism for profiling the behavior space of an application by analyzing all function calls made by the process, including regular functions and library calls, as well as system calls. We derive behavior from aspects of both control and data flow. We show how to build and check profiles that contain this information at the binary level–that is, without making changes to the application’s source, the operating system, or the compiler. This capability makes our system, Lugrind, applicable to a variety of software, including COTS applications. Profiles built for the applications we tested can predict behavior with 97% accuracy given a context window of 15 functions. Lugrind demonstrates the feasibility of combining binary-level behavior profiling with detection and automated repair.", "num_citations": "14\n", "authors": ["336"]}
{"title": "Detecting rop with statistical learning of program characteristics\n", "abstract": " Return-Oriented Programming (ROP) has emerged as one of the most widely used techniques to exploit software vulnerabilities. Unfortunately, existing ROP protections suffer from a number of shortcomings: they require access to source code and compiler support, focus on specific types of gadgets, depend on accurate disassembly and construction of Control Flow Graphs, or use hardware-dependent (microarchitectural) characteristics. In this paper, we propose EigenROP, a novel system to detect ROP payloads based on unsupervised statistical learning of program characteristics. We study, for the first time, the feasibility and effectiveness of using microarchitecture-independent program characteristics--namely, memory locality, register traffic, and memory reuse distance--for detecting ROP. We propose a novel directional statistics based algorithm to identify deviations from the expected program characteristics …", "num_citations": "13\n", "authors": ["336"]}
{"title": "Radmin: early detection of application-level resource exhaustion and starvation attacks\n", "abstract": " Software systems are often engineered and tested for functionality under normal rather than worst-case conditions. This makes the systems vulnerable to denial of service attacks, where attackers engineer conditions that result in overconsumption of resources or starvation and stalling of execution. While the security community is well familiar with volumetric resource exhaustion attacks at the network and transport layers, application-specific attacks pose a challenging threat. In this paper, we present Radmin, a novel system for early detection of application-level resource exhaustion and starvation attacks. Radmin works directly on compiled binaries. It learns and executes multiple probabilistic finite automata from benign runs of target programs. Radmin confines the resource usage of target programs to the learned automata, and detects resource usage anomalies at their early stages. We demonstrate the …", "num_citations": "13\n", "authors": ["336"]}
{"title": "Systems and methods for inhibiting attacks with a network\n", "abstract": " Systems and methods for inhibiting attacks with a network are provided. In some embodiments, methods for inhibiting attacks by forwarding packets through a plurality of intermediate nodes when being transmitted from a source node to a destination node are provided, the methods comprising: receiving a packet at one of the plurality of intermediate nodes; determining at the selected intermediate node whether the packet has been sent to the correct one of the plurality of intermediate nodes based on a pseudo random function; and forwarding the packet to the destination node, based on the determining. In some embodiments an intermediate node is selected based on a pseudo random function. In some embodiments, systems and methods for establishing access to a multi-path network are provided.", "num_citations": "12\n", "authors": ["336"]}
{"title": "Exposing software security and availability risks for commercial mobile devices\n", "abstract": " The advent of smaller, faster, and always connected handheld devices along with the ever-increasing reliance on technology for our everyday activities have introduced novel threats and risks. Beyond hardware security another primary factor that affects the reliability of the device is mobile applications. Indeed, the shift to smart commercially available mobile devices has created a pressing need for understanding the risks in using third-party mobile code running on the mobile devices. This new generation of smart devices and systems, including iPhone and Google Android, are powerful enough to accomplish most of the user tasks previously requiring a personal computer. In our paper, we discuss the cyber threats that stem from these new smart device capabilities and the on-line application markets for mobile devices. These threats include malware, data exfiltration, exploitation through USB, and user and data …", "num_citations": "12\n", "authors": ["336"]}
{"title": "A dependability analysis of hardware-assisted polling integrity checking systems\n", "abstract": " Due to performance constraints, host intrusion detection defenses depend on event and polling-based tamper-proof mechanisms to detect security breaches. These defenses monitor the state of critical software components in an attempt to discover any deviations from a pristine or expected state. The rate and type of checks depend can be both periodic and event-based, for instance triggered by hardware events. In this paper, we demonstrate that all software and hardware-assisted defenses that analyze non-contiguous state to infer intrusions are fundamentally vulnerable to a new class of attacks, we call “evasion attacks”. We detail two categories of evasion attacks: directly-intercepting the defense triggering mechanism and indirectly inferring its periodicity. We show that evasion attacks are applicable to a wide-range of protection mechanisms and we analyze their applicability in recent state-of-the-art hardware …", "num_citations": "12\n", "authors": ["336"]}
{"title": "Cybersecurity leadership: Competencies, governance, and technologies for industrial control systems\n", "abstract": " The extensive integration of interconnected devices and the inadvertent information obtained from untrusted sources has exposed the Industrial Control Systems (ICS) ecosystem to remote attacks by the exploitation of new and old vulnerabilities. Unfortunately, although recognized as an emerging risk based on the recent rise of cyber attacks, cybersecurity for ICS has not been addressed adequately both in terms of technology but, most importantly, in terms of organizational leadership and policy. In this paper, we will present our findings regarding the cybersecurity challenges for Smart Grid and ICS and the need for changes in the way that organizations perceive cybersecurity risk and leverage resources to balance the needs for information security and operational security. Moreover, we present empirical data that point to cybersecurity governance and technology principles that can help public and private …", "num_citations": "11\n", "authors": ["336"]}
{"title": "Advantages and disadvantages of remote asynchronous usability testing using Amazon mechanical turk\n", "abstract": " Amazon’s Mechanical Turk is an online service that connects people all over the world who are willing to work for monetary compensation with companies and individuals who need simple tasks completed that are best done by humans. This paper examines the benefits and caveats from the use of Mechanical Turk as a platform to conduct an online usability test. Our findings indicate that Mechanical Turk can be a very useful tool when it is employed to collect basic user generated data such as click time and location, text input, and subjective usability data. In situations where more complex usage data is required, Mechanical Turk can still be a valuable resource to run a pilot test to assist in determining potential usability problems. However, in its current form, Mechanical Turk has limitations and can only be used to assess websites; it cannot be relied upon to conduct a usability test on software without the use of a …", "num_citations": "11\n", "authors": ["336"]}
{"title": "Event Driven Email Revocation\n", "abstract": " An email revocation in which transmitted email can be recalled before a recipient is able to read the transmitted email is provided. An event server stores a transmitted email for a given time period or until being retrieved by a receiving email client. If the given time period expires or the email is recalled, the receiving email client is unable to retrieve the email.", "num_citations": "11\n", "authors": ["336"]}
{"title": "{FIRMSCOPE}: Automatic uncovering of privilege-escalation vulnerabilities in pre-installed apps in android firmware\n", "abstract": " Android devices ship with pre-installed privileged apps in their firmware—some of which are essential system components, others deliver a unique user experience—that users cannot disable. These pre-installed apps are assumed to be secure as they are handpicked or developed by the device vendors themselves rather than third parties. Unfortunately, we have identified an alarming number of Android firmware that contain privilege-escalation vulnerabilities in pre-installed apps, allowing attackers to perform unauthorized actions such as executing arbitrary commands, recording the device audio and screen, and accessing personal data to name a few. To uncover these vulnerabilities, we built FIRMSCOPE, a novel static analysis system that analyzes Android firmware to expose unwanted functionality in pre-installed apps using an efficient and practical context-sensitive, flow-sensitive, field-sensitive, and partially object-sensitive taint analysis. Our experimental results demonstrate that FIRMSCOPE significantly outperforms the state-of-the-art Android taint analysis solutions both in terms of detection power and runtime performance. We used FIRMSCOPE to scan 331,342 pre-installed apps in 2,017 Android firmware images from v4. 0 to v9. 0 from more than 100 Android vendors. Among them, FIRMSCOPE uncovered 850 unique privilege-escalation vulnerabilities, many of which are exploitable and 0-day.", "num_citations": "10\n", "authors": ["336"]}
{"title": "Detecting and characterizing web bot traffic in a large e-commerce marketplace\n", "abstract": " A certain amount of web traffic is attributed to web bots on the Internet. Web bot traffic has raised serious concerns among website operators, because they usually consume considerable resources at web servers, resulting in high workloads and longer response time, while not bringing in any profit. Even worse, the content of the pages it crawled might later be used for other fraudulent activities. Thus, it is important to detect web bot traffic and characterize it. In this paper, we first propose an efficient approach to detect web bot traffic in a large e-commerce marketplace and then perform an in-depth analysis on the characteristics of web bot traffic. Specifically, our proposed bot detection approach consists of the following modules: (1) an Expectation Maximization (EM)-based feature selection method to extract the most distinguishable features, (2) a gradient based decision tree to calculate the likelihood of …", "num_citations": "10\n", "authors": ["336"]}
{"title": "Targeted DoS on android: how to disable android in 10 seconds or less\n", "abstract": " we present the implementation and impact of a wide-range of novel targeted Denial of Service (DoS) attacks on Android devices that are persistent across all recent Android platform versions. The DoS attacks can be selectively focused on denying access to device resources including microphone and camera, preventing the installation of applications, making the device unresponsive, targeting and terminating other running applications and processes, and causing a reboot cycle. To make matters worse, the attacks can be launched through regular apps that do not require a rooted device or any permissions with the exception of the attacks on the microphone and camera resources that require simple access rights. We propose and demonstrate defenses against each of these attacks showing that the security and reliability flaws identified require changes in the underlying Android source code to address them.", "num_citations": "10\n", "authors": ["336"]}
{"title": "HIDEINSIDE—A novel randomized & encrypted antiforensic information hiding\n", "abstract": " Several techniques have been proposed for information hiding including hiding in slack space, which is the focus of this paper. However, current techniques of hiding in slack space depend on utilizing exiting slack space on the disk, which can be seriously limiting. Also, all techniques proposed thus far for hiding in slack space are impacted by the cluster size on the disk since the maximum slack space is a function of the cluster size. This necessitates splitting the data to be hidden into numerous parts, making it cumbersome to remember their locations and sequence for reassembly. Finally, hiding in existing slack space risks loss of data due to overwriting if the file - whose slack is used for hiding - grows in size. In this paper we propose - HIDEINSIDE - a novel on-demand slack space generator that creates new files on-the-fly that act as the cover file for hiding. The proposed method is an Antiforensics as well as a …", "num_citations": "10\n", "authors": ["336"]}
{"title": "Building security into off-the-shelf smartphones\n", "abstract": " Quantifying mobile application functionality and enforcing a finer-grained permission model would identify and thus thwart a wide range of malware.", "num_citations": "10\n", "authors": ["336"]}
{"title": "An analysis of system management mode (SMM)-based integrity checking systems and evasion attacks\n", "abstract": " System Management Mode (SMM) is an x86 processor feature designed to assist debugging for hardware manufacturers. Recent research has shown that SMM can also be used to protect the run-time integrity of software by invoking SMM to periodically check current system state and compare it with known pristine or trusted software states. Researchers and practitioners have claimed that any unauthorized state modification can be detected with an SMM-based system integritychecking mechanism.In this paper, we demonstrate that all hardware-based, periodic integrity mechanisms can be defeated by a new class of attacks, which we refer to as “evasion attacks.” Such attacks use a compromised software stack to remove any attack traces before the integrity checks begin and to continue the execution of the malicious code after the integrity checks are completed. We detail two categories of evasion attacks: directly-intercepting System Management Interrupt (SMI) and indirectly-deriving SMI invocations. Finally, we measure the performance impact of our proof-of-concept prototypes for all of the attacks and present countermeasures for these attacks.", "num_citations": "10\n", "authors": ["336"]}
{"title": "A virtualization architecture for in-depth Kernel isolation\n", "abstract": " Recent advances in virtualization technologies have sparked a renewed interest in the use of kernel and process virtualization as a security mechanism to enforce resource isolation and management. Unfortunately, virtualization solutions incur performance overhead. The magnitude of this overhead is directly proportional to the extend of virtualization they offer: full virtualization incurs an additional indirection layer to interface with the ever increasing hardware devices.In this paper, we propose a hypervisor-assisted, micro-kernel architecture which aims to provide in-depth resource isolation without the performance penalty of full virtualization. To that end, we extend the hypervisor capabilities with a lightweight VMM which enforces \"identity context'' to all assigned devices for each of the hosted kernels. Furthermore, we separate the control from the data plane for all hardware devices using data memory mapping …", "num_citations": "10\n", "authors": ["336"]}
{"title": "The Heisenberg Measuring Uncertainty in Lightweight Virtualization Testbeds.\n", "abstract": " The need for large-scale experimentation testbeds involving several hundred, or even thousands, of nodes is undeniable. Testbeds including Emulab [10], and Deter [5] are heavily used for both research and application testing. To scale even further and shed some of the limitations that the relative small number of physical nodes impose, researchers have turned to full virtualization [8] and lightweight, container-based virtualization [16, 10]. Virtualization allows running multiple virtual execution environments (VEEs) per physical host. In this paper, we evaluate the use of hundreds of lightweight containers as a testbed to measure the performance of simple applications. We show that, although economically and technically compelling, virtualization has some limitations due the sharing of host resources (CPU, network, memory and disk) among samehost VEEs. Determining the number of VEEs that can be deployed in a physical machine without interfering with the fidelity of the experiment is not a trivial task and it cannot be estimated or computed ahead of time using aggregate utilization of individual resource. Furthermore, monitoring the health of an experiment by measuring the individual resource utilization can affect the behavior of the service under test. Therefore, we observed what we call a “weak” form of the Heisenberg uncertainty principle for host resource measurements: increasing the precision and fidelity of the resource measurements can interfere with the behavior of the experiment. We believe that this observation holds in general but it becomes more pronounced when we instantiate hundreds of VEEs due to the necessary context …", "num_citations": "10\n", "authors": ["336"]}
{"title": "Towards transparent debugging\n", "abstract": " Traditional malware analysis relies on virtualization or emulation technology to run samples in a confined environment, and to analyze malicious activities by instrumenting code execution. However, virtual machines and emulators inevitably create artifacts in the execution environment, making these approaches vulnerable to detection or subversion. In this paper, we present MALT, a debugging framework that employs System Management Mode, a CPU mode in the x86 architecture, to transparently study armored malware. MALT does not depend on virtualization or emulation and thus is immune to threats targeting such environments. Our approach reduces the attack surface at the software level, and advances state-of-the-art debugging transparency. MALT embodies various debugging functions, including register/memory accesses, breakpoints, and seven stepping modes. Additionally, MALT restores the system …", "num_citations": "9\n", "authors": ["336"]}
{"title": "Website matching based on network traffic\n", "abstract": " A website fingerprint is generated that characterizes network traffic associated with a website as a website traffic fingerprint that includes size description (s), order description (s), and timing description (s) of packet traffic for the website. A website monitor generates website trace (s) of packet statistics. A correlation processor correlates a sequence of packet statistics from the website trace (s) with the size description, the order description, and timing description found in the website traffic fingerprint (s).", "num_citations": "9\n", "authors": ["336"]}
{"title": "Systems and methods for analyzing software\n", "abstract": " Disclosures herein describe methods and systems for detecting unlicensed content that can be accessed by electronic devices using an automated framework for analyzing applications present on the electronic device that allow a user of the electronic device to access unlicensed content.", "num_citations": "8\n", "authors": ["336"]}
{"title": "20 years of ddos: a call to action\n", "abstract": " Botnet Distributed Denial of Service (DDoS) attacks are now 20 years old; what has changed in that time? Their disruptive presence, their volume, distribution across the globe, and the relative ease of launching them have all been trending in favor of attackers. Our increases in network capacity and our architectural design principles are making our online world richer, but are favoring attackers at least as much as Internet services. The DDoS mitigation techniques have been evolving but they are losing ground to the increasing sophistication and diversification of the attacks that have moved from the network to the application level, and we are operationally falling behind attackers. It is time to ask fundamental questions: are there core design issues in our network architecture that fundamentally enable DDoS attacks? How can our network infrastructure be enhanced to address the principles that enable the DDoS problem? How can we incentivize the development and deployment of the necessary changes? In this article, we want to sound an alarm and issue a call to action to the research community. We propose that basic research and principled analyses are badly needed, because the status quo does not paint a pretty picture for the future.", "num_citations": "8\n", "authors": ["336"]}
{"title": "Practical and accurate runtime application protection against dos attacks\n", "abstract": " Software Denial-of-Service (DoS) attacks use maliciously crafted inputs aiming to exhaust available resources of the target software. These application-level DoS attacks have become even more prevalent due to the increasing code complexity and modular nature of Internet services that are deployed in cloud environments, where resources are shared and not always guaranteed. To make matters worse, many code testing and verification techniques cannot cope with the code size and diversity present in most services used to deliver the majority of everyday Internet applications. In this paper, we propose Cogo, a practical system for early DoS detection and mitigation of software DoS attacks. Unlike prior solutions, Cogo builds behavioral models of network I/O events in linear time and employs Probabilistic Finite Automata (PFA) models to recognize future resource exhaustion states. Our tracing of events …", "num_citations": "8\n", "authors": ["336"]}
{"title": "Preventing exploits in microsoft office documents through content randomization\n", "abstract": " Malware laden documents are a common exploit vector, often used as attachments to phishing emails. Current approaches seek to detect the malicious attributes of documents through signature matching, dynamic analysis, or machine learning. We take a different approach: we perform transformations on documents that render exploits inoperable while maintaining the visual interpretation of the document intact. Our exploit mitigation techniques are similar in effect to address space layout randomization and data randomization, but we implement them through permutations to the document file layout.                 We randomize the data block order of Microsoft OLE files in a manner similar to the inverse of a filesystem defragmention tool. This relocates malicious payloads in both the original document file and in the memory of the reader program. Through dynamic analysis, we demonstrate that our approach …", "num_citations": "8\n", "authors": ["336"]}
{"title": "Capability-based defenses against DoS attacks in multi-path MANET communications\n", "abstract": " We present the design, implementation, and evaluation of CapMan, a capability-based security mechanism that prevents denial-of-service (DoS) attacks against mobile ad-hoc networks (MANETs). In particular, our approach is designed to mitigate insider attacks that exploit multi-path routing to flood with packets on other participating nodes in the network. CapMan is instantiated on every node and enforces capability limits that effectively regulate the traffic for all end-to-end network flows. Each capability is issued and advertised by the capability distribution module, and is globally maintained via the capability enforcement logic. By periodically exchanging small usage summaries, all cooperating nodes are informed of the global network state in a scalable and consistent manner. The distribution of summaries empowers individual nodes to make informed decisions and regulate traffic as dictated by the per …", "num_citations": "8\n", "authors": ["336"]}
{"title": "Netgator: Malware detection using program interactive challenges\n", "abstract": " Internet-borne threats have evolved from easy to detect denial of service attacks to zero-day exploits used for targeted exfiltration of data. Current intrusion detection systems cannot always keep-up with zero-day attacks and it is often the case that valuable data have already been communicated to an external party over an encrypted or plain text connection before the intrusion is detected.               In this paper, we present a scalable approach called Network Interrogator (NetGator) to detect network-based malware that attempts to exfiltrate data over open ports and protocols. NetGator operates as a transparent proxy using protocol analysis to first identify the declared client application using known network flow signatures.Then we craft packets that “challenge” the application by exercising functionality present in legitimate applications but too complex or intricate to be present in malware. When the application …", "num_citations": "8\n", "authors": ["336"]}
{"title": "Exploiting smart-phone USB connectivity for fun and profit\n", "abstract": " Exploiting Smart-Phone USB Connectivity For Fun And Profit Page 1 Exploiting Smart-Phone USB Connectivity For Fun And Profit Angelos Stavrou & Zhaohui Wang Department of Computer Science George Mason University Page 2 Talk Outline □ Background – Why USB attacks? What’s new here? ∎ New attack vectors, different from simple USB storage □ Phone-‐to-‐Computer Attack □ Computer-‐to-‐Phone Attack □ Phone-‐to-‐Phone Attack □ Demo & Discussion Points □ Defenses & Future Work Page 3 USB is Pervasive in Gadgets □ All Smart-Phone devices use USB ∎ Google Android Devices (HTC, Motorola, …) ∎ Apple iPhone ∎ Blackberry ∎ Others □ Multi-purpose Usage ∎ Charging the Device Battery ∎ Data & Media Transfer ∎ Control external Devices (new capability) Page 4 USB-borne Threats only focused on Auto-Mounting Page 5 USB-borne Threats are much more complex… ∎ USB protocol …", "num_citations": "8\n", "authors": ["336"]}
{"title": "Experimental results of cross-site exchange of web content anomaly detector alerts\n", "abstract": " We present our initial experimental findings from the collaborative deployment of network Anomaly Detection (AD) sensors. Our system examines the ingress http traffic and correlates AD alerts from two administratively disjoint domains: Columbia University and George Mason University. We show that, by exchanging packet content alerts between the two sites, we can achieve zero-day attack detection capabilities with a relatively small number of false positives. Furthermore, we empirically demonstrate that the vast majority of common abnormal data represent attack vectors rather than false positives. We posit that cross-site collaboration enables the automated detection of common abnormal data which are likely to ferret out zero-day attacks with high accuracy and minimal human intervention.", "num_citations": "8\n", "authors": ["336"]}
{"title": "Darpa Mobivisor: An Architecture for High Assurance for Untrusted Applications on Wireless Handheld Devices Via Lightweight Virtualization\n", "abstract": " This report summarizes the research and activities of the project entitled An Architecture for High Assurance for Untrusted Applications on Wireless Handheld Devices via Lightweight Virtualization or simply DARPA MobiVisor. In this work, GMU introduces a containment based security enforcement mechanism designed to contain applications inside virtual containers, separating the running instance of a program from the rest of the system while providing a complete execution environment that supports monitoring, profiling, and controlling applications. A two-fold approach is taken towards these goals isolation through virtualization and resource management. Isolation addresses the containment of processes at process control and file system levels, whereas resource management handles accounting, profiling, and provisioning of system resources including CPU, memory, network, battery, and storage, etc. With these mechanisms in place, it is believed that a wide range of security policies can be effectively enforced to provide a secure and lightweight execution environment for applications for smart handheld devices.Descriptors:", "num_citations": "8\n", "authors": ["336"]}
{"title": "Preliminary study of fission defenses against low-volume DoS attacks on proxied multiserver systems\n", "abstract": " Multiserver applications deployed in the public cloud infrastructure continue to be plagued by significant threat of Distributed Denial of Service (DDoS) attacks by large scale botnets, including very notable attack instances just this past Fall. Previously, proposed cloud-based defenses have attempted to address different aspects of this problem including: a proactive moving target approach to combat the reconnaissance phase where the botnet ascertains the identities (IP addresses) of the proxy (indirection) servers, and client-to-proxy-server assignment shuffling to deal with volumetric attacks. In this paper, we describe a “fission” quarantine approach to deal with low-volume DoS attacks targeting the application servers. We then overview a developing attack-defense emulation platform. Finally, we give the results of a preliminary, model based numerical evaluation of the performance and cost of fission defense.", "num_citations": "7\n", "authors": ["336"]}
{"title": "An empirical investigation of ecommerce-reputation-escalation-as-a-service\n", "abstract": " In online markets, a store’s reputation is closely tied to its profitability. Sellers’ desire to quickly achieve a high reputation has fueled a profitable underground business that operates as a specialized crowdsourcing marketplace and accumulates wealth by allowing online sellers to harness human laborers to conduct fake transactions to improve their stores’ reputations. We term such an underground market a seller-reputation-escalation (SRE) market. In this article, we investigate the impact of the SRE service on reputation escalation by performing in-depth measurements of the prevalence of the SRE service, the business model and market size of SRE markets, and the characteristics of sellers and offered laborers. To this end, we have infiltrated five SRE markets and studied their operations using daily data collection over a continuous period of 2 months. We identified more than 11,000 online sellers posting at …", "num_citations": "7\n", "authors": ["336"]}
{"title": "Authentication feature and model selection using penalty algorithms\n", "abstract": " Continuous Authentication (CA) is the process of verifying the identity of the user of an electronic device repeatedly while the device is in use. Existing research in the field employs metrics such as Equal Error Rate (EER) and/or the Receiver Operating Characteristic (ROC) to evaluate the performance in the same way as ‘entry-point’biometric authentication schemes. These metrics have various shortcomings with regard to CA as they fail to model the practical implications of the authentication process. We would like to discuss and get feedback on performance evaluation techniques that capture practical aspects of the authentication system including the length and frequency of times an impostor reaches different authentication levels and similarly for the genuine user. Our preliminary results show that a multi-level authentication system is not only more accurate than a binary diagnosis but it allows for high level of accuracy. We posit that further research is needed in developing such a metric for truly evaluating a CA system.", "num_citations": "7\n", "authors": ["336"]}
{"title": "Predicting network response times using social information\n", "abstract": " Social networks and discussion boards have become a significant outlet where people communicate and express their opinion freely. Although the social networks themselves are usually well-provisioned, the participating users frequently point to external links to substantiate their discussions. Unfortunately, the sudden heavy traffic load imposed on the external, linked web sites causes them to become unresponsive leading to the \"Flash Crowds\" effect. In this paper, we quantify the prevalence of flash crowd events for a popular social discussion board (Digg). We measured the response times of 1289 unique popular websites. We were able to verify that 89% of the popular URLs suffered variations in their response times. By analyzing the content and structure of the social discussions, we were able to forecast accurately for 86% of the popular web sites within 5 minutes of their submission and 95% of the sites when …", "num_citations": "7\n", "authors": ["336"]}
{"title": "Breaching & protecting an anonymizing network system\n", "abstract": " The protection of personally identifiable information (PII) is paramount for certain organizations. As a result, these organizations are currently employing both commercial products and open source Anonymizing Network Systems (ANS) as part of their standard network defenses to anonymize their outbound traffic. In this paper, we analyze the benefits and caveats of a typical deployment of an ANS. We call this the Case-Study Anonymizing Network System (CSANS) and we show that while network-level anonymity systems are better at protecting end-user privacy than having no ANS in place, they are unable to thwart de-anonymization attacks aimed at applications and private data of end-users. Indeed, the anonymity protection that ANS users enjoy can be bypassed by targeted attacks against both applications and users. To further explain our claims and quantify the different types of attacks and intruder capabilities, we introduce two threat models. We demonstrate and substantiate our claims using a targeted experiment against actual operational scenarios of users who are relying on the CSANS in a real organization to complete their research tasks. To that end, we set up an experiment to guide users (often referred to as researchers) to a website containing both non-malicious and malicious files. The downloading and opening of these files can enable an intruder to expose the true identities of the users even though the users were using a protected, isolated ANS connected machine. The main takeaway from this study was that both the administrators and CSANS users were not educated about quite prevalent attack vectors for compromising …", "num_citations": "7\n", "authors": ["336"]}
{"title": "The dynamic community of interest and its realization in ZODIAC\n", "abstract": " The ZODIAC project has been exploring a security first approach to networking based on a new idea, the dynamic community of interest, based on groups of users with a demonstrable need to know. ZODIAC uses the most challenging network setting (the mobile ad hoc network) as a target, since each node must incorporate functions of both hosts and routers. The realization of the DCoI is a work in progress, but initial implementation results have shown that DCoI concepts can be translated into working systems. The current system applies virtual machine containers, extensive use of cryptography and digital signatures, dispersity routing, DHT-based naming, and explicit rate control among other advanced techniques. Putting security to the forefront in the design has led to interesting consequences for naming, authorization, and connection setup. In particular, it has demanded a hierarchical structure for DCoIs that …", "num_citations": "7\n", "authors": ["336"]}
{"title": "Approximating a Global Passive Adversary Against Tor\n", "abstract": " We present a novel, practical, and effective mechanism for exposing the IP address of Tor relays, clients and hidden services. We approximate an almost-global passive adversary (GPA) capable of eavesdropping anywhere in the network by using LinkWidth. LinkWidth allows network edge-attached entities to estimate the available bandwidth in an arbitrary Internet link without a cooperating peer host, router, or ISP. By modulating the bandwidth of an anonymous connection (eg, when the destination server or anonymous client is under our control), we can observe these fluctuations as they propagate through the Tor network and the Internet to the end-user’s IP address. Our technique exploits one of the design criteria for Tor (trading off GPA-resistance for improved latency/bandwidth over MIXes) by allowing well-provisioned (in terms of bandwidth) adversaries to effectively become GPAs. Although timing-based attacks have been demonstrated against non-timing-preserving anonymity networks, they have depended either on a global passive adversary or on the compromise of a substantial number of Tor nodes. Our technique does not require compromise of any Tor nodes or collaboration of the endserver (for some scenarios). We demonstrate the effectiveness of our approach in tracking the IP address of Tor users in a series of experiments. Even for an under-provisioned adversary with only few network vantage points, we can identify the end user (IP address)/hidden servers in many cases.", "num_citations": "7\n", "authors": ["336"]}
{"title": "On the infeasibility of Modeling Polymorphic shellcode for Signature Detection\n", "abstract": " Polymorphic malcode remains one of the most troubling threats for information security and intrusion defense systems. The ability for malcode to be automatically transformed into to a semantically equivalent variant frustrates attempts to construct a single, simple, easily verifiable representation. We present a quantitative analysis of the strengths and limitations of shellcode polymorphism and consider the impact of this analysis on the current practices in intrusion detection. Our examination focuses on the nature of shellcode decoding routines, and the empirical evidence we gather illustrates our main result: that the challenge of modeling the class of self-modifying code is likely intractable–even when the size of the instruction sequence (ie, the decoder) is relatively small. We develop metrics to gauge the power of polymorphic engines and use them to provide insight into the strengths and weaknesses of some popular engines. We believe this analysis supplies a novel and useful way to understand the limitations of the current generation of signature-based techniques. We analyze some contemporary polymorphic techniques, explore ways to improve them in order to forecast the nature of future threats, and present our suggestions for countermeasures. Our results indicate that the class of polymorphic behavior is too greatly spread and varied to model effectively. We conclude that modeling normal content is ultimately a more promising defense mechanism than modeling malicious or abnormal content.", "num_citations": "7\n", "authors": ["336"]}
{"title": "Content distribution for seamless transmission\n", "abstract": " We introduce a new paradigm in information transmission, the concept of SEAMLESS TRANSMISSION, whereby any client in a network requesting a file starts receiving it immediately, and experiences no delays throughout the remainder of the downloading time. This notion is based on the partial caching concept [2] which was introduced to overcome some of the disadvantages of traditional cache replacement algorithms such as LRU and LRU-threshold [1]. The main idea of partial caching is to store an initial part of the file in the cache and to obtain the rest of the file from the origin server. To achieve the maximal retrieval performance of seamless transmission, clients must be prepared to re-sequence segments of the files received out of order. With this caveat, seamless transmission can be viewed as a way to implement strict quality of service (QoS) guarantees to all clients of a network. This paper gives a provably correct technique for achieving seamlessness for a given file located at the root node in a tree structured network. The SEAMLESS TRANSMISSION PROBLEM has interdependent, combinatorial allocation and scheduling subproblems. The solution to the allocation problem prescribes the subsets of file segments to be stored in different nodes in the network, and the solution to the deterministic scheduling problem specifies transmission schedules for each node based on the given allocation of file segments. In the systems being modeled, cache capacity is at a premium, so our goal is to find solutions that minimize required cache capacity without sacrificing seamless transmission.", "num_citations": "7\n", "authors": ["336"]}
{"title": "Detecting passive cheats in online games via performance-skillfulness inconsistency\n", "abstract": " As the most commonly used bots in first-person shooter (FPS) online games, aimbots are notoriously difficult to detect because they are completely passive and resemble excellent honest players in many aspects. In this paper, we conduct the first field measurement study to understand the status quo of aimbots and how they play in the wild. For data collection purpose, we devise a novel and generic technique called baittarget to accurately capture existing aimbots from the two most popular FPS games. Our measurement reveals that cheaters who use aimbots cannot play as skillful as excellent honest players in all aspects even though aimbots can help them to achieve very high shooting performance. To characterize the unskillful and blatant nature of cheaters, we identify seven features, of which six are novel, and these features cannot be easily mimicked by aimbots. Leveraging this set of features, we propose an …", "num_citations": "6\n", "authors": ["336"]}
{"title": "Your data in your hands: Privacy-preserving user behavior models for context computation\n", "abstract": " Modern smartphone applications rely on contextual information while providing the users with relevant and timely content and services. One way of generating such contextual information is by employing learning systems to model user behavior. Motion-based sensors, such as the accelerometer or gyroscope, have been previously employed for recognizing predefined high-level physical activities such as climbing stairs, jogging, or driving. In practice, human activities are highly diverse and unsupervised methods must be used to expose complex behavioral characteristics that are user-centric. This paper proposes a novel machine learning model for user authentication and trust that is continuously assessing the user activities in an effort to expose deviations from known training data. The goal is to export this trust score as a contextual input to mobile apps for detection of unauthorized access, fraudulent …", "num_citations": "6\n", "authors": ["336"]}
{"title": "Why software dos is hard to fix: Denying access in embedded android platforms\n", "abstract": " A new class of software Denial of Service (DoS) attacks against Android platforms was recently discovered, where the attacks can force the victim device unresponsive, target and terminate other applications on the device, and continuously soft reboot the device [26]. After Google was informed of these DoS attacks, their attempt to resolve the problem did not adequately address the fundamental underlying attack principles. In this paper, we show that engineering software DoS defenses is challenging, especially for embedded and resource-constrained devices. To support our findings, we detail a revised DoS attack strategy for the latest version of Android. For our experimental evaluation, we demonstrate that the new class of DoS attacks are even more damaging to embedded Android devices. As part of our proof-of-concept attacks, we were able to render the Sony Bravia XBR-43X830C Android TV and the …", "num_citations": "6\n", "authors": ["336"]}
{"title": "On the Move: Evading Distributed Denial-of-Service Attacks\n", "abstract": " A proposed moving-target defense against DDoS attacks repeatedly shuffles client-to-server assignments to identify and eventually quarantine malicious clients.", "num_citations": "6\n", "authors": ["336"]}
{"title": "Improving network response times using social information\n", "abstract": " Social networks and discussion boards have become significant outlets for people to communicate and freely express their opinions. Although the social networks themselves are usually well-provisioned, the participating users frequently point to external links in order to substantiate their discussions. Unfortunately, the heavy traffic load suddenly imposed on these externally linked websites makes them unresponsive, leading to the “flash crowd effect.” Flash crowds present a real challenge as their intensity and occurrence times are impossible to predict. Moreover, most present-day web hosting servers and caching systems, although increasingly capable, are designed to handle a nominal load of requests before they become unresponsive due to limited bandwidth or the processing power allocated to the hosting site. In this paper, we quantify the prevalence of flash crowd events for a popular social …", "num_citations": "6\n", "authors": ["336"]}
{"title": "A Model for Automatically Repairing Execution Integrity\n", "abstract": " Many users value applications that continue execution in the face of attacks. Current software protection techniques typically abort a process after an intrusion attempt (eg, a code injection attack). We explore ways in which the security property of integrity can support availability. We extend the Clark-Wilson Integrity Model to provide primitives and rules for specifying and enforcing repair mechanisms and validation of those repairs. Users or administrators can use this model to write or automatically synthesize repair policy. The policy can help customize an application’s response to attack. We describe two prototype implementations for transparently applying these policies without modifying source code.", "num_citations": "6\n", "authors": ["336"]}
{"title": "Dark application communities\n", "abstract": " In considering new security paradigms, it is often worthwhile to anticipate the direction and nature of future attack paradigms. We identify a class of attacks based on the idea of a\" Dark\" Application Community (DAC)-a collection of bots and zombie machines that actively performs binary-level supervision of applications to help an attacker automate the process of finding vulnerabilities. A collection of such hosts can observe and attempt to influence the behavior of automatic defense systems. An attacker can use the DAC as both a test platform for subverting security applications and as a reconnaissance network for exploiting commonly deployed automatic update and early warning systems.", "num_citations": "6\n", "authors": ["336"]}
{"title": "Function Secret Sharing for PSI-CA: With Applications to Private Contact Tracing\n", "abstract": " In this work we describe a token-based solution to Contact Tracing via Distributed Point Functions (DPF) and, more generally, Function Secret Sharing (FSS). The key idea behind the solution is that FSS natively supports secure keyword search on raw sets of keywords without a need for processing the keyword sets via a data structure for set membership. Furthermore, the FSS functionality enables adding up numerical payloads associated with multiple matches without additional interaction. These features make FSS an attractive tool for lightweight privacy-preserving searching on a database of tokens belonging to infected individuals.", "num_citations": "5\n", "authors": ["336"]}
{"title": "21 Years of Distributed Denial-of Service: Current State of Affairs\n", "abstract": " The Internet's features and capacity have evolved, but is the nature of its security noticeably better? We examine the fundamental nature of distributed denial-of-service (DDoS) and the state of the union of our defenses in today's DDoS wars.", "num_citations": "5\n", "authors": ["336"]}
{"title": "Systems, methods, and media for generating sanitized data, sanitizing anomaly detection models, and/or generating sanitized anomaly detection models\n", "abstract": " Systems, methods, and media for generating sanitized data, sanitizing anomaly detection models, and generating anomaly detection models are provided. In some embodiments, methods for sanitizing anomaly detection models are provided. The methods including: receiving at least one abnormal anomaly detection model from at least one remote location; comparing at least one of the at least one abnormal anomaly detection model to a local normal detection model to produce a common set of features common to both the at least one abnormal anomaly detection model and the local normal detection model; and generating a sanitized normal anomaly detection model by removing the common set of features from the local normal detection model.", "num_citations": "5\n", "authors": ["336"]}
{"title": "Hardware-assisted application integrity monitor\n", "abstract": " Existing hardware-assisted methods monitor the integrity of hyper visors and operating systems, which are critical to system integrity. This protection is possible because of ``non-volatile'' data structures present in the machine's physical memory. In contrast, applications offer a more challenging protection target because they are dynamically allocated. Therefore, robust defenses against application tampering is still a difficult tasks that has remained an open problem. We propose \"AppCheck,\" a hardware-assisted framework the protects the integrity of applications and server processes. We achieve that by leveraging semantic information extracted from the source code and input from a human developer. Unlike pure software defenses, AppCheck employs existing x86 features, namely System Management Mode, to acquire the necessary memory contents. If any of the these critical components become altered during …", "num_citations": "5\n", "authors": ["336"]}
{"title": "Inferring Packet Management Rules\n", "abstract": " Embodiments of the present invention include a system or method for inferring packet management rules of a packet management device. A probing device is used to extract at least one of port number and IP address from a packet management configuration file. The probing device classifies extracted numbers and selectively transmits packets to a packet management device. A packet analyzer notifies the probing device when a packet passes through the packet management device. Based on the notification, the probing device is able to transmit packets to the packet management device in a non-exhaustive manner and determine a port range corresponding to a packet management rule.", "num_citations": "5\n", "authors": ["336"]}
{"title": "A2M: Access-Assured Mobile Desktop Computing\n", "abstract": " Continued improvements in network bandwidth, cost, and ubiquitous access are enabling service providers to host desktop computing environments to address the complexity, cost, and mobility limitations of today’s personal computing infrastructure. However, distributed denial of service attacks can deny use of such services to users. We present A2M, a secure and attack-resilient desktop computing hosting infrastructure. A2M combines a stateless and secure communication protocol, a single-hop Indirection-based network (IBN) and a remote display architecture to provide mobile users with continuous access to their desktop computing sessions. Our architecture protects both the hosting infrastructure and the client’s connections against a wide range of service disruption attacks. Unlike any other DoS protection system, A2M takes advantage of its low-latency remote display mechanisms and asymmetric …", "num_citations": "5\n", "authors": ["336"]}
{"title": "A multi-path approach for k-anonymity in mobile hybrid networks\n", "abstract": " Location based applications in travel, logistics, health care, social networks and other industries already exist and are poised to proliferate. One of the critical issues for a widespread deployment of these applications is how to conciliate their effectiveness and quality with privacy concerns. The PiLBA’08 workshop was intended to bring together scientists from security and data management to discuss the most recent advances in the field. These proceedings include the eight contributions on this topic selected from the submissions by the PC chairs with the help of the members of the program committee, and presented at the workshop. They include an extended abstract of the invited talk, two survey papers, and five research papers covering several complementary aspects of privacy in location based applications and services.The Organizing Committee would like to thank all the people that supported and helped in the organization of this event. A particular acknowledgment to the PC members, to Javier Lopez for his suggestions and support with local organization and to Linda Pareschi for her help with the web site and with the preparation of these proceedings.", "num_citations": "5\n", "authors": ["336"]}
{"title": "Distributed firewall for MANETs\n", "abstract": " Mobile Ad-hoc Networks (MANETs) are increas-ingly used in military tactical situations and in civil rapiddeployment networks, including emergency rescue operations and ad hoc disaster-relief networks. The flexibility of MANETs comes at a price, when compared to wired and basestationbased wireless networks: MANETs are susceptible to both insider (compromised node) and outsider attacks due to the lack of a well-defined perimeter in which to deploy firewalls, intrusion detection systems, and other mechanisms commonly used for network access and admission control. In this paper, we define a distributed firewall architecture that is designed specifically for MANETs. Our approach harnesses and extends the concept of a network capability, and is especially suited for environments where the communicating nodes have different roles and hence different communication requirements, such as in tactical networks. Our model enforces communication restrictions among MANET nodes and services, allowing hopby-hop policy enforcement in a distributed manner. We use a “deny-by-default” model where compromised nodes have access only to authorized services, without the ability to disrupt or interfere with end-to-end service connectivity and nodes beyond their local communication radius. Our simulations show that our solution has minimal overhead in terms of bandwidth and latency, works well even in the presence of routing changes due to mobile nodes, and is effective in containing misbehaving nodes.", "num_citations": "5\n", "authors": ["336"]}
{"title": "Life after self-healing: assessing post-repair program behavior\n", "abstract": " One promising technique for defending software systems against vulnerabilities involves the use of self–healing. Such efforts, however, carry a great deal of risk because they largely bypass the cycle of human–driven patching and testing used to vet both vendor and internally developed patches. In particular, it is difficult to predict if a repair will keep the behavior of the system consistent with “normal” behavior. Assuring that post–repair behavior does not deviate from normal behavior is a major challenge to which no satisfactory solutions exist. We investigate the feasibility of automatically measuring behavioral deviations in software that has undergone a self–healing repair. We provide a first examination of the problem of assessing a repair’s impact on execution behavior, and we define a model for representing post–repair behavior using machine–level intraprocedural control flow. In essence, we advocate performing anomaly detection on an application’s execution after it has been attacked and subsequently repaired. Our goal, however, is not to detect an attack, but rather to provide a tool for assisting a system administrator to perform vulnerability triage. Our system can help them discover the relative impact of a repair so that they can begin to track down and analyze the cause of post–repair execution anomalies.", "num_citations": "5\n", "authors": ["336"]}
{"title": "Post-patch retraining for host-based anomaly detection\n", "abstract": " Applying patches, although a disruptive activity, remains a vital part of software maintenance and defense. When host-based anomaly detection (AD) sensors monitor an application, patching the application requires a corresponding update of the sensor’s behavioral model. Otherwise, the sensor may incorrectly classify new behavior as malicious (a false positive) or assert that old, incorrect behavior is normal (a false negative). Although the problem of “model drift” is an almost universally acknowledged hazard for AD sensors, relatively little work has been done to understand the process of re-training a “live” AD model—especially in response to legal behavioral updates like vendor patches or repairs produced by a self-healing system. We investigate the feasibility of automatically deriving and applying a “model patch” that describes the changes necessary to update a “reasonable” host-based AD behavioral model (ie, a model whose structure follows the core design principles of existing host–based anomaly models). We aim to avoid extensive retraining and regeneration of the entire AD model when only parts may have changed—a task that seems especially undesirable after the exhaustive testing necessary to deploy a patch.", "num_citations": "5\n", "authors": ["336"]}
{"title": "W3bcrypt: Encryption as a stylesheet\n", "abstract": " While web-based communications (e.g., webmail or web chatrooms) are increasingly protected by transport-layer cryptographic mechanisms, such as the SSL/TLS protocol, there are many situations where even the web server (or its operator) cannot be trusted. The end-to-end (E2E) encryption of data becomes increasingly important in these trust models to protect the confidentiality and integrity of the data against snooping and modification.               We introduce W3Bcrypt, an extension to the Mozilla Firefox platform that enables application-level cryptographic protection for web content. In effect, we view cryptographic operations as a type of style to be applied to web content, similar to and along with layout and coloring operations. Among the main benefits of using encryption as a stylesheet are (a) reduced workload on the web server, (b) targeted content publication, and (c) greatly increased privacy. This …", "num_citations": "5\n", "authors": ["336"]}
{"title": "gore: Routing-Assisted Defense Against DDoS Attacks\n", "abstract": " We present gore, a routing-assisted defense architecture against distributed denial of service (DDoS) attacks that provides guaranteed levels of access to a network under attack. Our approach uses routing to redirect all traffic destined to a customer under attack to strategically-located gore proxies, where servers filter out attack traffic and forward authorized traffic toward its intended destination.               Our architecture can be deployed incrementally by individual ISPs, does not require any collaboration between ISPs, and requires no modifications to either server- or client- software. Clients can be authorized through a web interface that screens legitimate users from outsiders or automated zombies. Authenticated clients are granted limited-time access to the network under attack. The gore architecture allows ISPs to offer DDoS defenses as a value-added service, providing necessary incentives for the …", "num_citations": "5\n", "authors": ["336"]}
{"title": "21 Years of Distributed Denial-of-Service: A Call to Action\n", "abstract": " IEEE Senior Member; bmichael@ nps. edu web, email, messaging, streaming and video delivery, and so forth, are typically equipped to handle expected loads and user behavior under “peacetime” conditions. This provisioning often has a monetary component: buying transit traffic capacities, setting up server infrastructure, and staffing operations, among others. It also includes capacity plans for periodic above-average bursts of traffic, slow Transport Layer Security (TLS) handshakes, and other suboptimal but nonthreatening client behaviors. However, DDoS attacks are designed to overcome these capacities. Once an attack is detected, the common response is to apply network-or application-level filters to packets and/or packet flows to inspect and “scrub” attack traffic away from legitimate flows.", "num_citations": "4\n", "authors": ["336"]}
{"title": "Expect more from the networking: Ddos mitigation by fitt in named data networking\n", "abstract": " Distributed Denial of Service (DDoS) attacks have plagued the Internet for decades, but the basic defense approaches have not fundamentally changed. Rather, the size and rate of growth in attacks have actually outpaced carriers' and DDoS mitigation services' growth, calling for new solutions that can be, partially or fully, deployed imminently and exhibit effectiveness. In this paper, we examine the basic functions in Named Data Networking (NDN), a newly proposed Internet architecture, that can address the principle weaknesses in today's IP networks. We demonstrate by a new DDoS mitigation solution over NDN, Fine-grained Interest Traffic Throttling FITT, that NDN's architectural changes, even when incrementally deployed, can make DDoS attacks fundamentally more difficult to launch and less effective. FITT leverages the NDN design to enable the network to detect DDoS from victim's feedback, throttles DDoS traffic by reverse its exact paths through the network, and enforces control over the misbehaving entities at their sources. Our extensive simulation results show that FITT can throttle attack traffic with one-way time delay from the victim to the NDN gateway; upon activation, FITT effectively stop attack traffic from impacting benign flows, resulting in over 99\\% of packets reaching victims being legitimate ones. We further demonstrate that service providers may implement NDN/FITT on existing CDN nodes as an incrementally deployable solution to effectuate the application level remediation at the sources, which remains unattainable in today's DDoS mitigation approaches.", "num_citations": "4\n", "authors": ["336"]}
{"title": "Resilient and scalable cloned app detection using forced execution and compression trees\n", "abstract": " Android markets have grown both in size and diversity, offering apps that are localized or curated for specific use cases. It is not uncommon for users to be unaware of the exact app version or name they should be installing. This has given rise to the threat of app cloning where adversaries copy the package of an app, minimally modify its code, and redistribute the clone on the market to gain a monetary advantage or to distribute malicious payloads. Existing clone detection methods use static signatures that can be evaded using control-and data-flow obfuscation. Moreover, many approaches do not scale with the number of apps, code size, and complexity, leading to prohibitive detection time requirements. In this paper, we introduce Dexsim, a dynamic analysis based system to accurately index apps and identify bytecode similarities. We propose a novel bytecode indexing and matching algorithm that employs …", "num_citations": "4\n", "authors": ["336"]}
{"title": "Moving-target Defense against Botnet Reconnaissance and an Adversarial Coupon-Collection Model\n", "abstract": " We consider a cloud based multiserver system consisting of a set of replica application servers behind a set of proxy (indirection) servers which interact directly with clients over the Internet. We study a proactive moving-target defense to thwart a DDoS attacker's reconnaissance phase and consequently reduce the attack's impact. The defense is effectively a moving-target (motag) technique in which the proxies dynamically change. The system is evaluated using an AWS prototype of HTTP redirection and by numerical evaluations of an “adversarial” coupon-collector mathematical model, the latter allowing larger-scale extrapolations.", "num_citations": "4\n", "authors": ["336"]}
{"title": "Dazed droids: A longitudinal study of android inter-app vulnerabilities\n", "abstract": " Android devices are an integral part of modern life from phone to media boxes to smart home appliances and cameras. With 38.9% of market share, Android is now the most used operating system not just in terms of mobile devices but considering all OSes. As applications' complexity and features increased, Android relied more heavily on code and data sharing among apps for faster response times and richer user experience. To achieve that, Android apps reuse functionality and data by means of inter-app message passing where each app defines the messages it expects to receive. In this paper, we analyze the proliferation of exploitable inter-app communication vulnerabilities using a rich corpus of 1) a representative sample of 32 Android devices, 2) 59 official Google Android versions, and 3) the top 18,583 apps from 2016 to 2017. This corpus covers  Android builds from version 4.4 to present. To the best of our …", "num_citations": "4\n", "authors": ["336"]}
{"title": "Pairing continuous authentication with proactive platform hardening\n", "abstract": " Mobile authentication has always been a usability and security challenge. In the past, researchers have discovered various methods to bypass the screen lock protection mechanism without entering authentication credentials on mobile devices. There is a clear need for authentication to be seamless and continuous but also address the security threats that stem from the current unlock-once, always-on mechanisms. To that end, we developed a framework for continuous behavioral authentication of users. In addition, we introduce a configurable “authentication level” for access to resources and applications. For example, if a user's authentication level declines below a pre-specified threshold, all external communications are disabled to prevent exfiltration of sensitive data. Similarly, viewing or modifying any sensitive data on the device is also restricted by moderating access to the underlying file system based on the …", "num_citations": "4\n", "authors": ["336"]}
{"title": "A moving target and shuffle-decimation quarantine strategy to combat persistent DDoS attacks on a distributed, indirection server system in the cloud\n", "abstract": " Consider a system of clients, indirection/proxy servers and worker/application servers (replicas) controlled either by a central coordination server (eg, via Round-robin DNS) or in distributed fashion by the proxies themselves [2],[3]. The clients reach the proxies via the public commodity Internet. The proxies and replicas could be implemented in VMs (or in containers within VMs) of one or more datacenters. The proxies in turn assign clients to replicas to fulfill their requests. The assignment is nominally via a DHT. The clients never know the IP addresses of the replicas, only the proxies.Threats can target either proxies (eg, a volumetric DDoS attack, preliminary probing) or replicas (protocol attack or a localized DoS attack such as Slowloris, ie, a single attacker can bring down the replica). A key assumption is that a server under attack cannot determine which of its assigned client (s) are responsible. This said, it can be reliably determined whether a server is under attack either through the use of probing “canary” clients that can determine when response times of their mock workloads have grown too high, or by the OS of a VM (or hypervisor of a physical server) managing a number of containers (or VMs) in which proxies or replicas operate. New clients are never added to servers (either proxies or replicas) deemed under attack. Some attacking clients are simple bots that cannot cope with reassignment to a new server. For such bots, continual shuffling of clients to servers is a proactive defense. We focus on other malware that is more resilient and can continue its attack even after it is transferred to another server (or the server just modifies its IP …", "num_citations": "4\n", "authors": ["336"]}
{"title": "Leveraging Blockchain-based protocols in IoT systems\n", "abstract": " • Dynamic but verifiable group membership• Authentication & Data integrity• Secure against single-node (or small sub-set of nodes) key leakage• Lightweight operations in terms of resources• Encryption is a plus but not firm requirement• Capable of handling sensor “sleep/power-off” periods• Handle resource diversity and data of sensors and aggregators", "num_citations": "4\n", "authors": ["336"]}
{"title": "Research in Attacks, Intrusions, and Defenses\n", "abstract": " We are pleased to present to you the proceedings of the 16th International Symposium on Research in Attacks, Intrusions, and Defenses (RAID 2013) held in St. Lucia during October 23–25, 2013. The symposium was attended by leading researchers from academia and industry to discuss their latest research on a wide range of topics in computer security. The research topics in computer security ranged from hardware-level security, server, web, mobile, and cloud-based security, malware analysis, and web and network privacy. An engaging keynote by Herbert (Hugh) Thompson presented the human aspects of security. Of the 95 papers submitted, 22 were selected for presentation at the conference making an acceptance rate of 23%. In addition, we received 23 poster paper submissions out of which 10 were selected for presentation. These posters were also in a wide range of topics describing ongoing research …", "num_citations": "4\n", "authors": ["336"]}
{"title": "Mitigating the effect of free-riders in bittorrent using trusted agents\n", "abstract": " Even though Peer-to-Peer (P2P) systems present a cost-effective and scalable solution to content distribution, most entertainment, media and software, content providers continue to rely on expensive, centralized solutions such as Content Delivery Networks. One of the main reasons is that the current P2P systems cannot guarantee reasonable performance as they depend on the willingness of users to contribute bandwidth. Moreover, even systems like BitTorrent, which employ a tit-for-tat protocol to encourage fair bandwidth exchange between users, are prone to free-riding (ie peers that do not upload). Our experiments on PlanetLab extend previous research [14, 12, 11] demonstrating that such selfish behavior can seriously degrade the performance of regular users in many more scenarios beyond simple free-riding: we observed an overhead of upto 430% for 80% of free-riding identities easily generated by a small set of selfish users. To mitigate the effects of selfish users, we propose a new P2P architecture that classifies peers with the help of a small number of trusted nodes that we call Trusted Auditors (TAs). TAs participate in P2P download like regular clients and detect free-riding identities by observing their neighbors’ behavior. Using TAs, we can separate compliant users into a separate service pool resulting in better performance. Furthermore, we show that TAs are more effective ensuring the performance of the system than a mere increase in bandwidth capacity: for 80% of freeriding identities a single-TA system has a 6% download time overhead while without the TA and three times the bandwidth capacity we measure a 100% overhead.", "num_citations": "4\n", "authors": ["336"]}
{"title": "Exploiting the Structure in DHT Overlays for DoS Protection\n", "abstract": " Peer to Peer (P2P) systems that utilize Distributed Hash Tables (DHTs) provide a scalable means to distribute the handling of lookups. However, this scalability comes at the expense of increased vulnerability to specific types of attacks. In this paper, we focus on insider denial of service (DoS) attacks on such systems. In these attacks, nodes that are part of the DHT system are compromised and used to flood other nodes in the DHT with excessive request traffic. We devise a distributed lightweight protocol that detects such attacks, implemented solely within nodes that participate in the DHT. Our approach exploits inherent structural invariants of DHTs to ferret out attacking nodes whose request patterns deviate from “normal” behavior. We evaluate our protocol’s ability to detect attackers via simulation within a Chord network. The results show that our system can detect a simple attacker whose attack traffic deviates by as little as 5% from a normal request traffic. We also demonstrate the resiliency of our protocol to coordinated attacks by up to as many as 25% of nodes. Our work shows that DHTs can protect themselves from insider flooding attacks, eliminating an important roadblock to their deployment and use in untrusted environments.", "num_citations": "4\n", "authors": ["336"]}
{"title": "Malware detection in critical infrastructures using the electromagnetic emissions of plcs\n", "abstract": " ANS / Publications / Transactions / Volume 121 / Number 1 / Pages 519-522 American Nuclear Society Log In /Create an Account Join ANS |Member Center |ANS Store |Contact Us About ANS Membership Meetings Publications Standards Public Information Communities Honors & Awards Nuclear Careers Advertising Home Home / Publications / Transactions / Volume 121 / Number 1 Malware Detection in Critical Infrastructures Using the Electromagnetic Emissions of PLCs Constantinos Kolias, RA Borrelli (Univ. Idaho), Daniel Barbara, Angelos Stavrou (George Mason) Transactions / Volume 121 / Number 1 / November 2019 / Pages 519-522 Subscribers: pdf View Article ANS Nuclear Cafe ANS on Facebook ANS on LinkedIn ANS on Twitter ANS on Instagram ANS on Pinterest Home|Contact Us|Invoice Payment|Nuclear Links Privacy Policy|Terms of Use …", "num_citations": "3\n", "authors": ["336"]}
{"title": "On early detection of application-level resource exhaustion and starvation\n", "abstract": " Software systems are often engineered and tested for functionality under normal rather than worst-case conditions. This makes the systems vulnerable to denial-of-service attacks, where attackers engineer conditions that result in overconsumption of resources or starvation and stalling of execution. While the security community is well familiar with volumetric resource exhaustion attacks at the network and transport layers, application-specific attacks pose a challenging threat. In this paper, we present Radmin, a novel system for early detection of application-level resource exhaustion and starvation attacks. Radmin works directly on compiled binaries. It learns and executes multiple probabilistic finite automata from benign runs of target programs. Radmin confines the resource usage of target programs to the learned automata and detects resource usage anomalies at their early stages. We demonstrate the …", "num_citations": "3\n", "authors": ["336"]}
{"title": "Numerical Evaluation of Cloud-Side Shuffling Defenses against DDoS Attacks on Proxied Multiserver Systems\n", "abstract": " We consider a cloud based multiserver system, that may be cloud based, consisting of a set of replica application servers behind a set of proxy (indirection) servers which interact directly with clients over the Internet. We address cloud-side proactive and reactive defenses to combat DDoS attacks that may target this system. DDoS attacks are endemic with some notable attacks occurring just this past fall. Volumetric attacks may target proxies while \"low volume\" attacks may target replicas. After reviewing existing and proposed defenses, such as changing proxy IP addresses (a \"moving target\" technique to combat the reconnaissance phase of the botnet) and fission of overloaded servers, we focus on evaluation of defenses based on shuffling client-to-server assignments that can be both proactive and reactive to a DDoS attack. Our evaluations are based on a binomial distribution model that well agrees with simulations and preliminary experiments on a prototype that is also described.", "num_citations": "3\n", "authors": ["336"]}
{"title": "Improving traditional android mdms with non-traditional means\n", "abstract": " Enterprise Mobile Device Management (MDM) solutions have become widely adopted as large organizations strive to secure their data and exert more control over the mobile devices that access it. In our efforts to provide a more fine-grained control over the mobile device functions, we have discovered additional system-wide capabilities for all levels of Android MDM applications. In addition, we have developed mechanisms that can prevent the installation of undesired applications and block the removal of necessary applications. To achieve that, we employ two development permissions via the Android Debug Bridge (adb) which allows a remote operator to modify the settings database that controls certain capabilities and resources on the device. The proposed approach significantly increases the level of control of an MDM by enabling whitelisting and blacklisting of applications and functionality.", "num_citations": "3\n", "authors": ["336"]}
{"title": "Analysis of content copyright infringement in mobile application markets\n", "abstract": " As mobile devices increasingly become bigger in terms of display and reliable in delivering paid entertainment and video content, we also see a rise in the presence of mobile applications that attempt to profit by streaming pirated content to unsuspected end-users. These applications are both paid and free and in the case of free applications, the source of funding appears to be advertisements that are displayed while the content is streamed to the device. In this paper, we assess the extent of content copyright infringement for mobile markets that span multiple platforms (iOS, Android, and Windows Mobile) and cover both official and unofficial mobile markets located across the world. Using a set of search keywords that point to titles of paid streaming content, we discovered 8,592 Android, 5,550 iOS, and 3,910 Windows mobile applications that matched our search criteria. Out of those applications, hundreds had …", "num_citations": "3\n", "authors": ["336"]}
{"title": "Discerning machine learning degradation via ensemble classifier mutual agreement analysis\n", "abstract": " Machine learning classifiers are a crucial component of modern malware and intrusion detection systems. However, past studies have shown that classifier-based detection systems are susceptible to evasion attacks in practice. Improving the evasion resistance of learning based systems is an open problem. In this paper, we analyze the effects of mimicry attacks on real-world classifiers. To counter such attacks, we introduce a novel approach that not only exposes attempts to evade the classifier, but also evaluates the ability of the system to operate reliably. We advance mutual agreement analysis for ensemble classifiers: during the detection operation, when a sufficient number of votes from individual classifiers disagree, the ensemble classifier prediction is shown to be unreliable. This method allows the detection of classifier evasion without additional external information. To evaluate our approach, we used thousands of both malicious and benign PDF documents. Applying our method to two recent evasion attack studies, we show that most evasion scenarios are detected. Furthermore, we show that our approach can be generalized to weaken the effectiveness of the Gradient Descent and Kernel Density Estimation attacks against Support Vector Machines (SVM) by creating an ensemble classifier using many base SVMs. We discovered that feature bagging is the most important property for enabling mutual agreement based evasion detection.", "num_citations": "3\n", "authors": ["336"]}
{"title": "Qop and qos policy cognizant module composition\n", "abstract": " Component-based software engineering is generally recognized as one of the best methods to develop, deploy, and manage increasingly complex software systems. To enable the dynamic composition of software modules, it is often required to expose their functionality dependencies. This results the a well-known requires-provides specifications' model. In this paper, we introduce a framework that enables individual software components to specify their requires-provides interfaces in a policy dependent way. Our framework specifies policies as combinations of Constraint Logic Programming (CLP) based rules. Moreover, our policies are flexible and expressive, allowing the enforcement of multiple aspects for the requested composition including security and quality of service. We apply our framework to specify Quality of Protection (QoP) and Quality of Service (QoS) policies. We demonstrate the applicability of our …", "num_citations": "3\n", "authors": ["336"]}
{"title": "Return Value Predictability Profiles for Self–Healing\n", "abstract": " Current embryonic attempts at software self–healing produce mechanisms that are often oblivious to the semantics of the code they supervise. We believe that, in order to help inform runtime repair strategies, such systems require a more detailed analysis of dynamic application behavior. We describe how to profile an application by analyzing all function calls (including library and system) made by a process. We create predictability profiles of the return values of those function calls. Self–healing mechanisms that rely on a transactional approach to repair (that is, rolling back execution to a known safe point in control flow or slicing off the current function sequence) can benefit from these return value predictability profiles. Profiles built for the applications we tested can predict behavior with 97% accuracy given a context window of 15 functions. We also present a survey of the distribution of actual return values …", "num_citations": "3\n", "authors": ["336"]}
{"title": "Methods and systems for increased debugging transparency\n", "abstract": " Embodiments herein disclose a debugging framework that employs a mode in the processor (for example, a processor using x86 architecture), to transparently study armored malware. Embodiments herein perform stealthy debugging by leveraging System Management Mode (SMM) to transparently debug software on bare-metal.", "num_citations": "2\n", "authors": ["336"]}
{"title": "Changing proxy-server identities as a proactive moving-target defense against reconnaissance for DDoS attacks\n", "abstract": " We consider a cloud based multiserver system consisting of a set of replica application servers behind a set of proxy (indirection) servers which interact directly with clients over the Internet. We study a proactive moving-target defense to thwart an attacker’s reconnaissance phase and consequently decreases the success rate of the planned attack. The moving-target defense is a dynamic identity-changing technique for the indirection servers.", "num_citations": "2\n", "authors": ["336"]}
{"title": "FROST: Anti-Forensics Digital-Dead-DROp Information Hiding RobuST to Detection & Data Loss with Fault tolerance\n", "abstract": " Covert operations involving clandestine dealings and communication through cryptic and hidden messages have existed since time immemorial. While these do have a negative connotation, they have had their fair share of use in situations and applications beneficial to society in general. A\" Dead Drop\" is one such method of espionage trade craft used to physically exchange items or information between two individuals using a secret rendezvous point. With a\" Dead Drop\", to maintain operational security, the exchange itself is asynchronous. Information hiding in the slack space is one modern technique that has been used extensively. Slack space is the unused space within the last block allocated to a stored file. However, hiding in slack space operates under significant constraints with little resilience and fault tolerance.", "num_citations": "2\n", "authors": ["336"]}
{"title": "transAD: An Anomaly Detection Network Intrusion Sensor for the Web\n", "abstract": " Content-based Anomaly Detection (AD) techniques are regarded as a promising mechanism to detect ‘zero-day’ attacks. AD sensors have also been shown to perform better than signature-based systems in detecting polymorphic attacks. However, the False Positive Rates (FPRs) produced by current AD sensors have been a cause of concern. In this paper, we introduce and evaluate transAD, a system of network traffic inspection AD sensors that are based on Transductive Confidence Machines (TCM). Existing TCM-based implementations have very high FPRs when used as NIDS.               Our approach leverages an unsupervised machine-learning algorithm to identify anomalous packets and thus, unlike most AD sensors, transAD does not require manually labeled data. Moreover, transAD uses an ensemble of TCM sensors to achieve better detection rates and lower FPRs than single sensor …", "num_citations": "2\n", "authors": ["336"]}
{"title": "Android sensor data anonymization\n", "abstract": " Method. In this paper, we propose a mechanism to anonymize sensor data through modification of the Android framework. Our approach is a two stage process where in the first stage the Android framework is modified to anonymize the sensor data. There are several API classes such as SensorManager, Sensor, SensorEvent, and SensorEventListener can be considered to be modified. However, we are initially starting by modifying the SystemSensorManager. java API. With this modification, a mechanism is created inside the OS to switch between anonymized and raw sensor data. Then in the second stage, the decision of supplying anonymized data to an application is considered. For demonstration purposes, we develop an external application which can request from the OS about what type of data it should receive. A system", "num_citations": "2\n", "authors": ["336"]}
{"title": "Programming on Android: Best Practices for Security and Reliability\n", "abstract": " Summary form only given. This tutorial will cover both basic and advanced Android Dalvik programming concepts and how they can be implemented efficiently and securely within the Android permission model. In addition, we will present examples of Android code that is not well designed both in terms of security and power consumption and the potential implications of such code in the reliability of an Android device. We will conclude by presenting what are currently considered the best coding practices. Our goal is to assist both experience and novice mobile developers steer away from security and reliability pitfalls in their code while delivering efficient and robust applications.", "num_citations": "2\n", "authors": ["336"]}
{"title": "Security of computer use practice: The case of ordinary users survey\n", "abstract": " While numerous surveys in regards to computer security are conducted by organizations in order to study the behavior of their employees and users, the most influential in determining the security of a general computer environment group of ordinary users is still lacking in attention. This paper presents the survey results of more than 3,000 computer users who participated in a survey conducted in 2010-2011 by Prof. Reznik’s students at RIT. They researched the practice of home computer users including: the passwords used, patching regularity, firewalls, and anti-virus software application. The samples of results are analyzed and presented here. These results may be utilized for improving overall computer security as well as for the education of users.", "num_citations": "2\n", "authors": ["336"]}
{"title": "Scalable Web Object Inspection and Malfease Collection.\n", "abstract": " Internet drive-by downloads attacks are the preferred vehicle to infect desktop computers. In this paper, we propose a new URL analysis framework that combines lightweight virtualization and novel modifications to the WINE engine to detect heap spray attacks against applications. In addition, we are able to extract the attack shellcode used to further download other malicious binaries to the victim machine. Our preliminary results indicate that our system offers a compelling alternative to other process monitoring and virtualization technologies including QEMU and VMware since it can scale to thousands of instances per machine.", "num_citations": "2\n", "authors": ["336"]}
{"title": "Security policy cognizant module composition\n", "abstract": " Component-based software development and deployment is based on developing individual software modules that are composed on an as needed basis. Such modules expose the computations they provide and their dependencies on providing these computations-that results in a well known requires-provides specifications for modules. This paper provides a framework to combine modules that specify their requires-provides interfaces in a policy dependent way. Our framework specify policies as combinations of Constraint Logic Programming (CLP) based rules and our policies can cover multiple aspects associated of compositions, such as security and quality of service. We apply our framework to specify Quality of Protection (QoP) and Quality of Service (QoP) policies. An example shows the applicability of our policy language to a teleconferencing application with multiple security and resource usage policies.", "num_citations": "2\n", "authors": ["336"]}
{"title": "A security architecture for information assurance and availability in MANETs\n", "abstract": " Currently, End-to-End protection architectures, including pervasive ones such as the Internet Protocol suite, as well as others, typically focus on protecting the network availability ignoring the end-system host. Unfortunately, this leads to attacks against the availability and information assurance of the overall system including host-based denial of service attacks and data ex-filtration. In MANETs, such attacks become even more debilitating because each node has a dual role acting both as a source and as a router. To address such attacks, we extend the protection beyond the network encompassing the host end-system platform. By isolating each application running on the end hosts, we extend our ability to scalably and effectively enforce policies beyond network communications to memory, file I/O, and inter-application communications. However, the functions are not merely those of a separation kernel, as …", "num_citations": "2\n", "authors": ["336"]}
{"title": "The hidden difficulties of watching and rebuilding networks\n", "abstract": " The subtleties of network protection can bedevil even experienced IT staff and security researchers. In this installment of secure systems, we focus on two areas of network defense that are particularly troublesome to manage: network intrusion recovery and ubiquitous network monitoring.", "num_citations": "2\n", "authors": ["336"]}
{"title": "Countering DDoS Attacks with Multi-Path Overlay Networks\n", "abstract": " Distributed Denial of Service (DDoS) has emerged as a major threat to the operation of online network services [1, 2, 3]. Current forms of DDoS attacks implicate multiple groups of Internet machines that have been taken over and controlled by an attacker. These machines, called bots, are manipulated by the attacker to produce an excessive surge of traffic toward a target server, the victim. The target server is forced to processing and/or to link-capacity starvation, since malicious traffic is blended with normal traffic, making it difficult to weed out. Figure 1 depicts a DDoS attack and its impact on the target server. Unfortunately, DDoS attacks can only become worse: Despite network and processing speeds that increase with every passing day, real-world botnet sizes and attack capabilities increase at the same rate. Furthermore, attackers devise sophisticated software to infect and subsequently control thousands of infected machines while remaining stealthy.[4] Addressing the network (DDoS) problem is extremely hard, given the fundamentally open nature of the Internet and the apparent reluctance of router vendors and network operators to deploy and operate new, potentially complex mechanisms.[5] Overlay-based approaches such as Secure Overlay Services (SOS)[6], funded by the Defense Advanced Research Projects Agency (DARPA) and the National Science Foundation (NSF Grant ITR CNS-04-26623); I3 [7]; and MayDay (Distributed Filtering for Internet Services)[8] offer an attractive alternative, as they do not require changes to the existing routing infrastructure. Furthermore, such systems require minimal or no collaboration from Internet …", "num_citations": "2\n", "authors": ["336"]}
{"title": "Distributed Ledger Technologies\n", "abstract": " The articles in this special section focus on distributed ledger technologies (DLT). DLT, of which blockchain is a popular example, are increasingly becoming a popular means to maintain transactional integrity and achieve consensus among competing parties in many modern distributed data exchanges. Indeed, a Gartner survey estimates that by 2020, DLT and blockchain will support the global movement and tracking of $2 trillion of goods and services annually. Unlike centralized files and databases, distributed ledgers rely on peering nodes to record, share, and synchronize transactions and data in their individually maintained local ledgers. In the case of blockchain, information is organized into blocks that are securely and transparently chained together. These blocks become immutable global knowledge among all peers using consensus algorithms to achieve data synchronization. The “append-only, globally …", "num_citations": "1\n", "authors": ["336"]}
{"title": "Microservices made attack-resilient using unsupervised service fissioning\n", "abstract": " Application-layer DoS attacks are increasing as the number of cloud-deployed microservice applications is increasing. The attacker tries to exhaust computing resources and brings the nominal applications down by exploiting application-layer vulnerabilities. As traditional solutions for volumetric DoS attacks will not be able to handle these attacks, new approaches are required to detect and respond to application-layer attacks. In this work, we propose an unsupervised, non-intrusive and application-agnostic detection approach and fissioning based response mechanism. We built our prototype on Kubernetes, the state of the art container orchestrator for microservices, and show its effectiveness through experimental evaluation. Our preliminary results show that using our detection and defense mechanism, we are able to a) efficiently identify the attacks and b) reduce the effect of the attack on legitimate users by 3× …", "num_citations": "1\n", "authors": ["336"]}
{"title": "Understanding the Security Implication of Aborting Live Migration\n", "abstract": " Live migration of Virtual machines (VMs) has become a regular tool for edge and cloud operators to facilitate system maintenance, fault tolerance, and load balancing, with little impact on running instances. However, the potential security risks of live migration of VMs are still obscure. In this paper, we expose a new vulnerability in the existing VM live migration approaches, especially the post-copy approach. The entire live migration mechanism relies upon reliable TCP connectivity for the transfer of the VM state. We demonstrate that, if the host server is vulnerable to off-path TCP attacks, the loss of TCP reliability leads to VM live migration failure. We demonstrate that, by intentionally aborting the TCP connection, attackers can cause unrecoverable memory inconsistency for post-copy, leading to a significant increase in downtime and performance degradation of the running VM. Additionally, we present detailed …", "num_citations": "1\n", "authors": ["336"]}
{"title": "An adversarial coupon-collector model of asynchronous moving-target defense against botnet reconnaissance*\n", "abstract": " We consider a moving-target defense of a proxied multiserver tenant of the cloud where the proxies dynamically change to defeat reconnaissance activity by a botnet planning a DDoS attack targeting the tenant. Unlike the system of [4] where all proxies change simultaneously at a fixed rate, we consider a more “responsive” system where the proxies may change more rapidly and selectively based on the current session request intensity, which is expected to be abnormally large during active reconnaissance. In this paper, we study a tractable “adversarial” coupon-collector model wherein proxies change after a random period of time from the latest request, i.e., asynchronously. In addition to determining the stationary mean number of proxies discovered by the attacker, we study the age of a proxy (coupon type) when it has been identified (requested) by the botnet. This gives us the rate at which proxies change (cost …", "num_citations": "1\n", "authors": ["336"]}
{"title": "CCSW'17: 2017 ACM Cloud Computing Security\n", "abstract": " The use and prevalence of cloud and large-scale computing infrastructures is increasing. They are projected to be a dominant trend in computing for the foreseeable future: major cloud operators are now estimated to house millions of machines each and to host substantial (and growing) fractions of corporate and government IT and web infrastructure. CCSW is a forum for bringing together researchers and practitioners to discuss the challenges and implications of current and future trends to the security of cloud operators, tenants, and the larger Internet community. Of special interest are the security challenges from the integration of cloud infrastructures with IoT and mobile application deployments. CCSW welcomes submissions on new threats, countermeasures, and opportunities brought about by the move to cloud computing, with a preference for unconventional approaches, as well as measurement studies and …", "num_citations": "1\n", "authors": ["336"]}
{"title": "Factory Resets and Obtaining Notifications on Samsung Android Devices\n", "abstract": " We have identified software vulnerabilities present in two different system apps in multiple Samsung Android releases. The two vulnerabilities expose systemic problems with the inadequacy of testing for pre-loaded vendor applications. The vulnerable system apps are persistent and cannot be disabled or uninstalled by the user unless the user has root privileges on the device. The first vulnerability can be manipulated to programmatically initiate a factory reset of certain devices from a zero-permission Android app. During a factory reset, the user would most likely lose application data, photos, videos, text messages, and anything else that is not synced or backed up to a separate device. The attack is tested to be successful for certain Android 5.0. 2 and 5.1. 1 releases for the following Samsung Galaxy devices: S6, S6 Edge, S6 Edge+, and Note 5. The vulnerability is introduced by a system app declaring an …", "num_citations": "1\n", "authors": ["336"]}
{"title": "Research in Attacks, Intrusions and Defenses: 17th International Symposium, RAID 2014, Gothenburg, Sweden, September 17-19, 2014, Proceedings\n", "abstract": " This book constitutes the proceedings of the 17th International Symposium on Research in Attacks, Intrusions and Defenses, RAID 2014, held in Gothenburg, Sweden, in September 2014. The 22 full papers were carefully reviewed and selected from 113 submissions, and are presented together with 10 poster abstracts. The papers address all current topics in computer security, including network security, authentication, malware, intrusion detection, browser security, web application security, wireless security, vulnerability analysis.", "num_citations": "1\n", "authors": ["336"]}
{"title": "Document Content Layout Based Exploit Protections\n", "abstract": " Malware laden documents are a common exploit vector, especially in targeted attacks. Most current approaches seek to detect the malicious attributes of documents whether through signature matching, dynamic analysis, or machine learning. We take a different approach: we perform transformations on documents that render exploits inoperable while maintaining the visual interpretation of the document intact. Our exploit mitigation techniques are similar in effect to address space layout randomization, but we implement them through permutations to the document layout. Using document content layout randomization, we randomize the data block layout of Microsoft OLE files in a manner similar to the inverse of a file system defragmention tool. This relocates malicious payloads in both the original document file and in the memory of the reader program. We demonstrate that our approach indeed subdues in the wild exploits by manual validation of both Office 2003 and Office 2007 malicious documents while the transformed documents continue to render benign content properly. The document transformation can be performed offline and requires only a single document scan while the user-perceived delay when opening the transformed document is negligible. We also show that it is possible to thwart malicious heap sprays by injecting benign content in documents. This approach, however, comes at an expense of computational and memory resources.", "num_citations": "1\n", "authors": ["336"]}
{"title": "Switchwall: automated topology fingerprinting and behavior deviation identification\n", "abstract": " The continuous improvement of bandwidth, pervasiveness, and functionality of network switching technologies is deeply changing the Internet landscape. Indeed, it has become tedious and sometimes infeasible to manually assure the network integrity on a regular basis: existing hardware and software can be tampered with and new devices can be connected or become nonoperational without any notification. Moreover, changes in the network topology can be introduced by human error, by hardware or software failures, or even by a malicious adversary (e.g. rogue systems).               In this paper, we introduce Switchwall, an Ethernet-based network fingerprinting technique that detects unauthorized changes to the L2/L3 network topology, the active devices, and the availability of an Enterprise network. The network map is generated at an initial known state and is then periodically verified to detect …", "num_citations": "1\n", "authors": ["336"]}
{"title": "Decryptable to Your Eyes: Visualization of Security Protocols at the User Interface\n", "abstract": " The design of authentication protocols, for online banking services in particular and any service that is of sensitive nature in general, is quite challenging. Indeed, enforcing security guarantees has overhead thus imposing additional computation and design considerations that do not always meet usability and user requirements. On the other hand, relaxing assumptions and rigorous security design to improve the user experience can lead to security breaches that can harm the users' trust in the system. In this paper, we demonstrate how careful visualization design can enhance not only the security but also the usability of the authentication process. To that end, we propose a family of visualized authentication protocols, a visualized transaction verification, and a \"decryptable to your eyes only\" protocol. Through rigorous analysis, we verify that our protocols are immune to many of the challenging authentication attacks applicable in the literature. Furthermore, using an extensive case study on a prototype of our protocols, we highlight the potential of our approach for real-world deployment: we were able to achieve a high level of usability while satisfying stringent security requirements.", "num_citations": "1\n", "authors": ["336"]}
{"title": "Specifying Time-Out Points in Surgical EMRs–Work in Progress\n", "abstract": " Workflows for surgical procedures have built-in time-out points to minimize occurrences of unintended faults and omissions during surgeries. They have been recommended in the best practices of appropriate surgical sub-specialties, as well as the Joint Commission. At these timeout points, designated team members perform recommended precautionary measures, such as verifying the accuracy of implants, to ensure unintended mistakes are not made before proceeding to the next stage. These precautionary measures are usually recorded in paper-based checklists and retained for a stipulated period of time. We show how these timeout points can be specified as formal workflow requirements in surgical Electronic Medical Records (S-EMRs).", "num_citations": "1\n", "authors": ["336"]}
{"title": "Moving forward, building an ethics community (panel statements)\n", "abstract": " The organizing question around which this panel at WECSR 2011 rallied was how to move toward building a nation-state-agnostic ethics community in computer security research.", "num_citations": "1\n", "authors": ["336"]}
{"title": "NetGator: Malware Detection Through Program Interactive Proofs\n", "abstract": " Exfiltration of data using internet-borne attacks has become a credible threat for organization and enterprises. History has shown that crafted targeted attacks and zero-day malware are capable of penetrating even the most sophisticated defenses. To make matters worse, intrusion detection systems that perform analysis of network traffic are dependent on the timely information provided by blacklisting, signature schemes, or anomaly patterns. This is especially true for heavily used communication protocols where blocking decisions affect the everyday operations of the organization. Even when the intrusion is detected in a timely manner, valuable data might have already been stolen.In this paper, we propose a new approach to distinguish legitimate browser software from malware that generates identical network traffic signatures. Our system consists of two parts: a signature-based passive detection module, and a module that issues Program Interactive Challenges (PICs) to client applications. Initially, we perform passive detection utilizing content inspection techniques that analyze network header element order. Of course this is not enough: we demonstrate that passive detection can be easily subverted. To amend that, we introduce an interactive detection module in the form of inline network proxy that challenges the detected browser forcing it to exercise known specific internal functionality. For browsers, we can leverage HTML, Flash, Javascript and other common browser components to form challenges that malware will not be able to respond to due to lack of functionality. Contrary to interractive challenges, our challenges are transparent to …", "num_citations": "1\n", "authors": ["336"]}
{"title": "Small World VoIP\n", "abstract": " We present the analysis and design of a Small World VoIP system (SW-VoIP) which is geared towards customers that are communicating with their Small World of social contacts. We use the term Small World to refer to the Peer-to-Peer (P2P) network of a client and his contacts both incoming and outbound. We reconstruct the small world of a user by collecting calling patterns over a configurable period of time. We enable user mobility by using a stepwise social identity to an IP address binding propagation model. We propose an efficient algorithm to locate users by electing popular users and leveraging the users closeness. We also introduce a self-stabilized load balancing mechanism to optimize the system performance under heavy network traffic. We evaluate our SW-VoIP system performance by simulating the user’s lookup process using real-world telephone logs. Our experimental results show that our …", "num_citations": "1\n", "authors": ["336"]}
{"title": "Pushback for overlay networks: protecting against malicious insiders\n", "abstract": " Peer-to-Peer (P2P) overlay networks are a flexible way of creating decentralized services. Although resilient to external Denial of Service attacks, overlay networks can be rendered inoperable by simple flooding attacks generated from insider nodes.             In this paper, we study detection and containment mechanisms against insider Denial of Service (DoS) attacks for overlay networks. To counter such attacks, we introduce novel mechanisms for protecting overlay networks that exhibit well defined properties due to their structure against non-conforming (abnormal) behavior of participating nodes. We use a lightweight distributed detection mechanism that exploits inherent structural invariants of DHTs to ferret out anomalous flow behavior.             We evaluate our mechanism’s ability to detect attackers using our prototype implementation on web traces from IRCache served by a DHT network. Our results show …", "num_citations": "1\n", "authors": ["336"]}