{"title": "A novel weighting method for online ensemble learning with the presence of concept drift\n", "abstract": " Ensemble of classifiers is a very popular method for online and incremental learning in non-stationary environment, as it improves the accuracy of single classifiers and is able to recover from drifting concept without explicit drift detection. However, current ensemble weighing methods do not consider the relationship between a test instance and each ensemble member's training domain. As a result, a locally correct ensemble member may be reduced weight unfairly because that its prediction result of an out of domain test instance is wrong. These inaccuracies will increases when there is a significant concept change. In this paper, therefore, we proposed a fuzzy online ensemble weighting method which takes the consideration of the degree of membership of each instance in each ensemble member and a modified majority voting method to improve the ability of ensemble on handling online classification tasks with …", "num_citations": "3\n", "authors": ["1085"]}
{"title": "Concept drift adaptation for learning with streaming data\n", "abstract": " The term concept drift refers to the change of distribution underlying the data. It is an inherent property of evolving data streams. Concept drift detection and adaptation has been considered an important component of learning under evolving data streams and has attracted increasing attention in recent years. According to the existing literature, the most commonly used definition of concept drift is constrained to discrete feature space. The categorization of concept drift is complicated and has limited contribution to solving concept drift problems. As a result, there is a gap to uniformly describe concept drift for both discrete and continuous feature space, and to be a guideline to addressing the root causes of concept drift. The objective of existing concept drift handling methods mainly focuses on identifying when is the best time to intercept training samples from data streams to construct the cleanest concept. Most only consider concept drift as a time-related distribution change, and are disinterested in the spatial information related to the drift. As a result, if a drift detection or adaptation method does not have spatial information regarding the drift regions, it can only update learning models or their training dataset in terms of time-related information, which may result in an incomplete model update or unnecessary training data reduction. In particular, if a false alarm is raised, updating the entire training set is costly and may degrade the overall performance of the learners. For the same reason, any regional drifts, before becoming globally significant, will not trigger the adaptation process and will result in a delay in the drift detection process. These …", "num_citations": "1\n", "authors": ["1085"]}