{"title": "Usability evaluation of domain-specific languages\n", "abstract": " Domain-Specific Languages (DSLs) are claimed to bring important productivity improvements to developers, when compared to General-Purpose Languages (GPLs). The increased Usability is regarded as one of the key benefits of DSLs when compared to GPLs, and has an important impact on the achieved productivity of the DSL users. So, it is essential to build in good usability while developing the DSL. The purpose of this proposal is to contribute to the systematic activity of Software Language Engineering by focusing on the issue of the Usability evaluation of DSLs. Usability evaluation is often skipped, relaxed, or at least omitted from papers reporting development of DSLs. We argue that a systematic approach based on User Interface experimental validation techniques should be used to assess the impact of new DSLs. For that purpose, we propose to merge common Usability evaluation processes with the …", "num_citations": "47\n", "authors": ["1299"]}
{"title": "The RPG DSL: a case study of language engineering using MDD for Generating RPG Games for Mobile Phones\n", "abstract": " It is typical in the domain of digital games to have many development problems due to its increasing complexity. Those difficulties include: i) little code reuse in order to develop a cross-platform game; and ii) performing game's verification through extensive and expensive tests. This of course results in low productivity in the development (evolution and maintenance) of game solutions.", "num_citations": "22\n", "authors": ["1299"]}
{"title": "Patterns for Evaluating Usability of Domain-Specific Languages\n", "abstract": " For years the development of software artifacts was the sole domain of developers and project managers. However, experience has taught us that the users play a very important role in software development and construction. The inclusion of the Domain Experts directly in the development cycle is a very important characteristic of Domain-Specific Languages, as they have often an important role in making and constraining the domain of the language. DSLs are credited with increased productivity and ease of use, but this fact is hardly ever proven. Moreover, Usability tests are frequently only performed at the final stages of the project when changes have a significant impact on the budget. To help prevent this, in this paper we present a pattern language for evaluating the usability of DSLs. These patterns can help show how to use an iterative usability validation development strategy to produce DSLs that can achieve a high degree of Usability.", "num_citations": "16\n", "authors": ["1299"]}
{"title": "Introducing usability concerns early in the DSL development cycle: FlowSL experience report\n", "abstract": " Domain-Specific Languages (DSLs) developers aim to narrow the gap between the level of abstraction used by domain users and the one provided by the DSL, in order to help taming the increased complexity of computer systems and real-world problems. The quality in use of a DSL is essential for its successful adoption. We illustrate how a usability evaluation process can be weaved into the development process of a concrete DSL-FlowSL-used for specifying humanitarian campaign processes lead by an international Non-Governmental Organization. FlowSL is being developed following an agile process using Model-Driven Development (MDD) tools, to cope with vague and poorly understood requirements in the beginning of the development process.", "num_citations": "13\n", "authors": ["1299"]}
{"title": "STSM Report: Evaluating the efficiency in use of search-based automated model merge technique\n", "abstract": " The FP7 project MONDO, developed at Budapest University of Technology and Economics, aims to tackle the challenge of scalability in MDE in a comprehensive manner by developing the theoretical foundations and an open-source implementation of a platform for scalable modeling and model management. This technique uses rule-based design space exploration to search the space of solution candidates that represent conflict-free merged models. The approach allows engineers to easily incorporate domain-specific knowledge into the merge process to provide better solutions. We systematically evaluate the efficiency of the technique from the user point of view using a reactive experimental software engineering approach. In particular, we asked users to merge the different versions of same model. These empirical tests include the involvement of the intended end users (ie engineers), which are expected to confirm the impact of design decisions. The experiment participants were observed while performing the tasks of different complexity. Evaluation took place at a the Budapest University of Technology and Economics.Achieving scalability in modelling and MDE involves being able to construct large models and domain-specific languages in a systematic manner, enabling teams of modellers to construct and refine large models in a collaborative manner, advancing the state-of-the-art in model querying and transformations tools so that they can cope with large models (of the scale of millions of model elements), and providing an infrastructure for efficient storage, indexing and retrieval of large models.", "num_citations": "3\n", "authors": ["1299"]}
{"title": "Evaluating the Quality in Use of Domain-Specific Languages in an Agile Way\n", "abstract": " To deal with the increasing complexity of the software systems to be developed, it is important to have high level approaches to development that support such complexity at affordable costs. This fosters the development of Domain-Specific Languages (DSLs) that are claimed to bring important productivity improvements to software developers. Because of that, the quality of the users interaction with this kind of technology is becoming of utmost importance. The goal of this research is to contribute to the systematic activity of software language engineering by focusing on the issue of quality in use evaluation of DSLs, in which design decisions are validated iteratively.", "num_citations": "3\n", "authors": ["1299"]}
{"title": "Iterative Evaluation of Domain-Specific Languages\n", "abstract": " As software moves to the daily routines and responsibilities of people, there is a need for developing tools and languages rapidly. Domain-Specific Languages (DSLs) are claimed to contribute to this productivity increase, while reducing the required maintenance and programming expertise. DSLs are designed to bridge the gap between the problem domain (essential concepts, domain knowledge, techniques, and paradigms) and the solution domain (technical space, middleware, platforms and programming languages). The sooner we fill in this gap, the sooner we shall increase users productivity. However intuitive this idea may be, we need to have means to assert the quality and success of the developed languages. The alternative is to accept the risk of deriving inappropriate products that bring more harm by decreasing productivity or even increasing maintenance costs.", "num_citations": "3\n", "authors": ["1299"]}
{"title": "Literature classification data for a systematic mapping study on multi-paradigm modeling for cyber-physical systems\n", "abstract": " This dataset includes the set of papers retrieved to perform a systematic mapping study (SMS) on multi-paradigm modeling (MPM) for cyber-physical systems (CPS). Moreover, it includes several tables that map the literature into several perspectives, notably: used modeling formalisms and processes, part of the CPS addressed by the research, domain of expertise of paper authors, and relevance of the papers at review date. The set of papers is selected over a period ranging from 2006 to 2021, according to publication dates. The selection of the papers and their mapping has been performed by means of a rigorous process based on precise research questions and peer-review. Furthermore, the process has been supported by a web-based survey management application. Both the selection of existing publications and their mappings by means of the included perspectives provide interested readers/researchers with interesting data potentially re-usable for multiple purposes, notably: analyzing the progress of research on modeling of CPS, studying further the papers pertaining to a specific (set of) characteristic(s), performing a follow-up study related to other development technologies.", "num_citations": "2\n", "authors": ["1299"]}
{"title": "STSM Report: Systematic literature review on multi-paradigm modeling for CPS Systems\n", "abstract": " Short Term Scientific Mission (STSM), was carried out in period of 14 till 30 of April 2018 at Faculty of Organisational sciences (FON), together with prof. Dusan Savic, in the context of the MPM4CPS COST Action IC1404. This report contributes to WG4, by defineing in extensively and in a systematic fashion the current state of the art on the topic of MPM4CPS. In order to provide a balanced and objective summary of research evidence, a systematic literature review process is considered as an appropriate method to carry out such a review in software engineering.A. Technique Systematic Literature Review (SLR) is a research method to obtain, evaluate, and interpret information related to a research question. A SLR provides an objective reliable, rigorous, and methodological manner to conduct some study. In this report a SLR of sustainability in modelling of Cyber-Physical Systems (CPS) is conducted. This research aim requires accumulating a body of knowledge for various reasons: justifying the basis for future research, learning as much as possible from other domains related to the topic, and providing a basis for other researchers as well as students who consider learning about and contributing to this area.", "num_citations": "2\n", "authors": ["1299"]}
{"title": "Sustainability in Modelling of Cyber-Physical Systems: A Systematic Literature Review-Intermediate Technical Report\n", "abstract": " Background: Supporting sustainability is becoming an active area of research. We want to contribute the first Systematic Literature Review (SLR) in this field over the Cyber-Physical Systems (CPS) to aid researchers who are motivated to contribute to that topic by providing a body of knowledge as starting point. Aim: We aim to provide an overview of different approaches of sustainability which can be incorporated into modeling of CPS with regard to research activity, investigated topics, identified limitations, proposed approaches, used methods, available studies, and considered domains.Method: The applied method is a SLR in four reliable and commonly-used databases according to the protocol by Kitchenham et al.[4]. We assessed the results of each database in period of 2011 to 2017.Results: We identify the 680 candidates which are to be reviewed.", "num_citations": "2\n", "authors": ["1299"]}
{"title": "Multi-paradigm modeling for cyber–physical systems: A systematic mapping review\n", "abstract": " Cyber–Physical Systems (CPS) are heterogeneous and require cross-domain expertise to model. The complexity of these systems leads to questions about prevalent modeling approaches, their ability to integrate heterogeneous models, and their relevance to the application domains and stakeholders. The methodology for Multi-Paradigm Modeling (MPM) of CPS is not yet fully established and standardized, and researchers apply existing methods for modeling of complex systems and introducing their own. No systematic review has been previously performed to create an overview of the field on the methods used for MPM of CPS. In this paper, we present a systematic mapping study that determines the models, formalisms, and development processes used over the last decade. Additionally, to determine the knowledge necessary for developing CPS, our review studied the background of actors involved in …", "num_citations": "1\n", "authors": ["1299"]}
{"title": "Enhancing Occupants Comfort and Well-being through a Smart Office setup\n", "abstract": " A smart office, a particular case of Building Automation, represents a physical environment enriched with sensing, actuation, communication and computation capabilities aiming at acquiring and exploiting knowledge about the environment and its inhabitants. A fundamental goal of smart offices is to ensure a comfortable working environment as well as adapting to the circumstances related to optimizing specific variables which indicate the safety and energy efficiency of the office, as well as the health and productivity of its occupants.In this position paper, we illustrate a representative system by exploring emerging technologies, which presents a unique set of challenges and opportunities to research a new generation of software control systems, by supporting non-intrusive interfaces, that put the occupant’s at the center of the system’s concerns, by focusing on comfort and well-being while still leveraging the …", "num_citations": "1\n", "authors": ["1299"]}
{"title": "Framework support for usability evaluation of domain-specific languages\n", "abstract": " In this paper we propose a conceptual framework that supports the iterative development process of DSLs concerning the issue of their Usability evaluation. A multiple-case studies were conducted in order validate the proposed method.", "num_citations": "1\n", "authors": ["1299"]}