{"title": "Social capital: the benefit of Facebook ‘friends’\n", "abstract": " This research investigated the role Facebook use plays in the creation or maintenance of social capital among university students in South Africa. Data were collected using questionnaires completed by over 800 students from 7 universities. The questionnaire was obtained from a study conducted in Michigan State University (Ellison N.B., Steinfield, C., and Lampe, C., 2007. The benefits of Facebook “Friends”: social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication, 12(4), 1143–1168.). Empirical research has linked social capital to many positives in society, such as improved mental and physical health, economic well-being, etc. Thus, social capital is important for the success of civil society. This research examined the relationships between Facebook use and the formation and maintenance of social capital amongst university students. The study also …", "num_citations": "301\n", "authors": ["2232"]}
{"title": "Can mobile internet help alleviate social exclusion in developing countries?\n", "abstract": " Research has shown that traditional Internet has not been successful in alleviating social exclusion in developing country. Since a significant number of the population in developing countries use mobile phones, others have suggested that mobile internet may be the solution to the problem. However, to date there has not been empirical studies in developing countries to explore that possibility. This study aims therefore to explore whether the mobile internet may be a viable option for addressing social exclusion in a developing country context. Data for the study was gathered using semi‐structured interviews with socially excluded individuals and the data was analysed using thematic analysis. The findings of the study show that usage of mobile internet amongst the socially excluded is low mainly because internet‐capable cell phones are still beyond the reach of the socially excluded and because of limited …", "num_citations": "184\n", "authors": ["2232"]}
{"title": "A flipped classroom approach to teaching systems analysis, design and implementation\n", "abstract": " This paper describes a flipped classroom approach followed to teach systems analysis, design and implementation at university level. The techniques employed are described. These techniques were underpinned by a theory of coherent practice: a pedagogy that provides a framework for the design of highly structured interventions to guide students in their learning experiences. The paper also describes the students’ perceived benefits and limitations of the approach. Overall, the flipped classroom approach had a positive impact on students’ attitude to learning, level of understanding, ability to apply concepts and engagement. Limitations were mostly in line with a reluctance to take charge of their own learning (for some of them) and inability to engage in group discussions. A set of recommendations are proposed to address these gaps in line with what has been prescribed in literature.", "num_citations": "79\n", "authors": ["2232"]}
{"title": "Exploring SME cybersecurity practices in developing countries\n", "abstract": " The continued use of information technology systems by small and medium enterprises (SMEs) in developing countries has the potential to bring significant benefits but, at the same time, expose them to online cybersecurity threats. Addressing these threats is, therefore, of paramount importance for developing countries, not only because SMEs are seen as the vehicle for employment and job creation, but because research on SMEs and cybersecurity in this context is limited. This study is a contribution toward addressing this gap.The purpose of this study is, therefore, to explore SME cybersecurity practices and the challenges they face in developing countries. The goal is to sensitize practitioners and government institutions about the challenges and practices faced by SMEs, so that the various parties can work collaboratively in providing context-specific solutions to address these challenges and improve current …", "num_citations": "45\n", "authors": ["2232"]}
{"title": "A systematic literature review of agile and maturity model research\n", "abstract": " Background/Aim/Purpose A commonly implemented software process improvement framework is the capability maturity model integrated (CMMI). Existing literature indicates higher levels of CMMI maturity could result in a loss of agility due to its organizational focus. To maintain agility, research has focussed attention on agile maturity models. The objective of this paper is to find the common research themes and conclusions in agile maturity model research.", "num_citations": "39\n", "authors": ["2232"]}
{"title": "Factors leading to the success and failure of agile projects implemented in traditionally waterfall environments\n", "abstract": " This qualitative study was undertaken to investigate the factors that result in agile project success and failure. The study particularly focused on software projects where agile methods were newly adopted, implying a transition from the Waterfall to a more light-weight and iterative approach. The study was exploratory and deductive in nature, and employed multiple-case studies as research strategy. The target population was Project Management Offices (PMO) that had moved, or attempted to move, from a traditionally waterfall approach, to an agile software development approach. Primary data was collected using semi-structured, observations of meetings and team engagements. Secondary data collected included project documentation, meeting minutes, and formal project communication. This research was aimed at making practitioners and academic researchers aware of the factors that may lead to project failure as well as project success, thereby encouraging them to find and devise coping and mitigating mechanisms to enhance successful agile adoption, use and implementation. The following constructs were identified as success and failure factors in agile project delivery: Culture, Customer Involvement & Mandate, Stakeholder Involvement & Buy-In, Team Structure & Team Logistics, Project Type & Project Planning, and Skill Level & Attitude of Team Members.", "num_citations": "34\n", "authors": ["2232"]}
{"title": "Investigating the characteristics needed by scrum team members to successfully transfer tacit knowledge during agile software projects\n", "abstract": " The purpose of this study is to propose a theoretical model describing what makes Scrum team members successful at transferring knowledge. Twelve semi‑structured interviews were conducted at two Scrum companies in Cape Town, South Africa. Participants interviewed ranged from project managers and Scrum masters to software developers, business analyst and testers. The interviews were all transcribed, then analysed using thematic analysis. Past studies have already identified factors (ie characteristics that enable people to transfer knowledge) that are known to impact knowledge transfer. This study further extends the body of knowledge by revealing how these existing factors are interrelated while impacting knowledge transfer. In addition, new factors (ie empathy and articulation skills of the source) are proposed, which were found to further impact knowledge transfer in Scrum teams. The results have shown that recipients perceive team members who are able to successfully transfer knowledge as having the following characteristics: motivation, capability, credibility, empathy, articulate and ability to communicate enough. The contribution of this study to practice is a list of team member characteristics, that HR managers could foster through appropriate training, to help improve the knowledge transfer within Scrum teams. This paper offers new contributions and a theoretical model to the under researched area of knowledge transfer within Scrum teams.", "num_citations": "33\n", "authors": ["2232"]}
{"title": "Software quality assurance in Scrum: The need for concrete guidance on SQA strategies in meeting user expectations\n", "abstract": " The purpose of this study is to identify and present the concerns of project stakeholders in relation to Software Quality Assurance (SQA) in a Scrum environment. Guided by the tenets of Classic Grounded Theory Methodology, this exploratory and inductive case study uncovers SQA concepts related to the main concern of Meeting User Expectations. In trying to resolve the main concern, the Scrum project stakeholders alluded to lack of “Concrete Guidance” on SQA strategies, tools, and techniques in Scrum, The lack of concrete guidance in Scrum requires a development team to devise Innovations which may include Adopting Practices from other methodologies and carefully designing the Process Structure to accommodate the Adopted Practices, ensure Continuous Improvement of the process, and provide an environment for Collaborative Ownership. By demonstrating the incompleteness of Agile methods with …", "num_citations": "26\n", "authors": ["2232"]}
{"title": "Exploring the factors influencing the adoption of Open Source Software in Western Cape schools\n", "abstract": " Open Source Software (OSS) presents many benefits to both the private and public sectors, and has proven to be a viable solution in schools. Although a policy mandating the use of OSS exists in the Western Cape province of South Africa, very few schools in the province have adopted OSS. The education system in South Africa is currently facing a crisis because of its inability to provide quality education, and its lack of funds. The Western Cape recently signed a Microsoft Schools Agreement. This study aimed at gaining insights into the factors influencing or inhibiting OSS adoption within the Western Cape Schools Environment. In-depth interviews were conducted with senior staff in the Department of the Premier, Department of Education, as well as users at school level. The Technology-Organisation-Environment (TOE) framework was employed to organise the data, while thematic analysis was used to uncover …", "num_citations": "25\n", "authors": ["2232"]}
{"title": "Sources of interruptions experienced during a scrum sprint\n", "abstract": " Scrum, a form of agile project management methodology, comes with many benefits derived from the iterative form of software development. Various organisations within South Africa have implemented Scrum within their development teams and are fast receiving positive benefits from it. While Scrum, in many aspects of the methodology, is highly effective and successful within different organisations, there are always going to be pitfalls and negative attributes associated with the adoption and use of a new methodology. The purpose of this research is to determine the factors leading to interruptions in the middle of a sprint while using Scrum. Case studies were conducted which included 3 companies in Johannesburg and Cape Town that have implemented Scrum. In particular, data was collected through the following methods: 12 face‑to‑face, one‑on‑one interviews with participating Scrum team members; and 1 group discussion with 8 participating Scrum team members. After analysis, five theoretical statements were formulated pertaining to: poorly understood and defined objectives from clients, managements lack of understanding of Scrum processes, high workload, ad‑hoc requests mid‑sprint, and low interdepartmental communication. Results from this study reveal the need to conduct possible future research on: ways to prevent these forms of sprint interruption from having negative effects on the Scrum team and the project; and the effect that these interruptions have on the relevant stakeholders involved. The results of the study thus provide managers with the opportunity to take a deeper look into the sources of their Scrum problems and …", "num_citations": "21\n", "authors": ["2232"]}
{"title": "Communication and Culture in Global Software Development: The Case of Mauritius and South Africa.\n", "abstract": " Global Software Development (GSD) is a growing sector in Mauritius and South Africa. With an increasing number of information technology (IT) investors, both countries are being recognised as IT hubs in the Southern African region; hence the need for further research on GSD in those two countries. Furthermore, due to a highly diverse cultural setting prevailing in Mauritius and South Africa, common GSD practices derived from other studies might not be fully successful when applied in these contexts. It is thus useful to explore how alternative GSD practices have been put in place to handle these cultural disparities and the resulting communication requirements. The study has been undertaken in an attempt to enlighten investors on the communication and cultural practices that could be followed while partaking in GSD in Mauritius and South Africa.", "num_citations": "21\n", "authors": ["2232"]}
{"title": "Understanding the structured processes followed by organisations prior to engaging in agile processes: A South African Perspective\n", "abstract": " There appears to be a lack of knowledge on the phases South African (SA) organisations go through while adopting agile methods. As a means to address this gap, this study uncovered empirical       evidence on the phases SA organisations go through whilst adopting agile methods as well as the disparities between agile prescriptions and the way SA organisations actually implement agile       methods. The data collected using a case study approach was analysed through the lens of Actor-Network Theory (ANT). The results reveal that there is no structured process for adopting agile       methods and organisations go through various phases in their attempts to adopt agile methods. During the various phases, organisations face challenges which are culture as well as people       related. Through this study South African practitioners could now be aware that before adopting an agile methodology, there has to …", "num_citations": "20\n", "authors": ["2232"]}
{"title": "The influence of telecentre components on the psychological empowerment of underserved community members in the Western Cape, South Africa\n", "abstract": " ICTs and ICT4Ds are powerful socio‐economic enablers within developing countries and provide members of “underserved” communities within these countries with tools for self‐empowerment and circumvention of inequalities. Telecentres provide public access to ICTs to meet the educational, social, psychological and economic needs of a community. However, few studies have focused on the influence that telecentres have on the psychological empowerment of members of “underserved” communities in which they are situated. This study addresses this gap by investigating the perceived influence of telecentre components on the psychological empowerment of “underserved” community members in Cape Town, South Africa. This study is interpretive and has been executed through the use of a qualitative case study. Deductive in nature, the research was guided by a conceptual model depicting constructs …", "num_citations": "19\n", "authors": ["2232"]}
{"title": "The impact of collocation on the effectiveness of agile is development teams\n", "abstract": " This article looks at the impact of collocation on the effectiveness of information system development teams. The research objective was to investigate which features of the collocation environment have the greatest influence on team effectiveness and how these can assist in a better design for a collocation working environment. The empirical foundation for this research was a number of agile software development teams. The two key factors which were found to impact team effectiveness were the impact of noise and interruptions, the use of war room layouts and the need for break-away areas.", "num_citations": "17\n", "authors": ["2232"]}
{"title": "Cloud Computing as an Enabler of Agile Global Software Development.\n", "abstract": " Agile global software development (AGSD) is an increasingly prevalent software development strategy, as organizations hope to realize the benefits of accessing a larger resource pool of skilled labor, at a potentially reduced cost, while at the same time delivering value incrementally and iteratively. However, the distributed nature of AGSD creates geographic, temporal, socio-cultural distances that challenge collaboration between project stakeholders. The Cloud Computing (CC) service models of Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS) are similar to the aspirant qualities of AGSD as they provide services that are globally accessible, efficient, and stable, with lower predictable operating costs that scale to meet the computational demand. This study focused on the 12 agile principles upon which all agile methodologies are based, therein potentially increasing the potential for the findings to be generalized. Domestication Theory was used to assist in understanding how cloud technologies were appropriated in support of AGSD. The research strategy took the form of case study research. The findings suggest that some of the challenges in applying the agile principles in AGSD may be overcome by using CC.", "num_citations": "16\n", "authors": ["2232"]}
{"title": "The influence of higher education institutions on the sustainability of ICT4D initiatives in underserved communities\n", "abstract": " ICTs should be used to narrow the digital divide that exists between advantaged and underserved communities. Given South Africa (SA)'s socio‐economic legacy, higher education institutions(HEI) were tasked by Government to make social responsiveness a key principle of their mandate. This study identified factors hindering and promoting sustainability in ICT4D initiatives and analysed how HEIs influence the sustainability of such initiatives. A case study was conducted in a telecentre from an underserved community in Cape Town(SA). Through its findings, the study can promote the positive influence of HEIs on the sustainability of ICT4D initiatives and further increase the positive impact of these initiatives on the community.", "num_citations": "14\n", "authors": ["2232"]}
{"title": "Sources of disturbances experienced during a Scrum sprint\n", "abstract": " Scrum, as a form of agile project management methodology, comes with many benefits derived from the iterative form of development processes. Various organisations within South Africa have implemented Scrum within their development teams and are fast receiving the positive benefits from it. While Scrum, in many aspects of the methodology, is highly effective and successful within different organisations, there are always going to be pitfalls and negative attributes associated with adapting a new methodology. The purpose of this research is to determine the different sources of disturbances in the middle of a sprint while using Scrum. Case studies were conducted which included 3 companies in Johannesburg and Cape Town that have implemented Scrum: 12 face to face, one‐on‐one interviews with participating Scrum team members; 1 group discussion with 8 participating Scrum team members; and 8 questionnaires After analysis, 6 primary themes emerged as the leading sources of disturbance in the middle of a sprint: the Client, Management, External Influences, Processes, Communication, and Experience. This study opens up various doors of possible research including research on possible ways to prevent the sources from having negative effects on the Scrum team and the project; the effect that these disturbances have on the relevant stakeholders involved; and ways in which these sources could be incorporated into the Scrum processes in order to decrease the negative impact. The results of the study thus provide managers with the opportunity to take a deeper look into the sources of their Scrum problems and provide them with an …", "num_citations": "12\n", "authors": ["2232"]}
{"title": "How South African SMEs address cyber security: The case of web server logs and intrusion detection\n", "abstract": " Small and Medium Enterprises are recently engaging in the adoption and use of IT systems to not only participate in the global economy but to also become efficient in their service provision. Unfortunately the downfall has been the increasing threats that accompany IT system use, specifically cyber security concerns. Although these concerns have been documented, cyber security remains a mystery, and this is more so for developing countries which tend to be sidelined from the main stream in the cyber security research domain. This study is a contribution towards filling this gap; as it strives to examine the cyber security phenomenon from the perspective of South African SMEs. The purpose is to investigate the factors that influence SMEs cyber security implementations. Following a qualitative approach and interviews as a means of data collection; the findings show that organization readiness determined the type …", "num_citations": "11\n", "authors": ["2232"]}
{"title": "THE USE OF KANBAN TO ALLEVIATE COLLABORATION AND COMMUNICATION CHALLENGES OF GLOBAL SOFTWARE DEVELOPMENT.\n", "abstract": " Aim/Purpose This paper aims to describe how various Kanban elements can help alleviate two prominent types of challenges, communication and collaboration in Global Software Development (GSD).Background Iterative and Lean development methodologies like Kanban have gained significance in the software development industry, both in the co-located and globally distributed contexts. However, little is known on how such methodologies can help mitigate various challenges in that occur in a globally distributed software development context.", "num_citations": "10\n", "authors": ["2232"]}
{"title": "ITIL adoption in South African: A capability maturity view\n", "abstract": " The purpose of this study was to understand the practice of IT Service Management through the lens of the Capability Maturity Model in South Africa. Specifically, the objective was to assess capability maturity level of Information Technology Infrastructure Library (ITIL) processes of incident, problem, change, release, and information security in the organization; and the capability level of each key process area of Process, Procedures and Activities; Management Commitment; People, Roles and Tools; Metrics, KPI’s and Reports; and Audits, TQM and Checks. The results indicate that change management received a higher capability maturity rating than the other processes, especially release and problem management. For each ITIL process, Management commitment and their involvement was regarded as the critical key process area. Further results indicate that knowledge creation and development of the people in each process was important so as to avoid vendor dependency.", "num_citations": "10\n", "authors": ["2232"]}