{"title": "Biodegradable polymer blends based on corn starch and thermoplastic chitosan processed by extrusion\n", "abstract": " Blends of thermoplastic cornstarch (TPS) and chitosan (TPC) were obtained by melt extrusion. The effect of TPC incorporation in TPS matrix and polymer interaction on morphology and thermal and mechanical properties were investigated. Possible interactions between the starch molecules and thermoplastic chitosan were assessed by XRD and FTIR techniques. Scanning Electron Microscopy (SEM) analyses showed a homogeneous fracture surface without the presence of starch granules or chitosan aggregates. Although the incorporation of thermoplastic chitosan caused a decrease in both tensile strength and stiffness, films with better extensibility and thermal stability were produced.", "num_citations": "249\n", "authors": ["184"]}
{"title": "Characterization and comparative evaluation of thermal, structural, chemical, mechanical and morphological properties of six pineapple leaf fiber varieties for use in composites\n", "abstract": " Natural fibers are candidates to replace conventional mechanical reinforcements in composites. Six cultivars of fibers of different pineapples varieties were characterized by tensile tests, thermogravimetry, X-ray diffraction, scanning electron microscopy and infrared spectroscopy. The elastic modulus and tensile strength values were in the range of 15–53 GPa and from 210 to 695 MPa, respectively. The final volatile loss temperatures for the six varieties were in the range between 175 and 195 °C and the onset temperatures in the range of 240–260 °C. The high degree of cellulose crystallinity index influenced the mechanical properties, hence suitable for composite reinforcement. This study aims to add information value to the literature regarding pineapple leaf fibers and its characteristics for technical and engineering applications. It was demonstrated that within the pineapple family, there are intrinsic variabilities …", "num_citations": "149\n", "authors": ["184"]}
{"title": "Mechanisms involved in the antinociception caused by agmatine in mice\n", "abstract": " The present study examined the antinociceptive effects of agmatine in chemical behavioural models of pain. Agmatine (1–30 mg/kg), given by i.p. route, 30 min earlier, produced dose-dependent inhibition of acetic acid-induced visceral pain, with mean ID50 value of 5.6 mg/kg. Given orally, 60 min earlier, agmatine (10–300 mg/kg) also produced dose-related inhibition of the visceral pain caused by acetic acid, with mean ID50 value of 147.3 mg/kg. Agmatine (3–100 mg/kg, i.p.) also caused significant and dose-dependent inhibition of capsaicin- and glutamate-induced pain, with mean ID50 values of 43.7 and 19.5 mg/kg, respectively. Moreover, agmatine (1–100 mg/kg, i.p.) caused marked inhibition of both phases of formalin-induced pain, with mean ID50 values for the neurogenic and the inflammatory phases of 13.7 and 5.6 mg/kg, respectively. The antinociception caused by agmatine in the acetic acid test was …", "num_citations": "148\n", "authors": ["184"]}
{"title": "Avaliação de métodos de determinação de água disponível e manejo da irrigação em terra roxa sob cultivo de algodoeiro herbáceo\n", "abstract": " Desenvolveu-se o presente trabalho em casa de vegetação do DSER/CCA/UFPB, município de Areia, PB, objetivando-se a avaliação de dois métodos de determinação da faixa de água disponível no solo (AD), sendo um direto (MD) e outro de laboratório (ML) e o efeito da utilização de três níveis de AD, a 10, 25 e 40%, como indicativo para o manejo da irrigação na cultura do algodoeiro herbáceo (Gossypium hirsutum L. r. latifolium Hutch). O delineamento experimental adotado foi o de blocos ao acaso, com distribuição em esquema fatorial 2 x 3, com três repetições. Conforme a análise de variância, a faixa de água disponível no solo, para a cultura do algodoeiro, encontrada através da utilização do MD, supera significativamente (p < 0,01) a obtida pelo ML. O manejo das irrigações do algodoeiro com base em 40% da AD, determinado pelo MD, proporciona os maiores resultados de evapotranspiração, de área foliar e acumulação de fitomassa na parte aérea da cultura. Observou-se, ainda, interação métodos x níveis de AD, para todas as variáveis estudadas.", "num_citations": "133\n", "authors": ["184"]}
{"title": "Antispasmodic effects of an alkaloid extracted from Phyllanthus sellowianus: a comparative study with papaverine.\n", "abstract": " Infusions of Phyllanthus sellowianus or P. niruri (Euphorbiaceae) are a popular remedy in Brazil for kidney and bladder stones. This study describes the isolation of an alkaloid from P. sellowianus, denoted ALK-1, and compares its antipasmodic activity with that of papaverine on isolated strips of guinea pig ileum and rat uterus, and rat aorta rings. ALK-1 and papaverine promoted a dose-dependent flattening of the dose-response curves obtained to acetylcholine and histamine on ileum strips and of the dose-response curves to acetylcholine and oxytocin on uterine strips. A non-competitive antagonism of noradrenaline-induced contractions by the P. sellowianus alkaloid was also demonstrated on aortic rings. Whereas the antispasmodic potency (pD'2 values) of papaverine did not depend on the muscle preparation and agonist used, ALK-1 exhibited a greater potency on the ileum strips than on the uterine or aortic preparations. Because of this selective antispasmodic action on the ileum, ALK-1 was equipotent to papaverine on this tissue, but was about 10-fold less potent than papaverine on uterine smooth-muscle. The dose-response curves to CaCl2 obtained for potassium-depolarized uterine strips were shifted to the right by both antispasmodics. Similar pA2 values with slopes not differing from unity-1.0 were obtained from Schild plots of the data, suggesting that competitive antagonism of calcium entry into the cell is a mechanism of action common to both alkaloids. The presence of at least one potent antispasmodic alkaloid in P. sellowianus justifies the popular use of infusions of this plant. Smooth muscle relaxation within the urinary or …", "num_citations": "110\n", "authors": ["184"]}
{"title": "Pituitary apoplexy: clinical course, endocrine evaluations and treatment analysis\n", "abstract": " Background. The purpose was to analyze clinical manifestations, hormonal changes, diagnosis difficulties and treatment of pituitary apoplexy (PA). Experimental design. A retrospective study of clinical records from patients with pituitary adenomas admitted from January 1980 to June 1996; the purpose was to identify the patients with clinical evidence compatible with PA. Setting. Neurosurgery unit of an institutional hospital. Patients. Sixteen (12.8%) of 125 patients with pituitary adenomas were analyzed because they had pituitary apoplexy. Interventions. Surgical treatment by the trans-sphenoidal or transcranial route or both routes; dexamethasone (DXM) treatment with 16 mg/day iv Measures. Hormone assays were performed either by radioimmunoassay or by chemical luminescence.Results. Tumors were nonfunctioning in nine patients and functioning in seven. TSH and prolactin basal serum levels were …", "num_citations": "106\n", "authors": ["184"]}
{"title": "Comparison of pretreatment methods for total lipids extraction from mixed microalgae\n", "abstract": " Cell disruption can increase the extraction efficiency of total lipids from microalgae for further conversion to biodiesel. Four different pretreatment methods were tested on mixed cultures of microalgae harvested in a stabilization pond system treating sewage: ultrasonication (US), microwaving (MW), autoclave (AC) and electroflotation by alternating current (EFAC). The best results in terms of total lipid yield were: MW (33.7 ± 5.3%), followed by EFAC (24.8 ± 7.1%), AC (15.4 ± 2.3%), and US (13.3 ± 3.0%). However, when both efficiency and costs are considered, EFAC gave the best result and can be an excellent option for simultaneous microalgae harvesting and cell disruption.", "num_citations": "94\n", "authors": ["184"]}
{"title": "Comparative study of 12 pineapple leaf fiber varieties for use as mechanical reinforcement in polymer composites\n", "abstract": " Vegetable fiber reinforced polymer composites have enormous potential to replace materials originated from non-renewable resources. For an adequate use of vegetable fibers as reinforcements, however, the relationships between technological properties and chemical, structural and morphological characteristics of the fibers must be fully understood. In this work, fibers from 12 different varieties of pineapple (Ananas genus) were characterized on their morphology, structure, chemical composition, mechanical and thermal properties. The elastic modulus ranged from 37 to 86 GPa, the tensile strength from 629 to 1309 MPa, and the onset oxidation temperature from 240 to 272 °C; indicating the potential of using all selected pineapple fibers as reinforcing fillers (depending on the polymer matrix and processing method). Direct correlations were observed between the thermo-mechanical properties of the fibers and …", "num_citations": "85\n", "authors": ["184"]}
{"title": "Neurological manifestations in human T-cell lymphotropic virus type 1 (HTLV-1)–infected individuals without HTLV-1–associated myelopathy/tropical spastic paraparesis: a …\n", "abstract": " Background.            Human T-cell lymphotropic virus type 1 (HTLV-1) is the agent of HTLV-1–associated myelopathy/tropical spastic paraparesis (HAM/TSP), observed in up to 5% of infected individuals. Despite low prevalence, many HTLV-1–infected patients who do not fulfill criteria for HAM/TSP present with neurological complaints related to sensory, motor, urinary, or autonomic manifestations. The aim of this study was to determine the incidence of neurologic manifestations and risk factors associated with these outcomes.                                 Methods.            The incidence of HAM/TSP and new signs and neurologic symptoms were computed in a group of patients enrolled in a cohort study.                                 Results.            Of 414 subjects, 76 had definite HAM/TSP, 87 had possible or probable HAM/TSP, and 251 subjects had no neurologic manifestation and were selected for analysis. Definite …", "num_citations": "74\n", "authors": ["184"]}
{"title": "Binary adsorption of silver and copper on Verde-lodo bentonite: Kinetic and equilibrium study\n", "abstract": " Removal and recovery of toxic metals from wastewater by adsorption is an efficient alternative, especially when using uncommon adsorbents. In the present work, silver and copper binary adsorption onto Verde-lodo bentonite was evaluated in static systems. Kinetic studies under different initial metal concentrations and molar fractions were performed. Kinetic models were adjusted to experimental data, and the External mass transfer resistance model (EMTR) presented the best fitting. The binary kinetic assays revealed that copper presents higher adsorption capacity than silver. Higher total concentrations presented an influence on the adsorption process due to increasing competition for active sites. Equilibrium studies were carried out and the results confirmed the preferential copper adsorption in binary solution with silver. Copper ions were better adsorbed at higher temperatures and silver ions at lower …", "num_citations": "72\n", "authors": ["184"]}
{"title": "Cu (II) adsorption on modified bentonitic clays: different isotherm behaviors in static and dynamic systems\n", "abstract": " ALMEIDA NETO, Ambrósio Florêncio de; VIEIRA, Melissa Gurgel Adeodato and SILVA, Meuris Gurgel Carlos da. Cu (II) adsorption on modified bentonitic clays: different isotherm behaviors in static and dynamic systems. Mat. Res.[online]. 2012, vol. 15, n. 1, pp. 114-124. Epub Nov 29, 2011. ISSN 1516-1439. http://dx. doi. org/10.1590/S1516-14392011005000089.", "num_citations": "71\n", "authors": ["184"]}
{"title": "Effect of replacement of corn starch by whey protein isolate in biodegradable film blends obtained by extrusion\n", "abstract": " The aim of this study was to evaluate the effect of replacing corn starch by whey protein isolated (WPI) in biodegradable polymer blends developed by extrusion. X-ray diffraction showed the presence of a Vh-type crystalline arrangement. The films were homogeneous, indicating strong interfacial adhesion between the protein and the thermoplastic starch matrix (TPS) as observed in scanning electron microscopy. The addition of WPI on TPS matrix promoted an increase in the thermal stability of the materials. It was observed 58.5% decrease in the water vapor permeability. The effect of corn starch substitution by WPI on mechanical properties resulted in a more resistant and less flexible film when compared the TPS film. The addition of WPI caused greenish yellow color and less transparent films. The substitution of corn starch by WPI made it possible to obtain polymer blends with improved properties and represents …", "num_citations": "61\n", "authors": ["184"]}
{"title": "The production of hemicellulases by aerobic fungi on medium containing residues of banana plant as substrate\n", "abstract": " Trichoderma harzianum strains T4 and T6, Acrophialophora nainiana, and Humicola grisea var. thermoidea were screened for their ability to produce carbohydrate‐degrading enzyme activities in a medium containing banana plant residue as the carbon source. The best balance of enzyme activities was obtained from cultures of H. grisea var. thermoidea. Xylanase activity from crude extract of A. nainiana had a maximum activity at pH 5.5−7.0 and a temperature range of 50−55 °C. It was stable up to 55 °C at pH 7.0 for at least 2 h. The fungi were also able to produce xylanase and pectinase activities when grown on extractives as substrate.", "num_citations": "51\n", "authors": ["184"]}
{"title": "Improvement in embryo recovery using double uterine flushing\n", "abstract": " The objective of the present study was to evaluate the effects of double uterine flushing on the recovery of embryos/ova in cattle. Two hundred and ten embryo recovery procedures were conducted using a double uterine flushing method, and the results were compared with 432 conventional single-flushing procedures. Cyclic Limousin (n = 403) and Guzera (n = 239) donor cows received an intravaginal progesterone releasing device and 2 mg of estradiol benzoate on Day 0. Between Days 5 and 9, donors received decreasing doses of FSH, which ranged from 200 to 300 IU (Bos indicus) and 300 to 500 IU (Bos taurus). On the afternoon of Day 7, donors received an injection of 500 μg cloprostenol and progesterone implants were removed 12 h later (morning of Day 8). Artificial insemination was performed between 14 and 26 h after first detection of behavioral estrus. Cows were randomly assigned to have embryos …", "num_citations": "50\n", "authors": ["184"]}
{"title": "Biodegradable blends with potential use in packaging: a comparison of PLA/chitosan and PLA/cellulose acetate films\n", "abstract": " Poly(lactic acid) (PLA) is a biodegradable polymer that exhibits high elastic modulus, high mechanical strength, and feasible processability. However, high cost and fragility hinder the application of PLA in food packaging. Therefore, this study aimed to develop flexible PLA/acetate and PLA/chitosan films with improved thermal and mechanical properties without the addition of a plasticizer and additive to yield extruder compositions with melt temperatures above those of acetate and chitosan. PLA blends with 10, 20, and 30 wt% of chitosan or cellulose acetate were processed in a twin-screw extruder, and grain pellets were then pressed to form films. PLA/acetate films showed an increase of 30 °C in initial degradation temperature and an increase of 3.9 % in elongation at break. On the other hand, PLA/chitosan films showed improvements in mechanical properties as an increase of 4.7 % in elongation at …", "num_citations": "48\n", "authors": ["184"]}
{"title": "Gut microbiota and probiotics intervention: a potential therapeutic target for management of cardiometabolic disorders and chronic kidney disease?\n", "abstract": " The gut microbiota plays an important role in host metabolism and its dysregulation have been related to cardiometabolic disorders (CMD), such as type 2 diabetes mellitus (T2D), dyslipidemia and arterial hypertension, as well as to chronic kidney diseases (CKD). The implication of the gut microbiota on systemic disorders has been associated with changes in its composition (dysbiosis) as a result of the oxidative unbalance in the body. This alteration may be the result of the adoption of unhealthy lifestyle behavior, including lack of physical activity and fat- or sugar-rich diets, which are largely associated with increased incidence of CMD and CKD. In last years, a number of clinical trials and experimental studies have demonstrated that probiotics can modulate the host metabolism, resulting in amelioration of systemic disease phenotypes by the improvement of dyslipidemia, glycemic profile and blood pressure or …", "num_citations": "45\n", "authors": ["184"]}
{"title": "Microsurgery in severe posterior epistaxis.\n", "abstract": " A brief review of surgery for severe posterior epistaxis has been outlined. Hundred and forty-five (27.3%) patients were treated by transnasal microsurgery in order to undergo ligation of the branches of the sphenopalatine artery in the nasal cavity. The rate of failure was 6.1%. It seems that by using this kind of operation, we can significantly decrease the morbidity in relation to other methods of controlling the posterior epistaxis.", "num_citations": "45\n", "authors": ["184"]}
{"title": "Economia do bem público-Formas de melhorar a aplicação dos recursos públicos em bens e materiais de uso administrativo\n", "abstract": " Economia do bem público - Formas de melhorar a aplicação dos recursos públicos em bens e materiais de uso administrativo Economia do bem público - Formas de melhorar a aplicação dos recursos públicos em bens e materiais de uso administrativo DSpace/Manakin Repository Login DSpace Home → Biblioteca Digital do Tribunal de Justiça do Distrito Federal e dos Territórios → Revistas Jurídicas → Fórum de Contratação e Gestão Pública → View Item Economia do bem público - Formas de melhorar a aplicação dos recursos públicos em bens e materiais de uso administrativo Kuhn, Elton Celestino URI: http://bdjur.tjdft.jus.br/xmlui/handle/123456789/4472 Date: 2008-03 Show full item record Files in this item Icon Name: Economia do bem ... Size: 28.01Kb Format: PDF This item appears in the following Collection(s) Fórum de Contratação e Gestão Pública Search DSpace Search DSpace This Collection All -| …", "num_citations": "44\n", "authors": ["184"]}
{"title": "Strategies for agile software testing automation: An industrial experience\n", "abstract": " Testing Automation has been growing in software engineering. Many organizations are investing in automated testing in order to prevent defects and increase testing effectiveness during software development. In agile methodologies, this task is considered an important activity, considered the key of the agile testing. This paper presents three testing automation strategies applied to three different software projects adopting Scrum agile methodology. The results indicated positive agile practices to be considered when adopting testing automation strategy, such as: team collaboration, task distribution, testing tools, knowledge managements. The challenges, results, and lessons learned from this experience are also discussed.", "num_citations": "43\n", "authors": ["184"]}
{"title": "An industrial experience on the application of distributed testing in an agile software development environment\n", "abstract": " Software engineering is by nature a highly collaborative activity. However, this collaboration is more difficult when the teams are geographically separated, as several factors, such as work-time, cultural differences, communication, technical capability, among others, may impact on its success. Moreover, each activity in the software development process has specific needs in a distributed software development (DSD) environment. In this paper, we report an industrial experience of a testing team separated geographically in the context of a software project that followed an agile method. The agile testing process was adapted to deal with the DSD characteristics. As results, we observed the feasibility and success of applying distributed testing in an agile software project when dealing with aspects such as communication, coordination, collaboration, task distribution, and tests automation. The challenges, results, and …", "num_citations": "39\n", "authors": ["184"]}
{"title": "A abordagem sistêmica na pesquisa em Engenharia de Produção\n", "abstract": " A Engenharia de Produção está afeta a problemas que se caracterizam pela complexidade. Para serem resolvidos, esses problemas demandam conhecimentos que vão além da matemática e da física, como ocorre nas engenharias mais clássicas. Eles necessitam de uma abordagem que permita o acesso ao conhecimento de várias disciplinas simultaneamente, ou seja, uma abordagem interdisciplinar. Para praticar a interdisciplinaridade e sistematizar o processo de pesquisa na Engenharia de Produção é apresentada a abordagem sistêmica. Ela é capaz de levar em conta o conjunto das variáveis que caracterizam os problemas considerados complexos. A base metodológica escolhida para implementar a abordagem sistêmica é a sistemografia, que permite ampliar o horizonte de pesquisa para aproximar a realidade do fenômeno observado. Finalmente, será mostrada como a abordagem sistêmica permite que o pesquisador trabalhe em um nível maior de subjetividade sem perder a tão necessária \"objetividade\" científica.", "num_citations": "39\n", "authors": ["184"]}
{"title": "Introdução a teste de software\n", "abstract": " É Bacharel em Ciência da Computação formado na Universidade Federal do Amazonas, Mestre em Engenharia de Sistemas e Computação formado na COPPE/UFRJ, e atualmente está cursando doutorado na área de Engenharia de Software da COPPE/UFRJ. Possui 5 anos de experiência em análise, desenvolvimento e teste de software. É editor técnico das Revistas SQL Magazine e WebMobile, gerenciadas pelo Grupo DevMedia.", "num_citations": "35\n", "authors": ["184"]}
{"title": "Heat transfer coefficient and critical heat flux during nucleate pool boiling of water in the presence of nanoparticles of alumina, maghemite and CNTs\n", "abstract": " The characteristics of nucleate pool boiling were investigated with nanofluids in a chamber. Nanoparticles of alumina, maghemite and carbon nanotubes were added separately to distilled water. Particle volumetric concentrations of 0.02% and 0.10% were applied. Experiments with water on the heater copper surface covered with nanoparticles were conducted to evaluate the effect of deposition. Boiling curves, critical heat fluxes and heat transfer coefficients were obtained and compared to reference data for water. The wettability was determined from contact angle measurements. In the experiments with the nanofluids, the nanoparticles were deposited on the test surface. The static contact angle for the water on the copper oxide surface decreased from around 85° to 0° following the deposition of the nanoparticles. Values for the critical heat flux increased from around 26–37% for all test cases. These results are …", "num_citations": "34\n", "authors": ["184"]}
{"title": "Automated mobile testing as a service (AM-TaaS)\n", "abstract": " Due high popularization of cloud services and the use of a wide range of mobile devices with different environments and platforms, a new model to offer software test service emerged, called Testing as a Service (TaaS). It uses cloud infrastructure to provide on-demand testing services on cloud for end users at any time. Nowadays there are many studies about different services about TaaS. Based on this scenario, we propose a framework, called Automated Mobile Testing as a Service (AM-TaaS), which offers automated test for mobile applications based on AQuA's test criteria. We performed an experiment emulating nine Android mobile devices with different characteristics in order to test the criterion \"OTA Install\" (automated installation of mobile applications in a device). We emulated devices under virtual machines and cloud infrastructure. Experimental results show 100% of the emulated devices could be tested …", "num_citations": "30\n", "authors": ["184"]}
{"title": "A New Metastrongyloidean Species (Nematoda) Parasitizing Pulmonary Arteries of Puma (Herpailurus) yagouaroundi (É. Geoffroy, 1803) (Carnivora: Felidae …\n", "abstract": " Angiostrongylus felineus n. sp. (Nematoda, Metastrongyloidea), parasitic in Puma (Herpailurus) yagouaroundi (É. Geoffroy, 1803) (Carnivora, Felidae) from the municipality of Juiz de Fora, Minas Gerais state, Brazil, is described and illustrated herein. Angiostrongylus felineus n. sp. differs from all congeneric species by having the anterior extremity with accentuated cuticular expansion and by smaller size of spicules. This study describes for the first time a species of Angiostrongylus in a wild Felidae in Brazil.", "num_citations": "29\n", "authors": ["184"]}
{"title": "Eficiência nutricional de mudas de Eucalyptus em relação a fósforo\n", "abstract": " O objetivo deste trabalho foi estudar o efeito da aplicação de quatro doses de fósforo (0, 100, 250 e 500 mg P/kg) na produção de biomassa, no conteúdo de nutrientes e na eficiência nutricional de P de mudas de Eucalyptus (E, cloeziana, E. grandis, E. pellita, E. pilularis e E. urophyllá). Constatou-se que as espécies respondem de maneira distinta à aplicação de P, e estabeleceram-se três grupos quanto à produção de biomassa: Grupo l-espécie mais capaz de se estabelecer em solos pobres em fósforo e com resposta intermediária a doses crescentes de P: E. pilularis; Grupo 2-espécies com inadequado estabelecimento em solos pobres em fósforo, mas com elevada resposta à aplicação do nutriente: E. grandis, E. pellita e E. urophylla; e Grupo 3-espécie com inadequado estabelecimento em solos pobres em fósforo e resposta menos acentuada à aplicação de P: E. cloeziana. Sob baixa disponibilidade de P, E. urophylla e E. pilularis apresentaram alta eficiência de absorção, enquanto E. cloeziana foi mais eficiente que as demais espécies em absorver fósforo sob alta disponibilidade deste nutriente. A maior eficiência de utilização de P foi mostrada por E. urophylla, E. grandis e, principalmente, E. pellita, coincidindo com a maior produção de biomassa destas espécies. E. cloeziana apresentou incremento no percentual de recuperação do fertilizante fosfatado com o aumento do fornecimento de P, enquanto as demais espécies mostraram redução nesse percentual com o aumento da fertilização.", "num_citations": "29\n", "authors": ["184"]}
{"title": "Tensão superficial estática de misturas em tanque de glyphosate+ chlorimuron-ethyl isoladas ou associadas com adjuvantes\n", "abstract": " Objetivou-se neste estudo avaliar a tensão superficial estática, o pH e a produção da espuma de misturas em tanque de glyphosate + chlorimuron-ethyl, associadas ou não com adjuvantes. Dois trabalhos foram realizados, sendo a primeira etapa desenvolvida em delineamento inteiramente casualizado com seis tratamentos e 20 repetições, representados por soluções dos herbicidas glyphosate (540,0 g e.a. ha-1) e chlorimuron-ethyl (7,5 g ha-1), isolados e em mistura em tanque nas formulações: Polaris®; Roundup Ready®; Classic®; Polaris® + Classic®; Roundup Ready® + Classic® e testemunha (água). Na segunda etapa foram estudados em DIC 70 tratamentos e 20 repetições, em fatorial 2 x 5 x 7, constituído por duas misturas de glyphosate com chlorimuron-ethyl (Polaris® + Classic® e Roundup Ready ® + Classic®), cinco adjuvantes (Joint Oil®; Nimbus®; Assist®; Natur' Oil® e Agr' Óleo®) e sete doses dos adjuvantes (0,000; 0,031; 0,062; 0,125; 0,250; 0,500 e 1,000% de v/v). As soluções de Polaris® e Roundup Ready®; isoladas ou em misturas com Classic®; caracterizaram-se por tensões superficiais estáticas de 43,2 e 35,9 mN m-1 e pH médios em torno de 4,5 a 4,6, respectivamente. As misturas de Polaris®+Classic®; Roundup Ready®+Classic® e Classic® apresentaram a maior quantidade e persistência da espuma ao longo do tempo, quando comparadas às formulações de Polaris® e Roundup Ready®. Os adjuvantes promoveram redução da tensão superficial quando associados às misturas de Polaris® + Classic® e Roundup Ready® + Classic®; caracterizando-se em termos de eficiência pela ordem decrescente …", "num_citations": "27\n", "authors": ["184"]}
{"title": "Nonlinear model predictive control applied to the separation of praziquantel in simulated moving bed chromatography\n", "abstract": " An adaptive nonlinear model predictive control of a simulated moving bed unit for the enantioseparation of praziquantel is presented. A first principle model was applied at the proposed purity control scheme. The main concern about this kind of model in a control framework is in regard to the computational effort to solve it; however, a fast enough solution was achieved. In order to evaluate the controller's performance, several cases were simulated, including external pumps and switching valve malfunctions. The problem of plant-model mismatch was also investigated, and for that reason a parameter estimation step was introduced in the control strategy. In every studied scenario, the controller was able to maintain the purity levels at their set points, which were set to 99% and 98.6% for extract and raffinate, respectively. Additionally, fast responses and smooth actuation were achieved.", "num_citations": "25\n", "authors": ["184"]}
{"title": "Extension of Selenium RC tool to perform automated testing with databases in web applications\n", "abstract": " This paper presents one extension of the Selenium RC tool to perform tests in web applications that require checking data in databases. This verification is performed using new functions implemented into the Selenium framework's core. These functions allow opening and closing database connection and comparing test data with data stored in the database used by the web application. This solution aims to contribute to the system quality by reducing the effort during the testing process, since the verification of UI and database elements will be performed at the same time during execution of the test scripts. A case study is described to analyze the impact of the proposed tool in terms of effort and rate of automation in the development of a new web application project. The results suggest a significant reduction (92% and 88%) in the effort to execute automated tests in database when compared to, respectively, manual …", "num_citations": "25\n", "authors": ["184"]}
{"title": "Methylene blue as treatment for contrast medium-induced anaphylaxis.\n", "abstract": " Evora PR, Oliveira Neto AM, Duarte NM, Vicente W V. Methylene blue as treatment for contrast medium-induced anaphylaxis. J Postgrad Med [serial online] 2002 [cited 2020 Oct 3]; 48: 327. Available from: http://www. jpgmonline. com/text. asp? 2002/48/4/327/65", "num_citations": "25\n", "authors": ["184"]}
{"title": "What are software engineers asking about android testing on stack overflow?\n", "abstract": " Software testing represents an important activity to achieve quality during mobile application development. The constant evolution of mobile applications in previous years relating to size and complexity entails the need to improve testing techniques and tools. In this context, developers/testers often resort to specialized communities or Question & Answer repositories to clarity doubts regarding testing in a practical and efficient way. Thus, these repositories become a popular source of data to understand the current context of software testing practices. In this paper, we present a study using the Stack Overflow repository for analyzing and clustering the main topics on Android testing. We employed the LDA algorithm to summarize the mobile testing related questions. Our findings show that topics such as testing tools, functional testing, and unit testing are often discussed when compared to other topics. We also …", "num_citations": "23\n", "authors": ["184"]}
{"title": "Analysis of factors contributing to the efficiency of the in vitro production of transgenic goat embryos (Capra hircus) by handmade cloning (HMC)\n", "abstract": " Cloning by Somatic Cell Nuclear Transfer (SCNT) still is challenging and inefficient. Recently, the handmade cloning (HMC) procedures have been successfully applied to livestock species. The aim of this study was to compare the effect of distinct oocyte sources (in vivo vs. post-mortem) and the final cytoplasmic embryo volume (∼85% or 2 × 50%) on fusion rates and on the developmental potential of Day-1 or Day-7 cloned transgenic goat embryos produced by HMC procedures. Cloned embryos were reconstructed by HMC using skin fibroblast donor cells established from a transgenic goat. Oocytes were obtained in vivo by laparoscopic oocyte recovery (LOR) from hormonally stimulated females or post-mortem from slaughterhouse ovaries from nonstimulated goats, resulting in no differences in the number of aspirated follicles, cumulus-oocyte complexes (COCs), and viable COCs per goat. However, the COC …", "num_citations": "23\n", "authors": ["184"]}
{"title": "Correlation between the presence of inguinal hernia and the intensity of lower urinary tract symptoms\n", "abstract": " PURPOSE: To verify the correlation between the presence of IH and the intensity of LUTS related to BPH quantified through the International Prostate Symptom Score (IPSS). METHODS: We prospectively selected 52 patients over the age of 55years; Patients were divided into 2 groups. Group 1: composed of 32 patients with IH; Group 2 (control group): composed of 20 patients with no clinical evidence of IH. All patients were assessed using the IPSS, uroflowmetry (Qmax), post-void residual urine volume (PVR) and prostate volume (PV). RESULTS: Groups 1 and 2 presented no difference in PV (p>0.05) and uroflowmetry (Qmax) (p>0.05). There was a statistical significant difference between the PVR mean values between groups 1 and 2. The presence of IH correlated with a higher IPSS score (r=0.38 p<0.05) despite the fact the no difference was detected between the incidence of patients with mild, moderate and severe LUTS in groups 1 and 2. CONCLUSION: Patients with IH present higher IPSS. The role of IPSS as a marker to predict the development of clinical IH still to be determined.", "num_citations": "23\n", "authors": ["184"]}
{"title": "Seletividade de cultivares de soja RR® submetidos a misturas em tanque de glyphosate+ chlorimuron-ethyl associadas a óleo mineral e inseticidas\n", "abstract": " O uso de glyphosate para o controle de plantas daninhas em soja RR® apresenta características essenciais no conceito de praticabilidade. Entretanto, apesar de não permitido na legislação brasileira, tem-se aumentado a associação com outros herbicidas para manejo de espécies de difícil controle, assim como a sua mistura em tanque em combinação com inseticidas e adjuvantes. Com o objetivo de avaliar a seletividade de cultivares de soja RR® submetidos a misturas em tanque de formulações de glyphosate (Polaris®, Roundup Ready® e Roundup WG®) com chlorimuron-ethyl (Classic®), e suas associações com óleo mineral (Joint Oil®) e inseticidas novaluron (Gallaxy 100 EC®), permethrin (Piredan®) e methomyl (Lannate BR®), um experimento foi conduzido a campo na cidade de Maracaí-SP, na safra 2006/2007. O delineamento experimental utilizado foi o de blocos ao acaso, com quatro repetições, em esquema fatorial 16 x 4, sendo 16 as associações das misturas em tanque entre as formulações de glyphosate, óleo mineral e inseticidas e quatro cultivares: Monsoy 7210RR®, Monsoy 7979RR®, BRS 245RR® e CD 214RR®. Sintomas visuais de intoxicação inicial dos cultivares estudados foram caracterizados por clorose e encarquilhamento nas folhas para todas as misturas em tanque das formulações de glyphosate + chlorimuron-ethyl, associadas ou não ao óleo mineral e inseticidas novaluron, permethrin e methomyl. Todas as misturas em tanque não promoveram reduções significativas de produtividade para os cultivares Monsoy 7210RR®, Monsoy 7979RR® e BRS 245RR® e controlaram Ipomoea spp. com eficácia …", "num_citations": "23\n", "authors": ["184"]}
{"title": "Níveis comparativos de estresse oxidativo em camundongos em duas situações do limite orgânico: overreaching induzido por treinamento de natação e câncer\n", "abstract": " O objetivo deste trabalho foi comparar concentrações de estresse oxidativo em camundongos da linhagem Balb-C submetidos a duas condições severas de alterações orgânicas: treinamento exaustivo de natação (overreaching - grupo OVER; n = 10) e inoculação por tumor ascítico de Ehrlich (grupo TAE; n = 10). A proposta foi analisar como as duas situações comprometiam o equilíbrio entre os sistemas oxidantes e antioxidantes. Foram investigados alguns marcadores de estresse oxidativo, tais como as substâncias reativas ao ácido tiobarbitúrico (TBARS) e concentrações da atividade da enzima antioxidante catalase (CAT) no hemolisado. Como marcadores de lesão celular, quantificaram-se concentrações plasmáticas das enzimas creatina quinase (CK) e aspartato transferase (AST); complementado; também se observaram padrões de alterações fisiológicas por meio da quantificação plasmática de creatinina e uréia. Como resultados mais importantes, pôde-se observar que, nas duas situações de limite orgânico, seja por exercício exaustivo (OVER) ou pela inoculação de TAE, houve queda abrupta na concentração da enzima CAT (decréscimos de 30%; p < 0,01 e 72%; p < 0,001, respectivamente, comparando-se com o grupo treinado - T). Quanto à concentração de peroxidação lipídica (TBARS), detectaram-se aumentos significativos para os grupos OVER e TAE em relação ao grupo T (52%, p < 0,01; 90%, p < 0,001, respectivamente). Níveis liberados de CK foram mais proeminentes no grupo OVER, enquanto que a quantidade de AST no plasma foi mais elevada no grupo TAE. Chegou-se à conclusão de que os organismos …", "num_citations": "23\n", "authors": ["184"]}
{"title": "Seletividade de clomazone isolado ou em mistura para a cultura do algodoeiro\n", "abstract": " O clomazone destaca-se como um dos principais herbicidas utilizados em pré-emergência na cultura do algodoeiro, mesmo levando-se em conta o fato de que muito pouco se sabe em relação à sua seletividade para a cultura. Objetivou-se com este trabalho avaliar a seletividade do clomazone isolado ou em mistura com outros herbicidas utilizados em pré-emergência na cultura do algodoeiro. O delineamento experimental foi o de blocos ao acaso, com quatro repetições, com a utilização de testemunhas duplas. Foram avaliados 13 tratamentos, os quais foram constituídos de clomazone isolado ou combinado com os herbicidas S-metolachlor, diuron, prometryne, alachlor, oxyfluorfen e trifluralin. Foram avaliados porcentagem de fitointoxicação, estande final, altura de plantas, número de maçãs e rendimento final de algodão em caroço. O clomazone, isolado nas doses de 1,00 e 1,25 kg ha-1 ou em associação com S-metolachlor (0,76 kg ha-1), diuron (1,50 kg ha-1), prometryne (1,50 kg ha-1), alachlor (1,44 kg ha-1) e trifluralin (1,80 kg ha-1), foi seletivo à cultura do algodão cv. Nu Opal. Em contrapartida, sua associação com oxyfluorfen (1,25 + 0,19 kg ha-1), trifluralin + diuron (1,25 + 1,80 + 1,50 kg ha-1) e trifluralin + prometryne (1,25 + 1,80 + 1,50 kg ha-1) proporcionou redução na produtividade do algodoeiro.", "num_citations": "22\n", "authors": ["184"]}
{"title": "Equilibrium and thermodynamic studies of zinc adsorption on expanded vermiculite\n", "abstract": " Because of industrial growth, large amounts of effluents are generated, which need to be treated. Among the micropollutants usually present in industrial effluents, heavy metals are especially dangerous to aquatic environment because they are bioaccumulated along the food chain. This work aims to study the removal of zinc ions in aqueous solution by adsorbing them onto expanded vermiculite. In addition, equilibrium and thermodynamics studies were carried out to verify the spontaneity and the characteristics of the process. Langmuir, Freundlich and Dubinin–Radushkevich's models were applied to the data obtained from isotherms at temperatures of 273, 293, 313 and 333 K. Furthermore, experiments in static system were carried out to choose a suitable eluent to this process, to find the metal concentration and identify a method for effective recovery of the adsorbent. This adsorption process was found to be …", "num_citations": "21\n", "authors": ["184"]}
{"title": "Avaliação de métodos de determinação de água disponível em solo cultivado com algodão\n", "abstract": " O objetivo deste trabalho foi avaliar dois métodos de determinação de água disponível no solo (um direto e outro de laboratório), e o efeito de três níveis de água disponível (10%, 25% e 40%) na cultura do algodoeiro herbáceo (Gossypium hirsutum L. r. latifolium Hutch). O trabalho foi realizado em casa de vegetação do Departamento de Solos e Engenharia Rural/Centro de Ciências Agrárias/Universidade Federal da Paraíba, Município de Areia, PB. O delineamento experimental adotado foi o de blocos ao acaso, com distribuição em esquema fatorial 2 x 3, com três repetições. Conforme a análise de variância, a faixa de água disponível no solo, encontrada mediante a utilização do método direto, supera significativamente (p £0,05) a obtida pelo método de laboratório. O manejo das irrigações do algodoeiro com base em 40% da água disponível, determinado pelo método direto, proporcionou os maiores resultados de evapotranspiração, de área foliar e acumulação de fitomassa na parte aérea da cultura. Observou-se ainda interação métodos x níveis de água disponível em todas as variáveis estudadas.", "num_citations": "20\n", "authors": ["184"]}
{"title": "Prevalência e incidência de úlcera por pressão em uma unidade de terapia intensiva\n", "abstract": " Objetivo: calcular a incidência e a prevalência de úlceras por pressão (UPP). Método: estudo prospectivo realizado com 332 pacientes em UTI durante período de um ano. Na coleta de dados utilizou-se a ficha de anotação de integridade da pele e foram calculadas a prevalência e a incidência de UPP, O projeto de pesquisa foi aprovado pelo Comitê de Ética em Pesquisa, Protocolo 3354-2009. Resultados: dos pacientes estudados, 92% apresentaram risco para UPP, 12% desenvolveram UPP na internação, 10% apresentaram UPP na admissão. Das UPP identificadas na admissão 20 eram de estágio I, 29 de estágio II, 2 de estágio III e 7 em estágio IV. Das UPP identificadas durante a internação, 11 eram no estágio I, 39 no estágio II e 4 no estágio III. A incidência e a prevalência das UPP foram de 13,95% e 17,79% respectivamente. Conclusão: conhecer as taxas de incidência e prevalência das UPP contribuiu para qualidade da assistência.", "num_citations": "19\n", "authors": ["184"]}
{"title": "Direct determination of δ (D) and δ (18O) in water samples using cavity ring down spectrometry: Application to bottled mineral water\n", "abstract": " The repeatability, reproducibility and accuracy of the direct measurement of δ(D) and δ(18O) isotopes in water samples were evaluated using Cavity Ring-Down Spectrometry, and values comparable with the Isotopic Ratio Mass Spectrometry were obtained. Memory effect correction was negligible after five successive injections, and the time for each sample analysis was approximately 70 minutes. Application of the method to Brazilian bottled mineral water has shown that it is possible to trace the origin of the water to at least the state level within Brazilian geographical regions. National and regional meteoric water lines were constructed with substantial differences between geographical regions, in particular for the central region of the country, with a slope coefficient of approximately seven and no deuterium excess.", "num_citations": "18\n", "authors": ["184"]}
{"title": "Production of cellulose nanowhiskers from oil palm mesocarp fibers by acid hydrolysis and microfluidization\n", "abstract": " In the present study, oil palm mesocarp fibers (OPMF), an agroindustrial residue from the production of palm oil, were used to obtain cellulose nanowhiskers. They were obtained from bleaching of fibers, followed by hydrolysis using sulfuric acid and microfkuidization, to control the length of cellulose nanowhiskers and avoid a decrease in thermal stability with extended acid hydrolysis time. The results showed that the nanowhiskers obtained by acid hydrolysis for 105 min resulted in structures with an average length (L) of 117 ± 54 nm and diameter (D) of 10 ± 5 nm. After 105 min of acid hydrolysis, the suspension was dialyzed and the neutral suspension was subjected to microfku- idization. At this time the nanowhiskers presented the same dimensions, even with the fibrils disintegration of both amorphous and crystalline phases, during the microfkuidization. However, after microfkuidization, the sample presented a …", "num_citations": "17\n", "authors": ["184"]}
{"title": "Comparison between mahalanobis distance and kullback-leibler divergence in clustering analysis\n", "abstract": " This paper shows a comparison between two clustering algorithms that use divergence measures to aid the clustering task. Both algorithms take a N-dimensional data set and uses competitive neural networks to separate them into isotropic clusters. Those clusters are then grouped based on a divergence measure. In this paper we compare that procedure using two different divergence measures, the Mahalanobis distance and the Kullback-Leibler divergence. The paper shows some results of clustering on both algorithms and make a few comments about the choice of the free parameters in both situations.", "num_citations": "16\n", "authors": ["184"]}
{"title": "Cloud-based mobile app testing framework: Architecture, implementation and execution\n", "abstract": " The growth in the use of mobile devices is notorious due to the multiple functionalities they offer. The time between the release of new device models and mobile platform updates is very short, and this has a direct influence on the quality of mobile applications, because these applications need to be compatible with new mobile devices and the different versions of mobile platforms. As a negative consequence, the quality of mobile apps would be lower than expected. Therefore, to ensure mobile application quality, many services for mobile test are offered as Cloud Testing. Thus, this work proposes a Mobile Cloud Testing Framework, called AM-TaaS, that meets these needs. AM-TaaS facilitates the test environment setup and configuration and covers a range of mobile devices and platforms. We also describe the architecture and implementation of the proposed framework. With the use of AM-TaaS framework, it is …", "num_citations": "15\n", "authors": ["184"]}
{"title": "Doctors’ awareness concerning primary immunodeficiencies in Brazil\n", "abstract": " BackgroundPIDs are a heterogeneous group of genetic illnesses, and delay in their diagnosis is thought to be caused by a lack of awareness among physicians concerning PIDs. The latter is what we aimed to evaluate in Brazil.MethodsPhysicians working at general hospitals all over the country were asked to complete a 14-item questionnaire. One of the questions described 25 clinical situations that could be associated with PIDs and a score was created based on percentages of appropriate answers.ResultsA total of 4026 physicians participated in the study: 1628 paediatricians (40.4%), 1436 clinicians (35.7%), and 962 surgeons (23.9%). About 67% of the physicians had learned about PIDs in medical school or residency training, 84.6% evaluated patients who frequently took antibiotics, but only 40.3% of them participated in the immunological evaluation of these patients. Seventy-seven percent of the …", "num_citations": "15\n", "authors": ["184"]}
{"title": "Síndrome de Crouzon: fatores envolvidos no desenvolvimento neuropsicológico e na qualidade de vida\n", "abstract": " A síndrome de Crouzon é caracterizada por deformidade craniana, alterações faciais e exoftalmia. O retardo no desenvolvimento neuropsicomotor é observado em alguns casos. Este estudo tem como objetivo analisar a influência do momento da cirurgia, da classe sócio-econômica associada ao nível educacional dos pais e da ocorrência de malformações do sistema nervoso central no desenvolvimento cognitivo destes pacientes correlacionando estes achados à qualidade de vida deles e de suas famílias. Foram estudados 11 pacientes com diagnóstico de síndrome de Crouzon com idade entre um ano e quatro meses e treze anos. A avaliação multidisciplinar dos pacientes incluiu, avaliação social, avaliação cognitiva, estudo do encéfalo por ressonância magnética e avaliação da qualidade de vida. O quociente de inteligência variou de 46 a 102 (m=84,2) e foi correlacionado de forma inversa com o Fator 4 do Questionário de Recursos e Estresse Simplificado (incapacidade da criança); não se correlacionou com as alterações encefálicas, com a condição sócio-econômica dos pais e nem com o momento do tratamento neurocirúrgico.", "num_citations": "15\n", "authors": ["184"]}
{"title": "A strategy for voltage regulation in Eolic systems\n", "abstract": " This paper presents a comparative performance analysis of a wind power generation unit with and without the inclusion of a reactive compensator known as saturated core reactor (SCR) to improve voltage variations resulting from the wind power. Besides demonstrating the solution efficiency and adequacy for voltage control, the results can also be used to validate the established computational model. Field results, derived from a real system with and without the compensator insertion are given to enhance the overall system/compensator/generators behavior.", "num_citations": "15\n", "authors": ["184"]}
{"title": "Relevance and impact of critical factors of success in software test automation lifecycle: A survey\n", "abstract": " Context: Software has increased in size and complexity. It has increased the amount of time and money required for testing. Many organizations have invested in software test automation (STA) waiting for reducing costs and improving the testing process. However, less than 50% of them reach the expected objectives related to software test automation mainly due to the lack of a clear understanding of what is involved. Objective: There is a documented gap between the academic and practitioners' points of views about software test automation. This paper has two main objectives. First, evaluating the relevance of 12 critical factors of success (CFS) in software test automation collected from the technical literature according to researchers views. Second, evaluating the impact of each of them on a basic software test automation lifecycle (BSTAL). Method: To archive the above objectives, we have performed a survey …", "num_citations": "14\n", "authors": ["184"]}
{"title": "Removal and recovery of silver by dynamic adsorption on bentonite clay using a fixed-bed column system\n", "abstract": " Several studies have focused on the removal and recovery of precious metal ions from industrial wastewater due to their environmental and economic importance. Adsorption on bentonite clays has been shown to possess a high removal potential for several metal ions. We herein investigated the dynamic adsorption of silver using a fixed-bed column and a calcined bentonite clay called Verde-lodo as an adsorbent. A fluid dynamic study was performed to evaluate the adsorption system's metal-ion removal capacity (qu and qt), the mass transfer zone and the percentage of total removal according to different effluent's flow. Adsorption–desorption cycles were carried out using nitric acid as an eluent to evaluate the useful lifetime of the column. The breakthrough curves were fitted to the Bohart–Adams model (quasichemical). Moreover, the zeta potential was analyzed to explain the difference between the removal …", "num_citations": "14\n", "authors": ["184"]}
{"title": "Caracterização de lesões desportivas no basquetebol\n", "abstract": " INTRODUÇÃO: O basquete apresenta altos índices de lesão. Na literatura ainda não se definiu existem ou não diferenças entre os sexos. OBJETIVO: Caracterizar e analisar a incidência de lesões desportivas em atletas de basquetebol, com comparação entre os sexos. MATERIAIS E MÉTODOS: Quinze atletas de cada sexo, da categoria sub-23, foram entrevistados com o inquérito de morbidade referida. RESULTADOS: A média de idade das equipes feminina e masculina foi de 18 ± 0,65 e 18,20 ± 1,57 anos, respectivamente. A equipe masculina apresentou mais lesões que a feminina (2,6 ± 1,45 contra 1,2 ± 1,18 respectivamente, p < 0,05). A lesão articular foi o tipo de lesão mais comum na equipe masculina, representando 58,97%, e o segundo mais comum na feminina (33,33%). Os membros inferiores foram a região mais acometida por lesões (80,95% na feminina e 69,23% na masculina). O mecanismo de lesão mais comum na equipe masculina foi a aterrissagem (43,59%) e na feminina o salto vertical (28,57%). Em ambas as equipes, a maior parte das lesões ocorreu durante os treinos (61,9% na feminina e 71,8% na masculina). Foi necessário o afastamento em 47,62% (feminina) e 56,41% (masculina). A maioria dos atletas não realizou tratamento (61,9% e 51,28% feminino e masculino, respectivamente). O retorno às atividades, na maioria das vezes, foi sintomático, tanto na equipe feminina quanto na masculina (85,71% e 84,62% respectivamente). CONCLUSÃO: A incidência de lesões no basquetebol é maior nos membros inferiores. A equipe masculina mostra-se mais propensa a sofrer lesões, e os principais mecanismos …", "num_citations": "14\n", "authors": ["184"]}
{"title": "Situation of the whiteflies Bemisia tabaci and Trialeurodes vaporariorum in protected tomato crops in Algarve (Portugal)*\n", "abstract": " Protected tomato is the most important horticultural crop in the Algarve (south of Portugal). However, the growing area has decreased by almost 48% since 1995, mainly as a result of the pests Bemisia tabaci and Trialeurodes vaporariorum and the epidemics of Tomato yellow leaf curl virus (TYLCV), a Begomovirus transmitted by B. tabaci. Both whiteflies are vectors of economically important viruses. Recently, Tomato chlorosis virus (ToCV), a member of the genus Crinivirus, transmitted by both B. tabaci and T. vaporariorum, was reported infecting tomato crops in Algarve. A study was carried out to evaluate the dynamics of whitefly populations on tomato crops in Algarve. Population counts of B. tabaci were high in the first months of autumn, then decreased until January, when numbers of T. vaporariorum became higher. Counts of B. tabaci then increased again.", "num_citations": "14\n", "authors": ["184"]}
{"title": "Real-time qRT-PCR analysis of EGF receptor in cumulus-oocyte complexes recovered by laparoscopy in hormonally treated goats\n", "abstract": " Ovarian stimulation with exogenous follicle stimulating hormone (FSH) has been used to increase the number of viable oocytes for laparoscopic oocyte recovery (LOR) in goats. The aim of this study was to evaluate the effect of two FSH protocols for ovarian stimulation in goats on the expression pattern of epidermal growth factor (EGF) receptor (EGFR) in cumulus–oocyte complexes (COCs) recovered by LOR. After real-time qRT-PCR analysis, expression profiles of morphologically graded COCs were compared prior to and after in vitro maturation (IVM) on a FSH protocol basis. The use of a protocol with higher number of FSH injections at a shorter interval resulted in GI/GII COCs with a higher level of EGFR expression in cumulus cells, but not in the oocyte, which was correlated with an elevated meiotic competence following IVM. Based on the maturation profile and EGFR expression patterns observed between …", "num_citations": "13\n", "authors": ["184"]}
{"title": "Viabilidade\" in vitro\" de grãos de pólen de bacurizeiro-Clusiaceae\n", "abstract": " O bacurizeiro (Platonia insignis Mart.) é uma frutífera nativa da Amazônia, que apresenta alogamia acentuada e autoincompatibilidade esporofítica. A viabilidade in vitro tem sido utilizada para representar a capacidade potencial do pólen em completar o processo de fertilização O objetivo do presente trabalho foi estudar a viabilidade de polens de bacurizeiro por meio da germinação in vitro , por ser esta uma técnica em que o comportamento germinativo é semelhante in vivo . Os ensaios foram conduzidos em laboratório, em um delineamento inteiramente casualizado, analisados em esquema fatorial 2 x 3 x 4, em que: 2=formas de propagação (pé-franco e enxertada); 3=estágios da antese (pré-antese, antese e pós-antese), e 4=concentrações de sacarose (0; 7,5; 10 e 20%), com 10 repetições. Houve diferença significativa na germinação do pólen, sendo que, via polinização manual, o pólen deve ser coletado na antese, enquanto o melhor meio para a germinação in vitro é com 7,5 g de sacarose.", "num_citations": "13\n", "authors": ["184"]}
{"title": "Estudo comparativo entre protocolos para profilaxia da trombose venosa profunda: uma nova proposta\n", "abstract": " INTRODUÇÃO: O artigo compara os protocolos Davison-Caprini (americano) e Sandri (brasileiro) para profilaxia da trombose venosa profunda (TVP), buscando a elaboração de um novo protocolo, mais abrangente e aplicável. MÉTODO: Foi realizado um estudo prospectivo, durante um ano, abrangendo 212 pacientes, comparando os protocolos quanto à estratificação de risco de TVP, e ao tipo de profilaxia indicado. Um novo protocolo foi proposto, aplicado e comparado aos anteriores. RESULTADOS: Obteve-se um novo protocolo, denominado Sandri modificado, que restringe a heparina a um grupo seleto de pacientes, semelhante ao americano, mantendo-se adequado tanto para cirurgias estéticas quanto reparadoras. CONCLUSÕES: A baixa adesão, por parte dos cirurgiões plásticos, ao uso rotineiro da profilaxia de TVP, espelha a escassez de informação sobre o tema. O protocolo Sandri modificado busca melhorar a compreensão e a aplicabilidade da profilaxia da TVP na cirurgia plástica.", "num_citations": "13\n", "authors": ["184"]}
{"title": "Microalgae harvesting and cell disruption: a preliminary evaluation of the technology electroflotation by alternating current\n", "abstract": " Some species of microalgae have high productivity and lipid content, which makes them good candidates for biodiesel production. Biomass separation and cell disruption are important steps in biodiesel production from microalgae. In this work, we explored the fundamentals of electroflotation by alternating current (EFAC) with non-consumable electrodes to simultaneously harvest microalgae and disrupt cells from mixed microalgae obtained from waste stabilization ponds. The harvesting efficiency was evaluated using chlorophyll-a and turbidity, which reached removals of 99% and 95%, respectively, during a batch time of 140 min. Cell disruption was evaluated using lipid extraction, and the best results were achieved with a batch time of 140 min, which resulted in a 14% yield. Therefore, EFAC was shown to be an attractive potential technology for simultaneous microalgal harvesting and cell disruption.", "num_citations": "12\n", "authors": ["184"]}
{"title": "Zoneamento agroclimático da cultura da mangueira no Estado do Piauí\n", "abstract": " O presente trabalho teve como objetivo realizar o zoneamento agroclimático da cultura da mangueira no Estado do Piauí. Foram utilizados dados médios anuais de precipitação e temperatura do ar, de 15 municípios do Piauí, representativos das principais regiões do Estado para a elaboração do balanço hídrico e a obtenção do Índice de Umidade (Im). Foram adotadas as seguintes faixas de Índice de Umidade (Im): - Aptidão plena A, Im < -40; - Aptidão plena B, -40 < Im <-20. O critério utilizado na divisão do Estado, em zonas térmicas, baseou-se nas normais de temperaturas médias do mês mais quente (Tq) para cada local. Assim sendo, as faixas A e B, com aptidão plena, do ponto de vista hídrico, foram subdivididas em duas subzonas: Aptidão plena A1: (Tq < 29 ºC), Aptidão plena A2: (29 ºC < Tq <31 ºC) e Aptidão plena B1: (Tq < 29 ºC), Aptidão plena B2: (29 ºC < Tq <31 ºC), para atender ao critério térmico. Com base nas cartas de Tq e Im, foram definidos os limites para as diferentes zonas de aptidão climáticas para o cultivo de manga. À luz dos critérios utilizados e com base na literatura consultada, o Estado do Piauí não apresenta nenhuma restrição climática para o cultivo comercial da mangueira.", "num_citations": "12\n", "authors": ["184"]}
{"title": "Prevalência e distribuição de lesões digitais em vacas leiteiras nas regiões de Belo Horizonte e Pedro Leopoldo\n", "abstract": " Com objetivo de determinar a prevalência, classificar as lesões digitais e estabelecer o escore de claudicação, foram examinadas 323 vacas leiteiras de 63 propriedades localizadas na bacias leiteiras de Belo Horizonte e Pedro Leopoldo, sendo 57 em sistema semi-intensivo e 6 em sis-tema intensivo. A prevalência de animais acometidos não variou entre os sistemas, havendo predomínio de lesões múltiplas. As lesões mais prevalentes foram erosão de ta-lão (59, 8%), dermatite digital (30, 3%) e casco em tesoura (24, 1%). Dermatite digital, erosão de talão, hemorragia de sola e casco em tesoura foram mais freqüentes nos membros pélvicos, enquanto dermatite interdigital e hemorragias na muralha nos membros torácicos. Não ocorreram diferenças de distribuição de lesões entre as unhas laterais ou mediais de qualquer um dos membros. O escore de claudicação para animais com lesões simples foi em média de 1,216 e para animais com lesões múltiplas de 1,828.", "num_citations": "12\n", "authors": ["184"]}
{"title": "Crescimento e desenvolvimento de duas cultivares de algodoeiro herbáceo em baixos níveis de umidade no solo, em casa de vegetação\n", "abstract": " Este trabalho foi desenvolvido com o objetivo de se avaliar, comparativamente, a sensibilidade de duas cultivares de algodoeiro herbáceo, CNPA Precoce 1 e CNPA 7H, em baixo conteúdo de água no solo (3%, 23%, 43% e 63% de água disponível) estudando-se os seus efeitos até a fase de frutificação. O delineamento experimental foi em blocos casualizados, em esquema fatorial 2x4, com três repetições. O trabalho foi conduzido em casa-de-vegetação, em vasos de PVC, contendo 10kg de solo seco ao ar, textura areia-franca. Todos os vasos tiveram a umidade no nível de capacidade de campo, no momento da semeadura; a partir daí, esperou-se que o conteúdo de água disponível do solo atingisse os níveis dos tratamentos estudados, passando a haver monitoramento e suplementação de água até o nível predeterminado. De acordo com os resultados obtidos, ambas as cultivares são pouco exigentes em água, na fase inicial de seu ciclo (1,58 mm/dia para a cv. Precoce 1 e 1,66 mm/dia para a CNPA 7H). A necessidade de água aumenta no florescimento (6,48 mm/dia e 7,07 mm/dia, respectivamente) e na fase de formação da produção (11,03 mm/dia e 11,75 mm/dia, respectivamente). A cv. CNPA 7H é mais eficiente no uso da água e sua utilização no crescimento vegetativo, enquanto a CNPA Precoce 1 tem maior eficiência em relação ao seu aproveitamento em florescimento e frutificação. No trabalho são apresentadas equações de regressão, correlacionando-se variáveis vegetativas/reprodutivas e níveis de água disponível no solo.", "num_citations": "12\n", "authors": ["184"]}
{"title": "Major seminal plasma proteome of rabbits and associations with sperm quality\n", "abstract": " The present study was conducted to describe the major seminal plasma proteome of rabbits and potential associations between seminal proteins and semen criteria. Semen samples were collected from 18 New Zealand adult rabbits, and seminal plasma proteins were analyzed by 2-D SDS-PAGE and tandem mass spectrometry. Sperm motility, vigor, concentration, morphology and membrane sperm viability were evaluated. Rabbits ejaculated 364 ± 70 million sperm/ml, with 81 ± 6.1% motile cells, 3.8 ± 0.2 vigor and 66.7 ± 2.5% sperm with normal morphology. Based on the viability and acrosome integrity assay, there were 65.8 ± 2.5% live sperm with intact acrosome and most spermatozoa had both intact acrosome and functional membrane. On average, 2-D gels of rabbit seminal plasma had 232 ± 69.5 spots, as determined by PDQuest software (Bio Rad, USA). Mass spectrometry allowed the …", "num_citations": "11\n", "authors": ["184"]}
{"title": "Genetic diversity and ISSR marker association with the quality of pineapple fiber for use in industry\n", "abstract": " Interest in biodegradable products such as natural fibers for use in various industries is growing. These fibers are an inexpensive alternative with environmentally friendly appeal in comparison to other materials used. This article reports evaluation of the genetic variability of 13 pineapple genotypes to ascertain the use their fibers as mechanical reinforcement in composites applied in industry and analyzes possible association of 217 bands from 17 ISSR markers with fiber quality characteristics by nonparametric tests (Spearman correlation and Kruskal-Wallis). The study of genetic diversity, using qualitative and quantitative data, shows there are genotypes genetically close to curauá (a close relative of pineapple), whose fibers are already commonly used in the industry. Of the 217 ISSR bands, 11 were selected based on their high correlation (0.63434* to 0.76169**) regarding all four variables for fiber quality …", "num_citations": "11\n", "authors": ["184"]}
{"title": "Dipylidium caninum (Cyclophyllidea, Dipylidiidae) in a wild carnivore from Brazil\n", "abstract": " We report Dipylidium caninum for the first time in a wild carnivore in Brazil, the crab-eating fox (Cerdocyon thous). Presence of the cestode could be the consequence of anthropogenic expansion into natural habitats of this host, as this parasite has only previously been reported in domestic hosts in Brazil.", "num_citations": "11\n", "authors": ["184"]}
{"title": "Influence of the system on adsorption of Pb (II) and Cu (II) by rice husks ash: Kinetic study\n", "abstract": " Pb (II) and Cu (II) removal from aqueous solutions by rice husk ash was investigated using batch and fixed bed techniques, static and dynamic systems, respectively. The rice husks calcined at 500 ºC showed higher potential for removing metals such as lead and copper. Batch experiments were performed at a constant temperature, adjusting the pH of the solution in contact with rice husk ash. Adsorption essays at fixed bed were also carried out according to a study of outflow determined with basis on results from mass transfer zone (MTZ). The single-component essays showed that both heavy metals have affinity to ash adsorptive sites. The maximum adsorption capacity didn’t show significant changes in the dynamic system of fixed bed system compared to static batch. In the binary mixture (copper+ lead) there is a greater affinity between the lead and RHA in batch, while in fixed bed copper presented higher removal.", "num_citations": "11\n", "authors": ["184"]}
{"title": "Modificação técnica na cirurgia da estenose aórtica supravalvar\n", "abstract": " The standard surgical treatment of the supravalvar aortic stenosis is characterized by the ampliation of one or more sinus of Valsalva utilizing patch of prosthetic material (Dacron, bovine pericardium) with or without transsection of the aorta. One possible limitation on late results with these procedures is the fact of graft thickening or calcification, difficulting the aortic root growing, mainly when the patient is a child. In order to avoid this complication, we propose a new technical modification that effectivelly increases the aortic diameter, without the use of prosthetic material, using only the normal ascending aortic wall to reconstruct and enlarge the stenotic area. We performed this procedure in 4 patients with ages ranging from 23 months to 38 years old (m - 14, 5, Y. O,), weighing from 10 to 56 kg (m - 26,2 kg). The three young patients had sings of Williams syndrome. The gradients between left ventricle and aorta were 50, 70, 100 and 100 mmHg. Cristaloid cardioplegia was infunded antegrately. The ascending aorta was entirely mobilized. After aortic transsection immediately above the stenotic point, we made vertical incisions from the free edge to the botton of the Valsalva sinuses. Sometimes the size and position of the left coronary ostium impedes the incision on the left Valsalva sinus. On the distal aorta we made three longitudinal incisions in the position corresponding to the comissures of the aortic valve. Suturing these two parts we reconstructed the aortic root anatomicaly. The four patients had uneventful hospitalization and were discharged in good clinical condition. With a follow-up from 1 to 6 months, all the patients are assymptomatic.", "num_citations": "11\n", "authors": ["184"]}
{"title": "Robótica educacional uma ferramenta para ensino de lógica de programação no ensino fundamental\n", "abstract": " A Robótica educacional vem, ao longo dos anos, se concretizando como uma ferramenta de prática tecnológica que apresenta dinamismo e motivação ao processo de ensino e aprendizagem. A vivência de diversas situações e atividades práticas motivam os alunos para a resolução de problemas, trabalhos em grupos, capacidade crítica, desenvolvimento do raciocínio lógico, de maneira que ele se torna protagonista na construção do seu conhecimento. Este artigo tem como objetivo relatar a experiência de um estudante do curso de Engenharia de Controle e Automação, na promoção de atividades educacionais e desenvolvimento de estratégias para o ensino de lógica de programação com uso da robótica educacional em escolas da Rede privada de ensino em Salvador-BA com alunos de Ensino Fundamental II.", "num_citations": "10\n", "authors": ["184"]}
{"title": "Fluid dynamic study for copper removal onto modified clay in fixed bed\n", "abstract": " Toxic metals cannot be biodegraded or destroyed, which leads to the need of their removal from industrial wastewaters. Therefore, so that you can design and optimize removal equipment (ion exchange/adsorption column) is essential to characterize the adsorbent and to know the dynamics of adsorbate components in the experimental system. In this work, the bentonite clay called Fluidgel, from the northeast region of Brazil, calcined at 750 C, was used as adsorbent for copper removal. The characterization methods used were Thermogravimetry (TG), X-ray Diffraction (XRD), N 2 adsorption (BET), and Scanning Electron Microscopy (SEM). The removal of copper from aqueous solution was carried out in a fixed bed, built in glass with 15 cm high and 1.5 cm in internal diameter. Several dynamic experiments were performed to evaluate the effect of flow in adsorption efficiency. The experiments were accomplished at room temperature, the adsorbent particle diameter was of 0.855 mm and the flow rate varied from 2 to 4 mL/min. The feed concentration of copper was about 1.57 mmol/L. The bentonite clay used presented a chemical composition according to the most clays of this group. The presence of water in the interlamellarspaces of the clay was confirmed by thermogravimetric analysis, where the TG curve indicated a weight loss of 11.5%. The Fluidgel clay calcined at 750 C showed a surface area of 11 m 2/g, whereas its commercial form presented 58 m 2/g. The breakthrough curves obtained at different flow rates showed different behaviors, indicating the effect of diffusional resistances. The flow rate of 2 mL/min was chosen as operating …", "num_citations": "10\n", "authors": ["184"]}
{"title": "Assessing the Relevance of Organizational Culture in Software Process Improvement Initiatives.\n", "abstract": " This study describes a survey carried out among researchers and practitioners in the software industry, aiming to determine which organizational values are most relevant to a software organization involved with a SPI initiative. Organizational values define the organizational culture of a company and they were extracted from typological models published in the technical literature by a secondary study (systematic literature review). The results of the survey indicate that the main organizational values for a software organization to be successful in the adoption/maintenance of an SPI initiative are:(1) being committed to the quality policy for products, services, and processes;(2) having the vision and goals well defined and established; and (3) imposing responsibilities on the team members for meeting deadlines and achieving goals. Also, it indicates the level of commitment and responsibilities of three different profiles of professionals as a factor for success in the adoption/maintenance of an SPI initiative.", "num_citations": "10\n", "authors": ["184"]}
{"title": "Caracterização e avaliação de argilas como adsorventes na remoção e eluição de íons cobre e mercúrio em diferentes sistemas\n", "abstract": " A remoção de metais pesados por argilas, baseada na tecnologia de purificação da água, tem sido investigada como uma alternativa aos métodos tradicionais. Argilas do tipo esmectítico são as de maior utilização industrial, sendo considerada a mais interessante das argilas industriais. Todavia em diversos casos faz-se necessário submetê-las a tratamentos físicos e químicos para aprimorar suas potencialidades. Assim, estudou-se, no presente trabalho a remoção dos íons cobre e mercúrio, em laboratório a partir de soluções sintéticas, a adsorção sobre as argilas calcinadas dos tipos Bofe e Verde-lodo. Tais íons são recorrentemente produzidos e acumulados no meio ambiente e sua recuperação, para posterior reuso, tem cada vez mais importância à medida que não apenas o tratamento da água residuária é necessário, mas o aproveitamento dos subprodutos é incentivado, por acarretar benefícios econômicos e ambientais. Dessa forma, estudos a respeito de técnicas de remoção dos íons metálicos, assim como do equilíbrio e da cinética do processo, são necessários para a viabilização do procedimento de recuperação. As técnicas de remoção abordadas nesse trabalho foram a de banho finito e de leito fixo e seus objetivos foram avaliar os mecanismos e taxas de remoção dos íons de cobre e mercúrio, a partir do levantamento das curvas de equilíbrio e cinéticas de cada íon. Os ensaios monocomponentes, em banho e leito, mostraram que o cobre tem afinidade pelos sítios das argilas, mas o mercúrio não. As maiores capacidades de adsorção do cobre foram de 0, 14 e de 0, 22 mmol/g, em leito, sobre as argilas Bofe e Verde …", "num_citations": "10\n", "authors": ["184"]}
{"title": "New parallel algorithms for back-propagation learning\n", "abstract": " It is presented in this work new parallel algorithms to train a multilayer perceptron network using the error backpropagation algorithm. An analysis of the different paralleling strategies used is shown and aspects such as-task definition and communications profile were taken into account. An application in image compression illustrates the capacity of these new procedures when compared to the classical approach and to other parallel implementations.", "num_citations": "10\n", "authors": ["184"]}
{"title": "Business-IT Alignment Research Field-A Systematic Literature Review\n", "abstract": " The business-IT alignment has become an important research field that has been widely investigated by different areas and with different viewpoints. Since the interest in the business-IT research field has grown it has become important to monitor how it has been developed and what are the directions of ongoing research within the field. This paper reports the performing of an extensive systematic literature review whose main contribution is to provide an overview of the current status of development and possible further directions for the business-IT alignment research field from the viewpoint covered by six issues: research topics, alignment dimensions, business and IT domains, research goals, types of research results and research methods. The main results indicate that BPM, IT Governance are the two most used research topic, the cultural and social alignment dimensions and the IT strategy domain have been little adopted, there is unnecessary worry about the development of the new approaches rather than taking advantage of the existing ones, the research results are overly theoretical, most of the research is not performing the empirical validity of its results. This paper indicates possible further directions and concluding that the current state of the development of the business-IT research field can still need to gain more maturity.", "num_citations": "9\n", "authors": ["184"]}
{"title": "Otimização da programação da manutenção dos ativos de transmissão do sistema elétrico brasileiro considerando penalidades por indisponibilidade, restrições sistêmicas e …\n", "abstract": " Uma empresa de energia elétrica tem por obrigação garantir a continuidade e a qualidade do serviço prestado. A fim de incentivar a qualidade do serviço, a ANEEL introduziu penalidades nos contratos com as concessionárias de serviços públicos de transmissão de energia elétrica caso as instalações de transmissão sejam desligadas, por acidente, falha de equipamento ou manutenção programada. Abordagens tradicionais de manutenção em sistemas de transmissão de energia elétrica se baseiam em ações realizadas periodicamente, ou programadas, de acordo com uma análise de necessidades. Embora essas abordagens tenham o objetivo de melhorar o desempenho destes sistemas, geralmente não há uma avaliação precisa do impacto das ações de manutenção na confiabilidade dos mesmos relacionada aos recursos empregados, bem como penalidades legais decorrentes. O objeto assim formulado caracteriza-se como um problema de otimização combinatória com o objetivo de encontrar o encadeamento das ações de manutenções que minimizem os recursos utilizados em manutenções e garanta um nível de confiabilidade desejado para o Sistema Elétrico. Este trabalho propõe uma abordagem para enfrentar este problema baseada na relação confiabilidade/custo com a perspectiva de encontrar as melhores estratégias para a realização de manutenções em equipamentos (ativos) de transmissão de energia elétrica, apresentando um modelo matemático para a confecção de um calendário viável (que respeite às restrições do Sistema Elétrico) para programação de manutenção nestes ativos e metodologia de …", "num_citations": "9\n", "authors": ["184"]}
{"title": "Mixture design approach for the development of reduced fat lamb patties with carboxymethyl cellulose and inulin\n", "abstract": " Fat replacement by carboxymethyl cellulose (CMC) and inulin (IN) for the manufacture of low‐fat lamb patties was investigated utilizing mixture design. The effect of fat, CMC, and IN levels on texture, color, weight loss, patty diameter reduction, and sensory characteristics was investigated. The presence of CMC decreased hardness (p < 0.05). While CMC and IN also decreased springiness, cohesiveness, gumminess, and chewiness (p < 0.05), no effect on adhesiveness was observed (p > 0.05). CMC increased L* (lightness), a* (redness), and b* (yellowness) values in raw patties, whereas IN and fat contributed to a decrease on these parameters. Higher contents of CMC resulted in products with lower weight loss (p < 0.05) with no significative diameter reduction (p > 0.05). Nonetheless, higher levels of CMC affected the sensory acceptance resulting on products described as crumbly and with residual flavor by …", "num_citations": "8\n", "authors": ["184"]}
{"title": "Nanocellulose films from amazon forest wood wastes: structural and thermal properties\n", "abstract": " The aim of this work was to determine the best fibrillation intensity that should be used to produce high crystalline and thermal stable microfibrillated cellulose (MFC) and nanocellulose films from C. goeldiana veneer wastes. The number of passages (cycles) of cellulose suspension tested in grinder were 10, 20, 30 and 40. Important properties to be analyzed included changes in morphology from the raw wood to the nanocellulose films, increases/decreases in cellulose crystalline index for inference on biomaterial strength, and thermal behavior changes to support conclusions on biomaterials processing and application possibilities. After chemical treatments for cellulose isolation, mechanical shearing was applied to produce cellulose nanostructures; hence nanocellulose films could be successfully produced from C. goeldiana wood wastes. Influence of more refining cycles on thermal properties, indicated higher …", "num_citations": "8\n", "authors": ["184"]}
{"title": "Estudo do processo de eletrocoagulação/floculação aplicado ao polimento de efluente doméstico\n", "abstract": " This paper proposed a wastewater polishing alternative by electrocoagulation / flocculation technique. The study investigated the application of this technology with two sets of electrodes, aluminum and carbon steel, polish the effluent from the treatment plant of Nova Metrópole, located in Caucaia, Ceará. The technique of application for wastewater treatment studies were carried out in bench level. In order to assess the technical and economic feasibility of the implementation of electrolytic polishing of wastewater stabilization ponds, tests were conducted in 4,0 L of electrolytic cells operating in batch, varying some settings, such as pH, stirring speed and the concentration of electrolyte. Based on COD reduction efficiency were determined the optimal settings for the set of electrodes where there was a greater removal of organic matter during the tests, from the Box-Behnken experimental design. It was noted that the optimal settings for the carbon steel electrodes were the initial pH 7,91, 210 rpm stirring speed and 0,5049 mg/L de NaCl electrolyte concentration, and 10 minutes reaction time. Under these conditions COD removals were obtained from 69,20% of BOD 89,29% and total phosphorus and total coliforms 100%, adjusting the effluent to launch in receiving body.", "num_citations": "8\n", "authors": ["184"]}
{"title": "Continuous-flow copper adsorption in regenerable calcined clay columns\n", "abstract": " Adsorption is currently recognized as an efficient and economical process for the treatment of toxic metals from wastewater. This process provides flexibility in the design and operation of treatment systems and in many cases generates a high-quality treated effluent. Furthermore, due to the reversibility of the adsorption adsorbents are sometimes regenerated by desorption suitable. Among the adsorbent materials, clays are characterized by their wide availability and low cost, which aggregates the potential they represent, especially when modified, resulting in scientific and industrial interest. Bentonite or smectite clays are widely used in industry, where applications are associated with their characteristic adsorbent and these properties can be improved by thermal and chemical treatments. Copper sorption behavior of calcined Bofe clay in consecutive adsorption–desorption cycles has been investigated in a packed-bed flow-through column during a continuous removal of copper from a 1.57 mmol/L aqueous solution at pH 5. The eluent used was HCl 0.1 mol/L. The adsorption and desorption were carried out for an average of 15 and 4 h, respectively, representing more than 2 days of continuous use of the adsorbent. The weight loss of mass after this time was 0.6%. The Cu-sorption capacity of the calcined clay, based on the initial dry weight, was approximately 0.11 mmol/g. Sorption performance was indicated by shortening breakthrough time and a broadening mass-transfer zone. The column useful time, considered up to 1 mg Cu/L in the effluent, keeping aproximately in 100 min for all cycles. The mass-transfer zone, decreased almost linearly …", "num_citations": "8\n", "authors": ["184"]}
{"title": "Organizational culture and success in SPI initiatives\n", "abstract": " To succeed, a software quality improvement (SQI) initiative must reflect organizational culture and the values that compose it. A study to define these values in software organizations includes proposals for implementing them.", "num_citations": "8\n", "authors": ["184"]}
{"title": "Pré e pós-tratamento por eletro-oxidação associada à fotocatálise heterogênea em uma ETA por filtração direta visando a redução dos precursores dos compostos organoclorados\n", "abstract": " This study evaluated the performance of the heterogeneous photocatalysis combined with electrooxidation compounding a hybrid photoreactor (contact time: 2.75; 5.5 and 11 min.) to pre-treat eutrophic water, comparing the use of chlorine (5 and 10 mg.L-1) and chlorine dioxide (1.2 mg.L-1), subjected to descending direct filtration (aluminum hydroxychloride at 5.4 mg.L-1 and polymer polyDADMAC at 2.0 mg.L-1). It was also evaluated the photoreactor in the post-treatment of water pre-oxidized with chlorine and chlorine dioxide. The photoreactor was equipped with Vacuum-UV sources (photoactivating immobilized TiO2) and set of metal electrodes (7.33 mA.cm-2). The quality of the treated water was analyzed regarding the reduction in concentration of organochlorine precursors, especially COD, chlorophyll-a, and the formation of total trihalomethanes and total haloacetic acids. The analyses followed the guidelines of the Standard Methods for Examination of Water and Wastewater (APHA, 2005). The photoreactor as an alternative for pre-oxidation has promoted the best mean results of removal reaching for turbidity 99.50%, 97.5% for the apparent color, 98.89% for chlorophyll-a, and 65.47% for COD. Meanwhile by using the chemical pre-oxidation, the removal of apparent color was 85.94% and 92.19%, with chlorine and dioxide chlorine, respectively. As regard with turbidity, the result with the use of chlorine was 95.57% and 96.23% with chlorine dioxide. For the COD, the result was 37.45% for chlorine and 49.45% with chlorine dioxide. In relation to chlorophyll, the removal reached 91.94% and 94.04%, with chlorine and dioxide chlorine …", "num_citations": "8\n", "authors": ["184"]}
{"title": "Anticoagulação oral em pacientes com fibrilação atrial: das diretrizes à prática clínica\n", "abstract": " OBJETIVO: Apesar da anticoagulação oral (ACO) ter benefício comprovado em pacientes com fibrilação atrial (FA) e fatores de risco embólico, ela vem sendo subutilizada. O objetivo desse estudo foi avaliar a adequação da terapêutica anticoagulante em pacientes com FA acompanhados em clínica especializada em cardiologia, privada, de acordo com as diretrizes das sociedades americana e europeia de cardiologia de 2006 e a diretriz da Sociedade Brasileira de Cardiologia (SBC) de 2003. MÉTODOS: No período de novembro/2005 a agosto/2006 foram avaliados 7.486 eletrocardiogramas e selecionados 53 pts com laudo de FA e informações claras relatadas em prontuário sobre fatores de risco embólico e terapêutica de ACO. RESULTADOS: Dentre os 53 pacientes incluídos (68±16 anos; 29 homens - 55%), 25 (48%) tinham HAS, 20 (38%) insuficiência cardíaca e 3 (6%) DM. Dentre os 15 pacientes com alto risco embólico, 13 (86%) estavam em uso de ACO. De acordo com a recomendação das diretrizes americana e europeia: 32 (60%) pacientes tinham indicação Classe I, 17 (32%) Classe IIa, 1 (2%) Classe IIb e 3 (6%) Classe III. Estavam adequadamente tratados 21 (66%) pacientes da Classe I e 13 (76%) pacientes Classe IIa. Nesse subgrupo, 7/19 (37%) pacientes com idade >75 anos estavam sendo anticoagulados, comparado a 22/30 (73%) daqueles com idade inferior (p=0,016). Dentre os três pacientes com indicação Classe III, um estava incorretamente com prescrição de anticoagulante. Pela diretriz da SBC, 33 (62%) recebiam terapêutica antitrombótica adequada. Não houve diferença na utilização correta de ACO …", "num_citations": "8\n", "authors": ["184"]}
{"title": "Constantino, guardador de vacas e de sonhos\n", "abstract": " Esta história simples ganhou raízes e deu fruto numa aldeia da região saloia, o Freixial, onde a sua gente me aconchega com carinho há mais de dez anos-e tanto como se eu fosse da família de cada um e de todos. Em certa medida o sou—valha a verdade!-, pois foi de Bucelas que os Alves emi-graram para a Borda de Agua, radicando-se em Vila Franca com bem vivas saudades da origem. Foi uma viagem também simples—um destes voos de pássaros calhandreiros que não se resignam a morrer na dor da fome. O meu avô era ferreiro, um moiro de trabalho, batia-lhe a todas as horas a mágoa de ver para ali sete filhos a mirar o saquitel do pão, e como por Vila Franca sempre havia gado para ferrar, mais canelos e ferraduras para moldar à forja e à bigorna, lá abalou com a mulher e a criançada toda.", "num_citations": "8\n", "authors": ["184"]}
{"title": "Redução no consumo de efluente gerado em abatedouro de tilápia do Nilo através da implantação de conceitos de produção mais limpa (P+ L)\n", "abstract": " A indústria alimentícia é um segmento que dispõe de alto consumo de água devido à necessidade da higienização dos estabelecimentos e a manutenção da boa qualidade do alimento. entre as indústrias alimentícias com maior consumo de água temos a indústria de pescado, a qual gera efluente em torno de 5, 4 m3. t-1 de peixe processado. este trabalho teve como objetivo a redução no consumo de água do processamento de tilápia do Nilo através da implantação de técnicas de P+ L, para tanto foram realizadas alterações hidráulicas nas mesas filetadoras visando o mínimo consumo possível de água para dois métodos de filetagem, eviscerado e não eviscerado, assim como a observação das alterações na qualidade do efluente gerado. No presente estudo, a redução no consumo de água na filetagem correspondeu a 98, 16% para o método EV considerando um tempo médio de processamento de 3 horas para 32, 99 kg de peixe, e para o método NeV a redução foi de 97, 97% com tempo médio de processamento de 2, 1 horas para 34, 96 kg de peixe, demonstrando assim que as técnicas de P+ L são eficazes para a redução do consumo de água.", "num_citations": "7\n", "authors": ["184"]}
{"title": "Recovery of pulmonary structure and exercise capacity by treatment with granulocyte-colony stimulating factor (G-CSF) in a mouse model of emphysema\n", "abstract": " Emphysema is a chronic obstructive pulmonary disease characterized abnormal dilatation of alveolar spaces, which impairs alveolar gas exchange, compromising the physical capacity of a patient due to airflow limitations. Here we tested the effects of G-CSF administration in pulmonary tissue and exercise capacity in emphysematous mice. C57Bl/6 female mice were treated with elastase intratracheally to induce emphysema. Their exercise capacities were evaluated in a treadmill. Lung histological sections were prepared to evaluate mean linear intercept measurement. Emphysematous mice were treated with G-CSF (3 cycles of 200 μg/kg/day for 5 consecutive days, with 7-day intervals) or saline and submitted to a third evaluation 8 weeks after treatment. Values of run distance and linear intercept measurement were expressed as mean ± SD and compared applying a paired t-test. Effects of treatment on these …", "num_citations": "7\n", "authors": ["184"]}
{"title": "Treatment of Sulfonated Azo Dye Reactive Red 198 by UV/H2O2\n", "abstract": " UV/H2O2 system was tested on the color removal of sulfonated azo dye Reactive Red 198 (RR), which is widely used in textile process. The effects of hydrogen peroxide concentration, temperature, pH, and the in-line addition of hydrogen peroxide on high color and chemical oxygen demand (COD) removals were investigated. The kinetic of dye decolorization was also determined. The results showed that 2% H2O2 decreased the process efficiency, while 1% H2O2 solution led to a better performance of the system. Despite the fact that the pH increase had small effect on color removal, it affects positively COD removals. The same behavior was found for temperature increase. A high temperature resulted in a slight decrease in color removal and a sharp decrease for COD removal. In addition the H2O2 in-line provided a small improvement in both color and COD removals. UV/1% H2O2 treatment was the most efficient, the good performance was linked to higher amount of hydroxyl radicals formed.", "num_citations": "7\n", "authors": ["184"]}
{"title": "Avaliação da capacitação da enfermagem para atendimento da parada cardiorrespiratória\n", "abstract": " Objetivo: avaliar o atendimento da enfermagem ao paciente em parada cardiorrespiratória. Método: estudo clínico epidemiológico realizado em hospital de ensino incluindo 50 profissionais da enfermagem, composto de três etapas: (1) observação do atendimento de 15 eventos de PCR pela enfermagem e análise de um questionário preenchido por 50 profissionais de enfermagem; (2) identificação da necessidade de treinamento e atualização de conceitos conforme protocolos internacionais desse atendimento; (3) observação de nove eventos de parada cardiorrespiratória para avaliar o impacto do treinamento para os 42 profissionais que foram treinados. O projeto foi aprovado pelo Comitê de Ética em Pesquisa, Protocolo 150/2007. Resultados: evidenciou-se melhora no atendimento, mas também foram detectados problemas. Conclusão: a Enfermagem deve participar de cursos de capacitação, periódicos e possuir atendimento de PCR padronizado para que este modelo seja adotado por outras unidades de internação.", "num_citations": "7\n", "authors": ["184"]}
{"title": "Comparison of a Shortened Isosorbide Dinitrate‐Potentiated Head‐Up Tilt Testing with the Conventional Protocol: Tolerance and Diagnostic Accuracy\n", "abstract": " Background:                      The head‐up tilt test (HUT) is widely used to investigate unexplained syncope; however, in clinical practice, it is long and sometimes not well tolerated.              Objectives:                      To compare the sensitivity, specificity, accuracy, and patients’ tolerance of a conventional and shortened HUT.              Methods:                      Patients with a history of vasovagal syndrome (VVS) were randomized to a conventional HUT (group I) consisting of 20‐minute passive tilt followed by 25 minutes after administration of sublingual isosorbide dinitrate (ISDN), or a shortened HUT (group II) where ISDN was given immediately after tilt and observed for 25 minutes. The control group consisted of age‐ and gender‐matched subjects without VVS symptoms. A specific questionnaire to evaluate tolerance was applied.              Results:                      Sixty patients (29 ± 10 years, 82% female) were included. In …", "num_citations": "7\n", "authors": ["184"]}
{"title": "Desulphuration of SO2 by adsorption in fluidized bed with zeolite\n", "abstract": " Desulphuration of SO2 experiments were carried out in a fluidized bed using a high ratio SiO2/Al2O3 zeolite as adsorbent. The SO2 adsorption efficiency on this zeolite was analyzed employing the hydrogen peroxide method. The desulphuration experiments were conducted using 16 grams of adsorbent and 2400 ppm of SO2. This ratio of adsorbent mass to SO2 concentration was determined by a Two-level Factorial Planning as the best condition for treating the gas in the fluidized bed. The experimental results permitted the determination of adsorption capacities and the equilibrium data of SO2 adsorption on silicalita zeolite. Comparatively the adsorption under fluidization is a faster process than in fixed bed. The dynamic adsorption isotherm obtained was well fitted by the Freundlich equation.", "num_citations": "7\n", "authors": ["184"]}
{"title": "A contribuição da Gestão de Design na valorização de grupos produtivos de pequeno porte vinculados a origem\n", "abstract": " Este trabalho tem por objetivo discutir como a Gestão de Design pode contribuir no processo de valorização de produtos e serviços de pequenos grupos. Apresenta e diagnosticar brevemente iniciativas que estão sendo desenvolvidas em diferentes contextos demonstrando de que forma é possível fortalecer as metas e estratégias competitivas, e consequentemente, proteger e promover culturas regionais", "num_citations": "7\n", "authors": ["184"]}
{"title": "The implementation of the self-calibration, self-compensation and self-validation algorithms for foundation fieldbus sensors are presented using standard function blocks\n", "abstract": " The oil industries are currently giving much attention to the precision of the BSW (Basic Sediments and Water) measurement. The increase of precision in the BSW measurement gives a more real value of the amount of oil that is being extracted, and this is why they are investing in researches about sensors and transmitters.One of the great problems in extraction fields is the deterioration of the sensors, which can make the sensor measurement precision decrease in time, until another calibration of the sensor is made. The lack of precision and the calibration process can be economically disadvantageous to the industries. Determining what is the best calibration period for a sensor is where the researches are most focused. With this purpose, some neural network based algorithms were created [5] to increase the precision and the reliability of the data collected by the sensors and to optimize the calibration periods. These algorithms are the self-compensation, self-calibration and self-validation. However, these algorithms need to be executed in an appropriate industrial environment, because they need a real time communication with the data provided by the sensor. A centralized industrial network is impracticable, because the communication speed is compromised and a network failure would make the execution of the intelligent algorithms impossible and the measurement control of the extraction field sensors would", "num_citations": "7\n", "authors": ["184"]}
{"title": "Influence of ZnO content in mixed oxides catalysts applied in the photocatalytic degradation of atrazine\n", "abstract": " Atrazine (2-chloro-4-ethylamino-6-isopropylamino-s-triazine) is an herbicide widely used in agricultural crops and has aroused worldwide concern for high potential pollution in soil, sediments, water and food. As the conventional methods for the persistent degradation of organic compounds are not very efficient, new technologies have been developed to remove those, especially those that use advanced oxidation processes (AOPs) and between AOPs, there is a heterogeneous photocatalysis. In this sense, the use of photocatalysts for water decontamination with organic materials is shown as an efficient alternative due to its oxidative properties. The photocatalytic process involves the activation by sunlight or artificial light of a semiconductor material, resulting in total or partial mineralization of these contaminants.", "num_citations": "6\n", "authors": ["184"]}
{"title": "A process-based approach to test usability of multi-platform mobile applications\n", "abstract": " In order to make a mobile application available to a wider audience, developers need to implement different versions on various mobile platforms. As consequence, the application needs to work properly in these platforms considering all quality characteristics. Usability is one of these characteristics that has direct impact on the success or failure of a mobile application. There are many studies that address mobile application tests, however they often do not handle multiplatform tests and also only cover few number of usability attributes used in mobile applications. In this paper, we propose a process-based approach that guides the activities related to usability testing in multiplatform mobile applications. To do that, specific guidelines and templates were proposed to support usability testing in a multiplatform environment. In addition, our approach comprises all seven usability attributes described in the …", "num_citations": "6\n", "authors": ["184"]}
{"title": "ARDev: a methodology based on scrum principles to support research management on software technologies\n", "abstract": " In this paper, we propose a methodology, called ARDev, based on Scrum principles to support research management. We evaluate the use of ARDev in two case studies of software technologies in order to discuss the methodological challenges involved in a research project and to provide support for others who conduct research on emerging technologies. From the case studies, we extracted insights according to the documentation analysis and participant observation. Finally, we used metrics to assess the productivity and impact of ARDev in the case studies. This paper concludes that ARDev can help to conduct all research cycle phases, thus indicating the feasibility of the Scrum principles in the research context.", "num_citations": "6\n", "authors": ["184"]}
{"title": "Motivating by examples: An empirical study of teaching an introductory software engineering course in Brazil\n", "abstract": " Educators in emerging and developing countries face the challenge of conveying international software engineering concepts within their local contexts, cultures and environments. In Brazil, where the local software industry is domestically focused, this becomes a factor in the development and expansion of the local software industries. This paper investigates the issue of localization of software engineering education in the context of using localized examples in the teaching of an introductory software engineering course in Brazil. Results from student questionnaires illustrate that the use of examples familiar to the students' environment increased student motivation, participation and general positive perception and attitudes towards the teaching material and the learning experience. This paper contributes empirical evidence to justify further research into contextualization and localization of software engineering …", "num_citations": "6\n", "authors": ["184"]}
{"title": "Removal of silver ions on calcined verde-lodo bentonite clay: Equilibrium study\n", "abstract": " The removal of heavy metals from industrial wastewater has been discussed in several research studies due its environmental and economic importance. Among the used methods, adsorption on bentonite clays has demonstrated a high removal potential for several metals ions. In this study, the component studied is silver since it is a valuable material commonly used in many industrial processes. The equilibrium study of silver adsorption onto calcined Verde-lodo bentonite was conducted in batch. Adsorption experiments were performed to study the adsorption capacity of Verde-lodo clay. Equilibrium isotherms were obtained in four different temperatures (273 K, 293 K, 313 K and 333 K) and fitted to Langmuir, Freundlich and DR models towards to evaluate adsorption and thermodynamic parameters. Different eluents were tested to verify their desorption capacity seeking the regeneration of the adsorbent. Then, a second adsorption cycle was performed in order to verify if the adsorbent has maintained its adsorption capacity.", "num_citations": "6\n", "authors": ["184"]}
{"title": "Chemical composition, bioactivities and kinematic viscosity of Cucurbita argyrosperma seed oil\n", "abstract": " The pumpkins belong to the genus Cucurbita and to the Cucurbitaceae family, endemic of the Americas and widely used for economic purposes. The outstanding species of pumpkins are Cucurbita argyrosperma, C. ficifolia, C. maxima, C. moschata and C. pepo (Heiden et al., 2007). The species C. argyrosperma is also known as C. mixta, which is a species native to Mexico and Central America. It is observed proximity of C. argyrosperma with C. moschata (Merrick et al., 1990). There are three cultivated varieties belonging to the C. argyrosperma species, of which Argyrosperma and Stenosperma were selected in the production of seeds. The third variety, Callicarpa, is used in the production of fruits and seeds, because it adapts easily (Merrick et al., 1990). In Brazil there are still no records in the scientific literature regarding the cultivation of C. argyrosperma (Barbieri et al., 2008). The fruits of Cucurbita vary in size, color, shape and weight. They have a firm and rigid shell, dense pulp and a central cavity that holds the seeds. The fruit has many seeds, which in turn has a high content of vitamins and proteins (Sousa et al., 2012). These pumpkins seeds, according to folk medicine, are used as vermifuge, due to the anthelmintic action (Cruz et al., 2006), as well as, it assists in the maintenance processes of epithelial tissue, maintenance of growth, reproduction, immunological mechanisms and antioxidant action, due to the presence of zinc, calcium and vitamins A and E (Bueno, Czepielewski,", "num_citations": "5\n", "authors": ["184"]}
{"title": "Characterisation of printed circuit boards of mobile phones discarded in Brazil\n", "abstract": " The characterisation of printed circuit boards (PCB) removed from discarded mobile phones in Brazil and an inventory of data of the components in PCB were accomplished in this paper. Data of chemical composition of PCB were obtained from the physicochemical characterisation of their components through the analysis of granulometry, scanning electron microscopy with energy dispersive x-ray detector (SEM/EDS), infrared spectroscopy (FT-IR) and inductively coupled plasma optical emission spectrometry (ICP-OES). The analysis allowed a broad view and a highlight for the wide variety of elements and heterogeneity of the material. It can be also highlighted the high amount of copper, lead and other high-value metals in the PCB. This study is relevant for the development of new recycling technologies, once this material has been discarded incorrectly in Brazil. Based on the percentage of mobile phones recycled and disposed in Brazil, it is possible to quantify financial loss resulting from incorrect disposal.", "num_citations": "5\n", "authors": ["184"]}
{"title": "Computerized system for detection of high impedance faults in MV overhead distribution lines\n", "abstract": " This paper presents a computerized system for detection of high impedance faults (HIF) in MV distribution feeders. This system has been developed in an R&D Project of AES Eletrpaulo. A HIF occurs when an energized conductor makes contact with objects with a high resistance and there are no significant increases in current. It is common to associate HIF to situations in which there is fallen primary conductor, creating risk of fatal accidents due its proximity to people. This is the main focus of this project. This type of fault cannot be detected by traditional overcurrent protection devices. The method developed herein relies on the use of variables obtained from power quality meters installed at the feeders in the substation, measuring quantities such as current harmonics, sequence components amongst others, with which some indices are calculated to detect the occurrence of a HIF event using artificial neural …", "num_citations": "5\n", "authors": ["184"]}
{"title": "Definition of an Architecture to Configure Artificial Neural Networks Topologies Using Partial Reconfiguraton in FPGA\n", "abstract": " Artificial Neural Networks (ANNs) competence in generalization and reconfigurable hardware using provide a solid base to developing critical embedded systems, capable of efficiently adapt itself as requirements change. Different level adaptation, from physical level up to system level, can be combined to provide efficient solutions using FPGA. So, this work aims to define a novel architecture to configure ANNs topologies using partial FPGA reconfiguration. NEURON block has been described using fixed-point notation and applying partial reconfiguration to load partial bitstreams of sigmoid and hiperbolic tangent functions, as well as dynamically inserting and removing NEURON blocks on the net, this way it is possible to configure MultiLayer Perceptron (MLP) networks with different topologies, using partial bitstreams in reconfigurable areas. It is conceived that, using this kind of hardware facilitates embedding …", "num_citations": "5\n", "authors": ["184"]}
{"title": "Genetic variability and resistance of cultivars of cowpea [Vigna unguiculata (L.) Walp] to cowpea weevil (Callosobruchus maculatus Fabr.)\n", "abstract": " The cowpea weevil (Callosobruchus maculatus Fabr.) is the most destructive pest of the cowpea bean; it reduces seed quality. To control this pest, resistance testing combined with genetic analysis using molecular markers has been widely applied in research. Among the markers that show reliable results, the inter-simple sequence repeats (ISSRs)(microsatellites) are noteworthy. This study was performed to evaluate the resistance of 27 cultivars of cowpea bean to cowpea weevil. We tested the resistance related to the genetic variability of these cultivars using ISSR markers. To analyze the resistance of cultivars to weevil, a completely randomized test design with 4 replicates and 27 treatments was adopted. Five pairs of the insect were placed in 30 grains per replicate. Analysis of variance showed that the number of eggs and emerged insects were significantly different in the treatments, and the", "num_citations": "5\n", "authors": ["184"]}
{"title": "Determinação do número mínimo de saltos verticais para monitorar as respostas ao treinamento pliométrico\n", "abstract": " O objetivo deste estudo foi identificar o número de saltos necessário para monitoramento das respostas ao treinamento pliométrico. Foram selecionados 44 homens, com idade média de 23.3±3.3 anos, estatura 176.0±7.3 cm e massa corporal 73.7±6.7 kg. Todos os voluntários participaram das etapas de familiarização, confiabilidade e avaliação pré-treinamento. Em seguida os participantes foram aleatoriamente distribuídos nos grupos treino e controle. O grupo treino realizou 6 semanas de treinamento pliométrico monitorado. O monitoramento foi realizado a partir do desempenho em 8 saltos com contramovimentos realizados no início das sessões. Após seis semanas de treinamento, todos os voluntários foram reavaliados na etapa pós-treinamento. Para identificação do número de saltos necessário para monitoramento, os resultados obtidos nos 3, 4, 5, 6 e 7 primeiros saltos foram comparados com os resultados do monitoramento realizado com 8 saltos. A estatística utilizada foi a one-way ANOVA e post hoc de Tuckey. Houve aumento significativo na altura do salto com contramovimento apenas no grupo treino (10.2%). Observa-se que o resultado dos 3 primeiros saltos apresentou diferença significativa em relação às respostas obtidas com 8 saltos. Concluiu-se que são necessários 4 saltos com contramovimentos para monitorar as respostas ao treinamento pliométrico.", "num_citations": "5\n", "authors": ["184"]}
{"title": "Índices de estresse oxidativo em sujeitos com diferentes níveis de composição corporal e aderência a prática de atividade física\n", "abstract": " ANTUNES NETO, JMF; PAULA, LB Índices de estresse oxidativo em sujeitos com diferentes níveis de composição corporal e aderência a prática de atividade física. Brazilian Journal of Biomotricity, v. 5, n. 2, p. 117-131, 2011. As espécies reativas de oxigênio (EROs) são derivadas de fontes exógenas ou produzidas endogenamente, como conseqüência normal das funções celulares. O desbalanço causado pelo excesso na produção destas espécies associado à queda na capacidade antioxidante celular provoca o que chamamos de estresse oxidativo; um processo que gera, sobretudo, alterações nas membranas celulares e nas estruturas dos genes, em circunstâncias extremas. O objetivo deste trabalho consistiu em investigar o potencial de estresse oxidativo em sujeitos obesos sedentários, já que a obesidade tornou-se um problema de saúde pública, sobretudo em países industrializados. Participaram do estudo 30 voluntários do sexo masculino (26, 6±3, 5 anos) e foram divididos em três grupos, de acordo com composição corporal e estilo de vida ativo: grupo sedentário com índice de massa corpórea (IMC) normal (IMC-NS), n= 10; grupo sedentário com IMC elevado (IMC-ES), n= 10; e grupo praticante de atividade física com IMC normal (IMCNPAF), n= 10. As análises foram divididas em antropométricas–IMC, pressão arterial, relação cinturaquadril e percentual de gordura; bioquímicas–dosagem de hemoglobina; marcadores antioxidantes–catalase (CAT) e grupamentos sulfidrila totais (GST); marcadores oxidantes–substâncias reativas ao ácido tiobarbitúrico (TBARs); e marcadores de alteração celular–creatina quinase (CK). Os …", "num_citations": "5\n", "authors": ["184"]}
{"title": "Producir conservando y conservar produciendo: marco para la educación e investigación en ecología económica\n", "abstract": " Los países de América Latina enfrentarán en lo que queda de está década una serie de retos en el campo de la producción y la conservación de los recursos naturales, que sin duda alguna requerirán de profunda reflexión, investigación y, sobre todo, recursos humanos altamente capacitado. El principal reto de las instituciones regionales de enseñanza e investigación en el campo de los recursos naturales en general ideas, sistemas, metodologías, y personas que sean capaces de facilitar que las sociedades puedan mejorar su nivel de vida y convivir armonía con su medio ambiente. El propósito de este artículo es presentar en forma resumida los cambios que se han producido en la sociedad regional y base en esto la importancia de incluir aspectos socioeconómicos a la investigación y enseñanza ambiental. A continuación se presenta bases conceptuales dentro de las cuales el Centro Agronómico …", "num_citations": "5\n", "authors": ["184"]}
{"title": "Corpus CEFALA-1: base de dados audiovisual de locutores para estudos de biometria, fonética e fonologia/corpus CEFALA-1: audiovisual database of speakers for biometric …\n", "abstract": " A fala humana tem sido estudada em diferentes áreas do conhecimento, as quais incluem desde biometria até fonética e fonologia. Nas pesquisas realizadas em tais áreas, amostras da fala são recursos necessários para a obtenção de resultados e validação de hipóteses. Para isso, amostras de diferentes locutores e conteúdos são armazenadas em arquivos de áudio e organizadas em bases de dados. Tais bases de dados permitem a continuidade, praticidade e confiabilidade de pesquisas, eliminando a difícil e demorada etapa de coleta de dados. Além disso, permitem comparações consistentes entre estudos diferentes. Entretanto, bases de acesso livre na língua portuguesa ou gravadas em ambiente controlado são raramente encontradas. Dessa forma, o objetivo deste trabalho foi construir uma base de dados pública e gratuita do português brasileiro, nomeada Corpus CEFALA-1. A base de dados reúne 104 locutores orientados por um protocolo específico para coleta de amostras audiovisuais de fala gravadas em estúdio. Este trabalho apresenta as metodologias de processamento, segmentação e organização às quais as amostras de fala foram submetidas, além de análises estatísticas, aplicação à verificação biométrica e análises fonético-fonológicas preliminares do corpus.", "num_citations": "4\n", "authors": ["184"]}
{"title": "Licenciamento ambiental e outorga do direito de uso da água para a atividade aqüícola: Há integração entre os instrumentos?\n", "abstract": " As políticas aqüícolas nacional e internacional encontram-se em momento de desenvolvimento, visando ao aumento da produtividade do setor e ao seu crescimento sustentável. Neste sentido, faz-se necessária a elaboração de planos e políticas que conduzam o desenvolvimento sustentável da atividade. Recentemente, a aqüicultura mereceu atenção quanto aos seus aspectos legais, principalmente no que diz respeito ao licenciamento e outorga. Assim, este trabalho tem como objetivo discutir a legislação aqüícola quanto ao licenciamento e outorga, instrumentos estes da PNMA e PNRH, respectivamente.", "num_citations": "4\n", "authors": ["184"]}
{"title": "Research letters\n", "abstract": " A cross-sectional study was conducted to measure the prevalence of hypertension among 310 rural school children in Tamil Nadu. The prevalence of hypertension and pre-hypertension was 10% and 14.2%, respectively. Prevalence was significantly higher among and private school students. We recommend that children should be screened for hypertension for early diagnosis and prevention of complications.", "num_citations": "4\n", "authors": ["184"]}
{"title": "Discursos de genética em livro didático: implicações para o ensino de biologia\n", "abstract": " Considerando a importância do livro didático, que muitas vezes apresenta-se como único recurso didático disponível para professores e alunos, e considerando ainda que o livro didático apresenta-se muitas vezes como a principal ponte entre as Ciências (Físicas e Biológicas) e seus modos de ensino (no caso, disciplinas escolares como a Biologia), nesse trabalho procuraremos pensar sobre algumas questões que permeiam a linguagem do livro didático, mais especificamente no que se refere aos discursos de Genética. Nossos olhares se voltam a essa área da Biologia devido à importância adquirida nos últimos anos pelas inovações científicas e tecnológicas, principalmente no que toca a Biologia Molecular e Biotecnologia (Nova Biologia), temas que passaram a ocupar diferentes espaços, entre eles a escola, as mídias e os materiais didáticos. Propomo-nos então, a pensar em uma perspectiva discursiva sobre temas socialmente relevantes que se encontram em discussões morais, éticas, políticas e econômicas, em várias esferas sociais. Utilizamos como referencial teórico-metodológico, para pensar nos discursos sobre Genética Moderna, a Análise do Discurso de linha francesa, em especial as (re)leituras de Eni Orlandi. Analisamos três livros, voltados ao Ensino Médio, pertencentes à coleção didática de Biologia mais utilizada no Brasil, segundo o Programa Nacional do Livro Didático (PNLD) de 2015. Nossos resultados indicam uma insuficiente abordagem sobre os discursos relacionados à Nova Biologia, havendo uma grande predominância de temas sobre Genética Clássica. Além disso, observamos que, apesar da …", "num_citations": "4\n", "authors": ["184"]}
{"title": "O uso da cavitação hidrodinâmica aplicado ao tratamento de água\n", "abstract": " A cavitação hidrodinâmica se apresenta como um processo oxidativo avançado (POA), permitindo integrar-se aos processos de tratamento de água para consumo humano. Esta pesquisa teve como objetivo investigar os efeitos de diferentes reatores de cavitação hidrodinâmica para tratar água contaminada com esgoto doméstico, avaliando a contaminação microbiológica e os parâmetros físico-químicos. Foram construídos três modelos de reatores com diferentes rotores (R1, R2 e R3). Os resultados obtidos nos reatores R1, R2 e R3 mostraram redução nas concentrações dos parâmetros químicos em todas as amostras, particularmente nitritos, nitratos, bicarbonatos e dureza total, ao passo que a contaminação microbiológica teve inativação completa dos microrganismos estudados (coliformes totais e Escherichia coli).", "num_citations": "4\n", "authors": ["184"]}
{"title": "ANALYSIS OF SILVERS ADSORPTION ON CALCINED VERDE-LODO CLAY\n", "abstract": " The removal of heavy metals from wastewater has become an important subject for scientific research. Among the common methods, adsorption has shown good potential to treat contaminated effluents. In this study, the thermally treated clay called “Verde-lodo” was used in the adsorption of silver ions, a metal with wide industrial use and high commercial value. Firstly, the process kinetics was studied in different silver concentrations. The kinetic curves were adjusted by the following models: pseudo-first order, pseudo-second order, intra-particle diffusion, Boyd and mass transfer in the extern film models. The adsorbent before and after process was characterized by the techniques: BET and Helium Pycnometry.", "num_citations": "4\n", "authors": ["184"]}
{"title": "Morfometria testicular de cabritos alimentados com óleo de licuri (Syagrus coronata)\n", "abstract": " Determinou-se o desenvolvimento testicular de caprinos pré-púberes alimentados com óleo de licuri (Syagrus coronata) na dieta. Foram utilizados 19 cabritos ¾ Boer, recém-desmamados, com média de idade de três meses. Os animais, submetidos a um período de 75 dias de confinamento, receberam alimentação composta por: farelo de milho, farelo de soja, feno picado de tifton 85 e de óleo de licuri com base na matéria seca. Os animais foram distribuídos em quatro grupos: sem lipídio adicional (n= 5); com 1,5% de óleo de licuri (n= 5); com 3,0% de óleo de licuri (n= 5); e com 4,5% de óleo de licuri (n= 4). As avaliações de peso corporal e de biometria testicular foram realizadas quinzenalmente. Após o período de confinamento, os animais foram abatidos para determinação do peso dos testículos, peso dos epidídimos e índice gonadossomático. A adição de óleo de licuri em até 4,5% na dieta de caprinos pré-púberes não alterou o desenvolvimento testicular com base nas características da biometria e morfometria testicular, indicando que a inclusão de até 4,5% de óleo de licuri na dieta pode ser utilizada.", "num_citations": "4\n", "authors": ["184"]}
{"title": "Estudo do Comportamento em Fadiga de ligas de Alumínio endurecidas por precipitação\n", "abstract": " Neste trabalho foram investigadas as propriedades mecânicas em tração e em fadiga das ligas Al-Cu 2011-T3 e Al-Mg-Si 6351-T8. Ambas as ligas na condição como recebida (solubilizadas, encruadas e envelhecidas) apresentaram valores similares de limite de escoamento, limite de resistência, de dureza e de alongamento. Os ensaios de fadiga mostraram que para tensões mais elevadas os comportamentos em fadiga das ligas 2011-T3 e 6351-T6 são similares. Entretanto, para baixas tensões a liga 2011-T3 tem um comportamento em fadiga superior ao apresentado pela liga 6351-T6. As superfícies de fratura de corpos-de-prova das ligas 2011-T3 e 6351-T6 fraturadas com tensão elevada mostraram basicamente a presença de microcavidades com precipitados no seu interior. As superfícies de fratura de corpos-de-prova das ligas 2011-T3 e 6351-T6 fraturadas com tensão baixa apresentaram trincas iniciadas ao longo de toda a superfície do corpo-deprova que se propagaram até a região central onde ocorreu a ruptura por sobrecarga mecânica.", "num_citations": "4\n", "authors": ["184"]}
{"title": "Integrando conhecimentos, aproximando disciplinas: a importância do Design e da Ergonomia no projeto e no desenvolvimento de softwares educacionais\n", "abstract": " O objetivo deste artigo é apresentar à comunidade que desenvolve softwares educacionais algumas técnicas e princípios ergonômicos e de design, que têm a importante função de integrar os conhecimentos dos diversos membros da equipe e dos usuários. É sustentado que o papel do design não se resume à especificação gráfica dos componentes da interface, da mesma forma que a Ergonomia não se resume ao emprego de checklists. Desta forma, será feito um panorama de técnicas e procedimentos, organizados em relação ao momento indicado ao uso: projeto, implementação e avaliação.", "num_citations": "4\n", "authors": ["184"]}
{"title": "An efficient approach of the SOM algorithm to the traveling salesman problem\n", "abstract": " This paper presents an approach to the well-known traveling salesman problem (TSP) via competitive neural networks. The neural network model adopted in this work is the Kohonen network or self-organizing maps (SOM), which has important topological information about its neurons configuration. This paper is concerned with the initialization aspects, parameters adaptation, and the complexity analysis of the proposed algorithm. The modified SOM algorithm proposed in this paper has shown better results when compared with others neural network based approaches to the TSP.", "num_citations": "4\n", "authors": ["184"]}
{"title": "Characterization of Sintered and Sintered/Plasma-Nitrided Fe-1.5% Mo Alloy by SEM, X-Ray Diffraction and Electrochemical Techniques\n", "abstract": " Electrochemical experiments together with SEM and X-Ray techniques were carried out in order to evaluate the corrosion resistance, to analyze the surface condition and to characterize the nitride layer of the sintered and sintered/plasma-nitrided Fe-1.5% Mo alloy in Mg(NO3)2 0.5mol.L-1 solution (pH 7.0). The sintered/plasma-nitrided samples presented a higher corrosion resistance, indicating that the surface treatment improved the electrochemical properties of the sintered material. In addition, the nitride layer formed at 500 °C showed better corrosion resistance that the layers formed at higher temperatures. This difference can be ascribed to the nitrogen content in the nitride layer, which at 500°C is higher due to the formation of a phase rich in nitrogen (epsilon phase) while at higher temperatures a phase poor in nitrogen (gamma' phase) is formed.", "num_citations": "4\n", "authors": ["184"]}
{"title": "New approach in partial cavopulmonary connection\n", "abstract": " The development of pulmonary atteriovenous fistulas after bidirectional cavopuomonary operat-tions, such as the bidirectional Glenn shunt and Kawashima's procedure, has raised concern. Development of these fistulas, which are more frequent than initially thought, can represnt a limiting factor in the late outcome of these patients and may even limit the indication for these of surgery. Whether the fistulas can be reversed by transforming the surgical procedures has yet to be established. In the hope of avoiding this kind of complication, thought to be caused by the lack of passage of a hypothetical hepatic factor through the pulmonary circulation. wedevelped an inverred type of gidirectional cavopulmonary connection in which the blood coming from the liver perfuses immediately both lungs. This is made possi-ble by shuntiong via an intra-atrial tunnel the blood from the superior caval vein directly to the left atrium …", "num_citations": "4\n", "authors": ["184"]}
{"title": "THERMODYNAMIC ANALYSIS OF BEHAVIOUR IN A COMBINED CYCLES OPERATING WITH BIOGAS AND MUNICIPAL SOLID WASTE\n", "abstract": " The research and development of technologies using wastes have been advanced over the last decades. Along these lines, the use of biogas from landfills, and Municipal Solid Waste (MSW) as fuel has a relevant role in the context of energy generation and environmental protection. The use of MSW as fuel to produce energy has the advantage to abate the use of landfills, which are responsible for problems such as space loss and sanitation that large cities have to deal with. However, the MSW and biogas available in landfills have been used individually to generate power, or in systems where energy conversion is in development. Thus in this research the choosing of the technology that better fits in thermal conversion systems, using MSW and biogas, was carried out. The main technologies of thermal conversion of MSW, including gasification, pyrolysis, and incineration, were verified. Among the technologies above, incineration is the most and its present used in huge-sized facilities in the world. Regarding the most used technologies for thermal energy conversion of biogas, combustion in boilers, or engines and small turbines, can be addressed. Therefore, it is possible to verify that most of those systems can use many kinds of fuels; furthermore, there are many options to combine these technologies, for instance, using Combined Cycles. The present work aims to perform a thermodynamic analysis (energy and exergetic analyses) of a Combined Cycles composed of the internal combustion engine to burn biogas, and a gasification system of MSW combined with a system to burn syngas to produce steam and operate in a Rankine cycle …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Starch: Pectin Acidic Sachets Development for Hydroxyapatite Nanoparticles Storage to Improve Phosphorus Release\n", "abstract": " Abstract                 The importance of fertilizers in boosting crop production has motivated the development of novel high-performance systems capable of improving the phosphorus release in the soil. For instance, methods capable of increasing the surface area of fertilizer particles and promoting the solubilization of low-solubility compounds, including phosphates, are highly pursued. This study was aimed at synthesizing hydroxyapatite nanoparticles and investigating their solubility in relation to crystallinity, size, and morphology for phosphorous fertilizer applications. To improve the phosphate ions release, the hydroxyapatite nanoparticles were storage in biodegradable sachets composed of thermoplastic starch/pectin blends with different polymer ratios. The results showed that the smallest and less crystalline hydroxyapatite nanoparticles presented the highest solubility. After storage in polymeric …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Effect of the dry needling vs manual myofascial therapy at the trigger points in temporomandibular dysfunction\n", "abstract": " Introduction: The etiology of Temporomandibular Dysfunction (TMD) is multidimensional, considering biomechanical, neuromuscular and biopsychosocial . TMDs are defined in subgroups as problems involving temporomandibular joint (TMJ), masticatory system muscles, and musculoskeletal structures associated with the head and neck . The most relevant signs of TMD are the presence of joint sounds (clicking and crepitation), reduced mouth opening, and disrupted jaw movements. However, pain is the primary problem of this pathology, and it is typically the reason these patients request medical care . The muscular etiology TMD includes the myofascial pain syndrome, which is characterized by the presence of trigger points (TP). The intervention of physical therapy in TP involves myofascial manual therapy and dry needling . The purpose of this study was to investigate the effect of physiotherapy technique for the …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Company health in mobile software ecosystem (mseco): Research perspectives and challenges\n", "abstract": " This paper presents initial perspectives in the searchfor diagnosing the health of a Mobile Software Ecosystem(MSECO) company. The research intends to investigate a companys health through user reviews about mobile applications (Apps)and build and present indicators that can identify problems, failures and differences in the quality of the apps to guide thecompany in the search for \"immunization\" or \"medication\" sothat it does not become \"sick\" from the adoption of measuresrelated to the use of indicators for the type of \"disease\".", "num_citations": "3\n", "authors": ["184"]}
{"title": "Temperature and pre-germinative treatments for overcoming Acacia farnesiana (L.) Willd.(Fabaceae) seeds dormancy\n", "abstract": " Acacia farnesiana L. is a species known for its uses in recovery of degraded pastures, animal feeding, medical and fungicide properties. However, it is one of the most problematic invasive species in agriculture, due to the little known dormancy aspects of its seeds that results in the propagation and dispersion to distinct areas and the establishment of the invasive plant. The knowledge on ecophysiological characteristics of invasive species seeds aiming at the dormancy process is important for the comprehension of aggressive regeneration unities, and allows the development of strategies against infestation of new areas and reduction of soil seed banks. The objective of this research was to assess how A. farnesiana seeds overcome dormancy using different temperatures and pre-germinative treatments. The study was conducted in Federal University of Paraiba, using seeds obtained from fruits of ten matrix trees in …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Tapn: Test automation’s pyramid of needs\n", "abstract": " Testing is an essential activity to ensure quality of software systems, but it is expensive and time consuming. Thus, testing automation would be an alternative to improve test productivity and save costs. However, many organizations refuse to use test automation or had failed on implement it because they do not know how to deal with the implementation of a test automation strategy fitted to their goals and expectations. Most of them underestimate or have no knowledge about test automation factor of success. In addition, although there are many works and maturity models focused on improving the testing process, few ones focus on test automation issues. The main contribution of this paper is to propose a hierarchical model called Test Automation’s Pyramid of Needs (TAPN). TAPN is inspired in the Maslow’s Pyramid of Needs administration theory and it comprises five levels that influence on the success of test automation initiatives in software organizations. TAPN intends to help organizations to build their test automation strategy using good practices in test automation captured from the technical literature.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Evaluation of energetic metabolism of horses in long-distance exercise: Accutrend® Plus versus laboratory\n", "abstract": " The use of human equipment in veterinary medicine is very common; therefore, it is essential that it is tested and validated. In this study, a comparison was made between blood levels of glucose, lactate, triglycerides, and cholesterol obtained by the portable device Accutrend® Plus and those found in laboratory methods considered standard for the measurement of parameters of 11 Arabian (and Arabian crossed) horses which completed prolonged endurance effort. Collection was made in five stages: during rest, after 66 km, at the end of the race of 160 km, and 2 and 15 h after the race. Three venous blood samples were collected, the first being used immediately for the measurement of the parameters on the portable device and the other two—with sodium fluoride and without anticoagulant—were packed and immediately sent to a reference laboratory. Statistical analysis consisted of the Student’s t test …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Avaliando a Cobertura do MRMPS-SV para o Alinhamento Estratégico de TI e Negócios das Organizações\n", "abstract": " Ensuring that the Information Technology is aligned and provide support to business is essential for the organization's success. Initiatives such as MR-MPS-SV have been used by organizations that seek the improvement of their services processes mainly focusing on the satisfaction of the business needs. By checking how the MR-MPS-SV covers maturity criteria of strategic alignment, this study identified that the MR-MPS-SV is an in-depth vehicle for the organizations to align IT and business, through the search for improvement of their processes of IT services. In addition, the results obtained also enable to recognize MR-MPS-SV competences leading to the business-IT alignment and identify opportunities to improve them.Resumo. Garantir que a Tecnologia da Informação esteja alinhada e forneça suporte para os negócios é essencial para o sucesso das organizações. Iniciativas como a do MR-MPS-SV têm sido utilizadas por organizações que buscam a melhoria de seus processos de serviços, principalmente com foco na satisfação das suas necessidades de negócios. Por meio da verificação de como os processos do MR-MPS-SV cobrem critérios de maturidade de alinhamento estratégico, este estudo identificou que o MR-MPS-SV é um veículo abrangente para que as organizações consigam alinhar a TI aos negócios, através da busca de melhoria dos seus processos de serviços de TI. Adicionalmente, os resultados obtidos também possibilitam reconhecer competências do MR-MPS-SV voltadas ao alinhamento estratégico de TI e negócios e identificar oportunidades para melhorá-las.", "num_citations": "3\n", "authors": ["184"]}
{"title": "ESTUDO DO COMPORTAMENTO DA EFICIÊNCIA DE DEPOSIÇÃO DA LIGA Co-W UTILIZANDO PLANEJAMENTO EXPERIMENTAL.\n", "abstract": " Uma das formas que mais contribui para o desgaste dos metais é sem dúvida a corrosão. O controle e estudo para minimizar os efeitos causados por esse processo são essenciais. A eletrodeposição é um dos métodos mais importantes de deposição metálica para a produção comercial de películas protetoras. O desenvolvimento de banhos estáveis com adequados níveis de pH, temperatura, concentração de reagentes e densidade de corrente são de fundamental importância para obter depósitos de boa qualidade e resistente a corrosão. Este trabalho estudou o efeito da concentração de sulfato de cobalto, temperatura do banho e densidade de corrente para obtenção de deposito da liga Co-W. Para o estudo proposto, dentro da faixa de variáveis utilizadas, a maior porcentagem de deposição encontrada foi de 86, 61%, utilizando concentração de sulfato de cobalto 0, 3 mol/L, temperatura de 25 C e densidade de corrente igual a 10 mA/cm 2. As ligas obtidas apresentaram boa aderência e brilho metálico.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Estudo de fibras de folhas de abacaxis (gênero ananas) e sua utilização em compósitos biodegradáveis com matriz de poli (acido lático)(PLA)\n", "abstract": " Este trabalho estudou fibras das folhas de diferentes variedades de abacaxis na utilização como reforço mecânico em compósitos poliméricos. Foram caracterizadas fibras de folhas (PALF) de 18 variedades de abacaxis. As fibras tiveram sua morfologia, arranjo estrutural (índice de cristalinidade da celulose (Ic) e ângulo microfibrilar), constituintes químicos (teores de extrativos, lignina, holocelulose, celulose e hemicelulose), propriedades mecânicas (resistência à tração, módulo elástico e alongamento na ruptura) e propriedades térmicas caracterizados. Os pequenos valores do ângulo microfibrilar e maiores valores de Ic indicam que PALF são promissores como reforço mecânico. Os valores do módulo elástico, resistência à tração e temperatura onset de degradação variam de 15 a 86GPa, 212 a 1309MPa, 240 a 272oC respectivamente, indicando que as dezoito variedades de fibras são aptas para aplicação como reforço mecânico em compósitos poliméricos. Foram observadas correlações diretamente proporcionais entre a celulose, holocelulose e Ic com as propriedades térmicas e mecânicas. Estas correlações fornecem indicadores para seleção direta e/ou programa de melhoramento genético do gênero Ananas, com intuito de se desenvolver plantas para utilização de suas fibras como reforço mecânico em compósitos poliméricos. Foi apresentada metodologia para seleção de fibras vegetais a serem utilizadas como reforço mecânico em compósitos. Foi selecionada a variedade denominada “Potyra”, para fornecer fibras, a fim de produzir compósitos biodegradáveis moldados por injeção, com uma matriz de poli (ácido lático …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Recomendações de melhoria baseadas na cultura organizacional para iniciativas em melhoria de processo de software\n", "abstract": " Organizational culture is one of the most important success factors of an organization because it provides both the supporting background and the strategic direction. In the context of software organizations, organizational culture has been observed in scientific research as one of the critical factors for successful implementation of software process improvement initiatives. Therefore, it is important to analyze the impact of organizational culture on the adoption/ implementation of these initiatives. Thus, the scientific methodology adopted to conduct this research was based on secondary and primary studies. Firstly, this work identified several typological models for the analysis of organizational culture and extracted the key organizational values that comprise the selected typological models. From the results, we carried out a survey on which organizational values are important to define the organizational culture of a software organization, and the level of importance of each value to a software organization that is involved in an initiative for software process improvement. In this research, we also identified recommendations for improvement, based on organizational culture, in the context of software process improvement initiatives. Nonetheless, a new survey, conducted with experts on software process improvement, was performed to relate these recommendations for improvement with the identified organizational values. From the results obtained in these studies, we developed a conceptual framework that based on the analysis of organizational culture (through organizational values) obtained from a software organization, suggests …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Evolução e religião: perspectivas e reflexões de uma prática docente a partir de uma dualidade histórica\n", "abstract": " O ensino de evolução por si só já é algo complexo, visto que é uma área da biologia de grande abrangência, em que se faz necessário uma grande quantidade de conhecimentos para sua compreensão. A própria realidade de ensino brasileira, com déficit tanto em estrutura, quanto na formação de professores, agrava ainda mais o quadro de dificuldades de seu ensino. Além das dificuldades mencionadas, ainda é necessário levar em consideração às visões e realidades de alunos e dos próprios professores, que muitas vezes se encontram mais próximos de valores religiosos ou científicos e acabam por separar ideologicamente nas salas de aula as duas visões. De forma a tentar superar essa segregação da religião e da ciência, esse trabalho tem por objetivo demonstrar uma experiência em sala de aula, onde através da perspectiva religiosa dos alunos tenta-se chegar à construção de conhecimentos de evolução.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Fotocatálise Heterogênea associada a eletro-oxidação no pré-tratamento de água eutrofizada em uma estação piloto de tratamento de água\n", "abstract": " A pré-cloração é uma prática realizada em muitas ETAs visando à redução da carga orgânica. Entretanto, essa prática leva a formação de subprodutos clorados considerados carcinogênicos. Tal fato tem suscitado o interesse no desenvolvimento ou aperfeiçoamento de técnicas que possam eliminar ou reduzir o uso das pré-oxidações químicas. Neste contexto surgiu o interesse no tema de pesquisa aqui estudado, que tem como objetivo, investigar, na pré-oxidação de água, o desempenho da eletroxidação associada à fotocatálise heterogênea (fotoreator) comparado ao emprego do cloro e dióxido de cloro, avaliando a qualidade da água tratada, em termos de DQO, Clorofila “a”, turbidez e a formação de trihalometanos. Após pré-oxidadas, as amostras foram submetidas à coagulação com HCA (5.4 mg. L-1), polímero catiônico (2.0 mg. L-1), filtração direta descendente e pós-cloração (5.0 mg. L-1). As coletadas foram realizadas com 30 e 90 minutos após o início da carreira de filtração e as análises seguiram as diretrizes gerais do Standard Methods for Examination of Water and Wastewater. Os resultados médios de remoção para turbidez alcançaram 95.57%(com cloro), 96.23%(com dióxido de cloro) e 99.5%(com o fotoreator). Para DQO obteve-se remoção média de 37.45%(cloro), 49.45%(dióxido de cloro) e 65, 5%(fotoreator). A remoção média de clorofila “a” foi de 91.94%(cloro), 94.04%(dióxido de cloro) e 98.97%(fotoreator). Para formação de Trialometanos Totais obteve-se 104.07 μg. L-1 (cloro) e 88.85 μg. L-1 (dióxido de cloro). Com o uso do fotoreator obteve-se 77.20 μg. L-1, mostrando-se capaz de produzir, constantemente …", "num_citations": "3\n", "authors": ["184"]}
{"title": "TestCheck–Uma Abordagem Baseada em Checklist para Inspecionar Artefatos de Teste de Software\n", "abstract": " A qualidade dos testes aplicados em um projeto de software é um fator determinante para a qualidade do produto final. Este artigo apresenta uma abordagem baseada em checklist, TestCheck, para inspeção de artefatos de teste de software (planos, casos e procedimentos de teste). São descritos os passos seguidos para a construção de TestCheck e os resultados de estudos experimentais que avaliaram a eficiência e eficácia da abordagem para detecção de defeitos. Os resultados indicam que os checklists propostos possibilitam a identificação de defeitos, e que esta abordagem apresenta melhores resultados quando comparada a uma abordagem ad-hoc.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Atividade residual de diuron, oxyfluorfen e prometryne no controle de Euphorbia heterophylla\n", "abstract": " As aplicações de herbicidas em pré-emergência têm por finalidade a obtenção da atividade residual no início do ciclo das culturas. Assim, o objetivo deste trabalho foi avaliar a atividade residual dos herbicidas diuron, oxyfluorfen e prometryne, aplicados isoladamente ou em misturas, no controle de Euphorbia heterophylla. Oito experimentos foram conduzidos em casa de vegetação, aplicando-se doses dos herbicidas ou das misturas aos 30, 20, 10 e 0 dias antes da semeadura da planta daninha (DAS). Com o diuron e prometryne, foram observados controles satisfatórios até 20 DAS nas doses a partir de 1,07 e 1,6 kg ha-1, respectivamente. Quanto ao oxyfluorfen, foi registrado um período residual inferior, obtendo-se controle mínimo de 80% até 10 DAS nas doses a partir de 0,324 kg ha-1. Em relação às misturas dos herbicidas, a mistura diuron+prometryne promoveu controle superior a 85% por períodos de até 30 dias, quando aplicada na menor dose (1+2 kg ha-1), e de 20 dias, quando aplicada na dose de 2+1 kg ha-1. Visando obter esse mesmo patamar de controle por 30 dias, foi necessário 1+0,288 kg ha-1 da mistura diuron+oxyfluorfen. A mistura prometryne+oxyfluorfen apresentou um mínimo de 80% de controle no período de 10 dias, quando utilizada a dose de 1+0,192 kg ha-1.", "num_citations": "3\n", "authors": ["184"]}
{"title": "\" In vitro\" viability of\" bacury\" pollen grains\n", "abstract": " O bacurizeiro (Platonia insignis Mart.) é uma frutífera nativa da Amazônia, que apresenta alogamia acentuada e autoincompatibilidade esporofítica. A viabilidade in vitro tem sido utilizada para representar a capacidade potencial do pólen em completar o processo de fertilização O objetivo do presente trabalho foi estudar a viabilidade de polens de bacurizeiro por meio da germinação in vitro, por ser esta uma técnica em que o comportamento germinativo é semelhante in vivo. Os ensaios foram conduzidos em laboratório, em um delineamento inteiramente casualizado, analisados em esquema fatorial 2 x 3 x 4, em que: 2= formas de propagação (pé-franco e enxertada); 3= estágios da antese (pré-antese, antese e pós-antese), e 4= concentrações de sacarose (0; 7, 5; 10 e 20%), com 10 repetições. Houve diferença significativa na germinação do pólen, sendo que, via polinização manual, o pólen deve ser coletado na antese, enquanto o melhor meio para a germinação in vitro é com 7, 5 g de sacarose.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Estabelecimento de índices ecocardiográficos de cavalos de polo\n", "abstract": " O treinamento atlético permite uma adaptação morfológica e funcional do coração de cavalos submetidos a diferentes tipos de exercício, portanto já foram publicados estudos sobre mensurações ecocardiográficas de cavalos de corrida, cavalos de enduro, cavalos de laço e tambor, cavalos de caça, entre outros, de outra forma, os índices ecocardiográficos de referencia para cavalos de polo não foram relatados na literatura. Sendo assim, foram realizadas mensurações ecocardiográficas em modo-M e 2D de 20 cavalos de polo em treinamento, estando eles divididos em três grupos de faixa etária, ou seja: Grupo I que consistiu de oito animais com idades entre cinco e dez anos, Grupo II com sete animais com idades entre 11 e 15 anos, e o Grupo III com cinco animais com idades entre 16 e 22 anos. Os resultados do nosso estudo demonstraram que não houve diferença estatística entre os diferentes grupos de faixa etária, não foi observado ainda um padrão para os valores de correlações com o peso, sendo eles de fraco a forte, positivo ou negativo.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Otimizando a seleção combinada de técnicas de teste baseado em modelos através da determinação do menor conjunto dominante multiobjetivo\n", "abstract": " The combination of testing techniques is considered an effective strategy to evaluate a software product. However, the selection of which techniques to combine in a software project has been an interesting challenge in the Software Engineering field. This paper presents a proposal extending an approach developed to support the combined selection of model-based testing techniques, named Porantim, applying Multiobjective Combinatorial Optimization strategies, by determining the smallest dominating set in a bipartite and bi-weighted graph. Thus, greedy and local search strategy algorithms are proposed generating solutions aiming at maximizing the coverage of software project characteristics and minimizing the eventual effort to construct models used for test cases generation.Resumo. A combinação de técnicas de teste se apresenta como uma estratégia eficaz na avaliação de um produto de software. No …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Desempenho de argilas bentoníticas na remoção de cátions de cádmio e cobre em colunas de leito fixo.\n", "abstract": " A adsorção tornou-se um processo de separação bastante atraente nos últimos tempos, principalmente após a descoberta de novos adsorventes. Mas para que se possa projetar e otimizar equipamentos de adsorção, é imprescindível a caracterização do adsorvente e o conhecimento da dinâmica de adsorção dos componentes em sistema experimental. Neste trabalho foi analisado a adsorção de Cu2+ e Cd2+, individualmente, de efluente sintético em coluna de leito fixo e tendo como adsorventes argilas bentoníticas (denominadas Bofe e Verde-Lodo), provenientes de Boa Vista–PB. Os métodos de caracterização utilizados foram Fluorescência de Raios-X (XRF), Análise Térmica Diferencial (DTA), Termogravimetria (TG), Microscopia Eletrônica de Varredura (MEV) e Fisissorção de N2 (método de BET). A coluna de leito fixo construída em acrílico possuía 13, 3cm de altura e 1, 4cm de diâmetro interno. Através da técnica de planejamento experimental com 3 pontos centrais foi possível um estudo mais abrangente dos fatores operacionais. Foram utilizados os modelos de Langmuir, Freundlich, BET e GAB no ajuste dos dados de equilíbrio. De acordo com a caracterização, as argilas bentoníticas estudadas apresentaram composição química de acordo com a maioria das argilas deste grupo. A presença de água nos espaços interlamelares das argilas, foi confirmada por Análise Térmica Diferencial (DTA) e Termogravimetria (TG). As curvas TG, das argilas Bofe e Verde-Lodo indicaram uma perda de massa de 12, 15% e 14, 3% respectivamente. A argila Bofe, calcinada a 500 C, apresentou área superficial 83, 18m2/g, enquanto que a …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Transferência de calor acima da superfície livre de um leito fluidizado borbulhante\n", "abstract": " O objectivo fundamental deste trabalho consistiu no estudo da transferência de calor na zona imediatamente acima da superfície livre de um leito fluidizado borbulhante para uma parede de membrana que confinava o reactor. Existiam poucos dados na literatura técnica e científica sobre fenómenos de transferência de calor nesta região e as informações disponíveis resumiam-se a estudos de transferência de calor para feixes de tubos colocados na referida região do reactor, ao passo que informações sobre transferência de calor para paredes de membrana eram escassas. Como nos leitos à escala industrial a região imediatamente acima do leito está confinada por paredes de membrana, achou-se conveniente tentar quantificar os valores da transferência de calor nestas circunstâncias, assim como identificar os principais mecanismos envolvidos no fenómeno. Determinou-se ainda a influência da mecânica de fluidos do leito e constatou-se que o borbulhamento, e subsequente projecção e espalhamento das partículas têm um peso fundamental na definição da transferência de calor. Este estudo foi importante uma vez que os leitos fluidizados são uma tecnologia de queima relativamente recente que tem dado boas provas em termos de controlo de emissões de poluentes gasosos, e ao mesmo tempo se tem revelado bastante adequada à queima de biomassa, uma das fontes renováveis de energia que poderá ser relevante no futuro combinado energético nacional e europeu. Pretendeu-se então caracterizar os mecanismos de transferência de calor envolvidos entre o leito e as superfícies de contacto imediatamente acima deste …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Alocação de chaves automatizadas em redes de distribuição utilizando múltiplos critérios\n", "abstract": " Existem três grandes componentes na infra-estrutura da energia elétrica–Sistemas de Geração, Transmissão e Distribuição, sendo o último o que menos recebe atenção e investimentos por parte do setor elétrico (SHORT, 2004). Os sistemas de distribuição são responsáveis por receber a energia gerada nas usinas por meio de circuitos de transmissão de alta tensão e entregá-la aos consumidores finais, que podem ser basicamente residenciais, comerciais ou industriais.Os sistemas de distribuição são de grande importância para a sociedade moderna, e um sistema confiável pode assegurar um fornecimento contínuo de energia elétrica para seus consumidores. Análises estatísticas das falhas mostram que o sistema de distribuição tem grande contribuição para a interrupção do fornecimento da energia. A estatística enfatiza a necessidade de uma boa metodologia de planejamento para assegurar que os …", "num_citations": "3\n", "authors": ["184"]}
{"title": "Animation of gas-liquid systems through lattice gas cellular automata and smoothed particle hydrodynamics\n", "abstract": " The past two decades showed a rapid growing of physically-based modeling of fluids for computer graphics applications. Techniques in the field of Computational Fluid Dynamics (CFD) have been applied for realistic fluid animation for virtual surgery simulators, computer games and visual effects. In this paper we focus on gas-liquid modeling for computer graphics applications. The main goal of our work is the development of a technique to create realistic animations of gas-liquid systems through computational simulation. Specifically, we model and simulate the gas through a Lattice Gas Cellular Automata and the liquid by Navier-Stokes equations and the Smoothed Particle Hydrodynamics (SPH) method. We combine the advantage of the low computational cost of cellular automata, the realistic fluid dynamics inherent in the Navier-Stokes and the efficiency of SPH for problems with dynamic boundaries to develop a new animating framework for computer graphics applications. In this work, we discuss the theoretical elements of our proposal and show the mentioned advantages for 2D flows in the experimental results.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Desafios e oportunidades da gestão de cidades–o caso de Angola\n", "abstract": " As cidades são, tradicionalmente, espaços de atracção, de concentração de actividades e pessoas, de acumulação de riqueza, de difusão da inovação e de progresso social. São também espaços que acusam grandes mudanças e desigualdades e onde o direito a uma habitação condigna e o acesso aos serviços básicos, ou seja, o Direito à Habitação e à Cidade, estão longe de ser uma realidade para muitos urbanitas.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Formation of nickel vanadates as a function of pH\n", "abstract": " The precise nature of the reaction between hydrochloric acid and sodium ortho-vanadate solution has been studied by means of electrometric techniques involving potentiometric and conductometric titrations. The well defined inflections and breaks in the titration curves confirm the existence of the anions, pyro-V2O7(4-) , meta-VO3- and poly-H2V10O28(4-) corresponding to the ratios of VO4(3-):H+ as 1:1, 1:2 and 1:2.6 in the neighborhood of pH 10.5, 7.4 and 3.6, respectively. The interaction of nickel chloride with sodium vanadate solutions, at specific pH levels 12.4, 10.5, 7.4 and 3.6 was also studied by potentiometric and conductometric titrations between the reactants. The end-points obtained from the sharp inflections in the titration curves provide definite evidence for the formation of ortho-3NiO.V2O5, pyro-2NiO.V2O5 and meta-NiO.V2O5 vanadates of nickel in the vicinity of pH 8.9, 8.0 and 6.8, respectively. Analytical investigations on the precipitates formed confirm the results of the electrometric study.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Fatores que influenciam a mortalidade hospitalar na cirurgia de correção de aneurisma do ventrículo esquerdo\n", "abstract": " Este trabalho teve como objetivo identificar fatores que influenciaram a mortalidade hospitalar de pacientes submetidos à cirurgia de correção de aneurisma do ventrículo esquerdo, no Instituto Dante Pazzanese de Cardiologia, no ano de 1994. Quarenta e nove pacientes foram operados, com idade variando de 32 a 79 anos (m=56,7), sendo 15 do sexo feminino e 34 do masculino. A técnica cirúrgica empregada foi de endoaneurismorrafia em 7 pacientes e sutura direta em 42 pacientes. Em todos realizou-se plicatura do septo interventricular. Em 44 houve revascularização do miocárdio concomitantemente. Os fatores estudados foram: localização do aneurisma, proteção miocárdica, tempo de anóxia, tempo de perfusão, revascularização do miocárdio concomitante, intervalo entre o infarto do miocárdio e a correção cirúrgica, quadro clínico pregresso e utilização de balão intra-aórtico. A mortalidade global foi de 7 pacientes (14%). As análises univariada e multivariada dos fatores estudados evidenciaram que o tipo de proteção miocárdica e a classe funcional de ICC pré-operatória influenciaram a taxa de mortalidade. Em nossa casuística, a classe funcional e o tipo de proteção miocárdica foram fatores preditores de mortalidade, porém ressaltamos a necessidade de estudos mais amplos observando o aspecto da proteção miocárdica, para confirmação desta hipótese.", "num_citations": "3\n", "authors": ["184"]}
{"title": "A single six-port reflectometer measures the scattering parameters of two-port microwave devices\n", "abstract": " A single six-port reflectometer configuration is proposed to measure the four scattering parameters of two-port microwave devices. In order to determine the transmission coefficients, only one calibration standard and three measurements are required to complete the calibration procedure. Furthermore, s/sub 12/ and s/sub 21/ can be measured without reversing the device under test.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Ciência e Tecnologia em uma perspectiva discursiva: enfoques de um grupo de pesquisa.\n", "abstract": " Fundando em 2004, o grupo DICITE (Discursos da Ciência e da Tecnologia na Educação) tem por intuito trabalhar sob a perspectiva da Análise de Discurso de linha francesa e dos estudos CTS (Ciência, Tecnologia e Sociedade) latino-americanos em busca de refletir sobre os discursos presentes na ciência e tecnologia no âmbito da educação. Nesse caminho, vários projetos têm sido desenvolvidos ao longo dos dez anos de existência do grupo, visando, principalmente, perspectivas críticas de ensino, e problematizações relacionadas à ciência e tecnologia, a partir de seu caráter ideológico, político, social e histórico. Para tanto, nossas ações se efetivam a partir das formações discursivas próprias nas quais os sujeitos do grupo se encontram imersos, o que reflete em uma heterogeneidade das pesquisas desenvolvidas, que convergem principalmente em um pensar a educação científica como espaço de possibilidade de mudanças e produção de novos discursos.", "num_citations": "3\n", "authors": ["184"]}
{"title": "Performance of 6 Different Global Navigation Satellite System Receivers at Low Latitude Under Moderate and Strong Scintillation\n", "abstract": " After sunset, in the equatorial regions ionospheric plasma irregularities are generated due to the generalized Rayleigh‐Taylor instability. Under favorable conditions these irregularities develop in the equatorial region while mapping along the magnetic field lines giving rise to large plasma depletion structures called Equatorial Plasma Bubbles with embedded smaller structures on their walls. The global navigation satellite system (GNSS) L1 band frequency is sensitive to irregularities of the size of 300–400 m in the first Fresnel zone, which cause scattering and diffraction of the signal and produce amplitude and/or phase scintillation. Severe scintillation of GNSS signals can in turn cause loss of lock of the receiver code and/or carrier loops. As a result, GNSS navigation and positioning solution can be adversely affected by the ionospheric scintillation. There are multiple GNSS receivers designed to monitor …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Biologic therapy use and pregnancy outcomes in women with immune-mediated inflammatory rheumatic diseases.\n", "abstract": " Introduction: Concerns about the side effects and interactions of biologic drugs with reproduction and pregnancy have been always an issue between experts. The safety of these therapies during conception and/or pregnancy is not fully understood. The aim of this study was to assess the exposure to biologic drugs before and/or during conception/pregnancy and the risk of adverse pregnancy outcomes in women with rheumatic diseases. Methods: We conducted a cohort study of pregnancies reported in women with immune-mediated rheumatic diseases registered at the Rheumatic Diseases Portuguese Registry (Reuma. pt) and exposed to biologic drugs. Data concerning fetal and maternal outcomes (live birth, spontaneous abortion, neonatal and intrauterine death, intrauterine growth restriction, premature delivery, congenital malformations, neonatal lupus, voluntary or medical interruption of pregnancy, disease …", "num_citations": "2\n", "authors": ["184"]}
{"title": "2-Allylphenol reduces IL-1β and TNF-α, promoting antinociception through adenosinergic, anti-inflammatory, and antioxidant mechanisms\n", "abstract": " 2-Allylphenol (2-AP) is a synthetic phenylpropanoid, structurally related to cardanol, thymol, and ortho-eugenol. Phenylpropanoids are described in the literature as being capable of promoting biological activity. Due to the similarity between 2-AP and other bioactive phenylpropanoids, the present research aims at evaluating the antioxidant, antinociceptive, and anti-inflammatory potential of 2-AP in silico, in vitro, and in vivo. At 30 min prior to the start of in vivo pharmacological testing, administration of 2-AP (25, 50, 75, and 100 mg/kg i.p.), morphine (6 mg/kg i.p.), dexamethasone (2 mg/kg s.c.), or vehicle alone was performed. In the acetic acid-induced abdominal writhing tests, pretreatment with 2-AP significantly reduced the number of abdominal writhes, as well as decreased licking times in the glutamate and formalin tests. Investigation of the mechanism of action using the formalin model led to the conclusion that the opioid system does not participate in its activity. However, the adenosinergic system is involved. In the peritonitis tests, 2-AP inhibited leukocyte migration and reduced releases of proinflammatory mediators TNF-α and IL-1β. In vitro antioxidant assays demonstrated that 2-AP presents significant ability to sequester superoxide radicals. In silico docking studies confirmed interaction between 2-AP and the adenosine A2a receptor through hydrogen bonds with the critical asparagine 253 residues present in the active site. Investigation of 2-AP demonstrated its nociception inhibition and ability to reduce reactive oxygen species. Its interaction with A2a receptors may well be related to proinflammatory cytokines TNF-α and IL-1β …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Water treatment sludge as potential soil amendment for native plants of the Brazilian Cerrado.\n", "abstract": " This work evaluates the effect of 5 mixtures of water treatment sludge, soil from the Cerrado region (Brazil) and a commercial substrate on the growth of 4 species of native plants (Copaifera langsdorffii, Astronium fraxinifolium, Peltophorum dubium and Tabebuia roseo-alba) from the Brazilian Cerrado. A randomized design was setup with four repetitions and WTS loading rates of 0, 204, 417, 638 and 869 g/kg. Plant sampling for analysis was performed at 30, 60, 90, 120 and 150 days after planting, totalling 400 experiments. The results on morphological parameters and foliar analysis showed good results for the sludge loading rates of 204 and 417 g/kg (18, 75 and 37, 5% of sludge, respectively), for the Copaifera langsdorffii, Astronium fraxinifolium and Tabebuia roseo-alba growth, which presented the highest values for plant diameter, height and total dry matter weight at the 90th and 120th day of experiments. These loading rates seem to provide suitable buffer conditions and nutrients for plant growth. For sludge loading rates of 638 and 869 g/kg the development of all species was reduced, suggesting that plant growth was probably affected by both the higher concentration of Al and the poor mixture structure due to excess of sludge.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Delineamento Box-Behnken para remoção de DQO de efluente têxtil utilizando eletrocoagulação com corrente contínua pulsada\n", "abstract": " RESUMO A remoção de poluentes de efluentes industriais de forma efetiva e economicamente viável ainda é um desafio. Dessa forma, o presente trabalho propôs investigar a tecnologia de eletrocoagulação (EC) para o tratamento de efluente têxtil utilizando corrente contínua pulsada (CCP). A metodologia de superfície de resposta Box-Behnken foi utilizada para analisar e otimizar as condições operacionais, visando à máxima remoção de demanda química de oxigênio (DQO). Os experimentos foram realizados com um volume reacional de 2,6 L, em modo batelada. Diante dos resultados obtidos, a configuração ótima considerada foi: velocidade de agitação = 200 rpm, frequência dos pulsos = 1.000 Hz e espaçamento entre os eletrodos = 1 mm, em 50 minutos de EC. Nessas condições foi obtida uma remoção de DQO de 81,23% (valor remanescente de 152 mg O2.L-1). Em adição, verificou-se que o processo de EC também é eficaz para a redução de cor, turbidez, sólidos suspensos totais, sulfato e sulfeto. A concentração de íons cloreto não foi alterada durante a EC, apresentando-se como um aspecto favorável para a reutilização do efluente tratado no próprio processo produtivo têxtil, o qual demanda uma elevada concentração de NaCl.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Influence assessment of operating parameters in synthesis of zn-ni alloys for process electrodeposition\n", "abstract": " The influence of the variation of the metallic ions concentrations on the electrodeposition of Zn-Ni alloys on a copper substrate was studied evaluating the Faradaic efficiency. It was used a 2 2 factorial design, with 3 central points. So, fixing the electric current density in 12.5 mA/cm 2, the variables were the concentrations of zinc and nickel. The electrolytic bath was composed by ZnSO 4 and NiSO 4, salts that were source of zinc and nickel, respectively, ammonium citrate as a complexing agent and sodium borate as an amorphising. The alloys showed good performance at room temperature and the Faradaic efficiency reached 95%. The concentration of zinc was more influential on the deposition efficiency than the concentration of nickel.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Análise do COP e sentido de posição em jogadores universitários de futebol com e sem instabilidade de tornozelo\n", "abstract": " O objetivo do estudo foi comparar o comportamento do COP e do sentido de posição articular passivo em indivíduos com e sem instabilidade de tornozelo, e correlacionar as variáveis de COP e sentido de posição articular passivo. Participaram 20 indivíduos, divididos em dois grupos: grupo estável (GE) e grupo instável (GI). A avaliação do COP foi feita com o teste de apoio unipodal, com olhos abertos e fechados sobre uma plataforma de força. O teste de reposicionamento articular passivo foi realizado com os olhos vendados. O tornozelo foi posicionado em um ângulo alvo (10° e 20°) e o dinamômetro movia passivamente o tornozelo, então os participantes eram instruídos a apertar o botão para parar o movimento quando sentissem que o tornozelo estava no ângulo alvo, obtendo assim o erro angular absoluto (EAA). Foram obtidas as variáveis: deslocamento total (DT); desvio padrão ântero-posterior (DPap) e médio-lateral (DPml); velocidade média total (VMT); velocidade média ântero-posterior (VMap) e médio-lateral (VMml). A comparação entre dados que apresentaram distribuição normal foi feita com o teste t de Student, enquanto que para DT e DPml foi utilizado o teste de Mann-Whitney. Da mesma forma, foram usados os testes de Pearson e Spearman para correlacionar as variáveis. Foi adotado α < 0,05. Houve diferença entre EAA-10° (p < 0,05). Foram encontradas fortes correlações entre: EAA-10° e VMT (p < 0,01 r = −0,867); EAA-10° e VMap (p < 0,01 r = −0,854); EAA-10° e VMml (p < 0,01 r = −0,771), na condição olhos abertos, e EAA-10° e DT (p < 0,05 r = −0,666); EAA-10° e DPap (p < 0,05 r = −0,685) e EAA-10° e VMml …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Atuação de graduandos de enfermagem como treinadores de professores e escolares nas técnicas de suporte básico de vida: relato de experiência\n", "abstract": " As doenças cardiovasculares constituem causa importante de mortalidade no mundo ocidental. Suporte Básico de Vida (SBV) é um curso criado pela American Heart Association com o ensino da emergência cardíaca, particularmente com a ressuscitação cardiopulmonar. Considerando que a capacitação do leigo para o atendimento precoce em situações de emergência e instituição do suporte básico de vida (SBV) é fundamental para salvar vidas e prevenir sequelas, este estudo tem por objetivo capacitar alunos de graduação para desenvolver a técnica de SBV para leigos. Trata experiência envolvendo graduandos de enfermagem no treinamento de professores e alunos do ensino médio nas técnicas de reanimação cardiopulmonar conforme as diretrizes internacionais de reanimação, por meio de aulas teóricas e práticas. Para a coleta de dados foram utilizados questionários de múltiplas escolhas sobre o assunto,pré e pós teste. Foram treinados 162 alunos e 54 professores do ensino médio em 4 escolas públicas do município de Botucatu. aplicados o pré e o pós teste e verificou 100% dos alunos e professores treinados melhora no pós teste, e significância estatística na escola 3 para os alunos e na escola 1 para os professores. Concluiu-se que foi de grande importância para o aluno de graduação, para o município e para o cidadão, pois o SBV é fundamental p vidas e prevenir sequelas. As escolas que aderiram ao projeto sentiram-se beneficiadas e os resultados, verificados por meio do pós teste, foram de resultados significativos.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Extension of Sikuli tool to support automated tests to windows phone context-aware applications\n", "abstract": " The wide diffusion in the use of mobile devices has brought the need to improve the process of verification and validation in mobile applications. The usual way of interaction between these apps and users is through device interface. For context-aware mobile applications, the number of interactions that a user can perform is much larger if compared to common applications. Thus, manual testing execution turns out to be an exhaustive and error-prone activity. The main contribution of this work is to propose the creation of new functions in Sikuli tool to automate tests for context-aware mobile application developed to the Windows Phone platform in order to develop reliable applications using an effective test strategy.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Reduction of natural organic matter by an electrolytic process, conventional coagulation and direct descending filtration in a pilot-scale water treatment system\n", "abstract": " Recently, alternative water treatment systems have been implemented due to the eutrophication of reservoirs, in which high concentrations of organic matter prevent the use of conventional water treatment methods. This paper presents a study on the electrolytic process for water treatment using an alternating current. A reactor with iron and stainless steel electrodes was built and introduced into a water treatment system equipped with conventional coagulation with alum and direct descending filtration. Factors such as pH levels, turbidity, colour, and reductions in the specific UV absorbance were evaluated. The results showed a significant reduction in the specific UV absorbance between raw water and treated water (19.51–26.45%). Furthermore, the reactor did not significantly change the pH of the water. The average turbidity of the treated water was less than or equal to 0.5 NTU, and the average colour reached 2 …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Paradigmas, hipóteses e descobertas: O Ensino de Biologia e as Leis de Mendel\n", "abstract": " A Genética é um dos grandes desafios do Ensino de Biologia, não apenas por sua complexidade e níveis de abstração, como também pela dificuldade de contextualização histórica de seus conteúdos, conceitos e terminologias. Não obstante, as Leis de Mendel, um dos paradigmas vigentes na Biologia, ocupam espaço privilegiado no ensino. Pensando nisso, esse trabalho tem como objetivo realizar reflexões epistemológicas com base na noção de paradigma de Thomas Kuhn e de estilo de pensamento/coletivo de pensamento de LudwickFleck, além de algumas reflexões de Steven French sobre o contexto de descoberta e justificação das pesquisas científicas. Refletiremos, também, sobre como conteúdos paradigmáticos são apresentados em livros didáticos. Para isso, analisaremos quatro livros didáticos de Biologia aprovados pelo Programa Nacional do Livro Didático (PNLD) de 2012.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Neurological manifestations in HTLV-1 infected individuals without HAM/TSP: a longitudinal cohort study\n", "abstract": " Background: Human T cell lymphotropic virus type 1 (HTLV-1) is the agent of HTLV-1 associated myelopathy/tropical spastic paraparesis (HAM/TSP), observed in up to 5% of infected individuals. Despite low prevalence, many HTLV-1 patients who do not fulfill criteria for HAM/TSP present with neurological complaints related to sensory, motor, urinary or autonomic manifestations. The aim of this study was to determine the incidence of neurologic manifestations and risk factors associated with these outcomes.Methods: The incidence of HAM/TSP and new signs and neurologic symptoms were computed in a group of patients enrolled in a cohort studyResults: Of 414 subjects, 76 had definite, 87 had possible or probable HAM/TSP and 251 subjects had no neurologic manifestation and were selected for analysis. Definite HAM/TSP developed in 5 (1.47%) patients. Follow-up of at least three years was achieved in 51% of patients. The incidence rate was computed in 1,000 persons-year (206 for hand numbness, 187 for feet numbness, 130 for nocturia, and 127 for urgency). Average incidence rate in neurological exam was 76 for leg hyperreflexia, 53 for leg weakness, and 37 for Babinski sign. In applied Expanded Disability Status Scale (EDSS), the incidence rate of worsening 1 point was 134/1,000 persons-year. Kaplan-Meier curves stratified by gender and proviral load", "num_citations": "2\n", "authors": ["184"]}
{"title": "Prepubertal Holstein heifers have low efficiency when submitted to ovum pick-up and in vitro embryo production\n", "abstract": " The present study evaluated the in vivo ovum pick-up (OPU), in vitro embryo production and the conception rate of embryos from prepubertal Holstein donors. The study was performed at Santa Rita farm, with a completely randomized experimental design, performed in six consecutive replicates with different animals. A total of 128 donors of four animal categories: prepubertal heifers (PP, n= 32), pubertal heifers (PU, n= 32), lactating cows (LC, n= 32) and non-lactating cows (NLC, n= 32) were submitted to OPU without previous synchronization, concomitantly. Immediately before the OPU, all follicles were quantified and classified according to their diameter [small (SF≤ 6mm), medium (MF= 6 to 10mm) and large (LF≥ 10 mm) follicles]. Subsequently, all visible follicles (≥ 2mm) were punctured and the total recovered structures, as well as the quantity and quality grade of viable oocytes were registered. All viable oocytes were submitted to the in vitro embryo production and their development (cleavage and blastocyst rate) was evaluated. The same bull and semen batch were used for the oocytes fertilization of all donor categories. The embryos produced were transferred in crossbred recipients (Bos taurus x Bos indicus). Variables were analyzed by the GLIMMIX procedure of SAS®. No difference (P= 0.08) between the experimental groups were observed in the total number of follicles aspirated (PP: 17.7±2.0; PU: 16.8±1.2; LC: 14.3±0.95; NLC: 19.9±1.6). However, it was found that the PP donors showed higher (P< 0.0001) proportion of small follicles when compared to the other categories (PP: 58.6 a, PU: 46.4 bc; LC: 44.5 c; NLC: 53.5% b …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Uso do processo de eletrocoagulação/flotação no tratamento de efluente de pós-tingimento de uma indústria de redes.\n", "abstract": " A indústria têxtil necessita de intenso consumo de água e produtos químicos, produzindo grandes quantidades de efluentes. As tecnologias de tratamento convencionais apresentam baixa eficiência de remoção de corantes. O presente trabalho visa avaliar a eficiência do processo de eletrocoagulação/flotação com eletrodo de alumíniono tratamento de efluente de pós-tingimento de uma indústria de redes usando eletrodo de alumínio, com objetivo de reutilizá-lo no processo produtivo. Os experimentos foram realizados num reator cilíndrico de 2, 8 L, operando em batelada com TDH de 70 minutos. Realizou-se um estudoonde foram monitorados: turbidez, temperatura, pH, condutividade, DQO e absorbância no UV-visível. Os resultados obtidos mostraram reduções médias acima de 70% para DQO e 80% para remoção de cor que foi comprovado pelo decaimento da absorbância na faixa do UV-vis, mostrando que a tecnologia proposta tem grande potencialidade para o tratamento de efluente têxtil.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Uma Investigação sobre Recomendações de Melhoria Baseadas em Aspectos Culturais para Apoiar Iniciativas de Melhoria de Processo de Software\n", "abstract": " Recomendações de melhoria (RMs) fornecem possíveis orientações que ajudam as organizações no alcance de seus objetivos e podem estar direcionadas a diferentes contextos. Neste trabalho, o foco é a cultura organizacional, que guia o funcionamento de uma organização e, ao mesmo tempo, influencia a forma como os profissionais reagem a iniciativas de melhoria de processo de software. Este artigo apresenta os resultados de uma revisão sistemática que identificou 100 RMs para que organizações de software obtenham sucesso na implementação dessas iniciativas. Estas RMs foram organizadas em três grupos, representando fatores humano, social e organizacional. As análises realizadas apresentam as RMs mais citadas na literatura técnica em uma perspectiva individual e por grupos.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Estudo morfológico e funcional dos dentes do budião (Sparissoma flavescens)\n", "abstract": " Através de métodos anatômicos e histológicos foi realizado estudo morfológico macro e microscópico dos dentes do budião (Sparissoma flavescens), bem como sua disposição nos ossos e função na mastigação, concluindo-se que: 1) maxila e mandíbula do budião possuem ossos pré-maxilares e dentários osteodentinicos, onde estão alojados os complexos dentais, formando um conjunto que se desgasta pelo topo e se renova pela base e que, funcionalmente, pode ser denominado unidade mastigatória; 2) a porção basal às pilhas de dentículos, por suportar a unidade mastigatória, pode ser também denominada unidade basal; 3) os dentículos coalescidos, empilhados no sentido súpero-inferior, tornam-se mais calcificados à medida que progridem da base para o topo das pilhas, onde se tornam individualizados e funcionais; tais dentículos são constituídos por ortodentina, apresentam polpa e são recobertos por enamelóíde, que é do tipo semelhante ao\" esmalte tubular invertido\" de Thomasset; 4) o Sparissoma flavescens possui aparelho mastigador com características morfológicas e funcionais altamente especializadas, principalmente no que se refere aos dentes, que o aproxima dos animais da subordem Tetraodontoidei, especialmente no que se refere aos Diodontídae e Tetraodontídae.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Characterization of sport injuries in the basketball\n", "abstract": " ALMEIDA NETO, Antônio Francisco de; TONIN, Juliana Petrongari and NAVEGA, Marcelo Tavella. Caracterização de lesões desportivas no basquetebol. Fisioter. mov.[online]. 2013, vol. 26, n. 2, pp. 361-368. ISSN 1980-5918. https://doi. org/10.1590/S0103-51502013000200013.INTRODUCTION: Basketball is characterized with high injury rate. In the literature it's not defined whether or not there are differences between the sexes. OBJECTIVE: Characterize and analyze the incidence of athletic injuries in basketball players, comparing the sexes. MATERIALS AND METHODS: Fifteen under-23 category athletes of each sex were interviewed with the reported morbidity inquire. RESULTS: The age of the female and male teams, in average, was 18±0.65 and 18.20±1.57 years respectively. The male team had more injuries than the female one (respectively 2.6±1.45 against 1.2±1.18, p< 0.05). The joint damage was the most common injury in the male team, representing 58.97%, and the second most common in the female team (33.33%). The lower limbs were the most common injured sites (80.95% in the female and 69.23% in the male). The most frequent injury mechanism in the male team was the landing (43.59%), and in the female was the vertical jump (28.57%). In both teams the most injuries occurred during the training (61.9% in the female and 71.8% in the male). The absence was necessary in 47.62%(female) and 56.41%(male). Great part of the athletes didn't received any treatment (61.9% and 51.28% in the female and male team respectively). The return to the activities was mostly symptomatic, in both female and male team (85.71% and …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Implementation of Software Process Improvement Initiatives\n", "abstract": " In a globalized world, organizational culture plays an important role in companies since it represents one of the main factors of business success in competitive scenarios. Organizational culture is defined by a set of attitudes, behaviors, norms and beliefs that may guide the life of a company. Organizational values can ensure a common understanding among everyone in the organization, provided that they are shared by all their members. This study describes the results of a systematic literature review on typological model of organizational culture in order to identify organizational values for characterizing the organizational culture in a company. Additionally, we managed a survey to researchers and practitioners analyzing which organizational values are most relevant to a software organization involved with a software process improvement (SPI) initiative. In this paper, we describe forty organizational values identified in the systematic review, and we give particular emphasis in the values the survey results indicate as the main ones that influence the adoption/maintenance of SPI initiatives, ie,(i) being committed to a high-quality policy for products, services, and processes;(ii) having a well-defined and established vision and goals; and (iii) imposing responsibilities on the team members for meeting deadlines and achieving goals.Portuguese abstractEm um mundo globalizado, a cultura organizacional desempenha um papel importante nas empresas, uma vez que representa um dos principais fatores de sucesso dos negócios em cenários competitivos. A cultura organizacional é definida por um conjunto de atitudes, comportamentos, normas e …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Providing trade-off techniques subsets to improve software testing effectiveness: using evolutionary algorithm to support software testing techniques selection by a web tool\n", "abstract": " The combination of testing techniques is considered an effective strategy to evaluate the quality of a software product. However, the selection of which techniques to combine in a software project has been an interesting challenge in the software engineering field because the high number of techniques available at the technical literature. This paper presents an approach developed to support the combined selection of model-based testing techniques, applying multiobjective combinatorial optimization strategies, by determining the minimum dominating set in a bipartite and bi-weighted graph. Thus, an evolutionary strategy based on a multiobjective genetic algorithm is proposed to generate trade-off techniques subsets between the maximum coverage of software project characteristics and the minimum eventual effort to construct models used for test cases generation. In an empirical evaluation, our …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Aplicando Testes Ágeis com Equipes Distribuídas: Um Relato de Experiência\n", "abstract": " Teste de software é uma atividade que requer colaboração e cooperação entre os envolvidos. Com o crescimento das metodologias ágeis, estas características estão se tornando cada vez mais necessárias. No entanto, esta colaboração e cooperação se tornam mais difíceis quando os membros da equipe de teste estão separados geograficamente (desenvolvimento distribuído de software–DDS). Neste artigo, é reportado um relato de experiência de uma equipe de teste distribuída no contexto de um projeto de software que adota metodologia ágil, tendo como observações a viabilidade e sucesso da aplicação de testes neste cenário.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Caracterização das lesões desportivas em atletas de tênis de mesa\n", "abstract": " Introdução: O tênis de mesa é caracterizado por exigir de seus atletas movimentação corporal intensa. Os gestos desempenhados pelos atletas exigem constantes alterações posturais, em casos de desequilíbrios em quaisquer estruturas corporais poderá produzir alterações posturais ou mesmo desencadear processos de lesões. Objetivo: O objetivo do estudo foi caracterizar as lesões no tênis de mesa. Método: foram avaliados 31 atletas (26 do sexo masculino e cinco do sexo feminino) com média de idade 22,35±6,67 anos. Foi realizada entrevista com o Inquérito de Morbidade Referida retroativo a temporada de 2009. Foram utilizadas técnicas de estatística descritiva e analítica. Resultados: o maior número de lesões foi muscular (74,35%), no ombro (43,58%), durante o movimento de top spin (33,33%), na fase de treino específi co (64,1%) com retorno sintomático as atividades (69,23%). Conclusão: a carga horária de treinamento semanal infl uencia o número de lesões apresentadas.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Caracterizacao de ligas Al-Si eutetica e hipereutetica fundidas por centrifugacao para aplicacoes automotivas\n", "abstract": " Em componentes de motor, como a camisa de cilindro automotiva, é necessário haver uma elevada dureza na parede interna da camisa, a fim de se evitar o rápido desgaste devido à abrasão que os anéis de pistão exercem na superfície interna da camisa quando do funcionamento do motor. Neste trabalho foram investigadas as ligas Al-Si eutética e hipereutética fundidas por centrifugação aplicadas como camisa de cilindro. A centrifugação tende a concentrar a fase de menor densidade (silício) na parede interna da camisa. O perfil de dureza ao longo da espessura da camisa foram determinados em intervalos de 1 mm. O intuito de segregar a fase β para a parede interna da camisa se mostrou eficaz. O aumento da quantidade da fase β na parede interna da camisa foi acompanhado pelo aumento de dureza. O aumento de dureza devido à segregação da fase β mostrou-se mais eficaz na liga hipereutética.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Estudo de ligas Al-Si fundidas em molde de areia verde: Efeito da adição de refinador e de modificadores de grão nas propriedades mecânicas\n", "abstract": " O objetivo do presente trabalho foi caracterizar a microestrutura e as propriedades mecânicas da liga Al-Si hipoeutética (7% Si) fundida em molde de areia verde e identificar os efeitos do refino de grão do alumínio (Al-α) e da modificação do silício eutético. Foram feitas adições diversa do refinador TiBAl (5/1) e de modificadores à base de sais de sódio e a liga SrAl 10%. A liga sem adições de modificadores do silício eutético apresentou os valores mais baixos de limite de escoamento e de resistência devido ao silício apresentar-se na forma de plaquetas. A adição dos modificadores de grão, tanto à base de sódio como estrôncio, acarretou uma mudança na morfologia do silício eutético, tornando-o com uma aparência menos angular e mais arredondada, acompanhada por uma melhoria nas propriedades mecânicas da liga. Nenhuma constatação significativa com relação à microestrutura e às propriedades mecânicas pode ser observada devido à adição do TiBAl.", "num_citations": "2\n", "authors": ["184"]}
{"title": "Distúrbios de desenvolvimento (ectopias de esmalte) na quebra homeostática da área de furca\n", "abstract": " Alterações nas fases de desenvolvimento corporal podem levar a formação de distúrbios de desenvolvimento, podendo estes apresentar manifestações na cavidade oral, como por exemplo, a ectopia do esmalte. Esta anomalia pode se apresentar de várias maneiras tais como pérolas de esmalte ou projeções cervicais de esmalte, podendo acometer quaisquer faces dos elementos dentais, alterando a inserção dos tecidos periodontais no dente, o que pode ocasionar a quebra da homeostasia marginal, uma vez que o sulco periodontal fica mais profundo possibilitando um maior acúmulo de placa bacteriana, aumentando o risco de desenvolvimento de doenças periodontais. Este trabalho tem por objetivo elucidar as características peculiares de distúrbios de desenvolvimento (ectopias do esmalte), projeção cervical de esmalte e pérolas do esmalte, por serem focos de negligência e/ou desconhecimento de grande parte dos profissionais e por possuírem inter-relação com a ocorrência de doenças periodontais localizadas. UNITERMOS:", "num_citations": "2\n", "authors": ["184"]}
{"title": "171 IMPROVEMENT IN EMBRYO RECOVERY USING UTERINE DOUBLE FLUSHING\n", "abstract": " The aim of the present study was to evaluate the effects of uterine double flushing on embryo recovery rates (total structures and viable embryos), after a resting period with the uterus filled with PBS. There were 210 embryo recovery procedures conducted using the uterine double flushing method, and the results were compaired with 432 conventional single flushing procedures. All procedures were conducted with Limousin (n = 403) and Guzerá (n = 239) cows, following the same superovulation protocol. Cyclic donors received a progestagen implant (CIDR) and 1 mL of oestradiol benzoate (Estrogin®) at Day 0. Between Day 5 and Day 9 animals received doses ranging from 200 to 300 UI (zebu cows) and 300 to 500 UI (taurine cows) of FSH (Pluset® – Serono) in decreasing doses. Between Day 6 and Day 8 PGF2a (Ciosin®) was administered, followed by withdrawal of the progestagen after 24 h …", "num_citations": "2\n", "authors": ["184"]}
{"title": "Electromagnetic field of an asymmetrically driven dipole antenna for heating dissipative media\n", "abstract": " This study was designed to investigate the use of an antenna adapted for electromagnetic heating of a dissipative medium. The antenna studied was the asymmetrically center-driven dipole with concentric insulated layers, useful for microwave local heating in the extraction of heavy petroleum as well as in cancer therapy. The main objective of this work was the development of a numeric simulator for the antenna, in order to optimize the transfer of energy to the dissipative medium. The Hallen and Pocklington equations were solved for the current distribution on the antenna using the numeric technique of the moment method. Detailed integral expressions of the near electric field in cylindrical coordinates were developed and calculated using adapted methods of numeric integration, such as, Legendre-Gauss and adaptive Simpson rule. The mathematical models and the numeric techniques approached in this study …", "num_citations": "2\n", "authors": ["184"]}
{"title": "On the exploratory testing of mobile apps\n", "abstract": " While the literature acknowledges that mobile apps present different testing challenges and automated solutions have been pursued, it lacks a better understanding of how pervasive practices of manual testing (namely Exploratory Testing-ET) can be more effectively applied. This paper aims to investigate the use of ET in mobile apps. With this study, we intend to have a better understanding of how exploratory testing is employed, its effectiveness, and its usage in an ample and diverse range of apps. To do so, we conducted two studies. The first study was conducted for the purpose of applying ET to apps with diverse contexts and available on Google Play in order to analyze whether testers actually explore all possible scenarios that apps may display. The second study, also applied the ET, however in two apps that were developed by a software development company; this study has the objective of applying the ET …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Intervenção fisioterapêutica no AVE: um estudo de caso em idoso institucionalizado\n", "abstract": " O aumento da longevidade, realidade mundial atual, favorece alterações funcionais nos indivíduos que resultam, muitas vezes, em predisposição para o aparecimento de doenças crônicas não transmissíveis e suas seqüelas, quase sempre incapacitantes, destacando-se entre elas a hipertensão arterial sistêmica, o diabetes mellitus, a artrite reumatóide e o acidente vascular encefálico (CRUZ&DIOGO, 2009).O presente estudo abordará, especificamente, o acidente vascular encefálico (AVE), por se tratar de uma patologia que causa diversas limitações e frequente em idosos institucionalizados. Segundo Carmo et al.,(2016), considerado o motivo principal de incapacidade de longa duração na vida adulta, o Acidente Vascular Cerebral (AVC) ocupa posição de destaque entre as doenças crônicas que acometem a população idosa. O AVE é caracterizado como um déficit temporário ou definitivo que é provocado por uma alteração da circulação sanguínea no cérebro, podendo danificar uma ou mais partes. Este pode ser de dois tipos, isquêmico ou hemorrágico e compromete a função neurológica. Existem diversos fatores de risco associados ao desenvolvimento de Acidente Vascular Encefálico (AVE), todavia, a incidência é aumentada entre os idosos que constituem a população mais vulnerável a este agravo (OLIVEIRA et al., 2017). Sabe-se que o Acidente Vascular Encefálico (AVE) é uma doença incapacitante e que pode levar ao óbito, por isso é necessário uma intervenção imediata e o rápido reconhecimento do seu acontecimento. O tratamento fisioterapêutico de um paciente que sofreu AVC se faz necessário pelo fato de ele ser …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Produção de mudas de tomate com extrato de algas marinhas\n", "abstract": " A cultura do tomate é considerada uma das principais culturas olerícolas no Brasil. Porém, para o cultivo do tomate são necessárias o emprego de diversas práticas agrícolas. O Brasil se destaca como um dos maiores produtores dessa hortaliça, considerando a produção destinada à indústria. O emprego de biofertilizante tem aumento devido ao seu baixo custo, à sua variada composição e especialmente a sua boa concentração de nutrientes. Este trabalho visa comparar o efeito de diferentes concentrações de extratos de algas sob a produção de mudas de quatro cultivares de tomate por meio da avaliação de diferentes componentes morfológicos. O experimento foi realizado na Área Experimental do Centro Universitário de Anápolis. Foram realizados quatro (4) ensaios independentes, sob os mesmos tratamentos definidos, sendo cada ensaio com uma cultivar diferente. As variedades de tomateiro selecionadas foram: Tomate Cereja Vermelho (crescimento indeterminado), Tomate Especial Salada (crescimento determinado), Tomate Santa Clara (crescimento indeterminado), Tomate Italiano (crescimento determinado). O delineamento experimental foi composto por cinco tratamentos e 20 repetições, em delineamento de blocos casualizados. Os tratamentos consistiram em: T1 – Testemunha; T2 - 1% de extrato de algas A.nodosum; T3 - 2,5% de extrato de algas A.nodosum; T4 - 5% de extrato de algas A.nodosum e; T5 - 7% de extrato de algas A.nodosum. As soluções com extrato de algas A. nodosum foram preparadas a partir de um produto comercial de onde foram obtidas as concentrações de 1, 2,5, 5 e 7 mL do extrato diluídos em …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Mobile App Testing: Tools, Frameworks, and Challenges\n", "abstract": " Mobile phones have become an integral part of people's lives; people nowadays use mobile applications for daily activities such as email, health, finance, and entertainment. Mobile applications pose a huge challenge in software testing by reason of several additional characteristics—for instance, diversity of mobile devices and platforms, interaction with other applications, and the use of touch screens. Each of these has direct implications for software development and testing. Furthermore, mobile app testing depends on the different aspects to be served such as type of application, user, and testing requirements. Therefore, developers and/or testers need to gain knowledge of testing tools and environments. This chapter shows software testing concepts applied to the mobile app domain. It provides an overview of tools, frameworks, and services that are used to support mobile testing activities on different levels and …", "num_citations": "1\n", "authors": ["184"]}
{"title": "“Café com Educação Médica”–Breve Relato de uma Experiência para o Desenvolvimento da Docência\n", "abstract": " RESUMO O desenvolvimento docente é uma necessidade nas escolas para adequar o ensino médico às intensas e contínuas transformações do mundo e da sociedade contemporânea. Iniciativas de desenvolvimento docente precisam avançar para além de cursos de capacitação, evoluindo para comunidades de prática. Com o intuito de incorporar princípios da educação médica ao cotidiano do professor, em diversos níveis, desde o planejamento até a avaliação dos processos de ensino, entendemos que ambientes informais também podem constituir espaços para o desenvolvimento da docência. Assim, a Faculdade de Medicina de Botucatu, da Universidade Estadual Paulista, criou o “café com educação médica”, uma reunião matinal quinzenal para discussão de aportes teóricos para subsidiar as ações de pesquisa e prática do Núcleo de Apoio Pedagógico. A reunião tem configuração semelhante à dos clubes de revista tradicionais no ensino de graduação e residência médica, mas com particularidades voltadas à educação em saúde. O êxito da experiência se deve à possibilidade de ocorrer desenvolvimento docente em contexto acolhedor e informal. Tendo em vista os relatos de transformação da prática docente motivados por iniciativas semelhantes ao redor do mundo e observando como nossa experiência tem sido oportuna, encorajamos as escolas médicas brasileiras a compartilharem também seus clubes de revista em educação médica e os resultados com eles obtidos.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Liquid-liquid equilibrium data for the pseudo-ternary biodiesel of chicken Fat+ methanol+ glycerol\n", "abstract": " Liquid-liquid equilibrium (LLE) data for the system biodiesel of chicken fat+ methanol+ glycerol was measured at 25 and 45 C and atmospheric pressure. The zone of miscibility was found by means of the binodal curve, using the density of turbidity in each point for its construction. Tie lines were defined through the calibration curves of the biodiesel and glycerin phases. The distribution and selectivity coefficients for the system were determined. The validation of the equilibrium data was proved using the Othmer-Tobias and Hand correlations, with coefficients close to the unity. The LLE data were correlated with the UNIQUAC model for temperatures of 25 C and 45 C, with global mean deviation values of 0.78% and 0.89%, respectively.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Chemical Composition, Minerals, Physicochemical Properties and Antioxidant Activity in Camu Camu Seed Oil.\n", "abstract": " The aim of this work was to perform chemical and physicochemical analysis of oil of the camu camu (Myrciaria dubia (HBK) Mc Vaugh) seeds obtained at Caçari beach, on the banks of the Cauamé river, in Boa Vista city, Roraima state, Brazil. From the seeds, the dark green oil was 2.88% yield. The physical and chemical properties of the oil through the 1H and 13C NMR spectra: iodine content (55.39 g I2 100g-1), saponification index (178.14 mg KOH g-1), acidity (1.46 mg KOH g-1), olefinic/aliphatic hydrogen ratio (0.36), average molecular weight (934.16 g mol-1). Analysis of the signal displacements in 1H and 13C NMR spectra confirmed the presence of the fatty acid functional groups and unsaturated fatty acid unsaturations, so the concentration of linolenic acid was 0.43%, acid 12.02% oleic, oleic was 62.49% and saturated fatty acids 25.10%. The quantitative analysis of minerals by ICP-OES showed concentrations of elements: K, Na, P, Si (> 100 ppm); Mg, S (10 to 100 ppm) and Ti (< 100 ppm). The antioxidant activity, through the DPPH method, shows that camu camu oil has a high antioxidant percentage (IC50= 114.72 μg mL-1).", "num_citations": "1\n", "authors": ["184"]}
{"title": "Gluteal contour restoration in antiretroviral users and its quality-of-life related impacts: a historical cohort study\n", "abstract": " Introduction: Since the introduction of highly active antiretroviral therapy for the treatment of human immunodeficiency virus (HIV), disease mortality has been dramatically reduced worldwide. One related side effect from the use of these drugs is gluteal lipodystrophy. The aim of this study is to assess the quality-of-life impact of correcting this deformity in HIV patients. Methods: A historical cohort study was conducted between January 2010 and December 2014 with 23 patients, assessing the quality of their lives using the Nottingham Health Profile. A statistical analysis was performed using the McNemar test for related samples. Results: There was a significant difference between preoperative and postoperative response in 19 of the 38 questions. Conclusion: We may say that gluteal reconstruction plays a role in improving quality of life for HIV patients who have been affected by antiretroviral related gluteal lipodystrophy.", "num_citations": "1\n", "authors": ["184"]}
{"title": "The analysis of COP and joint position sense in university soccer players with and without ankle instability\n", "abstract": " O objetivo do estudo foi comparar o comportamento do COP e do sentido de posição articular passivo em indivíduos com e sem instabilidade de tornozelo, e correlacionar as variáveis de COP e sentido de posição articular passivo. Participaram 20 indivíduos, divididos em dois grupos: grupo estável (GE) e grupo instável (GI). A avaliação do COP foi feita com o teste de apoio unipodal, com olhos abertos e fechados sobre uma plataforma de força. O teste de reposicionamento articular passivo foi realizado com os olhos vendados. O tornozelo foi posicionado em um ângulo alvo (10° e 20°) e o dinamômetro movia passivamente o tornozelo, então os participantes eram instruídos a apertar o botão para parar o movimento quando sentissem que o tornozelo estava no ângulo alvo, obtendo assim o erro angular absoluto (EAA). Foram obtidas as variáveis: deslocamento total (DT); desvio padrão ântero-posterior (DPap) e médio-lateral (DPml); velocidade média total (VMT); velocidade média ântero-posterior (VMap) e médio-lateral (VMml). A comparação entre dados que apresentaram distribuição normal foi feita com o teste t de Student, enquanto que para DT e DPml foi utilizado o teste de Mann-Whitney. Da mesma forma, foram usados os testes de Pearson e Spearman para correlacionar as variáveis. Foi adotado α < 0,05. Houve diferença entre EAA-10° (p < 0,05). Foram encontradas fortes correlações entre: EAA-10° e VMT (p < 0,01 r = −0,867); EAA-10° e VMap (p < 0,01 r = −0,854); EAA-10° e VMml (p < 0,01 r = −0,771), na condição olhos abertos, e EAA-10° e DT (p < 0,05 r = −0,666); EAA-10° e DPap (p < 0,05 r = −0,685) e EAA-10° e VMml …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Farelo de arroz integral para bezerras de corte em pastejo de Papuã\n", "abstract": " O estudo foi realizado com o objetivo de avaliar o desenvolvimento de bezerras de corte quando elas permaneceram exclusivamente em pastagem de papuã (Urochloa plantaginea (Link) Hitch) ou em papuã e recebendo farelo de arroz integral (FAI) como suplemento, fornecido de segunda a sexta-feira. O delineamento experimental foi inteiramente casualizado, com medidas repetidas no tempo, com dois tratamentos e três repetições de área. As bezerras que recebem FAI apresentam maior ganho médio diário a partir do 42º dia de uso da pastagem e peso corporal 21% superior ao final do período de pastejo. A taxa de lotação, ganho de peso por área, altura de garupa, relação peso corporal: altura e escore de condição corporal foram semelhantes para as bezerras exclusivamente em papuã ou em papuã e recebendo FAI. Bezerras de corte em pastagem exclusiva de papuã dos 15 aos 18 meses de idade alcançaram desenvolvimento corporal, escore de trato reprodutivo (4, 22 pontos) e área pélvica (206, 3 cm²) adequadas para serem acasaladas aos 18-20 meses de idade.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Characterization of biodegradable mulch black films incorporated with organics fertilizers and rice husk ash\n", "abstract": " The effects of organic fertilizer, rice husk ash, both from renewable resources, were evaluated. Both of them were incorporated in biodegradable black mulch films. Morphological, mechanical and thermal properties based on PBAT/PLA composites with 2 % wt. of carbon black were investigated. In addition, the formulations were prepared with 1 % wt. to 2 % wt. rice husk ash and 2 % wt. to 4 % wt. % organic fertilizer The samples were produced by melt extrusion process, using a twin screw extruder machine and blown film extrusion process. As can be seen the properties of biodegradable mulch film samples were investigated by tensile tests, XRD, FTIR, TG, MEV analyses. Correlation between properties were discussed. According to the results it is possible to apply this composite as film for agricultural protection.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Desenvolvimento e avaliação da aplicação Creuza vs. Aedes: prevenção do Aedes aegypti\n", "abstract": " Este artigo apresenta um jogo lúdico digital chamado CREUZA VS. AEDES que visa fornecer informaçõesao jogador para prevenção das doenças transmitidas pelo mosquito Aedes aegypti, que atualmente é um dos maioresproblemas de saúde que afeta o Brasil, além de frisar o combate aos possíveis criadouros dos mosquitos. O jogo foi desenvolvidocom baixo custo computacional para ser usado em diversos dispositivos. Com o intuito de validar a aplicação, usuários realizaram testes e responderam questionários para que suas respostas e observações possam ser usadas noaprimoramento do jogo que será disponibilizado em lojas virtuais.ABSTRACTThis paper presents a digital playful game called CREUZA VS. AEDES which aims to provide information tothe player for the prevention of diseases transmitted by the mosquito Aedes aegypti, which is currently one of the biggesthealth problems affecting Brazil, in addition to stress the fight against potential breeding of mosquitoes. The gamewas developed with low computational cost to be used in various devices. In order to validate the application, users conducted tests and completed questionnaires, and their answers and comments will be used in the game enhancementthat will be available in online stores.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Consequences of the association between HTLV-1 and tuberculosis\n", "abstract": " HTLV-1 modifies the immune response and clinical presentation of bacterial, fungal and helminthic infections. There are also evidences that helminthic infections may modify disease expression related to HTLV-1, increasing the occurrence of Adult T cell leukemia (ATL) and decreasing the development of HTLV-1 associated myelopathy or tropical spastic paraparesis (HAM/TSP). Recently it has been shown that HTLV-1 increases susceptibility for tuberculosis (TB) but the consequences of this co-infection in the clinical course of TB and HTLV-1 infection is not so clear. The aim of this study was to evaluate if TB influences neurologic disease in HTLV-1 infected subjects and to evaluate sequels of TB in HTLV-1 infected individuals. This is a nested case control study with the participation of 32 patients with previous diagnosis of TB and positivity sorology for HTLV-1 and 32 controls with HTLV-1 without TB paired by …", "num_citations": "1\n", "authors": ["184"]}
{"title": "The clinical spectrum of HTLV-1 infection\n", "abstract": " The Human T lymphotropic virus type 1 (HTLV-1) infection is neglected mainly due to the concept that it is associated with a low morbidity. However, a few reports have shown that a large percentage of HTLV-1 infected subjects have signs and symptoms of a variety of diseases. Nevertheless the relationship between the cause and effect needs to be proven. The HTLV-1 associated myelopathy (HAM/TSP) and adult T-cell leukemia (ATL), the main disease associated to HTLV-1, are characterized by high proviral load and lymphocyte activation. Moreover the exaggerated inflammatory response and proviral load are markers of diseases associated with HTLV-1. In this study we compare the frequency of sicca syndrome, chronic periodontal disease (CPD), HTLV-1 associated over reactive bladder (HTLV-1 OAB), artropathy and erectile dysfunction (ED) in HTLV-1infected subjects who did not have definitive HAM/TSP with that observed in seronegative controls. The proviral load was measured by real time PCR and production of interferon–g and TNF in supernatants of lymphocyte culture by ELISA. Of the 180 individuals participants of the study, 106 (50.8%) were female, 56 (31.1%) had sicca syndrome, 37 (20.5%) had CPD, 32 (17.7%) had HTLV-1 OAB, 29 (16.6%) had HTLV-1 associated arthropathy. Moreover of the 74 males 31 (41.8%) had ED. All these manifestations were higher (P< 0.001) in HTLV-1 infected subjects than in controls. Proviral load in sicca syndrome, CPD, HTLV-1 OAB and ED patients were higher (P< 0.05) than in 78 (43, 3%) HTLV-1 carriers. Patients with OAB, CPD and sicca syndrome had higher TNF and IFN-g than HTLV1 …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Análise Preliminar da Viabilidade de Implantação do Hidroanel Metropolitano de São Paulo para o Transporte de Cargas\n", "abstract": " O sistema de transportes da Região Metropolitana de São Paulo-RMSP tem sido alvo de diversos estudos de alternativas para transporte de cargas, devido ao constante crescimento populacional e aumento da demanda de produtos e serviços que refletem nos problemas viários. Estes problemas geram congestionamentos, aumentos de custos de transporte que refletem no preço final dos produtos e serviços, além de impactar na qualidade de vida das pessoas. Entretanto, se minimizados, podem melhorar a logística de na região metropolitana de São Paulo, além de propiciar redução na emissão de poluentes. Dentre as alternativas propostas neste trabalho, sugere-se a implantação de um anel hidroviário (Hidroanel) na RMSP, que pode conectar os rios de São Paulo, possibilitando o aproveitamento dos corpos d’água, especialmente os rios Tietê e Pinheiros.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Visão computacional para monitoramento ambi-ental das áreas cobertas por linhas de transmis-são utilizando reconhecimento de padrões\n", "abstract": " Este projeto teve como objetivo o desenvolvimento de um sistema computacional capaz de adquirir e processar imagens de áreas de preservação ambiental visando gerar alarmes de incêndio. Estes alarmes são gerados utilizando algoritmos para detecção de fogo e fumaça. Os alarmes podem ser gerados individualmente para cada algoritmo e também combinado. Um sistema piloto foi implantado no Parque Tecnológico de Belo Horizonte (BHtec), sendo validado em um incêndio real detectado pelas câmeras. Este incêndio ocorreu a aproximadamente 3km da localização das câmeras, e gerou uma grande repercussão na imprensa, sendo o resultado vinculado na TV, rádio, veículos impressos e internet.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Verificação de regras em modelos BIM: um estudo de caso sobre projeto de arquitetura de estações metroviárias\n", "abstract": " A adoção da Modelagem da Informação da Construção (BIM) pela indústria da construção trouxe novos processos e usos, dentre eles a Verificação de Regras. Esta operação integra o processo de análise e aprovação de projetos, onde normas, leis e códigos são transformados em regras configuradas em um software especializado, possibilitando a verificação automatizada do seu atendimento no modelo BIM, com a geração de um relatório de conformidade. Este processo permite ganhos em tempo e precisão, já que o analista pode focarse apenas nos resultados de não conformidade. Para que a Verificação de Regras seja efetiva, é necessário verificar se plataforma escolhida atende aos tipos de regra necessários. Deve-se também verificar se a criação do modelo BIM foi realizada corretamente e se contém todas as informações necessárias. Este artigo analisará o processo de Verificação de Regras, detalhando cada etapa. Regras para projetos de estação metroferroviárias serão utilizadas como estudo de caso. O aplicativo Solibri Model Checker (SMC) foi escolhido como plataforma para a verificação de regras e as regras aplicadas ao estudo de caso são classificadas conforme suas características e adequação para implementação no SMC. Em seguida, serão implementadas e validadas com um projeto real em BIM.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Efeito da concentração molar total na cinética de adsorção bicomposto de íons prata e cobre em argila bentonítica\n", "abstract": " A remoção de compostos inorgânicos de efluentes industriais tem ganhado bastante destaque, especialmente no que se refere aos metais tóxicos. Compostos solúveis em água e bioacumulativos, esses metais podem trazer sérios danos ao meio ambiente e aos seres vivos, o que tem gerado legislações cada vez mais restritas à emissão desses contaminantes nos corpos d’água. Diversos métodos podem ser empregados em sua remoção, sendo o mais comum a precipitação química. No entanto, inflexibilidade no processo ou falta de ineficiência nos métodos convencionais, vem reforçando o emprego de novas técnicas, com destaque ao processo de adsorção, que tem apresentado bons resultados, não só em eficiência, mas também econômicos. No presente trabalho foi avaliado o emprego de argila bentonítica Verde-lodo para remoção de cobre e prata, em soluções equimolares, porém com concentrações diferentes. Esse adsorvente se mostrou eficiente na remoção monocomposta de ambos os metais. Como resultado, obteve-se maior adsorção de cobre, quando na presença de prata, a qual aparentou ter sofrido inibição, reduzindo sua quantidade adsorvida em sistema bicomposto. Além disso, os modelos cinéticos de pseudoprimeira e pseudossegunda ordem, de difusão intrapartícula e de Boyd foram ajustados aos dados experimentais, fornecendo ajustes razoáveis.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Especificação de processos de apoio gerencial ao processo de testes de Software\n", "abstract": " Há diferentes processos de apoio presentes em normas e modelos de qualidade que podem ser divididos em categorias como Gerenciais (processo de", "num_citations": "1\n", "authors": ["184"]}
{"title": "Effect of the pre-treatment of banana pseudostem fiber for polyaniline adhesion\n", "abstract": " Development of new materials from a renewable source is essential for adding value to Brazilian products. Banana pseudostem is a co-product from bananas production and can be used as a source for vegetable fibers. In the polyaniline synthesis, one important variable is the adhesion of the synthesized polymer on the synthesis surface. In this work, the effect of the surface pre-treatment of banana pseudostem fibers was evaluated aiming the adhesion of polyaniline on the resulting surface. Fibers were treated with NaOH aqueous solution and heating. FT-IR and TGA analysis were used in order to characterize these fibers before and after the superficial treatment. Polyaniline were synthesized by conventional methods on the banana pseudostem fiber not treated and after the superficial treatment. Resulting fiber were evaluated by FT-IR, TG, DSC and SEM, showing that the superficial treatment contributes to an improvement of the polyaniline adhesion on the fibers.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Deposição e caracterização de filmes de óxido de cobalto por sputtering reativo\n", "abstract": " Filmes de óxido de cobalto apresentam interesses para aplicações em catálise, sensores de gás e para estudos do efeito de exchange bias em multicamadas de CoO/Co/CoO. Neste trabalho, filmes de óxido de cobalto foram depositados usando a técnica de DC sputtering, nas potências 80,120 e 240W. A superfície dos filmes preparados a potências menores não apresentaram trincas. Medidas de difração de raios X indicaram a presença da fase Co3O4 nas deposições de 80 e 120 W. Para deposição com 240 W, observa-se apenas a presença da fase CoO. Os espectros de espalhamento Raman dos filmes apresentaram bandas referentes aos modos do Co3O4 para todas as amostras crescidas, já a análise de transmitância no infravermelho apresentou bandas de absorção relacionadas à fase CO3O4 nos filmes depositados com baixa potência, e uma mistura de bandas do CoO e Co3O4 na deposição a 240 W. O espectro de transmitância no UV/VIS/NIR apresentou absorções relacionadas a transições eletrônicas do óxido de cobalto em em 0,8,0,9,1,7 e 3eV na amostra crescida em 80 W. Com o objetivo de criar camadas nanométricas de cobalto puro, intercaladas com filmes de óxido de cobalto, foram depositados filmes nos quais o fluxo de oxigênio foi interrompido. A potência utilizada foi 120 W e os tempos de interrupção foram 120 e 12s. Imagens de microscopia eletrônica de varredura indicaram que não houve rachaduras na superfície dos filmes e medidas na seção transversal das amostras indicaram formaram das camadas metálicas no interior do filme depositado com interrupção de oxigênio por 120s. Análise de difração …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Use of the cavitation hydrodynamics applied to water treatment\n", "abstract": " The hydrodynamic cavitation is presented as an advanced oxidation process (AOP), allowing to integrate the processes of water treatment for human consumption. This research aimed to investigate the effects of different hydrodynamic cavitation reactors for treating water contaminated with sewage, evaluating the microbiological contamination and physicochemical parameters. Three models were constructed with different rotors reactors (R1, R2 and R3). The results obtained in the reactors R1, R2 and R3 have shown a reduction in the concentrations of chemical parameters in all samples, particularly nitrites, nitrates, bicarbonates, and total hardness, while the microbiological contamination was completely inactivation (total coliforms and Escherichia coli).", "num_citations": "1\n", "authors": ["184"]}
{"title": "Competitive adsorption kinetics and equilibrium of zinc and copper ions in expanded vermiculite\n", "abstract": " Industrial effluents represent the main resource of pollution of soil and water with heavy metals. These elements are extremely dangerous in high concentrations to fauna and flora, because they are bio accumulated in living organisms. Then, many removal techniques have been studied to optimize the waste treatment, aggregating low cost to great removal capacity. This work aims to investigate adsorption process of binary system of zinc and copper ions onto expanded vermiculite, an alternative adsorbent material, through kinetics experiments and isotherms at 293 K, 313 K and 333K. Furthermore, kinetics curves were predicted by Intraparticle Diffusion, Pseudo first-order and Pseudo second-order models. Equilibrium data were fitted by Langmuir and Langmuir-Freundlich’s model. This adsorption process demonstrated to be spontaneous, favorable, endothermic and more selective for copper ions.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Dos dentes de Spheroides Testudineus (Baiacu-mirim). Estudo do enamelóide ao microscópio eletrônico, à luz polarizada, por métodos histoquímicos e sob ação da colagenase\n", "abstract": " Utilizando a microscopia eletrônica, à luz polarizada, métodos histoquímicos e a ação da colagenase estudamos alguns aspectos da matriz do enamelóide dos dentes do baiacu, Spheroides testudineus, concluindo que neste peixe essa matriz está baseada em trama fibrilar constituída de fibras colágenas e por substância cimentante rica em mucopol issacarídeos ácidos e neutros, associados a proteínas cujos aminoácidos detectados são aqueles que fazem parte das estruturas adamantinas de mamíferos; que essa matriz prossegue em sua mineralização, mesmo depois de inteiramente formada, quando sofre um amadurecimento progressivo, como selora esmalte.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Análise experimental e numérica de lajes cogumelo de concreto armado\n", "abstract": " O uso de capitéis é uma das formas de se aumentar a resistência à punção de ligações laje-pilar. As recomendações normativas para a definição da geometria e verificação da resistência última de ligações com capitéis são pouco abrangentes, sendo poucas as pesquisas experimentais disponíveis sobre o tema. Este artigo discute aspectos relevantes do desenvolvimento histórico das lajes cogumelo e apresenta resultados de 4 ensaios experimentais, sendo 1 laje lisa de referência e 3 lajes cogumelo com capitéis de seção circular. Estes resultados são comparados com as estimativas das normas EUROCODE 2 (2004) e NBR 6118 (2007) e com modelos numéricos não-lineares a fim de se compreender melhor a distribuição das tensões e o mecanismo de ruptura de lajes cogumelo.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Conducting Empirical Studies to Evaluate a Technique to Inspect Software Testing Artifacts\n", "abstract": " BRITO, Jardelane y DIAS-NETO, Arilo Claudio. Conducting Empirical Studies to Evaluate a Technique to Inspect Software Testing Artifacts. CLEIej [online]. 2013, vol. 16, n. 1, pp. 10-10. ISSN 0717-5000.", "num_citations": "1\n", "authors": ["184"]}
{"title": "A Systematic Mapping on Model Based Testing applied to Web Systems\n", "abstract": " Web systems have become simply fundamental in several areas. In addition, Model-Based Testing (MBT) is an approach involves the development of a model to generate tests. As web systems and MBT have attracted the interest of software researcher community, it is necessary to identify publications related to these areas. Therefore, we carried out a systematic mapping study in order to get a body of knowledge regarding this research field. We proposed three research questions and defined a search protocol to support the mapping study execution. Our study selected 57 papers from 160 papers retrieved from the defined sources. These papers were published between 2005 and 2013. This study will support researchers to obtain an overview of type of contribution, models, tools, test location, testing level, among other perspectives, which are used in MBT applied to web systems.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Determination of the minimum number of vertical jumps to monitor the responses to plyometric training/Determinacao do numero minimo de saltos verticais para monitorar as …\n", "abstract": " The aim of this study was to identify the number of jumps needed to monitor the responses to plyometric training. We selected 44 men, mean age 23.3 [+ or-] 3.3 years, height 176.0 [+ or-] 7.3 cm and weight 73.7 [+ or-] 6.7 kg. The volunteers participated in familiarization, reliability and pretraining assessment. Then participants were randomly distributed in training and control groups. The training group performed 6 weeks of monitored plyometric training. The monitoring was carried out from the performance in 8 countermovements jumps performed at the beginning of the sessions. After six weeks of training, all volunteers were reassessed. To identify the number of jumps needed to the monitoring, the results obtained in the 3, 4, 5, 6 and 7 first jumps were compared with the results obtained with 8 jumps. The statistic used was one-way ANOVA and Tukey's post hoc test. Significant performance enhancements were …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Anthropogenic Influence in the Pond of Water Quality in the Amazon Region\n", "abstract": " Anthropogenic Influence in the Pond of Water Quality in the Amazon Region | Chemical Engineering Transactions Anthropogenic Influence in the Pond of Water Quality in the Amazon Region Chemical Engineering Transactions Chemical Engineering Transactions Volumes Current Volumes 2009–present Volumes 2002–2008 Editorial Board Submit New Article Paper Submission Publication Payment Login About Aims & Scope Journal Opening Journal Policies DOI Description Contact Admin Login Admin Login Vol 24 (2011) Anthropogenic Influence in the Pond of Water Quality in the Amazon Region Research Articles https://doi.org/10.3303/CET1124210 Published 20 April 2011 Kimura, S. Almeida Neto, AF Gurgel Carlos Da Silva, M. Download PDF How to Cite Kimura S., Almeida Neto A., Gurgel Carlos Da Silva M., 2011, Anthropogenic Influence in the Pond of Water Quality in the Amazon Region, Chemical , 24-…", "num_citations": "1\n", "authors": ["184"]}
{"title": "Dengue: história natural e definição de casos graves e potencialmente graves\n", "abstract": " A dengue constitui-se em síndrome febril viral causada por quatro sorotipos (DENV) de vírus da família Flaviviridae. É transmitida aos humanos pelos mosquitos do gênero Aedes e possui grande importância epidemiológica por sua grande incidência, distribuição global e morbimortalidade. Sua história natural é caracterizada por três fases: febril, crítica e de recuperação. É na fase crítica que pode haver sintomatologia de maior gravidade, podendo ser reconhecida como assintomática, dengue não grave e dengue grave. Métodos: foi realizada revisão da literatura em artigos científicos disponíveis nos bancos de dados do Pubmed e Scielo; e no projetos diretrizes brasileiro.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Prótese glútea: O uso da lipoaspiração na melhora dos resultados\n", "abstract": " Resultados:Dos 41 pacientes, 40 eram do sexo feminino e 1 do sexo masculino, com média de idade de 44, 38 anos, variandode 22 a 65 anos. O volume da prótese variou de 240 a 360 ml. A associação entre as cirurgias ocorreu em 70% dos pacientes. As complicações ocorreram em duas pacientes. Discussão Aassociação entre lipoaspiração e prótese glútea na busca de melhores resultados possibilitou a correção de grandes lipodistrofias, para melhora do contorno corporal, quando a lipoenxertia não traz resultados satisfatórios.Conclusão:A associação de prótese glútea com lipoaspiração é uma conduta segura, de baixa complexidade, que apresenta bons resultados no contorno corporal, com baixas taxas de complicação.ABSTRACTIntroduction:The liposuction brought new possibilities for the improvement of the body contour. The use of prosthesis in order to increase the gluteal region brought interesting options for the treatment of moderate and accentuated hypertrophy, in which the lipograft did not fulfill the expected results. The purpose of the present study was to analyze the results of increase gluteoplasty, its association with liposuction, the surgical technique used, its results and its complications.Method:The study was developed at the Daher HospitalStudy Center, retrospectively, where 41 patients had been submitted to increase gluteoplasty with the use of silicone prosthesis, between January 2005 and August 2010. The technique used was of placement of intramuscular prosthesis with incision in the intregluteal sulk. The liposuction was associated or not according to the judgment concerning its necessity.Results:From 41 …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Estratégias de suplementação energética para bovinos em recria em pastagens tropicais durante as águas e seus efeitos na terminação em confinamento\n", "abstract": " Os objetivos deste estudo foram avaliar estratégias de suplementação energética para bovinos em recria, mantidos em pastagens tropicais bem manejadas durante as águas, quanto ao desempenho animal, capacidade de suporte das pastagens, ganho de peso por área e desempenho dos animais durante a terminação em confinamento. Os tratamentos testados foram: T1) Controle: somente mistura mineral; T2) Constante: fornecimento contínuo do concentrado na dose de 0,6% do PC; T3) Crescente: fornecimento de 0,3% do PC em concentrado no primeiro terço, 0,6% do PC no segundo terço e de 0,9% do PC no terceiro terço do período de recria dos animais. Foram utilizados 76 garrotes de corte, com peso inicial de 208 kg e 8 meses de idade. Os animais foram alocados em 8,5 ha de pastagem de capim Brachiaria brizantha cv. Marandu, manejados em sistema rotacionado com intervalo de desfolha variável. Foram avaliadas a massa de forragem (MF) pré e pós pastejo (kg MS ha-1), a composição morfológica (% de folhas, colmos e material morto) e valor nutritivo da forragem, o ganho de peso individual (kg cab-1 dia-1), a taxa de lotação (cab ha-1) e o ganho de peso por área (kg ha-1) durante a fase de recria dos animais. Na fase de confinamento dos animais foram avaliados o ganho de peso diário individual (GPD em kg cab-1), o consumo de matéria seca (kg dia-1) e a eficiência alimentar dos animais (kg de ganho diário kg de alimento consumido-1).Os animais suplementados apresentaram GPD superiores aos animais não suplementados (0,535, 0,787 e 0,867 kg cab-1 dia-1, respectivamente para os tratamentos controle …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Um Relato de Experiência do Uso de Programação de Jogos para a Melhoria do Raciocínio Lógico em Crianças\n", "abstract": " A tecnologia tem se tornado cada vez mais presente no cotidiano dos estudantes desde os primeiros anos de sua vida acadêmica, como um importante recurso no processo de aprendizado. Nesse cenário, o uso de atividades interativas despertam o interesse dos alunos, quebrando barreiras entre o desconhecido e o desenvolvimento lógico. Com este objetivo, surgiram algumas ferramentas computacionais que apoiam o processo de ensinoaprendizagem por meio de recursos tecnológicos. Neste artigo, é apresentado de um experimento conduzido com alunos do 2º ano do ensino fundamental sobre o uso de tecnologias voltadas ao ensino de programação de computadores (a ferramenta Scratch). Neste experimento, metade dos alunos participou de um treinamento voltado ao ensino de conceitos de programação de computadores por meio da criação de jogos digitais e a segunda metade não recebeu o treinamento. Após o treinamento, os alunos dos dois grupos foram submetidos a um desafio de lógica (“O lobo, a ovelha e a couve”). Como resultado, os alunos que participaram do treinamento apresentaram tempos menores (em média, 52% inferior) para resolver o desafio de lógica proposto em comparação com o grupo que não recebeu treinamento. Tais dados foram submetidos a testes estatísticos e os resultados sugerem diferença estatisticamente significante entre os grupos, indicando um melhor desempenho no raciocínio lógico de crianças que participaram do treinamento na ferramenta Scratch.", "num_citations": "1\n", "authors": ["184"]}
{"title": "UTILIZAÇÃO DE MATÉRIAS-PRIMAS LIGNOCELULÓSICAS PARA PRODUÇÃO DE ÁLCOOL ETÍLICO: ESTUDOS DA HIDRÓLISE ÁCIDA DA PALMA FORRAGEIRA E DA DESTILAÇÃO DO HIDROLISADO FERMENTADO\n", "abstract": " Este trabalho teve o objetivo de estudar o processo de hidrólise ácida, utilizando-se da matéria-prima lignocelulósica raquete da palma forrageira, bem como, o projeto de adaptação do alambique de cobre para destilar até concentração de etanol 93 o GL. Foi realizado um pré-tratamento ácido a baixas temperaturas seguindo a matriz de planejamento fatorial 2 3 onde as variáveis foram: temperatura, concentração do ácido e razão entre massa seca e volume de ácido, o tempo foi mantido constante e igual a uma hora. Análises cromatográficas mostaram que o melhor resultado, ou seja, maior concentrações de xilose e arabinose, se deu nas seguintes condições: temperatura igual a 90ºC, concentração de ácido de 5% e razão de 1/8. A hidrólise foi realizada utlizando-se o material sólido resultante do pré-tratamento que mostrou o melhor resultado nas seguintes condições: temperatura igual a 190ºC, concentração de ácido de 8% e razão de 1/8, por uma hora. Tratou-se o licor resultante da hidrólise quanto a correção de pH e adição de nutrientes e adcionou-se ao mosto a levedura (Saccharomyces cerevisiae) na concentração de 10g/L para teste preliminar de fermentação. O ambiente foi mantido a temperatura entre 28 e 32ºC e deuxou-se fermentar por 176 horas. O material fermentado foi analisado por cromatografia gasosa e não apresentou nehuma concentração de etanol. Para a adaptação do alambique de cobre construiu-se uma coluna de recheio feita em aço inox.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Reduction in the consumption of effluent generated in nile tilapia slaughterhouse through the concepts implantation of cleaner production (CP)\n", "abstract": " the nourishing industry is a segment that makes use of high water consumption due to necessity of the hygienic cleaning of the establishments and the maintenance of the good quality of the food. It enters the nourishing industries with bigger water consumption we have the fishery industry which generates effluent around 5.4 m(3). t(-1) of processed fish. This work had as objective the reduction in the water consumption of the processing of Nile tilapia through the implantation of P+L techniques, for had been in such a way carried through hydraulical alterations in the filleting tables aiming at the minimum possible water consumption for two methods of filleting, eviscerated and not eviscerated, as well as the comment of the alterations in the generated quality of the effluent one. In the present study, the reduction in the water consumption in the filleting process corresponded 98.16% for method EV considering an average time of processing of 3 hours for 32.99 kg of fish, and for method NEV the reduction was of 97.97% with average time of processing of 2.1 hours for 34.96 kg of fish, thus demonstrating that the P+L techniques are efficient for the reduction of the water consumption.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Religiosidade como força da família: um estudo de caso\n", "abstract": " Dias, AB, Silva, MRS, Zillmer, JGV, Arruda, P., & Neto, A.(2013). Religiosidade como força da família: um estudo de caso. Ciência, Cuidado E Saúde, 7. https://doi. org/10.4025/cienccuidsaude. v7i0. 6690", "num_citations": "1\n", "authors": ["184"]}
{"title": "Environmental license and grant for Water usage to aquaculture activity: Is there integration between these aspects?\n", "abstract": " The national and international aquaculture policy develops itself towards the productivity increase and sustainable growth. Therefore, planning and policy that lead the sustainable development of the activity are needed. The aquaculture had recently received attention about its legal aspects, mostly with regard to license and grant. This work aims the aquaculture legislation discussion about license and grant, which represent aspects of the Environmental National Policy and Water Resource National Policy respectively.", "num_citations": "1\n", "authors": ["184"]}
{"title": "DISCUSSION ON THE NATURAL HISTORY OF THE ACUTE FORM (AF) PARACOCCIDIOIDOMYCOSIS (PCM): TWO CASES WITHOUT OBVIOUS EXPOSITION\n", "abstract": " DISCUSSION ON THE NATURAL HISTORY OF THE ACUTE FORM (AF) PARACOCCIDIOIDOMYCOSIS (PCM): TWO CASES WITHOUT OBVIOUS EXPOSITION", "num_citations": "1\n", "authors": ["184"]}
{"title": "Estratégia de design do software EQUIL, uma simulação para ensino de equilíbrio químico e sua comparação, em sala de aula, com o software LE CHAT 2.0.[Apresentação Encontro …\n", "abstract": " Este trabalho possui dois objetivos, sendo o primeiro fundamentar as bases que orientaram o design do “Equil”, um software para ensino de equilíbrio químico, em nível secundário. O segundo objetivo é apresentar os resultados de um experimento com turmas do ensino médio, no qual se investigou os resultados obtidos com uma turma controle (n= 25) e turmas utilizando os programas Equil (n= 24) e Le Chat (n= 23). Esta análise evidenciou um desempenho superior do grupo que utilizou o primeiro software em relação aos demais, em vários aspectos relacionados ao domínio representacional de um fenômeno químico. Contudo, uma análise do desempenho dos estudantes em testes tradicionais de concepções alternativas não mostra diferença estatisticamente significativa entre grupos. Finaliza-se com uma discussão sobre a necessidade de utilizar todos os níveis de representação de um fenômeno químico de forma simultânea dentro do mesmo software, para um ensino mais eficiente.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Eletrodeposição do filme de Co-Mo-B resistente à corrosão: otimização dos parâmetros operacionais\n", "abstract": " Na tentativa de substituir o cromo, metal mais usado para proteção contra corrosão, foi estudada a eletrodeposição da liga de Co-Mo-B, que também apresenta alta resistência à corrosão e ao contrário do cromo não oferece riscos a saúde e ao meio ambiente. A otimização da eletrodeposição da liga de Co-Mo-B foi avaliada através de um planejamento fatorial, no qual foi estudada a influência da densidade de corrente, e do pH, em função da eficiência de deposição do sistema. O banho eletroquímico usado para o estudo contém molibdato de sódio, sulfato de cobalto, fosfato de boro, citrato de sódio, sulfato de amônio e 1-Nadocecilsulfato. Os resultados mostraram que o processo de eletrodeposição da liga pode ser desenvolvido com bom rendimento sob as seguintes condições operacionais: densidade de corrente 20 mA/cm 2, pH 6, agitação de 20 rpm e temperatura 25 C. A eficiência máxima atingida …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Massa paranasal: dacrioestenose congênita? Relato de caso\n", "abstract": " O objetivo deste é descrever uma criança portadora de massa paranasal, atentando para a importância dos diagnósticos diferenciais. RELATO DO CASO: ACS, 6 meses, sexo feminino, desde o nascimento apresentando abaulamento não inflamatório, no canto medial do olho esquerdo, lacrimejamento e hiperemia no olho direito. Ao exame apresentava fenômeno de Bell negativo bilateral, lagoftalmo à direita, ulceração e opacidade corneana à direita; presença de lesão arredondada, de superfície lisa no canto medial do olho esquerdo, sem sinais inflamatórios, medindo aproximadamente 2 cm de diâmetro, não pulsátil. À palpação, a lesão era elevada, de consistência fibroelástica, imóvel, indolor, irredutível. À propedêutica das vias lacrimais, não havia refluxo à compressão, o teste de Milder foi negativo em ambos olhos e as vias apresentavam-se pérvias à dacriocistografia. O exame tomográfico revelou tratar-se de meningocele fronto-etmoidal. COMENTÁRIOS: Os autores chamam a atenção para a adequada semiologia para a investigação das massas paranasais, a fim de se instituir o adequado tratamento.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Estudo da relação entre estresse oxidativo e sintese de proteinas de estresse\" HSP70\" no sangue de animais submetidos a diferentes niveis de exercicio fisico\n", "abstract": " Nosso estudo investigou em amostras de sangue de ratos do tipo ¿Wistar¿ a correlação entre estresse oxidativo (plasma), modulação do estado antioxidante/oxidante (hemácea) e níveis de proteínas de estresse ¿HSP70¿ (leucócito total) em diferentes sobrecargas de corrida em esteira rolante: exercício exaustivo agudo e treinamentos contínuo e intermitente crônico e severo. Os resultados mostraram que o exercício agudo em animais sedentários induziu um aumento nos níveis dos marcadores oxidativos em plasma (proteínas carboniladas e TBARS) juntamente com uma elevação da atividade das enzimas antioxidantes (catalase e gluationa redutase) e da expressão de ¿HSP70¿ em leucócitos. Os protocolos de treinamento crônico mostraram um mesmo padrão adaptativo: o aumento da sobrecarga de exercícios induziu elevação nos níveis de lesões oxidativas e alterações musculares. Porém, obtivemos nesta situação um aumento de atividade das enzimas antioxidantes e níveis de ¿HSP70¿, o que poderia ser considerado uma resposta adaptativa ao estímulo de treinamento. A estabilização da sobrecarga providenciou um decréscimo nos níveis de estresse oxidativo e expressão de ¿HSP70¿ em ambos os protocolos. Porém, os protocolos de treinamento severo, tanto contínuo quanto intermitente, induziram uma acentuada situação de estresse oxidativo e expressão de ¿HSP70¿. A redução no tempo de recuperação entre as sessões de treinamento e a elevação da sobrecarga de corrida foram fatores agravantes para o aumento da severidade do estresse. Concluindo, os marcadores de estresse oxidativo estudados neste …", "num_citations": "1\n", "authors": ["184"]}
{"title": "RESISTÊNCIA DE LINHA DE SOLDA EM MOLDADOS POR INJEÇÃO DE COMPÓSITOS DE POLIPROPILENO COM TALCOS E FIBRAS DE VIDRO\n", "abstract": " The presence of weldlines in injection moulded reinforced thermoplastics contributes to intense weakness in mechanical properties, due to unfavorable orientation of reinforcements in the weak plane of the weldline. The tensile mechanical properties in presence and absence of weldline in injection moulded composites of polypropylene copolymer (PPcopol) reinforced with short glass fiber and three different grades of talcs (medium, fine and ultrafine size) were investigated. Composites of PPcopol with 10, 20, 30 and 40 wt.% of filler were compounded in a co-rotating twinscrew extruder and test specimens for tensile tests were injection moulded with and without frontal weld line (butt weld). The depreciation factor in tensile strength (DFTS) of the moulded composites with weldline increases with filler volume fraction, so that DFTS is greater for glass fiber than for talc moulded composites. The talc size had minor influence on DFTS values of PP composites with weldline. These results on weldline tensile strength of PP composites were corroborated with scanning electronic microscopy analysis of the preferential fiber/talc orientation patterns in the weldline region of tensile specimens with and without weldline.", "num_citations": "1\n", "authors": ["184"]}
{"title": "The impact of care actions on the perception of the quality of the Single Health System (SUS), Brazil: a cross-sectional study\n", "abstract": " INTRODUCTION: Non-melanoma skin cancer is the most prevalent cancer in Brazil. Surgical resection is one of the pillars of management, and care actions, such as surgical task forces, are one way to reduce treatment waiting time.METHODS: In this research, we conducted a cross-sectional study with 40 patients; 20 of whom were treated by a surgical task force and 20 were controls. Epidemiological data were collected in addition to answers to nine questions related to the quality of the Single Health System (SUS in Portuguese).RESULTS: A significant difference was observed in responses related to the waiting time for surgery in the SUS (p< 0.05).CONCLUSION: One can observe an improvement in the perception of patients, with regard to the SUS, when included in care actions.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Giant lipoma of the lower limb and its impact on the vascular system\n", "abstract": " Lipomas are the most common mesenchymal tumors, which may develop in different parts of the body. However, giant lipomas are rare and sometimes difficult to diagnose owing to their location and the presenting clinical consequences. In this report, we present the case of a patient with a giant lipoma in the left popliteal region that was surgically treated after a detailed radiological assessment. Further, we discuss the preoperative diagnosis and its difficulties, often caused by the deep localization of the tumor and the impossibility of obtaining a conclusive radiological diagnosis. Moreover, we describe the successful treatment, along with the step-by-step surgical approach and the final outcome achieved.", "num_citations": "1\n", "authors": ["184"]}
{"title": "Current status of diffuse cutaneous leishmaniasis (DCL) in the State of Maranhao. I. Preliminary report\n", "abstract": " [Current status of diffuse cutaneous leishmaniasis (DCL) in the State of Maranhao. I. Preliminary report]. - Abstract - Europe PMC Sign in or create an account https://orcid.org Europe PMC Menu About About Europe PMC Preprints in Europe PMC Funders Joining Europe PMC Governance Roadmap Outreach Tools Tools overview ORCID article claiming Journal list Grant finder External links service RSS feeds Annotations Annotations submission service Developers Developer resources Articles RESTful API Grants RESTful API API use cases SOAP web service Annotations API OAI service Bulk downloads Developers Forum Help Help using Europe PMC Search syntax reference Contact us Contact us Helpdesk Feedback Twitter Blog Tech blog Developer Forum Europe PMC plus Search worldwide, life-sciences literature Search Advanced Search Recent history Saved searches Abstract Full text References & [of () . …", "num_citations": "1\n", "authors": ["184"]}
{"title": "Análisis económico de los costos de replantación de cacao\n", "abstract": " Un experimento tan largo no se puede llevar a cabo sin el apoyo de muchas personas. En nuestro caso, merecen citarse las siguientes: Dr. AL Jolly e Ing. Federico Afonso, quienes sentaron las bases filosóficas y la programática que guió el trabajo; Dr. Manuel Vidal, quien continuó con ahinco y dedicación la labor de recopilación, análisis y supervisión del trabajo; al Dr. Jorge Soria e Ing. Alfredo Paredes, cuyos sabios consejos y dedicada ayuda en los aspectos agronómicos del proyecto, sirvieron de base cuando se necesitaba tomar decisiones que involucraban los aspectos agronómicos del cultivo.En especial al señor Luis Torres Monge, en quien descansó la labor de recopilación del material económico día con día y al American Cocoa Research Institute, cuyo donativo original hizo posible el inicio del estudio. Finalmente, al Centro Tropical de Enseñanza e Investigación, cuyo apoyo financiero y moral …", "num_citations": "1\n", "authors": ["184"]}