{"title": "Software maintenance: concepts and practice\n", "abstract": " Software systems now invade every area of daily living. Yet, we still struggle to build systems we can really rely on. If we want to work with software systems at any level, we need to get to grips with the way software evolves. This book will equip the reader with a sound understanding of maintenance and how it affects all levels of the software evolution process.", "num_citations": "330\n", "authors": ["99"]}
{"title": "The effects of comments and identifier names on program comprehensibility: an experimental investigation\n", "abstract": " The e ects of comments and identi® er names on program comprehension are examined. A number of studies have been undertaken to investigate the independent impact of comments or identi® er names on comprehension but here the combined e ect of comments and identi® er names on program comprehension are also considered using controlled experimentation. Based on existing program comprehension theories, three hypotheses were formulated:(i) commented programs are more understandable than non-commented programs;(ii) programs that containfull'identi® er names are more understandable than those with abbreviated identi® er names; and (iii) the combined e ect of comments and identi® er names tend to enhance the understandability of a program more than the independent e ect of comments or identi® er names. Eightynine undergraduate computer science students, divided into four …", "num_citations": "169\n", "authors": ["99"]}
{"title": "Software maintenance: concepts and practice\n", "abstract": " Takang and Grubb begin by explaining software maintenance, then analyse the various methods which have been used in industry to date. They counter the traditional view of software maintenance as costly or impossible, by offering practical solutions.", "num_citations": "98\n", "authors": ["99"]}
{"title": "Professional issues in software engineering: the perspective of UK academics\n", "abstract": " Presents a summary and discussion of the findings of a recent survey into the academic perspective of professional issues in software engineering. The study is intended to be the first stage in a larger research programme to establish whether the academic perspective and educational practices in facilitating awareness of professional issues in software engineering are in line with the views and requirements of industry. Details of the survey method employed and results obtained from the study were presented by the authors at the 1996 Professional Awareness in Software Engineering (PASE'96) Conference (pre-proceedings, Univ. of Westminster, pp. 93-111, Feb. 1996). This article provides an overview of the findings and discusses these in the light of the issues raised at PASE'96 and elsewhere.", "num_citations": "1\n", "authors": ["99"]}