{"title": "A topos for algebraic quantum theory\n", "abstract": " The aim of this paper is to relate algebraic quantum mechanics to topos theory, so as to construct new foundations for quantum logic and quantum spaces. Motivated by Bohr’s idea that the empirical content of quantum physics is accessible only through classical physics, we show how a noncommutative C*-algebra of observables A induces a topos  in which the amalgamation of all of its commutative subalgebras comprises a single commutative C*-algebra  . According to the constructive Gelfand duality theorem of Banaschewski and Mulvey, the latter has an internal spectrum  in  , which in our approach plays the role of the quantum phase space of the system. Thus we associate a locale (which is the topos-theoretical notion of a space and which intrinsically carries the intuitionistic logical structure of a Heyting algebra) to a C*-algebra (which is the noncommutative notion of a space). In this setting, states …", "num_citations": "161\n", "authors": ["1775"]}
{"title": "Type classes for mathematics in type theory\n", "abstract": " The introduction of first-class type classes in the Coq system calls for a re-examination of the basic interfaces used for mathematical formalisation in type theory. We present a new set of type classes for mathematics and take full advantage of their unique features to make practical a particularly flexible approach that was formerly thought to be unfeasible. Thus, we address traditional proof engineering challenges as well as new ones resulting from our ambition to build upon this development a library of constructive analysis in which any abstraction penalties inhibiting efficient computation are reduced to a minimum.The basis of our development consists of type classes representing a standard algebraic hierarchy, as well as portions of category theory and universal algebra. On this foundation, we build a set of mathematically sound abstract interfaces for different kinds of numbers, succinctly expressed using …", "num_citations": "130\n", "authors": ["1775"]}
{"title": "Homotopy type theory: Univalent foundations of mathematics\n", "abstract": " Homotopy type theory is a new branch of mathematics, based on a recently discovered connection between homotopy theory and type theory, which brings new ideas into the very foundation of mathematics. On the one hand, Voevodsky's subtle and beautiful \"univalence axiom\" implies that isomorphic structures can be identified. On the other hand, \"higher inductive types\" provide direct, logical descriptions of some of the basic spaces and constructions of homotopy theory. Both are impossible to capture directly in classical set-theoretic foundations, but when combined in homotopy type theory, they permit an entirely new kind of \"logic of homotopy types\". This suggests a new conception of foundations of mathematics, with intrinsic homotopical content, an \"invariant\" conception of the objects of mathematics -- and convenient machine implementations, which can serve as a practical aid to the working mathematician. This book is intended as a first systematic exposition of the basics of the resulting \"Univalent Foundations\" program, and a collection of examples of this new style of reasoning -- but without requiring the reader to know or learn any formal logic, or to use any computer proof assistant.", "num_citations": "89\n", "authors": ["1775"]}
{"title": "The HoTT library: a formalization of homotopy type theory in Coq\n", "abstract": " We report on the development of the HoTT library, a formalization of homotopy type theory in the Coq proof assistant. It formalizes most of basic homotopy type theory, including univalence, higher inductive types, and significant amounts of synthetic homotopy theory, as well as category theory and modalities. The library has been used as a basis for several independent developments. We discuss the decisions that led to the design of the library, and we comment on the interaction of homotopy type theory with recently introduced features of Coq, such as universe polymorphism and private inductive types.", "num_citations": "82\n", "authors": ["1775"]}
{"title": "Type classes for efficient exact real arithmetic in Coq\n", "abstract": " Floating point operations are fast, but require continuous effort on the part of the user in order to ensure that the results are correct. This burden can be shifted away from the user by providing a library of exact analysis in which the computer handles the error estimates. Previously, we [Krebbers/Spitters 2011] provided a fast implementation of the exact real numbers in the Coq proof assistant. Our implementation improved on an earlier implementation by O'Connor by using type classes to describe an abstract specification of the underlying dense set from which the real numbers are built. In particular, we used dyadic rationals built from Coq's machine integers to obtain a 100 times speed up of the basic operations already. This article is a substantially expanded version of [Krebbers/Spitters 2011] in which the implementation is extended in the various ways. First, we implement and verify the sine and cosine function. Secondly, we create an additional implementation of the dense set based on Coq's fast rational numbers. Thirdly, we extend the hierarchy to capture order on undecidable structures, while it was limited to decidable structures before. This hierarchy, based on type classes, allows us to share theory on the naturals, integers, rationals, dyadics, and reals in a convenient way. Finally, we obtain another dramatic speed-up by avoiding evaluation of termination proofs at runtime.", "num_citations": "58\n", "authors": ["1775"]}
{"title": "Internal universes in models of homotopy type theory\n", "abstract": " We begin by recalling the essentially global character of universes in various models of homotopy type theory, which prevents a straightforward axiomatization of their properties using the internal language of the presheaf toposes from which these model are constructed. We get around this problem by extending the internal language with a modal operator for expressing properties of global elements. In this setting we show how to construct a universe that classifies the Cohen-Coquand-Huber-M\\\"ortberg (CCHM) notion of fibration from their cubical sets model, starting from the assumption that the interval is tiny - a property that the interval in cubical sets does indeed have. This leads to an elementary axiomatization of that and related models of homotopy type theory within what we call crisp type theory.", "num_citations": "54\n", "authors": ["1775"]}
{"title": "Guarded cubical type theory: Path equality for guarded recursion\n", "abstract": " This paper improves the treatment of equality in guarded dependent type theory (GDTT), by combining it with cubical type theory (CTT). GDTT is an extensional type theory with guarded recursive types, which are useful for building models of program logics, and for programming and reasoning with coinductive types. We wish to implement GDTT with decidable type-checking, while still supporting non-trivial equality proofs that reason about the extensions of guarded recursive constructions. CTT is a variation of Martin-L\\\"of type theory in which the identity type is replaced by abstract paths between terms. CTT provides a computational interpretation of functional extensionality, is conjectured to have decidable type checking, and has an implemented type-checker. Our new type theory, called guarded cubical type theory, provides a computational interpretation of extensionality for guarded recursive types. This further expands the foundations of CTT as a basis for formalisation in mathematics and computer science. We present examples to demonstrate the expressivity of our type theory, all of which have been checked using a prototype type-checker implementation, and present semantics in a presheaf category.", "num_citations": "52\n", "authors": ["1775"]}
{"title": "Integrals and valuations\n", "abstract": " We construct a homeomorphism between the compact regular locale of integrals on a Riesz space and the locale of (valuations) on its spectrum. In fact, we construct two geometric theories and show that they are biinterpretable. The constructions are elementary and tightly connected to the Riesz space structure.", "num_citations": "51\n", "authors": ["1775"]}
{"title": "The Picard algorithm for ordinary differential equations in Coq\n", "abstract": " Ordinary Differential Equations (ODEs) are ubiquitous in physical applications of mathematics. The Picard-Lindelöf theorem is the first fundamental theorem in the theory of ODEs. It allows one to solve differential equations numerically. We provide a constructive development of the Picard-Lindelöf theorem which includes a program together with sufficient conditions for its correctness. The proof/program is written in the Coq proof assistant and uses the implementation of efficient real numbers from the CoRN library and the MathClasses library. Our proof makes heavy use of operators and functionals, functions on spaces of functions. This is faithful to the usual mathematical description, but a novel level of abstraction for certified exact real computation.", "num_citations": "49\n", "authors": ["1775"]}
{"title": "Bohrification.\n", "abstract": " New foundations for quantum logic and quantum spaces are constructed by merging algebraic quantum theory and topos theory. Interpreting Bohr's \"doctrine of classical concepts\" mathematically, given a quantum theory described by a noncommutative C*-algebra A, we construct a topos T(A), which contains the \"Bohrification\" B of A as an internal commutative C*-algebra. Then B has a spectrum, a locale internal to T(A), the external description S(A) of which we interpret as the \"Bohrified\" phase space of the physical system. As in classical physics, the open subsets of S(A) correspond to (atomic) propositions, so that the \"Bohrified\" quantum logic of A is given by the Heyting algebra structure of S(A). The key difference between this logic and its classical counterpart is that the former does not satisfy the law of the excluded middle, and hence is intuitionistic. When A contains sufficiently many projections (e.g. when A is a von Neumann algebra, or, more generally, a Rickart C*-algebra), the intuitionistic quantum logic S(A) of A may also be compared with the traditional quantum logic, i.e. the orthomodular lattice of projections in A. This time, the main difference is that the former is distributive (even when A is noncommutative), while the latter is not. This chapter is a streamlined synthesis of 0709.4364, 0902.3201, 0905.2275.", "num_citations": "46\n", "authors": ["1775"]}
{"title": "Intuitionistic quantum logic of an n-level system\n", "abstract": " A decade ago, Isham and Butterfield proposed a topos-theoretic approach to quantum mechanics, which meanwhile has been extended by Döring and Isham so as to provide a new mathematical foundation for all of physics. Last year, three of the present authors redeveloped and refined these ideas by combining the C*-algebraic approach to quantum theory with the so-called internal language of topos theory (Heunen et al. in                    arXiv:0709.4364                                    ). The goal of the present paper is to illustrate our abstract setup through the concrete example of the C*-algebra M                                            n                 (ℂ) of complex n×n matrices. This leads to an explicit expression for the pointfree quantum phase space Σ                   n                  and the associated logical structure and Gelfand transform of an n-level system. We also determine the pertinent non-probabilisitic state-proposition pairing (or valuation) and give a …", "num_citations": "46\n", "authors": ["1775"]}
{"title": "Bohrification of operator algebras and quantum logic\n", "abstract": " Following Birkhoff and von Neumann, quantum logic has traditionally been based on the lattice of closed linear subspaces of some Hilbert space, or, more generally, on the lattice of projections in a von Neumann algebra A. Unfortunately, the logical interpretation of these lattices is impaired by their nondistributivity and by various other problems. We show that a possible resolution of these difficulties, suggested by the ideas of Bohr, emerges if instead of single projections one considers elementary propositions to be families of projections indexed by a partially ordered set  of appropriate commutative subalgebras of A. In fact, to achieve both maximal generality and ease of use within topos theory, we assume that A is a so-called Rickart C*-algebra and that  consists of all unital commutative Rickart C*-subalgebras of A. Such families of projections form a Heyting algebra in a natural way, so that the associated …", "num_citations": "42\n", "authors": ["1775"]}
{"title": "The Gelfand spectrum of a noncommutative C*-algebra: a topos-theoretic approach\n", "abstract": " We compare two influential ways of defining a generalized notion of space. The first, inspired by Gelfand duality, states that the category of ‘noncommutative spaces’ is the opposite of the category of C*-algebras. The second, loosely generalizing Stone duality, maintains that the category of ‘point-free spaces’ is the opposite of the category of frames (that is, complete lattices in which the meet distributes over arbitrary joins). Earlier work by the first three authors shows how a noncommutative C*-algebra gives rise to a commutative one internal to a certain sheaf topos. The latter, then, has a constructive Gelfand spectrum, also internal to the topos in question. After a brief review of this work, we compute the so-called external description of this internal spectrum, which in principle is a fibred point-free space in the familiar topos of sets and functions. However, we obtain the external spectrum as a fibred topological space …", "num_citations": "37\n", "authors": ["1775"]}
{"title": "Constructive Gelfand duality for C*-algebras\n", "abstract": " We present a constructive proof of Gelfand duality for C*-algebras by reducing the problem to Gelfand duality for real C*-algebras.", "num_citations": "36\n", "authors": ["1775"]}
{"title": "Constructive and intuitionistic integration theory and functional analysis\n", "abstract": " There are ample reasons to develop mathematics constructively, for instance because one is interested in the foundations of mathematics or in programming on a highly abstract level. But is it possible to do advanced mathematics constructively? Bishop and his followers showed that large parts of abstract analysis and algebra can be developed constructively. But nevertheless the discussion about the applicability of constructive mathematics to mathematical physics started again.  This discussion gave rise to a number of precise mathematical problems. Some of these problems have already been solved, others will be answered in this thesis. These problems all belong to functional analysis, part of which is developed constructively in this thesis. To be more precise, the thesis contains a constructive substitute for the ergodic theorem, a constructive Peter-Weyl theorem for representations of compact groups, approximation theorems for almost periodic functions and a spectral theorem for unbounded normal operators on Hilbert spaces. Moreover, parts of the theory of algebras of operators are developed constructively: two representation theorems are proved, one for finite dimensional and one for Abelian von Neumann algebras. A simple proof is given that the spectral measure is independent of the choice of the basis of the underlying Hilbert space. Finally, a representation theorem for normal functionals is proved. As a tool which is interesting in its own right parts of integration theory are redeveloped, using a metric related to convergence in measure. It is proved that many measures are regular, that is, integrable sets can be approximated by …", "num_citations": "33\n", "authors": ["1775"]}
{"title": "Program extraction from large proof developments\n", "abstract": " It is well known that mathematical proofs often contain (abstract) algorithms, but although these algorithms can be understood by a human, it still takes a lot of time and effort to implement these algorithms on a computer; moreover, one runs the risk of making mistakes in the process.               From a fully formalized constructive proof one can automatically obtain a computer implementation of such an algorithm together with a proof that the program is correct. As an example we consider the fundamental theorem of algebra which states that every non-constant polynomial has a root. This theorem has been fully formalized in the Coq proof assistant. Unfortunately, when we first tried to extract a program, the computer ran out of resources. We will discuss how we used logical techniques to make it possible to extract a feasible program. This example is used as a motivation for a broader perspective on how the …", "num_citations": "32\n", "authors": ["1775"]}
{"title": "Modal dependent type theory and dependent right adjoints\n", "abstract": " In recent years, we have seen several new models of dependent type theory extended with some form of modal necessity operator, including nominal type theory, guarded and clocked type theory and spatial and cohesive type theory. In this paper, we study modal dependent type theory: dependent type theory with an operator satisfying (a dependent version of) the K axiom of modal logic. We investigate both semantics and syntax. For the semantics, we introduce categories with families with a dependent right adjoint (CwDRA) and show that the examples above can be presented as such. Indeed, we show that any category with finite limits and an adjunction of endofunctors give rise to a CwDRA via the local universe construction. For the syntax, we introduce a dependently typed extension of Fitch-style modal λ-calculus, show that it can be interpreted in any CwDRA, and build a term model. We extend the syntax …", "num_citations": "31\n", "authors": ["1775"]}
{"title": "Constructive analysis, types and exact real numbers\n", "abstract": " In this paper we will discuss various aspects of computable/constructive analysis, namely semantics, proofs and computations. We will present some of the problems and solutions of exact real arithmetic varying from concrete implementations, representation and algorithms to various models for real computation. We then put these models in a uniform framework using realisability, which opens the door to the use of type theoretic and coalgebraic constructions both in computing and reasoning about these computations. We will indicate that it is often natural to use constructive logic to reason about these computations.", "num_citations": "31\n", "authors": ["1775"]}
{"title": "Sets in homotopy type theory\n", "abstract": " Homotopy type theory may be seen as an internal language for the ∞-category of weak ∞-groupoids. Moreover, weak ∞-groupoids model the univalence axiom. Voevodsky proposes this (language for) weak ∞-groupoids as a new foundation for Mathematics called the univalent foundations. It includes the sets as weak ∞-groupoids with contractible connected components, and thereby it includes (much of) the traditional set theoretical foundations as a special case. We thus wonder whether those ‘discrete’ groupoids do in fact form a (predicative) topos. More generally, homotopy type theory is conjectured to be the internal language of ‘elementary’ of ∞-toposes. We prove that sets in homotopy type theory form a ΠW-pretopos. This is similar to the fact that the 0-truncation of an ∞-topos is a topos. We show that both a subobject classifier and a 0-object classifier are available for the type theoretical universe of sets …", "num_citations": "28\n", "authors": ["1775"]}
{"title": "Computer-aided proofs for multiparty computation with active security\n", "abstract": " Secure multi-party computation (MPC) is a general cryptographic technique that allows distrusting parties to compute a function of their individual inputs, while only revealing the output of the function. It has found applications in areas such as auctioning, email filtering, and secure teleconference. Given their importance, it is crucial that the protocols are specified and implemented correctly. In the programming language community, it has become good practice to use computer proof assistants to verify correctness proofs. In the field of cryptography, EasyCrypt is the state of the art proof assistant. It provides an embedded language for probabilistic programming, together with a specialized logic, embedded into an ambient general purpose higher-order logic. It allows us to conveniently express cryptographic properties. EasyCrypt has been used successfully on many applications, including public-key encryption …", "num_citations": "24\n", "authors": ["1775"]}
{"title": "Computer certified efficient exact reals in Coq\n", "abstract": " Floating point operations are fast, but require continuous effort on the part of the user in order to ensure that the results are correct. This burden can be shifted away from the user by providing a library of exact analysis in which the computer handles the error estimates. We provide an implementation of the exact real numbers in the Coq proof assistant. This improves on the earlier Coq-implementation by O’Connor in two ways: we use dyadic rationals built from the machine integers and we optimize computation of power series by using approximate division. Moreover, we use type classes for clean mathematical interfaces. This appears to be the first time that type classes are used in heavy computation. We obtain over a 100 times speed up of the basic operations and indications for improving the Coq system.", "num_citations": "23\n", "authors": ["1775"]}
{"title": "A computer-verified monadic functional implementation of the integral\n", "abstract": " We provide a computer-verified exact monadic functional implementation of the Riemann integral in type theory. Together with previous work by O’Connor, this may be seen as the beginning of the realization of Bishop’s vision to use constructive mathematics as a programming language for exact analysis.", "num_citations": "23\n", "authors": ["1775"]}
{"title": "Formal Topology and Constructive Mathematics: the Gelfand and Stone-Yosida Representation Theorems.\n", "abstract": " We present a constructive proof of the Stone-Yosida representation theorem for Riesz spaces motivated by considerations from formal topology. This theorem is used to derive a representation theorem for f-algebras. In turn, this theorem implies the Gelfand representation theorem for C*-algebras of operators on Hilbert spaces as formulated by Bishop and Bridges. Our proof is shorter, clearer, and we avoid the use of approximate eigenvalues.", "num_citations": "22\n", "authors": ["1775"]}
{"title": "Constructive algebraic integration theory\n", "abstract": " For a long time people have been trying to develop probability theory starting from ‘finite’ events rather than collections of infinite events. In this way one can find natural replacements for measurable sets and integrable functions, but measurable functions seemed to be more difficult to find. We present a solution. Moreover, our results are constructive (in the sense of Bishop).", "num_citations": "19\n", "authors": ["1775"]}
{"title": "The principle of general tovariance\n", "abstract": " We tentatively propose two guiding principles for the construction of theories of physics, which should be satisfied by a possible future theory of quantum gravity. These principles are inspired by those that led Einstein to his theory of general relativity, viz. his principle of general covariance and his equivalence principle, as well as by the two mysterious dogmas of Bohr's interpretation of quantum mechanics, i.e. his doctrine of classical concepts and his principle of complementarity. An appropriate mathematical language for combining these ideas is topos theory, a framework earlier proposed for physics by Isham and collaborators.Our principle of general tovariance states that any mathematical structure appearing in the laws of physics must be definable in an arbitrary topos (with natural numbers object) and must be preserved under so‐called geometric morphisms. This principle identifies geometric logic as the …", "num_citations": "18\n", "authors": ["1775"]}
{"title": "ConCert: a smart contract certification framework in Coq\n", "abstract": " We present a new way of embedding functional languages into the Coq proof assistant by using meta-programming. This allows us to develop the meta-theory of the language using the deep embedding and provides a convenient way for reasoning about concrete programs using the shallow embedding. We connect the deep and the shallow embeddings by a soundness theorem. As an instance of our approach, we develop an embedding of a core smart contract language into Coq and verify several important properties of a crowdfunding contract based on a previous formalisation of smart contract execution in blockchains.", "num_citations": "16\n", "authors": ["1775"]}
{"title": "Locatedness and overt sublocales\n", "abstract": " Locatedness is one of the fundamental notions in constructive mathematics. The existence of a positivity predicate on a locale, i.e. the locale being overt, or open, has proved to be fundamental in constructive locale theory. We show that the two notions are intimately connected.Bishop defines a metric space to be compact if it is complete and totally bounded. A subset of a totally bounded set is again totally bounded iff it is located. So a closed subset of a Bishop compact set is Bishop compact iff it is located. We translate this result to formal topology. ‘Bishop compact’ is translated as compact and overt. We propose a definition of locatedness on subspaces of a formal topology, and prove that a closed subspace of a compact regular formal space is located iff it is overt. Moreover, a Bishop-closed subset of a complete metric space is Bishop compact — that is, totally bounded and complete — iff its localic completion is …", "num_citations": "16\n", "authors": ["1775"]}
{"title": "Constructive results on operator algebras\n", "abstract": " We present a to following results in the constructive theory of operator algebras. A representation theorem for finite dimensional von Neumann-algebras. A representation theorem for normal functionals. The spectral measure is independent of the choice of the basis of the underlying Hilbert space. Finally, the double commutant theorem for finite von Neumann algebras and for Abelian von Neumann algebras.", "num_citations": "14\n", "authors": ["1775"]}
{"title": "Synthetic topology in Homotopy Type Theory for probabilistic programming\n", "abstract": " The ALEA Coq library formalizes measure theory based on a variant of the Giry monad on the category of sets. This enables the interpretation of a probabilistic programming language with primitives for sampling from discrete distributions. However, continuous distributions have to be discretized because the corresponding measures cannot be defined on all subsets of their carriers. This paper proposes the use of synthetic topology to model continuous distributions for probabilistic computations in type theory. We study the initial -frame and the corresponding induced topology on arbitrary sets. Based on these intrinsic topologies we define valuations and lower integrals on sets, and prove versions of the Riesz and Fubini theorems. We then show how the Lebesgue valuation, and hence continuous distributions, can be constructed.", "num_citations": "13\n", "authors": ["1775"]}
{"title": "Cubical sets and the topological topos\n", "abstract": " Coquand's cubical set model for homotopy type theory provides the basis for a computational interpretation of the univalence axiom and some higher inductive types, as implemented in the cubical proof assistant. This paper contributes to the understanding of this model. We make three contributions: 1. Johnstone's topological topos was created to present the geometric realization of simplicial sets as a geometric morphism between toposes. Johnstone shows that simplicial sets classify strict linear orders with disjoint endpoints and that (classically) the unit interval is such an order. Here we show that it can also be a target for cubical realization by showing that Coquand's cubical sets classify the geometric theory of flat distributive lattices. As a side result, we obtain a simplicial realization of a cubical set. 2. Using the internal `interval' in the topos of cubical sets, we construct a Moore path model of identity types. 3. We construct a premodel structure internally in the cubical type theory and hence on the fibrant objects in cubical sets.", "num_citations": "12\n", "authors": ["1775"]}
{"title": "The space of measurement outcomes as a spectral invariant for non-commutative algebras\n", "abstract": " The recently developed technique of Bohrification associates to a (unital) C*-algebra A                                                         1.                                             the Kripke model, a presheaf topos, of its classical contexts;                                                                                2.                                             in this Kripke model a commutative C*-algebra, called the Bohrification of A;                                                                                3.                                             the spectrum of the Bohrification as a locale internal in the Kripke model.                                                          We propose this locale, the ‘state space’, as a (n intuitionistic) logic of the physical system whose observable algebra is A.               We compute a site which externally captures this locale and find that externally its points may be identified with partial measurement outcomes. This prompts us to compare Scott-continuity on the poset of contexts and continuity with respect to the C*-algebra …", "num_citations": "12\n", "authors": ["1775"]}
{"title": "Gelfand spectra in Grothendieck toposes using geometric mathematics\n", "abstract": " In the (covariant) topos approach to quantum theory by Heunen, Landsman and Spitters, one associates to each unital C*-algebra, A, a topos T(A) of sheaves on a locale and a commutative C*-algebra, a, within that topos. The Gelfand spectrum of a is a locale S in this topos, which is equivalent to a bundle over the base locale. We further develop this external presentation of the locale S, by noting that the construction of the Gelfand spectrum in a general topos can be described using geometric logic. As a consequence, the spectrum, seen as a bundle, is computed fibrewise. As a by-product of the geometricity of Gelfand spectra, we find an explicit external description of the spectrum whenever the topos is a functor category. As an intermediate result we show that locally perfect maps compose, so that the externalization of a locally compact locale in a topos of sheaves over a locally compact locale is locally compact, too.", "num_citations": "10\n", "authors": ["1775"]}
{"title": "Constructive algebraic integration theory without choice\n", "abstract": " We present a constructive algebraic integration theory. The theory is constructive in the sense of Bishop, however we avoid the axiom of countable, or dependent, choice. Thus our results can be interpreted in any topos. Since we avoid impredicative methods the results may also be interpreted in Martin-L type theory or in a predicative topos in the sense of Moerdijk and Palmgren.We outline how to develop most of Bishop’s theorems on integration theory that do not mention points explicitly. Coquand’s constructive version of the Stone representation theorem is an important tool in this process. It is also used to give a new proof of Bishop’s spectral theorem.", "num_citations": "10\n", "authors": ["1775"]}
{"title": "Smart contract interactions in Coq\n", "abstract": " We present a model/executable specification of smart contract execution in Coq. Our formalization allows for inter-contract communication and generalizes existing work by allowing modelling of both depth-first execution blockchains (like Ethereum) and breadth-first execution blockchains (like Tezos). We represent smart contracts programs in Coq’s functional language Gallina, enabling easier reasoning about functional correctness of concrete contracts than other approaches. In particular we develop a Congress contract in this style. This contract – a simplified version of the infamous DAO – is interesting because of its very dynamic communication pattern with other contracts. We give a high-level partial specification of the Congress’s behavior, related to reentrancy, and prove that the Congress satisfies it for all possible smart contract execution orders.", "num_citations": "9\n", "authors": ["1775"]}
{"title": "A constructive view on ergodic theorems\n", "abstract": " Let T be a positive L1-L∞ contraction. We prove that the following statements are equivalent in constructive mathematics.(1) The projection in L2, on the space of invariant functions exists:(2) The sequence (Tn)n∈N Cesáro-converges in the L2 norm:(3) The sequence (Tn)n∈N Cesáro-converges almost everywhere.Thus, we find necessary and sufficient conditions for the Mean Ergodic Theorem and the Dunford-Schwartz Pointwise Ergodic Theorem.As a corollary we obtain a constructive ergodic theorem for ergodic measure-preserving transformations.This answers a question posed by Bishop.", "num_citations": "8\n", "authors": ["1775"]}
{"title": "Located operators\n", "abstract": " We study operators with located graph in Bishop‐style constructive mathematics. It is shown that a bounded operator has an adjoint if and only if its graph is located. Locatedness of the graph is a necessary and sufficient condition for an unbounded normal operator to have a spectral decomposition. These results suggest that located operators are the right generalization of bounded operators with an adjoint.", "num_citations": "8\n", "authors": ["1775"]}
{"title": "An application of computable distributions to the semantics of probabilistic programs\n", "abstract": " In this chapter, we explore how (Type-2) computable distributions can be used to give both (algorithmic) sampling and distributional semantics to probabilistic programs with continuous distributions. Towards this end, we sketch an encoding of computable distributions in a fragment of Haskell and show how topological domains can be used to model the resulting PCF-like language. We also examine the implications that a (Type-2) computable semantics has for implementing conditioning. We hope to draw out the connection between an approach based on (Type-2) computability and ordinary programming throughout the chapter as well as highlight the relation with constructive mathematics (via realizability).", "num_citations": "6\n", "authors": ["1775"]}
{"title": "A constructive proof of the Peter‐Weyl theorem\n", "abstract": " We present a new and constructive proof of the Peter‐Weyl theorem on the representations of compact groups. We use the Gelfand representation theorem for commutative C*‐algebras to give a proof which may be seen as a direct generalization of Burnside's algorithm [3]. This algorithm computes the characters of a finite group. We use this proof as a basis for a constructive proof in the style of Bishop. In fact, the present theory of compact groups may be seen as a natural continuation in the line of Bishop's work on locally compact, but Abelian, groups [2]. (© 2005 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim)", "num_citations": "6\n", "authors": ["1775"]}
{"title": "Ssprove: A foundational framework for modular cryptographic proofs in coq\n", "abstract": " State-separating proofs (SSP) is a recent methodology for structuring game-based cryptographic proofs in a modular way. While very promising, this methodology was previously not fully formalized and came with little tool support. We address this by introducing SSProve, the first general verification framework for machine-checked state-separating proofs. SSProve combines high-level modular proofs about composed protocols, as proposed in SSP, with a probabilistic relational program logic for formalizing the lower-level details, which together enable constructing fully machine-checked crypto proofs in the Coq proof assistant. Moreover, SSProve is itself formalized in Coq, including the algebraic laws of SSP, the soundness of the program logic, and the connection between these two verification styles.", "num_citations": "5\n", "authors": ["1775"]}
{"title": "Extracting Smart Contracts Tested and Verified in Coq\n", "abstract": " We implement extraction of Coq programs to functional languages based on MetaCoq's certified erasure. As part of this, we implement an optimisation pass removing unused arguments. We prove the pass correct wrt. a conventional call-by-value operational semantics of functional languages. We apply this to two functional smart contract languages, Liquidity and Midlang, and to the functional language Elm.", "num_citations": "5\n", "authors": ["1775"]}
{"title": "Universal algebra in HoTT\n", "abstract": " ‚Universal algebra is a general study of algebraic structures. The results in universal algebra apply to all “algebras”, eg groups, rings, modules.", "num_citations": "5\n", "authors": ["1775"]}
{"title": "Metric complements of overt closed sets\n", "abstract": " We show that the set of points of an overt closed subspace of a metric completion of a Bishop‐locally compact metric space is located. Consequently, if the subspace is, moreover, compact, then its collection of points is Bishop‐compact. © 2011 WILEY‐VCH Verlag GmbH & Co. KGaA, Weinheim", "num_citations": "5\n", "authors": ["1775"]}
{"title": "Normalization by gluing for free 𝜆-theories\n", "abstract": " The connection between normalization by evaluation, logical predicates and semantic gluing constructions is a matter of folklore, worked out in varying degrees within the literature. In this note, we present an elementary version of the gluing technique which corresponds closely with both semantic normalization proofs and the syntactic normalization by evaluation", "num_citations": "4\n", "authors": ["1775"]}
{"title": "Locating the range of an operator with an adjoint\n", "abstract": " In this paper we consider the following question: given a linear operator1 on a Hilbert space, can we compute the projection on the closure of its range? Instead of making the notion of computation precise, we use Bishop’s informal approach [1], in which ‘there exists’ is interpreted strictly as ‘we can compute’. It turns out that the reasoning we use to capture this interpretation can be described by intuitionistic logic. This logic differs from classical logic by not recognising certain principles, such as the scheme ‘P or not P’, as generally valid. Since we do not adopt axioms that are classically false, all our theorems are acceptable in classical mathematics. To answer our initial question affirmatively, it is enough to show that the range ran (T) of the operator T on the Hilbert space H is located—that is, the distance ρ (x, ran (T))= inf {x− Ty: y∈ H} exists (is computable) for each x∈ H ([2], pages 366 and 371). The locatedness of the kernel ker (T∗) of the adjoint T∗ of T is easily seen to be a necessary—but according to Example 1 of [6], not sufficient—condition for ran (T) to be located. Theorem gives necessary and sufficient conditions under which the locatedness of ker (T∗) ensures that of ran (T). Proposition 9 below shows that (despite an earlier claim by Bridges–Ishihara [6]) in recursive mathematics, and hence in Bishop–style mathematics, a condition known as well–behavedness is not sufficient for the locatedness of ran (T). As we saw in [6, 15, 16], sequential versions of boundedness and openness play an important role for linear operators; for example, the Hellinger–Toeplitz theorem [6] holds for sequential continuity.", "num_citations": "4\n", "authors": ["1775"]}
{"title": "Congruence Closure in Cubical Type Theory\n", "abstract": " Interactive theorem provers can be a powerful tool for doing mathematics, but support from proving tedious lemmas can be improved. Decision procedures are very useful to automate such tasks. The congruence closure algorithm automates proofs that can be constructed using basic properties of equality: reflexivity, symmetry, transitivity and congruence. Congruence closure is a key algorithm in SMT solvers [2]. Coq contains the algorithm as a tactic to solve first order equational goals. In 2017 Selsam and de Moura presented an efficient procedure [5] to extend the algorithm to the Intensional Type Theory (ITT) of the Lean [3] proof assistant. To do so, they use UIP to find a workaround for the absence of the ideal congruence lemma (defined below). Instead, we observe that the ideal congruence lemma is well-typed and provable in Cubical Type Theory [1](CTT) and this allows us to make a natural modification of their procedure and moreover eliminate the need for the UIP axiom. We present an implementation 1 in Cubical Agda [7].", "num_citations": "3\n", "authors": ["1775"]}
{"title": "Constructive theory of Banach algebras\n", "abstract": " We present a way to organize a constructive development of the theory of Banach algebras, inspired by works of Cohen, de Bruijn and Bishop. We illustrate this by giving elementary proofs of Wiener's result on the inverse of Fourier series and Wiener's Tauberian Theorem, in a sequel to this paper we show how this can be used in a localic, or point-free, description of the spectrum of a Banach algebra.", "num_citations": "3\n", "authors": ["1775"]}
{"title": "Almost periodic functions, constructively\n", "abstract": " The almost periodic functions form a natural example of a non-separable normed space. As such, it has been a challenge for constructive mathematicians to find a natural treatment of them. Here we present a simple proof of Bohr's fundamental theorem for almost periodic functions which we then generalize to almost periodic functions on general topological groups.", "num_citations": "3\n", "authors": ["1775"]}
{"title": "Approximating integrable sets by compacts constructively\n", "abstract": " In locally compact spaces,(Borel-) measurable sets can be approximated by compact sets. Ulam extended this result to complete separable metric spaces. We give a constructive proof of Ulam’s theorem. It is first proved intuitionistically and then, using a logical ‘trick’due to Ishihara, a proof acceptable in Bishop-style mathematics is obtained. We feel this proof provides some insight into Ishihara’s trick. Finally, we show how several intuitionistic measure theoretic theorems can be extended to regular integration spaces, that is integration spaces where integrable sets can be approximated by compacts. These results may help to understand Bishop’s choice of definitions.", "num_citations": "3\n", "authors": ["1775"]}
{"title": "Implicit and noncomputational arguments using monads\n", "abstract": " We provide a monadic view on implicit and noncomputational arguments. This allows us to treat Berger's non-computational quantifiers in the Coq-system. We use Tait's normalization proof and the concatenation of vectors as case studies for the extraction of programs. With little effort one can eliminate noncomputational arguments from extracted programs. One thus obtains extracted code that is not only closer to the intended one, but also decreases both the running time and the memory usage dramatically. We also study the connection between Harrop formulas, lax modal logic and the Coq type theory.", "num_citations": "3\n", "authors": ["1775"]}
{"title": "A constructive converse of the mean value theorem\n", "abstract": " Let f be a differentiable function on [a, b]. If c∈(a, b), then there are α and β in [a, b] such that (f (β)− f (α))/(β− α)= f′(c). Assuming some weak conditions to be mentioned in Section 3, Tong and Braza [3] were able to prove this statement. Unfortunately their proof does not provide a method to compute α and β. We give a constructive proof.", "num_citations": "2\n", "authors": ["1775"]}
{"title": "Formalizing Nakamoto-Style Proof of Stake\n", "abstract": " Fault-tolerant distributed systems move the trust in a single party to a majority of parties participating in the protocol. This makes blockchain based crypto-currencies possible: they allow parties to agree on a total order of transactions without a trusted third party. To trust a distributed system, the security of the protocol and the correctness of the implementation must be indisputable. We present the first machine checked proof that guarantees both safety and liveness for a consensus algorithm. We verify a Proof of Stake (PoS) Nakamoto-style blockchain (NSB) protocol, using the foundational proof assistant Coq. In particular, we consider a PoS NSB in a synchronous network with a static set of corrupted parties. We define execution semantics for this setting and prove chain growth, chain quality, and common prefix which together imply both safety and liveness.", "num_citations": "1\n", "authors": ["1775"]}
{"title": "High-assurance field inversion for curve-based cryptography.\n", "abstract": " Modern cryptography must satisfy a myriad of security properties, ranging from sound hardness assumptions to correct and secure implementations that resist side-channel cryptanalysis. Curve-based cryptography is not different in this regard, and substantial progress in the last few decades has been achieved in both selecting parameters and devising secure implementation strategies. In this context, the security of implementations of field inversion is sometimes overlooked in the research literature, because (i) the approach based on Fermat’s Little Theorem (FLT) suffices performance-wise for many parameters used in practice;(ii) it is typically invoked only at the very end of scalar multiplication or pairing computation, with a small impact in performance;(iii) it is challenging to implement securely for general parameters without a significant performance penalty. However, field inversion can process sensitive information and must be protected with side-channel countermeasures like any other cryptographic operation, as illustrated by recent attacks [ASS17, AGTB18, AGB20]. In this work, we focus on timing attacks against field inversion for primes of cryptographic interest, both in the case when FLT-based inversion can be efficiently implemented or not. We extend the Fiat-Cryptography framework, which synthesizes provably correct-by-construction implementations, to implement the Bernstein-Yang constant-time inversion algorithm as a step toward this goal. This allows a correct implementation of prime field inversion to be conveniently synthesized for any prime. We benchmark the implementations across a range of primes for curve-based …", "num_citations": "1\n", "authors": ["1775"]}
{"title": "Formal security analysis of MPC-in-the-head zero-knowledge protocols.\n", "abstract": " Zero-knowledge proofs allow a prover to convince a verifier of the veracity of a statement without revealing any other information. An interesting class of zero-knowledge protocols are those following the MPC-in-the-head paradigm (Ishai et al., STOC’07) which use secure multiparty computation (MPC) protocols as the basis. Efficient instances of this paradigm have emerged as an active research topic in the last years, starting with ZKBoo (Giacomelli et al., USENIX’16). Zero-knowledge protocols are a vital building block in the design of privacypreserving technologies as well as cryptographic primitives like digital signature schemes that provide post-quantum security. This work investigates the security of zero-knowledge protocols following the MPC-in-the-head paradigm. We provide the first machine-checked security proof of such a protocol on the example of ZKBoo. Our proofs are checked in the EasyCrypt proof assistant. To enable a modular security proof, we develop a new security notion for the MPC protocols used in MPC-in-thehead zero-knowledge protocols. This allows us to recast existing security proofs in a black-box fashion which we believe to be of independent interest.", "num_citations": "1\n", "authors": ["1775"]}
{"title": "A constructive proof of Simpson's Rule\n", "abstract": " For most purposes, one can replace the use of Rolle's theorem and the mean value theorem, which are not constructively valid, by the law of bounded change. The proof of two basic results in numerical analysis, the error term for Lagrange interpolation and Simpson's rule, however seem to require the full strength of the classical Rolle's Theorem. The goal of this note is to justify these two results constructively, using ideas going back to Amp\\`ere and Genocchi.", "num_citations": "1\n", "authors": ["1775"]}