{"title": "Applications of the MapReduce programming framework to clinical big data analysis: current landscape and future trends\n", "abstract": " The emergence of massive datasets in a clinical setting presents both challenges and opportunities in data storage and analysis. This so called “big data” challenges traditional analytic tools and will increasingly require novel solutions adapted from other fields. Advances in information and communication technology present the most viable solutions to big data analysis in terms of efficiency and scalability. It is vital those big data solutions are multithreaded and that data access approaches be precisely tailored to large volumes of semi-structured/unstructured data. The MapReduce programming framework uses two tasks common in functional programming: Map and Reduce. MapReduce is a new parallel processing framework and Hadoop is its open-source implementation on a single computing node or on clusters. Compared with existing parallel processing paradigms (e.g. grid computing and graphical …", "num_citations": "158\n", "authors": ["469"]}
{"title": "A model-based approach for testing the performance of web applications\n", "abstract": " Poor performance of Web-based systems can adversely impact the profitability of enterprises that rely on them. As a result, effective performance testing techniques are essential for understanding whether a Web-based system will meet its performance objectives when deployed in the real world. The workload of a Web-based system has to be characterized in terms of sessions; a session being a sequence of inter-dependent requests submitted by a single user. Dependencies arise because some requests depend on the responses of earlier requests in a session. To exercise application functions in a representative manner, these dependencies should be reflected in the synthetic workloads used to test Web-based systems. This makes performance testing a challenge for these systems. In this paper, we propose a model-based approach to address this problem. Our approach uses an application model that …", "num_citations": "105\n", "authors": ["469"]}
{"title": "Supervised machine learning algorithms for credit card fraudulent transaction detection: a comparative study\n", "abstract": " The goal of data analytics is to delineate hidden patterns and use them to support informed decisions in a variety of situations. Credit card fraud is escalating significantly with the advancement of the modernized technology and become an easy target for fraudulent. Credit card fraud is a severe problem in the financial service and costs billions of a dollar every year. The design of fraud detection algorithm is a challenging task with the lack of real-world transaction dataset because of confidentiality and the highly imbalanced publicly available datasets. In this paper, we apply different supervised machine learning algorithms to detect credit card fraudulent transaction using a real-world dataset. Furthermore, we employ these algorithms to implement a super classifier using ensemble learning methods. We identify the most important variables that may lead to higher accuracy in credit card fraudulent transaction …", "num_citations": "77\n", "authors": ["469"]}
{"title": "A protocol for multi-agent negotiation in a group-choice decision making process\n", "abstract": " Negotiation is one of the most important features of agent interactions found in multi-agent systems, because it provides the basis for managing the expectations of the individual negotiating agents, and it enables selecting solutions that satisfy all the agents as much as possible. In order for negotiation to take place between two or more agents there is need for a negotiation protocol that defines the rules of the game; consequently, a variety of agent negotiation protocols have been proposed in literature. However, most of them are inappropriate for Group-Choice Decision Making (GCDM) because they do not explicitly exploit tradeoff to achieve social optimality, and their main focus is solving two-agent negotiation problems such as buyer–seller negotiation. In this paper we present an agent negotiation protocol that facilitates the solving of GCDM problems. The protocol is based on a hybrid of analytic and artificial …", "num_citations": "65\n", "authors": ["469"]}
{"title": "Emerging business intelligence framework for a clinical laboratory through big data analytics\n", "abstract": " Clinical laboratories provide medical test services to a variety of customers. From a business perspective, providing high-quality services at lower costs mandates the need for efficient utilization of clinical resources (McDonald et al., 1997). Historical and current clinical resource utilization data sets are now digitally available at almost all clinical facilities (Kessel et al., 2014). The improvement of digital equipment facilitates the acquisition and storage of all kind of clinical data at a rate much faster than what can be processed using traditional processing systems (Peters and Buntrock, 2014), which give rise to the clinical Big Data era. Clinical Big Data is the technical term used to describe massive databases with varying high volume, variety, and velocity [eg, electronic medical record (EMR) and biometrics data]. These databases present difficulties with storage, processing, and visualization (Rajaraman and Ullman …", "num_citations": "64\n", "authors": ["469"]}
{"title": "Functional reasoning theories: problems and perspectives\n", "abstract": " Functional reasoning (FR) enables people to derive and explain function of artifacts in a goal-oriented manner. FR has been studied and employed in various disciplines, including philosophy, biology, sociology, and engineering design, and enhanced by the techniques borrowed from computer science and artificial intelligence. The outcome of FR research has been applied to engineering design, planning, explanation, and learning. A typical FR system in engineering design usually incorporates representational mechanisms of function concept together with description mechanisms of state, structure, or behavior, and explanations and reasoning mechanisms to derive and explain functions. As for representation, philosophers have long argued whether function of an artifact is a genuine property of it. As for explanation and reasoning, they have produced theories for functional ascription by an external viewer as …", "num_citations": "64\n", "authors": ["469"]}
{"title": "An efficient technique for white blood cells nuclei automatic segmentation\n", "abstract": " Blood tests are of the most important and often requested clinical examinations. Manual microscopic assessment is a must do when a blood sample is suspicious of abnormality. This manual process is tedious, time consuming and subjective. Automating microscopic blood classification is desirable to help the pathologists to speed-up and enhance the results accuracy. Segmentation is the first and most important step in automatic blood cell classification. In this paper, we present an effective technique for automatic blood cell nuclei segmentation. The technique is based on gray scale contrast enhancement and filtering. Minimum segment size is implemented to remove false objects. The technique is tested on 365 blood images. The segmentation performance is quantitatively evaluated on the test set to be 79.7%. This performance is high compared to other published algorithm executed on the same dataset …", "num_citations": "62\n", "authors": ["469"]}
{"title": "Chronic lymphocytic leukemia cell segmentation from microscopic blood images using watershed algorithm and optimal thresholding\n", "abstract": " Chronic lymphocytic leukemia (CLL) is the most common type of blood cancer in Canadian adults. CLL cells are abnormal lymphocytes, which tend to be slightly larger than normal resting lymphocytes and have a condensed appearance to their chromatin. There is a low number of related works on this disease. This paper presents a method to segment normal and CLL lymphocytes into two parts: nucleus, and cytoplasm using a watershed algorithm and optimal thresholding. The goal of this work is reducing the over and under segmentation error of the watershed algorithm by suppressing 1% of the local minima. We tested 140 microscopic lymphocyte images (normal and CLL), and the algorithm obtained 99.92% maximum accuracy for nucleus segmentation, and 99.85% maximum accuracy for cell segmentation. The cytoplasm can be extracted with a 99.63% maximum accuracy with simple mask subtraction. The …", "num_citations": "59\n", "authors": ["469"]}
{"title": "Ontology-guided learning to improve communication between groups of agents\n", "abstract": " We present a general method for agents using ontologies as part of their knowledge representation to teach each other concepts to improve their communication and thus cooperation abilities. Our method aims at getting positive and negative examples for a concept only very vaguely understood by a particular agent from the other agents. This agent then uses one of the known concept learning methods to learn the concept in question, involving the other agents again by taking votes in case of conflicts in the received knowledge. This method allows agents that are not sharing common ontologies to establish common grounds on concepts known only to some of them, if these common grounds are needed during cooperation. While the concepts learned by an agent are only compromises between the views of the other agents, the method nevertheless enhances the autonomy of agents using it substantially.", "num_citations": "47\n", "authors": ["469"]}
{"title": "Peripheral blood smear image analysis: A comprehensive review\n", "abstract": " Peripheral blood smear image examination is a part of the routine work of every laboratory. The manual examination of these images is tedious, time-consuming and suffers from interobserver variation. This has motivated researchers to develop different algorithms and methods to automate peripheral blood smear image analysis. Image analysis itself consists of a sequence of steps consisting of image segmentation, features extraction and selection and pattern classification. The image segmentation step addresses the problem of extraction of the object or region of interest from the complicated peripheral blood smear image. Support vector machine (SVM) and artificial neural networks (ANNs) are two common approaches to image segmentation. Features extraction and selection aims to derive descriptive characteristics of the extracted object, which are similar within the same object class and different between …", "num_citations": "45\n", "authors": ["469"]}
{"title": "Expert tutoring system for teaching computer programming languages\n", "abstract": " This paper presents an Expert tutoring system (E-TCL) for teaching computer programming languages through WWW. In this version, many teachers can cooperate together to put the curriculum of one/more computer programming language(s). Their contributions may include: (a) add or modify the commands' structure that will be taught; (b) generate different tutoring dialogs for the same command; and (c) generate different tutoring styles. On the contrary, the students can access the system through WWW, select any language they want to learn as well as the style of presentation they prefer and they can exchange their experiences. A personal assistant agent for teachers (PAA-T), a personal assistant agent for students (PAA-S) with an adaptive interface, and tutoring agent (TA) has been built. The TA resides on the server side and communicates via HTTP and IIOP with both the PAA-T and PAA-S on the clients side …", "num_citations": "43\n", "authors": ["469"]}
{"title": "Application of intelligent agent technology for knowledge management integration\n", "abstract": " Organizations invest in various knowledge management (KM) systems and tools to enable seamless integration of the constantly increasing volume and sources of information. This research first, presents a case study on the existing categories of KM systems and tools, their potential contribution to the KM process, and their pitfalls; second, it proposes a comprehensive methodology for building KM through the organization using software agent technology. This approach aims to address the research issue of how KM can be optimized using intelligent agents and how to enhance decision-making process. The proposed system is applied to a real-world project lifecycle case that is EPC (Engineering Procurement and Construction) project. A prototype of the system is presented where intelligent agents are the building blocks of a peer-to-peer organization wide system. The application was implemented using Eclipse …", "num_citations": "42\n", "authors": ["469"]}
{"title": "Detecting performance interference in cloud-based web services\n", "abstract": " Web services have increasingly begun to rely on public cloud platforms. The virtualization technologies employed by public clouds can however trigger contention between virtual machines (VMs) for shared physical machine (PM) resources thereby leading to performance problems for the Web service. Past studies have exploited PM level performance metrics such as Clock Cycles Per Instruction to detect such platform induced performance interference. Unfortunately, public cloud customers do not have access to such metrics. They can typically only access VM-level metrics and application level metrics such as transaction response times and such metrics alone are often not useful for detecting inter-VM contention. This poses a difficult challenge to Web service operators for detecting and managing platform induced performance interference issues inside the cloud. We propose a machine learning based …", "num_citations": "38\n", "authors": ["469"]}
{"title": "An enhanced threshold based technique for white blood cells nuclei automatic segmentation\n", "abstract": " One of the most important clinical examination tests is the blood test. In a clinical laboratory, counting different blood cells is important. Manual microscopic inspection is time-consuming and requires technical knowledge. Therefore, automatic medical diagnosis systems are required to help physicians to diagnose diseases in a fast and yet efficient way. Cell automatic classification has larger interest especially for clinics and laboratories; the most important step in automatic classification success is segmentation. This paper shows an efficient technique for automatic blood cell nuclei segmentation. This technique is relying on enhancing and filtering the gray scale image contrast. False objects are removed utilizing minimum segment size. 365 blood images were used to examine this segmentation technique. Quantitative analysis of the proposed segmentation technique on the blood image set gives 80.6% accuracy …", "num_citations": "35\n", "authors": ["469"]}
{"title": "Towards providing decision support for COTS selection\n", "abstract": " The evolution of software engineering has led to component-based software development, which in turn has engendered tremendous interest in the development of plug-and-play reusable software, leading to the concept of commercial off-the-shelf (COTS) software components. The use of COTS is increasingly becoming commonplace. This is mainly due to shrinking budgets, accelerating rates of COTS enhancement, development time and effort constraints, and expanding system requirements. However, the process of selecting COTS products is characterized by a multiplicity of challenges, which should be addressed in order to harness the benefits of COTS-based software development. In this paper we preset a model that splits the COTS selection process into layers; basing on the (intra-layer) activities which affect the choice of a decision support to address a particular challenge. Moreover, we evaluate the …", "num_citations": "35\n", "authors": ["469"]}
{"title": "Simultaneous cost and QoS optimization for cloud resource allocation\n", "abstract": " Cloud computing is a new era of computing that offers resources and services for Web applications. Selection of optimal cloud resources is the main goal in cloud resource allocation. Sometimes, customers pay more than required since cloud providers' pricing strategy is designed for the interest of the providers. Nonetheless, cloud customers are interested in selecting cloud resources to meet their quality of service (QoS) requirements. Thus, for the interest of both providers and customers, it is vital to balance the two conflicting objectives of deployment cost and QoS performance. In this paper, we present a cost-effective and runtime friendly algorithm that minimizes the deployment cost while meeting the QoS performance requirements. In other words, the algorithm offers an optimal choice, from customers' point of view, for deploying a Web application in cloud environment. The multi-objective optimization algorithm …", "num_citations": "33\n", "authors": ["469"]}
{"title": "A simulation-based benefit analysis of deploying connected vehicles using dedicated short range communication\n", "abstract": " In this research we utilize PARAMICS traffic micro-simulation software to study the impact of deploying Connected Vehicles (CV) in Deerfoot trail, Calgary, Alberta. We have implemented a V2V (Vehicle-to-Vehicle) Assisted V2I (Vehicle-to-Infrastructure) system for PARAMICS. It uses Dedicated Short Range Communication (DSRC) protocol to acquire traffic data, calculate and compare important traffic safety and mobility parameters and their impacts on CV by testing five scenarios differentiated by the percentage of 0% to 40% market penetration of CVs. Despite of previous studies which focused on upstream traffic, in this study we demonstrate effect of considering DSRC, re-routing guidance and advisory speed for upstream and downstream traffic. The study demonstrated that the CV technology can enhance traffic safety and mobility in freeways, if the percentage of CVs is significant (e.g. 30-40%) and the CV …", "num_citations": "33\n", "authors": ["469"]}
{"title": "A framework for distributed fault management using intelligent software agents\n", "abstract": " This paper proposes a framework for distributed management of network faults by software agents. Intelligent network agents with advanced reasoning capabilities address many of the issues for the distribution of processing and control in network management. The agents detect, correlate and selectively seek to derive a clear explanation of alarms generated in their domain. The causal relationship between faults and their effects is presented as a Bayesian network. As evidence (alarms) is gathered, the probability of the presence of any particular fault is strengthened or weakened. Agents having a narrower view of the network forward their findings to another with a much broader view of the network. Depending on the network's degree of automation, the agent can carry out local recovery actions. A prototype reflecting the ideas discussed in this paper is under implementation.", "num_citations": "32\n", "authors": ["469"]}
{"title": "LearnTechLib-The Learning & Technology Library\n", "abstract": " Learning & Technology Library (LearnTechLib) Skip navigation Skip to search Contact Help Sign in Email: Password: Sign in LearnTechLib - The Learning & Technology Library Toggle navigation Main navigation Keyword search: About Journals Proceedings Browse Popular Articles Journals eBooks Conference Papers Talks Reports Dissertations Topics Tags Slides Collections Authors Publishing Partners Collections Librarians Subscribe FAQs Dashboard Usage Statisics Technical Support Publishing Partners License Agreement Subscribe Search over 100,000 articles and abstracts focusing on learning and technology Keyword search: Search Help Advanced 168,122 papers by 340,847 authors. 30+ years of content. 105,910 journal articles 39,870 conference papers 14,298 dissertations 1,091 presentations 154 Invited talks 42 eBooks New! Author Collaboration Map Researchers Keep up-to-date by signing up …", "num_citations": "31\n", "authors": ["469"]}
{"title": "Vehicle Trajectory Prediction with Gaussian Process Regression in Connected Vehicle Environment\n", "abstract": " This paper addresses the problem of long term location prediction for collision avoidance in Connected Vehicle (CV) environment where more information about the road and traffic data is available through vehicle-to-vehicle and vehicle-to-infrastructure communications. Gaussian Process Regression (GPR) is used to learn motion patterns from historical trajectory data collected with static sensors on the road. Trained models are then shared among the vehicles through connected vehicle cloud. A vehicle receives information, such as Global Positioning System coordinates, about nearby vehicles on the road using inter-vehicular communication. The collected data from vehicles together with GPR models received from infrastructure are then used to predict the future trajectories of vehicles in the scene. The contributions of this work are twofold. First, we propose the use of GPR in CV environment as a framework for …", "num_citations": "30\n", "authors": ["469"]}
{"title": "Detecting emergent behavior in distributed systems using scenario-based specifications\n", "abstract": " Emergent behavior is an important issue in distributed systems' design. Detecting and removing emergent behavior during the design phase will lead to huge savings in deployment costs of such systems. An effective approach for the design of distributed systems is to describe system requirements using scenarios. A scenario, commonly known as a message sequence chart or a sequence diagram, is a temporal sequence of messages sent between system components. However, scenario-based specifications are prone to subtle deficiencies with respect to analysis and validation known as incompleteness and partial description. In this research, a method for detecting emergent behavior of scenario-based specification is proposed. The method is demonstrated and verified using a mine-sweeping robot as an example. Furthermore it has been demonstrated in this paper that scenario-based specifications can be …", "num_citations": "29\n", "authors": ["469"]}
{"title": "Ex-w-pert system: A web-based distributed expert system for groupware design\n", "abstract": " The World Wide Web (Web) allows people at remotely located sites to communicate and share their ideas using a common communication protocol. A common use of the Web system is running a client application, using a browsing tool, by pointing to a local or proxy server to browse data written in the hypertext format that contains anchors that address other URLs. In this paper a new application of the Web system for sharing knowledge-based systems and groupware development activities is introduced. An architecture for a Web-based Distributed Expert System (Ex-W-Pert System) is proposed and an implementation of the proposed architecture in groupware design is demonstrated. The resources and knowledge bases are distributed and can be accessed through the internet.", "num_citations": "29\n", "authors": ["469"]}
{"title": "A fast technique for white blood cells nuclei automatic segmentation based on gram-schmidt orthogonalization\n", "abstract": " Blood testing is one of the most important clinical examinations. Counting different blood cells is a significant process in a clinical laboratory. Manual microscopic evaluation is compulsory in case there is suspicious abnormality in the blood sample. Yet, the manual inspection is time-consuming and requires adequate technical knowledge. Therefore, automatic medical diagnosis systems are necessary to help physicians to diagnose diseases in a fast and nonetheless competent way. Cell automatic classification has wider interest especially for clinics and laboratories. Segmentation is the most important step for automatic classification success. This paper represents an efficient technique for automatic blood cell nuclei segmentation. This technique is relying on enhancing the color of the target object, nucleus, and filtering the image. Small objects are eliminated employing morphological operations. A set of 365 …", "num_citations": "28\n", "authors": ["469"]}
{"title": "An empirical study to compare three methods for selecting COTS software components\n", "abstract": " Component Based Software Developers are faced with the challenge of selecting appropriate Commercial Off-The-Shelf (COTS) products, because the marketplace is characterized by a variety of products and product claims, extreme quality and capability differences between products, and many products incompatibilities. Although a multiplicity of COTS selection method have been proposed in literature, most developer still select COTS products using ad hoc methods. One of the main reason being, COTS selection method do not provide all or most of the required support and guidance required for carrying out the COTS selection process. Moreover, literature on COTS selection methods rarely mentions the limitations of the methods. Therefore, we carried out an empirical study to compare three COTS selection methods; the process and results of the study are presented in this paper. The main objective of the study was to point out the differences between the COTS selection methods, that is if any existed, and to determine the ability of each of the methods to provide adequate COTS selection support and guidance. The ability of a method to provide adequate COTS selection support and guidance was measured in terms of the user satisfaction and confidence in the selection process, as well as in the results of the process.", "num_citations": "28\n", "authors": ["469"]}
{"title": "Breast tumor classification using a new OWA operator\n", "abstract": " Breast cancer is the most common cancer among Canadian women and the second cause of death from cancer. Fine needle aspirate (FNA) is a technology used to investigate early breast tumors to detect cancer. In this paper, we demonstrate the application of a new ordered weighted averaging operator (OWA) to the problem of breast tumor classification. The OWA operator employs the Laplace distribution to calculate the weight vector to aggregate the uncertain information about the breast tumors. The aggregated information is used along with the tumor label, i.e., benign or malignant, to train a nearest neighbor, support vector machine, and logistic regression classifiers. The result of this study based on the nearest neighbor classifier achieves 99.71% accuracy that outperforms other studies that utilize other OWA operators using the same dataset.", "num_citations": "24\n", "authors": ["469"]}
{"title": "Modeling and simulation of advisory speed and re-routing strategies in connected vehicles systems for crash risk and travel time reduction\n", "abstract": " Conventional traffic simulator systems do not support Connected Vehicles (CV). The focus of this study is to extend the functionality of a traffic simulator and developing APIs for Vehicle-to-Vehicle (V2V) and Vehicle-to-Infrastructure (V2I) communication. We use the extended simulation system to examine the implementation of advisory speed recommendation and re-routing guidance for urban freeways under various load conditions to recommend the optimum treatments and reduce rear-end and lane-change crash risks where speed differences between upstream and downstream vehicles were high. We use these strategies as a tool for safety improvement on a section of Deerfoot trail, Calgary, Alberta. Results of the experiments demonstrate the overall effectiveness of the approach.", "num_citations": "23\n", "authors": ["469"]}
{"title": "Dynamic cloud resource allocation considering demand uncertainty\n", "abstract": " Cloud computing provisions scalable resources for high performance industrial applications. Cloud providers usually offer two types of usage plans: reserved and on-demand. Reserved plans offer cheaper resources for long-term contracts while on-demand plans are available for short or long periods but are more expensive. To satisfy incoming user demands with reasonable costs, cloud resources should be allocated efficiently. Most existing works focus on either cheaper solutions with reserved resources that may lead to under-provisioning or over-provisioning, or costly solutions with on-demand resources. Since inefficiency of allocating cloud resources can cause huge provisioning costs and fluctuation in cloud demand, resource allocation becomes a highly challenging problem. In this paper, we propose a hybrid method to allocate cloud resources according to the dynamic user demands. This method is …", "num_citations": "22\n", "authors": ["469"]}
{"title": "Application of support vector machine and k-means clustering algorithms for robust chronic lymphocytic leukemia color cell segmentation\n", "abstract": " Chronic lymphocytic leukemia (CLL) is the most common type of blood cancer in Canadian adults. The relative 5-year survival rates for CLL in Canada is decreasing. CLL cell morphology maybe similar to normal lymphocytes and require a hematopathologist examination for diagnosis. There are a low number of related works on image analysis in CLL. This paper focuses on lymphocyte color cell segmentation using Support Vector Machine (SVM) and k-means clustering algorithms. The algorithm overcomes the occlusion problem when lymphocytes are tightly bound to the surrounding Red Blood Cells. Over and under-segmentation problems are significantly reduced. In this paper we used 440 lymphocyte images (normal and CLL), in which 140 images are used for segmentation accuracy measurement and 12 images for SVM training. The algorithm obtained 98.43% maximum accuracy for nucleus segmentation …", "num_citations": "22\n", "authors": ["469"]}
{"title": "A technique and a tool to detect emergent behavior of distributed systems using scenario-based specifications\n", "abstract": " Distributed systems are employed in countless applications such as information systems, robotics, etc. Lack of central control makes the design of such systems a challenging task because of possible unwanted behavior at runtime, commonly known as emergent behavior. Developing a methodology to detect emergent behavior in the pre-implementation stages of the software development life-cycle of distributed systems can potentially lead to huge savings in time and cost. Moreover, due to the typical large size of the modern distributed systems, automating the detection methodology is considered greatly beneficial. An effective and efficient approach for the design of distributed systems is to describe system requirements using scenarios. A scenario, commonly known as a message sequence chart (MSC), is a temporal sequence of messages sent between system components. However, scenario-based …", "num_citations": "21\n", "authors": ["469"]}
{"title": "Metrics for agent-based software development\n", "abstract": " In software engineering community an increasing effort has been put into design and development of multiagent systems (MAS). However, agent system development is currently dominated by informal guidelines, heuristics and inspirations rather than formal principles and well defined engineering techniques. In this paper we define a set of objective and subjective metrics to measure the complexity of MAS. The subjective metrics is a modified version of function point (FP) including the algorithmic complexity and knowledge complexity factor. The objective metrics is a measure for nearly-decomposability, measured by the communicative cohesion. Such metrics can be used to select the best architecture for the MAS. A methodology for agent-based software development based on such metrics is proposed.", "num_citations": "21\n", "authors": ["469"]}
{"title": "A framework for object identification and refinement process in object-oriented analysis and design\n", "abstract": " There are many projects focusing on computer aided software engineering (CASE) tools for object-oriented analysis and design. However, there are certain limitations to such solutions, as they concentrate on object-oriented notation and forward/reverse engineering, and the methodology for object identification and refinement is not implemented well. This paper presents a methodology for object identification and refinement from software requirements, based on object-based formal specification (OBFS). This methodology provides a means for understanding the object-oriented paradigm easily, and supports object identification and refinement. As a case study for a comprehensive explanation of how to use this methodology, an example of a software project for an air traffic control system is given.", "num_citations": "21\n", "authors": ["469"]}
{"title": "Evaluating the potential benefits of vehicle to vehicle communication (V2V) under incident conditions in the PARAMICS model\n", "abstract": " This paper uses PARAMICS micro‐simulation software to model and test Vehicle to Vehicle (V2V) communication algorithms within the IntelliDrive initiative [1]. V2V simulation capabilities are implemented through the use of two PARAMICS Applications Programming Interfaces (APIs). API# 1 randomly creates vehicle collisions according to a pre-specified frequency level. Once collisions are created with API# 1, API# 2 simulates the dissemination of V2V communication between individual vehicles and accordingly changes drivers’ awareness and aggressiveness levels. In addition, API# 2 includes an animation that changes the color of notified vehicles to demonstrate visually the developed communication application. The potentials of V2V are assessed by measuring the probability of occurrence of secondary collisions and by measuring the changes in travel time in the network. The developed APIs are rigorously …", "num_citations": "20\n", "authors": ["469"]}
{"title": "Development of an intelligent agent-based GQM software measurement system\n", "abstract": " Software measurement plays a key role in quantitative software engineering. Effective implementation of a measurement system to map collected data to business goals in a software organization is a prime problem. Goal-Question-Metrics (GQM) measurement provides the guidelines. A number of techniques to implement the GQM process have already been proposed. Nevertheless, the GQM process is complex, knowledge-intensive, iterative and therefore expensive. A tool to automate the process will be quite helpful. This paper introduces a multi-agent system called ISMS, which is designed for providing intelligent aid for software measurement based on GQM technique. The objective of developing this intelligent system is to automate the GQM process by building an agentbased system that accepts at its input a user’s business goal, asks questions interactively and after a few iterations produces a software measurement plan at its output. This multiagent system is composed of two clusters of agents, client-side assistant agents and server-side cooperative agents. The client-side agents work as intelligent front-end for the users and the server-side agents work cooperatively to realize various roles necessary to implement the GQM process.", "num_citations": "20\n", "authors": ["469"]}
{"title": "An integrated reasoning and learning environment for WWW based software agents for electronic commerce\n", "abstract": " A major topic in the field of network and telecommunications is doing business on the World Wide Web (WWW), which is called Electronic Commerce (EC).  Another major topic is blending Artificial Intelligence (AL) techniques with the WWW.  In the Ex-W-Pert Project we have proposed an agent model for EC components that blends the traditional expert systems' reasoning engine with a multi-layer knowledge base, communication and documentation engines.  In this project, EC is viewed as a society of software agents, such as customer, search, catalog, manufacturer, dealer, delivery and banker agents, interacting and negotiating with each other.  Each agent has a knowledge-base and a reasoning engine, a communication engine and a documentation engine.  The knowledge-base is organized in three layers: skill layer, rule layer and knowledge layer (S-R-K layers).  In this project, for each EC agent, we identify …", "num_citations": "19\n", "authors": ["469"]}
{"title": "Software creation: An sdl-based expert system for automatic software design\n", "abstract": " A goal of this project is reproducing human design process by accumulating knowledge and experience of human designers. Particularly, this paper presents an SDL-based software design tool, the experimental expert system CREATOR2, featuring: 1) integration of SDL-based CASE tools with knowledge-based reasoning techniques; 2) objectoriented (OO) representation of the design process knowledge, composed of design rules for detailing, and tacit knowledge; 3) OO representation of the SDL/GR symbols in the knowledge-base; 4) using multiple strategies in applying the design process knowledge; and 5) OO implementation of the system. This leads to having a uniform modeling and advanced reasoning environment for software design. Experiments on designing switching software are reported. Presently, the CREATOR2 system together with an SDL CASE tool offers 60-100 times code expansion rate.", "num_citations": "19\n", "authors": ["469"]}
{"title": "Reinforcement learning based recommender systems: A survey\n", "abstract": " Recommender systems (RSs) are becoming an inseparable part of our everyday lives. They help us find our favorite items to purchase, our friends on social networks, and our favorite movies to watch. Traditionally, the recommendation problem was considered as a simple classification or prediction problem; however, the sequential nature of the recommendation problem has been shown. Accordingly, it can be formulated as a Markov decision process (MDP) and reinforcement learning (RL) methods can be employed to solve it. In fact, recent advances in combining deep learning with traditional RL methods, i.e. deep reinforcement learning (DRL), has made it possible to apply RL to the recommendation problem with massive state and action spaces. In this paper, a survey on reinforcement learning based recommender systems (RLRSs) is presented. We first recognize the fact that algorithms developed for RLRSs can be generally classified into RL- and DRL-based methods. Then, we present these RL- and DRL-based methods in a classified manner based on the specific RL algorithm, e.g., Q-learning, SARSA, and REINFORCE, that is used to optimize the recommendation policy. Furthermore, some tables are presented that contain detailed information about the MDP formulation of these methods, as well as about their evaluation schemes. Finally, we discuss important aspects and challenges that can be addressed in the future.", "num_citations": "18\n", "authors": ["469"]}
{"title": "OOExpert: distributed expert system for automatic object-oriented software design\n", "abstract": " CiNii 論文 - OOExpert: Distributed expert system for automatic object-oriented software design CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本を さがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年 から 年まで 検索 検索 検索 CiNii窓口業務の再開について OOExpert: Distributed expert system for automatic object-oriented software design WAHONO RS 被引用文献: 1件 著者 WAHONO RS 収録刊行物 13th Annual Conference of Japanese Society for Artificial Intelligence, JSAI'99 13th Annual Conference of Japanese Society for Artificial Intelligence, JSAI'99, 456-457, 1999 被引用文献: 1件中 1-1件を 表示 1 Formalization of Organizational Intelligence for Multiagent System Design FAR Behrouz Homayoun , HAJJI Hassan , SANIEPOUR Shadan , SOUEINA O(…", "num_citations": "18\n", "authors": ["469"]}
{"title": "Expert's Knowledge Structure Explains Software Engineering\n", "abstract": " This paper reports on a model of design, and by which various aspects of Software Engineering are explained. Design is modeled by a hierarchically expanding network. Productivity, error rate, Learning effect, and various process problems may be evaluated by this model. Requiremenţs for desirable documenta-tion is also described.", "num_citations": "17\n", "authors": ["469"]}
{"title": "Negotiation coalitions in group-choice multi-agent systems\n", "abstract": " In Group-Choice Decision Making (GCDM) where a number of stakeholders are involved in choosing a single solution from a set of available solution options, it is common for the stakeholders to form coalitions during negotiations in order to increase their individual welfare. It is also common to use Multi-Agent Systems (MAS) to automate GCDM processes. In such MAS, agents have to form coalitions like their human counterparts. Within each coalition, the individual agents behave according to the strategies of their clients. In this paper we present a coalition formation model which can employ multiple coalition formation algorithms. The model is motivated by a real-world group-choice multi-agent system that we developed; in the system, agents can form coalitions dynamically based on the similarity between their preferences, and based on the ownership criteria. Finally, this paper presents simulation results that …", "num_citations": "16\n", "authors": ["469"]}
{"title": "Topology discovery for network fault management using mobile agents in ad-hoc networks\n", "abstract": " Managing today's complex and increasingly heterogeneous networks requires in-depth knowledge and extensive training as well as collection of very large amount of data. Fault management is one of the functional areas of network management that entails detection, identification and correction of anomalies that disrupt services of a network. The task of fault management is even harder in ad-hoc networks where the topology of the network changes frequently. It is very inefficient if not impossible to discover the ad-hoc network topology using traditional practices of network discovery. We propose a mobile multi agent system for topology discovery that will allow fault management functions in ad-hoc network. Comparison to current mobile agent based topology discovery systems is also presented", "num_citations": "16\n", "authors": ["469"]}
{"title": "Formalization of organizational intelligence for multiagent system design\n", "abstract": " Although there are many projects focusing on multiagent systems, there are only a few focusing on systematic design of large scale multiagent system. In this paper we formalize the knowledge representation and sharing of agents, using symbol structures, define agencies as organizations (i. e. , a coalition of agents), propose a formalism to represent organizational Intelligence, devise a basic configuration for generalized agents (AG), and use them in a large scale multiagent system design. Private knowledge of an AG agent is represented by a symbol structure (SS) and AG agents can share their knowledge using combination, specialization and generalization methods that operate on the SS. Opposite to the other works, organizational knowledge, is defined as a property of at least a pair of AG agents.", "num_citations": "16\n", "authors": ["469"]}
{"title": "Software Creation: Implementation and application of design process knowledge in autiomatic software design\n", "abstract": " CiNii 論文 - Software Creation : Implementation and application of design process knowledge in autiomatic software design CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文を さがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について Software Creation : Implementation and application of design process knowledge in autiomatic software design KOONO Z. 被引用文献: 1件 著者 KOONO Z. 収録刊行物 5th SEKE '93 5th SEKE '93, 332-336, 1993 被引用文献: 1件中 1-1件を 表示 1 設計知識の系統的な獲得 河野 善弥 , FAR Behrouz H. , 杉本 崇 人工知能学会全国大会論文集 = Proceedings of the Annual Conference of JSAI 8, 443-446, 1994-06-20 参考文献11件 被引用文献4件 Tweet 各種コード NII論文ID(NAID) に/(…", "num_citations": "16\n", "authors": ["469"]}
{"title": "Qualitative fault diagnosis in systems with nonintermittent concurrent faults: a subjective approach\n", "abstract": " Major approaches to automatic fault diagnosis of industrial plants are either subjective or objective. Subjective approaches imitate and synthesize the way that human experts diagnose faults. Objective approaches automate a portion of a diagnostic task which, due to cognitive limitation, humans do not handle efficiently. Currently available subjective fault diagnosis techniques suffer from certain drawbacks, such as: lack of knowledge for modeling and reasoning with the required levels of detail; inefficiency in utilization of sensory data; and inadequacy in learning experienced schemas. A subjective approach to fault diagnosis, using qualitative modeling and reasoning within the multiple view of the system, is introduced. The focus is on automation of the cognitive skills of human experts, which include utilizing conceptual models to detect inherent redundancy in system behavior qualitative reasoning to predict future …", "num_citations": "16\n", "authors": ["469"]}
{"title": "Behavior-based location recommendation on location-based social networks\n", "abstract": " Location recommendation methods on location-based social networks (LBSN) discover the locational preference of users along with their spatial movement patterns from users’ check-ins and provide users with recommendations of unvisited places. The growing popularity of LBSNs and abundance of shared location information has made location recommendation an active research area in the recent years. However, the existing methods suffer from one or more deficiencies such as data sparsity, cold-start users, ignoring users’ specific spatial and temporal behaviors, not utilizing the shared behaviors of the users. In this paper, we propose a novel location recommendation method, namely Behavior-based Location Recommendation (BLR). BLR recommends a location to a user based on the users’ repetitive behaviors and behaviors of similar users. Additionally, to better integrate the spatial information, BLR has …", "num_citations": "15\n", "authors": ["469"]}
{"title": "Detecting emergent behavior in distributed systems using an ontology based methodology\n", "abstract": " Lack of central control makes the design of distributed software systems a challenging task because of possible unwanted behavior at runtime, commonly known as emergent behavior. Developing methodologies to detect emergent behavior prior to the implementation stage of the system can lead to huge savings in time and cost. However manual review of requirements and design documents for real-life systems is inefficient and error prone; thus automation of analysis methodologies is considered greatly beneficial. This paper proposes the utilization of an ontology-based approach to analyze system requirements expressed by a set of message sequence charts (MSC). This methodology involves building a domain-specific ontology of the system, and examines the requirements based on this ontology. The advantages of this approach in comparison with other methodologies are its consistency and increased …", "num_citations": "15\n", "authors": ["469"]}
{"title": "Model based detection of implied scenarios in multi agent systems\n", "abstract": " Multi-agent systems (MAS) are efficient solutions for commercial applications such as information retrieval and search. In a MAS, agents are usually designed with distribution of functionality and control. Lack of central control implies that the quality of service of MAS may be degraded because of possible unwanted behavior at the runtime, commonly known as emergent behavior. Detecting and removing emergent behavior during the design phase of MAS will lead to huge savings in deployment costs of such systems. An effective approach for the MAS design is to describe system requirements using scenarios. A scenario, commonly known as a message sequence chart or a sequence diagram, is a temporal sequence of messages sent between agents. In this paper a method for detecting emergent behavior of MAS by detecting incompleteness and partial description of scenarios is proposed. The method is …", "num_citations": "15\n", "authors": ["469"]}
{"title": "Software Agents: Quality, complexity and uncertainty issues\n", "abstract": " In software engineering community there is an increasing effort of design and development of multiagent systems (MAS). Among several issues emerging from this initiative, complexity, quality and uncertainty issues have not yet received much attention. The main factors affecting quality of MAS are complexity and knowledgeability. Complexity of MAS can be defined in terms of structural and algorithmic complexity in either objective or subjective way. Knowleageability of MAS can be defined in terms of problem solving and cognitive capabilities and the ability to cope with interactions, such as cooperation, coordination and competition. In this paper we define and address the quality and complexity issues of MAS and define metrics to measure the quality and complexity. The metrics are used for devising a candidate set of agents for MAS design. Furthermore, we address the knowledgeability of MAS and devise …", "num_citations": "15\n", "authors": ["469"]}
{"title": "A unified view of heterogeneous agents' interaction\n", "abstract": " In this paper agents' interactions are defined in terms of cooperation, coordination and competition. As for cooperation and coordination problems, we focus on knowledge sharing of agents, define agencies as organizations of agents, propose a method to extract organizational knowledge for interacting agents. In case of competition, knowledge sharing is impossible. Therefore, modeling and formalization of strategic decision making and uncertainty management is required. We present an incomplete game theoretical based decision making method for competitive agents.", "num_citations": "15\n", "authors": ["469"]}
{"title": "Software Creation: Towards Automatic Software Design by...\n", "abstract": " This paper describes the outline, the approach and current status of the SoftwareCreati9 project. The main idea is to follow the design steps of human designers by extracting and reusing the design process knowledge in a hierarchically organized work process. The presently implemented system consists of a SDL CASE tool and an expert system for applying the design process knowledge. This system serves as an experimental platform for the study of human design by simulating the design at the lowest level. The experiments are being made on designing switching software. At the moment, the system can detail the input design data in SDL graphic symbols to around 100 times complex C code.", "num_citations": "15\n", "authors": ["469"]}
{"title": "A system for vehicle collision and rollover detection\n", "abstract": " Traffic accidents negatively affect the lives of human beings. Accidents may result in deaths, severe injuries, and loss of income to the impacted families. Accident detection and prevention is a keystone in improving road safety. In this paper, a system for detecting vehicle collision and rollover is presented. The proposed system includes three key phases. Data acquisition where accelerometer and gyroscope, integrated into MPU-6050 motion sensor are used to acquire 3-axis acceleration forces and rotation angles respectively. The complementary filter is used to enable the use of the gyroscope data on the short term because it is very precise and not susceptible to external forces. On the long term, the accelerometer data is used because it does not drift. An algorithm for acquiring data using sensors, filtering and analyzing data, detecting collision and rollover is developed. Experiments are conducted to test the …", "num_citations": "14\n", "authors": ["469"]}
{"title": "An intelligent project lifecycle data mart-based decision support system\n", "abstract": " Mission critical decision making in enterprises depends heavily on intelligent systems for extracting, analyzing and interpreting information from multiple heterogeneous, distributed data and knowledge sources. It is assumed that data warehouses (DW) and data marts (DM) are required for optimized data accessibility and use. This paper discusses issues with the current DW/DM systems and propose a novel architecture based on multi-agents technology to support information and knowledge extraction over distributed data sources in order to use them in the decision making process. The proposed framework is applied to a real-world project lifecycle case, the EPC (Engineering Procurement and Construction) project.", "num_citations": "14\n", "authors": ["469"]}
{"title": "Multi-agent system for group-choice negotiation and decision support\n", "abstract": " CiNii 論文 - Multi-agent system for group-choice negotiation and decision support CiNii 国立 情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の 博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関するアンケートを実施中です（11/11(水)-12/23(水)） Multi-agent system for group-choice negotiation and decision support WANYAMA T. 被引用文献: 1件 著者 WANYAMA T. 収録刊行物 Proc. 3rd Workshop on Agent Oriented Information Systems at the Autonomous Agents and Multi-Agent Systems Conference, New York, July 2004 Proc. 3rd Workshop on Agent Oriented Information Systems at the Autonomous Agents and Multi-Agent Systems Conference, New York, July 2004, 2004 被引用文献: 1件中 1-1件を 表示 1 A Multi-for : (…", "num_citations": "14\n", "authors": ["469"]}
{"title": "Uncertainty management framework for multi-agent system\n", "abstract": " Software Agents interaction involves uncertainty. In order to model and formalize agents’ interaction, three properties: public, private and protected are adopted to precisely represent the belief-desire-intension (BDI) agent, and agent’s relationships have been interpreted in terms of cooperation, coordination and competition based on BDI agent model. An agent’s uncertainty management framework is then proposed with respect to some decision support tools, this framework could ease the analysis of multiagent systems in a more formal way and help design efficient reasoning process for software agents.", "num_citations": "14\n", "authors": ["469"]}
{"title": "A Systematic Construction Method of an Expert System Used for Automatic Software Design. Acquisition and Reproduction of Design Knowledge from Design Process.\n", "abstract": " ソフトウェア自動設計における系統的なエキスパートシステムの構築 設計工程からの設計知識の獲得と再現", "num_citations": "14\n", "authors": ["469"]}
{"title": "Data-oriented intelligent transportation systems\n", "abstract": " Real-time analysis of traffic data is a key challenge in intelligent transportation system. It aims at discovering useful traffic patterns that can help decision makers better manage the transportation system and test and introduce new policies. Discovered patterns can also be used to support road users to reach their destination safely and with reasonable commuting time. In this paper, a number of key challenges associated with transportation systems and possible solutions are discussed. A method that analyzes real-time traffic data to predict future status of traffic flow and incidents is introduced. The proposed method includes three phases: offline, real-time, and decision support phases. In this paper, a decision tree classification model is constructed and validated for an accident dataset. Possible benefits of using the constructed model are demonstrated using results of the classification analysis.", "num_citations": "13\n", "authors": ["469"]}
{"title": "Repositories for COTS selection\n", "abstract": " Selecting commercial-off-the-shelf (COTS) products is a challenging process that utilizes and generates a lot of information. Repositories play a crucial role in the management of the COTS selection information. In fact, it is generally believed in literature that repositories are of great importance to the COTS selection process and indeed to the entire process of developing software using COTS products. However, the process of developing, managing, and accessing these repositories has attracted very little attention. This paper presents a framework for establishing and maintaining the following five different repositories for the COTS selection process: COTS repository, user repository, discussions repository, lessons-learned repository, and historical information repository. The framework supports distributed contribution and access to the repositories, as well as systematic and hierarchical evaluation and integration …", "num_citations": "13\n", "authors": ["469"]}
{"title": "A multi-agent framework for conflict analysis and negotiation: Case of cots selection\n", "abstract": " The process of evaluating and selecting Commercial Off-The-Shelf (COTS) products is complicated because of conflicting priorities of the stakeholders, complex interdependences among the evaluation criteria, multiple evaluation objectives, changing system requirements, and a large number of similar COTS products with extreme capability differences. Numerous COTS evaluation and selection methods have been proposed to address the complexity of the process. Some of these methods have been successfully applied in industry. However, negotiation to resolve stakeholder conflicts is still an ad hoc process. In this paper, we present a systematic model that assists the COTS selection stakeholders in identifying conflicts, as well as in determining and evaluating conflict resolution options. Our model is facilitated by an agent-based decision support system, which has user agents that assist the stakeholders in the …", "num_citations": "13\n", "authors": ["469"]}
{"title": "Detection of network faults and performance problems\n", "abstract": " Network normal operation baselining for automatic detection of anomalies is addressed. A model for network traffic is presented in which studied variables are modeled as a finite mixture model. Based on stochastic approximation of the maximum likelihood function, we propose a baseline of network normal operation as the asymptotic distribution of the difference between successive estimates of model parameters. The baseline multivariate random variable is shown to be stationary, with mean zero under normal operation. Performance problems are characterized by sudden jumps in the mean. Detection is formulated as an online change point problem, where the task is to process residuals and raise alarms as soon as anomalies occur. An analytical expression of false alarm rate allows us to choose the threshold, automatically. Extensive experimental results on a real network showed that the monitoring agent is …", "num_citations": "13\n", "authors": ["469"]}
{"title": "Functional reasoning, explanation and analysis: Qualitative function formation technique\n", "abstract": " Functional Reasoning enables people to reason about the presence and function of components in a device, derive the purpose of the device and explain how it can be achieved. Qualitative Function Formation (QFF) a functional reasoning technique is introduced. Some novel points are extending the common qualitative models to include interactions and timing of events, by de ning temporal and dependency constraints, and binding it with the conventional qualitative simulation. A function concept is de ned as an interpretation of either a persistence or an order in the sequence of qualitative states, using the trace of the qualitative state vector derived by simulation on the extended qualitative model. QFF o ers solution to the functional reasoning problems and is used to generalize and compare the functions of devices.", "num_citations": "13\n", "authors": ["469"]}
{"title": "Let’s hear it from RETTA: A Requirements Elicitation Tool for TrAffic management systems\n", "abstract": " The area of Traffic Management (TM) is characterized by uncertainty, complexity, and imprecision. The complexity of software systems in the TM domain which contributes to a more challenging Requirements Engineering (RE) job mainly stems from the diversity of stakeholders and complexity of requirements elicitation in this domain. This work brings an interactive solution for exploring functional and non-functional requirements of software-reliant systems in the area of traffic management. We prototyped the RETTA tool which leverages the wisdom of the crowd and combines it with machine learning approaches such as Natural Language Processing and Naïve Bayes to help with the requirements elicitation and classification task in the TM domain. This bridges the gap among stakeholders from both areas of software development and transportation engineering. The RETTA prototype is mainly designed for …", "num_citations": "12\n", "authors": ["469"]}
{"title": "A method for detecting agents that will not cause emergent behavior in agent based systems-A case study in agent based auction systems\n", "abstract": " Modeling and implementing auction systems using agent technology is a common practice because agents can assume various roles and their behavior will be determined as a result of negotiation. However, emergent behavior is a hurdle. Mechanisms must be in place to make sure that agents participating in the auction systems won't behave in an unintended way. Detecting emergent behaviors in the design phase rather than the deployment is more cost and effort efficient. Patterns of interaction, called scenarios, are the basic modeling constructs for design and behavioral modeling of agents. However, working with several agents in an online auction system needs large number of scenarios. Therefore transforming scenarios to finite state machines (FSM) and parallel execution of the FSMs in the behavioral synthesis phase may lead to computational overload. So far all the research has been around the ways of …", "num_citations": "12\n", "authors": ["469"]}
{"title": "A negotiation model for large scale multi-agent systems\n", "abstract": " Modeling agent negotiation is of key importance in building multiagent systems. Negotiation provides the basis for managing the expectations of the individual negotiating agents, and it enables selecting solutions that satisfy the agents as much as possible. Thus far, most of the negotiation models have limitations when employed in large scale multiagent systems. This paper presents a negotiation model for large scale multiagents systems that is based on qualitative reasoning (QR) and game theory (GT). In the model, each agent classifies its negotiation opponents according to the similarity of their preference model. The agents use QR components of the model to estimate the preference models of their opponents, and to determine the amount of tradeoff associated with the various solution options. Moreover, they use the GT component of the model to determine the social-acceptance of each of the solution …", "num_citations": "12\n", "authors": ["469"]}
{"title": "Automated ontology evolution in a multi-agent system\n", "abstract": " This research addresses the formation of new concepts and their corresponding ontology in a multi-agent system where individual autonomous agents try to learn new concepts by consulting several other agents. In this research individual agents create and learn their distinct conceptualization and rather than a commitment to a common ontology they use their own ontologies. In this paper multi-agent supervised learning of concepts among individual agents with diverse conceptualization and different ontologies is introduced and demonstrated through an intuitive example in which supervisors are other agents rather than a human.", "num_citations": "12\n", "authors": ["469"]}
{"title": "Agent-based resource management in hybrid wireless networks\n", "abstract": " Wireless networks are no more used for transfer of only voice but now also support data, video and multimedia. The key issue is to provide these services and maintain quality of service (QoS) in hybrid wireless networks. A very interesting problem is managing radio resources in a hybrid wireless network. The paper presents an agent-based scheme for efficient management of radio resources in hybrid wireless networks. Performance of the proposed scheme is measured in terms of successful handover rate between different wireless network architectures (e.g., WLAN, cellular), and also by the allocated bandwidth to admitted calls. Simulation results show that the proposed agent-based approach provides a 10% increase in the average allocated bandwidth obtained with conventional resource management schemes.", "num_citations": "12\n", "authors": ["469"]}
{"title": "Distributed software agents for network fault management\n", "abstract": " This paper discusses a framework for automating fault management using distributed software agents. The management function is distributed among multiple agents that can carry out advanced reasoning activities on the network domain. Network domain modeling using Bayesian network is introduced. The agent detects, correlates and selectively seeks to derive a clear explanation of the alarms generated in its domain. Depending on the network's degree of automation, the agent can even carry out local recovery actions. The ideas of the paper are implemented in a software for inference in Bayesian network. We identify the potentialities of learning in the agent model, and present the class of problems to be addressed.", "num_citations": "12\n", "authors": ["469"]}
{"title": "Minimizing deployment cost of cloud-based web application with guaranteed QoS\n", "abstract": " Cloud computing provides a reliable and cost- effective setting for deploying large-scale web applications. However, choosing and configuring an appropriate cloud Infrastructure-as-a-Service (IaaS), e.g., the appropriate database and computing instances and acceptable service rates, is a daunting task. The task is also challenging when trying to optimize the IaaS for conflicting objectives such as performance and cost. Furthermore, due to lack of understanding of the pricing model and the cloud IaaS, a cloud consumer may pay more than necessary or may not fully utilize the purchased resources. For this reason, we propose an algorithm that suggests the most cost-effective configuration meeting the QoS requirements and budget constraint. In contrast to existing cost optimization proposals, our proposed algorithm maps the minimum requirements of the to- be-deployed web application to deployment costs …", "num_citations": "11\n", "authors": ["469"]}
{"title": "Predicting web service response time percentiles\n", "abstract": " Predicting Web service response time percentiles is often an important aspect of service level management exercises. Existing techniques can be very time consuming since they involve the manual construction of complex analytic or simulation models. To address this problem, we propose Prospective, a fully automated and data-driven approach for predicting Web service response time percentiles. Prospective relies on historical response time data collected from a Web service. Given a specification for workload expected at the Web service over a planning horizon, Prospective uses this historical data to offer predictions for response time percentiles of interest. At the core of Prospective is a lightweight simulator that uses collaborative filtering to estimate response time behaviour of the service based on behaviour observed historically. Results show that Prospective is able to predict various response time …", "num_citations": "10\n", "authors": ["469"]}
{"title": "Predicting Students' Behavioral Patterns in University Networks for Efficient Bandwidth Allocation: A Hybrid Data Mining Method (Application Paper)\n", "abstract": " The effective bandwidth management in multi-service computer networks such as university networks has become a challenge in recent years. The growth of internet traffic and limitation of bandwidth resources persuade the information technology (IT) managers to focus on effective bandwidth allocation policies. One of the important issues discussed in this domain is how to assign the bandwidth fairly based on the priority levels. In this paper, focusing on the \"priority-based bandwidth allocation\", a hybrid data mining method is developed to manage the limited bandwidth in a university network more effectively. This method is composed of two main steps and uses the clustering and classification techniques. The main purpose is to detect, analyze and predict students' behavioral patterns in a university network and identify the main factors that affect their tendency in using internet. The proposed method is applied on …", "num_citations": "10\n", "authors": ["469"]}
{"title": "Microsimulation evaluation of the potential impacts of vehicle-to-vehicle communication (V2V) in disseminating warning information under high incident occurrence conditions\n", "abstract": " This paper focuses on assessing the benefits of vehicle-to-vehicle (V2V) communication in high incident cases resulting from extreme conditions, such as adverse weather conditions. V2V capabilities are simulated and tested through the use of two Paramics Applications Programming Interfaces (APIs). One API randomly creates incidents, and the API simulates the dissemination of V2V communication between individual V2V vehicles. The developed APIs are rigorously evaluated on an urban arterial network by comparing various scenarios with and without V2V. The results of all experiments demonstrate the overall effectiveness of V2V in improving safety and improving network travel time for high and moderate congestion level scenarios.", "num_citations": "10\n", "authors": ["469"]}
{"title": "Eliciting Scenarios from Scenarios.\n", "abstract": " Scenario-based software development has been widely accepted for the description of concurrent systems. However, scenario-based software development is inherently partial as scenarios can only show instances of the system behaviour and because the behaviour of each component is only meaningful in collaboration with other components in scenarios. Therefore, sound, formal, and structured approaches which help in eliciting scenarios that cover more aspects of the system requirements are welcome in software engineering.This paper presents an approach for incorporating the domain knowledge and the system architecture depicted in scenarios for elaborating scenario specifications. Our approach can be repeatedly applied in a cycle that consists of eliciting the domain knowledge from scenarios and producing new scenarios until a satisfactory specification is reached.", "num_citations": "10\n", "authors": ["469"]}
{"title": "On the evaluation of agent-oriented software engineering methodologies: a statistical approach\n", "abstract": " Agent-based computing is one of the fastest growing areas of research and development in information technology. A large number of Agent-Oriented Software Engineering (AOSE) methodologies have been evolved in order to assist in building intelligent software. Nevertheless, the immaturity of this emerging technology can result in difficulties for a developer when deciding which methodology can best fit a prospective application. A limited number of studies have been conducted to address the comparison and evaluation of AOSE methodologies. However, such studies lack a reliable framework that can be implemented and generalized effectively; most of the proposed approaches are not capable of providing sufficient knowledge to support accurate decision-making. In this paper, we present a reliable framework based on adopting state-of-the-art statistical procedures to evaluate AOSE methodologies …", "num_citations": "10\n", "authors": ["469"]}
{"title": "Automated ontology construction from scenario based software requirements using clustering techniques\n", "abstract": " Ontologies have been utilized in many different areas of software engineering. As software systems grow in size and complexity, the need to devise methodologies to manage the amount of information and knowledge becomes more apparent. Utilizing ontologies in requirement elicitation and analysis is very practical as they help to establish the scope of the system and facilitate information reuse. Moreover ontologies can serve as a natural bridge to transition from the requirements gathering stage to designing the architecture for the system. However manual construction of ontologies is time consuming, error prone and subjective. Therefore it is greatly beneficial to devise automated methodologies which allow knowledge extraction from system requirements using an automated and systematic approach. This paper introduces an approach to systematically extract knowledge from system requirements to construct …", "num_citations": "9\n", "authors": ["469"]}
{"title": "A Model-Based Performance Testing Toolset for Web Applications.\n", "abstract": " Effective performance testing techniques are essential for understanding whether a Web-based application will meet its performance objectives when deployed in the real world. The workload of such an application has to be characterized in terms of sessions; a session being a sequence of inter-dependent requests submitted by a single user. Dependencies arise because some requests depend on the responses of earlier requests in a session. To exercise application functions in a representative manner, these dependencies should be reflected in the synthetic workloads used to test Web-based applications. The need to handle these dependencies makes performance testing a time consuming process. Specifically, since the nature of these dependencies varies across systems considerable effort needs to be dedicated towards tailoring a set of test tools that will work for a given system. Furthermore, the traditionally followed approach of manually developing test scripts that handle dependencies makes it difficult to achieve fine-grained control over a synthetic workload’s characteristics. In this paper, we propose a new model-based approach to address these issues. Our approach uses an application model that captures the dependencies for a Web-based application system under study. The application model provides an indirection that allows a common set of workload generation tools to be used for testing different applications. Consequently, less effort is needed for developing and maintaining the testing tools and more effort can be dedicated towards the performance testing process. Furthermore, the application model can be used to obtain …", "num_citations": "9\n", "authors": ["469"]}
{"title": "Software reliability engineering for agile software development\n", "abstract": " In software industry there is a common assumption that deployment of software reliability engineering (SRE) contributes to huge overhead in development and its practice does not match the agile software development which puts emphasis on traveling light and generating a minimal amount of project artifacts. However measuring and/or assessing reliability of developed software is nevertheless a very important task and there seems to be a natural fit between SRE and agile in driving certification testing. SRE typically focuses on directing test efforts after software has been created in order to achieve a predetermined failure intensity objective (FIO). It also uses reliability growth models in order to predict when the software will meet the FIO, and therefore can be released. While these ideas may initially seem incompatible with the test-driven emphasis of agile methods, we show that SRE does in fact have value within …", "num_citations": "9\n", "authors": ["469"]}
{"title": "Energy-efficient coalition formation in sensor networks: a game-theoretic approach\n", "abstract": " The most important challenge in Wireless Sensor Networks (WSNs) is the energy constraint. Numerous solutions have been proposed to alleviate the issue, including clustering. Game theory is an effective decision-making tool that has been shown to be effective in solving complex problems. In this paper, we employ cooperative games and propose a new clustering scheme called Coalitional Game-Theoretic Clustering (CGTC) algorithm for WSNs. The idea is to partition the entire network area into two regions, namely far and vicinity, in order to address the hotspot problem in WSNs, wherein nodes close to the base station (BS) tend to deplete their energy faster due to relaying the traffic load received from farther nodes. Then, coalitional games are utilized to group nodes as coalitions. The main factor in choosing coalition heads is the energy level of nodes so that the most powerful nodes play the role of heads …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Toward leveraging big value from data: chronic lymphocytic leukemia cell classification\n", "abstract": " The goal of Big Data analysis is delineating hidden patterns from data and leverage them into strategies and plans to support informed decision making in a diversity of situations. Big Data are characterized by large volume, high velocity, wide variety, and high value, which may represent difficulties in storage and processing. Research on Big Data repositories has contributed promising results that primarily address how to efficiently mine a variety of large volume of structured and unstructured data. However, innovative insights can emerge while leveraging the value characteristic of Big Data. In other words, any given data can be big if analytics can draw a big value from it. In this paper, we demonstrate the potential of five machine learning algorithms to leverage the value of medium size microscopic blood smear images to classify patients with chronic lymphocytic leukemia (CLL). The maximum majority …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Cooperative multi-sensor multi-vehicle localization in vehicular adhoc networks\n", "abstract": " Intelligent Transportation System (ITS) is an important application domain for information reuse and integration. Efficient integration and deployment of information and communication technologies (ICT) can potentially reduce travel time and emission, improve usage of parking and public spaces, offer personalized travel related services, and more importantly, improve safety for drivers and pedestrians in large municipalities. Personalized travel related services and recommendation systems rely mainly on precise identification of position of the vehicles. In this paper we propose a cooperative multi-sensor multi-vehicle localization algorithm with high accuracy for terrestrial vehicles. Noisy observations in the form of GPS coordinates of nearby vehicles as well as inter-vehicle distance measurements are assumed to be available. These heterogeneous sources of information are fused together and used to estimate the …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Designing interactive health care systems: Bridging the gap between patients and health care professionals\n", "abstract": " As patients become more proactive about their health and turn to technologies such as the Internet to acquire knowledge, the patient-health care professional relationship has been changing. Traditionally, information has flowed from health care professional to patient, but change to a two-way dialogue is taking place. In this study, we examine a high level design of a perceived medical system and determine the implications of adding patients as active contributors. The main challenge of modifying existing systems to incorporate patient interaction is preserving system integrity. We propose a systematic approach to support scaling health care systems while preserving system integrity. Distributed systems such as personal health records and eHealth systems provide two ways in which patients can become more involved with their own health care with or without the involvement of health care professionals. It is …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Realization of Semantic Search Using Concept Learning and Document Annotation Agents.\n", "abstract": " Currently, search systems are based on commitment to a common ontology. In the real world, it is preferred to enable Web repositories to exchange information freely while keeping their own ontology. This helps contents providers to represent information independently in the repositories at the expense of bringing complexity to the communication and negotiation. To solve the communication complexity problem we present (1) a method for semantic search supported by ontological concept learning, and (2) a prototype multi-agent system that can handle semantic search while encapsulating complexity of such process from the users. The method introduces a spiral search process and a layered structure of semantic interoperability. Agents, which conduct semantic search on behalf of users, deploy ontologies to organize documents in their corresponding repositories. Through a detailed experiment we will show that agents can improve their search capability by learning new concepts from each other, and consequently, provide better search results to the users.", "num_citations": "8\n", "authors": ["469"]}
{"title": "Enhancing communication with groups of agents using learned non-unanimous ontology concepts\n", "abstract": " We present an extension to the definition of a concept in an ontology that allows an agent to simultaneously communicate with a group of agents that might have different understandings of some concepts. We also provide a way to learn such non-unanimous concepts by using a method for learning concepts from a group of teachers. The general idea of non-unanimous concepts is to use the teachers to identify the core of a concept everyone agrees on and what else at least some of the teachers think belongs into the concept. The learning agent also decides what belongs to the concept for itself and whenever it needs to communicate with a group of other agents and needs to be precise it makes use of these three concept aspects by providing additional example objects for what might be misunderstood.", "num_citations": "8\n", "authors": ["469"]}
{"title": "Performance of mobile agent based network topology discovery\n", "abstract": " Topology discovery in both wired and wireless networks has been receiving increasing attention in the research community as well as the industry. Topology discovery is quite a time consuming task if it is done manually in a large network. It is more difficult in networks where the topology changes very frequently such as mobile ad hoc networks (MANET). MANET networks are complex and distributed system comprising of wireless mobile nodes that can move around freely, dynamically self-organize into arbitrary and temporary network topologies [14]. Currently there are a number of tools available that allows network administrators to discover the network nodes automatically. However most of these tools either use PING, trace route or SNMP queries. In addition, a lot of these tools also require a range of IP addresses that can be pinged to discover the network. However in such approaches, nodes in mobile ad hoc …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Mobile agent system for network topology discovery\n", "abstract": " Current trend of increasing use of mobile devices such as PDA, Laptop, and intelligent cell phones etc., has given increased interest in wireless and mobile networks. The cost and complexity associated with infrastructure based wireless networking is leading researchers to investigate ad hoc networks. Managing ad hoc network is significantly different than managing infrastructred network. One of the major challenges in managing ad hoc network is discovery of the topology of the network on the fly. We have developed a mobile agent based system that allows for real time topology discovery of the network. As opposed to many such mobile agent based systems that utilize \"ant\" based algorithms, our system makes efficient use of the limited network resources of the ad hoc network by restricting the mobility of the agents. The mobile agent uses its mobility only to move to a new node after which it turns into a …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Qualitative reasoning model for tradeoff analysis\n", "abstract": " In Multi-Criteria Decision Making problems such as choosing a development policy, selecting software products, or searching for commodities to purchase, it is often necessary to evaluate solution options in respect of multiple objectives. The solution alternative that performs best in all the objectives is the dominant solution, and it should be selected to solve the problem. However, usually the selection objectives are incomparable and conflicting, making it impossible to have a dominant solution among the alternatives. In such cases, tradeoff analysis is required to identify the objectives that can be optimized, and those that can be comprised in order to choose a winning solution. In this paper we present a tradeoff analysis model based on the principles of qualitative reasoning that provides visualization support for understanding interaction and tradeoff dependences among solutions evaluation criteria which …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Building data warehouses with incremental maintenance for decision support\n", "abstract": " Data warehousing is an emerging technology that facilitates gathering and integrating heterogeneous data from distributed sources and extracting information that can be utilized as a knowledge base for decision support. Once a data warehouse is built, we need to maintain it consistent with the underlying data sources, which always subject to dynamic updates. Much work has been done on manipulating and mining data warehouses. However, most of the published works pay no attention to the issue of building a complete data warehouse from scratch, and employing it as a crucial technique to support the decision making process. In this paper, we exhibit a comprehensive case study, based on utilizing a ready-made commercial database for designing and implementing a data warehouse (DW) with incremental maintenance capabilities. Furthermore, we demonstrate the process of employing the constructed …", "num_citations": "8\n", "authors": ["469"]}
{"title": "MALL: A multi-agent learning language for competitive and uncertain environments\n", "abstract": " A Multi-Agent Learning Language (MALL) is defined as being necessary for agents in environments where they encounter crucial situations in which they have to learn about the environment, other parties moves and strategies, and then construct an optimal plan. The language is based on two major factors, the level of certainty in fully monitoring (surveying) the agents and the environment, and optimal plan construction, in an autonomous way. Most of the work related to software agents is based on the assumption that other agents are trustworthy. In the growing Internet environment this may not be true. The proposed new learning language allows agents to learn about the environment and the strategies of their opponents while devising their own plans. The language is being tested in our project of software agents for Electronic Commerce that operates in various security zones. The language is flexible and …", "num_citations": "8\n", "authors": ["469"]}
{"title": "Traffic signal timing optimization by modelling the lost time effect in the shock wave delay model\n", "abstract": " Over the years, studies presented on shock wave model optimization have been limited to the proposal of optimization control policies using queue length constraints in oversaturated conditions, and also finding the optimum cycle time and green splits based on either a known cycle time from the field or an optimum cycle time obtained from other methods. To our best knowledge, we can say after reviewing the literature that no attempt has been made to use the shock wave model to find the optimum cycle time for a general isolated intersection, because minimizing this model generates very small values, close to zero for an optimum cycle time, which is unacceptable. In this paper, we propose an optimization model that provides the optimum cycle time and green splits when the total average delay at a general isolated signalized intersection is minimized for all vehicles present. To do so, we model the lost time effect …", "num_citations": "7\n", "authors": ["469"]}
{"title": "Managing performance interference in cloud-based web services\n", "abstract": " Web services have increasingly begun to rely on public cloud platforms. The virtualization technologies employed by public clouds can, however, trigger contention between virtual machines (VMs) for shared physical machine resources, thereby leading to performance problems for Web services. Past studies have exploited physical-machine-level performance metrics such as clock cycles per instruction to detect such platform-induced performance interference. Unfortunately, public cloud customers do not have access to such metrics. They can only typically access VM-level metrics and application-level metrics such as transaction response times, and such metrics alone are often not useful for detecting inter-VM contention. This poses a difficult challenge to Web service operators for detecting and mitigating platform-induced performance interference issues inside the cloud. We propose a machine-learning-based …", "num_citations": "7\n", "authors": ["469"]}
{"title": "From requirements to software design: An automated solution for packaging software classes\n", "abstract": " This paper presents a unique and practical study toward automating analysis and design of software. In this work, we have automated generation of package diagrams in software design process. We have employed a clustering algorithm, and have defined a similarity measure for packaging classes of the software. The similarity measure is defined in a way to increase the cohesion and decrease the coupling between the packages. The process of moving from requirement to design is traditionally done through an ad-hoc process. Although the criterion for a good design is well-defined in software engineering for different system architectures, the design of the system is only as good as the design choices of the engineers. Therefore having a systematic solution which recommends design choices based on system requirements is highly desirable and it leads to increasing the quality of software as well as saving in …", "num_citations": "7\n", "authors": ["469"]}
{"title": "Detection and verification of a new type of emergent behavior in multiagent systems\n", "abstract": " The verification of Distributed Software Systems (DSS) and Multi agent systems (MAS) has taken a special attention due to the growing demand of having DSS in this decade. MAS and DSS are a class of software in which functionality or control is distributed. This may cause components (agents) to emerge an unexpected behavior in their runtime, which was not seen in the requirement and design. This is known as emergent behavior of components. The cost of detecting and fixing of such problem is much more valuable compared to fix them after deployment. Therefore, in this paper a new type of emergent behavior that can happen in MAS is investigated. A method for verification of this type of emergent behavior is proposed followed by an algorithm. This type of emergent behavior can not be detected with the existing methods of emergent behavior detection. This type of emergent behavior focuses on one …", "num_citations": "7\n", "authors": ["469"]}
{"title": "A general purpose software evaluation system\n", "abstract": " In the present day market situation, there are several alternatives available when a customer wants to purchase a product or adopt a software system that meets the customer’s requirements. General Purpose Software Evaluation (GPSE) system adopts state of the art statistical methods based on Multidimensional Weighted Attribute Framework (MWAF) for the evaluation of the available alternatives. By using GPSE system, the user can follow the MWAF process and design the architecture which best describes the given evaluation problem. The architectural elements of MWAF essentially focus on survey questionnaire which involves gathering information from multiple domain experts. The GPSE system then applies principles of Analysis of Variance (ANOVA) and Tukey’s pairwise comparison tests on the data collected to arrive at selection of the best suited alternative for the given problem. The GPSE system has …", "num_citations": "7\n", "authors": ["469"]}
{"title": "A Statistical Approach for Evaluating and Assembling Agent-Oriented Software Engineering Methodologies\n", "abstract": " Agent-based computing is one of the fastest growing areas of research and development in information technology. In the past couple of decades, a large number of Agent-Oriented Software Engineering (AOSE) methodologies have been evolved in order to assist in developing intelligent software that is able to solve many challenging problems. Nevertheless, the immaturity of this emerging technology made developers run into extreme difficulties when deciding which methodology can best fit a prospective application. In the literature, a limited number of studies have been carried out to address the comparison and evaluation of agent-oriented development methodologies. However, such related studies lack the reliable framework that can be implemented and generalized effectively; most of the proposed approaches are not capable of providing sufficient knowledge to support accurate decisions. In this paper, we present a reliable framework based on adopting state-of-the-art statistical procedures to evaluate AOSE methodologies and come up with a set of metrics that can help in selecting the most appropriate methodology, or assembling more than one, to accommodate the anticipated characteristics of the desired application.", "num_citations": "7\n", "authors": ["469"]}
{"title": "Utilizing incomplete block designs in evaluating agent-oriented software engineering methodologies\n", "abstract": " In the past couple of decades, agent-oriented technology has been arisen in order to assist in developing intelligent software that is able to solve challenging problems. More than twenty agent-oriented software engineering methodologies (AOSE) are presented in literature. Nevertheless, the immaturity of this emerging technology made developers run into extreme difficulties when deciding which methodology can best fit a prospective application. A little work has been conferred to compare and evaluate small numbers of agent-oriented methodologies. However, such related work lacks the reliable framework that can be effectively implemented; most of the proposed approaches are not capable to provide sufficient knowledge to support the decision of selection. In this paper, we present a more reliable framework that adopts statistical techniques to evaluate AOSE methodologies and come up with a set of metrics …", "num_citations": "7\n", "authors": ["469"]}
{"title": "Cognitive-decision-making issues for software agents\n", "abstract": " Rational decision making depends on what one believes, what one desires, and what one knows. In conventional decision models, beliefs are represented by probabilities and desires are represented by utilities. Software agents are knowledgeable entities capable of managing their own set of beliefs and desires, and they can decide upon the next operation to execute autonomously. They are also interactive entities capable of filtering communications and managing dialogues. Knowledgeability includes representing knowledge about the external world, reasoning with it, and sharing it. Interactions include negotiations to perform tasks in cooperative, coordinative, and competitive ways. In this paper we focus on decision-making mechanisms for agent-based systems on the basis of agent interaction. We identify possible interaction scenarios and define mechanisms for decision making in uncertain …", "num_citations": "7\n", "authors": ["469"]}
{"title": "Agent-SE: A methodology for agent oriented software engineering\n", "abstract": " Agent-oriented approach to software engineering (Agent-SE) for multi-agent software design is presented. It includes methods to generate organizational information for cooperative and coordinative agents. Agent-SE can be used to design and implement complex, heterogeneous, distributed and networked software systems using dynamic agent coalition structure.", "num_citations": "7\n", "authors": ["469"]}
{"title": "Intelligent agents for electronic commerce\n", "abstract": " る. 本研究では, 電子商取引を専門に行うエキスパートエージェントを複数構築し, 具体的に, 顧客, サーチ, カタログ, 小売, ベンダー, 運搬エージェントなどを実現する. 各エージェントの基本構成を統一することにより, システムの構築が容易になる. 取り引き自体にユーザーが労力を使わずにすむようにするために, 電子商取引に必要となる作業を全てエキスパートエージェントに代行させる. これにより, ユーザーは電子商取引を行うための手順を知る必要がなくなり, ユーザー本来の目的である商品の売買や, 情報の収集といった作業に専念することができる.", "num_citations": "7\n", "authors": ["469"]}
{"title": "Software creation: An expert system for reproducing human cognitive processes in automatic software design\n", "abstract": " CiNii 論文 - Software Creation : An Expert System for Reproducing Human Cognitive Processes in Automatic Software Design CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文を さがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 Software Creation : An Expert System for Reproducing Human Cognitive Processes in Automatic Software Design FAR BH 被引用文献: 1件 著者 FAR BH 収録刊行物 Proc. World Congress on Expert Systems' 94, Estoril, Lisbon, Portugal, (Jan 1994) Proc. World Congress on Expert Systems' 94, Estoril, Lisbon, Portugal, (Jan 1994), 1994 被引用文献: 1件中 1-1件を 表示 1 ソフトウェア設計用分散型エキスパートシステム ファー ベルーズ H. , 河野 善彌 電子情報通信学会技術研究報告. KBSE, 知能ソフトウェア97(/…", "num_citations": "7\n", "authors": ["469"]}
{"title": "An ensemble learning approach to digital corona virus preliminary screening from cough sounds\n", "abstract": " This work develops a robust classifier for a COVID-19 pre-screening model from crowdsourced cough sound data. The crowdsourced cough recordings contain a variable number of coughs, with some input sound files more informative than the others. Accurate detection of COVID-19 from the sound datasets requires overcoming two main challenges (i) the variable number of coughs in each recording and (ii) the low number of COVID-positive cases compared to healthy coughs in the data. We use two open datasets of crowdsourced cough recordings and segment each cough recording into non-overlapping coughs. The segmentation enriches the original data without oversampling by splitting the original cough sound files into non-overlapping segments. Splitting the sound files enables us to increase the samples of the minority class (COVID-19) without changing the feature distribution of the COVID-19 samples …", "num_citations": "6\n", "authors": ["469"]}
{"title": "Highlighting the importance of big data management and analysis for various applications\n", "abstract": " The series “Studies in Big Data”(SBD) publishes new developments and advances in the various areas of Big Data-quickly and with a high quality. The intent is to cover the theory, research, development, and applications of Big Data, as embedded in the fields of engineering, computer science, physics, economics and life sciences. The books of the series refer to the analysis and understanding of large, complex, and/or distributed data sets generated from recent digital sources coming from sensors or other physical instruments as well as simulations, crowd sourcing, social networks or other internet transactions, such as emails or video click streams and other. The series contains monographs, lecture notes and edited volumes in Big Data spanning the areas of computational intelligence incl. neural networks, evolutionary computation, soft computing, fuzzy systems, as well as artificial intelligence, data mining …", "num_citations": "6\n", "authors": ["469"]}
{"title": "Measuring the effectiveness of zonal heating control for energy saving\n", "abstract": " This paper measures the heat energy consumption in a typical Canadian house taking into account a commonly used forced air gas furnace. The aim of this work is to measure and analyze the possible energy savings for homes if zonal heat control system is used. A control circuit is used to sense the indoor and outdoor temperature and turns the furnace ON or OFF according to the preferred temperature set by the householders. Zonal heat control is performed by closing the heating vents in the unoccupied areas of the house during the nighttime. Over one-month test period in winter, the measurement results proved that the zonal control system could save the heating energy up to 36% depending on the weather temperature. The study results support the assumption that, more saving in energy consumption can be reached by controlling the delivery of heat on a zone-by-zone basis.", "num_citations": "6\n", "authors": ["469"]}
{"title": "An accurate multi-sensor multi-target localization method for cooperating vehicles\n", "abstract": " Accurate and reliable vehicle localization is a key component of Intelligent Transportation System (ITS) applications. Personalized travel related services and recommendation systems like collision avoidance rely principally on the accurate and reliable knowledge of vehicles’ positioning. In this paper we propose a cooperative multi-sensor multi-vehicle localization method with high accuracy for terrestrial consumer vehicles. Two streams of real-time data are assumed available. One in the form of GPS coordinates of nearby vehicles received from a vehicle-to-vehicle (V2V) network and the other in the form of inter-vehicle distance measurements from a range sensor. In real-world situations, these heterogeneous sources of information are noisy and could be unavailable during short intervals. To overcome the effect of noise, measurements from two sources are fused together to estimate the number and …", "num_citations": "6\n", "authors": ["469"]}
{"title": "Emerging trends in computational biology, bioinformatics and system biology\n", "abstract": " Computational modeling of the immune system requires practical and efficient data analytical approaches. The immune system is composed of heterogeneous cell populations and hundreds of cell types. Each cell type is highly diverse and can be further differentiated into subsets with unique and overlapping functions. Computational systems biology approaches can be used to represent and study molecular mechanisms of cell differentiation. However, such systematic modeling efforts require the building of complex intracellular signaling models with a large number of equations to accurately represent intracellular pathways and biochemical reactions. It also requires the integration of complex processes that occur at different scales of spatiotemporal magnitude. Application of supervised learning methods, such as artificial neural network (ANN), can reduce the complexity of ordinary differential equation (ODE …", "num_citations": "6\n", "authors": ["469"]}
{"title": "Performance enhancement of Behavior-Based Safety of fleet management systems\n", "abstract": " Although management of Road Safety has been an area of concern over the past several decades the following behavior-based problem areas still exist: unsafe driving behaviors and high-risk drivers. A Behavior-Based Safety Management System (BBSMS) can help address these areas by introducing concepts of Activators, Behaviors and their Consequences. The focus of BBSMS is on improving and changing behavior rather than dealing with the consequences of bad behavior. This paper explores the application of Utilization Z-scores and Reliability Demonstration Chart, a reliability engineering technique, to help analyze driver behavior. The driver behavior is represented by In Vehicle Monitoring System (IVMS) data collected over several years. The events recorded and monitored by the IVMS include over speeding, over revving, harsh acceleration, harsh braking and seat belt disconnects while driving. The …", "num_citations": "6\n", "authors": ["469"]}
{"title": "Detecting emergent behavior in a social network of agents\n", "abstract": " An effective and efficient approach in designing software systems to describe system requirements is using scenarios. A scenario, commonly shown as a message sequence chart or a sequence diagram, is a temporal sequence of messages sent between system components. Scenarios are appealing because of their expressive power and simplicity. Moreover due to the clear and concise syntactic of scenarios, they can be used to analyze the system requirements for general validity, lack of deadlock, and existence of emergent behavior. Emergent behavior or implied scenarios are specifications of behavior that are derived from compiling of all requirements together but are not explicitly specified in the set of scenarios. Although emergent behavior is not necessarily unwanted, nevertheless it is useful for system designers and engineers to be aware of its existence. Defining requirements using scenarios and …", "num_citations": "6\n", "authors": ["469"]}
{"title": "Learning non-unanimous ontology concepts to communicate with groups of agents\n", "abstract": " We present an extension to the definition of a concept in an ontology that allows an agent to simultaneously communicate with a group of agents that might have different understandings of some concepts. We also provide a way to learn such non-unanimous concepts by using a method for learning concepts from a group of teachers. The general idea of non-unanimous concepts is to use the teachers to identify the core of a concept everyone agrees on and what else at least some of the teachers think belongs into the concept. The learning agent also decides what belongs to the concept for itself and whenever it needs to communicate with a group of other agents and needs to be precise it makes use of these three concept aspects by providing additional example objects for what might be misunderstood.", "num_citations": "6\n", "authors": ["469"]}
{"title": "Modeling and implementation of software agents decision making\n", "abstract": " Software agents are knowledgeable, autonomous, situated and interactive software entities. Agents' interactions are of special importance when a group of agents interact with each other to solve a problem that is beyond the capability and knowledge of each individual. Efficiency, performance and overall quality of the multiagent applications depend mainly on how the agents interact with each other effectively. We suggest an agent model by which we can clearly distinguish different agent's interaction scenarios. The model has five attributes: goal, control, interface, identity and knowledge base. Using the model, we analyze and describe possible scenarios; devise the appropriate reasoning and decision making techniques for each scenario; and build a library of reasoning and decision making modules that can be used readily in the design and implementation of multiagent systems.", "num_citations": "6\n", "authors": ["469"]}
{"title": "Software creation: A study on the inside of human design knowledge\n", "abstract": " This paper discusses the characteristics of human design knowledge. By studying a number of actual human made designs of excellent designers, the most frequent basic mental operations of a typical human designer have been found. They are: a design rule for hierarchical detailing reported previously, a micro design rule for generating a hierarchical expansion, dictionary operations to build a micro design rule and dictionaries. This study assumes a multiplicity of knowledge based on Zipf's theory,", "num_citations": "6\n", "authors": ["469"]}
{"title": "A Multi-Agent Internet Based Tutoring System (I-ATCL) for Teaching Computer Programming Languages\n", "abstract": " This paper presents an agent-based tutoring system (I-ATCL) in presence of agent and internet technology. The I-ATCL system consists of two agents; a personal assistant agent for teachers (PAA-T) and a personal assistant agent for students (PAA-S). The PAA-S resides on the client side and communicates via IIOP with the PAA-T on the server side. This structure allows customization of the PAA-S to the needs of the student without putting extra burden on the server. Also this allows having many teacher agents attending to the needs of a single or multiple student agents. The PAA-T allows the teachers to cope with the knowledge base of a computer language under investigation, add or modify the commands' structure that will be taught. Also, this agent can generate a new tutoring dialog for a new computer programming language by consulting previous tutoring dialogs for another computer programming …", "num_citations": "6\n", "authors": ["469"]}
{"title": "A systematic approach for design knowledge acquisition from documents\n", "abstract": " This paper reports on a design knowledge acquisition method by design documents, together with an automatic software design. This automatic software design has been studied to respond to industrial needs. It takes several industrial experiences into account where some might be unfamiliar. Section I describes several of such prerequisites, such as extensive use of design documents. In Section 2, the automatic software design system is overviewed. and techniques and results are explained. The principle of extracting design knowledge is explained, and lowest level flow chart design and higher level data flow design is reported. Other examples of high level design rules are explained, and the structure of design knowledge is discussed. As a result of systematic extraction from a systematic design work process, the acquired design knowledge takes hierarchical structure, and each layer of which consists of both data flow type and control type knowledge. Reproduction of design by experts systems are described. Due to the systematic structure of design knowledge, expert systems have been systematically developed with ease. Besides these working design knowledge for detailing, there is another type of design knowledge for recognizing, deciding and directing design. As a result of these studies, it is pointed out that commonality exists in software design, hardware design, direct works, and also human business process in general.", "num_citations": "6\n", "authors": ["469"]}
{"title": "Qualitative control: qualitative design and verification of industrial controllers\n", "abstract": " Smart robots working as controllers (supervisors or operators) of industrial plants and processes are discussed. The preliminaries are introduced of a formalism called qualitative control, which can be used to reason about the behavior and synthesize the desired behavior of the system in a manner resembling the problem-solving behavior of human operators/supervisors. The qualitative flow graph is used to represent the structural description and qualitative reasoning method for deriving the potential behavior. Qualitative control begins with a desired behavior and is based on knowledge of the potential behaviors. Relativity analysis and its modified version introduced here allow inference of the direct input-output forms and qualitative speed comparison of the processes.< >", "num_citations": "6\n", "authors": ["469"]}
{"title": "A tutorial on agent communication and knowledge sharing\n", "abstract": " With the rapid technological development particularly in the computer industry, many computer programming languages are being developed with many computer programs written in these languages. Writing good programs takes time and effort. It is therefore necessary that programs once written should be able to work together (interoperate) with each other so that a program written in one language can benefit from the advantages that may be associated with another program written in another language. One of the problems with interoperation of programs is the heterogeneity of the programs. This is because programs are written by different people, at different times, in different languages and with different interfaces. Agent-base Software Engineering is an attempt to facilitate the creation of software products that can easily interoperate in such settings.", "num_citations": "6\n", "authors": ["469"]}
{"title": "Detecting emergent behaviors and implied scenarios in scenario-based specifications: A machine learning approach\n", "abstract": " Scenarios are commonly used for software requirements modeling. Scenarios describe how system components, users and the environment interact to complete the system functionality. However, several scenarios are needed to represent a complete system behavior and combining the scenarios may generate implied scenarios (IS) that are associated with some unexpected behavior. The unexpected behavior is commonly known as Emergent Behavior (EB), which is not evident in the requirements and design phase but may degrade the quality of service and/or cause irreparable damage during execution. Detecting and fixing EB/IS in the early phases can save on deployment cost while minimizing the run-time hazards. In this paper, we present a machine learning approach to model and identify the interactions between system components and verify which interactions are safe and which may lead to EB/IS. The …", "num_citations": "5\n", "authors": ["469"]}
{"title": "Social media analysis for traffic management\n", "abstract": " Given the data-and communication-intensive nature of developing transportation management systems, utilizing social media data provides a new route for dynamic collection of needs and experiences in a timely and direct fashion. In this research, we report the overall results of our retrospective analysis to explore how and to what extent social media data can support urban traffic management systems. We have conducted a mixed-method study, including both manual qualitative analysis, and automatic information extraction and natural language processing, on Twitter data. The results of our study show that although theoretical publications and books, in the context of traffic management systems, can help with the real-time traffic measurements, such as traffic flow and queue length, this is not sufficient to characterize context-sensitive aspects of these systems, which are crucial inputs in most of the real-time …", "num_citations": "5\n", "authors": ["469"]}
{"title": "Handbook of research on data science for effective healthcare practice and administration\n", "abstract": " Data science has always been an effective way of extracting knowledge and insights from information in various forms. One industry that can utilize the benefits from the advances in data science is the healthcare field. The Handbook of Research on Data Science for Effective Healthcare Practice and Administration is a critical reference source that overviews the state of data analysis as it relates to current practices in the health sciences field. Covering innovative topics such as linear programming, simulation modeling, network theory, and predictive analytics, this publication is recommended for all healthcare professionals, graduate students, engineers, and researchers that are seeking to expand their knowledge of efficient techniques for information analysis in the healthcare professions.", "num_citations": "5\n", "authors": ["469"]}
{"title": "Multi-Agent System for Irrigation Using Fuzzy Logic Algorithm and Open Platform Communication Data Access\n", "abstract": " Automatic irrigation systems usually conveniently protect landscape investment. While conventional irrigation systems are known to be inefficient, automated ones have the potential to optimize water usage. In fact, there is a new generation of irrigation systems that are smart in the sense that they monitor the weather, soil conditions, evaporation and plant water use, and automatically adjust the irrigation schedule. In this paper, we present an agent based smart irrigation system. The agents are built using a mix of commercial off the shelf software, including MATLAB, Microsoft Excel and KEPServer Ex5 OPC server, and custom written code. The Irrigation Scheduler Agent uses fuzzy logic to integrate the information that affect the irrigation schedule. In addition, the Multi-Agent system uses Open Platform Connectivity (OPC) technology to share data. OPC technology enables the Irrigation Scheduler Agent to …", "num_citations": "5\n", "authors": ["469"]}
{"title": "Detecting emergent behavior in autonomous distributed systems with many components of the same type\n", "abstract": " In design of distributed systems with specification languages such as message sequence charts (MSC), communication between different component (agent) types or instances of them are defined. There are a number of methods to verify the design using scenarios of inter-component communication. Those methods usually ignore the intra-component communication, i.e. communication between components of the same type. However in large scale systems, such as e-commerce systems, there are several components of one type that may communicate with each other and this may violate some regulatory policies defined in the design. On the other hand, there are declarative policies in system design that need to be integrated in the implemented system. In this paper a method that takes a topology of the system and regulatory policies as its inputs and detects the components having emergent behavior at its output …", "num_citations": "5\n", "authors": ["469"]}
{"title": "Intelligent Software Measurement System for Automating the Goal-Question-Metrics Process\n", "abstract": " Intelligent software measurement system (ISMS) has been developed to generate a software measurement plan towards a user's initial business goal. The ISMS is based on adapting two methodologies: (1) the normalized 10-step goal-driven software measurement process within the goal/question/metrics (GQM) paradigm; and (2) the software measurement knowledge base building based on the ISMS ontology. In order to take full advantages of these two methodologies, ISMS is designed to be a multiagent system (MAS). In this paper, the goal-driven software measurement process, the design and implementation of the ISMS knowledge base and the design and implementation of the MAS for ISMS are discussed", "num_citations": "5\n", "authors": ["469"]}
{"title": "Improving example selection for agents teaching ontology concepts\n", "abstract": " We present a method to improve the positive examples selection by teaching agents in a multi-agent system in which a team of agent peers teach concepts to a learning agent. The basic idea in this method is to let a teacher agent expand the features it uses to describe a concept in its ontology by additional features. This resembles the typical behavior of human teachers who describe concepts from different viewpoints in the hope that one of these viewpoints comes close to the viewpoint of a learner. The extended feature set is then used to select positive examples that together with negative examples are communicated to the learner agent. The learner uses concept learning techniques to integrate the new concept into its own ontology. An experimental evaluation shows a significant learning improvement compared to the previous approach.", "num_citations": "5\n", "authors": ["469"]}
{"title": "A multidimensional weighted-attributes framework (mwaf) for evaluating agent-oriented software engineering methodologies\n", "abstract": " Agent-oriented software engineering (AOSE) is concerned with the use of agents in the development of distributed systems, especially in open and dynamic environments that require autonomous processes with communicative and cooperative features. In this context, AOSE came to the forefront as a new discipline to assist the engineering of complex software systems based on the multi-agent systems paradigm. As a result, a large number of AOSE methodologies and modeling techniques evolved to support the development of agent-based applications in all of their life cycle phases. Deciding what agent-oriented software engineering (AOSE) methodology is the best to adopt for developing a potential multi-agent system depends on which aspects are considered more important for the prospective application. However, up till now, there is no industry-wide agreement on the kinds of concepts a methodology …", "num_citations": "5\n", "authors": ["469"]}
{"title": "Intelligent software measurement system (ISMS)\n", "abstract": " Intelligent software measurement system (ISMS) is a multi-agent knowledge-based system that automates the ten-step goal-driven process to produce a software measurement plan based on user's particular business goal(s). The initial task of converting a high-level business goal to several low-level measurement goals has already been accomplished. In the second phase of the ISMS project we concentrate on the core task of automating the conversion of a set of measurement goals to a software measurement plan which involves measures and corresponding actions. The ISMS architecture and software agents (PAs and EAs) are further designed to facilitate the process of the second phase of ISMS with respect to system learning and knowledge updating. Considering the variety and complexity of software measures and actions, an ontology for software measurement is defined and used to build the ISMS …", "num_citations": "5\n", "authors": ["469"]}
{"title": "A collective view and methodologies for software agents' interaction\n", "abstract": " Software agents' interactions are of special importance when a group of agents interact with each other to solve a problem that is beyond the capability and knowledge of each individual. Efficiency, performance and the overall quality of multi-agent applications depend mainly on how the agents interact with each other. We present an agent model by which we can distinguish different agent's interaction scenarios. The model has five attributes: goal; control; interface; identity; knowledge base. Using the model, we analyze and describe possible scenarios. Then, for each scenario, appropriate reasoning and decision-making techniques are devised. The model can readily be used in the design and implementation of multi-agent systems.", "num_citations": "5\n", "authors": ["469"]}
{"title": "Agent-based commercial off-the-shelf software components evaluation method\n", "abstract": " In the last decade, the world of software development has evolved rapidly. This evolution has led to Component-Based Software Development (CBSD), which in turn has generated tremendous interest in the development of plug-and-play reusable software, leading to the concept of Commercial Off The Shelf (COTS) software components. The use of COTS is increasingly becoming commonplace. This is mainly due to shrinking budgets, accelerating rates of COTS enhancement, reducing development time and effort constraints, and expanding system requirements. However, the COTS marketplace is characterized by a vast array of products and product claims, extreme quality and capability differences between products, and many products incompatibilities, even when they purport to adhere to the same standards. Therefore, there is need for a robust COTS evaluation methodology to help software developers select appropriate components for projects. A variety of COTS evaluation methods have already been proposed. These methods are based on either consensual opinion aggregation approach or regression models. However, both approaches are inadequate for the COTS Evaluation process. In this paper, we propose an agent-based COTS evaluation method, which models each of the players as either a cooperative or a competing agent that is capable of making its own decisions to meets its goals. In this model, there is an administrator agent that collects, evaluates, and combines knowledge from different areas of expertise (Roles) to offer support in the COTS selection process. This way, we circumvent COTS evaluation problems …", "num_citations": "5\n", "authors": ["469"]}
{"title": "A Web-based software engineering measurement expert system\n", "abstract": " The software measurement expert system tool (SEMEST) is a rule-based and Web-enabled application for multiple software engineering measurement and analysis. SEMEST is designed on the basis of the software engineering measurement system (SEMS) that provides a comprehensive set of software measures and metrics in a formal and consistent framework. The module view controller (MVC) design model is adopted for implementing SEMEST. As a multiple-layer Web-based system with an expert inference engine and a knowledge base, SEMEST supports goal-, process- and category-oriented measurement and analysis in software engineering.", "num_citations": "5\n", "authors": ["469"]}
{"title": "A framework for agent-based software development\n", "abstract": " In software engineering community there is an increasing effort of design and development of multi-agent systems (MAS). However, agent system development is currently dominated by informal guidelines, heuristics and inspirations rather than formal principles and well-defined engineering techniques. In this paper we present a framework for agent-based software development called Agent-SE. We present methods to generate organizational information for cooperative and coordinative agents.", "num_citations": "5\n", "authors": ["469"]}
{"title": "A new multi-level information retrieval technique for reuse software components\n", "abstract": " In the automatic programming area, users still fail to find available software components that match their needs faster than developing them again. In this paper, a new information retrieval technique to help in retrieving the software components from repositories based on different levels of accuracy (i.e., exact match, match, and similar) is presented. The software components had been classified into classes according to their functionality, and then they had been stored with what we call a 'data dictionary' in a repository. The exact match is not required to retrieve a required software component from this repository using our retrieving technique. An example of how to apply this technique in the automatic programming area to produce a program code list automatically is given. The feature of learning the structure of the new software component exists.", "num_citations": "5\n", "authors": ["469"]}
{"title": "Distributed Expert System Architecture for Automatic Object-Oriented Software Design\n", "abstract": " The goal of this project is developing an expert system that aims to help software designers while designing object-oriented software by automating object-oriented design process. Some novel points are: using an interactive user interface, to enable software designer and expert system can communicate with each other in order to determine the best design, without disturbing the creativity of the software designer; making it possible for distributed expert system, to overcome the data sharing and the interoperability problems in groupware. In this paper we present the research project outline and the research approaches.", "num_citations": "5\n", "authors": ["469"]}
{"title": "Merging CASE tools with knowledge-based technology for automatic software design\n", "abstract": " An approach towards developing a Knowledge Based Software Engineering (KBSE) tool by merging a conventional CASE tool with the expert system technology is introduced. This is found useful in assisting human designers. Experimental expert systems CREATOR2 and CREATOR3 are introduced and applied to the design of switching software. The CREATOR2 has the following features: representing software design knowledge, composed of design product knowledge and design process knowledge, using frame technology; and integrating knowledge based reasoning techniques with a SDL CASE tool. CREATOR3 is an extension of the CREATOR2 system. It enables one with additional design schemas for splitting a process, adding events, etc., and additional representation power, such as using pictorial elements and designers' comments in the frame representation. This leads to a uniform modeling and …", "num_citations": "5\n", "authors": ["469"]}
{"title": "Qualitative supervisory control featuring cognitive capabilities of the domain practitioners\n", "abstract": " Qualitative Supervisory Control (QSC), a framework for knowledge-based aiding of a domain practitioner assigned to supervise a dynamic physical system, is presented. QSC meets the main function of a knowledgebased aiding supervisory control system by developing strategies to achieve control in the face of altered configuration, along with minimizing the cognitive overload. Three problems manifesting the cognitive overload, control directness, process information accessibility and counterintuition, are identified. QSC provides solution to them through a number of qualitative techniques. Typical applications of the QSC in an intelligent user interface, verification of the knowledge base and system diagnosis are demonstrated.", "num_citations": "5\n", "authors": ["469"]}
{"title": "A cluster-based machine learning model for large healthcare data analysis\n", "abstract": " There is huge growth in the amount of patient survey data being generated in healthcare industries and hospitals. Curse of dimensionality is a barrier to extracting useful information from patient survey data which can help in the treatment and care of patients. It is paramount to have methods to find importance of features based on such huge volumes of stored information for the desired outputs. The health-related quality of life (HRQOL) is a powerful paradigm to help reaching such a desired output, measuring as patient satisfaction. In such scenarios, it is difficult to investigate the features, out of such high-dimensional data, that could best represent desired output and explain them so that such features can be used in the future at the point f care. In this paper we propose a Cluster-based Random Forest (CB-RF) method to particularly exploit the most important features for the desired output, which is …", "num_citations": "4\n", "authors": ["469"]}
{"title": "Real-time opponent learning in automated negotiation using recursive Bayesian filtering\n", "abstract": " Automated negotiation is a toolset to model human interactions during a negotiation process with the aim of improving the efficiency and quality of decision-making using advanced information analytics. During the negotiation, the participants share their viewpoints and concerns about the negotiation issues. However, in reality, they usually do not reveal the details of their preferences to one another. Therefore, modeling and learning opponents’ behavior is a crucial component of automated negotiation. In this paper, we propose an estimation technique based on recursive Bayesian filtering to facilitate opponent-modeling and -learning in the context of multi-participant, multi-issue negotiations. In the proposed technique, opponents’ preference profiles are modeled using fuzzy functions, which are very close to the way humans evaluate alternatives. As the negotiation progresses, the agents can recursively learn the …", "num_citations": "4\n", "authors": ["469"]}
{"title": "Exploring the residual queue length equation in the shock wave model\n", "abstract": " The shock wave theory was proposed by Lighthill and Whitham (1955) and Richards (1956). For a signalized intersection, this theory was developed to analyze the dynamics of queue formation along the cycles. In an oversaturated condition, part of the queue cannot be discharged at the end of a cycle. This generates residual queue for other cycles, causing delays or even blocking upstream ramps and intersections. Given this, finding the residual queue length is significant to the calculation of travel times and delays. Reviewing the literature, we found nine papers that have used the residual queue length equation. However, the equation has been presented in six different forms, and some of them are completely different from the others. Since the equation is based on a given geometrical proof, it should be identical throughout the literature, but this is not the case. Hence, in this paper we aim to investigate if the existing variations of the residualqueue equation generate thesame andcorrect values.", "num_citations": "4\n", "authors": ["469"]}
{"title": "Verification of lack of emergent behavior in extending a social network of agents\n", "abstract": " The scalability of the system is of vital importance in the design of social networks. This research attempts to establish a comprehensive framework for analysis and validation of requirements and design documents for software systems. In previous work, we applied this framework to analyze the requirements of a social network of agents with respect to scalability of the system. In our approach, system requirements were expressed using scenario-based specifications. Scenarios are appealing because of their expressive power and simplicity. Moreover, due to the clear and concise notation of scenarios, they can be used to analyze the system requirements for general validity, lack of deadlock, and existence of emergent behavior. In this paper a methodology is presented to formally verify that certain scenarios do not emerge in the system’s behavior. This methodology is devised to indicate whether or not the …", "num_citations": "4\n", "authors": ["469"]}
{"title": "How Can We Explore Patterns of Customer Segments' Structural Changes? A Sequential Rule Mining Approach\n", "abstract": " In real world situations, customer behavior is changing and evolving over time. It is necessary to consider this dynamism in customer segmentation analysis and other business-related activities to develop effective marketing strategies. The main aim of this study is to explore the patterns of customer segments' structural changes. Up to now, there has been no research on this particular topic. This is the first study that investigates the impact of customer dynamics on segments' structural changes. This paper tries to develop a method to describe and explain this issue. A new method is proposed based on the clustering and sequential rule mining techniques. Furthermore, a new definition and framework for finding distinguishing sequential rules is developed. The proposed method is implemented on the customer data of a telecommunication service provider. The results show that the method is capable in this domain …", "num_citations": "4\n", "authors": ["469"]}
{"title": "Embedded Real Time Blink Detection System for Driver Fatigue Monitoring.\n", "abstract": " Fatigue induced vehicle accidents have seen an increase in the last few decades. Fatigue monitoring using noninvasive and real time image processing and computer vision techniques have shown great promise and are an active research area. To that extent, in the proposed work a blink detection algorithm is proposed that serves as a visual cue that may be correlated to the state of fatigue of the driver. Using a complimentary but independent approach, shape analysis and histogram analysis are carried out in parallel to perform the blink detection task. Close to real time performance and a high level of accuracy in controlled settings show great promise of such approach in enhancing the monitoring of the driver’s blinking patterns. One of the main constraints of using such algorithm in a real world setting is the minimized processing time required to allow for sufficient driver response time. In this work implementation of the algorithm is described using optimization techniques to meet such latency requirements. The validation of the algorithm was carried out by visual inspection of the video sequences in terms of precision and accuracy. The presented blink detection algorithm has a precision rate of 84% and an accuracy rate of 69% obtained through using 12 sequences of different duration videos in varying lighting conditions using a small sample of participants.", "num_citations": "4\n", "authors": ["469"]}
{"title": "Automatic working area localization in blood smear microscopic images using machine learning algorithms\n", "abstract": " Microscopic examination of a properly prepared blood smear is valuable in complete blood count (CBC) and differential blood count (DBC). A hematopathologist may spend enormous time manually inspecting the good working area (GWA) of the blood smear under a light microscope system to perform CBC or DBC. In this paper we focus on automatic localization of the GWA by classifying microscopic images of blood smears using different machine learning algorithms into three areas: Clumped, Good, and Sparse. The features used are the statistical and texture features. This approach yields a good localization of GWA in images acquired by a low cost light microscope system, scanned under magnifying power of x100 oil-immersed objective. Our experiment using images with resolution (3488×2616 pixels) of Giemsa-stained blood smears shows that the proposed method has an accuracy of 82% for the localizing …", "num_citations": "4\n", "authors": ["469"]}
{"title": "Detecting distributed software components that will not cause emergent behavior in asynchronous communication style\n", "abstract": " In distributed software systems (DSS) the functionality and/or control are distributed. This may cause the DSS components to show an unexpected behavior known as emergent behavior in the run time, which was not seen in their requirements and design. Emergent behaviors can have irreparable damages for companies. The savings in cost of detecting and fixing emergent behaviors in early phases is more than 20 times compared to fixing them after the deployment. The detecting methodologies usually utilize behavioral modeling which can face to state space explosion problem for large scale systems. Therefore, we approach this problem by detecting components that will not show emergent behavior and remove them from further analysis to help the scalability of these approaches. Previously, we have devised and implemented the algorithm for synchronous communications. In this paper, the extension of our …", "num_citations": "4\n", "authors": ["469"]}
{"title": "Extending the strategy pattern for parameterized algorithms\n", "abstract": " The strategy pattern decouples algorithms from the class that uses them allowing the algorithms to vary independently. It does not, however, allow algorithms to have different parameters. The solution presented in this paper addresses the case when the algorithms have different sets of parameters, and when the user is allowed to see and modify these parameters for each concrete algorithm before its execution. This is accomplished by introducing special parameter classes which encapsulate algorithm parameters and have certain responsibilities (eg boundary values checking). The abstract algorithm class is completely decoupled from parameters letting each concrete algorithm class create its own list of parameter instances which mirrors its parameters.", "num_citations": "4\n", "authors": ["469"]}
{"title": "A practical ontology-based concept learning in mas\n", "abstract": " Agent-mediated knowledge management is believed to be an efficient solution for knowledge sharing among different software systems. In this paradigm, diverse systems can exchange information while keeping their own individual ontology to represent their domain knowledge. However, overcoming semantic heterogeneity among diverse ontologies becomes a key issue. We propose a new concept learning method to solve this problem and also implement it using multiagent technology together with the IBMpsilas UIMA (Unstructured Information Management Architecture) into a semantic search application. In this method an agent in one system can learn a concept which it does not know by getting advices from agents in other systems and integrate the learnt concept into its local ontology.", "num_citations": "4\n", "authors": ["469"]}
{"title": "Building collaborative intelligent agents: revealing main pillars\n", "abstract": " Software agents are persistent, knowledgeable, autonomous, collaborative, and learnable entities. One important feature of software agents is the ability to interact and communicate as a team to achieve more than they could individually. Although the belief-desire-intention (BDI) agent model is possibly the best known and used model of practical reasoning agent; nevertheless, this model does not address the key concept of how individual agent learn from the environment and manipulate itself to collaborate with others. In this paper we present a novel approach that customize the BDI model to define a so-called \"RBDIA: Rapport-belief-desire-intention-adaptation\" as a generic method to support progress from individual autonomous agent concept towards a collaborative multiple agents. Rapport here refers to the component that connects an agent to its environment, whereas adaptation module incorporates …", "num_citations": "4\n", "authors": ["469"]}
{"title": "Ex-W-Pert system: A WWW based intelligent search engine for electronic commerce\n", "abstract": " CiNii 論文 - Ex-W-Pert System : A WWW Based Intelligent Search Engine for Electronic Commerce CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学 図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 Ex-W-Pert System : A WWW Based Intelligent Search Engine for Electronic Commerce FAR BH 被引用文献: 1件 著者 FAR BH 収録刊行物 Joint Conference on Knowledge-Based Software Engineering JCKBSE'96 Joint Conference on Knowledge-Based Software Engineering JCKBSE'96, 1996 被引用文献: 1件中 1-1件を 表示 1 電子商取引 エージェント用推論と学習環境 ファー ベルーズ H. 電子情報通信学会技術研究報告. AI, 人工知能と知識 処理 98(436), 85-92, 1998-11-30 参考文献29件 Tweet 各種コード NII論文ID(NAID) 資料種別 に/(…", "num_citations": "4\n", "authors": ["469"]}
{"title": "Qualitative sensitivity analysis\n", "abstract": " Abstract We introduce the Qualitative Sensitivity Analysis (QSA) technique and its applications for systems modeled in rule based causal format. The rule set is composed of interacting atomic propositions. First, we introduce the Modified Causal Ordering (MCO) technique to derive ordering among the propositions. The result of MCO are complete subsets of propositions and an Ordinal Reachability Graph (ORG). Each complete subset is identified by its ranking code. In QSA, propositions stand for the landmarks of the qualitative variables. QSA begins with the ORG and replaces the propositions with their equivalent landmarks. Sensitivity is defined qualitatively in terms of possible shift to the neighboring landmarks. QSA can derive the sensitivity of the higher rank landmarks due to perturbation affecting the lower rank ones. Here we introduce the application of QSA for performance evaluation of discrete event …", "num_citations": "4\n", "authors": ["469"]}
{"title": "Automatic diagnostic rule generation for rule-based controllers by qualitative sensitivity analysis\n", "abstract": " We introduce the Qualitative Sensitivity Analysis (QSA) technique and its application to gener ate automatically diagnostic rules for systems modeled in rule based causal format. The rule set is composed of atomic propositions. First, we introduce the Modified Causal Ordering (MCO) tech nique to derive ordering among the propositions. The result of MCO are complete subsets of propositions and Ordinal Reachability Graph (ORG). Each complete subset is identified by its ranking code. In QSA, propositions stand for the landmarks of the qualitative variables. QSA begins with the ORG and replaces the propositions with their equivalent landmarks. Perturbation is modeled by forcing a landmark to shift to its neighboring landmark. Sensitivity is identified as a consequence of perturbation, forcing two or more of the landmarks of a variable having the same rank. QSA can derive the sensitivity of the higher rank landmark due to perturbation affecting the lower rank ones. Applicability of the method is demonstrated through an example.", "num_citations": "4\n", "authors": ["469"]}
{"title": "Distributed gaussian mixture model summarization using the mapreduce framework\n", "abstract": " With an accelerating rate of data generation, sophisticated techniques are essential to meet scalability requirements. One of the promising avenues for handling large datasets is distributed storage and processing. Further, data summarization is a useful concept for managing large datasets, wherein a subset of the data can be used to provide an approximate yet useful representation. Consolidation of these tools can allow a distributed implementation of data summarization. In this paper, we achieve this by proposing and implementing a distributed Gaussian Mixture Model Summarization using the MapReduce framework (MR-SGMM). In MR-SGMM, we partition input data, cluster the data within each partition with a density-based clustering algorithm called DBSCAN, and for all clusters we discover SGMM core points and their features. We test the implementation with synthetic and real datasets to …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Simulation-based benefit analysis of pattern recognition application in intelligent transportation systems\n", "abstract": " Modeling and simulation of transportation systems are extensively used because of high costs and potential safety and security issues associated with its prototyping in a real traffic. Modeling and simulation play a key role in understanding real systems through abstraction and evaluating new technologies. In this paper, we conducted a simulation-based analysis to assess potential benefits of applying pattern recognition in Intelligent Transportation Systems (ITS). We used integrated transport modeling and simulation software called AIMSUN to develop a model for a real highway road. We also developed a number of plug-in software modules which implement pattern recognition, route guidance, and message communication features. We used the developed model in two congestion-oriented scenarios, called reactive and proactive. The simulation results were promising and showed that integrating pattern …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Detection of implied scenarios in multiagent systems with clustering agents' communications\n", "abstract": " Software agents in Multiagent Systems (MAS) have several interactions that are designed and represented in the scenarios of the system. These communications should be verified to detect whether the agents will show a new behavior in their execution, which is known as emergent behavior or implied scenario. Most research use different versions of state machines modeling for the detection of implied scenarios, which consider the states of one/all agents. The existing detection processes ignore the interactions among agents. In this paper, besides modeling the states and agents' behaviors, we model the agents' interactions derived from their designs, to detect implied scenarios. A new type of implied scenario that occurs when a process misses the information about its common communications in multiple scenarios is studied in this paper. This type of implied scenario cannot be detected with other approaches …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Data integration and clustering for real time crash prediction\n", "abstract": " Cities are facing increasingly challenges with the projected population growth and the resulting increased urban travel demand. Road safety is a major issue in urban planning. Much of the empirical research on road safety and determining the probability of accidents has focused on the accident events. While human error and mechanical failure are common causes of road traffic accidents, the importance of spatial factors has been underestimated. Classifications of road accident are generally based on the available data associated with the accident itself such as time of day, type of injury, type of vehicle, etc. This can often limit the understanding of the complexities of road accidents which can be the outcome of a number of environmental, social and economic factors neglected by the standard accident data collection. This study is based on the assumption that road accidents occurring in similar areas are spatially …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Analysis, Design and Implementation of an Agent Based System for Simulating Connected Vehicles.\n", "abstract": " PARAMICS traffic microsimulator is a popular simulator among universities and government agencies since it is capable of representing many parts of the world's street maps and designed to handle scenarios ranging from a single intersection to a congested freeway, or the modeling of a complete traffic system. However, it lacks the ability of simulating Connected Vehicle (CV) system and its applications of the Intelligent Transportation System (ITS) through designated traffic simulation network. In this study, we utilized the Multi Agent System Engineering (MaSE) methodology, step by step, to model CV as a Multiagent System (MAS). We implemented the MaSE artifacts as extensions for the PARAMICS using two APIs (Application Programming Interface) to add the ability to simulate CV systems. In this paper we provide detailed explanation of the MAS design and at the end introduce two experiments, made based on this research, as the case studies to evaluate the proposed CV system for estimating and improving traffic safety and mobility parameters in the network.", "num_citations": "3\n", "authors": ["469"]}
{"title": "A system-level approach for model-based verification of distributed software systems\n", "abstract": " A major challenge in design of distributed software systems is predicting and avoiding unexpected behaviors at the run time. Detecting those behaviors after the system is implemented can be very costly and detecting them during design and implementation stages is a cost effective alternative. Therefore, model-based verification at early design stages is an important step in designing distributed systems. Most of the existing verification techniques analyze system behaviors by going from specifications to state machines that model individual components' behaviors. Although those methods are shown to be effective in detecting unexpected behaviors for each component, they fail to detect the unexpected behaviors that occur at the system level. There exist a few ad-hoc methods to combine components' behavior into system level behavior. In this paper, we devise a method that considers interactions among …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Using Neuro-fuzzy Models to Benchmark Road Safety Management Systems\n", "abstract": " Road related deaths and injuries continue to be one of the highest incidents recorded in organizations. Road Safety has become a major concern worldwide. Therefore the United Nations has introduced a new movement: UN Decade of Action for Road Safety 2011-2020, which aims to reduce road deaths and injuries worldwide. An effective Safety Management System (SMS) can help in reducing risk of incidents, injuries and fatalities. The National Safety Council defines the three performance areas to benchmark SMS to be Leadership - Management, Technical - Operational and Cultural - Behavioral. This paper proposes a systematic way of finding relationships between Technical - Operational factors, Cultural - Behavioral and Safety Management Systems through the use of Neural networks-fuzzy. A sample SMS is simulated using critical factors (environmental and road conditions). Moreover, neural networks …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Visualizing the network of software agents for verification of multiagent systems\n", "abstract": " The verification of Multiagent Systems (MAS) and Distributed Software Systems (DSS) has taken a special attention due to the growing demand of having DSS in recent years. The distributed functionality and lack of having a central control in MAS and DSS may cause to emerge new behaviors in the execution time. This unexpected behavior which was not seen in the requirements is known as emergent behavior and may cause irreparable damages. Detection of these emergent behaviors is more valuable and cost effective in the early phases compared to detecting them after the deployment. In this paper we propose a new technique for the detection of a specific type of emergent behavior in the design phase. We take the advantage of social network visualization in this method. The novelty and direct advantage of this technique is presenting the exact point and cause of emergent behavior.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Detecting a certain kind of emergent behavior in multi agent systems applied on MaSE methodology\n", "abstract": " Multi agent systems (MAS) play an important role in many of industrial software systems today. MAS are distributed systems and there is no central control for the agents in most of the systems. The lack of central control and the local view of each agent from the whole system may cause some unexpected behaviors which is called emergent behavior. Detecting and fixing these unexpected behaviors is more valuable and cost effective in the requirement and design phases rather than the implementation. In this paper, a method for the detection of emergent behaviors in MAS focusing on analysis phase of MaSE methodology and fixing them in the design phase is presented. The contributions of this work are investigating a specific type of emergent behaviors, the detection of them in MaSE methodology, and proposing solutions for the detected emergent behaviors. The details and the architecture of the system are …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Automated verification of AUML based multi-agent system design\n", "abstract": " Industrial demands for agent-based software engineering have significantly increased in the past years. To detect and address the unexpected failures in early design stage of multi-agent systems, several methodologies have been proposed. Agent UML (AUML) is a methodology for agent-based software development that is an extension of the widely accepted UML. AUML handles the interactions among agents by extending UML in dealing with agent-based challenges. In this paper, Agent UML is employed for designing multi-agent systems. A set of conversion rules is proposed to convert Agent UML methodology into UML sequence diagrams that can be used for behavior model synthesis. Then, an automated tool is developed for multiagent system verification that can replace the existing adhoc methods. To validate the proposed methods, a case study of a Real-Time Fleet Management System is used.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Clustering social networks to remove neutral nodes\n", "abstract": " Multi agent systems with autonomous interaction, negotiation and learning capabilities can efficiently model social behavior of individuals participating in a social network. A central problem in a social network is to identify the nodes that actively participate in the expansion of the net both physically and functionally. Several metrics have already been proposed to identify those hot spots. The algorithms to identify hot spots are either heuristic based or computationally expensive. In this paper we use an agent model of the social net and propose a method that can identify the neutral nodes, i.e. the nodes that can never be considered as hot spot nodes given the network topology and rules of negotiation among nodes. Therefore these nodes can be eliminated from the net. A direct advantage of this method is reducing the computational complexity for the configuration and identification of hot spots. Through a case study …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Model based analysis of internet filtering systems\n", "abstract": " Network filters are designed and deployed to enforce restrictions for a variety of political, social, economical or merely security reasons. However, network filters can potentially be violated by attackers and thus may not be completely adequate to fulfill their tasks. This paper approaches the network filtering from a software engineering perspective by utilizing an automated method to analyze the correctness of the requirements of the filtering mechanisms, and to reduce their vulnerability. The filtering requirements are expressed using scenario-based specifications. The set of scenarios are automatically analyzed for illegal behaviors. To demonstrate the effectiveness of this approach, a real-life internet filtering system is used as a case study.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Parameterized strategy pattern\n", "abstract": " The Strategy pattern decouples algorithms from the class that uses them allowing the algorithms to vary independently. It does not, however, allow the algorithms to have different parameters. The parameterized strategy pattern presented in this paper addresses the case when the algorithms have different sets of parameters, and when the user is allowed to see and modify these parameters for each concrete algorithm before its execution. This is accomplished by introducing special parameter classes which encapsulate algorithms parameters. The abstract algorithm class is completely decoupled from parameters letting each concrete algorithm class to create its own list of parameter instances which mirrors its parameters.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Formal Verification of Lack of Existence of Illegal Scenarios in the Requirements of Distributed Systems\n", "abstract": " FORMAL VERIFICATION OF LACK OF EXISTENCE OF ILLEGAL SCENARIOS IN THE REQUIREMENTS OF DISTRIBUTED SYSTEMS Mohammad Moshirpour Department of Electrical and Computer Engineering University of Calgary, Canada mmoshirp@ucalgary.ca Behrouz H. Far Department of Electrical and Computer Engineering University of Calgary, Canada far@ucalgary.ca ABSTRACT The lack of central control in distributed systems makes the analysis and design of such systems a challenging task. In fact many faults are introduced into the system at this stage of the software development life cycle. Therefore design validation of distributed software systems prior to the implementation phase is greatly desirable as it results in huge savings in time and cost. An effective and efficient approach to describing the requirements of distributed systems is using scenarios. Scenarios are commonly represented using . -…", "num_citations": "3\n", "authors": ["469"]}
{"title": "Concepts in Action: Performance Study of Agents Learning Ontology Concepts from Peer Agents.\n", "abstract": " The ability to share knowledge is a necessity for agents in order to achieve both group and individual goals. To grant this ability many researchers have assumed to not only establish a common language among agents but a complete common understanding of all the concepts the agents communicate about. But these assumptions are often too strong or unrealistic. In this paper we present a comprehensive study of performance of agents learning ontology concepts from peer agents. Our methodology allows agents that are not sharing a common ontology to establish common grounds on concepts known only to some of them, when these common grounds are needed by learning the concepts. Although the concepts learned by an agent are only compromises among the views of the other agents, the method nevertheless enhances the autonomy of agents using it substantially. The experimental evaluation shows that the learner agent performs better than or close to teacher agents when it is tested against the objects from the whole world.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Revisiting safe realizability of message sequence charts specifications\n", "abstract": " Safe realizability of Message Sequence Charts (MSCs) specifications is a measure of whether or not there exists a distributed implementation of the specification such that it is deadlock free and shows exactly the behaviours specified in the specification. There are also some works that given a specification, can answer whether it is safely realizable or not. However, while these works are restricted by certain assumptions such as synchronous message passing in the system, they also cannot answer why given two specifications, one is safely realizable and the other is not. In this paper, we present a property of MSC specifications that explains implementation problems for them. Using this result, we show how we can effectively correct a specification to avoid implementation problems such as deadlocks and implied scenarios.", "num_citations": "3\n", "authors": ["469"]}
{"title": "An Aggregation of Agents, Roles and Coalition Formation to Support Collaborative and Dynamic Organizations\n", "abstract": " Capturing human resources, their capabilities and dynamics can greatly contribute to an efficient and effective organization mission goals accomplishment. In practice however, this is often done in an ad-hoc manner leading to a big gap between the organizational specification model (at the design time) and its instance model (during the life cycle). In this paper we present a generic organizational model that captures the human resources, their operational and strategic capabilities, and adaptive coalition formation. The key elements of the model are capabilities, roles, agents and coalitions. We show how the resulting model can be used for role functionalities and performance control, as well as for capturing the knowledge in context-aware applications which is often present in an implicit manner.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Adjudicator: A Statistical Approach for Learning Ontology Concepts from Peer Agents.\n", "abstract": " We present a statistical approach for software agents to learn ontology concepts from peer agents by asking them whether they can reach consensus on significant differences between similar concepts. This method allows agents that are not sharing common ontologies to establish common grounds on concepts known only to some of them, when these common grounds are needed. The method starts with fetching positive and negative examples for a concept vaguely understood by a learner agent from the peer agents. The learner agent then uses a concept learning method to learn the concept in question. Then example objects of the candidate concept are sent back to the peer agents asking for their feedback. Peer agents evaluate the examples using two dimensional rate and weight evaluation criteria. The returned data is then tested for integrity and analyzed using analysis of variance to identify whether a statistical consensus can be achieved among peer agent with respect to the learnt concept. If such consensus exists, the learning agent can add the concept to its ontology with a higher degree of confidence. This will enhances the autonomy and improve communication and cooperation abilities among software agents.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Using prediction to provide decision support for the elicitation of user preferences\n", "abstract": " In multi-criteria decision making problems such as selecting development policies, selecting software products, or searching for commodities to purchase, it is necessary to have a precise model of the user preferences. Studies have revealed that often people are unable to state their preferences up front, and that they start to evaluate solution alternatives with a small set of high-value preferences; but change the value of those preferences as they discovery other solution features which they can incorporate into their preference models (B. Faltings et al., 2004). While, a variety of preference elicitation models have been proposed, limited or no effort has been made to utilize historical data to provide decision support for the elicitation of user preferences. In this paper, we discuss using neural net to take advantage of historical data, and provide decision support for developing user preference models, as well as …", "num_citations": "3\n", "authors": ["469"]}
{"title": "A framework for network fault management using software agents\n", "abstract": " This paper proposes a framework for distributed network management by incorporating fault and performance management metrics in a hierarchical decision making model. The goal of this research is to automate the fault management process. The fault management system is organized as a three level information processing model. Correlation results from each level are provided as evidence to the next level. Causal and temporal relationships between monitored variables are captured using Dynamic Bayesian Networks. As evidence is gathered, the probability of the presence of a fault is either strengthened or weakened. The proposed model is used for proactive fault detection as well as fault isolation purposes. A prototype implementing the ideas is presented.", "num_citations": "3\n", "authors": ["469"]}
{"title": "A Unified View of Software Agents Interactions\n", "abstract": " Software agents are knowledgeable, autonomous, situated and interactive software entities. Agents' interactions are of special importance when a group of agents interact with each other to solve a problem that is beyond the capability and knowledge of each individual. Efficiency, performance and overall quality of the multi-agent applications depend mainly on how the agents interact with each other effectively. In this paper, we suggest an agent model by which we can clearly distinguish different agent's interaction scenarios. The model has five attributes: goal, control, interface, identity and knowledge base. Using the model, we analyze and describe possible scenarios; devise the appropriate reasoning and decision making techniques for each scenario; and build a library of reasoning and decision making modules that can be used readily in the design and implementation of multiagent systems.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Integrated Network Operation Baselining and Adaptive Detection of Faults and Performance Ploblems\n", "abstract": " Detection of network problems is a crucial step in automating network management. It has a direct impact on the accuracy of fault, performance and security management functions. In this paper, we propose an adaptive technique for network fault and performance detection. Network operations normal baseline is parameterized as a finite mixture model, and model parameters are estimated from data using the Expectation Maximization algorithm. We propose a novel method for online residual generation, based on repeated identification of model parameters. The resulting multivariate residuals are shown to be approximately Normal with the mean 0 and unit variance under normal conditions, and the mean jumps suddenly to a different value, once anomaly occurs. To achieve fast detection, we formulate the problem of detection as a sequential disruption problem, where the task is to detect departures from the …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Towards The Use of Intelligent Agents in Collaborative Object-Oriented Analysis and Design\n", "abstract": " Software design often requires collaborative working among members of a software design project team. In many cases, the members are geographically distributed making the need for effective information and communication technologies acute. Implementing distributed artificial intelligence in intelligent agents is an alternative approach to achieve tasks on distributed computer systems. This paper examines the issues associated with the use of intelligent agents within the software analysis and design. Especially we concern to solve the problems identified in object model creation process for object-oriented analysis and design. This is intended to serve as a useful decision support system for designers, and should allow faster, better, and more economic, collaborative object-oriented analysis and design.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Knowledge-based Software Engineering\n", "abstract": " . Most of the works related to software agents is based on the assumption that the other agents are trustworthy. In the growing Internet environment this may be a false assumption. We are developing software agents for Electronic Commerce (EC) that operates in various security zones. They can exchange information with trusted agents and try to predict actions of the agents that cannot be trusted. In this paper we introduce a Multi-Agent Learning Language (MALL), aimed to make agents learn from their environment about the strategies of their opponents and later on make their own plans depending on the other players moves. Details of the language in EC agents and an implementation of such agents in JAVA are discussed. Software Architecture, Reuse and Agents### Decision Making under Certainty: In case where the agent is certain and knows exactly what state of nature to choose, and therefore will select the alternatives that give the highest payoffs.# Decision Making under Risk: In...", "num_citations": "3\n", "authors": ["469"]}
{"title": "A probabilistic approach for student modeling task\n", "abstract": " Student modeling is the task of gathering information about the target student in order to offer tailored instruction. To achieve this purpose, the formalism chosen to represent the student module should be able to draw estimations based on a set of restricted and uncertain information as well evolving aspects as a learning process implies. The approach we propose is the dynamic probabilistic network which is a formalism suitable for representing evolving information in an uncertain environment. The probabilistic student module will depict the student’s cognitive states in a domain independent manner which will be used as the source of information to prepare a general instructional plan. This plan, combined with the student’s response diagnose, is refined to a more specific instructional action. In this article, the basics of dynamic probabilistic student module will be presented.", "num_citations": "3\n", "authors": ["469"]}
{"title": "Decision-theoretic diagnosis-repair planning using Bayesian networks\n", "abstract": " : Common diagnosis systems view the accurate identication of components responsible for the faulty behavior of the system as the ultimate goal of the diagnostic activity. Restoring the system to its functioning state is a secondary concern that is not explicitly addressed during the fault identication process. In this article, we take the restoration of the system to be our ultimate objective and, thus, the diagnosis is important only to the extend that it contributes to derive a repair plan with minimal expected cost. Both in case of a single fault and multiple-independent faults, we build on existing approaches for repair planning to construct an algorithm for scheduling repair actions. Encoding our knowledge about the system in a Bayesian network, we, then, account for the possibility of sensing using an approximation algorithm based on limited look-ahead evaluation of pending sources of information based on their degree of informativeness and associated costs. 1 Introduction Alt...", "num_citations": "3\n", "authors": ["469"]}
{"title": "Functional reasoning, explanation and analysis: A collective view and a proposal\n", "abstract": " Functional Reasoning, Explanation and Analysis: A Collective View and A Proposal Page 1 Functional Reasoning, Explanation and Analysis: A Collective View and A Proposal Behrouz HOMAYOUN FAR Department of Information and Computer Sciences Saitama University, Japan Page 2 Contents 1. Introduction 5. Implementation perspective 3. Qualitative Function Formation (QFF) 4. Functional design using QFF 6. Discussion & Conclusion 2. Functional reasoning research Page 3 Introduction Chapter 1 : Page 4 Three levels of human cognitive processes Basic Knowledge Time spent Prior experiences Information processes Analogy, deduction, induction, etc. Search Comparison Knowledge-based (cognitive) level Skill-based (autonomus) level Rule-based (associative) level Page 5 Factors affecting \"cognitive overload\" of human designer : 1. Information accessibility 2. Control directness 3. Counter-intuition for ; : …", "num_citations": "3\n", "authors": ["469"]}
{"title": "203 Integrating Device Modeling and Design Process Knowledge in Functional Design\n", "abstract": " The goal of this project is developing tools for supporting knowledge intensive activities in design. The focus is on incorporating the conventional device modeling and analysis techniques with the design process modeling for rapid refinement of design. Particularly, we propose methods for deriving and explaining why and how a device can achieve a desired function, using qualitative description of its structure and behavior, and binding this function with the goal of the human designer. Qualitative Function Formation (QFF) technique is introduced. Some novel points are using a unified representation scheme for modeling the design process, decision schemas and the design product, by defining coordinative operations, temporal and dependency constraints, and binding them with the conventional qualitative simulation. Application of QFF in an experimental design support tool is reported. QFF offers the capability …", "num_citations": "3\n", "authors": ["469"]}
{"title": "Visualization of Server Log Data for Detecting Abnormal Behaviour\n", "abstract": " Modern large-scale IT operations are getting complex every day and generate thousands of log and event files, which contain essential information about the systems and their behavior. System errors are examined manually by human experts, which takes a considerable amount of time and efforts. The system log files, besides other attributes such as time and location, contain messages in textual form, which is essential for analyzing logs behavior. In this paper, we propose a method to extract meaningful information through topic modeling from log messages, combine them into a sequence of events and present them to the practitioners to visually identify abnormal behavioral patterns, which is used for predictive analysis.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Using Belief Propagation-Based Proposal Preparation for Automated Negotiation over Environmental Issues\n", "abstract": " Automated negotiation is used as a tool for modeling human interactions with the aim of making decisions when participants have conflicting preferences. Although automated negotiation is extensively applied in different fields (e.g., e-commerce), its application in environmental studies is still unexplored. This paper focuses on negotiation in environmental resource-management projects. The primary objective of this study is to reach agreement/conclusion as fast as possible. To achieve this objective, an agent-based model with two novel characteristics is proposed. The first is automating the process of proposal offering using Markov Random Fields and belief propagation (BP). The second is the ability to estimate stakeholders’ preferences through an argument handling (AH) model. The experiments demonstrated that the AH model and the BP-based proposal preparation (BPPP) approach improve the …", "num_citations": "2\n", "authors": ["469"]}
{"title": "Automated dynamic negotiation over environmental issues\n", "abstract": " Negotiation is a common means of resolving conflicts in social interactions. A popular approach for modeling social negotiation is automated negotiation. It is a distributed search in the space of potential agreements, facilitated by an agent-based model (ABM). Although automated negotiation is extensively applied in different fields of e-commerce, its application in environmental studies is still unexplored. This paper aims to lead the negotiation process over environmental issues in an efficient way where the possible agreement can be reached in few rounds of negotiation. To achieve this goal, an ABM is developed which has two significant characteristics. First, the proposer agent automatically learns the preferences of all stakeholder using the arguments and responses received from them in the rounds of negotiation. Second, the proposer accelerates the negotiation by automating the process of proposal-offering …", "num_citations": "2\n", "authors": ["469"]}
{"title": "Short-term travel time estimation: a case study\n", "abstract": " This paper presents a case study of traffic travel time estimation for the Deerfoot Trail highway in Calgary, AB, Canada. We analyzed the travel time for 12 hours per day for 5 consecutive months. The collected data are posted by Google maps, which are collected using hypertext transfer protocol requests. This paper provides a construction of the Holt-Winters forecasting model that streamlines the estimation of travel time for a specific hour of the day. The Holt-Winters model with exponential smoothing average has the best estimate of travel time. The model goodness of fit for the data collected at 07:00AM shows that the multiplicative Holt-Winters model has the best performance (mean square error 15.733 with R 2  value of 0.8435). A fleet driver can use the results to decide to travel at a given hour. Moreover, decision makers can use the results to plan for road events.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Using Web Mining to Support Low Cost Historical Vehicle Traffic Analytics.\n", "abstract": " Analyzing historical vehicle traffic data has many applications including urban planning and intelligent in-vehicle route prediction. A common practice to acquire this data is through roadside sensors. This approach is expensive because of infrastructure and planning costs and cannot be easily applied to new routes. In this paper, a low-cost Web mining approach is proposed to address these limitations. Our system gathers information about vehicle commute times, accidents, and weather reports from heterogeneous Web sources. Information from these sources can be combined to support road traffic analytics. We illustrate the utility of our system through a clustering analysis that investigates the traffic patterns of the busiest highway in Calgary along with factors having the most impact on commute time. The analysis shows that most of the accidents are localized around a small section of the highway near the city center and that the commute time in this segment is significantly more than that in other segments. Bad weather increases the typical evening rush hour commute time by 60% for days with moderate accidents and by a factor of 100% for days with large number of accidents. Overall, commute times can vary by a factor of 4 depending on accidents and weather.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Analyzing the scalability of a social network of agents\n", "abstract": " Social networks are ever-growing systems by inheritance. The increase in the number nodes in these systems often brings forth the need to add additional functionalities. However due to the distributed nature of social networks, system growth can be a challenging task. Therefore scalability of the system is of vital importance in the design of social networks. This research attempts to establish a comprehensive framework for analysis and validation of requirements and design documents for software systems. In previous work, we applied this framework to analyze the requirements of a social network of agents; expressed using scenario-based specifications. Scenarios are appealing because of their expressive power and simplicity. Moreover due to the clear and concise notation of scenarios, they can be used to analyze the system requirements for general validity, lack of deadlock, and existence of emergent …", "num_citations": "2\n", "authors": ["469"]}
{"title": "A stochastic time series generator with adaptive software architecture\n", "abstract": " Stochastic time series are preferred to historic data series of shorter duration since they contain sequences that may not be observed in a relatively short historic record. Algorithms to generate stochastic time series from historic data have already been proposed. In this paper we present an implementation of an efficient stochastic time series generation algorithm and a component based front-end software system for it. The algorithm is built as three distinct and customizable components. The component based architecture allows for seamless selection of the processing steps as well as integration of new algorithms. The system has been tested successfully on several numerical experiments using hydrologic time series data to generate lengthy (1000 years) of weekly or monthly river flows for multiple locations such that all relevant statistics of the historic series are preserved in the generated series.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Condition-based reliability modeling for systems with partial and standby redundancy\n", "abstract": " In this paper, we introduce a temporal approach for assessing the reliability of systems with components that are subject to change their conditions over time. Such changes could be due to poor working conditions, improper maintenance, or any unexpected malformations throughout the system's useful life. This approach is mainly based on adopting time-dependent reliability functions for assessing condition-based reliability. Our approach can be applied to common situations where the failure rates of the system components have dissimilar distributions.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Improving Project Performance with Role Driven Computational Support System\n", "abstract": " This paper describes a role driven computational support for software project lifecycle development. For a role to achieve its goal it needs some support. In our system we build a group of support agents of different types around each abstract role (i.e. scheduler, document deliverable, bookkeeper, etc). These support agents interact among each other and with those of other roles that share tasks dependencies. Agents in the system are not restricted by predefined schemes they can join and/or leave the coalition. The objective of the system is threefold: first, to present individuals with awareness, precise views of who is doing what and when, and more specifically activities evolution; second, to provide grounding algorithms for conceptual role(activity) dynamics and consistencies in a distributed environment; and third, to facilitate the control and optimization of activities accomplishment in organizations.", "num_citations": "2\n", "authors": ["469"]}
{"title": "A Multiagent Coalition Support Tool for Collaborative and Dynamic Roles\n", "abstract": " This paper describes a comprehensive multiagent based modeling approach for collaborative and dynamic organizational roles support. The method is a role centred one, where agents collaborate to assist human users through interaction within the same role, with other roles of the same team, as well as roles of different teams that share tasks dependencies; these agents are also dynamic within the role, they can join and/or leave the coalitions. We identify the key elements of the role model as rules, agents, and relationships. Our role model integrates both the operational functionalities and the strategic goal tasks, the former involve human individuals in the loop, whereas the later are performed by software agents to assist in monitoring, control, and adaptation of the performance in dynamic organizations.", "num_citations": "2\n", "authors": ["469"]}
{"title": "An agent negotiation engine for collaborative decision making\n", "abstract": " Negotiation engines are major components of autonomous agents, because negotiation is one of the most important types of agent interaction. Thus far, most negotiation engines rely on analytic techniques to maximize the social welfare of agent communities. Such engines are developed with total disregard of the possibility of enabling agents to analyze offers made by their negotiation opponents. The analysis of the offers leads to making tradeoffs that result into agreeing on (selecting) solution options that maximize the social welfare of the negotiation agents. Therefore, this paper presents an agent negotiation engine that supports the following: evaluation of solution options, analysis of tradeoffs, analysis of offers, and management of negotiation deadlocks. Moreover, the paper presents a simulation experiment that illustrates the capabilities of the negotiation engine.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Integrated approach for developing autonomous and interactive software agents\n", "abstract": " In this paper we present an approach that customize the BDI model to define a so-called \"DIBRA: desire-intention-belief-rapport-adaptation\" as a generic method to support progress from individual autonomous agent concept towards interactive multiple agents. Rapport here refers to the component that connects an agent to its environment, whereas adaptation module incorporates mechanisms of learning. The contribution of this paper is twofold; first, we propose a development approach that enables us to combine the internal and the interactive structures of multiagent system; second, the proposed methodology is applied to a real-world application targeting assistance in product development process. We believe that the five proposed tiers for multiagent systems (MAS) development serves for mastering the complexity and the difficulty of setting up effective autonomous interactive MAS", "num_citations": "2\n", "authors": ["469"]}
{"title": "Development of an intelligent system for architecture design and analysis [software architecture]\n", "abstract": " Software architecture plays a pivotal role in allowing an organization to meet its business goals, in terms of the early insights it provides into the system, the communication it enables among stakeholders, and the value it provides as a re-usable asset. Unfortunately, designing and analyzing architecture for a certain system is recognized as a hard task for most software engineers, because the process of collecting, maintaining, and validating architectural information is complex, knowledge-intensive, iterative, and error prone. The needs of software architectural design and analysis have led to a desire to create tools to support the process. This paper introduces an intelligent system, which serves the following purposes: to obtain meaningful nonfunctional requirements from users; to aid in exploring architectural alternatives; and to facilitate architectural analysis.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Design knowledge and software engineering\n", "abstract": " This paper points out various relationships between Design Knowledge and Software Engineering. After introduction of human design, the relationships between industrial Software Engineering is discussed, then further details of human design knowledge are revealed with discussions on humanistic aspects of design.", "num_citations": "2\n", "authors": ["469"]}
{"title": "An Expert System for Reproducing Huan Cognitive Processes in Automatic Software Design\n", "abstract": " CiNii 論文 - An Expert System for Reproducing Huan Cognitive Processes in Automatic Software Design CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学 図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版 年 年から 年まで 検索 検索 検索 [機関認証] 利用継続手続きのご案内 An Expert System for Reproducing Huan Cognitive Processes in Automatic Software Design FAR Behrouz H. 被引用 文献: 1件 著者 FAR Behrouz H. 収録刊行物 World Congress of Expert System World Congress of Expert System, 1994 被引用文献: 1件中 1-1件を 表示 1 OOExpert : オブジェクト指向ソフトウエア 自動設計用分散型エキスパートシステム ワホノ ロミ サトウリア , ファー ベルーズ H. 人工知能学会 全国大会論文集 = Proceedings of the Annual Conference of JSAI 13, 456-457, 1999-06-15 /…", "num_citations": "2\n", "authors": ["469"]}
{"title": "217 Learning Function of Devices Using Qualitative Function Formation Technique\n", "abstract": " The goal of this research is developing methods for categorizing and learning function of objects from a formal description of their structure and behavior using Functional Reasoning (FR). A collective view on FR theories and techniques is presented, common assumptions and basic problems are identi ed. Qualitative Function Formation (QFF) technique is introduced. Some novel points are extending the common qualitative models to include interactions and timing of events, by de ning coordinative relations, temporal and dependency constraints, and binding it with the conventional qualitative simulation. A function concept is de ned as an interpretation of a persistence or an order in the sequence of qualitative states. Examples of application of QFF in categorization and learning function of objects are given.", "num_citations": "2\n", "authors": ["469"]}
{"title": "A research on applications of qualitative reasoning techniques in Human Acts Simulation Program\n", "abstract": " Human Acts Simulation Program (HASP) is a ten-year research project of the Computing and Information Systems Center of JAERI. In HASP the goal is developing programs for an advanced intelligent robot to accomplish multiple instructions (for instance, related to surveillance, inspection and maintenance) in nuclear power plants. Some recent artificial intelligence techniques can contribute to this project. This report introduces some original contributions concerning application of Qualitative Reasoning (QR) techniques in HASP. The focus is on the knowledge-intensive tasks, including model-based reasoning, analytic learning, fault diagnosis and functional reasoning. The multi-level extended qualitative modeling for the Skill-Rule-Knowledge (SRK) based reasoning, that included the coordination and timing of events, Qualita tive Sensitivity analysis (Q^ A), Subjective Qualitative Fault Diagnosis (SQ^ D) and Qualitative Function Formation (Q^ p) techniques are introduc ed.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Modeling and analysis of rule based control systems based on qualitative reasoning and symbol structures\n", "abstract": " CiNii 博士論文 - Modeling and analysis of rule based control systems based on qualitative reasoning and symbol structures CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の 論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 博士論文 検索 全文検索 検索 すべて 本文あり タイトル 抄録・目次・注記 著者名 学位授与大学名 大学ID 学位 授与番号ID 取得学位名 学位授与年 年から 年まで 検索 検索 [機関認証] 利用継続手続きのご案内 Modeling and analysis of rule based control systems based on qualitative reasoning and symbol structures 定性推論と記号構造に基づくルールベース制御システムのモデル化と解析 Far, Behrouz Homayoun ファー, ベフルーズ ホマユン この論文にアクセスする 国立国会図書館デジタルコレクション 限定公開 この論文をさがす NDL ONLINE 著者 Far, Behrouz Homayoun ファー, ベフルーズ ホマユン 書誌事項 タイトル Modeling and analysis of rule based control systems based , …", "num_citations": "2\n", "authors": ["469"]}
{"title": "A study on intelligent nuclear systems,(HASP: human acts simulation program)\n", "abstract": " JAERI-M 89-023 by Lisp calculus, pattern recognitions by neural network methods, plant modelling by solid modeller, biped robot simulations, graphic display of the robot motion, and a study of design concept of a Monte Carlo vector processor for high speed calculation of the radiation exposure. In this report research results attained in the second year of the HASP project are described.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Case studies on the application of the CORE model for requirements engineering process assessment\n", "abstract": " Introduction 2. The Major COREs of RE Process 3. RE Process Assessment Models-0323-", "num_citations": "2\n", "authors": ["469"]}
{"title": "Reasoning with cases in the cbr system: A case study for applying ooexpert system\n", "abstract": " Case-Based Reasoning (CBR) is a reasoning method that used in the intelligent systems to find useful and applicable old cases, and reuse them either directly or after adaptation. CBR enables information managers to increase efficiency and reduce cost by substantially automating processes such as diagnosis, scheduling and design. In this paper we introduce the essential characteristic of CBR and discuss the comparation of CBR with a range alternative decision support techniques. The problems and limitations of case-based reasoning and other reasoning methods are discussed. And a case study for implementing CBR to the OOExpert is also presented.", "num_citations": "2\n", "authors": ["469"]}
{"title": "Exploring the requirements of pandemic awareness systems: a case study of COVID-19 using social media data\n", "abstract": " With the exponential growth of social media platforms like Twitter, a seemingly vast amount of data has become available for mining to draw conclusions about various topics, including awareness systems requirements. The exchange of health-related information on social media has been heralded as a new way to explore information-seeking behaviour during pandemics and design and develop awareness systems that address the public's information needs. Online datasets such as Twitter, Google Trends and Reddit have several advantages over traditional data sources, including real-time data availability, ease of access, and reduced cost. In this paper, to explore the pandemic awareness systems (PAS), requirements, we utilize data from the large accessible database of tweets and Reddit's posts to explore the contextual patterns and temporal trends in Canadians' information-seeking behaviour during the …", "num_citations": "1\n", "authors": ["469"]}
{"title": "Optimized Random Walk with Restart for Recommendation Systems\n", "abstract": " Many sophisticated recommendation methods have been developed to produce recommendations to the users. Among them, Random Walk with Restart (RWR) is one of the most widely used techniques. However, RWR has a large time complexity of  and memory complexity of . The change reducing the computational complexity is of great practical importance. In this paper, we propose an optimized version of random walk with restart, called the Optimized Random Walk with Restart (ORWR) and conduct theoretical and empirical studies on its performance. Mathematical analysis shows that using this technique the time complexity reduces to  and the memory complexity to O(nm). Experiments on three different recommendation problems using real-world datasets confirms the proposed ORWR method improves both time and memory cost of the recommendation.", "num_citations": "1\n", "authors": ["469"]}
{"title": "A Sliding-Window algorithm implementation in MapReduce\n", "abstract": " A limited resource processing platform may not be suited to process a large volume of data. The distributed processing platforms can solve this problem by incorporating commodity hardware collaboratively to process a large volume of data. The MapReduce programming framework is one candidate framework for large-scale processing, and Hadoop is its open-source implementation. This framework consists of the Hadoop Distributed File System and the MapReduce for computation capabilities. However, the MapReduce framework does not allow for data sharing for computation among the computing nodes. In this paper, we present an implementation of a sliding-window algorithm for data sharing for computation dependency in MapReduce. The algorithm is designed to facilitate the data processing a sequential order, e.g., moving average. The algorithm utilizes the MapReduce job metadata, e.g., input …", "num_citations": "1\n", "authors": ["469"]}
{"title": "Finding influential factors for different types of cancer: a data mining approach\n", "abstract": " Cancer is one of the leading causes of death around the world. Finding the risk factors related to different types of cancer can help researchers understand the process of cancer development and find new ways of preventing the disease. Most of the researches done on cancer datasets focus only one type of cancer. This research aims to provide a new methodology for extracting significant influential factors affecting multiple cancer types by employing frequent pattern mining, association rule mining, and contrast set mining techniques. The datasets used are US general population collected from the National Health Interview Survey (NHIS) and the Surveillance, Epidemiology, and End Results (SEER) Program. The rules discovered have invaluable contribution in two aspects: some of the rules validate the existing knowledge about cancer and a few of them expand further research scope to enrich expert …", "num_citations": "1\n", "authors": ["469"]}
{"title": "A Hybrid System for Detection of Implied Scenarios in Distributed Software Systems (S).\n", "abstract": " Distributed software systems (DSS) are usually open-ended systems used in different domains such as robotics, energy, health, etc. Multi-agent system (MAS) are a sub-class of DSS. In DSS, maintaining consistency between the system iterations is a complex and expensive task that requires coping with requirements changes and systems upgrading. The interactions, complexity and decentralized communication between components of the DSS may emerge an unwanted behavior. An unwanted behavior, known as Emergent Behavior (EB) or Implied Scenario (IS), could lead to irreversible damages. Thus, detecting IS at an early stage of the system development is needed to decrease the cost of maintaining the system. This work focuses on verification of DSS that its requirements modeled using Message Sequence Chart (MSC). The system verification focuses on the detection of IS using two already proposed different approaches. This article presents the combination of the two approaches by improving the usability of the tool presented in the first approach and the catalogue presented in the second approach. This combination allows the detection of new implied scenarios not detected using the cited approaches separately.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Measuring the potential of zonal control in large open areas on reducing the heating/AC energy\n", "abstract": " This paper represents the measurement of the heat/air-conditioning energy consumption in a large open area using electronic technologies. This work is scoping the measurement and analyses of the energy-saving possibility for large open areas such as critical care units in hospitals that use central heat/AC systems. Zonal control is performed by closing the heat/AC Vents in the unoccupied sections of the open areas during the day. The heat/AC ON time is measured using a monitor circuit, which senses outdoor and indoor temperatures, according to the preferred temperature of the user. Factors that promote open-area zonal heat control systems include personal preferences, the area's dimensions and shape, distribution of Vents, the location of windows and doors, and direct sun exposure. Over a three-and-a-half-month test period in summer and fall, measurement results proved that the zonal control system of …", "num_citations": "1\n", "authors": ["469"]}
{"title": "Clustering and Artificial Neural Network Ensembles Based Effort Estimation.\n", "abstract": " Accurate effort estimation of software development projects plays a key role in project success. However, it is still a challenge activity to researchers and practitioners because of the nature of software products and dynamics in software industry and development environment. Artificial neural network (ANN) is as an effective method and has been widely used in various areas of software engineering. This paper proposes a new effort estimation method based on clustering and ANN ensembles. The contribution of the paper is twofold. First, the impact of clustering projects on the estimation accuracy is investigated. Second, the impact of using ANN ensembles instead of a single ANN is also investigated. The proposed method includes three phases called pre-processing, k-means clustering, and ANN ensembles effort estimation. The method starts with exploring the historical projects dataset. Afterward, k-means is used to cluster the projects. Finally, the proposed method as well as two other estimation methods (ie a single ANN and expert-based) were applied to the created clusters and results were compared using MMRE and PRED measures. The simulation results show that the proposed method significantly outperforms the two other estimation methods.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Intelligent Decision Making for Customer Dynamics Management Based on Rule Mining and Contrast Set Mining\n", "abstract": " In real world situations, customer needs and preferences are changing over time and induce segment instability. The aim of this paper is to explore the patterns of customer segments’ structural changes. This study examines how businesses can gain better insight and knowledge through using data mining techniques to support intelligent decision making in customer dynamics management. Up to now, no attempt was done to describe and explain segments’ structural changes or to investigate the impact of customer dynamics on these changes. In this paper, a general method is presented based on rule mining and contrast set mining to describe and explain this issue. This method provides explanatory and predictive analytics to enlarge the opportunities for intelligent decision making in this area. The method is implemented on two different data sets for more generalizability. The results show that the method …", "num_citations": "1\n", "authors": ["469"]}
{"title": "On the Usage of Network Visualization for Multiagent System Verification\n", "abstract": " Multiagent Systems (MAS) consists of many software agents that interact to each other to perform their actions and achieve system goals. Due to the growing demand of Distributed Software Systems (DSS) and MAS as a branch of DSS, the verification of these systems has taken a special attention. The verification of these systems is required because MAS and DSS are large scale systems, where a failure can result in a huge amount of cost or damage. One major field is verification of MAS designs to prevent cost of fixing problems after implementation and deployment. The agents and interactions among them form a network of agents. This network can be used for verification of MAS from different perspectives and by various techniques. Visualizing agents’ networks can lead to detect a special type of unexpected behavior in MAS referred to as emergent behaviors and implied scenarios. These unexpected …", "num_citations": "1\n", "authors": ["469"]}
{"title": "Detecting Neutral Nodes in a Network of Heterogeneous Agent Based System\n", "abstract": " Software agents with autonomous interaction, negotiation and learning capabilities can be considered as a social network. Central problems in these social networks are: (1) investigating the network to find hot spots (nodes that actively participate in the expansion of the net both physically and functionally); (2) detecting violating nodes, i.e. nodes that have violated certain network policies. Key difference between human and agent based social nets are heterogeneity of agents and having various instances for an agent type. In this paper we propose a technique that can identify neutral nodes, i.e. nodes that can never be considered as a violating or interesting node because it shows similar behavior in all of its interactions. Given the communication protocol and by extracting communication rules, the neutrality for the agent is found in two levels, namely, inter-type and intra-type interactions. The neutrality is …", "num_citations": "1\n", "authors": ["469"]}
{"title": "Common understanding in a multi-agent system using ontology-guided learning\n", "abstract": " Traditionally, communication among agents has been established based on the group commitment to a common ontology which is unfortunately often too strong or unrealistic. In the real world of communicating agents, it is preferred to enable agents to exchange information while they keep their own individual ontology. While this assumption makes agents represent their knowledge more independently and give them more flexibility, it also adds to the complexity of communication. We believe that agents can overcome this complexity by using their learning capability. The agents can learn any concept they do not know but want to communicate about with other agents in the multi-agent system where they work in. Our goal in this paper is to present a general method for agents using ontologies to teach each other concepts to improve their communication, and therefore cooperation abilities. In our method, a …", "num_citations": "1\n", "authors": ["469"]}
{"title": "An intelligent CAD system for automated detection of pulmonary tuberculosis on chest radiograph and CT thorax: A road map\n", "abstract": " Tuberculosis (TB) is a common and deadly infectious disease that can occur at any age. It mostly affects the lungs, but can also affect other organs, including the central nervous system. TB is a leading cause of morbidity and mortality in adults worldwide, killing more than 1.5 million people every year. TB is often ignored by health care professionals at emergency departments in Canada. This is due to the fact that TB is a rare disease in Canadian-born non-Aboriginals. However, it remains prevalent in some groups, including immigrants from TB endemic countries. The basic key to control the spread of TB is the early detection and treatment. This paper exhibits several innovative works to automate the detection of TB and introduces an integrated auto-monitoring computer-aided detection (CAD) system. This system will be capable of detecting TB from plain chest radiographs and computed tomography (CT) thorax …", "num_citations": "1\n", "authors": ["469"]}
{"title": "A Decentralized Evolutional Approach to Handle Schedule Execution in Software Projects\n", "abstract": " We present an application of multi-agent to the problem of software project schedule execution evolution, i.e. performing an automatic schedule monitoring and handling contingencies that result in project delivered on time, and required specifications. In a software project setting each involved individual can be represented by three cooperative agents: a proxy, a bookkeeper and a scheduler. These cooperative agents adopt a proactive schedule representation that is able to withstand task execution delays, and use reactive cooperative adaptation strategies with other teammates having bonded tasks activity to generate a schedule solution that maximizes the team reward. Our experimental results with real software project instances data underline the validity of our approach.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Ontology-learning Supported Sematic Search Using Cooperative Agents.\n", "abstract": " In this paper we present (1) a method for semantic search supported by ontological concept learning; and (2) a prototype multiagent system that can handle semantic search and encapsulate the complexity of such process from the users. Agents which conduct semantic search on behalf of a user, deploy ontologies to organize structured and unstructured documents in their corresponding repositories. The ontology for each repository is individualized and commitment to a common ontology is not required. The agents can improve their search capability by learning new concepts from each other. This method thus allows agents dynamically establish common grounds on concepts known only to some of them. The concept learning is realized by analyzing positive and negative examples from other agents, and/or taking votes in case of conflicts in the received knowledge by involving other agents again.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Harnessing overgeneralization in the synthesis of state machines from scenarios\n", "abstract": " Synthesis of state machine designs from scenarios must cope with two main problems, namely, generalizing partial behaviours of scenarios and preventing from overgeneralization that produces spurious emergent behaviours. The challenge is a trade-off between automatic generalization in one hand, and the effort and time spent for resolving spurious emergent behaviours on the other hand. In this paper, we propose a solution for this challenge in terms of a set of syntactic criteria defined over scenarios that can be automatically checked using a syntax checker. While these criteria still allow for enough generalization in the output state machine, they also harness overgeneralization as a challenge for automatic synthesis of state machines from scenarios.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Agent-based Adaptive Information Systems: Integration of Operational Roles and Performance Indicators\n", "abstract": " Today's information systems are often built not only to support business processes that are characterized by high variability and dynamics, but also to interact with a variety of users with different roles in business processes. Such information systems are required to support goal achievement at various levels of efficiency and effectiveness. Therefore, they have to adhere to well defined operational roles and their performance indicators on one hand and be highly adaptable to changes in the environment on the other. In this research we propose an approach to build an agent-based information system to support different users with specific roles in the business processes by means of interaction between operational and strategic goals. This approach integrates role functionalities and performance control, and captures the knowledge which is often implicitly presented.", "num_citations": "1\n", "authors": ["469"]}
{"title": "A Qualitative Reasoning Model for Tradeoff Analysis in Multiple Objective Decision Making\n", "abstract": " In Multi-Criteria Decision Making problems such as choosing a development policy, selecting software products, or searching for commodities to purchase, it is often necessary to evaluate solution options in respect of multiple objectives. The solution alternative that performs best in all the objectives is the dominant solution, and it should be selected to solve the problem. However, usually the selection objectives are incomparable and conflicting, making it impossible to have a dominant solution among the alternatives. In such cases, tradeoff analysis is required to identify the objectives that can be optimized, and those that can be comprised in order to choose a winning solution. In this paper we present a tradeoff analysis model based on the principles of qualitative reasoning that provides visualization support for understanding interaction and tradeoff dependences among solutions evaluation criteria which affect …", "num_citations": "1\n", "authors": ["469"]}
{"title": "A novel approach for developing autonomous and collaborative agents\n", "abstract": " In this paper we present a novel approach that customize the BDI model to define a so-called “RBDIA: Rapport-Belief-Desire-Intention-Adaptation” as a generic method to support progress from individual autonomous agent concept towards a collaborative multiple agents. Rapport here refers to the component that connects an agent to its environment, whereas Adaptation module incorporates mechanisms of learning. The contribution of this paper is twofold: first, we develop a novel modeling approach that enable us to combine the internal and social structures of collaborative multigent, and second the proposed methodology is applied to a real-world application for assistance in product development process. We believe that the five proposed tiers for multiagent systems (MAS) development serves for mastering the complexity and the difficulty of setting up effective autonomous collaborative MAS.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Intelligent Agents based Architecture for Distributed Decision Support to Manage Projects Lifecycle\n", "abstract": " An intelligent agents based architecture framework for decision support to manage projects’ lifecycle is proposed. The intent of the proposed framework is to improve the way projects’ life cycle is handled in today’s cross-organizational projects, by assisting cooperation managers to control the development process in a reliability driven manner. The proposed decision support framework uses distributed agents and concentrates on a formal approach to capture the system’s architectural artifacts. It relies on Jini and JavaSpaces services. The importance of this work is that it fits seamlessly into the current efforts of companies for controlling complex projects within the estimated budget and time.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Performance Metrics for Intelligent Systems\n", "abstract": " The process of evaluating performance for intelligent systems is a difficult process due to the complexity of the technologies used in constructing such architectures and environments. This area of science and engineering is quite new, without a complete quantified knowledge, which makes it difficult to use existing evaluation criteria and metrics to establish the advantages and disadvantages of different systems. This tutorial presents some issues in the software measurement process of intelligent systems and introduces a number of evaluation criteria for these types of systems as a starting point for deriving a set of useful metrics to measure their performance.…..", "num_citations": "1\n", "authors": ["469"]}
{"title": "Dynamic mirroring for efficient web server performance management\n", "abstract": " Server performance is a major issue in improving the overall performance of the World Wide Web (WWW). This article introduces a dynamic mirroring-based approach to improve WWW servers' performance. In contrast to static mirroring, where mirror servers are allocated statically, our mirror servers' setup is driven by network traffic measurement. Performance in terms of latency is inferred from a queuing model. According to this model we show that latency of an overloaded server can be tuned by delegating a portion of the load to a cooperative mirror server. Cost is evaluated by the amount of load hosted by the mirror servers. The goal is then to keep the latency within a tolerable threshold, while minimizing the delegated load. This problem is formulated as a constrained optimization problem where the task is to assign a portion of load corresponding to each document to each mirror server. As the result of this work …", "num_citations": "1\n", "authors": ["469"]}
{"title": "Teaching computer programming languages through WWW\n", "abstract": " This paper presents web-based tutoring system (W-TCL) for teaching computer programming languages through WWW. In this version, two new features have been added: blackboard module and adaptive interface. With blackboard module a teacher can exchange his expertise with other teachers, and with adaptive interface the novice student will be satisfied because the system avoids complex interfaces. The system contains three sub-agents: the personal assistant agent for teacher (PAA-T), the personal assistant agent for student (PAA-S) and tutoring agent (TA). Using PAA-T, many teachers can cooperate together to:(a) put the curriculum of one/more computer programming language (s),(b) add or modify the commands' structure that will be taught,(c) generate different tutoring dialogs for the same command, and (d) generate different tutoring styles (eg text or Q&A).", "num_citations": "1\n", "authors": ["469"]}
{"title": "Software Creation: Detail of human design knowledge and it's application to automatic software design\n", "abstract": " The paper reports on results of a study aiming at establishing a fundamental basis for automating design of any kind of software. Considering the final object, an automatic design learning human designer has been taken. An excellent software organization with high maturity has been taken as the expert, and the hierarchical work process is the knowledge model. For detailing, the major operations are made by hierarchical detailing. Namely, a software design may be reduced hierarchically to various design rules, which are parent and children relationship of a human concept created during expansion of a piece of design to more detailed form. To know the inside of human mental operations generating a design rule, a more detailed study was made and it was found that a design rule may be further reduced hierarchically to some fundamental human mental operations, called micro design rules. They represent …", "num_citations": "1\n", "authors": ["469"]}
{"title": "How to learn function of devices\n", "abstract": " A goal of this research is developing methods for learning the function of devices from a qualitative description of their structure and behavior using functional reasoning. The qualitative function formation (QFF) technique is introduced. In QFF, a function concept is defined as an interpretation of a persistence or an order in the sequence of qualitative states, using a trace of the qualitative state vector derived by simulation on a qualitative model of a device. Examples of application of QFF in categorization and learning the function of components in engineering design are given.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Reuse software components in multi-agent environment\n", "abstract": " All over the world now, there are several thousands of programmers or may be more. If you analyze their products, you’ll find many similarities, eg the program which made in country-A to solve problem X this year, had been made several months ago in country-B. In this paper, we present a model to generate a program source automatically, by reusing available similar parts of the required program over the network. This model assists programmers to reduce the cost and time required for their programs, by reusing what is already available on the network, instead of building their programs from scratch,", "num_citations": "1\n", "authors": ["469"]}
{"title": "High quality design using SDL technology\n", "abstract": " This paper describes a design procedure with documentation for embedded software systems aiming at high quality. It starts from process level design. A system is decomposed to several orthogonal processes by data flow division. Making each block or process mono-functional and repeating the division, the system is reduced to a hierarchical cluster of Extended Finite State Machines. The design proceeds by converting an abstract level message sequence chart to multi-process message sequence charts, to a. state diagram for one trace, and ﬁnally to a state diagram including all traces. Each state transition route is ﬁnally converted to source code. A design of an embedded system is thus partitioned to many small step designs each accompanied with the interfacing documents. Through careful, rigorous and repetitive documentation and check, the overall error rate is decreased. Experiments based on applying this method in developing skills of software design and education are reported.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Structural way of thinking for attaining reliable software\n", "abstract": " This paper describes quantitative relations of software errors from the view point of human errors, and gives a design planning method for attaining high reliability software. The software design process is a huge chain of human mental processing, during which inevitable human errors occur. By separating built-in and check-out errors, clear characteristics may be obtained, and quantitative measurements are possible. Checks and tests are another part of design also suffering from human errors. Various data are shown to establish quantitative relationships. The quantitative quality design of the software development process is introduced.< >", "num_citations": "1\n", "authors": ["469"]}
{"title": "ソフトウェア設計における設計知識の体系的な構築法\n", "abstract": " Conventional knowledge engineering techniques for acquiring experts’ knowledge can not produce quality knowledge due to improper knowledge documentation and informal knowledge acquisition method. We propose a new method for knowledge documentation, acquisition and implementation. Particularly, this paper introduces a systematic approach towards implementation of software design knowledge of a team of human experts, using cooperative expert system technology. The focus is on reuse of the design knowledge that a single expert possesses when contributing to a design shared among a number of experts. We propose a structure for expert systems that combines function detailing and data detailing for a team of human experts through interactions and negotiations among units.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Software Creation: An Expert System for Applying Design Process Knowledge in Automatic Software Design\n", "abstract": " A goal of this project is automating software design by accumulating knowledge and experience of human designers. CREATOR2, an experimental expert system that simulates behavior of human designers by applying design process knowledge is introduced. A novel point is using a unified representation scheme for the design process knowledge, composed of design rules for detailing and tacit knowledge, and the design product knowledge. Experiments on designing switching software are reported.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Modelization of a wider class of flexible manufacturing systems(a DEDS approach).\n", "abstract": " A quantitative model for describing the behavior of FMS systems is proposed and applied to explain problems such as dispatching of jobs and scheduling of activities. The new modelling object introduced here is \"compound multi-task server\" which is used to explain the indeterministic problems. Moreover, a method of tracking partially processed jobs is proposed. The behavior of the FMS system is represented into the state-space form, where the state variables are selected to present system's performance explicitly.", "num_citations": "1\n", "authors": ["469"]}
{"title": "Applications of Data Management and Analysis\n", "abstract": " The quantity of data in various science and engineering domains is increasing at a phenomenal rate, in structured and semi-structured formats. The data is characterized by its complexity, volume, high dimensionality, and velocity. Together with this growth, there are a large number of data science-related tools and techniques available for analyzing data and extract useful, actionable and reusable knowledge. Data science is an interdisciplinary field. Theories, techniques, and tools are drawn from various fields within mathematics, statistics, information science, software engineering, signal processing, probability models, machine learning, statistical learning, data mining, database systems, data engineering, pattern recognition, visualization, predictive analytics, uncertain modeling, data warehousing, data compression, artificial intelligence, and high performance computing. Practitioners in each domain need to …", "num_citations": "1\n", "authors": ["469"]}