{"title": "Truckers drive their own assessment for obstructive sleep apnea: a collaborative approach to online self-assessment for obstructive sleep apnea\n", "abstract": " Background:Commercial motor vehicle drivers are at an increased risk for obstructive sleep apnea (OSA). The Federal Motor Carrier Safety Administration (FMCSA) Medical Review Board has recommended that commercial motor vehicle drivers undergo testing for OSA if they have a positive Berlin Questionnaire or a BMI ≥ 30 kg/m2. We developed an online screening tool based on the Berlin Questionnaire for anonymous use by commercial drivers to assess their risk of OSA prior to their required FMCSA physicals.Methods:We based the survey on the Berlin Sleep Questionnaire. The survey was hosted on the Truckers for a Cause Chapter of Alert Well and Keeping Energetic of the American Sleep Apnea Association (TFAC-AWAKE) organization website, and was promoted through the TFAC's XM radio, word of mouth, and trucking industry press contacts.Results:A total of 595 individuals completed the survey. Of …", "num_citations": "54\n", "authors": ["1221"]}
{"title": "Assessing the accuracy of legal implementation readiness decisions\n", "abstract": " Software engineers regularly build systems that are required to comply with laws and regulations. To this end, software engineers must determine which requirements have met or exceeded their legal obligations and which requirements have not. Requirements that have met or exceeded their legal obligations are legally implementation ready, whereas requirements that have not met or exceeded their legal obligations need further refinement. Research is needed to better understand how to support software engineers in making these determinations. In this paper, we describe a case study in which we asked graduate-level software engineering students to assess whether a set of software requirements for an electronic health record system met or exceeded their corresponding legal obligations as expressed in regulations created pursuant to the U.S. Health Insurance Portability and Accountability Act (HIPAA). We …", "num_citations": "27\n", "authors": ["1221"]}
{"title": "IBM Blockchain: An enterprise deployment of a distributed consensus-based transaction log\n", "abstract": " The backdrop of multiple scandals involving the corruption and falsification of our financial and business organizations’ records accentuates the need for tamperresistant data stores [2]. The United States alone has over 10,000 [8] rules and regulations that pertain to the proper storage and maintenance of an organization’s data [6]. The Sarbanes Oxley Act [1], for example, include standards around the trustworthiness of data, emphasizing the importance of the audit log of an organization’s records. A motivating example of the reason for these rules and regulations is as follows: if a member of an organization with a vested interest in pertinent outcomes can manipulate the organization’s data after the fact, he or she can make it appear that an organization had no record of an embezzlement scheme, which limits or eradicates the organization’s liability. Situations like these point to a broader notion: the future of the world’s economic stability hinges on the ability to trust and believe in the integrity of data that is maintained by our institutions in health care, finance, business, and government.Blockchain networks can help address this issue of data tampering and falsification. In a blockchain network, peer nodes (hereafter peers) run a piece of software that allows operations on a common, shared data store. Each peer maintains a local copy of the data store and a record of transactions with that store, but all modifications to the data store must be proposed to and agreed upon by the network. Peers use public key cryptography to achieve authenticity and non-repudiation of proposed changes to the datastore. Peers must also form a consensus on which …", "num_citations": "12\n", "authors": ["1221"]}
{"title": "Systematizing security test case planning using functional requirements phrases\n", "abstract": " Security experts use their knowledge to attempt attacks on an application in an exploratory and opportunistic way in a process known as penetration testing. However, building security into a product is the responsibility of the whole team, not just the security experts who are often only involved in the final phases of testing. Through the development of a black box security test plan, software testers who are not necessarily security experts can work proactively with the developers early in the software development lifecycle. The team can then establish how security will be evaluated such that the product can be designed and implemented with security in mind. The goal of this research is to improve the security of applications by introducing a methodology that uses the software system's requirements specification statements to systematically generate a set of black box security tests. We used our methodology on a …", "num_citations": "11\n", "authors": ["1221"]}