{"title": "The Java language specification\n", "abstract": " For nearly five years, one book has served as the definitive reference to Java for all serious developers: The Java Language Specification, by James Gosling, Bill Joy, and Guy Steele. Now, these world-renowned Java authorities (along with new co-author Gilad Bracha) have delivered a monumental update. This completely revised Second Edition covers the Java 2 Platform Standard Edition Version 1.3 with unprecedented depth and precision, offering the invaluable insights of Java's creators to every developer. There is no better source for learning everything about the Syntax and Semantics of the Java programming language. Developers will turn to this book again and again.", "num_citations": "9147\n", "authors": ["17"]}
{"title": "The Java programming language\n", "abstract": " Beautiful buildings are more than scientific. They are true organisms, spiritually conceived; works of art, using the best technology by inspiration rather than the idiosyncrasies of mere taste or any averaging by the committee mind.", "num_citations": "3867\n", "authors": ["17"]}
{"title": "Virus taxonomy: ninth report of the International Committee on Taxonomy of Viruses\n", "abstract": " The practical need to partition the world of viruses into distinguishable, universally agreed upon entities is the ultimate justification for developing a virus classification system. Since 1971, the International Committee on Taxonomy of Viruses (ICTV) operating on behalf of the world community of virologists has taken on the task of developing a single, universal taxonomic scheme for all viruses infecting animals (vertebrate, invertebrates, and protozoa), plants (higher plants and algae), fungi, bacteria, and archaea. The current report builds on the accumulated taxonomic construction of the eight previous reports dating back to 1971 and records the proceedings of the Committee since publication of the last report in 2005. Representing the work of more than 500 virologists worldwide, this report is the authoritative reference for virus organization, distinction, and structure.", "num_citations": "3474\n", "authors": ["17"]}
{"title": "Functional aspects of recollective experience\n", "abstract": " The functional relationship between recognition memory and conscious awareness was examined in two experiments in which subjects indicated when recognizing a word whether or not they could consciously recollect its prior occurrence in the study list. Both levels of processing and generation effects were found to occur only for recognition accompanied by conscious recollection. Recognition in the absence of conscious recollection, although less likely, was generally reliable and uninfluenced by encoding conditions. These results are consistent with dual-process theories of recognition, which assume that recognition and priming in implicit memory have a common component. And they strengthen the case for making a functional distinction between episodic memory and other memory systems.", "num_citations": "1407\n", "authors": ["17"]}
{"title": "The real-time specification for Java\n", "abstract": " New languages, programming disciplines, operating systems, and software engineering techniques sometimes hold considerable potential for real-time software developers. A promising area of interest-but one fairly new to the real-time community-is object-oriented programming. Java, for example, draws heavily from object orientation and is highly suitable for extension to real-time and embedded systems. Recognizing this fit between Java and real-time software development, the Real-Time for Java Experts Group (RTJEG) began developing the real-time specification for Java (RTSJ) in March 1999 under the Java Community Process. This article explains RTSJ's features and the thinking behind the specification's design. The goal of the RTJEG, of which the authors are both members, was to provide a platform-a Java execution environment and application program interface (API)-that lets programmers correctly …", "num_citations": "1281\n", "authors": ["17"]}
{"title": "The Java language environments: A White Paper\n", "abstract": " CiNii 論文 - The Java language environments : A White Paper CiNii 国立情報学研究所 学術 情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 [7/12更新 ]2022年4月1日からのCiNii ArticlesのCiNii Researchへの統合について The Java language environments : A White Paper GOSLING J. 被引用文献: 1件 著者 GOSLING J. 収録刊行物 Technical report, Sun Microsystems Technical report, Sun Microsystems, 1995 被引用文献: 1件中 1-1件を 表示 1 細粒度保護ドメインのための多重保護ページテーブルの提案と実装 河野 健二 , 品川 高廣 , 高橋 雅彦 , 益田 隆司 情報処理学会研究報告. OS,[システムソフトウェアとオペレーティング ・システム] 81, 89-94, 1999-05-06 参考文献8件 被引用文献2件 Tweet 各種コード NII論文ID(NAID…", "num_citations": "878\n", "authors": ["17"]}
{"title": "Graphical user interface with method and apparatus for interfacing to remote devices\n", "abstract": " An intuitive graphical user interface is based upon a geographic map structure, and includes a system for controlling remote external electronic devices. In the defined graphical user interface, each Space of the geographic map structure is rendered on a touch screen display as a graphic image of a geographic space. Within each Space are colored cartoon-like icons called\" objects\" which can be Selected and manipulated by the user. Certain objects, referred to as portals, transport the user from one Space to another Space when Selected. Other objects, referred to as buttons, perform associated actions or functions when Selected. The graphical user interface is displayed on a hand-held display device used to control remote devices. Each remote electronic device transmits a user interface program object that defines a graphical user interface to the display device. The hand-held display devices displays the …", "num_citations": "848\n", "authors": ["17"]}
{"title": "Recollective experience in word and nonword recognition\n", "abstract": " The functional relationship between memory and consciousness was investigated in two experiments in which subjects indicated when recognizing an item whether they could consciously recollect its prior occurrence in the study list or recognized it on some other basis, in the absence of conscious recollection. Low-frequency words, relative to high-frequency words, enhanced recognition accompanied by conscious recollection but did not influence recognition in the absence of conscious recollection. By contrast, nonwords compared with words enhanced recognition in the absence of conscious recollection and reduced recognition accompanied by conscious recollection. A third experiment showed that confidence judgments in recognizing nonword targets corresponded with recognition performance, not with recollective experience. These measures of conscious awareness therefore tap qualitatively …", "num_citations": "675\n", "authors": ["17"]}
{"title": "Remembering and knowing.\n", "abstract": " Remembering and knowing are 2 subjective states of awareness associated with memory. Remembering refers to intensely personal experiences of the past—those in which we seem to recreate previous events and experiences with the awareness of reliving these events and experiences mentally. Knowing refers to other experiences of the past, those in which we are aware of knowledge that we possess but in a more impersonal way. Knowing includes the general sense of familiarity we have about more abstract knowledge. Knowing also includes awareness of events that we have personally experienced when we are aware of those events as facts, without reliving them mentally. Throughout this chapter the terms remembering and knowing are used only to refer to these conscious states and to the responses Ss make when reporting them.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "624\n", "authors": ["17"]}
{"title": "Attention and recollective experience in recognition memory\n", "abstract": " The functional relation between recognition memory and conscious awareness was assessed in an experiment in which undivided attention at study was compared with two divided attention conditions, one more demanding than the other. When recognizing a word from the study list, subjects indicated whether they could consciously recollect its-prior occurrence or recognized it on some other basis, in the absence of consciousrecollection. Divided attention at study progressively impaired word recognition accompanied by conscious recollection. Recognition in the absence of conscious recollection was not affected by divided attention. These findings are interpreted as providing further support for the idea that recognition memory entails two distinct components, one based on associative and contextual information, the other based on a “traceless” awareness of familiarity.", "num_citations": "561\n", "authors": ["17"]}
{"title": "Method and apparatus for presenting information in a display system using transparent windows\n", "abstract": " A central processing unit (CPU) is provided and is coupled to a display for displaying graphic and other data in multiple overlapping windows. The CPU is further coupled to one or more input devices which permits a user to selectively position a cursor and input and manipulate data within each of the windows on the display. The windows include defined areas having window features such as text, icons and buttons corresponding to functions to be executed by the CPU. Multiple applications may be executed concurrently by the CPU such that each application is associated with one or more windows. Each display element (\" pixel\") comprising the display is represented by multiple bits in a computer frame buffer memory coupled to the CPU. An alpha value (α) is associated with the intensity of each pixel of the display such that multiple images may be blended in accordance with a predefined formula utilizing the …", "num_citations": "506\n", "authors": ["17"]}
{"title": "Graphical user interface for displaying and navigating in a directed graph structure\n", "abstract": " An intuitive graphical user interface is based upon a geographic map structure, and includes a system for controlling remote external electronic devices. In the defined graphical user interface, each space of the geographic map structure is rendered on a touch screen display as a graphic image of a geographic space. Within each space are colored cartoon-like icons called “objects” which can be selected and manipulated by the user. Certain objects, referred to as portals, transport the user from one space to another space when Selected. Other objects, referred to as buttons, perform associated actions or functions when Selected. The graphical user interface is displayed on a hand-held display device used to control remote devices. Each remote electronic device transmits a user interface program object that defines a graphical user interface to the display device. The hand-held display devices displays the …", "num_citations": "484\n", "authors": ["17"]}
{"title": "Objects First with Java: A practical introduction using BlueJ\n", "abstract": " Introduction to algorithms and computer science for students with little or no programming experience. Using the framework of an object-oriented programming language this course will cover problem solving, algorithms and object-oriented design. Topics include data, control, problem decomposition, abstractions, arrays and an introduction to the analysis of algorithms.", "num_citations": "481\n", "authors": ["17"]}
{"title": "Method and apparatus for enhancing software security and distributing software\n", "abstract": " Source code to be protected, a software application writer's private key, along with an application writer's license provided to the first computer. The application writer's license includes identifying information such as the application writer's name as well as the application writer's public key. A compiler program executed by the first computer compiles the source code into binary code, and computes a message digest for the binary code. The first computer then encrypts the message digest using the application writer's private key, such that the encrypted message digest is defined as a digital\" signature\" of the application writer. A software passport is then generated which includes the application writer's digital signature, the application writer's license and the binary code. The software passport is then distributed to a user using any number of software distribution models known in the industry. A user, upon receipt of the …", "num_citations": "466\n", "authors": ["17"]}
{"title": "The Java language specification\n", "abstract": " THE Java™ programming language is a general-purpose, concurrent, classbased, object-oriented language. It is designed to be simple enough that many programmers can achieve fluency in the language. The Java programming language is related to C and C++ but is organized rather differently, with a number of aspects of C and C++ omitted and a few ideas from other languages included. It is intended to be a production language, not a research language, and so, as CAR Hoare suggested in his classic paper on language design, the design has avoided including new and untested features.The Java programming language is strongly typed. This specification clearly distinguishes between the compile-time errors that can and must be detected at compile time, and those that occur at run time. Compile time normally consists of translating programs into a machine-independent byte code representation. Run-time activities include loading and linking of the classes needed to execute a program, optional machine code generation and dynamic optimization of the program, and actual program execution.", "num_citations": "458\n", "authors": ["17"]}
{"title": "Recognising and remembering\n", "abstract": " Memory in reflective mode relies more on intentional processes. Memory in operational mode relies more on automatic processes. Interest in awareness and memory was crystallised by the distinction P. Graf and D. L. Schacter drew between explicit and implicit memory. Explicit tests engage memory in reflective mode because the instructions specify conscious recollection or remembering. Implicit tests engage memory in operational mode because memory is used as a device for the accomplishment of some task that is nominally unconnected with conscious recollection. Memory theory would benefit from a reform of terminology so that the same terms are not used to label memory tasks, hypothetical constructs, and states of awareness. Experiential measures of recognition memory and awareness based on the distinction between remembering and knowing reveal systematic dissociations between these two states …", "num_citations": "445\n", "authors": ["17"]}
{"title": "The Java language environment\n", "abstract": " THIS DOCUMENT COULD INCLUDE TECHNICAL INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN; THESE CHANGES WILL BE INCORPORATED IN NEW EDITIONS OF THE DOCUMENT. SUN MICROSYSTEMS, INC. MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE PRODUCT (S) AND/OR THE PROGRAM (S) DESCRIBED IN THIS DOCUMENT AT ANY TIME.", "num_citations": "441\n", "authors": ["17"]}
{"title": "Episodic memory and autonoetic consciousness: a first–person approach\n", "abstract": " Episodic memory is identified with autonoetic consciousness, which gives rise to remembering in the sense of self–recollection in the mental re–enactment of previous events at which one was present. Autonoetic consciousness is distinguished from noetic consciousness, which gives rise to awareness of the past that is limited to feelings of familiarity or knowing. Noetic consciousness is identified not with episodic but with semantic memory, which involves general knowledge. A recently developed approach to episodic memory makes use of ‘first–person’ reports of remembering and knowing. Studies using this approach have revealed many independent variables that selectively affect remembering and others that selectively affect knowing. These studies can also be interpreted in terms of distinctiveness and fluency of processing. Remembering and knowing do not correspond with degrees of confidence in memory …", "num_citations": "434\n", "authors": ["17"]}
{"title": "Experiences of remembering, knowing, and guessing\n", "abstract": " This article presents and discusses transcripts of some 270 explanations subjects provided subsequently for recognition memory decisions that had been associated with remember, know, or guess responses at the time the recognition decisions were made. Only transcripts for remember responses included reports of recollective experiences, which seemed mostly to reflect either effortful elaborative encoding or involuntary reminding at study, especially in relation to the self. Transcripts for know responses included claims of just knowing, and of feelings of familiarity. These transcripts indicated that subjects were often quite confident of the accuracy of their decisions, compared with those for guess responses. Transcripts for decisions associated with guess responses also expressed feelings of familiarity but additionally revealed various strategies and inferences that did not directly reflect memory for studied items …", "num_citations": "392\n", "authors": ["17"]}
{"title": "Method and apparatus for improved graphical user interface having anthropomorphic characters\n", "abstract": " An intuitive graphical user interface is based upon a geographic map structure, and includes a system for controlling remote external electronic devices. In the defined graphical user interface, each space of the geographic map structure is rendered on a touch screen display as a graphic image of a geographic space. Within each space are colored cartoon-like icons called\" objects\" which can be selected and manipulated by the user. Certain objects, referred to as portals, transport the user from one space to another space when Selected. Other objects, referred to as buttons, perform associated actions or functions when Selected. The graphical user interface is displayed on a hand-held display device used to control remote devices. Each remote electronic device transmits a user interface program object that defines a graphical user interface to the display device. The hand-held display devices displays the …", "num_citations": "383\n", "authors": ["17"]}
{"title": "Changes in memory awareness during learning: the acquisition of knowledge by psychology undergraduates.\n", "abstract": " First-year psychology students took multiple-choice examinations following each of 4 lecture courses and 3 laboratory research methods courses. One lecture course was later retested. Students indicated state of memory awareness accompanying each answer: recollective experience (remember),“just know”(know), feeling of familiarity (familiarity), or guess. On the lecture courses, higher performing students differed from other students because they had more remember responses. On research methods, higher performing students differed because they knew more, and in the delayed retest, higher performing students differed because they now knew rather than remembered more. These findings demonstrate a shift from remembering to knowing, dependent upon level attained, type of course, and retention interval, and suggest an underlying shift in knowledge representation from episodic to semantic memory …", "num_citations": "359\n", "authors": ["17"]}
{"title": "Forgetting in recognition memory with and without recollective experience\n", "abstract": " Retention interval was manipulated in two recognition-memory experiments in which subjects indicated when recognizing a word whether its recognition was accompanied by some recollective experience (“remember”) or whether it was recognized on the basis of familiarity without any recollective experience (“know”). Experiment 1 showed that between 10 mm and 1 week, “remember” responses declined sharply from an initially higher level, whereas “know” responses remained relatively unchanged. Experiment 2 showed that between 1 week and 6 months, both kinds of responses declined at a similar, gradual rate and that despite quite low levels of performance after 6 months, both kinds of responses still gave rise to accurate discrimination between target words and lures. These findings are discussed in relationship to current ideas about multiple memory systems and processing accounts of explicit …", "num_citations": "357\n", "authors": ["17"]}
{"title": "Episodic memory and remembering in adults with Asperger syndrome\n", "abstract": " A group of adults with Asperger syndrome and an IQ-matched control group were compared in remember versus know recognition memory. Word frequency was also manipulated. Both groups showed superior recognition for low-frequency compared with high-frequency words, and in both groups this word frequency effect occurred in remembering, not in knowing. Nor did overall recognition differ between the two groups. However, recognition in the Asperger group was associated with less remembering, and more knowing, than in the control group. Since remembering reflects autonoetic consciousness, which is the hallmark of an episodic memory system, these results show that episodic memory is moderately impaired in individuals with Asperger syndrome even when overall recognition performance is not.", "num_citations": "325\n", "authors": ["17"]}
{"title": "Asperger's syndrome and memory: Similarity to autism but not amnesia\n", "abstract": " Two experiments are described in which the memory of adults with Asperger's syndrome is compared with that of verbal IQ controls. The results of the first experiment showed that the Asperger subjects resembled autistic adults and children in their failure to use category information to aid their free recall. In the second experiment, both groups of subjects showed similar priming effects in an implicit stem completion task and similar performance on an explicit cued recall task. Moreover, both groups also showed more priming for items that they had read at study and better recall for items that they had to generate at study, suggesting that the cued recall of the Asperger subjects did not result from contamination by automatic or involuntary processes.", "num_citations": "287\n", "authors": ["17"]}
{"title": "Memory: Task dissociations, process dissociations and dissociations of consciousness.\n", "abstract": " reviews and integrates recent data from [the authors'] laboratory that contribute to understanding... the relationship between task performance, retrieval strategies, and states of awareness/our data have led us to adopt a framework that makes a threefold distinction between:(a) method of testing memory as defined by task instructions (intentional vs incidental);(b) retrieval strategy (voluntary vs involuntary); and (c) subjective state of awareness with respect to the past (conscious vs unconscious)/conscious memorial states are subdivided into recollective experiences and feelings of familiarity/recollective experiences are referred to as remembering, and feelings of familiarity in the absence of recollection are referred to as knowing", "num_citations": "282\n", "authors": ["17"]}
{"title": "System and method for displaying user selected set of advertisements\n", "abstract": " A method and apparatus for displaying user selectable advertising information or other user selectable informational images on a host computer. In a preferred embodiment, a user accessing the World Wide Web via a browser application is concurrently displayed user selectable advertising information on a predefined portion of the host computer screen. In this embodiment, an advertising application is executed concurrently with the browser application. The advertising application is an object oriented program that includes a data structure for storing methods and data pointers. The methods define the creation of the dedicated portion of the user screen display for displaying the advertising information, methods for selecting the particular information to be displayed, as well as methods for accessing additional information related to the displayed advertisement images. The data pointers point to the particular …", "num_citations": "281\n", "authors": ["17"]}
{"title": "How level of processing really influences awareness in recognition memory.\n", "abstract": " Examined the effect of level of processing on awareness in recognition memory, in 3 experiments. In yes/no and 2-alternative forced-choice recognition tests, 64 young adults in UK reported 1 of 3 states of awareness when selecting each target: Remembering, knowing, or guessing. In Exps 1 and 2, Ss produced associates of the target words and recalled them after varying intervals of time. In Exp 3, the level of processing manipulation was replaced by a generate/read manipulation. In Exps 1 and 2, level of processing influenced remember responses but not know responses. In Exp 3, generating vs reading similarly influenced remember but not know responses. In each experiment, when Ss reported that they were guessing they showed no ability to discriminate targets from lures. Results show that remember/know findings generalize from yes/no to 2-alternative forced-choice recognition and that knowing is …", "num_citations": "274\n", "authors": ["17"]}
{"title": "Recognition memory and decision processes: A meta-analysis of remember, know, and guess responses\n", "abstract": " A meta-analysis of proportions of remember, know, and guess responses was carried out on observations from 86 experimental conditions in 23 different recognition memory experiments. Unlike remember and know responses, guess responses revealed no memory for the test items that elicited them. A signal detection analysis of these data showed that A′ estimates of the strength of the memory trace depended on response criteria. A′ estimates increased significantly when know responses were added to remember responses, and decreased significantly when guess responses were added to remember and know responses. It was guessing, rather than knowing, that was most strongly correlated with overall response criteria. Nor were remembering and knowing correlated significantly. These results do not support a quantitative trace strength model according to which these responses merely reflect different …", "num_citations": "252\n", "authors": ["17"]}
{"title": "Graphical user interface for displaying and manipulating objects\n", "abstract": " An intuitive graphical user interface is based upon a geographic map structure, and includes a system for controlling remote external electronic devices. In the defined graphical user interface, each space of the geographic map structure is rendered on a touch screen display as a graphic image of a geographic space. Within each space are colored cartoon-like icons called\" objects\" which can be selected and manipulated by the user. Certain objects, referred to as portals, transport the user from one space to another space when Selected. Other objects, referred to as buttons, perform associated actions or functions when Selected. The graphical user interface is displayed on a hand-held display device used to control remote devices. Each remote electronic device transmits a user interface program object that defines a graphical user interface to the display device. The hand-held display devices displays the …", "num_citations": "249\n", "authors": ["17"]}
{"title": "Method and apparatus for presenting information in a display system using transparent windows\n", "abstract": " A central processing unit (CPU) is provided and is coupled to a display for displaying graphic and other data in multiple overlapping windows. The CPU is further coupled to one or more input devices which permits a user to selectively position a cursor and input and manipulate data within each of the windows on the display. The windows include defined areas having window features such as text, icons and buttons corresponding to functions to be executed by the CPU. Multiple applications may be executed concurrently by the CPU such that each application is associated with one or more windows. Each display element (“pixel”) comprising the display is represented by multiple bits in a computer frame buffer memory coupled to the CPU. An alpha value (α) is associated with the intensity of each pixel of the display, such that multiple images may be blended in accordance with a predefined formula utilizing the …", "num_citations": "244\n", "authors": ["17"]}
{"title": "Java intermediate bytecodes: ACM SIGPLAN workshop on intermediate representations (IR'95)\n", "abstract": " Java is a programming language loosely related to C++. Java originated in a project to produce a software development environment for small distributed embedded systems. Programs needed to be small, fast,“safe” and portable. These needs led to a design that is rather different from standard practice. In particular, the form of compiled programs is machine independent bytecodes. But we needed to manipulate programs in ways usually associated with higher level, more abstract intermediate representations. This lets us build systems that are safer, less fragile, more portable, and yet show little performance penalty while still being simple.", "num_citations": "228\n", "authors": ["17"]}
{"title": "Bytecode program interpreter apparatus and method with pre-verification of data type restrictions and object initialization\n", "abstract": " A program interpreter for computer programs written in a bytecode language, which uses a restricted set of data type specific bytecodes. The interpreter, prior to executing any bytecode program, executes a bytecode program verifier procedure that verifies the integrity of a specified program by identifying any bytecode instruction that would process data of the wrong type for such a bytecode and any bytecode instruction sequences in the specified program that would cause underflow or overflow of the operand stack. If the program verifier finds any instructions that violate predefined stack usage and data type usage restrictions, execution of the program by the interpreter is prevented. After pre-processing of the program by the verifier, if no program faults were found, the interpreter executes the program without performing operand stack overflow and underflow checks and without performing data type checks on …", "num_citations": "226\n", "authors": ["17"]}
{"title": "Retrieval cues and release from proactive inhibition\n", "abstract": " The present experiment attempted to specify the locus and nature of the “release from PI” phenomenon. On the critical trial, the material to be remembered (word triads) shifted from one subset of a larger category to another subset. No release was found when subjects were provided with the general category name as a retrieval cue, but release was obtained when the appropriate subset name was given as a cue at presentation. A similar release effect was obtained when the subset cue was presented at retrieval. The results favor a retrieval explanation of the release phenomenon although it is unclear whether cues increase accessibility to the TBR material or, rather, help to discriminate current from previous items.", "num_citations": "226\n", "authors": ["17"]}
{"title": "The Java programming language\n", "abstract": " Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. It is a general-purpose programming language intended to let programmers write once, run anywhere (WORA),[17] meaning that compiled Java code can run on all platforms that support Java without the need for recompilation.[18] Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture. The syntax of Java is similar to C and C++, but has fewer low-level facilities than either of them. The Java runtime provides dynamic capabilities (such as reflection and runtime code modification) that are typically not available in traditional compiled languages. As of 2019", "num_citations": "215\n", "authors": ["17"]}
{"title": "Source memory in adolescents and adults with Asperger's syndrome\n", "abstract": " Memory difficulties in autism are observed mainly on measures like free recall, where test procedures provide no support for memory. When support is present, such as in cued recall, difficulties are less evident. Such observations may explain the mixed findings on source memory in autism. Bennetto, Pennington and Rogers (Child Development, 67, 1816–1835) found increased earlier-list intrusions in a multi-list free-recall paradigm (support absent), yet Farrant, Blades and Boucher (Journal of Autism and Developmental Disorders, 28, 43–50) reported no impairment in identification of who had spoken a particular word at study (support present). We tested the effects on source memory of presence or absence of support for source in participants with Asperger's syndrome. The Asperger participants' overall deficit in source memory was largely eliminated when source was supported at test.", "num_citations": "206\n", "authors": ["17"]}
{"title": "Maintenance rehearsal affects knowing, not remembering; elaborative rehearsal affects remembering, not knowing\n", "abstract": " In a directed-forgetting paradigm, each word in a study list was followed by a cue designating that word as eitherlearn orforget. This cue appeared after either a short or a long delay. It was assumed that a long delay would increase maintenance rehearsal of all the words, and that only the words followed by a learn cue would be rehearsed elaboratively. Moreover, because the interval between the words was constant, a short cue delay should allow more time for elaborative rehearsal. In a subsequent test, subjects maderemember orknow responses to indicate whether recognition of each word was accompanied by conscious recollection or by feelings of familiarity in the absence of conscious recollection. The hypothesis was that remembering depends on elaborative rehearsal, and knowing depends on maintenance rehearsal. In accord with this hypothesis, the learn-versus-forget designation influenced …", "num_citations": "205\n", "authors": ["17"]}
{"title": "Naltrexone for alcohol dependence: a randomized controlled trial\n", "abstract": " Aim. We examined the efficacy of naltrexone (an opioid antagonist) for alcohol dependence in a sample of alcohol‐dependent men.   \u2028Design. A 12‐week randomized placebo‐controlled clinical trial.   \u2028Setting. The outpatient clinic of a combined war veteran and general teaching hospital in Melbourne, Australia.   \u2028Participants. Male alcohol‐dependent subjects recruited from the community and from veteran groups.   \u2028Intervention. Alcohol‐dependent subjects were treated with 50 mg of naltrexone or placebo daily for 12 weeks. Both treatment groups attended a weekly education support group. Subjects were assessed weekly.   \u2028Measurements. Primary study outcomes were the maintenance of abstinence and relapse to drinking.   \u2028Findings. Fifty‐five subjects were randomized to naltrexone and 56 to placebo. Forty subjects did not complete 12 weeks of therapy (17 naltrexone, 23 placebo). In the intention‐to …", "num_citations": "194\n", "authors": ["17"]}
{"title": "Algebraic constraints\n", "abstract": " Constraints are a way of expressing relationships among objects; satisfying a set of constraints involves finding an assignment of values to variables that is consistent with the constraints. In its full generality, constructing a constraint satisfaction algorithm is a hopeless task. This dissertation focuses on the problem of performing constraint satisfaction in an interactive graphical layout system. It takes a pragmatic approach and restrics itself to a narrow but very useful domain. The algorithms used by MAGRITTE, an editor for simple line drawings, are presented. A major portion of the work concerns the algebraic transformation of sets of constraints. It describes algorithms for identifying difficult subregions of a constraint graph and replacing them with a transformed and simplified new constraint.", "num_citations": "190\n", "authors": ["17"]}
{"title": "Involuntary conscious memory and the method of opposition\n", "abstract": " Priming in an indirect test of stem completion should reflect involuntary memory, but can be accompanied by conscious awareness of the past (involuntary conscious memory) or unaccompanied by such awareness (involuntary unconscious memory). We adapted the method of opposition developed by Jacoby, Woloshyn, and Kelley (1989) to obtain a measure of stem-completion priming that should reflect only involuntary unconscious memory. Subjects completed stems with the first word coming to mind, but wrote down a different word if the word that came to mind first had been previously encountered. Facilitatory priming was expected only when involuntary unconscious influences outweighed inhibitory effects of involuntary conscious memory, or of intentional retrieval. We observed a facilitation effect for items processed graphemically at encoding, in conjunction with an inhibition effect for items processed …", "num_citations": "189\n", "authors": ["17"]}
{"title": "Recognition memory and awareness: A large effect of study-test modalities on “know” responses following a highly perceptual orienting task\n", "abstract": " Two experiments investigated the effects of varying the correspondence between presentation and test modes on states of conscious awareness in recognition memory. Experiment 1 used visual test items and showed that auditory and visual study modes differentially affected recollective experience and feelings of familiarity assessed by “remember” and “know” responses accompanying recognition: “know” responses were slightly enhanced following visual presentation, but this was largely offset by a similarly small increase in “remember” responses. Experiment 2 employed conditions designed to maximise any effect on “know” responses of the correspondence between presentation and test modes by using a highly perceptual orienting task at study. Under these conditions, there was a large mode correspondence effect on “know” responses. The results support the idea that “know” responses are …", "num_citations": "185\n", "authors": ["17"]}
{"title": "Apparatus and method for dynamically generating information with server-side software objects\n", "abstract": " A method and apparatus for operating a local server computer of a client-server network includes a technique to receive a request from a client computer of the client-server network. A determination is made whether the request requires dynamically generated information from a servlet object of the client-server network. If so, a specified servlet object corresponding to the request may be uploaded from a remote server computer of the client-server network. The specified servlet object is then executed to obtain dynamically generated information corresponding to the request.", "num_citations": "182\n", "authors": ["17"]}
{"title": "An appreciation of generate-recognize theory of recall\n", "abstract": " This paper offers a critical appreciation of the theory that the recall of an event entails a generation (or search) process followed by a recognition (or decision) process. The theory provides an elegant account of a variety of experimental findings. On the other hand, the results of a large number of studies run counter to its predictions or are otherwise not readily accommodated by it. It is suggested that the general notion of recall as generation-plus-recognition should be retained as a useful model, but not as a theory to be held strictly accountable to the data.", "num_citations": "182\n", "authors": ["17"]}
{"title": "Free recall in autism spectrum disorder: The role of relational and item-specific encoding\n", "abstract": " Autism spectrum disorders (ASDs) are characterised by a relatively specific pattern of typical and atypical memory functioning. Convergent behavioural and neuroscientific evidence indicates that this pattern of functioning may be the result of specific impairments in hippocampally mediated relational memory processes, whilst brain-mechanisms mediating item-specific memory processes remain intact. In the current paper we draw on a behavioural paradigm developed by Hunt and Seta [Hunt, R. R., & Seta, C. E. (1984). Category size effects in recall—The roles of relational and individual item information. Journal of Experimental Psychology: Learning, Memory and Cognition, 10, 454–464], which not only allowed us to determine whether individuals with ASD did indeed experience selective difficulties in relational processes, but in addition enabled us to gain insights into the severity of this impairment. Our results …", "num_citations": "158\n", "authors": ["17"]}
{"title": "System and method for locating object view and platform independent object\n", "abstract": " A class loader downloads objects and object viewers from remote computer nodes, and invokes locally stored object viewers to view objects. When a user selects an object to view, a conventional downloading of the referenced object is initiated. The class loader, however, utilizes data type information received at the beginning of the object downloading process to determine if a viewer for the referenced object is available on the user's workstation. If an appropriate view is not locally available, the class loader automatically locates an appropriate viewer on the server from which the object is being downloaded, or from any other appropriate server known to the user's workstation. The class loader downloads the located viewer and then invokes a program verification procedure to verify the integrity of the downloaded viewer before the viewer is executed. Once a viewer has been verified, the viewer is added to the …", "num_citations": "151\n", "authors": ["17"]}
{"title": "Recognition memory and awareness: An experiential approach\n", "abstract": " This article reviews recent studies that have adopted an experiential approach to recognition memory and awareness. This approach measures two subjective states of awareness in recognition memory, remembering (or conscious recollection) and knowing (or familiarity). There is now evidence of quite a few experimental dissociations between these two states of awareness. These dissociations impose additional constraints on theories about relations between awareness and memory systems or processes.", "num_citations": "148\n", "authors": ["17"]}
{"title": "Memory illusions: false recall and recognition in adults with Asperger's syndrome.\n", "abstract": " As persons on the autistic spectrum are known not to use semantic features of word lists to aid recall, they might show diminished susceptibility to illusory memories that typically occur with lists of associated items. Alternatively, since such individuals also have poor source monitoring, they might show greater susceptibility. The authors found that adults with Asperger's syndrome (n= 10) recalled similar proportions of a nonpresented strong associate of the study list items, compared with controls (n= 15). In Experiment 2, rates of true and false recognition of study list associates did not differ significantly between Asperger (n= 10) and control (n= 10) participants. Moreover, the Asperger participants made fewer remember and more know judgments than controls for veridical but not for false recognitions. Thus, deficits found in some aspects of memory in people with Asperger's syndrome do not affect their susceptibility to …", "num_citations": "131\n", "authors": ["17"]}
{"title": "Factors affecting conscious awareness in the recollective experience of adults with Asperger’s syndrome\n", "abstract": " Bowler, Gardiner, and Grice (2000a) have shown a small but significant impairment of autonoetic awareness or remembering involved in the episodic memory experiences of adults with Asperger’s syndrome. This was compensated by an increase in experiences of noetic awareness or knowing. The question remains as to whether the residual autonoetic awareness in Asperger individuals is qualitatively the same as that of typical comparison participants. Three experiments are presented in which manipulations that have shown differential effects on different kinds of conscious awareness in memory in typical populations are employed with a sample of adults with Asperger’s syndrome. The results suggest that the experiences of remembering reported by such individuals, although reduced in quantity, are qualitatively similar to those seen in the typical population. The results are discussed in the context of current …", "num_citations": "126\n", "authors": ["17"]}
{"title": "Cross-modality priming in stem completion reflects conscious memory, but not voluntary memory\n", "abstract": " A comparison of incidental and intentional stem-completion tests confirmed that cross-modality priming occurs when performance conforms completely to the retrieval intentionality criterion, indicating involuntary—not voluntary—retrieval in the incidental test. However, an on-line measure of awareness in the incidental test, and a process-dissociation analysis of the intentional test, indicated only within-modality, but not cross-modality, transfer of involuntary retrieval that is unaccompanied by memorial awareness. These results imply that conscious memory should not be equated with voluntary retrieval, and unconscious memory should not be equated with involuntary retrieval, because involuntary retrieval can be accompanied by memorial awareness.", "num_citations": "124\n", "authors": ["17"]}
{"title": "Semantic memory and the generation effect: Some tests of the lexical activation hypothesis.\n", "abstract": " Three experiments, with 128 undergraduates, examined the finding that a word from a list is more likely to be recalled if it was self-generated rather than read. This generation effect has been attributed to semantic memory and, more particularly, to the enhanced activation of the semantic features comprising a word's representation in the subjective lexicon. Results show that a similar generation effect occurred for meaningful but not for meaningless letter bigrams (eg, ET vs EC), for unitized but not for nonunitized 2-digit numbers (eg, 28 vs 2, 8), and for familiar but not for unfamiliar noun compounds (eg, cheesecake vs cheese ketchup). Findings indicate that semantic memory involvement is critical to the generation effect only in that the item to be recalled must form some integrated functional unit. Representation in the subjective lexicon is neither a necessary nor a sufficient condition for the effect to emerge. It is …", "num_citations": "123\n", "authors": ["17"]}
{"title": "Depth-of-processing effects on priming in stem completion: tests of the voluntary-contamination, conceptual-processing, and lexical-processing hypotheses.\n", "abstract": " Depth-of-processing effects on incidental perceptual memory tests could reflect (a) contamination by voluntary retrieval,(b) sensitivity of involuntary retrieval to prior conceptual processing, or (c) a deficit in lexical processing during graphemic study tasks that affects involuntary retrieval. The authors devised an extension of incidental test methodology—making conjunctive predictions about response times as well as response proportions—to discriminate among these alternatives. They used graphemic, phonemic, and semantic study tasks, and a word-stem completion test with incidental, intentional, and inclusion instructions. Semantic study processing was superior to phonemic study processing in the intentional and inclusion tests, but semantic and phonemic study processing produced equal priming in the incidental test, showing that priming was uncontaminated by voluntary retrieval—a conclusion reinforced by …", "num_citations": "122\n", "authors": ["17"]}
{"title": "Generation and priming effects in word-fragment completion.\n", "abstract": " Priming effects in word-fragment completion were enhanced when at study subjects generated rather than read the words. This generation effect occurred when the same fragments used at test were also used in generating the words at study. When different fragments were used at study and at test, generate and read conditions gave rise to similiar priming effects, but these same study conditions led to typical generation effects in recognition memory. These findings of a generation effect in an implicit as opposed to an explicit memory test support the view that generating a study item may enhance data-driven as well as conceptually driven processing, and they provide further evidence of the usefulness of this process distinction in relating implicit to explicit memory performance.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "122\n", "authors": ["17"]}
{"title": "The NeWS book: an introduction to the network/extensible window system\n", "abstract": " This book is an introduction to NeWS: the Networked, Extensible, Window System from Sun Microsystems. It is oriented towards people who have a basic knowledge of programming and window systems who would like to understand more about window systems in general and NeWS in particular. A significant portion of the book is devoted to an overview and history of window systems. While there is enough detail here to allow readers to write simple NeWS applications, the NeWS Reference Manual [SUN87a] should be consulted for a more complete treatment. This book was written to refer to the NeWS 1. 1 product, available from Sun and also available from several non-Sun suppliers. Shortly after this book is published, Sun will be releasing the next version of NeW-the Xll/NeWS merged window system. Chapter 10 is dedicated to an overview of that product, but Xll/NeWS deserves a book of its own. All the code examples in this book have been tested on both NeWS and the Xll/NeWS merge. Should there be another edition of this book, we will discuss some of the new development being done in the user interface tool kit area on NeWS. Significantly, the NeWS Development Environment (NDE) is now being developed at Sun; NDE promises to eclipse existing user interface toolkit designs and window programming environments.", "num_citations": "118\n", "authors": ["17"]}
{"title": "When auditory memory is not overwritten\n", "abstract": " The effect of auditory as opposed to visual presentation was explored in a free recall paradigm in which each list word was preceded and followed by a period of oral distractor activity. Contrary to expectations, the modality effect was obtained. That is, there was an auditory advantage confined to recency items. This effect was found in each of a series of experiments designed to test its generality. These results are inconsistent with current theoretical accounts of the modality effect.", "num_citations": "117\n", "authors": ["17"]}
{"title": "Retrieval volition and memorial awareness in stem completion: An empirical analysis.\n", "abstract": " Tested the hypothesis that involuntary conscious memory causes studied words to be omitted in an opposition test, but not in an incidental test, so that the difference in priming between tests is a measure of involuntary conscious memory. Supporting data were obtained by making overt the mental activities that occurred covertly in an opposition test with 72 college students. An on-line recognition measure in an incidental test showed a strong advantage of semantic over graphemic processing. Conditionalizing on recognition failure resulted in accurate estimates of opposition performance. Also, stems were completed much more rapidly in incidental and opposition tests than in an intentional test, in which voluntary retrieval was engaged. The data provide further evidence that retrieval volition is dissociable from memorial state of awareness.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "114\n", "authors": ["17"]}
{"title": "Further evidence for a negative recency effect in free recall\n", "abstract": " The results of a previous experiment had indicated that the final words in a free-recall list were retrieved least well in a second recall session. This “negative recency effect” was found to hold for reminiscence items and, to some extent, for prior list intrusions in recall. Two further experiments showed that words retrieved in free recall were subsequently recognized less well if they had been presented late in their original input list. There was some evidence that a pattern of primacy and negative recency also held for the recognition of words not retrieved in free recall. It was concluded that terminal words in a free-recall list, although best recalled immediately, are thereafter least available in memory.", "num_citations": "112\n", "authors": ["17"]}
{"title": "Effects of related and unrelated context on recall and recognition by adults with high-functioning autism spectrum disorder\n", "abstract": " Memory in autism spectrum disorder (ASD) is characterised by greater difficulties with recall rather than recognition and with a diminished use of semantic or associative relatedness in the aid of recall. Two experiments are reported that test the effects of item–context relatedness on recall and recognition in adults with high-functioning ASD (HFA) and matched typical comparison participants. In both experiments, participants studied words presented inside a red rectangle and were told to ignore context words presented outside the rectangle. Context words were either related or unrelated to the study words. The results showed that relatedness of context enhanced recall for the typical group only. However, recognition was enhanced by relatedness in both groups of participants. On a behavioural level, these findings confirm the Task Support Hypothesis [Bowler, D. M., Gardiner, J. M., & Berthollier, N. (2004). Source …", "num_citations": "111\n", "authors": ["17"]}
{"title": "Effects of breakfast meal composition on second meal metabolic responses in adults with type 2 diabetes mellitus\n", "abstract": " Objective:We tested the relative importance of a low-glycemic response versus a high glycemic response breakfast meal on postprandial serum glucose, insulin and free fatty acid (FFA) responses after consumption of a standardized mid-day meal in adult individuals with Type 2 diabetes mellitus (DM).Design:Following an overnight fast of 8–10 h, a randomized crossover intervention using control and test meals was conducted over a 3-week-period. A fasting baseline measurement and postprandial measurements at various time intervals after the breakfast and mid-day meal were taken.Subjects:Forty-five Type 2 DM subjects completed the requirements and were included in the study results.Interventions:Two different breakfast meals were administered during the intervention:(A) a high glycemic load breakfast meal consisting of farina (kJ 1833; carbohydrate (CHO) 78 g and psylium soluble fiber 0 g),(B) a low …", "num_citations": "108\n", "authors": ["17"]}
{"title": "System and method for pre-verification of stack usage in bytecode program loops\n", "abstract": " The present invention provides a verifier for use in conjunction with programs utilizing data type specific bytecodes for verifying the proper operation of the executable program prior to actual execution by a host processor. A verifier is provided which includes a virtual stack for temporarily storing stack information which parallels the typical stack operations required during the execution a bytecode program. The verifier also includes a stack snapshot storage structure having a snapshot directory and stack snapshot storage area for storing the state of the virtual stack at various points during program verification so as to assure proper stack manipulations by the source program. A two step source program verification process is provided for in which the source program is initially loaded into the verifier and a first pass source program evaluation is performed. During the first pass, the addresses of all source program …", "num_citations": "108\n", "authors": ["17"]}
{"title": "Further evidence of preserved priming and impaired recall in adults with Asperger's syndrome\n", "abstract": " Two experiments compared incidental (implicit) and intentional (explicit) memory performance in adults with Asperger's syndrome and individually matched controls. Experiment 1 involved perceptual tests using word fragment cues, following study tasks in which the participants either generated the words from contextual cues or read the words alone, with no contextual cues. Experiment 2 involved conceptual tests using paired associate cues, following study tasks in which the paired associates were rated either for their relatedness or for their readability. Performance in both the incidental tests was similar for both groups. Performance in both the intentional tests was also similar for both groups, with one exception. The adults with Asperger's syndrome were more likely to falsely recall words that had not actually been studied. These findings further delimit the nature of memory impairments in adults with …", "num_citations": "107\n", "authors": ["17"]}
{"title": "On reporting recollective experiences and “direct access to memory systems”\n", "abstract": " Strack and F$oUrster (1995) showed that, unlike remember responses, know responses in recognition memory were influenced by manipulating response bias. We describe an experiment that replicated theirs but additionally allowed subjects to report guesses. Only guess responses were influenced by this manipulation. Response bias had no effects on either know or remember responses. This outcome suggests that manipulating response bias influences know responses only when guessing is encouraged but not reported as such. Moreover, though know responses reflected memory for the study events, guess responses did not.", "num_citations": "106\n", "authors": ["17"]}
{"title": "Repetition of previously novel melodies sometimes increases both remember and know responses in recognition memory\n", "abstract": " Recognition memory for previously novel melodies was tested in three experiments in which subjects usedremember andknow responses to report experiences of recollection, or of familiarity in the absence of recollection, for each melody they recognized. Some of the melodies were taken from Polish folk songs and presented vocally, but without the words. Others were taken from obscure pieces of classical music, presented as single-line melodies. Prior to the test, the melodies were repeated for varying numbers of study trials. Repetition of the Polish melodies increased both remember and know responses, while repetition of classical melodies increased remember but not know responses. When subjects were instructed to report guesses, guess responses were inversely related to remember and know responses and there were more guesses to lures than to targets. These findings establish that …", "num_citations": "106\n", "authors": ["17"]}
{"title": "Effects of lorazepam upon recollective experience in recognition memory\n", "abstract": " The effects of lorazepam (2 mg) and placebo upon recognition memory with and without conscious recollection were assessed in a cross-over study with normal volunteers. When recognising a word from study lists presented before and 1, 3 and 5 h after drug administration, subjects were required to indicate whether they could consciously recollect the word's prior occurrence or recognised it on the basis of “knowing”; in the absence of conscious recollection. Lorazepam only impaired word recognition which was accompanied by conscious recollection, and further, the level of this impairment correlated significantly with each of three different indices of subjects' arousal at the time of presentation of each list. Recognition in the absence of conscious recollection was not impaired but somewhat heightened by lorazepam, and these effects did not significantly relate to any index of arousal. These findings are …", "num_citations": "105\n", "authors": ["17"]}
{"title": "Cognitive functioning in children with early onset type 1 diabetes and severe hypoglycemia\n", "abstract": " ObjectiveTo investigate whether severe hypoglycemia in young children with early-onset type 1 diabetes (T1DM) is associated with subsequent abnormalities in cognitive status.Study designRecruitment was from a large population-based database of children and adolescents with T1DM. Children and adolescents with early-onset T1DM (<6 years) were eligible for the study. Diabetic individuals (n = 41) with a prospectively documented history of seizure or coma were compared with peers with no history of severe hypoglycemic events (n = 43). A comprehensive test battery of learning and memory was used together with intellectual and behavioral measures.ResultsNo significant group differences were revealed on the intellectual, memory, or behavioral measures. Similarly, those participants with a history of early first seizure did not differ from their peers with no seizures. There were no significant group differences …", "num_citations": "103\n", "authors": ["17"]}
{"title": "Priming and aging: Further evidence of preserved memory function\n", "abstract": " Priming effects in word-stem completion were compared with cued recall in young and older adults. Cued recall showed large effects of age and also of levels of processing, but these variables had little influence on priming in word-stem completion. Free recall showed large effects of age as well as superior recall for words that had been generated rather than read at study, but priming in word-stem completion was little influenced by age, and it was greater for words that had been read at study rather than generated. These findings were interpreted as providing further evidence that age-related impairments in memory performance are greatly reduced in implicit compared with explicit tests. They also provide convergent evidence for classifying word-stem completion as a data-driven rather than conceptually driven task.", "num_citations": "102\n", "authors": ["17"]}
{"title": "Compiler system and method for resolving symbolic references to externally located program files\n", "abstract": " A program compiler identifies each symbol in a source program that references another program. For each identified symbol, the compiler determines whether the symbol is a reference to a remotely located file or to a locally stored file. If the identified symbol is a reference to a remotely located file, it constructs a file location identifier, such as a URL, for the identified symbol, performs a file location identifier based fetch of the remotely locate file, and ads at least a portion of the fetched file to a set of program code to be compiled if the fetch is successfully performed. If the identified symbol is a reference to a locally stored file, it performs a file fetch for the locally stored file, adding at least a portion of the fetched file to the set of program code to be compiled if the file fetch is successfully performed. If the fetch is unsuccessful, compilation of the source program is aborted. When a client computer attempts to initiate execution …", "num_citations": "101\n", "authors": ["17"]}
{"title": "Functional aspects of recollective experience in face recognition\n", "abstract": " This article describes two experiments on awareness in recognition memory for novel faces. Two kinds of awareness, recollective experience and feelings of familiarity in the absence of recollective experience, were measured by \"remember\" and \"know\" responses. Experiment 1 showed that \"remember\" but not \"know\" responses were reduced by divided attention at study. Experiment 2 showed that massed versus spaced repetition of faces in the study list had the opposite effects on \"remember\" and \"know\" responses. Massed repetition increased \"know\" responses and reduced \"remember\" responses. Spaced repetition increased \"remember\" responses and reduced \"know\" responses. The results of both experiments replicate previous findings from the verbal domain in the domain of face recognition, and hence they increase the ecological validity of this experiential approach to memory and awareness and the …", "num_citations": "100\n", "authors": ["17"]}
{"title": "Method and apparatus for presenting information in a display system using transparent windows\n", "abstract": " A central processing unit (CPU) is provided and is coupled to a display for displaying graphic and other data in multiple overlapping windows. The CPU is further coupled to one or more input devices which permits a user to selectively position a cursor and input and manipulate data within each of the windows on the display. The windows include defined areas having window features such as text, icons and buttons corresponding to functions to be executed by the CPU. Multiple applications may be executed concurrently by the CPU such that each application is associated with one or more windows. Each display element (“pixel”) comprising the display is represented by multiple bits in a computer frame buffer memory coupled to the CPU. An alpha value (α) is associated with the intensity of each pixel of the display, such that multiple images may be blended in accordance with a predefined formula utilizing the …", "num_citations": "93\n", "authors": ["17"]}
{"title": "Recognition memory with little or no remembering: Implications for a detection model\n", "abstract": " Remembering and knowing are two states of awareness that reflect autonoetic and noetic consciousness. Recent extensions of signal detection theory have attempted to fitremember andknow responses, which measure these states of awareness, to a continuum of trace strength or familiarity. The model assumes there are two response criteria, a remembering criterion, which is more strict, and a recognition criterion, which is more lenient and leads to any positive recognition response. The most important prediction of this model is that bias-free estimates of memory should be the same whether derived from overall hit and false alarm rates or fromremember hit and false alarm rates. We describe evidence that disconfirms this prediction and discuss other findings that the model cannot accommodate.", "num_citations": "93\n", "authors": ["17"]}
{"title": "Response deadline and subjective awareness in recognition memory\n", "abstract": " Level of processing and generation effects were replicated in separate experiments in which recognition memory was tested using either short (500 ms) or long (1500 ms) response deadlines. These effects were similar at each deadline. Moreover, at each deadline these effects were associated with subsequent reports of remembering, not of knowing. And reports of both knowing and remembering increased following the longer deadline. These results imply that knowing does not index an automatic familiarity process, as conceived in some dual-process models of recognition, and that both remembering and knowing increase with the slower, more controlled processing permitted by the longer response time.", "num_citations": "87\n", "authors": ["17"]}
{"title": "System for transmission of embedded applications over a network\n", "abstract": " A system and method for transmitting embedded applications over a network is disclosed, wherein a user of a computer-controlled network client, such as a remote control device used for controlling a network of computer-controlled home entertainment devices, or a Web browser running on a Web client, can request and receive compound documents that include embedded applications and/or data files that can only be processed (ie, imaged or played) by handlers that are not resident on the client. In addition to embedded documents, the compound documents that are transmitted over the network can reference flat files (eg, image, audio, or text files), and other compound documents. Whenever a client receives a compound document, the client determines whether it has access to all of the documents referenced in the compound document and, if not, requests the documents to which it does not have local access …", "num_citations": "85\n", "authors": ["17"]}
{"title": "A generation effect with numbers rather than words\n", "abstract": " It has previously been shown that a word from a list is more likely to be remembered if the word was generated, rather than read, by the subject. Two simple experiments that show that a similar generation effect occurs in remembering answers to multiplication sums are described. It is suggested that this finding is inconsistent with a strong version of a lexical activation hypothesis that had been proposed to account for the generation effect. According to that hypothesis, the generation effect is due to enhanced activation of the semantic features of a word’s representation in the subjective lexicon.", "num_citations": "85\n", "authors": ["17"]}
{"title": "Components of conscious awareness in a long‐term modality effect\n", "abstract": " The advantage in long‐term recognition memory of words vocalized at study over those read silently was investigated by requiring subjects to indicate when recognizing a word whether or not they could consciously recollect its prior occurrence. The advantage for vocalization occurred only for words which subjects indicated were accompanied by recollective experience, and the results were not affected by whether subjects vocalized the test words or read them silently. It is concluded that this modality effect, and possibly other similar ones, originate in episodic memory and not in a procedural or ‘quasimemory’ system. Differences between the present results and those obtained elsewhere using intentional learning instructions are discussed.", "num_citations": "83\n", "authors": ["17"]}
{"title": "Charting the acquisition of semantic knowledge in a case of developmental amnesia\n", "abstract": " We report the acquisition and recall of novel facts by Jon, a young adult with early onset developmental amnesia whose episodic memory is gravely impaired due to selective bilateral hippocampal damage. Jon succeeded in learning some novel facts but compared with a control group his intertrial retention was impaired during acquisition and, except for the most frequently repeated facts, he was also less accurate in correctly sourcing these facts to the experiment. The results further support the hypothesis that despite a severely compromised episodic memory and hippocampal system, there is nevertheless the capacity to accrue semantic knowledge available to recall.", "num_citations": "81\n", "authors": ["17"]}
{"title": "On recency and echoic memory\n", "abstract": " In short-term memory, the tendency for the last few (recency) items from a verbal sequence to be increasingly well recalled is more pronounced if the items are spoken rather than written. This auditory recency advantage has been quite generally attributed to echoic memory, on the grounds that in the auditory, but not the visual, mode, sensory memory persists just long enough to supplement recall of the most recent items. This view no longer seems tenable. There are now several studies showing that an auditory recency advantage occurs not only in long-term memory, but under conditions in which it cannot possibly be attributed to echoic memory. Also, similar recency phenomena have been discovered in short-term memory when the items are lip-read, or presented in sign-language, rather than heard. This article provides a partial review of these studies, taking a broad theoretical position from which these …", "num_citations": "80\n", "authors": ["17"]}
{"title": "Subjective organisation in the free recall learning of adults with Asperger’s syndrome\n", "abstract": " Single trial methods reveal unimpaired free recall of unrelated words in Asperger’s syndrome (AS). When repeated trials are used (free recall learning), typical individuals show improved recall over trials, subjective organisation of material (SO) and a correlation between free recall and SO. We tested oral (Experiment 1) and written (Experiment 2) free recall over 16 trials in adults with AS and typical individuals. Across both experiments AS participants showed marginally diminished recall. Poorer SO was seen in the Asperger group only in Experiment 2, but in both experiments, individual differences in SO in the Asperger group were less likely to converge over trials. This lack of convergence suggests that the AS group organise material in idiosyncratic ways.", "num_citations": "79\n", "authors": ["17"]}
{"title": "Exceptions to recognition failure of recallable words\n", "abstract": " Results of many experiments that conform with the recognition failure paradigm have yielded a systematic relation between the proportion of all words that are recognized and the proportion of recalled words that are recognized. In two experiments described here, the proportion of recalled words recognized was found to be much higher than expected on the basis of this relation when lists composed of pairs of abstract words or digit—word pairs were presented under typical study conditions of the paradigm. Under special study conditions, however, it was found that the proportion of recalled words that are recognized approximated more closely to expected values. Thus, exceptions to the general pattern of results were obtained and, more important, shown to depend primarily on encoding operations rather than on properties of materials as such. Theoretical explanations of recognition failure were evaluated with …", "num_citations": "77\n", "authors": ["17"]}
{"title": "Levels of awareness and varieties of experience\n", "abstract": " The theme of this book is consciousness and cognition, with an emphasis on stratiﬁcation. Our contribution is to discuss in this chapter some recent developments in one popular though controversial approach to studying consciousness in relation to memory. The approach is an experiential one, introduced by Tulving (1985) with his distinction between remember and know responses. Remember and know responses are subjective reports of the kinds of experiences that occur during memory retrieval. Experiences that are characterized by the speciﬁc recollection of contextual details involving one’s self at a particular time, in a particular place, are deﬁned as remembering. Experiences of memory that lack these characteristics but are characterized instead by a more abstract awareness of familiarity are deﬁned as knowing. In Tulving’s (1983, 1985) theory, these two kinds of experience reﬂect two kinds of consciousness, autonoetic and noetic consciousness, which in turn reﬂect distinct episodic and semantic memory systems.", "num_citations": "75\n", "authors": ["17"]}
{"title": "Memory for remembered events: An assessment of output monitoring in free recall\n", "abstract": " This study describes an output monitoring phenomenon in free recall and establishes that subjects have accurate knowledge concerning their previous output performance. Following a series of immediate free recall trials subjects were given a “recall-recognition” test in which all the originally presented words were re-presented. The subjects were required to discriminate between those words they had initially recalled and those they had not. Signal detection methods were used to analyze the recall-recognition test scores. The main finding was the very much poorer knowledge of recall of recency items compared with that for items presented earlier in the free recall lists. The implications of this “memory for remembered events” phenomenon with respect to other known memory phenomena are discussed.", "num_citations": "75\n", "authors": ["17"]}
{"title": "Apparatus and method for processing servlets\n", "abstract": " A method and apparatus for operating a local server computer of a client-server network includes a technique to receive a request from a client computer of the client-server network. A determination is made whether the request requires dynamically generated information from a servlet object of the client-server network. If so, a specified servlet object corresponding to the request may be uploaded from a remote server computer of the client-server network. The specified servlet object is then executed to obtain dynamically generated information corresponding to the request.", "num_citations": "72\n", "authors": ["17"]}
{"title": "Age differences in memory for prospective compared with retrospective subject-performed tasks\n", "abstract": " In two experiments, younger and older adults studied three lists of verbal phrases, each of the latter describing a simple action. One list was studied and recalled verbally; one was recalled verbally, but the actions were performed at study [retrospective SPTs (subject-performed tasks)]; and one was studied verbally and the actions were performed at test (prospective SPTs). With long lists, but not with short ones, retrospective-SPT recall exceeded verbal recall and older adults recalled fewer SPTs than did younger adults. Prospective-SPT recall did not exceed verbal recall at either list length, and in each of these prospective-SPT tests, older adults recalled fewer action phrases than did younger adults. Thus, it appears that when retrospective and prospective tasks are equated there are marked age differences that are generally consistent with the view that memory impairment in the elderly is more likely to …", "num_citations": "72\n", "authors": ["17"]}
{"title": "Binding of multiple features in memory by high-functioning adults with autism spectrum disorder\n", "abstract": " Diminished episodic memory and diminished use of semantic information to aid recall by individuals with autism spectrum disorder (ASD) are both thought to result from diminished relational binding of elements of complex stimuli. To test this hypothesis, we asked high-functioning adults with ASD and typical comparison participants to study grids in which some cells contained drawings of objects in non-canonical colours. Participants were told at study which features (colour, item, location) would be tested in a later memory test. In a second experiment, participants studied similar grids and were told that they would be tested on object-location or object-colour combinations. Recognition of combinations was significantly diminished in ASD, which survived covarying performance on the Color Trails Test (D’Elia et al. Color trails test. Professional manual. Psychological Assessment Resources, Lutz, 1996), a test …", "num_citations": "68\n", "authors": ["17"]}
{"title": "Deficits in free recall persist in Asperger’s syndrome despite training in the use of list-appropriate learning strategies\n", "abstract": " Free recall in adults with Asperger’s Syndrome (AS) was compared with that in matched controls in an experiment including semantically similar, phonologically similar and unrelated word lists. Without supportive instructions, adults with AS were significantly impaired in their recall of phonologically and semantically related lists, but not unrelated lists. Even when trained to make use at study of the relations among the words, the adults with AS recalled fewer words than the control group. Participants rehearsed the study lists out loud and the rehearsal data was analysed. Despite a very slight trend for adults with AS to engage in less elaborative rehearsal and more rote rehearsal, their rehearsal did not differ significantly from that of controls.", "num_citations": "68\n", "authors": ["17"]}
{"title": "Bytecode program interpreter apparatus and method with pre-verification of data type restrictions\n", "abstract": " A program interpreter for computer programs written in a bytecode language, which uses a restricted set of data type specific bytecodes. The interpreter, prior to executing any bytecode program, executes a bytecode program verifier procedure that verifies the integrity of a specified program by identifying any bytecode instruction that would process data of the wrong type for such a bytecode and any bytecode instruction sequences in the specified program that would cause underflow or overflow of the operand stack. If the program verifier finds any instructions that violate predefined stack usage and data type usage restrictions, execution of the program by the interpreter is prevented. After pre-processing of the program by the verifier, if no program faults were found, the interpreter executes the program without performing operand stack overflow and underflow checks and without performing data type checks on …", "num_citations": "66\n", "authors": ["17"]}
{"title": "Specificity and generality of enhanced priming effects for self-generated study items\n", "abstract": " In two experiments, we investigated the finding that priming effects in word-fragment completion are enhanced for self-generated study items. The first experiment showed that priming in word-fragment completion was not reliably enhanced unless words were generated at study from a fragment identical to that used at test. The second experiment showed that priming in an anagram-solving task was similarly enhanced by anagram solving at study. These generation effects, therefore, seem highly specific with respect to stimulus identity but readily generalizable with respect to task. Theoretically, these findings are consistent with both transfer-appropriate processing and memory-systems accounts of performance in implicit memory tests.", "num_citations": "63\n", "authors": ["17"]}
{"title": "Memory for remembered events: Effects of response mode and response-produced feedback\n", "abstract": " This study explored the extent and accuracy of the subject's knowledge of his previous recall performance as a function of response mode and response-produced feedback. In a series of immediate free recall trials, different groups of subjects were required to respond orally, to write down their responses, or to respond in both oral and written modes. On half of the trials recall was under conditions designed to impair response-produced feedback. All subjects were then re-presented with the original items and asked to indicate those they had recalled earlier. Recognition of previously recalled items was most accurate following oral plus written recall, least accurate following oral recall. Impaired feedback led to poorer knowledge of previous recall in each response mode. These results support the conclusion that the nature of the memory trace following recall cannot be adequately described solely in terms of temporal …", "num_citations": "62\n", "authors": ["17"]}
{"title": "Impact of encoding depth on awareness of perceptual effects in recognition memory\n", "abstract": " Pictorial stimuli are more likely to be recognized if they are the same size, rather than a different size, at study and at test. This size congruency effect was replicated in two experiments in which the encoding variables were respectively undivided versus divided attention and level of processing. In terms of performance, these variables influenced recognition and did not influence size congruency effects. But in terms of awareness, measured by remember and know responses, these variables did influence size congruency effects. With undivided attention and with a deep level of processing, size congruency effects occurred only in remembering. With divided attention and with a shallow level of processing, size congruency effects occurred only in knowing. The results show that effects that occur in remembering may also occur independently in knowing. They support theories in which remembering and knowing …", "num_citations": "61\n", "authors": ["17"]}
{"title": "Impairment of recollection but not familiarity in a case of developmental amnesia\n", "abstract": " In a re-examination of the recognition memory of Jon, a young adult with developmental amnesia due to perinatal hippocampal damage, we used a test procedure that provides estimates of the separate contributions to recognition of recollection and familiarity. Comparison between Jon and his controls revealed that, whereas he was unimpaired in the familiarity process, he showed abnormally low levels of recollection, supporting the view that the hippocampus mediates the latter process selectively.", "num_citations": "58\n", "authors": ["17"]}
{"title": "Dynamic generation of information using servlet object\n", "abstract": " A method and apparatus for operating a local server computer of a client-server network includes a technique to receive a request from a client computer of the client-server network. A determination is made whether the request requires dynamically generated information from a servlet object of the client-server network. If so, a specified servlet object corresponding to the request may be uploaded from a remote server computer of the client-server network. The specified servlet object is then executed to obtain dynamically generated information corresponding to the request.", "num_citations": "55\n", "authors": ["17"]}
{"title": "Multiple list learning in adults with autism spectrum disorder: parallels with frontal lobe damage or further evidence of diminished relational processing?\n", "abstract": " To test the effects of providing relational cues at encoding and/or retrieval on multi-trial, multi-list free recall in adults with high-functioning autism spectrum disorder (ASD), 16 adults with ASD and 16 matched typical adults learned a first followed by a second categorised list of 24 words. Category labels were provided at encoding, retrieval, both or not at all. Both groups showed enhanced recall when labels were available during encoding or throughout the task. ASD individuals showed reduced recall of the second list and reduced clustering. Clustering and recall were correlated in both groups, which also showed similar levels of subjective organisation. The findings are discussed in relation to theories of frontal and medial temporal lobe contributions to memory in ASD.", "num_citations": "54\n", "authors": ["17"]}
{"title": "El lenguaje de programación Java\n", "abstract": " Palabras clave: CLASES Y OBJETOS, EXTENSION DE CLASES, INTERFACES, CLASE O INTERFACES ANIDADOS, TOKENS-OPERADORES Y EXPRESIONES, FLUJO DE CONTROL, EXCEPCIONES, CADENAS DE TEXTO, HILOS, PROGRAMACION CON TIPOS, RECOGIDA DE BASURA Y MEMORIA, PAQUETES, COMENTARIOS DE DOCUMENTACION, EL PAQUETE DE ENTRADA-SALIDA", "num_citations": "54\n", "authors": ["17"]}
{"title": "In Theories of memory\n", "abstract": " JM Gardiner, RI Java, A. Collins, SE Gathercole, MA Conway & PE Morris, In Theories of memory - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search In Theories of memory JM Gardiner, RI Java, A. Collins, SE Gathercole, MA Conway & PE Morris In A. Collins, S. Gathercole, Martin A. Conway & PE Morris (eds.), Theories of Memory. Lawrence Erlbaum (1993) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Theories of Memory in Philosophy of Mind (categorize this paper) Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy …", "num_citations": "54\n", "authors": ["17"]}
{"title": "Word frequency and generation effects.\n", "abstract": " Nairne, Pusen, and Widner (1985) described an experiment in which they found that, like nonwords, low-frequency words were no more likely to be recognized if they had been self-generated at study than if they had been read. These findings led Nairne et al. to conclude that generation effects depend on the extent to which words are associatively linked to other words in semantic memory, not on lexical representation per se. In a series of experiments designed to test the generality of Nairne et al.'s low-frequency finding, we found not only that generation effects occurred for low-frequency words but also that those effects were on the whole indistinguishable from effects obtained with high-frequency words. These findings indicate that word frequency does not define an essential boundary condition for generation effects and so provides no basis for preferring an associative hypothesis to a lexical one.(PsycINFO …", "num_citations": "54\n", "authors": ["17"]}
{"title": "Negative recency in initial free recall.\n", "abstract": " Conducted 3 experiments with a total of 139 college students to test the prediction of 2-memory theories that it should be possible to produce negative recency in initial recall. Exp I provided a demonstration of this negative recency effect, contrary to previous findings. 2 additional experiments were performed to resolve the contradiction between previous and present results. At the procedural level, the data show an interaction between (Ma) and Psychasthenia (Pt) scales of the to-be-remembered items and the type of interpolated task. At the theoretical level, the data suggest modality-specific storage in primary memory.(16 ref)(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "54\n", "authors": ["17"]}
{"title": "Free recall learning of hierarchically organised lists by adults with Asperger’s syndrome: Additional evidence for diminished relational processing\n", "abstract": " The Task Support Hypothesis (TSH, Bowler et al. Neuropsychologia 35:65–70 1997) states that individuals with autism spectrum disorder (ASD) show better memory when test procedures provide support for retrieval. The present study aimed to see whether this principle also applied at encoding. Twenty participants with high-functioning ASD and 20 matched comparison participants studied arrays of 112 words over four trials. Words were arranged either under hierarchically embedded category headings (e.g. Instruments—String—Plucked—Violin) or randomly. Both groups showed similar overall recall and better recall for the hierarchically organised words. However, the ASD participants made less use of information about relations between words and more use of item-specific information in their recall, confirming earlier reports of relational difficulties in this population.", "num_citations": "52\n", "authors": ["17"]}
{"title": "Effects of level of processing but not of task enactment on recognition memory in a case of developmental amnesia\n", "abstract": " We report the performance in four recognition memory experiments of Jon, a young adult with early-onset developmental amnesia whose episodic memory is gravely impaired in tests of recall, but seems relatively preserved in tests of recognition, and who has developed normal levels of performance in tests of intelligence and general knowledge. Jon's recognition performance was enhanced by deeper levels of processing in comparing a more meaningful study task with a less meaningful one, but not by task enactment in comparing performance of an action with reading an action phrase. Both of these variables normally enhance episodic remembering, which Jon claimed to experience. But Jon was unable to support that claim by recollecting what it was that he remembered. Taken altogether, the findings strongly imply that Jon's recognition performance entailed little genuine episodic remembering and that the …", "num_citations": "52\n", "authors": ["17"]}
{"title": "System for dynamically loading object viewer from client or server\n", "abstract": " A class loader downloads objects and object viewers from remote computer nodes, and invokes locally stored object viewers to view objects. When a user selects an object to view, a conventional downloading of the referenced object is initiated. The class loader, however, utilizes data type information received at the beginning of the object downloading process to determine if a viewer for the referenced object is available on the user's workstation. If an appropriate view is not locally available, the class loader automatically locates an appropriate viewer on the server from which the object is being downloaded, or from any other appropriate server known to the user's workstation. The class loader downloads the located viewer and then invokes a program verification procedure to verify the integrity of the downloaded viewer before the viewer is executed. Once a viewer has been verified, the viewer is added to the …", "num_citations": "50\n", "authors": ["17"]}
{"title": "Recollective experience and recognition memory for threat in clinical anxiety states\n", "abstract": " Recognition memory for threat and nonthreat words was examined in generally anxious patients in relation to normal control subjects. Two types of response in recognition memory (“know” and “remember”) were used to test predictions from Williams, Watts, MacLeod, and Mathews’s (1988) cognitive model of anxiety. The results failed to support the hypothesis that anxiety is associated with an implicit memory bias favoring threat (as measured by “know” responses) and an explicit memory bias against threat (as measured by “remember” responses). The findings are discussed in relation to recent research which suggests that there are two functionally independent systems within implicit memory.", "num_citations": "49\n", "authors": ["17"]}
{"title": "On the objectivity of subjective experiences of autonoetic and noetic consciousness.\n", "abstract": " Topics include: preamble; new concepts of consciousness; remember-know paradigm; an illustrative experiment; functional independence; concepts of recollection and familiarity; 3 kinds of converging evidence; concept of trace strength; and envoi.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "48\n", "authors": ["17"]}
{"title": "Recognition failures and free-recall failures: Implications for the relation between recall and recognition\n", "abstract": " Experiments showing that in cued recall subjects can recall words that they had previously failed to recognize have been taken to refute generate-recognize theories of recall, for those theories predict that recall is dependent on recognition. None of these experiments, however, has provided an appropriate test of Bahrick’s (1970, 1979) generate-recognize theory, which explicitly refers to words that are accessible to cued recall but not to free recall, that is, tofree-recall failures. When the experimental procedure was modified so as to provide tests of this theory, no evidence was found of any greater dependency between recall and recognition of free-recall failures than between recall and recognition overall. Free-recall failures do not, therefore, constitute any exception to many previous experimental findings that conform with the Tulving-Wiseman law, and so the account offered by Bahrick’s generate …", "num_citations": "48\n", "authors": ["17"]}
{"title": "SunDew-a distributed and extensible window system\n", "abstract": " SunDew is a distributed, extensible window system that is currently being developed at SUN. It has arisen out of an effort to step back and examine various window system issues without the usual product development constraints. It should really be viewed as speculative research into the right way to build a window system. We started out by looking at a number of window systems and clients of window systems, and came up with a set of goals. From those goals, and a little bit of inspiration, we came up with a design.", "num_citations": "48\n", "authors": ["17"]}
{"title": "Episodic but not semantic order memory difficulties in autism spectrum disorder: Evidence from the Historical Figures Task\n", "abstract": " Considerable evidence suggests that the episodic memory system operates abnormally in autism spectrum disorder (ASD) whereas the functions of the semantic memory system are relatively preserved. Here we show that the same dissociation also applies to the domain of order memory. We asked adult participants to order the names of famous historical figures either according to their chronological order in history (probing semantic memory) or according to a random sequence shown once on a screen (probing episodic memory). As predicted, adults with ASD performed less well than age- and IQ-matched comparison individuals only on the episodic task. This observation is of considerable importance in the context of developmental theory because semantic and episodic order memory abilities can be dissociated in typically developing infants before they reach the age at which the behavioural markers …", "num_citations": "46\n", "authors": ["17"]}
{"title": "Apparatus and method for processing servlets\n", "abstract": " A method and apparatus for operating a local server computer of a client-server network includes a technique to receive a request from a client computer of the client-server network. A determination is made whether the request requires dynamically generated information from a servlet object of the client-server network. If so, a specified servlet object corresponding to the request may be uploaded from a remote server computer of the client-server network. The specified servlet object is then executed to obtain dynamically generated information corresponding to the request.", "num_citations": "46\n", "authors": ["17"]}
{"title": "The feel of Java\n", "abstract": " Java evolved out of a Sun research project started six years ago to look into distributed control of consumer electronics devices. At that time, the priori ties of the consumer electronics industry were quite different from those in the computer industry. Whereas five years ago the computer industry's mantra was compatibility, the consumer electronics industry considered security, networking, portability, and cost to be far more important. The buzzwords that have been applied to Java-distributed computing, architecture neutrality, and so on-derive directly from this context. The article provides a first-hand account of some of the design decisions underlying Java and the rationale behind them.", "num_citations": "45\n", "authors": ["17"]}
{"title": "Recognition failure when recognition targets and recall cues are identical\n", "abstract": " An experiment is reported in which the recognition and recall of target words were compared when recall was cued by other words that were either identical or not identical to the targets. Two types of nonidentical cue were used—semantic cues and associate cues (e.g., down and hope, respectively, for the target HIGH; in this case, the identical cue was, of course, high). The results are shown to have two principal implications. First, the results are consistent with the dual-route model of recall and, in particular, support earlier indications that direct and indirect routes to recall may be exclusive in operation. Second, they demonstrate that the empirical Tulving-Wiseman law that describes the relation between recognition and recall over a wide range of conditions does not hold for identical cues, thereby providing further confirmation of its established range of applicability.", "num_citations": "45\n", "authors": ["17"]}
{"title": "Levels of processing in word recognition and subsequent free recall.\n", "abstract": " Explored a situation in which 32 volunteers and undergraduates were unexpectedly required to recall the target words from a perceptual decision-making task. The targets were defined by either their phonemic or semantic attributes, and Ss held these attributes in\" working memory\" for varying time intervals prior to target presentation. Semantically defined targets were better recalled subsequently than were phonemically defined targets, although the latter gave rise to longer decision latencies in the initial task. Also, subsequent target recall was not affected by the length of time the target-defining attributes had been held in working memory. Results are discussed within the context of FI Craik and RS Lockhart's\" levels-of-processing\" approach.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "45\n", "authors": ["17"]}
{"title": "Identifying exceptions in a database of recognition failure studies from 1973 to 1992\n", "abstract": " This paper presents a database of all published studies based on the recognition failure paradigm, which involves the study of pairs of items followed by a recognition test of the second item of each pair and a recall test of the same target item with the first item of each pair provided as a context cue. The paper also identifies, on the basis of a quantitative analysis, exceptions to the recognition failure function encompassing most data in the database. The database includes reference information about each study and a short description of materials and the manipulations made in each of the 302 experimental conditions reported. The database also includes information about the total number of observations for each condition, the overall hit rate in free or forced choice recognition, the overall probability of recall, the observed probability of recognition given recall, the predicted probability of recognition given recall, the …", "num_citations": "44\n", "authors": ["17"]}
{"title": "Recognition memory and awareness: Occurrence of perceptual effects in remembering or in knowing depends on conscious resources at encoding, but not at retrieval\n", "abstract": " We report four experiments in which a remember-know paradigm was combined with a response deadline procedure in order to assess memory awareness in fast, as compared with slow, recognition judgments. In the experiments, we also investigated the perceptual effects of study-test congruence, either for picture size or for speaker’s voice, following either full or divided attention at study. These perceptual effects occurred in remembering with full attention and in knowing with divided attention, but they were uninfluenced by recognition speed, indicating that their occurrence in remembering or knowing depends more on conscious resources at encoding than on those at retrieval. The results have implications for theoretical accounts of remembering and knowing that assume that remembering is more consciously controlled and effortful, whereas knowing is more automatic and faster.", "num_citations": "43\n", "authors": ["17"]}
{"title": "Bytecode program interpreter apparatus and method with pre-verification of a data type restrictions and object initialization\n", "abstract": " A program interpreter for computer programs written in a bytecode language, which uses a restricted set of data type specific bytecodes. The interpreter, prior to executing any bytecode program, executes a bytecode program verifier procedure that verifies the integrity of a specified program by identifying any bytecode instruction that would process data of the wrong type for such a bytecode and any bytecode instruction sequences in the specified program that would cause underflow or overflow of the operand stack. If the program verifier finds any instructions that violate predefined stack usage and data type usage restrictions, execution of the program by the interpreter is prevented. After pre-processing of the program by the verifier, if no program faults were found, the interpreter executes the program without performing operand stack overflow and underflow checks and without performing data type checks on …", "num_citations": "43\n", "authors": ["17"]}
{"title": "Method and apparatus for NTSC display of full range animation\n", "abstract": " Full-motion animation video is displayed in a computer system through use of sprite objects. The sprite objects define the images on the output display, and the locations of the sprite objects are changed to create the animation. The computer system includes three areas of physical memory assigned the status of a front buffer, a back buffer, and a cache buffer. The front buffer stores a frame currently displayed on the output display. The cache buffer is utilized to store a subset of the sprite objects so that all sprite objects need not be rendered for each frame of animation. The contents of the cache buffer are copied to the back buffer during display of the front buffer. To display a subsequent frame, the front and back buffers are switched. A cache buffer permits display of full-motion animation by minimizing use of processor and computer resources.", "num_citations": "42\n", "authors": ["17"]}
{"title": "Conjoint dissociations reveal involuntary “perceptual” priming from generating at study\n", "abstract": " Incidental perceptual memory tests reveal priming when words are generated orally from a semantic cue at study, and this priming could reflect contamination by voluntary retrieval. We tested this hypothesis using a generate condition and two read conditions that differed in depth of processing (read-phonemic vs read-semantic). An intentional word-stem completion test showed an advantage for the read-semantic over the generate condition and an advantage for the generate over the read-phonemic condition, and completion times were longer than in a control test, prior to which there was no study phase. An incidental word-stem completion test showed equivalent priming for the read-semantic and read-phonemic study conditions, despite considerable power, and completion times were no longer than control, indicating that retrieval was involuntary, and insensitive to prior conceptual processing. The generate …", "num_citations": "41\n", "authors": ["17"]}
{"title": "Apparatus for selecting mode of output in a computer system\n", "abstract": " A computer system comprising a display memory, a window indentification memory, logic circuitry for ascertaining that information to be stored at each position of the display memory is in the correct window by comparing the window number in the window identification memory with the window number of information to be sent to the display memory, and a window identification look-up table activated by window identification signals for providing an output to select the number of bits of color information to be output from the display memory to provide color information for an output device.", "num_citations": "41\n", "authors": ["17"]}
{"title": "A generation effect in memory without awareness\n", "abstract": " Priming refers to the facilitatory effects of a prior experience on the performance of some cognitive task or skill. In a word‐fragment completion task, priming is shown if words from a previously presented study list are more likely to be completed than other words. An experiment is described which shows that priming in word‐fragment completion was enhanced for words that had been generated at study, from the same fragments as those used at test, rather than read. Because subjects were unaware that any memory test occurred, this generation effect in primed fragment completion does not depend on conscious recollection. It is argued that the effect arises in some memory system other than episodic memory, and reflects data‐driven rather than conceptually driven processing.", "num_citations": "41\n", "authors": ["17"]}
{"title": "Memory for remembered events: Contrasting recall and recognition\n", "abstract": " This study explores the extent and accuracy of the subject's knowledge concerning his previous memory performance. In Experiment I, following a sequence of immediate serial recall trials, the subjects were given a recall-recognition test in which all the originally presented words were re-presented. The subjects were required to discriminate between those words they had recalled initially and those they had not. In Experiment II, the subjects were given a similar test following a sequence of initial recognition trials. It was found that subjects had much greater knowledge concerning their previous recall performance than they had concerning previous recognition. It was also found that whereas knowledge of previous recognition performance was independent of serial position, knowledge of previous recall was much poorer for recency items than for items presented earlier in the list. These results provide further …", "num_citations": "40\n", "authors": ["17"]}
{"title": "The distinctiveness effect in forenames: The role of subjective experiences and recognition memory\n", "abstract": " We describe two experiments that tested the prediction that distinctive forenames would be better recognized than typical forenames and which investigated whether this distinctiveness effect, if obtained, occurred in subjective experiences of the recollective or familiarity components of recognition memory. To that end, the remember‐know paradigm was used to measure people's experiences of recollection or familiarity. The results revealed that distinctive forenames were more memorable than typical forenames and that that this distinctiveness effect was present only in the subjective experience of remembering. Additionally, the present research showed that these distinctiveness effects were present after retention intervals of both 1 and 7 days. These results replicate and extend past research on distinctiveness effects and also provide support for Rajaram's (1996) distinctiveness‐fluency account of the 2 states of …", "num_citations": "39\n", "authors": ["17"]}
{"title": "Level of processing and the process-dissociation procedure: Elusiveness of null effects on estimates of automatic retrieval\n", "abstract": " We describe two experiments that used the process-dissociation procedure to investigate the effects of level of processing on estimates of controlled and automatic retrieval processes in word-stem completion tasks. Despite our best endeavours, we found the null effect of level of processing on estimates of automatic retrieval reported by Toth, Reingold, and Jacoby (1994) elusive. Estimates of automatic retrieval were not independent of level of processing but inversely related to it. In part, the reason was that, following deeper levels of processing, instructions to exclude recollected words led to floor effects. But the inverse relationship persisted even when floor effects were avoided. Only participants who were not given strict instructions in the exclusion task–and who also qualified as lax responders based on answers in a structured post-test interview–showed no effect of level of processing on estimates of automatic …", "num_citations": "39\n", "authors": ["17"]}
{"title": "A redisplay algorithm\n", "abstract": " This paper presents an algorithm for updating the image displayed on a conventional video terminal. It assumes that the terminal is capable of doing the usual insert/delete line and insert/delete character operations. It takes as input a description of the image currently on the screen and a description of the new image desired and produces a series of operations to do the desired transformation in a near-optimal manner. The algorithm is interesting because it applies results from the theoretical string-to-string correction problem (a generalization of the problem of finding a longest common subsequence), to a problem that is usually approached with crude ad-hoc techniques.", "num_citations": "39\n", "authors": ["17"]}
{"title": "Limitations of the signal detection model of the remember-know paradigm: a reply to Hirshman.\n", "abstract": " Replies to the commentary by E. Hirshman (see record 1998-02263-007) on the JM Gardiner et al (see record 1998-02263-001) article by criticizing Hirshman's argument for the signal detection model. Gardiner et al disagree with this model because it does not provide an explanation of the subjective states of awareness that are associated with remember, know, and guess responses as described in the Gardiner et al paper.(PsycINFO Database Record (c) 2018 APA, all rights reserved)", "num_citations": "38\n", "authors": ["17"]}
{"title": "The shifting roles of state budget offices in the Midwest: Gosling revisited\n", "abstract": " Almost a decade ago a study of three midwestern states revealed a variety of budget office orientations, ranging from a control to a policy emphasis, including a state in transition from one to the other. This article revisits these states to examine their current orientations and whether different office orientations influence the role of budget analysts in the budgetary process. The results suggest that another stage should be added to Schick's 1966 framework to account for the evolution of some state budget offices to a policy orientation.", "num_citations": "36\n", "authors": ["17"]}
{"title": "Platform independent object and object application loader and method\n", "abstract": " A class loader downloads objects and object viewers from remote computer nodes, and invokes locally stored object viewers to view objects. When a user selects an object to view, a conventional downloading of the referenced object is initiated. The class loader, however, utilizes data type information received at the beginning of the object downloading process to determine if a viewer for the referenced object is available on the user's workstation. If an appropriate view is not locally available, the class loader automatically locates an appropriate viewer on the server from which the object is being downloaded, or from any other appropriate server known to the user's workstation. The class loader downloads the located viewer and then invokes a program verification procedure to verify the integrity of the downloaded viewer before the viewer is executed. Once a viewer has been verified, the viewer is added to the …", "num_citations": "35\n", "authors": ["17"]}
{"title": "Recognition memory and awareness for famous and obscure musical themes\n", "abstract": " In each of two experiments, subjects listened to a set of famous and obscure musical themes. In later recognition tests in which these themes were re-presented along with a set of similar themes, subjects had to identify the themes they had heard earlier in the experiment. In addition, for each theme that subjects so identified, they reported whether they consciously recollected its earlier occurrence (“remember”) or knew that it had occurred earlier because it was familiar in the experimental context (“know”). Subjects were much more likely to recognise the famous themes as having occurred earlier in the experiment and this effect appeared in “remember” but not in “know” responses. Moreover, whereas subjects made far more “remember” than “know” responses for the famous themes, they tended, if anything, to make more “know” than “remember” responses for the obscure themes. The results were attributed …", "num_citations": "32\n", "authors": ["17"]}
{"title": "Cued recall\n", "abstract": " CHAPTER 6 MICHAEL J. WATKINSJOHN M. GARDINER Cued Recall INTRODUCTION In essence, the cued-recallprocedure is a form of memory testing that incorporates particular cues for the recall of specific information. In a typical cued-recallexperiment the to-be-recalled information consists of words in a study list, or, more precisely, of the presentation or occurrence of words in a study list. T hecues are prompts or reminders that havebeen carefully selected as having some special relation to the to-be-recalledwords. T hey are nearly always otherwords. In most casesonecue is given for each\" target\" word, although sometimes onecue is given for more than one target word, and sometimes more than onecue is given for the same target word. W edo not think it would be helpful to attempt amore formal definition of the cued-recallprocedure, especially one that tried to distinguish sharply between cued recall and …", "num_citations": "32\n", "authors": ["17"]}
{"title": "Agent icon for a display screen of a programmed computer system\n", "abstract": " Priority date (The priority date is an assumption and is not a legal conclusion. Google has not performed a legal analysis and makes no representation as to the accuracy of the date listed.) 1993-02-23", "num_citations": "31\n", "authors": ["17"]}
{"title": "Awareness of recognition memory for Polish and English folk songs in Polish and English folk\n", "abstract": " Polish and English people listened either once or three times to excerpts from Polish and English folk songs before being given a recognition test in which, when recognising an excerpt, they had to report whether they remembered hearing it, knew they had heard it, or guessed they had heard it. Both Polish and English people remembered more of the excerpts from their own folk songs, and they remembered more of the excerpts they heard three times rather than once, regardless of the national background of the songs. They also knew they had heard more of the excerpts they heard three times, but only if they were from the other folk's songs. Repetition did not affect knowing songs from one's own national background. These findings confirm and extend previous findings suggesting that remembering and knowing are functionally independent states of awareness.", "num_citations": "30\n", "authors": ["17"]}
{"title": "The auditory recency advantage in longer term free recall is not enhanced by recalling prerecency items first\n", "abstract": " Gardiner and Gregg (1979) showed that in a free-recall paradigm in which each list word is embedded in a continuous stream of subject-vocalized distractor activity, recency recall was greater when the words were presented auditorily rather than visually. The experiment described here showed that this auditory advantage persisted even when list and distractor items were both spoken at a controlled pace by the experimenter, and that it was little influenced by instructions to give priority in recall either to the beginning or to the end of the list. These results strengthen the conclusion that this effect cannot be accommodated by any echoic memory theory and, because the effect was not enhanced when prerecency items were recalled first, demonstrate an additional difference between it and the somewhat similar auditory advantage found in immediate recall.", "num_citations": "29\n", "authors": ["17"]}
{"title": "Further evidence of interference between lipreading and auditory recency.\n", "abstract": " Data for 48 undergraduates in 2 experiments show that in both free and backward recall, auditory but not visual recency was greatly disrupted when Ss had to lipread, rather than read, a series of numbers in a distractor task interpolated between list presentation and recall. It is suggested that this selective interference effect extends the generality of a finding reported by KT Spoehr and WJ Corin (see record 1980-11229-001) and adds to an accumulating body of evidence that seems inconsistent with acoustic or echoic memory interpretations of the enhanced recency recall typically observed in comparing auditory with visual presentation. Alternative interpretations are briefly considered.(20 ref)(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "29\n", "authors": ["17"]}
{"title": "Conscious control and memory awareness when recognising famous faces\n", "abstract": " We describe an experiment that investigated levels-of-processing effects in recognition memory for famous faces. The degree of conscious control over the recognition decisions was manipulated by using a response deadline procedure, and memory awareness associated with those decisions was assessed using a standard remember-know paradigm. Levels-of-processing effects were found at both short and long response deadlines, and at both deadlines those effects occurred only in remembering. Moreover, knowing, as well as remembering, increased with the greater opportunity for conscious control over recognition decisions at the long deadline. These results have implications for dual-process theories that distinguish between a slower, more controlled recollection process, reflected in remembering, and a faster, more automatic familiarity process, reflected in knowing.", "num_citations": "28\n", "authors": ["17"]}
{"title": "Further evidence of preserved memory function in Alzheimer's disease\n", "abstract": " Memory performance of elderly patients in the early stages of Alzheimer's disease (DAT) was compared with that of elderly control subjects. In explicit tests of recognition memory, which involve conscious recollection, the DAT patients were grossly impaired. In implicit tests of anagram solution and wordstem completion, which do not require conscious recollection, the DAT patients were not impaired. These findings further support the idea that a separate memory system, episodic memory, underlies conscious recollection, that it is this system which is most commonly damaged in amnesia, and that memory systems not involving conscious recollection may be spared in the early stages of Alzheimer's disease.", "num_citations": "28\n", "authors": ["17"]}
{"title": "Item-specific processing and the generation effect: Support for a distinctiveness account\n", "abstract": " Self-generated items are often better recalled than items that are read. Results of two experiments showed that this generation effect was greatly reduced or eliminated by an additional orienting task that was assumed to enhance item-specific processing in incidental learning. These results were predicted by a distinctiveness hypothesis according to which the generate task itself enhances item-specific processing. But the results are not inconsistent with certain other hypotheses that have been suggested to explain generation effects.", "num_citations": "28\n", "authors": ["17"]}
{"title": "Modality and phonological similarity effects in serial recall: Does one’s own voice play a role?\n", "abstract": " Results of two experiments showed that the modality effect in serial recall of word lists is sharply reduced by high interitem phonological similarity and that the extent of this reduction is much the same irrespective of whether the lists are spoken by the subject or the experimenter. These findings contradict an account of the modality effect recently proposed by Richardson (1979), but the data are entirely consistent with the belief that the effect originates in echoic memory.", "num_citations": "28\n", "authors": ["17"]}
{"title": "Component processes of conceptual priming and associative cued recall: The roles of preexisting representation and depth of processing.\n", "abstract": " The authors investigated depth-of-processing effects on conceptual priming by comparing incidental (implicit) and intentional (explicit) tests of word association. In Experiment 1, depth of processing at study influenced priming of weak and medium associates but not of strong associates. In Experiment 2, depth of processing influenced priming of weak associates but not of compound phrases (eg, coat-hanger), whose preexperimental association strength matched that of weak associates. In Experiment 3, the same pattern persisted when study was auditory and test was visual, ensuring that priming was conceptual and not perceptual. In all experiments, in matched intentional tests, depth-of-processing effects occurred for all association strengths and for both phrases and associates, suggesting that the incidental tests were uncontaminated by voluntary retrieval, because they showed depth-of-processing effects only …", "num_citations": "26\n", "authors": ["17"]}
{"title": "Memory awareness following speeded compared with unspeeded picture recognition\n", "abstract": " A remember-know paradigm was used to assess memory awareness following speeded and unspeeded yes/no picture recognition. The beneficial effects of picture size congruency at study and test occurred with speeded as well as with unspeeded recognition. In each case, they were associated with remembering, not with knowing, which remained invariant. Thus, size congruency effects were associated with remembering even when recognition occurred more automatically and hence may be more dependent on a relatively fast familiarity process. In a second experiment, speeded remember responses were compared with remember responses that followed speeded yes/no recognition. There was more remembering when it was the remember responses that were speeded, contrary to what might be expected if remembering reflects a relatively slow recollection process. These results have implications for the …", "num_citations": "26\n", "authors": ["17"]}
{"title": "Level of processing and age affect involuntary conceptual priming of weak but not strong associates\n", "abstract": " Memory for weak and strong semantic associates was compared in intentional associate-cued-recall and incidental free-association tests. This design yielded four conditions (weak/intentional, strong/intentional, weak/incidental, and strong/incidental) on which younger and older adults were compared. Level of processing (LOP) and age effects occurred for the weak/intentional, strong/intentional, and weak/incidental conditions, but not for the strong/incidental condition. Because participants could not distinguish weak from strong associates during the memory tests, these results suggest that free-association priming was involuntary and was not contaminated by voluntary retrieval strategies. Instead, they suggest that encoding deficits related to shallower LOP and older age reduce involuntary free-association priming mainly for associates without cohesive preexperimental representations.", "num_citations": "26\n", "authors": ["17"]}
{"title": "Memory theory and the boundary conditions of the Tulving-Wiseman law\n", "abstract": " The relationship between recall and recognition remains one of the most fundamental and long standing theoretical problems in the scientiﬁc study of memory. Over the years, much evidence about this relationship has accumulated and many theoretical ideas have been proposed to explain it. In the history of this research three basic empirical strategies have been used to explore the problem. The ﬁrst strategy has been to search for variables that inﬂuence one or the other or both of the two sorts of test—a search for patterns of functional dissociation and correspondence (for reviews see, eg, Kintsch, 1970; McCormack, 1972; Tulving, 1976). The second strategy has been to try to make “direct” comparisons between recall and recognition performance under conditions in which all factors except that of test may be presumed to be equated (eg, Broadbent & Broadbent, 1975; Watkins & Todres, 1978). The third strategy has been to give subjects successive tests of each sort and to analyze the relation between recognition and recall in terms of individual subject~ item recognition-recall contingencies. In particular, this third strategy has been concerned with the phenomenon of recognition failure of recall-able words, that is, the ﬁnding that subjects fail to recognize items that they can subsequently recall (Tulving & Thomson, 1973). At ﬁrst glance, the results of all these endeavors might seem scarcely encouraging. A solution to the problem of the relation between recognition and recall has", "num_citations": "26\n", "authors": ["17"]}
{"title": "Using semantic memory to boost ‘episodic’recall in a case of developmental amnesia\n", "abstract": " We report two experiments that investigated factors that might boost ‘episodic’recall for Jon, a developmental amnesic whose episodic memory is gravely impaired but whose semantic memory seems relatively normal. Experiment 1 showed that Jon's recall improved following a semantic study task compared with a non-semantic study task, as well as following four repeated study trials compared with only one. Experiment 2 additionally revealed that Jon's recall improved after acting compared with reading action phrases at study, but only if the phrases were well integrated semantically. The results provide some support for the hypothesis that Jon's ‘episodic’recall depends on the extent to which he is able to retrieve events using semantic memory.", "num_citations": "25\n", "authors": ["17"]}
{"title": "Transferring voice effects in recognition memory from remembering to knowing\n", "abstract": " In five experiments, we investigated the effects of voice congruency (same vs. different voices at study and at test) on remembering and knowing in recognition memory. With low- and medium-frequency three- or four-syllable words, a voice congruency effect occurred only in remembering. With nonwords, voice congruency effects occurred both in remembering and in knowing. With nonwords and divided attention at study, the voice congruency effect transferred almost completely from remembering to knowing. By showing a transfer of effects from remembering to knowing as encoding became more impoverished, these findings support a distinctiveness/fluency account of remembering and knowing as well as the theory that remembering and knowing indicate retrieval of events from episodic and semantic memory systems, respectively.", "num_citations": "25\n", "authors": ["17"]}
{"title": "The generation effect: Continuity between generating and reading\n", "abstract": " It has previously been found that a word from a list is more likely to be recalled if it is generated, as opposed to read, by the subject. This study investigated the relationship between generate and read tasks by systematically varying the number of letters omitted from the to-be-recalled words. The data conformed to a simple linear trend. This finding suggests a fundamental continuity, rather than any discontinuity, in the processes determining the recallability of read and self-generated words.", "num_citations": "23\n", "authors": ["17"]}
{"title": "Not all repetition is alike: Different benefits of repetition in amnesia and normal memory\n", "abstract": " While it is well known that repetition can enhance memory in amnesia, little is known about which forms of repetition are most beneficial. This study compared the effect on recognition memory of repetition of words in the same semantic context and in varied semantic contexts. To gain insight into the mechanisms by which these forms of repetition affect performance, participants were asked to make Remember/Know judgments during recognition. These judgments were used to make inferences about the contribution of recollection and familiarity to performance. For individuals with intact memory, the two forms of repetition were equally beneficial to overall recognition, and were associated with both enhanced Remember and Know responses. However, varied repetition was associated with a higher likelihood of Remember responses than was fixed repetition. The two forms of repetition also conferred equivalent …", "num_citations": "22\n", "authors": ["17"]}
{"title": "Java™: An Overview\n", "abstract": " \" Java™: An Overview\" was written in early 1995, just as we were getting ready to release Java. By that time, Java had been used inside Sun for about 4 years by a small enthusiastic crew. I was looking forward to getting it out there so that others could enjoy it too. Being a pretty serious geek, I tended to think of it in pretty technical terms. This was a fairly serious problem since relatively few people could make sense of what I was babbling. My wife, Judy Borcz, is a very bright person but not a geek (she’sa Wharton MBA type). When I would erupt in fits of techo− babble it didn’t help her understanding at all. She pushed me very hard to write down, in terms that mattered to people like her, what was so cool about Java.That put my head in a different place and got me thinking about Java from a different perspective. The title of the paper doesn’t match the content of the paper it isn’t an overview of Java at all. A more appropriate title would have been\" Java: Why Should Anyone Care?\". It takes the perspective of someone looking in from the outside at the development of software products. It presents a series of vignettes in the life of a software product organization and explains how they could be impacted by the adoption of Java. The vignettes were chosen to be familiar to anyone who has been around the business.", "num_citations": "22\n", "authors": ["17"]}
{"title": "Influences of delayed distraction on the modality effect in free recall\n", "abstract": " The free recall of recency items is better following lists presented auditorily rather than visually. This modality effect was eliminated by a 30‐second, but not a three‐second, period of auditory distraction delayed by 15 seconds following list presentation. It is argued that these findings are entirely consistent with the notion that the modality effect in free recall arises from the direct use of persistent modality‐specific information, and not from the use of acoustic information which has been recoded into modality‐independent memory.", "num_citations": "22\n", "authors": ["17"]}
{"title": "Encoding context and the generating effect in multitrial free-recall learning.\n", "abstract": " In a conventional word-list experiment a word is more likely to be recalled if it is generated, rather than merely read, by the S. An experiment with 40 19–40 yr olds is described that extends previous studies by showing that, in free-recall learning, the generation effect was no different when the words were studied in a phonemic or in a semantic encoding context, although the semantic context facilitated learning.(French abstract)(7 ref)(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "22\n", "authors": ["17"]}
{"title": "Brief report: The role of task support in the spatial and temporal source memory of adults with autism spectrum disorder\n", "abstract": " Adults with autism spectrum disorder (ASD) show intact recognition (supported procedure) but impaired recall (unsupported procedure) of incidentally-encoded context. Because this has not been demonstrated for temporal source, we compared the temporal and spatial source memory of adults with ASD and verbally matched typical adults. Because of difficulties with temporal processing in ASD, we predicted ASD adults would benefit from test support for location but not temporal occurrence of studied words. We found similar levels of recognition and source memory for both groups but there was a greater effect of support on memory for location source in the ASD group. The lack of an effect of support for temporal source may simply reflect a difficulty in operationalising temporal cues.", "num_citations": "21\n", "authors": ["17"]}
{"title": "Directed forgetting in high-functioning adults with autism spectrum disorders\n", "abstract": " Rehearsal strategies of adults with autism spectrum disorders (ASDs) and demographically matched typically developed (TD) adults were strategically manipulated by cueing participants to either learn, or forget each list word prior to a recognition task. Participants were also asked to distinguish between autonoetic and noetic states of awareness using the Remember/Know paradigm. The ASD group recognised a similar number of to-be-forgotten words as the TD group, but significantly fewer to-be-learned words. This deficit was only evident in Remember responses that reflect autonoetic awareness, or episodic memory, and not Know responses. These findings support the elaborative encoding deficit hypothesis and provide a link between the previously established mild episodic memory impairments in adults with high functioning autism and the encoding strategies employed.", "num_citations": "20\n", "authors": ["17"]}
{"title": "A linguagem de programação Java\n", "abstract": " Esta obra representa o valioso legado do Curso de Ortodontia Preventiva e Interceptiva ministrado durante anos pelo Prof. Dr. Omar Gabriel da Silva Filho no Hospital de Reabilitação de Anomalias Craniofaciais da Universidade de São Paulo (HRAC/USP), em Bauru, SP. Ela aborda os protocolos do tratamento ortodôntico em duas fases, segundo o qual o paciente é tratado primeiro na fase de dentadura decídua ou mista, assim que sua maloclusão é diagnosticada, e posteriormente na fase de dentadura permanente, para finalizar a oclusão. Distúrbios irruptivos na dentadura mista, mordida cruzada posterior, apinhamento primário, tratamento precoce do Padrão II e tratamento ortopédico do Padrão III são alguns dos temas abordados, com profundidade, nesta obra.", "num_citations": "20\n", "authors": ["17"]}
{"title": "Implicit versus explicit retrieval of surnames of famous people: Dissociative effects of levels of processing and age\n", "abstract": " Experiment 1 investigated whether a new implicit memory test of name generation and an explicit memory test of name cued recall were equally susceptible to levels of processing effects. In both tests the common forenames of previously studied famous surnames were used as test cues. Results showed a dissociation between the implicit and explicit tests with only the explicit test exhibiting a significant level of processing effect. Using the same methodology, Experiment 2 compared the performance of younger and older adults in the two tests. Results showed two replications of the levels of processing dissociation found in Experiment 1 and a further dissociation between performance of the younger and older adults; younger adults performed significantly better than older adults in the explicit test but not in the implicit test. Because the forename/surname stimuli in name generation have strong associative …", "num_citations": "19\n", "authors": ["17"]}
{"title": "Concepts and theories of memory.\n", "abstract": " This chapter outlines the important changes in how psychologists understand and conceptualize human memory and serves to update what for many of us is a relatively unreconstructed undergraduate knowledge of the topic. It reviews those concepts and theories of memory that might be helpful in furthering our understanding of memory in autism spectrum disorder. The chapter contrasts two major theoretical approaches, one based on the concept of memory systems, the other based on the concepts of encoding and retrieval processes. Neither of these approaches is complete in and of itself, though each may nonetheless be of heuristic value, and there has recently been some rapprochement between them. Environmental considerations must also be taken into account, particularly the degree of environmental support provided by memory tasks. Theoretical advances will increasingly depend on converging …", "num_citations": "18\n", "authors": ["17"]}
{"title": "Techniques for loading class files into virtual machines\n", "abstract": " Improved techniques for loading class files into virtual computing machines are disclosed. These techniques provide a mechanism that will generally improve the efficiency of virtual machines by selectively loading information into a virtual machine. As will be appreciated, this allows a better use of the resources of the virtual machine. This is especially effective in virtual machines that operate with limited memory resources (eg, embedded systems). In one embodiment, class files suitable for loading into a virtual machine are initially loaded into a memory portion (eg, heap memory). Then, information that is needed to be loaded into the virtual machine is selected. Finally, only the selected information is loaded into the virtual machine.", "num_citations": "18\n", "authors": ["17"]}
{"title": "The Java language Specificition\n", "abstract": " Java® programming language is a general-purpose, concurrent, classbased, object-oriented language. It is designed to be simple enough that many programmers can achieve fluency in the language. The Java programming language is related to C and C++ but is organized rather differently, with a number of aspects of C and C++ omitted and a few ideas from other languages included. It is intended to be a production language, not a research language, and so, as CAR Hoare suggested in his classic paper on language design, the design has avoided including new and untested features.The Java programming language is strongly and statically typed. This specification clearly distinguishes between the compile-time errors that can and must be detected at compile time, and those that occur at run time. Compile time normally consists of translating programs into a machine-independent byte code representation. Run-time activities include loading and linking of the classes needed to execute a program, optional machine code generation and dynamic optimization of the program, and actual program execution. The Java programming language is a relatively high-level language, in that details of the machine representation are not available through the language. It includes automatic storage management, typically using a garbage collector, to avoid the safety problems of explicit deallocation (as in C's free or C++'s delete). High-performance garbage-collected implementations can have bounded pauses to support systems programming and real-time applications. The language does not include any unsafe constructs, such as array accesses …", "num_citations": "16\n", "authors": ["17"]}
{"title": "Method and apparatus for the reduction of memory space required for a digital halftone system\n", "abstract": " In the image generation method and apparatus of the present invention, an image generation apparatus is provided in which a digital halftone cell of threshold values is generated and broken down into a plurality of tiles determined from the locations of the four corners of the halftone cell. The tiles when put together form a bounding box around the halftone cell. These tiles are arranged into a threshold array of threshold values wherein the width of the array is equal to the number of threshold values in a sequence of threshold values across a row of contiguous tiles and the height of the array is equal to the greatest common denominator of the x axis increment and y axis increment between vertices of the halftone cell.", "num_citations": "16\n", "authors": ["17"]}
{"title": "The Tulving-Wiseman law and the recognition of recallable music\n", "abstract": " Memory for well-known musical phrases was tested first for recognition in the absence of any specific musical context and then for recall given the preceding musical phrase as a contextual cue. Recognition and recall were found to be largely, but not completely, independent. Moreover, there was no evidence of any greater dependency between recognition and recall than that previously observed in the relation between word recognition and recall, as summarized by the Tulving-Wiseman law. These findings significantly extend the range of applicability of this law.", "num_citations": "16\n", "authors": ["17"]}
{"title": "A window manager for bitmapped displays and unix\n", "abstract": " A window manager for workstations with bitmapped displays has been developed. It exploits the inter process communication mechanism of the 4.2 Berkeley Unix system, and the DARPA TCP/IP protocols to support remote access to windows. One user level window manager process runs on each workstation; it tiles the screen(s) with windows, and manages a mouse, keyboard and pop-up menus. Client processes make remote procedure calls requesting the window manager to create or destroy windows, and to draw text and graphics in them. The window manager asynchronously requests clients to redraw their images when windows change size.                    “You will get a better Gorilla effect if you use as big a piece of paper as possible. ” Kunihiko Kasahara, Creative Origami.", "num_citations": "16\n", "authors": ["17"]}
{"title": "Mathematical constraints and the Tulving-Wiseman law: A rejoinder\n", "abstract": " Hintzman (1991; 1992) has claimed that the reason data points approximate the recognition failure function discovered by Tulving and Wiseman (1975) is that they are mathematically constrained to do so, and the reason that a few data points do not approximate the function, but are exceptions to it, is that these data points are less subject to mathematical constraints. He has additionally argued that such exceptions are more likely with low levels of recall and strong underlying sources of positive covariance. We provide empirical evidence relevant to this mathematical model using 301 observations from a database of all relevant experimental conditions published between 1973 and 1992 (Nilsson & Gardiner, 1993). We conclude that mathematical constraints have only a minor influence on the function, not the causal role assigned to them in Hintzman's (1992) model. By our account, both the function and …", "num_citations": "15\n", "authors": ["17"]}
{"title": "The role of stimulus material in determining release from proactive inhibition\n", "abstract": " The release from proactive inhibition (PI) paradigm has been widely used as a technique for exploring the encoding dimensions of short-term memory for verbal items. PI release data have been used not only to infer particular memory codes but also to index their relative salience. In the present study, the effects of manipulating the colour (red or black) in which the stimulus material is printed were investigated in two separate experiments. No release effect was obtained in the first, where common two-syllable words were presented. In the second, where consonant trigrams were presented, a large effect was found. Since the same colour feature was manipulated in each experiment, it is argued that this pattern of results has serious implications for the use of PI release data as a technique for mapping the encoding dimensions of short-term memory.", "num_citations": "15\n", "authors": ["17"]}
{"title": "Recognition memory and awareness: A high-frequency advantage in the accuracy of knowing\n", "abstract": " The well-established advantage of low-frequency words over high-frequency words in recognition memory has been found to occur in remembering and not knowing. Two experiments employed remember and know judgements, and divided attention to investigate the possibility of an effect of word frequency on know responses given appropriate study conditions. With undivided attention at study, the usual low-frequency advantage in the accuracy of remember responses, but no effect on know responses, was obtained. Under a demanding divided attention task at encoding, a high-frequency advantage in the accuracy of know responses was obtained. The results are discussed in relation to theories of knowing, particularly those incorporating perceptual and conceptual fluency.", "num_citations": "14\n", "authors": ["17"]}
{"title": "Involuntary level-of-processing effects in perceptual and conceptual priming\n", "abstract": " Level of processing has a profound impact not only on memory performance but also on what people are aware of when executing that performance. A deeper level of processing increases subiective experiences of remembering without affecting subiective experiences of knowing (Gardiner, 1988; Gardiner, Java, & Richardson-Klavehn, 1996l. Thus level of processing affects autonoetic consciousness, the hallmark of an episodic memory system, and not noetic consciousness, the hallmark of a semantic memory system (Tulving, 1983, 1985l.Subiective experiences of remembering and of knowing are two ways in which people become aware of memory. Such awareness of memory has been dissociated empirically from retrieval volition, which refers to awareness of voluntary (intendedl or involuntary (unintendedl retrieval of study-list items (see Richardson-Klavehn, Clarke, & Gardiner, 1999; Richardson-Klavehn & Gardiner, 1995, 1996; Richardson-Klavehn, Gardiner, & Java, 1994, 1996l. ln this chapter, we are concerned with another way in which level of processing relates to what people are aware oL namely, its relation to retrieval volition. This relation has been of considerable theoretical importance in comparing performance between intentional (or direct or explicitl and incidental (or indirect or implicitl memory tasks. The presence of levels-of-processing effects has been taken to indicate the subfective intention to retrieve items from the study lisL The absence of levels-of-processing effects has been taken to indicate the absence of any subfective intention to retrieve items from the study lis1. These assumptions were formalized in the retrieval …", "num_citations": "14\n", "authors": ["17"]}
{"title": "The Tulving-Wiseman law and recognition failure of recognisable words\n", "abstract": " All the data that contribute to the recognition failure function discovered by Tulving and Wiseman (1975) come from experimental conditions in which B items are studied alongside A items that are omitted from a recognition test but are presented as cues in a subsequent recall test. According to a contextual account of this function, and of exceptions to it, data approximate the function whenever the A items in the recall test provide different contextual information to that provided by the B items in the recognition test. In line with this account, three experiments show that data also approximate the function when, following a recognition test involving only the B items, the A items are presented alongside the B items in a second recognition test. The third experiment further shows that data diverge from the function under similar conditions to those that have previously been shown to produce an exception to the …", "num_citations": "14\n", "authors": ["17"]}
{"title": "Contingency relations in successive tests: Accidents do not happen.\n", "abstract": " DL Hintzman and AL Hartry (see record 1991-11769-001) claim that any association obtained between successive tests in a given experiment must be considered largely an accident because such association depends on the particular items used. Their main support for this claim stems from a partitioning of items into subsets that have no psychological significance. Furthermore, measures of association from many different successive tests give rise to data that are predictable, replicable, systematic, convergent with other evidence, and theoretically intelligible.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "14\n", "authors": ["17"]}
{"title": "Variations on a Theme of Elgar: Ken Russell, the Great War, and the television'life'of a composer\n", "abstract": " A boy sits astride a white pony, the land spread below him receding to a misty horizon. The light is behind the pony and boy, obscuring their features but blending them together and silhouetting them against the sky. In the middle distance, given just enough spatial definition to suggest the expanse of air in which they move, dark clouds are edged brilliantly by a distant sun. There is music too. A galloping string theme has accompanied the boy’s ride to the top of the hill, and the moment when he reins in his mount corresponds with a passage of brief repose, if not full resolution, within the music.This is a scene etched in the memory of countless lovers of the music of Sir Edward Elgar, whose Introduction and Allegro it is that we have heard. The boy is supposed to be the young Elgar, and if the biographical record gives little to support the notion that he ever rode a pony on his beloved Malvern hills, it remains an iconic …", "num_citations": "12\n", "authors": ["17"]}
{"title": "Unix Emacs: a retrospective (lessons for flexible system design)\n", "abstract": " UNIX Emacs is well-known and widely used as a text editor that has been extended in a remarkable number of directions, not always wisely. Because it is programmable in a powerful yet simple programming language, Emacs has been used as a development tool for the construction of some remarkably complex user-oriented programs. Indeed, it has served as both a user interface management system and a user interface toolkit, though it was designed as neither. In this paper, we discuss the features that have made it so popular for user interface development, in an attempt to derive lessons of value for more powerful and more systematically designed systems in the future.", "num_citations": "12\n", "authors": ["17"]}
{"title": "Phonological similarity and enhanced auditory recency in longer-term free recall\n", "abstract": " The effect of phonological similarity amongst list items on the modality effect was investigated in free recall with distraction activity interpolated before and after each list word. In Experiment 1 the distractor activity involved counting backward silently mouthing each number, and the modality effect was drastically attenuated by high similarity. This outcome is comparable with that found in immediate recall, and it is consistent with an echoic memory interpretation. In Experiment 2 the same backward-counting task was performed with each number being vocalized, and the modality effect was unaffected by phonological similarity. This outcome leads to the stronger conclusion that, under those conditions at least, the modality effect cannot be echoic. Implications of these findings for general theoretical accounts of the modality effect are discussed.", "num_citations": "12\n", "authors": ["17"]}
{"title": "Remembering the recall of cued and uncued words: Effects of initial accessibility.\n", "abstract": " Two experiments investigated knowledge of recall of words initially tested with or without cues. 20 undergraduates and 48 high school students were presented with categorized words for immediate free recall and were then cued for recall of the remaining unrecalled categories. In a later recall-recognition test all items were re-presented, and Ss were required to indicate whether or not they had recalled the words in the initial test. Both experiments showed that Ss' knowledge of recall was better when words were cued initially. More immediate access to words seems to leave less durable records of recall performance in memory.(French abstract)(14 ref)(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "12\n", "authors": ["17"]}
{"title": "Le langage Java\n", "abstract": " Le langage Java Toggle navigation English français العربية français English français العربية Ouvrir une session Toggle navigation Voir le document Accueil La Bibliothèque Centrale Collection 8 Voir le document Accueil La Bibliothèque Centrale Collection 8 Voir le document Le langage Java Thumbnail Date 2017-01-01 Auteur Arnold Ken Metadata Afficher la notice complète URI http://hdl.handle.net/123456789/114098 Collections Collection 8 [10000] DSpace software copyright © 2002-2015 DuraSpace Contactez-nous | Faire parvenir un commentaire Theme by @mire NV Chercher dans le dépôt Cette collection Parcourir Toute l’ArchiveCommunautés & CollectionsPar date de publicationAuteursTitresSujetsCette collectionPar date de publicationAuteursTitresSujets Mon compte Ouvrir une sessionS'inscrire DSpace software copyright © 2002-2015 DuraSpace Contactez-nous | Faire parvenir un commentaire …", "num_citations": "11\n", "authors": ["17"]}
{"title": "Change in speaker's voice and release from proactive inhibition.\n", "abstract": " Presented 4 triads of unrelated words auditorily in the Brown-Peterson distractor task. Over Trials 1 to 3, 1/2 of the 120 male undergraduate Ss heard the words spoken in a female voice and 1/2 in a male voice. On Trial 4, Ss in a control group heard the words in the same voice as on preceding trials, and Ss in an experimental group heard the words in the alternate voice. Proactive inhibition (PI) developed rapidly over Trials 1 to 3 in both groups. On Trial 4, however, Ss in the experimental group recalled significantly more words than did Ss in the control. It is concluded that Ss can utilize change in speaker's voice to reduce the cumulative effects of PI in short-term memory.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "10\n", "authors": ["17"]}
{"title": "Method and apparatus for resolving data references in generated code\n", "abstract": " A hybrid compiler-interpreter comprising a compiler for “compiling” source program code, and an interpreter for interpreting the “compiled” code, is provided to a computer system. The compiler comprises a code generator that generates code in intermediate form with data references made on a symbolic basis. The interpreter comprises a main interpretation routine, and two data reference handling routines, a dynamic field reference routine for handling symbolic references, and a static field reference routine for handling numeric references. The dynamic field reference routine, when invoked, resolves a symbolic reference and rewrites the symbolic reference into a numeric reference. After re-writing, the dynamic field reference routine returns to the main interpretation routine without advancing program execution to the next instruction, thereby allowing the rewritten instruction with numeric reference to be reexecuted …", "num_citations": "9\n", "authors": ["17"]}
{"title": "Remembering, knowing and the Tulving-Wiseman law\n", "abstract": " The Tulving-Wiseman law is an empirical law that describes the relation between successive tests of recognition and recall of the same set of individual subject-items. It relates the probability of recognising the recallable items to the probability of recognising all the items, regardless of whether they are recalled. The relation represents a moderate degree of dependency between the tests. Two experiments are described in which subjects reported, in each of the two tests, whether they consciously remembered the item's occurrence in the study list, or they knew it occurred in the study list because it was familiar in the experimental context. Analyses of the relation between recognition and recall within each reported state of awareness revealed a much greater dependency for remember responses, and less dependency for know responses, than that predicted by the TulvingWiseman law. These findings are discussed …", "num_citations": "9\n", "authors": ["17"]}
{"title": "Recognition failure of categorised words: Further evidence of exceptions\n", "abstract": " When subjects study a list of B items paired with A items and are tested for recognition of the B items alone, and then for recall of the B items given the A items as cues, B items that can be recalled frequently go unrecognised. The extent of this recognition failure is predictable from a function discovered by Tulving and Wiseman (1975), which relates the probability of recognising the recallable items to the probability of recognising all items. Two kinds of exceptions to this function have been discovered: encoding exceptions and retrieval exceptions. Very few observations of retrieval exceptions exist. Four experiments described in this article provide further evidence that such exceptions occur when the B items are categorised and the A items are the names of the categories. According to a contextual account of the function and exceptions to it, these retrieval exceptions occur because the information provided …", "num_citations": "9\n", "authors": ["17"]}
{"title": "How well do children remember what they have recalled?\n", "abstract": " Summary.  After a series of immediate free recall trials children were given an unexpected recall‐recognition test, results of which showed that younger children, aged about 6 years, were quite poor at discriminating between previously recalled and non‐recalled list items and that they were much less accurate than older children aged about 8 years or more (N = 14 per group). The findings suggest that young children may be generally quite inaccurate in assessing their previous recall performance, and this suggestion was discussed in relation to the development of other memory skills.", "num_citations": "9\n", "authors": ["17"]}
{"title": "On consciousness in relation to memory and learning\n", "abstract": " The problem of consciousness in relation to memory and learning concerns the extent to which people are aware of what they have memorized or learned. It also concerns the extent to which what has been memorized or learned affects people’s awareness at a later time.There are many possible ways in which consciousness can be studied in relation to memory and learning. This chapter focuses on recent research on what has been termed implicit memory (Graf and Schacter, 1985) and implicit learning (Reber, 1967). These terms have been widely used in the literature, but unfortunately they have also been widely used to mean quite different things. They have been used to mean (1) a kind of task that does not require awareness of what has been memorized or learned,(2) a state of consciousness defined by the absence of such awareness, and (3) a form of memory or learning, in the sense of a kind of memory or learning system, representation or process (RichardsonKlavehn and Bjork, 1988). Implicit memory and learning have been contrasted with explicit memory and explicit learning. These terms have been correspondingly used to mean (1) a kind of task that does require awareness of what has been memorized or learned,(2) a state of consciousness defined by the presence of such awareness, and (3) a form of memory or learning.", "num_citations": "8\n", "authors": ["17"]}
{"title": "How computer security works\n", "abstract": " Computer networks will always be vulnerable to attack. As long as companies use the Internet—for transferring files, sending e-mail, downloading programs and so on—there will always be the chance that some malicious outsider will find a way to wreak havoc with their computer systems. But there are ways to make a network much more resistant to attack. The first line of defense is the firewall, a software program that acts as a gatekeeper between the Internet and a company’s “intranet”—the network of computers used by the company’s employees. The two most common kinds of firewalls are packet filters and application-level firewalls. A packet filter, which typically runs on a machine called a router, examines the source address and destination address of every packet of data going in or out of the company’s network. The filter can block packets from certain addresses from entering the network—and prevent …", "num_citations": "7\n", "authors": ["17"]}
{"title": "Java store\n", "abstract": " A computer readable medium including computer readable code for causing a computer system to perform a method. The method includes receiving an application, receiving application information for the application, and determining an access privilege for the application based, in part, on the application information. The method also includes generating a deployment package for the application using the application and the access privilege, and publishing the application.", "num_citations": "6\n", "authors": ["17"]}
{"title": "Memory with and without recollective experience\n", "abstract": " //static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS0140525X00071880/resource/name/firstPage-S0140525X00071880a.jpg", "num_citations": "6\n", "authors": ["17"]}
{"title": "Partitioning of function in window systems\n", "abstract": " What is a window system? It is a manager for graphical display devices that divides the display surface into several windows along with a graphics library that understands them. In a multiprocess environment each window may be supported by a separate process. This paper examines the architectural issues involved in constructing a window system in such an environment. Emphasis is placed on the communication and synchronization problems that arise.", "num_citations": "6\n", "authors": ["17"]}
{"title": "Remembering eventful and uneventful word presentations\n", "abstract": " Recognition memory for a list of words was greatly enhanced when each word was presented along with the object it denoted and some relevant activity and comment by the experimenter. It is argued that this finding highlights the need for theory of memory to deal directly with presentation eventfulness.", "num_citations": "6\n", "authors": ["17"]}
{"title": "Modality effects\n", "abstract": " In the classic modality effect, immediate recall of the last few items from a verbal sequence is influenced by the presentation modality: Recall is more likely if the sequence is spoken aloud than if it is read silently. Most people are familiar with the experience of briefly retaining speech as if in a mental tape recorder and occasionally using this\" echoic\" memory to do a double take. An example is when one is asked the time while reading. The sounds linger in memory and one can recover them to get the meaning even if one was not paying attention at the exact moment when the question was asked. The auditory modality advantage Figure 1", "num_citations": "5\n", "authors": ["17"]}
{"title": "Assessment of retrieval strategy in incidental, intentional, and inclusion tests with word-fragment cues\n", "abstract": " The purpose of this study was to assess retrieval strategy in incidental, intentional, and inclusion tests with word-fragment cues following a levels-of-processing manipulation at study. The results of Exp. 1 showed small levels-of-processing effects in incidental tests, and most subjects reported involuntary rather than voluntary retrieval of study-list words. In an intentional test, although levels of processing had a much greater effect, quite a few subjects also reported involuntary rather than voluntary retrieval of study-list words, and these subjects showed a smaller effect of levels of processing than subjects reporting voluntary retrieval. These results suggest that subjects given instructions for both voluntary and involuntary retrieval of study-list words in an inclusion test might not in fact attempt voluntary retrieval at all, but simply adopt an involuntary retrieval strategy. The results of Exp. 2 provided evidence to …", "num_citations": "5\n", "authors": ["17"]}
{"title": "Concerning additional evidence of an auditory advantage in prerecency as well as recency recall\n", "abstract": " Comparisons of recall of spoken and written lists reveal an advantage in recall to spoken items. This auditory advantage is typically, but not invariably, restricted to recency items, and it is typically, but not invariably, removed when distractor items are spoken after the list. The effect has generally been attributed to a short-lived echoic memory store. An experiment is described in which, contrary to this view, an auditory advantage occurred when each list item was directly followed (and preceded) by a sequence of spoken distractors. This auditory advantage occurred for prerecency as well as recency items, and it occurred under free recall, serial recall, and backward recall conditions.", "num_citations": "5\n", "authors": ["17"]}
{"title": "Rehearsal and directed forgetting in adults with Asperger syndrome.\n", "abstract": " The main purpose of this chapter is to describe experiments in which we compared the encoding strategies of a group of adults with an ICD-10-based diagnosis of Asperger syndrome (AS) with those of a sample of typical adults (Smith, Gardiner & Bowler, 2007). More specifically, we investigated rehearsal processes at encoding both by measuring rehearsal directly, using an overt rehearsal technique, and by manipulating rehearsal by instructions given at study. We first review some previous evidence suggestive of possible differences in rehearsal style in adults with high-functioning autism (HFA). Second, we review some evidence of developmental shifts in the employment of encoding strategies in typically developing (TD) children, as well as children with autism, in order to consider possible implications for adults with autism. We go on to consider how our findings, which show that there are some differences in …", "num_citations": "4\n", "authors": ["17"]}
{"title": "An editor-based user interface toolkit\n", "abstract": " A toolkit has been constructed at the Information Technology Center for building interfaces between users and programs. Programs such as a help system, a mail system, a document editor, or a command language typescript all use the same facilities. They are individually easier to construct and have consistent user interfaces. The host system is a powerful personal workstation with a large bitmap display, rumfing 4.2 BSD Unix. The toolkit defines a set of data types. As programs manipulate instances of these types, the toolkit updates the screen image to show the changes to the user. Similarly, users can edit the objects and the program will be informed. The most powerful primitive data type is the document: building a text editor in the same class as Bravo [LAM78] or LisaWrite [APP84] on top of it is almost trivial.", "num_citations": "4\n", "authors": ["17"]}
{"title": "Attenuated binding of featural information in individuals with autism spectrum disorder\n", "abstract": " Background: Extensive evidence indicates that individuals from across the autism spectrum exhibit memory difficulties that mimic those observed in typical aging. For example, both populations show disproportionate difficulties on tests of free recall as compared to tests of recognition, both populations display impairments on episodic memory measures, and both groups exhibit problems in the sequential retrieval of information. This parallel is informative because it offers a useful heuristic device for further study and because it sheds light on possible neural mechanisms underlying the memory difficulties present in ASD.Objectives: To further explore the usefulness of the aging analogy to the study of memory in ASD by drawing on a paradigm developed by Chalfonte and Johnson (1996). These authors showed that compared to younger participants, older typical adults had intact memory for individual features (ie colour, identity, location) of a complex stimulus (a grid of coloured line drawings) but were impaired in their memory for combined features (ie colour-identity, location-identity).Methods: A sample of participants with ASD and typical individuals, matched on age and full-scale IQ, took part in the current investigation. On each of 5 separate testing sessions, participants were presented with 21 uniquely coloured line-drawings that appeared simultaneously for 1 minute in random locations of a 6x6 grid. Following Chalfonte and Johnson (1996), their memory was tested either for individual features only or for combinations of these features.Results: Our results show that individuals with ASD in comparison to typical individuals exhibit a marked …", "num_citations": "3\n", "authors": ["17"]}
{"title": "Method and apparatus for automatically archiving and clearing intellectual property\n", "abstract": " One embodiment of the present invention provides a system for archiving and clearing a document for publication. Upon receiving the document, the system takes actions to archive the document in a database. In doing so, the system automatically records a date upon which the document is archived. Next, the system receives a request to clear the document for publication. This causes the system to send an approval request to a first clearing authority. Upon receiving an approval from the first clearing authority, the system proceeds to clear the document for publication. Otherwise, if a denial is received from the first clearing authority, the system prevents the document from being cleared for publication. In one embodiment of the present invention, when the system receives an approval from the first clearing authority, the system sends an approval request to a second clearing authority. Upon receiving an approval …", "num_citations": "3\n", "authors": ["17"]}
{"title": "Electromagnetic brain activity during incidental and intentional retrieval shows dissociation of retrieval mode from retrieval success\n", "abstract": " Leipziger Strasse 44, 39120 Magdeburg, Germany Square, London EC1V 0HB, England Combined direct-current EEG and MEG recordings were obtained from 9 healthy subjects during a word-stem completion test. In the intentional condition stems were to be completed with previously studied words. In the incidental condition stems were to be completed with the first word coming to mind. In both conditions subjects judged whether or not the completed word was presented in the study list. With both EEG and MEG a sustained (2 seconds) late right-frontal shift (positive in EEG) distinguished intentional from incidental retrieval. This shift occurred in comparisons involving stems corresponding to both studied and unstudied words. Earlier posterior retrieval effects (ie, the parietal old/new effect) were dissociated from the right-frontal effect either by showing no difference (unstudied items) or a difference with opposite …", "num_citations": "3\n", "authors": ["17"]}
{"title": "Set-top boxes—the next platform (panel)\n", "abstract": " Successive price/performance iterations in computer and computer graphics technology have increased the penetration of this technology into everyday life. Access to early computer graphics technology, based on large computers and specialized displays, was limited to computer professionals. A larger portion of the population had access to high performance computer graphics technology as prices dropped and performance increased through successive generations of minisupercomputers, workstations, and personal computers. However, this population is still primarily limited to the workplace. Set-top boxes are poised as the next big price/performance step. With this step, computer graphics and high performance computing technology are expected to achieve significant penetration into the home market. How's all this going to happen? What hardware is being built for set-top boxes? What software is going to …", "num_citations": "3\n", "authors": ["17"]}
{"title": "Ace: a syntax-driven C preprocessor\n", "abstract": " This document presents the ace preprocessor for C programs. Unlike cpp, which operates on characters, ace operates on syntax trees. The user specifies syntax trees which are used as templates against which program fragments are matched. Positive matches cause trees to be rewritten. Ace can be used as a special-purpose optimizer that can be controlled by the programmer.", "num_citations": "3\n", "authors": ["17"]}
{"title": "Window System Architecture: History, Terms and Concepts\n", "abstract": " This chapter defines and explains the terms that commonly describe window systems. It establishes a general level of understanding for future chapters. The four parts of this chapter offer:                                     a layered model of window systems;                                                     a historical survey of window systems, illustrating how a number of systems fit into the model;                                                     a detailed review of the components of the layered model;                                                     an examination of the relationship between window system architectures and their environments.", "num_citations": "3\n", "authors": ["17"]}
{"title": "Screen postscript\n", "abstract": " Well, I want to welcome all of you to this afternoon's session on Display PostScript, or as the title indicates, Screen PostScript. I think, judging by the number of people who have shown up, it's going to be a very interesting session for all of you, and certainly all of us on the panel are excited to have an opportunity to present our ideas in this area that's become a very popular one in the industry.", "num_citations": "3\n", "authors": ["17"]}
{"title": "Readings in human memory\n", "abstract": " Human memory: a proposed system and its control processes M. GLANZER and AR CUNITZ (1966) Two storage mechanisms in free recall 4 FIM CRAIK (1970)", "num_citations": "3\n", "authors": ["17"]}
{"title": "First experiments in psychology\n", "abstract": " The aim of this book is to introduce the basic principles of experimental design in the context of carrying out experiments. None of the experiments requires previous knowledge of experimental psychology and very few require special laboratory equipment.", "num_citations": "3\n", "authors": ["17"]}
{"title": "Display panel with a computer icon\n", "abstract": " FIG. 2 is a front view of thereof; FIG. 3 is a front view of a second embodiment thereof; FIG. 4 a front view of a third embodiment thereof; FIG. 5 is a front view of a fourth embodiment thereof; FIG. 6 is a front view of a fifth embodiment thereof; FIG. 7 is a front view of a sixth embodiment thereof, and,", "num_citations": "2\n", "authors": ["17"]}
{"title": "Knowledge of speaker's voice and release from proactive inhibition\n", "abstract": " This study examined the effects of monitoring speaker's voice in the Wickens' attribute shift paradigm and, in addition, subsequently measured voice retention in a recognition test. Monitoring voice appeared to enhance the release effect obtained, but neither monitoring nor shift conditions led to superior voice recognition for the final trial. These data are used to support the position that release effects are determined not so much by the registration of the critical attribute as such, but by the extent to which that attribute can be utilized in retrieving the to-be-remembered items.", "num_citations": "2\n", "authors": ["17"]}
{"title": "Il linguaggio Java. Manuale ufficiale\n", "abstract": " Beautiful buildings are more than scientific. They are true organisms, spiritually conceived; works of art, using the best technology by inspiration rather than the idiosyncrasies of mere taste or any averaging by the committee mind.", "num_citations": "1\n", "authors": ["17"]}
{"title": "Display panel with a computer icon\n", "abstract": " Priority date (The priority date is an assumption and is not a legal conclusion. Google has not performed a legal analysis and makes no representation as to the accuracy of the date listed.) 1997-11-03", "num_citations": "1\n", "authors": ["17"]}
{"title": "What is the big idea?\n", "abstract": " Considers how to improve exhibition design in order to make it more accessible and appealing to the public, mainly with regard to history museums, but with a mention of London's National Portrait Gallery.;", "num_citations": "1\n", "authors": ["17"]}
{"title": "The Real-Time for Java Expert Group\n", "abstract": " In 1997 the idea of writing real-time applications in the Java programming language seemed unrealistic. Real-time programmers talk about wanting consistent timing behavior more than absolute speed, but that doesn’t mean they don’t require excellent overall performance. The Java runtime is sometimes interpreted, and almost always uses a garbage collector. The early versions were not known for their blistering performance.Nevertheless, Java platforms were already being incorporated into real-time systems. It is fairly easy to build a hybrid system that uses C for modules that have real-time requirements and other components written to the Java platform. It is also possible to implement the Java interpreter in hardware (for performance), and integrate the system without a garbage collector (for consistent performance). aJile Systems produces a Java processor with acceptable real-time characteristics. Until the summer of 1998, efforts toward support for real-time programming on the Java platform were fragmented. Kelvin Nilsen from NewMonics and Lisa Carnahan from the National Institute for Standards and Technology (NIST) led one effort, Greg Bollella from IBM led a group of companies that had a stake in Java technology and real-time, and Sun had an internal real-time project based on the Java platform.", "num_citations": "1\n", "authors": ["17"]}
{"title": "Method and apparatus for resolving data references in generated code\n", "abstract": " A hybrid compiler-interpreter comprising a compiler for\" compiing\" source program code, and an interpreter for interpreting the\" compiled\" code, is provided to a computer system. The compiler comprises a code generator that generates code in intermediate form with data references made on a symbolic basis. The interpreter comprises a main interpretation routine, and two data reference handling routines, a dynamic field reference routine for handling symbolic references, and a static field reference routine for handling numeric references. The dynamic field reference routine, when invoked, resolves a symbolic reference and rewrites the symbolic reference into a numeric reference. After rewriting, the dynamic field reference routine returns to the main interpretation routine without advancing program execution to the next instruction thereby allowing the rewritten instruction with numeric reference to be reexecuted …", "num_citations": "1\n", "authors": ["17"]}
{"title": "The Java programming language/the Java tutorial/the Java language specification/the Java virtual machine specification/and others\n", "abstract": " Hayes reviews\" The Java Programming Language\" by Ken Arnold and James Gosling,\" The Java Tutorial\" by Mary Campione and Kathy Walrath,\" The Java Language Specification\" by James Gosling, Bill Joy and Guy Steele,\" The Java Virtual Machine Specification\" by Tom Lindholm and Frank Yellin, and others.", "num_citations": "1\n", "authors": ["17"]}
{"title": "The Journal Language Specification\n", "abstract": " CiNii 論文 - The Journal Language Specification CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号 ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 [7/12更新]2022年4月1日からの CiNii ArticlesのCiNii Researchへの統合について The Journal Language Specification GOSLING J. 被引用文献: 1件 著者 GOSLING J. 収録刊行物 The Java Series The Java Series, 1997 Addison-Wesley 被引用文献: 1件中 1-1件を 表示 1 細粒度マルチスレッディングのための言語 処理系技術(1) 田浦 健次朗 , Kenjiro Taura , 東京大学 , University of Tokyo コンピュータ ソフトウェア 00016(00002), 1-19, 1999-03-15 参考文献45件 被引用文献2件 Tweet 各種コード NII論文ID(NAID) 10000072031 資料種別 図書の一部 データ提供元 CJP引用 書き出し RefWorksに…", "num_citations": "1\n", "authors": ["17"]}
{"title": "Window toolkit and applets\n", "abstract": " Window Toolkit and Applets | Guide books ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksWindow Toolkit and Applets ABSTRACT No abstract available. Comments Login options Check if you have access through your login credentials or your institution to get full access on this article. Sign in Full Access Get this Publication Information Contributors Published in Guide books cover image Window Toolkit and Applets May 1996 448 pages ISBN:0201634597 Authors: James Gosling, Frank Yellin Copyright © 1996 Publisher Addison-Wesley Longman Publishing Co., Inc. United States Publication History Published: 1 May 1996 …", "num_citations": "1\n", "authors": ["17"]}
{"title": "Network applications and NeWS\n", "abstract": " Sun’s Network/extensible Window System (NeWS) was designed for use within a distributed network environment. A NeWS network can be heterogeneous, composed of many different systems. More than 50 companies have licensed NeWS, and it has been ported to more than ten different platforms. Developers are already building applications for NeWS that span a network of machines.", "num_citations": "1\n", "authors": ["17"]}
{"title": "System aspects of low-cost bitmapped displays\n", "abstract": " The design of low-cost bitmapped displays is reviewed from the perspective of the implementors of a window manager for a Unix system. The interactions between RasterOp hardware, the multiprocess structure of Unix software, and the functions of the window manager are discussed in the form of a checklist of features for hardware designers.", "num_citations": "1\n", "authors": ["17"]}
{"title": "Making sense of a journal article\n", "abstract": " This chapter aims to tell student researcher a little about how research is published and to guide them through reading one particular article. It provides some general rules for reading journal articles. Journal articles are written in quite technical language. The intended readership is other researchers, rather than undergraduate students. The abstract, which is restricted in length gives a succinct summary of the entire article. At the very end of the article, it is usual to state the dates on which the original manuscript was submitted and the paper accepted for publication. The article was published in Memory & Cognition in 1984. It is reproduced in full, by kind permission of the owners of the copyright, the original publishers, the Psychonomic Society. According to that hypothesis, the generation effect is due to enhanced activation of the semantic features of a word’s representation in the subjective lexicon.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Nachgefragt\n", "abstract": " Das Hautarztverfahren wird eingeleitet, wenn bei–auch bereits geringen–Hautveränderungen die Möglichkeit besteht, dass diese berufsbedingt verursacht wurden. Hierbei kommt dem Hautarztverfahren die Rolle eines Vorfeldverfahrens zu, das heißt, dass das Hautarztverfahren möglichst frühzeitig angewendet werden sollte, bevor die Hauterkrankung soweit fortschreitet, dass sie zur Aufgabe der Tätigkeit zwingt und somit die Voraussetzungen zur Anerkennung einer Berufskrankheit der Haut (BK Nr. 5101) voll umfänglich vorliegen. Ziel ist hierbei eine dem jeweiligen Einzelfall angepasste optimierte individuelle Prävention und damit die Vermeidung einer Berufsaufgabe und Berufskrankheit.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Objects first with Java: A practical introduction using\n", "abstract": " Objects First With Java: Page 1 International Journal of People-Oriented Programming Volume 6 • Issue 2 • July-December 2017 ﻿ Copyright﻿©﻿2017,﻿IGI﻿Global.﻿Copying﻿or﻿distributing﻿in﻿print﻿or﻿electronic﻿forms﻿without﻿written﻿permission﻿of﻿IGI﻿Global﻿is﻿prohibited. ﻿ 51 Objects First With Java: A Practical Introduction Using BlueJ (5th Edition) Reviewed by Steve Goschnick, School of Design, Swinburne University of Technology, Melbourne, Australia Objects First with Java: A Practical Introduction Using BlueJ (5th Edition) David Barnes & Michael Kölling (c) 2012 by Pearson Education, Inc. 546 pp. $17.99 ISBN 978-0-13-283554-1 This﻿is﻿a﻿book﻿specifically﻿for﻿teaching﻿Java﻿that﻿would﻿be﻿suitable﻿to﻿students﻿in﻿either:﻿ the﻿middle﻿to﻿upper﻿end﻿of﻿high﻿school,﻿or﻿even﻿a﻿first-year﻿university﻿or﻿college﻿course.﻿ It﻿is﻿also﻿about﻿teaching﻿object-oriented﻿programming﻿(OOP),﻿with﻿a﻿leaning﻿towards﻿ software﻿engineering﻿by﻿way﻿of﻿introducing﻿several﻿…", "num_citations": "0\n", "authors": ["17"]}
{"title": "The state of the Java universe\n", "abstract": " Speaker Bio: James Gosling received a B.Sc. in computer science from the University of Calgary, Canada in 1977. He received a Ph.D. in computer science from Carnegie-Mellon University in 1983. The title of his thesis was The Algebraic Manipulation of Constraints. He has built satellite data acquisition systems, a multiprocessor version of UNIX®, several compilers, mail systems, and window managers. He has also built a WYSIWYG text editor, a constraint-based drawing editor, and a text editor called Emacs, for UNIX systems. At Sun his early activity was as lead engineer of the NeWS window system. He did the original design of the Java programming language and implemented its original compiler and virtual machine. He has recently been a contributor to the Real-Time Specification for Java.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Rehearsal and directed forgetting in adults with Asperger’s Syndrome\n", "abstract": " Rehearsal and directed forgetting in adults with Asperger’s Syndrome - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight Rehearsal and directed forgetting in adults with Asperger’s Syndrome Smith, Brenda J. and Gardiner, John M. (2011) Rehearsal and directed forgetting in adults with Asperger’s Syndrome. In, Boucher, Jill and Bowler, Dermot (eds.) Memory in Autism: Theory and Evidence. Cambridge, GB. Cambridge University Press, pp. 249-267. Record type: Book Section Full text not available from this repository. More information Published date: January 2011 Related URLs: …", "num_citations": "0\n", "authors": ["17"]}
{"title": "NE インタビュー Google 社の戦略には疑問を感じている--米 Sun Microsystems, Inc., Vice President and Sun Fellow James Gosling 氏\n", "abstract": " 「Java の父」. こう呼ばれているのが, プログラミング言語 Java の仕様を設計し, 最初の実装を行った Gosling 氏である. Java は企業システムの構築ではもはやデファクト・スタンダードであり, 組み込みソフトウエア開発でも携帯電話機を中心に広く使われている.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Method and apparatus for preserving null semantics during use of a forwarding method\n", "abstract": " One embodiment of the present invention provides a system that facilitates moving an original method from a source class to a destination class and for constructing a corresponding forwarding method in the source class that preserves null semantics. During operation, the system translates the original method from the source class into a corresponding moved method, and then incorporates the moved method into the destination class. The system also constructs a forwarding method that invokes the moved method in the destination class. The system then replaces the original method in the source class with the forwarding method. In this way, invoking the forwarding method in the source class causes the moved method to be invoked in the destination class. While constructing the forwarding method, the system generates code that checks whether a “source parameter” of the original method whose class matches …", "num_citations": "0\n", "authors": ["17"]}
{"title": "RECOLLECTIVE EXPERIENCE\n", "abstract": " The function of conscious awareness in memory has gained a fresh import-ance in contemporary memory research. This importance stems largely from two related sets of findings: neuropsychological findings from studies with amnesic patients and findings of related patterns of functional dissociation from studies with memory-unimpaired adults. Both sets of findings can be described in terms of the distinction that has been made between explicit and implicit memory tests (Graf & Schacter, 1985; see Schacter, 1987, for a recent review). Explicit memory tests are those in which subjects are asked to remember, in the sense of being able consciously to recollect, prior events and experiences. Such tests include conventional episodic memory tests such as recognition and recall. Implicit memory tests are those in which the conscious recollection of prior events and experiences is not required. Such tests include perceptual identification, lexical decision, and word-stem and word-fragment completion. The priming effects observed in these implicit memory tests (superior performance on items that have been previously encountered", "num_citations": "0\n", "authors": ["17"]}
{"title": "2.17 Remembering and Knowing\n", "abstract": " Tulving's (1983, 1985) original proposal was of three kinds of consciousness, each reflecting one of three memory systems. The three kinds of con-sciousness were autonoetic, noetic, and anoetic, which respectively mean self-knowing, knowing, and not knowing. The three corresponding memory systems were episodic, semantic, and procedural memory. Only autonoetic and noetic consciousness involve awareness of memory. Anoetic consciousness is bound to the present, not the past, and involves awareness of the current situation. Autonoetic con-sciousness allows awareness of oneself in a previous situation, in the sense of what has been called mental time travel. It allows one to reexperience previous events and to relive them mentally, including one's own part in them. It is characteristic of episodic memory, which therefore entails something more than, or other than, autobiographical memory.", "num_citations": "0\n", "authors": ["17"]}
{"title": "The role of attention and consistency with schema expectation in memory for objects in place\n", "abstract": " The role of attention and consistency with schema expectation in memory for objects in place were examined in one experiment. Forty participants were asked to study a picture of either the graduate student office or the preschool classroom, and either under full attention condition or under divided attention condition. Sixteen stimulus items, half consistent and half inconsistent with schema expectation about the room settings were placed throughout the room. Participants were later given a free recall test, followed by a same-changed recognition memory test immediately after that. The results show that participants remembered better under full attention condition than under divided attention condition. Items inconsistent with schema expectation were better recalled and recognized than items consistent with schema expectation both under full attention and divided attention conditions. These results support the findings on the consistency effect in some previous studies. More importantly, the present study reveals the influence of manipulation of attention on the consistency effect. The results show that consistency effect occurs in both conditions, with a greater effect reported under divided attention condition than under full attention condition. Reducing the participants’ attention increases the consistency effect.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Paolo Bartolomeo, Caroline Decaix, Eric Siéroff. The phenomenology of endogenous orienting\n", "abstract": " P. Piolino, M. Hisland, I. Ruffeveille, V. Matuszewski, I. Jambaqué, F. Eustache, Guy Pinku, Joseph Tzelgov, Dermot M. Bowler & John M. Gardiner, Paolo Bartolomeo, Caroline Decaix, Eric Siéroff. The phenomenology of endogenous orienting - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Paolo Bartolomeo, Caroline Decaix, Eric Siéroff. The phenomenology of endogenous orienting P. Piolino, M. Hisland, I. Ruffeveille, V. Matuszewski, I. Jambaqué, F. Eustache, Guy Pinku, Joseph Tzelgov, Dermot M. Bowler & John M. Gardiner Consciousness and Cognition 15:765-766 (2006) Authors Guy Moshe Pinku Kibbutzim College Florence Eustache Université de Fribourg Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Paolo Bartolomeo, Caroline Decaix, Eric Siéroff. The phenomenology of endogenous orienting\n", "abstract": " Fred H. Previc, P. Piolino, M. Hisland, I. Ruffeveille, V. Matuszewski, I. Jambaqué, F. Eustache, Guy Pinku, Joseph Tzelgov & Monica Meijsing, Paolo Bartolomeo, Caroline Decaix, Eric Siéroff. The phenomenology of endogenous orienting - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Paolo Bartolomeo, Caroline Decaix, Eric Siéroff. The phenomenology of endogenous orienting Fred H. Previc, P. Piolino, M. Hisland, I. Ruffeveille, V. Matuszewski, I. Jambaqué, F. Eustache, Guy Pinku, Joseph Tzelgov & Monica Meijsing Consciousness and Cognition 15:484 (2006) Authors Guy Moshe Pinku University of Haifa Florence Eustache Université de Fribourg Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Philosophy of …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Hello World (s)!: From Code to Culture: a 10 Year Celebration of Java Technology\n", "abstract": " Foreword 2005 marks t he 10th birthday of Java technology. Starting out as just a programming language, Java technology has exploded into a ubiquitous technology platform that today touches the lives of people everywhere. The 10th birthday celebration book tells the story of how Java technology came to influence technologists, then businesses, then consumers, and now has become the predominate software on the planet. In the early 1990s, a small group of us from Sun Microsystems were given the opportunity to spend all of our time thinking of what\" the next big thing in technology\" would be. What we created was a hardware-independent software platform unlike any other. We thought it was pretty cool, and so did our developer friends. But at that time, I don't think that any of us really had any idea of what we had done, not to mention how it would change the world. I certainly know I didn't. Of course, it wouldn't have happened if it wasn't for the Java developer community. Developers are the ones who made the technology a success over the years. Their ingenuity, creativity, and millions of hours of contributed help has made the platform what it is today. We're lucky to have millions of developers constantly driving it forward into the future. Every day I hear about new and cool uses for Java technology. I'm gratified, and still constantly amazed. James Gosling\" Father of Java\"© Copyright Pearson Education. All rights reserved.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Introduction to golden gate\n", "abstract": " This document may be subject to US export control laws and regulations. By accepting this document, the user agrees to comply with all applicable US export laws and regulations, including the International Traffic and Arms Regulations, 22 CFR 120-1 30 and the Export Administration Regulations, 15 CFR 730-744. User has the responsibility to obtain export licenses, or other export authority as may be required before exporting such information to foreign countries or providing access to foreign persons.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Java 的 “前世今生”——与 “Java 之父” 话 Java\n", "abstract": " 1995 年, Java 还仅仅是一种计算机语言概念; 而到了今天, 经过 8 年发展, Java 技术已经渗透到了世界的各个角落——小到生活中的电话, 烤面包机, 大到汽车生产乃至控制 “火星漫游者” 的临界任务系统中, 都有它的身影. 据不完全统计, 当今全球已经拥有超过 300 万的 Java 开发者, 超过 2.67 亿部支持 Java 的电话, 以及有超过 3 亿的 Java 卡在世界各地被配置. 更有甚者, 在与其对手 “NET” 的竞争中, Java 也逐渐站稳了脚跟. 那么, Java 将如何加快自己的市场化步伐, 带领 Sun 走出连续几个财季的亏损呢? 在下一个 8 年, Java 又将走向何方? 它会不会被更新的技术所取代? 许多关于 Java 的问题始终萦绕在关心其发展的人的周围.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Java テクノロジー JavaOne Japan ゴスリングが語る生誕 10 年の Java 開発の動機となったデジタル家電--スマートカードからスーパーコンピュータまで 「一度書けば, どこでも走る」 はもう現実\n", "abstract": " CiNii 論文 - Javaテクノロジー JavaOne Japan ゴスリングが語る生誕10年のJava開発の動機となっ たデジタル家電--スマートカードからスーパーコンピュータまで「一度書けば,どこでも走る」はもう現実 CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年 まで 検索 検索 検索 [10/4更新]2022年4月1日からのCiNii ArticlesのCiNii Researchへの統合 について Javaテクノロジー JavaOne Japan ゴスリングが語る生誕10年のJava開発の動機となった デジタル家電--スマートカードからスーパーコンピュータまで「一度書けば,どこでも走る」はもう現実 Gosling James 著者 Gosling James 収録刊行物 コンピュ-トピア コンピュ-トピア 36(424), 114-120, 2002-01 コンピュ-タ・エ-ジ社 大学院説明会 Tweet 各種コード NII論文ID(NAID) 40000009075 …", "num_citations": "0\n", "authors": ["17"]}
{"title": "\" Memory illusions: False recall and recognition in adults with Asperger's syndrome\": Correction to Bowler et al.(2000).\n", "abstract": " Reports an error in\" Memory illusions: False recall and recognition in adults with Asperger's syndrome\" by Dermot M. Bowler, John M. Gardiner, Sarah Grice and Pia Saavalainen (Journal of Abnormal Psychology, 2000 [Nov], Vol 109 [4], 663-672). On page 665, Figure 1, the figure caption incorrectly reads,\" Serial position effects for the Asperger and control groups of participants. Gray boxes= Asperger; black boxes= controls.\" The correct Figure 1 caption appears in the correction.(The following abstract of the original article appeared in record 2000-12687-011.) As persons on the autistic spectrum are known not to use semantic features of word lists to aid recall, they might show diminished susceptibility to illusory memories that typically occur with lists of associated items. Alternatively, since such individuals also have poor source monitoring, they might show greater susceptibility. The authors found that adults with …", "num_citations": "0\n", "authors": ["17"]}
{"title": "C 言語の仲間達--伝説の 3 人が語る James Gosling/Dennis Ritchie/Bjarne Stroustrup へのインタビュー\n", "abstract": " CiNii 論文 - C言語の仲間達--伝説の3人が語るJames Gosling/Dennis Ritchie/Bjarne Stroustrupへ のインタビュー CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学 図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版 年 年から 年まで 検索 検索 検索 [10/4更新]2022年4月1日からのCiNii ArticlesのCiNii Researchへ の統合について C言語の仲間達--伝説の3人が語るJames Gosling/Dennis Ritchie/Bjarne Stroustrupへのインタビュー Gosling James Ritchie Dennis Stroustrup Bjarne [他] 著者 Gosling James Ritchie Dennis Stroustrup Bjarne [他] 収録刊行物 Bit Bit 33(4), 94-100, 2001-04 共立 出版 Tweet 各種コード NII論文ID(NAID) 40000003098 NII書誌ID(NCID) AN00000416 本文言語 コード JPN ISSN 03856984 NDL 記事登録ID 5737497 NDL 雑誌分類 ZM13(科学技術--科学…", "num_citations": "0\n", "authors": ["17"]}
{"title": "C 言語の仲間達--伝説の 3 人が語る James Gosling, Dennis Ritchie, Bjarne Stroustrup へのインタビュー (1)\n", "abstract": " CiNii 論文 - C言語の仲間達--伝説の3人が語る James Gosling,Dennis Ritchie,Bjarne Stroustrupへ のインタビュー(1) CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学 図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版 年 年から 年まで 検索 検索 検索 [10/4更新]2022年4月1日からのCiNii ArticlesのCiNii Researchへ の統合について C言語の仲間達--伝説の3人が語る James Gosling,Dennis Ritchie,Bjarne Stroustrupへのインタビュー(1) Sutter Herb Gosling James Ritchie Dennis [他] 著者 Sutter Herb Gosling James Ritchie Dennis [他] 収録刊行物 Bit Bit 33(2), 18-26, 2001-02 共立出版 大学院 説明会 Tweet 各種コード NII論文ID(NAID) 40000003053 NII書誌ID(NCID) AN00000416 本文 言語コード JPN 資料種別 翻訳 ISSN 03856984 NDL 記事登録ID 5640128 NDL 雑誌分類 …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Display panel with a computer icon\n", "abstract": " Priority date (The priority date is an assumption and is not a legal conclusion. Google has not performed a legal analysis and makes no representation as to the accuracy of the date listed.) 1997-11-03", "num_citations": "0\n", "authors": ["17"]}
{"title": "Contributors to Volume 104\n", "abstract": " Orjerg terarg $50 or less rust ce prepca Allow--veeks tr dellvery PS is y cole et accrcnol (ir viceci) crarge c orde y/SA or Vasterccra coli 733), 24 7/735 3r EAX (7) 3) 525-5 (31 T le r: ls; crr ce 3ccepte", "num_citations": "0\n", "authors": ["17"]}
{"title": "Source Memory in Adults with Asperger's Syndrome\n", "abstract": " The memory difficulties of people with Asperger's syndrome/autism may relate to the degree of support available to the subject and the degree of control needed during remembering (Bowler et al., 1997). This observation may explain the mixed findings on source memory in autism: Benetto et al (1996) report increased intrusions of items from earlier lists in a multi-list free-recall paradigm (no support), yet Farrant (1998) reported no impairment in identification of which of two experimenters had spoken a particular word (support present). We report two studies of the effects of presence or absence of suport on source memory in individuals with Asperger's syndrome. In Experiment 1, subjects were asked to perform one of four things (think of an associate, generate the opposite of the word, think of an action related to the word or think of a word that rhymes with it) on studied words. At test, they were asked either to recall …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Obsolete current version is 1.0. 1 The Real-Time Specification\n", "abstract": " The Real-Time for Java Expert Group (RTJEG), convened under the Java Community Process and JSR-000001, has been given the responsibility of producing a specification for extending The Java Language Specification and The Java VirtualMachine Specification and of providing an Application Programming Interface that will enable the creation, verification, analysis, execution, and management of Java threads whose correctness conditions include timeliness constraints (also known as real-time threads). This introduction describes the guiding principles that the RTJEG created and used during our work, a description of the real-time Java requirements developed under the auspices of The National Institute for Standards and Technology (NIST), and a brief, high-level description of each of the seven areas we identified as requiring enhancements to accomplish our goal.", "num_citations": "0\n", "authors": ["17"]}
{"title": "インタビュー ジェームズ・ゴスリング氏 米サン・マイクロシステムズ副社長兼フェロー Java の真価は\" オープン\" にある 秘密のないことが, 強さの秘訣\n", "abstract": " Java の開発において中心的な役割を務めてきたジェームズ・ゴスリング氏に, Java を取り巻く最近の動きを聞いた.「マイクロソフトとの裁判には大きなエネルギを使ったが, 自分の役割はほとんど終わった」 と語る.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Article ID ccog. 1999.0425, available online at http://www. idealibrary. com on\n", "abstract": " A. Bartels, Edoardo Bisiach, Michael Brecht, Larry Cahill, C. Richard Chapman, Garvin Chastain, MaryLou Cheal, J. Allan Cheyne, AJ Clarke & Norman D. Cook, Article ID ccog. 1999.0425, available online at http://www. idealibrary. com on - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Article ID ccog. 1999.0425, available online at http://www. idealibrary. com on A. Bartels, Edoardo Bisiach, Michael Brecht, Larry Cahill, C. Richard Chapman, Garvin Chastain, MaryLou Cheal, J. Allan Cheyne, AJ Clarke & Norman D. Cook Consciousness and Cognition 8:586 (1999) Authors Alan Clarke University of Malta Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Science of Consciousness in Philosophy of Cognitive Science (…", "num_citations": "0\n", "authors": ["17"]}
{"title": "Illusory Memories in the Free Recall of High-Functioning Individuals with Autism.\n", "abstract": " Several recent studies have shown that adults usually free recall lists of semantically related words better than lists of unrelated words. Subjects also typically tend to include a non-studied word in free recall when that word is a strong associate of the study list items. Since individuals with autistic spectrum disorder have been shown not to make use of category information to aid their free recall, we hypothesised that they would not show the illusory memory effect just described. We asked high-functioning adults with autism and IQ-matched controls to recall 12 lists of words. Each list comprised the 15 strongest associates of a non-presented target word. Although our results replicated existing findings on impaired free recall in autism, we found that the adults with autism did not differ from the controls in the proportion of non-presented target items produced in free recall. But they did generate significantly more non …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Lost Victorians.\n", "abstract": " Deals with the diminished appreciation of the people and the values of the Victorian period in the popular consciousness of Great Britain in the twentieth century. Role of the First World War in the anti-Victorian mood; Period Victorian home furnishing, taboos and legal constraints were removed; Status of Victorian values in the Second World War.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Kai Vogeley, Martin Kurthen, Peter Falkai, and Wolfgang Maier. Essential Functions of the Human\n", "abstract": " Elkhonon Goldberg, Kenneth Podell, J. Proust, Karl H. Pribram, Vittorio Gallese, Marianne Hammerl, Andy P. Field, Frederick Travis, R. Keith Wallace & J. Allan Cheyne, Kai Vogeley, Martin Kurthen, Peter Falkai, and Wolfgang Maier. Essential Functions of the Human - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Kai Vogeley, Martin Kurthen, Peter Falkai, and Wolfgang Maier. Essential Functions of the Human Elkhonon Goldberg, Kenneth Podell, J. Proust, Karl H. Pribram, Vittorio Gallese, Marianne Hammerl, Andy P. Field, Frederick Travis, R. Keith Wallace & J. Allan Cheyne Consciousness and Cognition 8:270 (1999) Authors Joëlle Proust Institut Jean Nicod Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Science …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Episodic memory in high-functioning autism.\n", "abstract": " Investigations of memory in individuals with autism have consistently reported impairments in free recall in the presence of intact cued recall and recognition memory. Tulving has argued that free recall employs the episodic memory system, in which recall is accompanied by a distinct recollective experience and can be measured experimentally in a recognition memory paradigm by asking subjects to indicate whether they consciously'remember'a study-list item, or whether they just'know'that it was on the list, without recollection of the specific episode. In view of the hypothesised link between free recall and episodic memory, we asked high-functioning individuals with autism (HFA) and controls matched on age, gender and verbal IQ. to study lists of high-and low-frequency words and, after a delay, to indicate whether they remembered having seen a study list item before. We found that the HFA subjects were not …", "num_citations": "0\n", "authors": ["17"]}
{"title": "A Hardcastle, Valerie Gray, 173 Pauen, Michael, 202 Peters, Madelon L., 27 Heywood, CA, 410 Azzopardi, Paul, 292 Hirshman, Elliot, 103 Hobson, J. Allan, 67 RB\n", "abstract": " Valerie Huemer, Cristina Ramponi, Talis Bachmann, G. Keith Humphrey, Antti Revonsuo, Marlene Behrmann, Raffaella Ricci, Neil Binder, Edoardo Bisiach & Marc Jeannerod, A Hardcastle, Valerie Gray, 173 Pauen, Michael, 202 Peters, Madelon L., 27 Heywood, CA, 410 Azzopardi, Paul, 292 Hirshman, Elliot, 103 Hobson, J. Allan, 67 RB - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search A Hardcastle, Valerie Gray, 173 Pauen, Michael, 202 Peters, Madelon L., 27 Heywood, CA, 410 Azzopardi, Paul, 292 Hirshman, Elliot, 103 Hobson, J. Allan, 67 RB [Book Review] Valerie Huemer, Cristina Ramponi, Talis Bachmann, G. Keith Humphrey, Antti Revonsuo, Marlene Behrmann, Raffaella Ricci, Neil Binder, Edoardo Bisiach & Marc Jeannerod Consciousness and Cognition 7:647 (…", "num_citations": "0\n", "authors": ["17"]}
{"title": "インタビュ-Java でネットワ-クを透明に, すべての複雑さを消し去る\n", "abstract": " CiNii 論文 - インタビュ- Javaでネットワ-クを透明に,すべての複雑さを消し去る CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者 所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 2022年4月 1日からのCiNii ArticlesのCiNii Researchへの統合について インタビュ- Javaでネットワ-クを透明に ,すべての複雑さを消し去る Gosling James 著者 Gosling James 収録刊行物 日経コミュニケ-ション 日経コミュニケ-ション (228), 98-100, 1996-08-19 日経BP社 Tweet 各種コード NII論文ID(NAID) 40004577377 NII書誌ID(NCID) AN10063933 本文言語コード JPN ISSN 09107215 NDL 記事登録ID 4011161 NDL 雑誌分類 ZM1(科学技術--科学技術一般) NDL 請求記号 Z14-1140 データ提供元 NDL 書き出し RefWorksに書き出し EndNoteに書き出し Mendeleyに書き出し …", "num_citations": "0\n", "authors": ["17"]}
{"title": "3.0 tasks, retrieval strategies, and states of consciousness: A framework\n", "abstract": " Alan Richardson-Klavehn, John M. Gardiner & Rosalind I. Java, 3.0 tasks, retrieval strategies, and states of consciousness: A framework - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search 3.0 tasks, retrieval strategies, and states of consciousness: A framework Alan Richardson-Klavehn, John M. Gardiner & Rosalind I. Java In G. Underwood (ed.), Implicit Cognition. Oxford University Press. pp. 85 (1996) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Conscious and Unconscious Memory in Philosophy of Cognitive Science Memory and Cognitive Science in Philosophy of Mind (categorize this paper) Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request …", "num_citations": "0\n", "authors": ["17"]}
{"title": "BRIEF REPORTS Maintenance rehearsal affects knowing, not remembering; elaborative rehearsal affects remembering, not knowing\n", "abstract": " In a directed-forgetting paradigm, each word in a study list was followed by a cue designating that word as either learn or forget.'this cue appeared after either a short or a long delay. It was assumed that a long delay would increase maintenance rehearsal of all the words, and that only the words followed by a learn cue would be rehearsed elaboratively. Moreover, because the interval between the words was constant, a short cue delay should allow more time for elaborative rehearsal. In a subsequent test, subjects made remember or know responses to indicate whether recognition ofeach ward was accompanied by conscious recollection or by feelings of familiarity in the absence of conscious recollection. The hypothesis wasthat remembering depends on elaborative rehearsal, and knowing depends on maintenance rehearsal. In accord with this hypothesis, the learn-versus-forget designation influenced remember …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Psychology Division, City University, London, UK\n", "abstract": " In this paper, I am going to describe an empirical law which concerns the relationship between recognition and recall. It seems appropriate to call it the Tulving-Wiseman Law, in honour of those who first discovered the regularity that it summarizes (Tulving & Wiseman, 1975). By empirical law is meant simply a statement that summarizes some regularity in a definable set of observations, without any attempt at further explaining that regularity. In this case, there are three aspects to the claim that the observed regularity represents an empirical law. First, the statement normally holds true for the general situation defined, that is, for all experiments of a particular type, despite many differences between these experi-ments, and wide variation in the levels of recognition and recall performance. Second, the law can be expressed mathematically. Third, exceptions to the law occur, in the sense that even in the general situation defined not every observation conforms with the law.These observations are critical to the law. If they cannot be understood as exceptions that serve to define the specific conditions under which the law is supposed to hold, then their occurrence undermines the very claim that any law exists. It is only quite recently that a reasonably full understanding of exceptions of this kind has been achieved, and so it is on this aspect of the law that I am going", "num_citations": "0\n", "authors": ["17"]}
{"title": "Recognition of an item in the absence of any item-specific context is largely independent of its recall given some item-specific contextual cue-provided that the cue is related to\n", "abstract": " In this paper, I am going to describe an empirical law which concerns the relationship between recognition and recall. It seems appropriate to call it the Tulving-Wiseman Law, in honour of those who first discovered the regularity that it summarizes (Tulving & Wiseman, 1975). By empirical law is meant simply a statement that summarizes some regularity in a definable set of observations, without any attempt at further explaining that regularity. In this case, there are three aspects to the claim that the observed regularity represents an empirical law. First, the statement normally holds true for the general situation defined, that is, for all experiments of a particular type, despite many differences between these experi-ments, and wide variation in the levels of recognition and recall performance. Second, the law can be expressed mathematically. Third, exceptions to the law occur, in the sense that even in the general situation defined not every observation conforms with the law.These observations are critical to the law. If they cannot be understood as exceptions that serve to define the specific conditions under which the law is supposed to hold, then their occurrence undermines the very claim that any law exists. It is only quite recently that a reasonably full understanding of exceptions of this kind has been achieved, and so it is on this aspect of the law that I am going", "num_citations": "0\n", "authors": ["17"]}
{"title": "of its recall given some item-specific contextual cue-provided that the cue is related to\n", "abstract": " In this paper, I am going to describe an empirical law which concerns the relationship between recognition and recall. It seems appropriate to call it the Tulving-Wiseman Law, in honour of those who first discovered the regularity that it summarizes (Tulving & Wiseman, 1975). By empirical law is meant simply a statement that summarizes some regularity in a definable set of observations, without any attempt at further explaining that regularity. In this case, there are three aspects to the claim that the observed regularity represents an empirical law. First, the statement normally holds true for the general situation defined, that is, for all experiments of a particular type, despite many differences between these experi-ments, and wide variation in the levels of recognition and recall performance. Second, the law can be expressed mathematically. Third, exceptions to the law occur, in the sense that even in the general situation defined not every observation conforms with the law.", "num_citations": "0\n", "authors": ["17"]}
{"title": "NeWS Applications and the Network\n", "abstract": " Up to this point we have talked about the NeWS server and about writing PostScript programs that execute in the server. However, NeWS is a network-based window system. Network-based window servers allow the clients to make use of window system and display resources on the network, much as a distributed file system such as NFS allows programs to make use of file system and disk resources over the network. End-users or NeWS clients can connect to remote NeWS servers to display output inside a window on the screen or receive input from the keyboard mouse or other input device.", "num_citations": "0\n", "authors": ["17"]}
{"title": "A Tour through a NeWS Application\n", "abstract": " This chapter reviews a relatively large NeWS application and explains some of the ways that it uses NeWS to advantage. The application is ched, a cheap editor built as a demonstration of how to build a WYSIWYG editor in NeWS. The source for this application is in the public domain and available from Sun Microsystems. The last section in this chapter explains how to obtain the ched program.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Introduction to the PostScript Language\n", "abstract": " This chapter gives a brief introduction to the standard PostScript language, as implemented in NeWS and many thousands of PostScript printers. This introduction is not particularly rigorous, but it should offer enough information for understanding the rest of the book. For a full description, see the PostScript Language Reference Manual[ADOBS5a].", "num_citations": "0\n", "authors": ["17"]}
{"title": "NeWS Facilities for an Interactive World\n", "abstract": " The previous chapter described the PostScript language as defined by Adobe Systems, originally designed to drive printers. With printers, only one PostScript program is being executed at a time and output can only take place to a single page at a time. In contrast, NeWS is a window system. It requires that multiple application programs be able to concurrently access the display, which is partitioned into separate regions for each application. And it needs to handle input from a keyboard, a mouse, and the network.", "num_citations": "0\n", "authors": ["17"]}
{"title": "NeWS Overview\n", "abstract": " NeWS originated as a research project in 1984 at Sun Microsystems by James Gosling, later joined by David Rosenthal: the authors of the Andrew window system at Carnegie-Mellon University. NeWS, or SunDEW (Sun Distributed Extensible Windows), as it was originally called, arose out of an effort to examine some of the window system issues that both Andrew and the newly emerging X Window System explored, without product development constraints. What started as speculative research eventually developed into a product, and all of the normal constraints emerged, but not too early for NeWS to become an example of revolutionary window system design.", "num_citations": "0\n", "authors": ["17"]}
{"title": "X11/NeWS Design Overview\n", "abstract": " The X window system development at MIT defined an important standard protocol for window system development: the Version 11 protocol. (The evolution and structure of the X window system are described in Chapter 3.) The industry interest in X11, the PostScript language, and NeWS resulted in the definition of a combined window server architecture: the X11/NeWS merge. Combining the X11 fixed protocol with an enhanced PostScript language, together with the dynamic development environment of NeWS, gives the applications developer a synthesis of standards, functionality, and flexibility [ROBE88].", "num_citations": "0\n", "authors": ["17"]}
{"title": "Object-Oriented PostScript\n", "abstract": " The previous chapter introduced the extensions that NeWS makes to the PostScript language in order to support interaction with a window system. This chapter shows how these extensions are combined with a stylized way of writing PostScript programs to make developing interactive programs easy. We do this by following the gradual construction of a simple example NeWS client.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Porting NeWS to Other Platforms\n", "abstract": " “NeWS was designed to be portable.” What exactly does this mean? It means that it should be possible, with relatively little effort, to adapt the NeWS server to run on a variety of different:                                     CPU architectures.                                                     Operating systems.                                                     Display hardware types.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Screen PostScript (panel session)\n", "abstract": " Screen PostScript (panel session) Page 1 ' ~ ' Computer Graphics, Volume 22, Number 4, August 1988 Panels Screen PostScript Chair: Panelists: Charles Geschke (Adobe Systems, Inc.) Mark Callow (Silicon Graphics) James Gosling (Sun Micrsystems, Inc.) Leo Hourvitz (NEXT, Inc.) Scott McGregor (Digita] Equipment Corporation) One of the most exciting and controversial areas in display graphics today is the use of PostScript for screen display and window systems. PostScript is an interpretive programming language with powerful, resolution-independent graphics capabilities. PostScript played a key role in bringing about the desktop publishing revolution and is now a de facto standard for laser printers. In the words of Arthur C. Clarke, \"PostScript output is the future of words on paper.\" Recently several products have brought PostScripts to the screen. These range from basic PostScript output display to an entire …", "num_citations": "0\n", "authors": ["17"]}
{"title": "A Network Window Manager and Its Clients\n", "abstract": " An experimental window manager for bitmapped displays has been devel-oped. It uses 4.2 Berkeley UNIX's (1) interprocess communication mechanism, and the DARPA TCP/IP protocols to provide uniform access to windows anywhere on the network. Client programs, among others an editor, a menu-driven shell, a terminal emulator, and a talk-through program, have demonstrated the advantages of remote windows.", "num_citations": "0\n", "authors": ["17"]}
{"title": "WHITE PAPER: A High Level Virtual Machine\n", "abstract": " A virtual machine specification is pre- concepts of both Unix and Accent. These sented which attempts a graceful merging virtual machines have some orthogonal of the concepts from both Unix and concepts,(Accent's IPC and Unix's file Accent. Both Unix and Accent present a system) and some overlapping concepts' virtual machine'(aka Kernal inter-(eg memory management). Where the two face) to the user. These virtual overlap, there is a very striking simimachines are specified at a very high larity; and since the concepts are nearlevel, having no mention of any partic- ly the same, Unix's version will be ular physical machine. This is the key preferred. The task of writing this to the many successful ports of Unix to paper really boils down to adding into dissimilar machines. In this paper yet Unix those aspects of Accent which are another virtual machine is presented not already addressed by Unix. which attempts to gracefully merge the", "num_citations": "0\n", "authors": ["17"]}
{"title": "Carneg= e-Mellon Unlvers= ty\n", "abstract": " Constraints are a way of expressing relationships among objects; satisfying a set of constraints involves finding an assignment of values to variables that is consistent with the constraints. In its full generality, constructing a constraint satisfaction algorithm is a hopeless task. This dissertation focuses on,, he problem of performing constraint satisfaction in an interactive graphical layout system. It takes a pragmatic approach and restricts itself to a narrow but very useful domain. The algorithms used by MAGRITI'E, an editor for simple line drawings, are presented. A major portion of the work concerns the algebraic transformation of sets of constraints. It describes algorithms for identifying difficult subregions of a constraint graph and replacing them with a transformed and simplified new constraint.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Some remarks on the relationship between initial output order and subsequent performance in free recall\n", "abstract": " The function reported by Morris seems very similar to that observed here, and both these results contrast with those obtained by Darley & Murdock (1971) and by Rundus, Loftus & Atkinson (1970). In those earlier studies, Vincentization procedures had been used to examine the output order function following immediate free recall. Over the later output positions, Darley & Murdock found that the function increased, whereas Rundus et al. found that it declined: in neither study did the trend appear to be particularly dramatic. The most likely explanation of the discrepant pattern of results over these several studies may lie in certain problems associated with the procedures used to calculate the output order function. Vincentization corrects for a possible subject-selection artifact in that not all subjects", "num_citations": "0\n", "authors": ["17"]}
{"title": "PHILOSOPHY PSYCHOLOGY RELIGION Bannister, D. Issues and Approaches in Psychological Therapies Wiley£ 6. 75 SBN 471 04740 6 Essays con-fronting central theoretical and ethical …\n", "abstract": " Poul, G., Bolton, KM Historical Accounting Litera£ 1.75 SBN 04 100040 4 Philosophy of religion ture Mansell£ 15 SBN 7201 0519 6 III A catalogue of the collection of early works on book-keeping and accounting in the Library of the Institute of Chartered Ac SOCIOLOGY POLITICS countants in England and Wales ECONOMICS LAW", "num_citations": "0\n", "authors": ["17"]}
{"title": "Les API de Java. vol. 1, le noyau\n", "abstract": " Les API de Java.vol.1, le noyau Toggle navigation English français العربية français English français العربية Ouvrir une session Toggle navigation Voir le document Accueil La Bibliothèque Centrale Collection 8 Voir le document Accueil La Bibliothèque Centrale Collection 8 Voir le document Les API de Java.vol.1, le noyau Thumbnail Date 2017-01-01 Auteur Gosling James Metadata Afficher la notice complète URI http://hdl.handle.net/123456789/114903 Collections Collection 8 [10000] DSpace software copyright © 2002-2015 DuraSpace Contactez-nous | Faire parvenir un commentaire Theme by @mire NV Chercher dans le dépôt Cette collection Parcourir Toute l’ArchiveCommunautés & CollectionsPar date de publicationAuteursTitresSujetsCette collectionPar date de publicationAuteursTitresSujets Mon compte Ouvrir une sessionS'inscrire DSpace software copyright © 2002-2015 DuraSpace Contactez-nous | …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Les API de Java. vol. 2, applets et l'AWT\n", "abstract": " Les API de Java .vol.2, applets et l'AWT Toggle navigation English français العربية français English français العربية Ouvrir une session Toggle navigation Voir le document Accueil La Bibliothèque Centrale Collection 8 Voir le document Accueil La Bibliothèque Centrale Collection 8 Voir le document Les API de Java .vol.2, applets et l'AWT Thumbnail Date 2017-01-01 Auteur Gosling James Metadata Afficher la notice complète URI http://hdl.handle.net/123456789/114097 Collections Collection 8 [10000] DSpace software copyright © 2002-2015 DuraSpace Contactez-nous | Faire parvenir un commentaire Theme by @mire NV Chercher dans le dépôt Cette collection Parcourir Toute l’ArchiveCommunautés & CollectionsPar date de publicationAuteursTitresSujetsCette collectionPar date de publicationAuteursTitresSujets Mon compte Ouvrir une sessionS'inscrire DSpace software copyright © 2002-2015 DuraSpace …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Laboratory of Comparative Human Cognition, 431 Lamwers, Linda L., 53 Langford, J., 559\n", "abstract": " , 15, 193 prose comprehension, 15, 437 L Language acquisition deictic verbs, 15, 655 methods of investigation, 15, 655 Lexical access context effects, 15, 681 Lexicon accessing, 15, 607 Long-term memory intersecting search process, 15, 587 role of rehearsal, 15, 479 M Magnitude comparisons, 15, 287 Memory context, 15, 621 depth of processing, 15, 621 organization, 15, 313 transient memory load, 15, 159 Memory span semantic groups, 15, 387 social class differences, 15, 431 Modality effects, 15, 519 0 Organization of categorized material, 15, 641 Output monitoring, 15, 471 p Paired-associates F priority effect in, 15, 381 Free recall spacing of presentations, 15, 1 depth of processing, 15, 447 Phoneme monitoring grouping, 15, 85 word transitional probability, 15, 43'Boldface numbers indicate volume; lightface numbers indicate pagination. Copyright@ 1976 by Academic Press, Inc. 717 All rights of …", "num_citations": "0\n", "authors": ["17"]}
{"title": "Java (programming language) Information\n", "abstract": " Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. It is a general-purpose programming language intended to let programmers write once, run anywhere (WORA),[17] meaning that compiled Java code can run on all platforms that support Java without the need to recompile.[18] Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture. The syntax of Java is similar to C and C++, but has fewer low-level facilities than either of them. The Java runtime provides dynamic capabilities (such as reflection and runtime code modification) that are typically not available in traditional compiled languages. As of 2019", "num_citations": "0\n", "authors": ["17"]}
{"title": "Java platform editions\n", "abstract": " Sun has defined and supports four editions of Java targeting different application environments and segmented many of its APIs so that they belong to one of the platforms. The platforms are:", "num_citations": "0\n", "authors": ["17"]}
{"title": "13 Rehearsal and directed forgetting in adults with Asperger syndrome\n", "abstract": " Episodic memory impairments in individuals with autistic spectrum disorders (ASDs) are quite selective and can be interpreted in terms of both retrieval and encoding impairments. For example, whilst recall of test items without specific cues (free recall) is often impaired in children with autism in relation to comparison groups, performance is relatively unimpaired when appropriate retrieval cues are provided at the test stage of the procedure (Boucher & Lewis, 1989; Boucher & Warrington, 1976; Tager-Flusberg, 1991). Bowler, Matthews and Gardiner (1997) found that adults with Asperger syndrome (AS), defined as high-functioning individuals on the autistic spectrum that met the International Classification of Diseases, 10th edition (ICD-10; World Health Organization, 1993) criteria for AS excluding the language criteria, were also unimpaired in cued-recall in comparison to typical adults. Impaired free recall and intact …", "num_citations": "0\n", "authors": ["17"]}
{"title": "J2SE (Java Standard Edition)-Recommended Reading\n", "abstract": " I maintain this book list for use of my readers, customers, attendants of my courses, and everybody else who is interested. The list does not aim to be complete in any way; it contains titles that I personally find worth reading. The order in which titles are listed does not imply any judgement of the books; instead the ordering is by topic from essentials of common interest to titles devoted to more esoteric, specialinterest issues.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Binding of Multiple Features in Memory by High-Functioning Adults with\n", "abstract": " Diminished episodic memory and diminished use of semantic information to aid recall by individuals with autism spectrum disorder (ASD) are both thought to result from diminished relational binding of elements of complex stimuli. To test this hypothesis, we asked highfunctioning adults with ASD and typical comparison participants to study grids in which some cells contained drawings of objects in non-canonical colours. Participants were told at study which features (colour, item, location) would be tested in a later memory test. In a second experiment, participants studied similar grids and were told that they would be tested on object-location or object-colour combinations. Recognition of combinations was significantly diminished in ASD, which survived covarying performance on the Color Trails Test (D’Elia, Satz, Uchiyama et al., 1996), a test of executive difficulties. The findings raise the possibility that medial temporal as well as frontal lobe processes are dysfunctional in ASD.", "num_citations": "0\n", "authors": ["17"]}
{"title": "The editorial board is very grateful to the people listed below who have given their time and expertise to Medical Science Educator by reviewing manuscripts or translating …\n", "abstract": " The editorial board is very grateful to the people listed below who have given their time and expertise to Medical Science Educator by reviewing manuscripts or translating abstracts over the past year. Their comments and advice have contributed significantly to the quality of the journal. We appreciate their efforts very much.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Effects of Related and Unrelated Context on Recall and Recognition by\n", "abstract": " Memory in autism spectrum disorder (ASD) is characterised by greater difficulties with recall rather than recognition and with a diminished use of semantic or associative relatedness in the aid of recall. Two experiments are reported that test the effects of item-context relatedness on recall and recognition in adults with highfunctioning ASD (HFA) and matched typical comparison participants. In both experiments, participants studied words presented inside a red rectangle and were told to ignore context words presented outside the rectangle. Context words were either related or unrelated to the study words. The results showed that relatedness of context enhanced recall for the typical group only. However, recognition was enhanced by relatedness in both groups of participants. On a behavioural level, these findings confirm the Task Support Hypothesis (Bowler, Gardiner & Berthollier, 2004), which states that individuals with ASD will show greater difficulty on memory tests that provide little support for retrieval. The findings extend this hypothesis by showing that it operates at the level of relatedness between studied items and incidentally-encoded context. By showing difficulties in memory for associated items, the findings are also consistent with conjectures that implicate medial temporal lobe and frontal lobe dysfunction in the memory difficulties of individuals with ASD.", "num_citations": "0\n", "authors": ["17"]}
{"title": "ITC Window. Ianager rrogrammers lu anuar\n", "abstract": " A window used by a client of the graphics package is a rectangular patch of pixels. The upper left pixel is at coordinate (0, 0) and coordinates increase down and to the right. The width and height of the window may be interrogated by calling wm_GetDimensions. Performing operations at coordinates outside of the window area causes the operation to be properly clipped. One unit in the horizontal or vertical direction corresponds to one pixel. There is a current position which moves around as operations are performed.This extremely simple coordinate system was explicitly chosen in preference to a more general one with full homogenous transformations. Many client programs are insensitive to which coordinate system is chosen: any one is good as any other; others have such specialized requirements that they need to do their own coordinate transformations themselves, anyway.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Submitted: 10th July 2002 Revision submitted 14th April 2003\n", "abstract": " Memory difficulties in autism are observed mainly on measures like free recall, where test procedures provide no support for memory. When support is present, such as in cued recall, difficulties are less evident. Such observations may explain the mixed findings on source memory in autism. Bennetto, Pennington and Rogers (1996) found increased earlier-list intrusions in a multi-list free-recall paradigm (support absent), yet Farrant, Blades and Boucher (1998) reported no impairment in identification of who had spoken a particular word at study (support present). We tested the effects on source memory of presence or absence of support for source in participants with Asperger’s syndrome. The Asperger participants’ overall deficit in source memory was largely eliminated when source was supported at test.", "num_citations": "0\n", "authors": ["17"]}
{"title": "Forthcoming memory & cognition articles\n", "abstract": " Forthcoming memory &amp; cognition articles Page 1 Forthcoming Memory & Cognition Articles The following is a list of forthcoming Memory & Cognition articles that are currently in press. They are given in approximate order of acceptance. Each entry includes the name and address of the author with whom to communicate for further prepublication information. \"Encoding information for future action: Memory for to-beperformed versus memory for to-he-recalled tasks\" by A. Koriat, H. Ben-Zur, & A. Nussbaum (AK, Dept. Psychol., Univ. Haifa, Haifa, Israel) \"Learning subgoals and methods for solving probability problems\" by R. Catrambone & KJ Holyoak (RC, Sch. Psychol., Georgia Inst. Tech., Atlanta, GA 30332) \"Attention and recollective experience in recognition memory\" by JM Gardiner & AJ Parkin (JMG, Memory & Cognition Rsch. Group, City Univ., Northampton Square, London ECIV OHB, England) \"Recall of …", "num_citations": "0\n", "authors": ["17"]}
{"title": "0. H. TURNBULL, N. BESCHIN and\n", "abstract": " Rightward attentional bias and left hemisphere dominance in a cue-target light detection task in a callosotomy patient", "num_citations": "0\n", "authors": ["17"]}
{"title": "Designing Fast Asynchronous Circuits\n", "abstract": " I often complained to the late Charlie Molnar about how hard our research project is. He always responded that I should be pleased with our opportunity to get\" way ahead.\" Yes, it's been hard, but after a decade of research we've achieved exciting results. It is now easy to argue that, given a type of transistors, our circuits make them go as fast as they possibly can. This paper, one of four that we presented at the ASYNC 2001 conference, March 2001, in Salt Lake City, tells how we design our circuits; our other conference papers [see references below] describe some of our circuit forms, how to use them, and a novel computer design, called FLEET.Our group in Sun Microsytems Laboratories works on circuits, called\" asynchronous,\" that use internal timing instead of the more common external\" clock.\" Instead of waiting for the next clock tick, our asynchronous circuits proceed as fast as they can, waiting only for data or …", "num_citations": "0\n", "authors": ["17"]}
{"title": "The Java™ Series\n", "abstract": " THE Java™ programming language was originally called Oak, and was designed for use in embedded consumer-electronic applications by James Gosling. After several years of experience with the language, and significant contributions by Ed Frank, Patrick Naughton, Jonathan Payne, and Chris Warth it was retargeted to the Internet, renamed, and substantially revised to be the language specified here. The final form of the language was defined by James Gosling, Bill Joy, Guy Steele, Richard Tuck, Frank Yellin, and Arthur van Hoff, with help from Graham Hamilton, Tim Lindholm, and many other friends and colleagues. The Java programming language is a general-purpose concurrent class-based object-oriented programming language, specifically designed to have as few implementation dependencies as possible. It allows application developers to write a program once and then be able to run it everywhere on the Internet. This book attempts a complete specification of the syntax and semantics of the language. We intend that the behavior of every language construct is specified here, so that all implementations will accept the same programs. Except for timing dependencies or other non-determinisms and given sufficient time and sufficient memory space, a program written in the Java programming language should compute the same result on all machines and in all implementations.We believe that the Java programming language is a mature language, ready for widespread use. Nevertheless, we expect some evolution of the language in the years to come. We intend to manage this evolution in a way that is completely compatible with …", "num_citations": "0\n", "authors": ["17"]}