{"title": "Dynamic and selective combination of extensions in component-based applications\n", "abstract": " Support for dynamic and client-specific customization is required in many application areas. We present a (distributed) application as consisting of a minimal functional core, implemented as a component based system, and an unbound set of potential extensions that can be selectively integrated within this core functionality. An extension to this core may be a new service due to new requirements of end users. Another important category of extensions we consider are non-functional services such as authentication, which typically introduce interaction refinements at the application level. In accordance with the separation of concerns principle, each extension is implemented as a layer of mixin-like wrappers. Each wrapper incrementally adds behavior and state to a core component instance from the outside, without modifying the component's implementation. The novelty of this work is that the composition logic …", "num_citations": "138\n", "authors": ["128"]}
{"title": "A control plan for the stable operation of microgrids during grid-connected and islanded modes\n", "abstract": " This paper presents a control technique that enhances microgrids stability during the grid-connected and islanded modes. The proposed technique is compared with several existing control strategies in the context of microgrids integration into smart grids. The Lyapunov control theory is utilized in this paper to investigate the operation stability of DG units operating along with the utility grid. As the main contribution, the proposed technique compensates for the instantaneous variations of the reference current components of DG units in the ac-side of the converters. The presented method also considers and properly addresses the dc-voltage variations in the dc-side of the interfacing system. Under the proposed control strategy, DG units are able to deliver active and reactive power to the local loads and/or the main grid in fundamental and harmonic frequencies, with a fast dynamic response and without any …", "num_citations": "67\n", "authors": ["128"]}
{"title": "Control technique for enhancing the stable operation of distributed generation units within a microgrid\n", "abstract": " This paper describes a control technique for enhancing the stable operation of distributed generation (DG) units based on renewable energy sources, during islanding and grid-connected modes. The Passivity-based control technique is considered to analyze the dynamic and steady-state behaviors of DG units during integration and power sharing with loads and/or power grid, which is an appropriate tool to analyze and define a stable operating condition for DG units in microgrid technology. The compensation of instantaneous variations in the reference current components of DG units in ac-side, and dc-link voltage variations in dc-side of interfaced converters, are considered properly in the control loop of DG units, which is the main contribution and novelty of this control technique over other control strategies. By using the proposed control technique, DG units can provide the continuous injection of active power …", "num_citations": "67\n", "authors": ["128"]}
{"title": "Dynamic update of Java applications—balancing change flexibility vs programming transparency\n", "abstract": " The ability to dynamically change the behavior of an application is becoming an important issue in contemporary rich client software development. Not only can programmers benefit from dynamic updates during the development of concurrent applications where recreation of complex application states can be avoided during test and debugging but also at post‐deployment time where applications can be updated transparently without going through the well‐known halt, redeploy and restart scheme. In this paper, we explain how our dynamic update framework achieves transparent dynamic updates of running Java applications while guaranteeing both type and thread safety. A novel feature of our approach is that it supports full redefinition of classes by allowing changes to the type hierarchy. Our approach is based on a lightweight runtime system, which is injected into an application via bytecode transformations at …", "num_citations": "63\n", "authors": ["128"]}
{"title": "Fault detection and diagnosis for smart buildings: State of the art, trends and challenges\n", "abstract": " Worldwide, buildings account for ca. 40% of the total energy consumption and ca. 20% of the total CO2 emissions. While most of the energy goes into primary building use, a significant amount of energy is wasted due to malfunctioning building system equipment and wrongly configured Building Management Systems (BMS). For example, wrongly configured setpoints or building equipment, or misplaced sensors and actuators, can contribute to deviations of the real energy consumption from the predicted one. Our paper is motivated by these posed challenges and aims at pinpointing the types of problems in the BMS components that can affect the energy efficiency of a building, as well as review the methods that can be utilized for their discovery and diagnosis. The goal of the paper is to highlight the challenges that lie in this problem domain, as well as provide a strategy how to counterfeit them.", "num_citations": "59\n", "authors": ["128"]}
{"title": "Aggregation potentials for buildings—business models of demand response and virtual power plants\n", "abstract": " Buildings as prosumers have an important role in the energy aggregation market due to their potential flexible energy consumption and distributed energy resources. However, energy flexibility provided by buildings can be very complex and depend on many factors. The immaturity of the current aggregation market with unclear incentives is still a challenge for buildings to participate in the aggregation market. However, few studies have investigated business models for building participation in the aggregation market. Therefore, this paper develops four business models for buildings to participate in the energy aggregation market:(1) buildings participate in the implicit Demand Response (DR) program via retailers;(2) buildings with small energy consumption participate in the explicit DR via aggregators;(3) buildings directly access the explicit DR program;(4) buildings access energy market via Virtual Power Plant (VPP) aggregators by providing Distributed Energy Resources (DER) s. This paper also determines that it is essential to understand building owners’ needs, comforts, and behaviours to develop feasible market access strategies for different types of buildings. Meanwhile, the incentive programs, national regulations and energy market structures strongly influence buildings’ participation in the aggregation market. Under the current Nordic market regulation, business model one is the most feasible one, and business model two faces more challenges due to regulation barriers and limited monetary incentives. View Full-Text", "num_citations": "57\n", "authors": ["128"]}
{"title": "Customization of object request brokers by application specific policies\n", "abstract": " This paper presents an architectural framework for customizing Object Request Broker (ORB) implementations to application-specific preferences for various non-functional requirements. ORB implementations are built by reusing a domain-specific component-based architecture that offers support for one or more non-functional requirements. The domain-specific architecture provides the mechanism that allows the ORB to reconfigure its own implementation at run-time on the basis of application-specific preferences. This mechanism is based on a run-time selection between alternative component implementations that guarantee different service-levels for non-functional requirements. Application-specific preferences are defined in policies and service-level guarantees are defined in component descriptors. Policies and component descriptors are expressed using descriptive languages. This gives …", "num_citations": "56\n", "authors": ["128"]}
{"title": "Customization of component-based object request brokers through dynamic reconfiguration\n", "abstract": " The success of distributed object technology, depends on the advent of Object Request Broker (ORB) architectures that are able to integrate flexible support for various nonfunctional requirements such as security, real-time, transactions, etc. We promote component framework technology as the cornerstone for realizing such generic platforms. An ORB component framework leverages the \"glue\" that connects customized ORB components together. We present a reflective component architecture that improves the dynamics of this glue, such that system-wide integration of new non-functional requirements into a running ORB system becomes possible.", "num_citations": "52\n", "authors": ["128"]}
{"title": "ObepME: An online building energy performance monitoring and evaluation tool to reduce energy performance gaps\n", "abstract": " A major challenge facing the buildings sector is the absence of continuous commissioning and the lack of performance monitoring and evaluation leading to buildings energy performance gaps between predicted and actual measured performance. Aiming to better characterize, evaluate and bridge these gaps, the paper proposes an online building energy performance monitoring and evaluation tool ObepME, serving as a basis for fault detection and diagnostics and forming a backbone for continuous commissioning. A calibrated building dynamic energy model is developed and employed to automatically run on a daily basis and simulate the building transient performance for the previous day. The simulated energy consumption results form a baseline to which the actual collected data are compared to evaluate the dynamic energy performance gap. The OU44 University building in Denmark is considered as a …", "num_citations": "48\n", "authors": ["128"]}
{"title": "Multilevel converter control approach of active power filter for harmonics elimination in electric grids\n", "abstract": " This paper presents a Direct Lyapunov based control technique for active power filtering in electric grids. The proposed technique through the interfacing system is designed with the goal to compensate the harmonic current components and reactive power provoked by the nonlinear grid-connected loads. In the method, based on multilevel converter topologies, active power in fundamental frequency is injected from the main grid, which results in unity PF (power factor) between grid currents and load voltages. The performance of the proposed control technique in a SAPF (Shunt Active Power Filter) model is validated in both dynamic and steady-state operating conditions. The simulation results show that the proposed scheme can effectively compensate the system background harmonics and improve the performance of the line current harmonics. The main benefit of this approach is that it prevents current overshoot …", "num_citations": "43\n", "authors": ["128"]}
{"title": "Performance comparison of occupancy count estimation and prediction with common versus dedicated sensors for building model predictive control\n", "abstract": " Model predictive control is a promising approach to optimize the operation of building systems and provide demand-response functionalities without compromising indoor comfort. The performance of model predictive control relies, among other things, on the quality of weather forecasts and building occupancy predictions. The present study compares the accuracy and computational demand of two occupancy estimation and prediction approaches suitable for building model predictive control: (1) count prediction based on indoor climate modeling and parameter estimation “using common sensors”, (2) count prediction based on data from 3D stereovision camera. The performance of the two approaches was tested in two rooms of a case study building. The results show that the method with dedicated sensors outperforms common sensors. However, if a building is not equipped with dedicated sensors, the …", "num_citations": "39\n", "authors": ["128"]}
{"title": "Performance analysis of a soil-based thermal energy storage system using solar-driven air-source heat pump for Danish buildings sector\n", "abstract": " Denmark has set an ambitious long-term future energy goal to become independent of fossil fuel by 2050, depending completely on renewable and alternative resources in the energy and transport sectors. Solar energy is one of the most favourable alternative resources in terms of cleanness, safety and the economic and environmental aspects. However, the intermittent nature of solar energy and the lack of high solar radiation intensities in various climates favour the use of various energy storage techniques to eliminate the discrepancy between energy supply and demand. The current work presents an analysis and evaluation of the performance of an underground soil-based thermal energy storage system for solar energy storage, coupled with a combined heat and power generation system. A combined PV-Air Source Heat Pump (ASHP) system is utilized to fulfil heating and electricity needs of a housing project …", "num_citations": "38\n", "authors": ["128"]}
{"title": "Cost-efficient light control for production of two campanula species\n", "abstract": " A cost-efficient light control system based on weather forecasts, electricity prices and daily photosynthesis integral (DPI) was evaluated for application in the commercial production of the long-day (LD) plant Campanula portenschlagiana ‘Blue Get Mee’ and C. cochlearifolia ‘Blue Wonder’. Experiments were conducted under both autumn and spring conditions and included four treatments. Three treatments were controlled by the software system DynaLight Desktop which automatically defined the most cost-efficient use of supplemental light, -based on a predefined set point of DPI, forecasted solar irradiance and the market price on electricity. The set points of DPI in the three treatments were 300, 450 and 600 mmol CO2 m−2 leaf d−1 and the treatments were compared with a traditional LD 19-h treatment. The DPI-based light control strategy resulted in very irregular light patterns including daily periods of solar …", "num_citations": "38\n", "authors": ["128"]}
{"title": "Active and reactive power ripple minimization in direct power control of matrix converter-fed DFIG\n", "abstract": " Despite the advantages of matrix converters (MCs) compared with standard voltage source converters (VSCs), all of the direct power control (DPC) strategies for doubly fed induction generator (DFIG) reported in the literature, only utilize VSCs. In this paper, the influence of MC voltage vectors on active and reactive powers variation is investigated. Compared with VSCs, MCs generate higher number of voltage vectors. Using this inherent advantage of MC, the main contribution of this paper is to reduce large active and reactive power ripples which is one of the main drawbacks of conventional DPC method. Utilizing a wide range of voltage vectors with different amplitudes, a new switching table is derived which using this table, not only large power ripple is compensated but also, a close to unity input power factor for MC can be achieved. In the other word, the presented scheme adds the advantages of MC and DPC …", "num_citations": "36\n", "authors": ["128"]}
{"title": "A dynamic energy performance-driven approach for assessment of buildings energy Renovation—Danish case studies\n", "abstract": " In this study, four buildings in Aarhus, Denmark are considered for energy renovation analysis and assessment aiming to enhance their energy performance. A systematic and dynamic energy performance-driven methodology for buildings energy modelling, simulation and renovation was developed and implemented based on an overall technical, economic and environmental assessment. Detailed dynamic energy performance models were developed for the buildings considering various specifications, envelope characteristics and energy supply systems configurations. The models were calibrated using actual energy consumption data and occupancy schedules. Buildings primary energy consumption in the range of 158–192 kWh/m2 of indoor heated area was reported, highlighting large potential for energy performance improvement. Based on field visits, systems and components inspections, technical …", "num_citations": "32\n", "authors": ["128"]}
{"title": "Distributed strategy for optimal dispatch of unbalanced three-phase islanded microgrids\n", "abstract": " This paper presents a distributed strategy for the optimal dispatch of islanded microgrids, modeled as unbalanced three-phase electrical distribution systems. To set the dispatch of the distributed generation (DG) units, an optimal generation problem is stated and solved distributively based on primal-dual constrained decomposition and a first-order consensus protocol, where units can communicate only with their neighbors. Thus, convergence is guaranteed under the common convexity assumptions. The islanded microgrid operates with the standard hierarchical control scheme, where two control modes are considered for the DG units: a voltage control mode, with an active droop control loop, and a power control mode, which allows setting the output power in advance. To assess the effectiveness and flexibility of the proposed approach, simulations were performed in a 25-bus unbalanced three-phase microgrid …", "num_citations": "31\n", "authors": ["128"]}
{"title": "Timing growth and development of Campanula by daily light integral and supplemental light level in a cost-efficient light control system\n", "abstract": " Two campanula species Campanula portenschlagiana (‘Blue Get Mee’) and Campanula cochlearifolia (‘Blue Wonder’) were grown in a cost-efficient light control system and the effect of supplemental light level and daily light integral (DLI) on growth and development was quantified. The alternative light control system (DynaLight desktop) automatically defines the most cost-efficient use of supplemental light based on predefined setpoints for daily photosynthesis integral (DPI), forecasted solar irradiance and the market price on electricity. It saves energy in high-cost periods of electricity, but creates irregular light periods which may disturb circadian rhythms and thereby affect plant growth and flower development. Plants were grown in four treatments controlled by DynaLight desktop with two setpoints for DPI (300 and 600 mmol m−2 leaf day−1) and two levels of supplemental lighting (48 and 84 μmol m−2 s−1). We …", "num_citations": "30\n", "authors": ["128"]}
{"title": "Deep energy renovation of the Mærsk office building in Denmark using a holistic design approach\n", "abstract": " This study targets the office buildings sector in Denmark considering a case study of the Mærsk Building, located at the University of Southern Denmark Odense campus, aiming to improve its energy performance and reduce heating and electricity consumption. The current work is carried out under the COORDICY project aiming to establish a new methodology for non-residential and public buildings deep energy renovation. The methodology is based on a holistic design approach taking into account the dynamic building energy performance to analyse and evaluate retrofit measures and packages, instead of the static approach and conventional estimations currently in use. A detailed holistic energy model for the Mærsk office building was developed using a package of Sketchup Pro, OpenStudio and EnergyPlus tools to simulate the dynamic energy performance of the building taking into account various …", "num_citations": "28\n", "authors": ["128"]}
{"title": "Integrating commercial greenhouses in the smart grid with demand response based control of supplemental lighting\n", "abstract": " In Northern Europe the production of ornamental pot plants in greenhouses requires use of supplemental light, as light is a restricting climatic factor for growth from late autumn until early spring. By participating in demand response programs such as real-time pricing, growers can schedule electricity consumption in hours where electricity prices are low, thus achieving savings in their electricity expenses. In this context we present a novel software system for dynamic control of supplemental lighting in greenhouses that aims at decreasing the electricity costs and energy consumption without loss in productivity. The software uses weather forecasts and electricity prices together with a photosynthesis model to compute energy and costefficient supplemental light plans, which fulfills the productivity goal defined by the grower. Experiments with different light control strategies revealed that electricity savings about 25% was possible without noticeable reductions in plant flowering and production time.", "num_citations": "27\n", "authors": ["128"]}
{"title": "An agent-based extensible climate control system for sustainable greenhouse production\n", "abstract": " The slow adoption pace of new control strategies for sustainable greenhouse climate control by industrial growers, is mainly due to the complexity of identifying and resolving potentially conflicting climate control requirements. In this paper, we present a multi-agent-based climate control system that allows new control strategies to be adopted without any need to identify or resolve conflicts beforehand. This is achieved by representing the climate control requirements as separate agents. Identifying and solving conflicts then becomes a negotiation problem among agents sharing the same controlled environment. Negotiation is done using a novel multi-objective negotiation protocol that uses a generic algorithm to find an optimized solution within the search space. The multi-agent-based control system has been empirically evaluated in an ornamental floriculture research facility in Denmark. The evaluation …", "num_citations": "27\n", "authors": ["128"]}
{"title": "A world class energy efficient university building by Danish 2020 Standards\n", "abstract": " The paper provides an overview of the OU44 building as a highly energy efficient teaching building at the University of Southern Denmark in Odense. The 8500m2 3-storey building was designed to meet the 2020 buildings energy class consuming only 42 kWh/m2, marking it at the top of energy efficient public buildings in the world. As a case study under the international research project COORDICY, the goal of OU44 is to function as a living lab building for research in energy informatics and occupancy behavior, aiming to improve the energy efficiency of public buildings, with full capability to monitor, manage and control the building operation. The building is equipped with energy efficient technologies including, ventilation units with heat recovery, LED lights, underfloor heating, PV modules, in addition to heating, lighting and electricity consumption sub-meters, and temperature, humidity, CO2, Lux and PIR …", "num_citations": "26\n", "authors": ["128"]}
{"title": "Method, computer program product, and system for non-blocking dynamic update of statically typed class-based object-oriented software\n", "abstract": " A method, computer program product, and system for non-blocking dynamic update of statically-typed class-based object-oriented software executing as byte-code on a virtual machine within an actively running computer system is provided. A set of objects instantiated from an existing module or multiple modules (identifiable collections of application resources and class definitions in the form of byte-code representations) is ready for execution on a virtual machine in an actively running computer system. New versions of one or more modules corresponding to those already loaded into the actively running virtual machine are dynamically loaded into the virtual machine for the purpose of updating the running software. The class definitions within the loaded modules are prepared for dynamic update by inserting byte-code that enables; transparent state transfer and shared object identity between objects of a former …", "num_citations": "25\n", "authors": ["128"]}
{"title": "Towards a Dynamic-update-enabled JVM\n", "abstract": " This paper advocates that de facto dynamic updates of Java applications will eventually require a dynamic-update-enabled Java virtual machine. We argue that our approach for dynamic updates of component-based Java applications complements the new module system planned for upcoming Java releases. We conclude that simple extensions to an existing JVM can bring full flexibility and transparency to dynamic updates in Java.", "num_citations": "25\n", "authors": ["128"]}
{"title": "A literature review of energy flexibility in district heating with a survey of the stakeholders’ participation\n", "abstract": " Energy flexibility in district heating systems with the combination of different heating units can balance the energy system and contribute to the sustainability of future energy systems. However, there is lack of literature on the overview of energy flexibility in district heating. To fill the research gap, this paper firstly conducts a review study of district heating system components, markets and the energy flexibility potentials in district heating. The result of the literature review shows that there is no literature on stakeholders in the energy flexibility of smart district heating in relation to the integration of energy flexible buildings and smart technologies. Therefore, a survey is conducted to investigate the stakeholder's perception and motivation on smart district heating grids using energy flexible buildings. Based on the discussion with a modified Smart District Heating Architecture Model framework, our findings reveal that there …", "num_citations": "23\n", "authors": ["128"]}
{"title": "Energy flexibility in retail buildings: From a business ecosystem perspective\n", "abstract": " Retail buildings has an important role for demand side energy flexibility because of their high energy consumption, variety of energy flexibility resources, and centralized control via building control systems. Energy flexibility requires agreements and collaborations among different actors. However, the stakeholders' reaction to energy flexibility have not been fully investigated. Therefore, this paper aims to investigate the stakeholder involvement in energy flexibility by applying the business ecosystem concept (including actors, relationships, value alliances, and influential factors), with the discussion of the stakeholders' roles and their interrelation in delivering energy flexibility with the influential factors to the actual implementation of energy flexible operation of their buildings. Based on a literature analysis, the results cover stakeholders' types and roles, perceptions (drivers, barriers, and benefits), energy management …", "num_citations": "23\n", "authors": ["128"]}
{"title": "Challenge: Advancing energy informatics to enable assessable improvements of energy performance in buildings\n", "abstract": " Within the emerging discipline of Energy Informatics people are researching, developing and applying information and communication technologies, energy engineering and computer science to address energy challenges. In this paper we discuss the challenge of advancing energy informatics to enable assessable improvements of energy performance in buildings. This challenge follows a long-standing goal within the built environment to develop processes that enable predictable outcomes. Implementing this goal in the research framework of energy informatics creates a need for establishing a new underlying assumption, which states that the impact of energy informatics solutions should be assessable. This assumption applies to particular building contexts and when solutions act simultaneously. Research based on this assumption will enable new sound processes for the built environment facilitating informed …", "num_citations": "23\n", "authors": ["128"]}
{"title": "Commercial buildings energy performance within context occupants in spotlight\n", "abstract": " Existing commercial buildings represent a challenge in the energy efficiency domain. Energy efficiency of a building, very often equalized to a building;s performance should not be observed as a standalone issue. For commercial buildings, energy efficiency needs to be observed and assessed within the context of performance of resident businesses. We examine both business performance and energy performance and how they relate to one another to conclude that building occupants, who are also employees, hold the key to optimizing both metrics in one of the most cost-efficient ways. Finally, the goal of our contribution is twofold: 1) to re-scope the concept of building performance to and show the importance to consider, hand-in-hand, both energy performance and performance of resident businesses, and 2) re-state the importance of the potential that lies in the active involvement of building occupants in …", "num_citations": "23\n", "authors": ["128"]}
{"title": "Evolution of collective object behavior in presence of simultaneous client-specific views\n", "abstract": " When different clients, each with their own individual customization requirements, use the same system simultaneously, the system must dynamically adapt its behavior on a per client basis. Each non-trivial adaptation of the system’s behavior will very likely crosscut the implementation of multiple objects. In this paper we present an extension to the Java programming language that supports the dynamic evolution of collective object behavior in the presence of simultaneous client-specific views. In accordance with the separation of concerns and locality principles, client-specific customization of collective object behavior is organized as layers of mixin-like wrappers. Each layer of wrappers incrementally adds behavior and state to a group of core objects without modifying their respective implementations. Hence, collective object behavior can evolve in an additive and non-invasive way. The extension that we …", "num_citations": "22\n", "authors": ["128"]}
{"title": "Market opportunities and barriers for smart buildings\n", "abstract": " Buildings consume up to 42% of the global electricity and the primary emitter of greenhouse gas on the planet. Building efficiency is the largest growing segment in the US, the estimated global revenue by the building efficiency sector is around 210 million dollars, and constantly increases since 2011. Much research already shows the players' passive and conservative attitudes to enter into the energy efficiency market. Especially there are obstacles for the construction companies to redesign their business model from the traditional building business to the smart building market. This paper conducts a qualitative approach with primary and secondary data to investigate the Barriers and opportunities of the construction companies into the smart building market. The result shows the willingness of the players to involve the building efficiency business with huge potential monetary benefits. Meanwhile, the result shows …", "num_citations": "21\n", "authors": ["128"]}
{"title": "Demand response in commercial buildings with an assessable impact on occupant comfort\n", "abstract": " Electricity grids are facing challenges due to peak consumption and renewable electricity generation. In this context, demand response offers a solution to many of the challenges, by enabling the integration of consumer side flexibility in grid management. Commercial buildings are good candidates for providing flexible demand due to their volume and the stability of their loads. However, existing technologies and strategies for demand response in commercial buildings fail to enable services with an assessable impact on load changes and occupant comfort. In this paper we propose the ADRALOC system for Automated Demand Response with an Assessable impact on Loads and Occupant Comfort. This enhances the quality of demand response services from a grid management perspective, as these become predictable and trustworthy. At the same time building managers and owners can participate without …", "num_citations": "21\n", "authors": ["128"]}
{"title": "Aspects for run-time component integration\n", "abstract": " The Maersk Mc-Kinney Moller Institute for Production Technology, University of Southern Denmark, Odense Campus, DK-5230 Odense M, Denmark. bnj@ mip. sdu. dk abstract. Component framework technology has become the cornerstone of building a family of systems and applications. A component framework defines a generic architecture into which specialized components can be plugged. As such, the component framework leverages the glue that connects the different inserted components together. We have examined a middle ground between aspect-oriented programming and computational reflection that improves the dynamics of this gluing process such that interaction between components can be refined at run-time. In this paper, we show how we have used this middle ground to dynamically integrate into the architecture of middleware systems new services that support non-functional aspects such as security, transactions, real-time.", "num_citations": "21\n", "authors": ["128"]}
{"title": "The application of ontologies in multi-agent systems in the energy sector: a scoping review\n", "abstract": " Multi-agent systems are well-known for their expressiveness to explore interactions and knowledge representation in complex systems. Multi-agent systems have been applied in the energy domain since the 1990s. As more applications of multi-agent systems in the energy domain for advanced functions, the interoperability raises challenge raises to an increasing requirement for data and information exchange between systems. Therefore, the application of ontology in multi-agent systems needs to be emphasized and a systematic approach for the application needs to be developed. This study aims to investigate literature on the application of ontology in multi-agent systems within the energy domain and map the key concepts underpinning these research areas. A scoping review of the existing literature on ontology for multi-agent systems in the energy domain is conducted. This paper presents an overview of the application of multi-agent systems (MAS) and ontologies in the energy domain with five aspects of the definition of agent and MAS; MAS applied in the energy domain, defined ontologies in the energy domain, MAS design methodology, and architectures, and the application of ontology in the MAS development. Furthermore, this paper provides a recommendation list for the ontology-driven multi-agent system development with the aspects of 1) ontology development process in MAS design, 2) detail design process and realization of ontology-driven MAS development, 3) open standard implementation and adoption, 4) inter-domain MAS development, and 5) agent listing approach. View Full-Text", "num_citations": "20\n", "authors": ["128"]}
{"title": "Remodularizing Java programs for improved locality of feature implementations in source code\n", "abstract": " Explicit traceability between features and source code is known to help programmers to understand and modify programs during maintenance tasks. However, the complex relations between features and their implementations are not evident from the source code of object-oriented Java programs. Consequently, the implementations of individual features are difficult to locate, comprehend, and modify in isolation. In this paper, we present a novel remodularization approach that improves the representation of features in the source code of Java programs. Both forward and reverse restructurings are supported through on-demand bidirectional restructuring between feature-oriented and object-oriented decompositions. The approach includes a feature location phase based on tracing of program execution, a feature representation phase that reallocates classes into a new package structure based on single-feature and …", "num_citations": "20\n", "authors": ["128"]}
{"title": "DynaGrow-Multi-Objective Optimization for Energy Cost-efficient Control of Supplemental Light in Greenhouses.\n", "abstract": " The Danish greenhouse horticulture industry utilized 0.8% of the total national electricity consumption in 2009 and it is estimated that 75% of this is used for supplemental lighting. The increase in energy prices is a challenge for growers, and need to be addressed by utilizing supplemental light at low prices without compromising the growth and quality of the crop. Optimization of such multiple conflicting objectives requires advanced strategies that are currently not supported in existing greenhouse climate control systems. It is costly to incorporate advanced optimization functionality into existing systems as the software is not designed for such changes. The growers can not afford to buy new systems or new hardware to address the changing objectives. DynaGrow is build on top of existing climate computers to utilize existing infrastructure. The greenhouse climate control problem is characterized by non-linearity, stochasticity, non-convexity, high dimension of decision variables and an uncertain dynamic environment. Together, these mathematical properties are handled by applying a Multi-Objective Evolutionary Algorithm (MOEA) for discovering and exploiting critical trade-offs when optimizing the greenhouse climate. To formulate advanced objectives, DynaGrow integrates local climate data, electricity energy price forecasts and outdoor weather forecasts. In spring 2015, one greenhouse experiment was executed to evaluate the effects of DynaGrow. The experiment was run as three treatments in three identical greenhouse compartments. One treatment was controlled by a standard control system and the other three treatments were controlled by …", "num_citations": "19\n", "authors": ["128"]}
{"title": "Industrial consumers’ smart grid adoption: influential factors and participation phases\n", "abstract": " The participation of industrial consumers in smart grid transition is important due to their consumption footprint, heavy energy use and complexity in the implementation of smart energy technologies. Active involvement of industrial consumers in the development of smart grid solutions is important to ensure the energy system transformation. Despite the importance of industrial consumers has been identified, the empirical studies on the smart grid still mainly address residential and commercial consumers. Therefore, based on four case studies with two industrial consumers, one energy consulting company and one electricity retailer, this paper investigates the factors that influence industrial consumers’ acceptance of smart grid solutions, and how the influential factors are relevant to the smart grid adoption phases. Eleven influential factors are identified that impact on four stages for industrial consumers’ adoption of smart grid solutions (inscription, translation, framing, and stabilization stages). The eleven influential factors are: awareness of multiple contexts, shared support, return-of-investment, ease of use, flexibility and dynamic pricing, liberalization and energy tariff structure, customer focus, solution integration, process improvement, service quality, and company’s green image. View Full-Text", "num_citations": "18\n", "authors": ["128"]}
{"title": "Framework for microgrid design using social, economic, and technical analysis\n", "abstract": " Microgrids are emerging as feasible solutions to handle local energy systems. Several factors influence the development of such systems, such as technical, economic, social, legal, and regulatory issues. These important aspects need to be addressed to design appropriate microscale projects that take into consideration adequate technology without underestimating local characteristics. This article aims to propose a framework design for microgrid optimization using technical, social, and economic analysis. The framework is presented through a small island case study that shows each step of the method. As a contribution, this work provides a multi-objective optimization framework with different criteria consideration, such as the inhabitants’ cost of living and inter-cultural aspects, instead of traditional technical and economic analysis. The results show the applicability of the proposed framework showing better alternatives when compared with actual or future improvements in the study case scenario. View Full-Text", "num_citations": "17\n", "authors": ["128"]}
{"title": "A generalized model for the optimal operation of microgrids in grid-connected and islanded droop-based mode\n", "abstract": " In this paper, a new and generalized model for the optimal operation of microgrids is presented. The proposed mathematical model considers both the grid-connected (GC) and islanded (IS) operational modes. First, a mixed integer non-linear programming (MINLP) formulation is introduced, modeling the microgrid as an unbalanced ac three-phase electrical distribution system, comprising distributed generator (DG) units, battery systems and wind turbines. In GC mode, the frequency and the voltage magnitude references are imposed by the main grid at the point of common couple, while in IS mode, it is assumed that the DG units operate with droop control. Additionally, a set of convexification procedures are introduced in order to approximate the original MINLP model into a new convex formulation that can be solved using commercial solvers. The proposed model has been tested in a 25-bus microgrid for different …", "num_citations": "17\n", "authors": ["128"]}
{"title": "The international electricity market infrastructure-insight from the nordic electricity market\n", "abstract": " This paper aims to provide an overview of an international electricity market for the emerging market players to understand and manipulate their roles and relationships in the market by analyzing the former, present, and future Nordic electricity market. The emerging market players and their relationships are also discussed in the paper. This paper outlines several suggestions for the future Nordic electricity market development. Furthermore, this paper provides a recommendation for countries interested in participating and developing the cross-national electricity markets with the discussion of the historical development of the Nordic electricity market.", "num_citations": "17\n", "authors": ["128"]}
{"title": "Advanced model-based greenhouse climate control using multi-objective optimization\n", "abstract": " Modern greenhouse climate control requires use of advanced climate-control models; however, adoption of advanced climate-control models in today’s industrial greenhouse production is hindered by the shortcoming of existing climate-control systems to support non-invasive composition of independently-developed climate-control models. Despite the fact that adoption of advanced climate-control models allows growers to optimize their production through improved energy efficiency, improved plant quality and yield as well as reduced risks for various climate-related diseases, commercial vendors of industrial greenhouse-climate-control systems have not taken action to provide the necessary support for independent extensibility in their systems so far. Present climate-control systems require the control logic of independently-developed climate-control models to be merged into a single monolithic climate-control …", "num_citations": "17\n", "authors": ["128"]}
{"title": "Run-time phenomena in dynamic software updating: causes and effects\n", "abstract": " The development of a dynamic software updating system for statically-typed object-oriented programming languages has turned out to be a challenging task. Despite the fact that the present state of the art in dynamic updating systems, like JRebel, Dynamic Code Evolution VM, JVolve and Javeleon, all provide very transparent and flexible technical solutions to dynamic updating, case studies have shown that designing dynamically updatable applications still remains a challenging task. This challenge has its roots in a number of run-time phenomena that are inherent to dynamic updating of applications written in statically-typed object-oriented programming languages. In this paper, we present our experience from developing dynamically updatable applications using a state-of-the-art dynamic updating system for Java. We believe that the findings presented in this paper provide an important step towards a better …", "num_citations": "17\n", "authors": ["128"]}
{"title": "Remodularizing java programs for comprehension of features\n", "abstract": " Feature-oriented decomposition of software is known to improve a programmer's ability to understand and modify software during maintenance tasks. However, it is difficult to take advantage of this fact in case of object-oriented software due to lack of appropriate feature modularization mechanisms. In absence of these mechanisms, feature implementations tend to be scattered and tangled in terms of object-oriented abstractions, making the code implementing features difficult to locate and comprehend. In this paper we present a semi-automatic method for feature-oriented remodularization of Java programs. Our method uses execution traces to locate implementations of features, and Java packages to establish explicit feature modules. To evaluate usefulness of the approach, we present a case study where we apply our method to two real-world software systems. The obtained results indicate a significant …", "num_citations": "17\n", "authors": ["128"]}
{"title": "A generalization and solution to the common ancestor dilemma problem in delegation-based object systems\n", "abstract": " This paper studies the diamond problem in the context of delegation-based object systems. The diamond problem occurs when the same ancestor is inherited multiple times via different inheritance paths. The challenge is that replication and sharing of distinct attributes of the common ancestor must be simultaneously supported. We illustrate the relevance of the diamond problem by showing that it arises not only in multiple inheritance but also in other inheritance techniques, hence the more general term’the common ancestor dilemma’. More specifically the hybrid approach that integrates object-based inheritance in a class-based model is also affected by the problem. We show that the hybrid approach provides an elegant solution for orthogonal expression of replication and sharing. Attributes that should be shared are modeled as part of the delegating objects, whereas attributes that should not be shared are modeled as part of subobjects of the delegating objects.", "num_citations": "17\n", "authors": ["128"]}
{"title": "A business ecosystem driven market analysis: The bright green building market potential\n", "abstract": " Due to the huge globally emerging market of the bright green buildings, this paper aims to develop a business-ecosystem driven market analysis approach for the investigation of the bright green building market. This paper develops a five-steps business-ecosystem driven market analysis (definition of the business domain, stakeholder listing, integration of the value chain, relationship mapping, and ego innovation ecosystem mapping.). This paper finds the global-local matters influence the market structure, which the technologies for building energy technology are developed and employed globally, and the market demand is comparatively localized. The market players can be both local and international stakeholders who involve and collaborate for the building projects. This paper also finds that the building extensibility should be considered into the building design due to the gap between current market demand …", "num_citations": "16\n", "authors": ["128"]}
{"title": "A control algorithm for the stable operation of interfaced converters in microgrid systems\n", "abstract": " This paper deals with a control concept for enhancing the stable operation of microgrid plan during the grid connected and islanding modes. The Lyapunov control theory is considered in this paper to analyze the dynamic behavior of distributed generation (DG) units during the power sharing with utility grid and loads. The compensation of instantaneous variations in the reference current components of DG units in ac-side and dc-voltage variations in dc-side of the interfaced converters are considered properly in this control scheme, which is the main contribution of this work in comparison with the other potential control strategies. By utilization of the proposed control scheme, DG units can provide the continuous injection of active power from the dispersed energy sources to the local loads and/or main grid during the islanding and grid-connected modes. Furthermore, reactive power and harmonic current …", "num_citations": "15\n", "authors": ["128"]}
{"title": "On interaction refinement in middleware\n", "abstract": " Component framework technology has become the cornerstone of building a family of systems and applications. A component framework defines a generic architecture into which specialized components can be plugged. As such, the component framework leverages the glue that connects the different inserted components together. We have examined a reflective technique that improve the dynamics of this gluing process such that interaction between components can be refined at runtime. In this paper, we show how we have used this reflective technique to dynamically integrate into the architecture of middleware systems new services that support non-functional aspects such as security, transactions, real-time.", "num_citations": "15\n", "authors": ["128"]}
{"title": "Direct Lyapunov control (DLC) technique for distributed generation (DG) technology\n", "abstract": " In this paper, a control model based on direct Lyapunov control theory is proposed for integration of distributed generation (DG) sources into the power grid. As a first step, the proposed model will be elaborated in steady state, and then proper switching state functions will be defined for control of interfacing system between the DG sources and power grid. By setting appropriate compensation current references in the control loop of the proposed model, the active, reactive, and harmonic current components of loads will be compensated with a fast dynamic response, thereby achieving sinusoidal grid currents in phase with load voltages, while required power from grid-connected load is more than the maximum injected power from the DG sources to the grid. Using simulation, the effectiveness of the proposed control scheme is demonstrated under steady-state and dynamic operating conditions. The …", "num_citations": "14\n", "authors": ["128"]}
{"title": "IntelliGrow 2.0–A greenhouse component-based climate control system\n", "abstract": " Since 1996 a dynamic model based climate control concept (IntelliGrow) has been developed in Denmark. The aim of the system is to adjust the greenhouse climate dynamic, so that the natural resources are used as optimal as possible. The concept has been proved to work in both growth chamber and greenhouse experiments, with many different species of pot plants, resulting in energy savings up to 40%, depending on the outside climate. Based on the former work a new system (IntelliGrow 2.0) is being developed which offers an improved user interface and an extensible component model. The goal is to test the system in full scale in five Danish commercial nurseries. The four steps to reach the goal are: 1) development of a demonstrator giving the grower advice on optimal climate control based on the IntelliGrow concept 2) testing the demonstrator at research facilities followed by tests at growers 3 …", "num_citations": "14\n", "authors": ["128"]}
{"title": "A stochastic programming model for the optimal operation of unbalanced three-phase islanded microgrids\n", "abstract": " This paper presents a stochastic mixed-integer nonlinear programming (MINLP) model for the optimal operation of islanded microgrids in the presence of stochastic demands and renewable resources. In the proposed formulation, the microgrid is modeled as an unbalanced three-phase electrical distribution system comprising distributed generation (DG) units with droop control, battery systems (BSs) and wind turbines (WTs). The stochastic nature of the consumption and the renewable generation is considered through a scenario-based approach, which determines the optimal values of the decision variables that minimize the average operational cost of the microgrid. A set of efficient linearizations are used to transform the proposed MINLP model into an approximated convex model that can be solved via commercial solvers. In order to assess the effectiveness of the obtained solution, Monte Carlo simulations …", "num_citations": "13\n", "authors": ["128"]}
{"title": "Estimates of prediabetes and undiagnosed type 2 diabetes in Denmark: the end of an epidemic or a diagnostic artefact?\n", "abstract": " Background: Up-to-date information on undiagnosed type 2 diabetes and prediabetes based on current diagnostic criteria is lacking. The study aimed to model the total numbers of people with undiagnosed type 2 diabetes and prediabetes in Denmark based on existing population-based surveys. Methods: Two population-based Danish studies with information on HbA1c, date of examination, gender, age and known type 2 diabetes were identified: the Danish General Suburban Population Study, n= 21,205, and the Danish Health Examination Survey, n= 18,065. The prevalence of known, undiagnosed and pre-diabetes were estimated in the Danish General Suburban Population Study, and population-level age-specific prevalence of known type 2 diabetes was estimated from national registers. The Danish Health Examination Survey was included for sensitivity analysis. Combining estimates of the survey …", "num_citations": "13\n", "authors": ["128"]}
{"title": "Consumer central energy flexibility in office buildings\n", "abstract": " Energy flexibility in buildings will play an important role in the smart energy system. Office buildings have more potentials to provide energy flexibility to the grid compared to other types of buildings, due to the existing building management, control systems and large energy consumption. Consumers in office buildings (building owners/managers and occupants) take a main role for adopting and engaging in building energy flexibility. This paper provides a systematic review of consumer central energy flexibility in office buildings with the discussion of social, technical and business aspects. This paper clarifies the correlations of consumers‟ concerns, external influential factors, energy flexibility resources and technology with eight hypotheses. This paper suggests that technical solutions with the integration of distributed energy resources, building management and control system can boost energy flexibility in the office buildings.", "num_citations": "13\n", "authors": ["128"]}
{"title": "Method for dynamically transforming the bytecode of Java virtual machine bootstrap classes\n", "abstract": " A method for dynamically transforming bytecode of Java Virtual Machine (JVM) bootstrap classes during program startup uses a JVM agent to intercept startup of a JVM compliant computer program to transform the bytecode of already loaded JVM bootstrap classes and store the resulting set of modified bootstrap classes. Subsequently, the JVM Agent intercepts all class loading events to transform the bytecode of classes declaring special program startup method “< clinit>”, by inserting bytecode at the beginning of the method to invoke a callback method declared within the JVM Agent and passing the arguments passed to the JVM upon program startup as callback method parameters. Subsequently, when the callback method intercepts the execution flow of the computer program, the callback method starts a second JVM instance, passing parameters including the obtained input parameters, the main method …", "num_citations": "13\n", "authors": ["128"]}
{"title": "Load management of data centers as regulation capacity in Denmark\n", "abstract": " Replacing the traditional fossil-based electricity generation with clean renewable energy is critical to address carbon emissions and climate change in particular. Denmark has a particularly aggressive strategy for renewable energy generation. By 2020 50% of electricity production is to be wind based and by 2050 the goal is to have an energy production based entirely on renewable energy. Renewable energy such as solar and wind is subject to variations due to changing weather conditions. This requires additional balancing capacity and ancillary services in order to balance the grid for transmission system operators and distribution system operators and balance errors in forecasts made by balance responsible parties. By enabling the demand-side to adapt consumption to match power generation, we can address this in a cost-effective and environmental sound way. In this context, data centers are of special …", "num_citations": "13\n", "authors": ["128"]}
{"title": "Room-level occupant counts and environmental quality from heterogeneous sensing modalities in a smart building\n", "abstract": " The research areas of occupant sensing and occupant behavior modeling are lacking comprehensive public datasets for providing baseline results and fostering data-driven approaches. This data descriptor covers a dataset collected via sensors on room-level occupant counts together with related data on indoor environmental quality. The dataset comprises 44 full days, collated in the period March 2018 to April 2019, and was collected in a public building in Northern Europe. Sensor readings cover three rooms, including one lecture room and two study zones. The data release contains two versions of the dataset, one which has the raw readings and one which has been upsampled to a one-minute resolution. The dataset can be used for developing and evaluating data-driven applications, occupant sensing, and building analytics. This dataset can be an impetus for the researchers and designers to conduct …", "num_citations": "12\n", "authors": ["128"]}
{"title": "Room-level occupant counts, airflow and CO2 data from an office building\n", "abstract": " The area of occupant sensing is lacking public datasets to baseline and foster data-driven research. This abstract describes a dataset covering room-level occupant counts, in-room ventilation airflow and CO 2 data from an office building. This dataset can among others be used for developing and evaluating data-driven algorithms for occupant sensing and building analytics.", "num_citations": "12\n", "authors": ["128"]}
{"title": "Extending eclipse RCP with dynamic update of active plug-ins.\n", "abstract": " While the dynamic linking mechanism of modern programming languages, such as Java, allows loading of classes dynamically, it does not allow class reloading. Hence, dynamic linking facilitates development of component platforms, such as eclipse RCP, which supports dynamic loading but not dynamic updates of components, since this requires reloading. This paper presents an approach that enhances eclipse RCP with dynamic updating capability. It overcomes the version barrier imposed by Java's dynamic linking, while maintaining the security and type safety of Java. The feasibility of the approach validates through a modified implementation of the eclipse RCP run-time system. Analysis indicates that our approach imposes a moderate performance penalty relative to the unmodified platform.", "num_citations": "12\n", "authors": ["128"]}
{"title": "Energy flexibility of the commercial greenhouse growers: The potential and benefits of participating in the electricity market\n", "abstract": " Commercial greenhouses can provide energy flexibility with artificial lighting usage and information and communications technology support. Therefore, commercial greenhouse growers can potentially play an important role in the electricity market as a flexibility service provider. With the application of a climate control software-DynaLight NG, this paper takes Danish commercial growers and the Nordic electricity regulating market as an example, to investigate the market potential with two business models: 1) commercial greenhouse growers directly participate in the regulating market, 2) to reduce balance responsible parties' imbalance errors. Two calculations are formulated to evaluate the monetary benefits for the commercial greenhouse growers' participation in the two business models. The results show that: 1) one big commercial greenhouse grower might get around 55,000 DKK/month by providing their …", "num_citations": "11\n", "authors": ["128"]}
{"title": "Agent-based integration of complex and heterogeneous distributed energy resources in virtual power plants\n", "abstract": " A Virtual Power Plant aggregates several Distributed Energy Resources in order to expose them as a single, controllable entity. This enables smaller Distributed Energy Resources to take part in Demand Response programs which traditionally only targeted larger consumers. To date, models for Virtual Power Plants have considered Distributed Energy Resources as simple, atomic entities. However, often Distributed Energy Resources constitute complex and heterogeneous entities with a mix of multiple, controllable loads, generators and electrical storage units which must be coordinated locally. This paper proposes an agent-based method for integration of complex, heterogeneous Distributed Energy Resources into Virtual Power Plants. The approach models Distributed Energy Resources and Virtual Power Plants as agents with multi-objective, multi-issue reasoning. This enables modeling of VPPs …", "num_citations": "11\n", "authors": ["128"]}
{"title": "Continuous commissioning of buildings: A case study of a campus building in Denmark\n", "abstract": " The general trend in building commissioning is that the commissioning is often either insufficiently comprehensive in its execution, or it is not conducted at all. As such, it has been observed that buildings often will contain faults that have not been discovered during the commissioning phase. In this paper, we present a framework for continuous verification and commissioning of a building with a set of performance tests that are able to monitor the performance and functionality with a daily granularity. The performance tests are run on a newly constructed campus building in Denmark, over the course of three months, and the results of the performance tests are presented within a dashboard application, which helps verify that the building is performing accordingly to its original design intent.", "num_citations": "11\n", "authors": ["128"]}
{"title": "Improved local weather forecasts using artificial neural networks\n", "abstract": " Solar irradiance and temperature forecasts are used in many different control systems. Such as intelligent climate control systems in commercial greenhouses, where the solar irradiance affects the use of supplemental lighting. This paper proposes a novel method to predict the forthcoming weather using an artificial neural network. The neural network used is a NARX network, which is known to model non-linear systems well. The predictions are compared to both a design reference year as well as commercial weather forecasts based upon numerical modelling. The results presented in this paper show that the network outperforms the commercial forecast for lower step aheads (< 5). For larger step aheads the network’s performance is in the range of the commercial forecast. However, the neural network approach is fast, fairly precise and allows for further expansion with higher resolution.", "num_citations": "11\n", "authors": ["128"]}
{"title": "Cardinality-dependent variability in orthogonal variability models\n", "abstract": " During our work on developing and running a software product line for eco-sustainable greenhouse-production software tools, which currently have three products members we have identified a need for extending the notation of the Orthogonal Variability Model (OVM) to support what we refer to as cardinality range dependencies. The cardinality-range-dependency type enables expressing that the binding of a certain number of variants to a variation point can influence variability in other places in the model. In other words, we acknowledge that variability can be influenced, not necessarily by the specific variants being bound, but by their sheer numbers.", "num_citations": "11\n", "authors": ["128"]}
{"title": "A software product line for energy-efficient control of supplementary lighting in greenhouses\n", "abstract": " In 2009, the industrial-size greenhouses in Denmark consumed 0.8 percent of the national electricity consumption. The increasing energy costs for heating and supplementary lighting have bankrupt many growers in 2010 causing an urgent need for remaining growers to reduce the consumption while preserving production quality. This paper presents a novel approach addressing this issue. We use weather forecasts and electricity prices to compute cost-and energy-efficient supplementary light plans that achieve the required plant growth defined by the grower. Experiments performed during the winter of 2009–2010 showed 25 percent savings with no negative effect on plant quality. To accelerate the impact of our approach, we chose to use Software Product Line Engineering, as it enables a greater variety of related software tools to be created faster. We have created a web-based analysis tool, DynaLight Web, for computing potential savings of our approach, and a desktop version, DynaLight Desktop, that computes an optimal supplementary light plan and controls the supplementary lighting accordantly. DynaLight Desktop is currently being field-tested at five industrial-size greenhouses. The development of these two tools is described together with the lessons learned from using Software Product Line Engineering in the domain of greenhouse software development.", "num_citations": "11\n", "authors": ["128"]}
{"title": "A dynamic customization model for distributed component-based systems\n", "abstract": " Support for dynamic and client-specific customization of distributed services is required in many application areas. We present a distributed service as consisting of minimal functional core, implemented as a component based system, and an unbound set of potential extensions that can be selectively integrated within this core functionality. An extension to this core may be a new service, due to new requirements of end users. Another important category of extensions we consider are non-functional services such as authentication, which typically introduce interaction refinements at the application level. Each extension is implemented us a layer of decorator-like wrappers. The novelty of this work is that the composition logic, responsible for integrating extensions into the core system, is completely separated from the code of the core system, extensions and clients as well. Clients (end users, system integrators) can …", "num_citations": "11\n", "authors": ["128"]}
{"title": "Data Architecture for Digital Twin of Commercial Greenhouse Production\n", "abstract": " There is an increasing demand for industry-specific solutions for optimizing production processes with the transitions towards Industry 4.0. The commercial greenhouse sector relies heavily on optimal use of energy with multiple new concepts introduced in recent years e.g. vertical farming and urban agriculture. Digital twins allow utilizing the Internet of Things and big data to simulate the alternative operation strategies without compromising current operation. This paper aims to present the development of a digital twin of the commercial greenhouse production process as a part of the recently launched EUDP funded project Greenhouse Industry 4.0 in Denmark. This digital twin allows using big data and the Internet of Things to optimize the greenhouse production process and communicate with other digital twins representing essential areas in the greenhouse (climate and energy). This digital twin can estimate …", "num_citations": "10\n", "authors": ["128"]}
{"title": "Agent-based decision making for adoption of smart energy solutions\n", "abstract": " Agent-based simulation of the decision-making process for adoption of smart energy solutions can provide evidence for smart energy solutions' providers to decide for a business strategy which results in the best adoption rate. The adoption rate of smart energy solutions is important in achieving climate goals, such as the Danish goal to have 100% renewable electricity production by 2030. This paper shows how agent-based simulation can be used to investigate the decision-making process for adoption of smart energy solutions. The study investigates a case about Danish commercial greenhouse growers' adoption of a demand response program. The simulation outputs an adoption curve and grower information. The results provide the maximum monetary cost for achieving an adoption rate of 50% in 5 years.", "num_citations": "10\n", "authors": ["128"]}
{"title": "Energy Flexibility Potential of Industrial Processes in the Regulating Power Market.\n", "abstract": " Demand response is generally considered necessary for efficiently upholding grid balance with the increased intermittent production from renewable energy sources. Demand response is acknowledged to enhance the use of more renewable energy friendly technologies, such as heat pumps, electric vehicles, and electric heating in replacement of conventional technologies. To enable the use of demand response, the consumers must have economical and practical incentives without loss of convenience. This study aims to investigate the demandresponse market potential of a flexible industrial process in the current electricity market structure. The Danish West regulating power market is selected in this study with an ideal process simulation of an industrial roller press. By analysing market data, the value of flexible electricity consumption by the roller press in the regulating power market is demonstrated by an ideal process simulation.", "num_citations": "10\n", "authors": ["128"]}
{"title": "A practical approach to validation of buildings’ sensor data: a commissioning experience report\n", "abstract": " Often manually performed commissioning processes on building's sensors fail to systematically validate that all building's sensors operate correctly. This is so because manual processes are tedious and only inspect a limited number of sensors. As a result, sensors are often uncalibrated, biased or somehow faulty, impacting building's behaviour, comfort level and energy usage. We present a practical approach to automatically validate data from all building's sensors. We designed and implemented four different tests to detect out-of-range values, spikes, latency issues and non-monotonous values. Our tests are based on expert knowledge and do not need historical data. We ran the validation tests on a newly constructed building at the campus of the University of Southern Denmark. As a result we identified two types of faulty behaviours in the building's sensors: CO 2  sensors reporting biased values and …", "num_citations": "10\n", "authors": ["128"]}
{"title": "A building model framework for a genetic algorithm multi-objective model predictive control\n", "abstract": " Model Predictive Control (MPC) of building systems is a promising approach to optimize building energy performance. In contrast to traditional control strategies which are reactive in nature, MPC optimizes the utilization of resources based on the predicted effects. It has been shown that energy savings potential of this", "num_citations": "10\n", "authors": ["128"]}
{"title": "Structural properties and mechanical durability of extruded fish feed\n", "abstract": " This article investigates the possible correlation between mechanical properties of fish feed pellets and their mechanical durability. Mechanical properties were obtained by texture profile analysis (TPA) and stress relaxation test (SRT) of different types of fish feed. The results were correlated against a conventional test of mechanical durability (DORIS, Durability On a Realistic, test). From SRT it was found that for achieving a high durability, pellets should be able to relax an applied force nonelastically. From TPA, it was found that a durable pellet should also be able to return its original state after a deformation. By fitting SRT data with a two time constant generalized Maxwell model, it was found that the largest time constant is ∼7 s. The waiting time in‐between the two impacts in TPA was increased from 5 to 15 s, which significantly improved the correlations against mechanical durability …", "num_citations": "10\n", "authors": ["128"]}
{"title": "The impact of occupancy resolution on the accuracy of building energy performance simulation\n", "abstract": " Using Building Performance Simulation (BPS) is nowadays a standard practice in building design, building operation and energy management, model predictive control, fault detection and diagnosis applications. One of the major factors affecting the energy performance of buildings is occupancy. In this study, we analyze the impact of different resolutions of occupancy count profiles on BPS accuracy. These occupancy count profiles are obtained from a large educational building. These profiles includes:(1) whole-building occupancy distributed evenly across building zones,(2) detailed zone-level occupancy estimated from stereo-vision cameras and WiFi sensors. Simulations were carried out using a detailed white-box model implemented in EnergyPlus and validated against ground truth data. A comparison of the ground truth data with obtained simulation results indicate that the increased resolution of occupancy …", "num_citations": "9\n", "authors": ["128"]}
{"title": "Termination Criteria in Evolutionary Algorithms: A Survey.\n", "abstract": " Over the last decades, evolutionary algorithms have been extensively used to solve multi-objective optimization problems. However, the number of required function evaluations is not determined by nature of these algorithms which is often seen as a drawback. Therefore, a robust and reliable termination criterion is needed to stop the algorithm. There is a huge amount of knowledge encapsulated in the studies targeting termination criteria in evolutionary algorithms, but an updated integrated overview of this knowledge is missing. For this reason, we aim to conduct a systematic research through a comprehensive literature study. We extended the basic categorization of termination criteria to a more advanced one that takes the most common used termination criteria into consideration based on their specifications and the way they have been evolved over time. The survey is concluded by suggesting a road-map for future research directions.", "num_citations": "9\n", "authors": ["128"]}
{"title": "Load management through agent based coordination of flexible electricity consumers\n", "abstract": " Demand Response (DR) offers a cost-effective and carbon-friendly way of performing load balancing. DR describes a change in the electricity consumption of flexible consumers in response to the supply situation. In DR, flexible consumers may perform their own load balancing through load management (LM) mechanisms. However, the individual amount of load balancing capacity exhibited by the majority of flexible consumers is limited and as a result, coordinated LM of several flexible electricity consumers is needed in order to replace existing conventional fossil based load balancing services. In this paper, we propose an approach to perform such coordination through a Virtual Power Plant (VPP)[1]. We represent flexible electricity consumers as software agents and we solve the coordination problem through multi-objective multi-issue optimization using a mediator-based negotiation mechanism. We …", "num_citations": "9\n", "authors": ["128"]}
{"title": "Javeleon: An integrated platform for dynamic software updating and its application in self-* systems\n", "abstract": " Practical dynamic updating of modern Java applications requires tool support to become an integral part of the software development and maintenance lifecycle. In this paper we present Javeleon, an easy-to-use tool for dynamic updates of Java applications. To support integration with specific frameworks, component systems and application servers, Javeleon currently provides tight integration with the NetBeans Platform, facilitating dynamic updating for applications built on top of the NetBeans Platform in an unconstrained manner. Javeleon supports state-preserving unanticipated runtime evolution including dynamic changes to the type hierarchy of classes without modifying a JVM and without utilizing new language constructs. In addition to the obvious benefits of using Javeleon during development, we argue that Javeleon is a strong candidate for being useful in other research fields. In order to substantiate this …", "num_citations": "9\n", "authors": ["128"]}
{"title": "Featureous: a tool for feature-centric analysis of java software\n", "abstract": " Feature-centric comprehension of source code is necessary for incorporating user-requested modifications during software evolution and maintenance. However, such comprehension is difficult to achieve in case of large object-oriented programs due to the size, complexity, and implicit character of mappings between features and source code. To support programmers in overcoming these difficulties, we present a feature-centric analysis tool, Featureous. Our tool extends the NetBeans IDE with mechanisms for efficient location of feature implementations in legacy source code, and an extensive analysis of the discovered feature-code relations through a number of analytical views.", "num_citations": "9\n", "authors": ["128"]}
{"title": "Agent-Based Modelling of Demand-Side Flexibility Adoption in Reservoir Pumping\n", "abstract": " As wind and solar power displace conventional generation in the electricity grid, there is an urgent need for technologies that can deal with the variation in supply. Demand response technology has been proposed as a solution to make the demand-side flexible and able to effectively adjust to variations in supply. However, consumers do not simply invest in demand response technologies without insurance that their investment will pay back. This paper applies agent-based simulation to investigate consumer adoption behaviour of implicit demand response solutions that allow consumers to adjust their electricity use to the hourly prices in day-ahead spot markets. The simulation uses the case study of a water supply system to show that the adoption speed of implicit demand response technology depends on both technical characteristics of the system and the business model of the implicit demand response solution …", "num_citations": "8\n", "authors": ["128"]}
{"title": "The Bright Green Hospitals Case Studies of Hospitals' Energy Efficiency And Flexibility in Philippines\n", "abstract": " Hospitals usually operate 24/7 and consume a large amount of electricity to provide service and deploy critical machines that require reliable electricity. To maintain the energy reliability, hospitals usually equip diesel electricity generators, which are expensive and produce greenhouse gas (GHG) emissions. Therefore, there are potentials for hospitals to improve energy efficiency and provide energy flexibility to the electricity grid. However, due to specific functions of hospital buildings, the general concept of bright green buildings does not fit hospital buildings. Therefore, this paper aims to define and discussion the concept of bright green hospitals. A case study of two hospitals in the Philippines is selected to investigate energy management practices and installed intelligent technologies in hospitals. The “bright green hospitals” improve occupants' comfort, reduce energy consumption and carbon emissions, and …", "num_citations": "8\n", "authors": ["128"]}
{"title": "Demand response integration through agent-based coordination of consumers in virtual power plants\n", "abstract": " The transition towards an electricity grid based on renewable energy production induces fluctuation in electricity generation. This challenges the existing electricity grid design, where generation is expected to follow demand for electricity. In this paper, we propose a multi-agent based Virtual Power Plant design that is able to balance the demand of energy-intensive, industrial loads with the supply situation in the electricity grid. The proposed Virtual Power Plant design uses a novel inter-agent, multi-objective, multi-issue negotiation mechanism, to coordinate the electricity demands of industrial loads. Coordination happens in response to Demand Response events, while considering local objectives in the industrial domain. We illustrate the applicability of our approach on a Virtual Power Plant scenario with three simulated greenhouses. The results suggest that the proposed design is able to coordinate the …", "num_citations": "8\n", "authors": ["128"]}
{"title": "Discussion on China's Power Sector Reforms and where to next?\n", "abstract": " This paper reviews the reform history of China's Power sector, and evaluates its reform conversion process with a focus of deregulated electricity market based on the literatures and other European countries' experience. Furthermore, the current China's electricity industry is investigated by using the SWOT analysis (strengths, weaknesses, opportunities, and threats). The research results show that, after a series of reform actions, China's Power sector has shifted from an absolute monopoly to a relative monopoly. This paper conducts four strategic recommendations for the acceleration of China's power sector reform and the stability of its electricity market in a deregulated environment.", "num_citations": "8\n", "authors": ["128"]}
{"title": "Towards energy efficient office buildings in Denmark: the Maersk building case study\n", "abstract": " Buildings in the EU contribute to about 40% of the overall energy consumption and 36% of CO 2 emissions. Denmark is one of the active countries in the EU in terms of improving buildings energy performance and integrating renewable energy resources in the energy production scheme with a long-term 2050 objective of a fossil fuels-independent energy supply sector. This study targets the office buildings sector in Denmark considering a case study of the Maersk Building, located at the University of Southern Denmark Odense campus, aiming to improve its energy performance. A detailed model for the office building was developed using a package of Google Sketchup, Open Studio and Energy Plus modelling and simulation tools. It was shown that the building overall primary energy consumption is as high as 195.82 kWh/m 2. Applying retrofit measures and energy management and control strategies, the building energy consumption was reduced to comply with the BR10 Danish building regulations. Moreover, additional reduction in the energy consumption was achieved through implementing a PV system on the building roof which allows improving the building energy level to 2015 low energy class building.", "num_citations": "8\n", "authors": ["128"]}
{"title": "Comparative study of evolutionary multi-objective optimization algorithms for a non-linear Greenhouse climate control problem\n", "abstract": " Non-trivial real world decision-making processes usually involve multiple parties having potentially conflicting interests over a set of issues. State-of-the-art multi-objective evolutionary algorithms (MOEA) are well known to solve this class of complex real-world problems. In this paper, we compare the performance of state-of-the-art multi-objective evolutionary algorithms to solve a non-linear multi-objective multi-issue optimization problem found in Greenhouse climate control [1]. The chosen algorithms in the study includes NSGAII, ε-NSGAII, ε-MOEA, PAES, PESAII and SPEAII. The performance of all aforementioned algorithms is assessed and compared using performance indicators to evaluate proximity, diversity and consistency. Our insights to this comparative study enhanced our understanding of MOEAs performance in order to solve a non-linear complex climate control problem. The empirical findings of this …", "num_citations": "8\n", "authors": ["128"]}
{"title": "Module reload through dynamic update-the case of netbeans\n", "abstract": " Recent versions of the NetBeans IDE allow us to easily reload NetBeans modules in an instance of a running program. Though overcoming some of the dynamic component-replacement issues, simply running NetBeans' install/uninstall hooks, can lead to dangling object references and hard-to-track class cast exceptions. These problems are caused by Java's class-loading scheme which considers class objects of the same class definition as distinct types when loaded by different class loaders. In this paper we apply a novel dynamic update approach to NetBeans' reload feature which overcomes these shortcomings, thus confirming its general validity. Hence, developers of NetBeans application modules, as well as NetBeans IDE modules, will experience a significant improvement as our approach allows transparent evolution of both code and state.", "num_citations": "8\n", "authors": ["128"]}
{"title": "Enhancing Jini's lookup service using XML-based service templates\n", "abstract": " We present an extension to Jini's lookup service. The existing lookup service has certain limitations when it comes to searching for specific services. We introduce more advanced service descriptors and a lookup service that enables flexible searching for specific services. Our proposal makes it easy to incorporate non-functional requirements, such as quality-of-service. This means that services can publish themselves with a descriptor describing their guarantees for the service they deliver. Clients will then be able to fill out a descriptor containing requirements (expectations). When the client asks a lookup service for matches based on the descriptor, only services fufilling the requirements will be returned. The advanced searching in Jini is done client-side, while we have moved it to the lookup services. This way even small devices with limited memory and computation power will be able to perform advanced …", "num_citations": "8\n", "authors": ["128"]}
{"title": "Ecosystem Thinking: Creating Microgrid Solutions for Reliable Power Supply in India's Power System\n", "abstract": " Microgrids are considered as a potential solution for areas in a power system which are experiencing challenges with providing reliable power supply. The challenges for designing and implementing microgrids are both technical and market-oriented. The technical and market designs for microgrids need to consider local conditions. To address this challenge this paper applies the methodology of ecosystem thinking and CSTEP factor analysis to systematically investigate stakeholders, value flows, current challenges and future trends in a selected national power system. A microgrid solution which provides demand response service to the main power grid is identified for solving the challenge of increasing power demand in the urban areas of India. The co-innovation risk analysis and adoption chain risk analysis are conducted to investigate the success rate of the identified microgrid solution. Simulations with …", "num_citations": "7\n", "authors": ["128"]}
{"title": "Influential factors for accurate load prediction in a demand response context\n", "abstract": " Accurate prediction of a buildings electricity load is crucial to respond to Demand Response events with an assessable load change. However, previous work on load prediction lacks to consider a wider set of possible data sources. In this paper we study different data scenarios to map the influence of the different data parameters. We also look at the temporal aspect of predicting by looking at the predicted seasons. By predicting with a MultiLayer Perceptron, which is a universal approximator, it is possible to focus solely on the influence of the parameters instead of the prediction algorithm itself. Finally, multiple prediction algorithms are compared. The influential factor analysis is based on data from an entire year from a office building in Denmark. The results show that weather data is the most crucial data parameter. A slight improvement from load data was however seen using only occupancy data. Next, the time of …", "num_citations": "7\n", "authors": ["128"]}
{"title": "Triple-layer smart grid business model: A comparison between sub-Saharan Africa and Denmark\n", "abstract": " Viewing the smart grid with the theory of business models may open opportunities in understanding and capturing values in new markets. This study tries to discover and map the smart grid ecosystem-based business model framework with two different environments (sub-Saharan Africa and Denmark), and identifies the parameters for the smart grid solutions to the emerging markets. This study develops a triple-layer business model including the organizational (Niche), environmental (Intermediate), and global (Dominators) factors. The result uncovers an interface of market factors and stakeholders in a generic smart grid constellation. The findings contribute the transferability potential of the smart grid solutions between countries, and indicate the potential to export and import smart grid solutions based on the business modeling.", "num_citations": "7\n", "authors": ["128"]}
{"title": "Enhancing state-of-the-art multi-objective optimization algorithms by applying domain specific operators\n", "abstract": " To solve dynamic multi-optimization problems, optimization algorithms are required to converge quickly in response to changes in the environment without reducing the diversity of the found solutions. Most Multi-Objective Evolutionary Algorithms (MOEAs) are designed to solve static multi-objective optimization problems where the environment does not change dynamically. For that reason, the requirement for convergence in static optimization problems is not as time-critical as for dynamic optimization problems. Most MOEAs use generic variables and operators that scale to static multi-objective optimization problems. Problems emerge when the algorithms can not converge fast enough, due to scalability issues introduced by using too generic operators. This paper presents an evolutionary algorithm CONTROLEUM-GA that uses domain specific variables and operators to solve a real dynamic greenhouse climate …", "num_citations": "7\n", "authors": ["128"]}
{"title": "An agent-based framework for aggregation of manageable distributed energy resources\n", "abstract": " Distributed energy resources (DER) offer an economically attractive alternative to traditional centralized generation. However, the unpredictable and scattered nature of DER prevents them from replacing traditional centralized generator capacity. Aggregating DER under a virtual power plant (VPP) addresses this issue by exposing the combined capabilities of connected DER as a single controllable entity towards the utility. In this paper we propose an architecture that supports multi-level aggregation of DER under VPPs. In this architecture, DER submit energy profiles to a VPP. The VPP may then control the DER within the boundaries defined in the energy profiles. The proposed architecture is hosted in an agent-based framework, Controleum, and is to be demonstrated at a primary school in Denmark, first quarter 2014.", "num_citations": "7\n", "authors": ["128"]}
{"title": "Towards intelligent optimization of offshore oil and gas production using multi-agent software systems\n", "abstract": " Production optimization for offshore oil and gas production is in general a challenging task due to the many and potentially conflicting control objectives that arise from the intrinsic complexity of the domain. Therefore the development of control system software that can accommodate the required changes to the control logic as oil fields mature is equally challenging. In this paper we present a novel multi-agent software approach that facilitates intelligent stratified multi-objective control. In offshore control systems of today implementations of individual control concerns are scattered across software components of the control systems. Hence, modification of a control concern requires full inspection of the software components to ensure that the change does not conflict with any of the other control concerns. This results in relatively fixed control schemes, as changes to the control system is very expensive and time …", "num_citations": "7\n", "authors": ["128"]}
{"title": "Independently extensibile contexts\n", "abstract": " Building and maintaining non-trivial software systems that are independently extensible is a difficult task. This is because the combination of independent extensions tends to produce conflicts that are difficult to anticipate, and to which no general resolution strategy exists. In this paper, we show how some of these conflicts can be avoided if domain-specific contexts are modeled using a representation that is open for extension and safe for sharing among independent extensions.", "num_citations": "7\n", "authors": ["128"]}
{"title": "Towards dynamic plug-in replacement in Eclipse plug-in development\n", "abstract": " Although the Eclipse IDE offers an extremely useful built-in support for developing Eclipse plug-ins, it lacks the ability to perform dynamic updates of plug-ins in a running instance of the application being developed. Because of the nature of the Eclipse architecture and its strict class-loader delegation, plug-ins can only communicate through well-defined APIs. By applying a novel dynamic update approach to the eclipse plug-in development environment that exploits this knowledge, a new API are defined, namely the Dynamic API. This paper discusses some of the ordinary binary compatible changes that lead to erroneous program behaviour if not properly handled. Furthermore, it discusses how applying a dynamic update approach at development time gives developers a unique chance to experiment with dynamic updates without risking a costly shutdown of a real-life application.", "num_citations": "7\n", "authors": ["128"]}
{"title": "Classifying component interaction in product-line architectures\n", "abstract": " This paper describes a set of interaction patterns that were used to facilitate the composition of components in the product-line architecture of a robot control system. The primary purpose of supporting a common set of component interaction patterns in a product-line architecture is to reduce the learning curve of the inner working of the architecture. Interaction patterns provide the means for informal reasoning about the functionality and temporal behavior of components and their interconnections. In addition, it supports increased readability of the architecture diagrams.", "num_citations": "7\n", "authors": ["128"]}
{"title": "Agent-based modeling for optimizing CO2 reduction in commercial greenhouse production with the implicit demand response\n", "abstract": " Industries are identified as major potentials to reduce the CO2 emission due to their large energy consumption and the possibility of providing energy flexibility with optimization and smart control. Commercial greenhouses are considered as one of the industries that have large energy flexibility potentials with the heavily used artificial lighting (around 75% of the electricity consumption coming from artificial lighting). This paper investigates the CO2 reduction potential in the commercial greenhouses with a case study of the Danish commercial greenhouses via participation in the implicit Demand Response. Agent-Based modeling is used to simulate the greenhouse production and the response to the electricity spot price signals. The result shows that the potential of CO2 reduction in 2018 was 0.33% (equals to 170 thousand tonnes) of the total Danish emission when 50% (equals to 181 growers) of the Danish commercial greenhouses participate in the implicit Demand Response. The last 50% of the commercial greenhouses have a relatively slow adoption rate and account for only a small amount of CO2 reductions. Meanwhile, the largest reduction of the CO2 emission is not in chronological order as commercial greenhouses' financial saving because the electricity spot price and solar irradiation do not follow each other.", "num_citations": "6\n", "authors": ["128"]}
{"title": "A review on building energy savings strategies and systems (BE3S)\n", "abstract": " Energy savings in buildings as a goal in recently established buildings either residential or commercial has been nowadays paid much attention by many researchers, designers, and decision makers due to the need of reducing energy demand and global warming issues. This challenging goal is affected by several factors and roles which play important roles by which this goal is affected. Those factors in most cases are difficult to be treated by one method or design. Many proposed systems have been introduced for many years; their performance(s) have varied percentage(s) of achievement in terms of energy savings. In this setting, such a review paper could help much to draw a clear plan for researchers and buildings' designers to follow and get them directed to best and easiest systems. However, many review papers have been published which included many limitations, e.g., some review papers focused only …", "num_citations": "6\n", "authors": ["128"]}
{"title": "Electricity supply industry reform in Malaysia: Current state and way forward\n", "abstract": " The Malaysia electricity supply industry (MESI) has gone through a series of reforms and restructuring since it first started at the beginning of the last century. The latest series of reform, known as MESI 1.0 has been ongoing since 2010. The objectives are to achieve secure and reliable supply of energy, to have economically competitive tariffs, to be environmentally sustainable and to improve customer satisfaction/choice. MESI 1.0 is now coming to its end, and in a recent development, the government has announced the commencement of the next series of MESI reform, MESI 2.0. The objectives of MESI 2.0 are to increase the industry efficiency, to future proof the industry, structure, regulations and key processes, and to empower the consumers. MESI 2.0 is obviously the continuation of MESI 1.0. Thus, prior to the start of MESI 2.0, it is important to review the progress and achievements of MESI 1.0 in such a way that enables informed decisions to be made in designing MESI 2.0. This paper therefore presents a review on the progress and achievements of MESI 1.0, focusing on the initiatives undertaken and evaluating the extent to which the objectives of MESI 1.0 have been addressed by the initiatives. Analysis performed on the review results shows that the second objective of having competitive tariffs is mostly addressed by the initiatives whereas more work needs to be done to address the other objectives, particularly on being environmentally sustainable. Liberalisation through the unbundling of MESI is also identified as the potential means to achieve the objectives of MESI 2.0. Findings from this study can serve as the reference point in …", "num_citations": "6\n", "authors": ["128"]}
{"title": "Integration of Independently Developed Components through Aliased Multi-Object Type Widening.\n", "abstract": " The aim of component-based software development is to assemble applications from existing components, writing as little extra code as possible. For programmers, the assembling of applications from existing components should increase reuse, thus allowing them to concentrate on value-added tasks and to produce high-quality software within a shorter time. For users, component-based software development promises tailor made functionality from the customization of ready-made components, and that at a lower cost than applications developed from scratch. However, this ideal scenario has yet to become reality! Today, the majority of all applications are still developed from scratch, and there are still relatively few ready-made components that can be easily reused in the construction of new applications. In this paper, we argue that the present situation is primary caused by the conventional object-oriented programming languages in which we try to assemble components. When Assembling independently developed components in a conventional object-oriented programming language, it leads to a number of complex integration problems. We describe these problems in turn before we discuss how the new language features of Lasagne/J, an extension of the Java programming language, can be used to tackle them.", "num_citations": "6\n", "authors": ["128"]}
{"title": "Agent-based Modeling of Climate and Electricity Market Impact on Commercial Greenhouse Growers’ Demand Response Adoption\n", "abstract": " Commercial greenhouses in Denmark account for 0.7% of the total Danish electricity consumption in 2017. 75% of the consumption is estimated to come from artificial light. Artificial light in the greenhouses is identified as a major potential to provide energy flexibility through demand response. Energy flexibility in greenhouses is depending on the electricity price and weather conditions as artificial light is managed in relation to natural light and hourly electricity prices. Therefore, this paper investigates commercial greenhouse growers’ adoption behavior of implicit demand response enabled software solutions in different geographical regions with different weather conditions and electricity markets. The simulation of the greenhouses is developed as an agent-based system. The paper uses Denmark as the baseline model, the UK for market comparison with Denmark, and Spain and Denmark for analyzing the …", "num_citations": "5\n", "authors": ["128"]}
{"title": "Optimization of energy flexibility in cooling process for brewery fermentation with multi-agent simulation\n", "abstract": " To enable industries’ benefit and transition towards industry 4.0, intelligent solutions addressing and uncovering energy flexibility in the production processes are required. Breweries are one of the industries that have high energy flexibility potentials, and breweries can utilize substantial amounts of energy for cooling fermentation tanks as a result of the heat generated by the yeast. This paper investigates the energy flexibility potentials of fermentation tanks by using refrigeration based on a case study of a Danish brewery. To optimize the energy flexibility, the multi-agent simulation is applied for modeling the brewery fermentation process. Multi-agent simulation allows defining behavioral logic for each fermentation tank and each tank behaves independently based on the input parameters and environmental factors. The tanks are gathered in an agent population and used for implementing a temperature control strategy based on agent characteristics. An energy flexibility potential using temperature adjustment is uncovered by the adaption of the temperature adjustment strategy, and an electricity cost saving of the 0.75% current operation in a 2-year period is found. With a multi-agent system approach, the finding contributes to the decision making of industries regarding the future optimization of energy flexibility in industrial processes.", "num_citations": "5\n", "authors": ["128"]}
{"title": "Agent-based simulation design for technology adoption\n", "abstract": " The global consequences of climate change calls for adoption of new technologies across all sectors of society. However, it is important to know how fast new technologies are adopted to reach the political climate goals. This paper presents a method for designing agent-based simulations for studying technology adoption. The method includes the design of simulation population, agent adoption logic, and external factors influencing agents' adoption decisions. A case study of the Danish commercial greenhouses' adoption of a smart energy solution is investigated. The result is presented with Roger's technology adoption curve which can be used to demonstrate the desired adoption rate by regulating different simulation parameters. The adoption rate of 50% with the return on the investment of 3 and 5 years is investigated. The greenhouse segment of growing pot plants with an area of more than 20,000 m2 is found …", "num_citations": "5\n", "authors": ["128"]}
{"title": "A discussion of building automation and stakeholder engagement for the readiness of energy flexible buildings\n", "abstract": " Building automation enables the possibility of energy flexibility in buildings. To investigate the motivation and barriers for the energy flexibility in buildings, this study develops a conceptual framework of the readiness for energy flexible buildings by conducting interviews with building automation suppliers, electricity supplier, district heating supplier, distribution system operator, energy service companies, experts in energy and buildings, building managers, and occupants. The two main parts of the framework are building preparation, grid and market conditions following the impacts of regulation and policies, stakeholder collaboration and integrated building automation. A case study of campus buildings is conducted to demonstrate the framework. The result of the case study shows that the main barriers for buildings to provide energy flexibility are 1) many buildings are too old and need to be refurbished, 2) the …", "num_citations": "5\n", "authors": ["128"]}
{"title": "Peer-to-peer trading solution for microgrids in Kenya\n", "abstract": " The microgrid development in Kenya is increasing dramatically due to the demand for electricity and the aging electricity transmission infrastructure. However, the current trading approach for microgrids is not sufficient, for especially isolated microgrids in Kenya. This paper proposes a peer-to-peer trading solution called Auction House. This trading solution contains information of bids and sales, and can create a market that both electricity producers and consumers can buy and sell electricity at a desired timeslot and in variable duration via mobile phones. The results by the microgrid simulation software-Homer Pro with a case study of a village consisting 50 citizens in the rural area in Kenya show that the Auction House Trading solutions can provide incentives to both private and public microgrids in Kenya.", "num_citations": "5\n", "authors": ["128"]}
{"title": "Solutions for Remote Island Microgrids: Discussion and analysis of Indonesia’s remote island energy system\n", "abstract": " Energy poverty is widespread in island countries, especially for the low-income countries. It is around 70% households in the Pacific island countries do not have access to electricity. With the fast development of renewable technologies, feasible and cost-efficient microgrid solutions are expected to mitigate this issue. This paper uses Indonesia as an example to investigate, develop and evaluate the potential microgrid solutions for the remote islands. There are six potential microgrid solutions are discussed, and two solutions (photovoltaic cells and storage; diesel generator, photovoltaic cells, and battery) are evaluated and identified as the most feasible, cheapest, and green solutions for the remote island microgrids.", "num_citations": "5\n", "authors": ["128"]}
{"title": "An Assessment for Energy Management in Retail Stores\n", "abstract": " Retail stores are responsible for large energy consumption, which requires more intensified action to improve energy efficiency. Effective energy management can improve energy efficiency in retail stores. However, it is a challenge to implement energy management in retail stores due to different stakeholders’ roles and diverse store features. Literally, technical and management aspects of energy management have received much attention in research. However, limited studies systemically investigate internal and external factors and stakeholders’ involvement in the energy management of retail buildings. With multi-cases in the Philippines, this paper examines the energy profiles in retail stores and develops an assessment for energy management in retail stores. The assessment includes store features, internal and external stakeholders, climate, electricity price and grid condition, energy consumption, and management. The assessment can assist retail stores to develop their energy management plans with their store profile.", "num_citations": "5\n", "authors": ["128"]}
{"title": "Novel automatic filter-class feature selection for machine learning regression\n", "abstract": " With the increased focus on application of Big Data in all sectors of society, the performance of machine learning becomes essential. Efficient machine learning depends on efficient feature selection algorithms. Filter feature selection algorithms are model-free and therefore very fast, but require a threshold to function. We have created a novel meta-filter automatic feature selection, Ranked Distinct Elitism Selection Filter (RDESF) which is fully automatic and is composed of five common filters and a distinct selection process.             To test the performance and speed of RDESF it will be benchmarked against 4 other common automatic feature selection algorithms: Backward selection, forward selection, NLPCA and PCA as well as using no algorithms at all. The benchmarking will be performed through two experiments with two different data sets that are both time-series regression-based problems. The …", "num_citations": "5\n", "authors": ["128"]}
{"title": "Multifunctional control of an NPC converter for the grid integration of renewable energy sources\n", "abstract": " This paper presents a control method based on dynamic model of three-level neutral-point-clamped (NPC) voltage source converter (VSC) for integration of renewable energy sources (RESs) into the power grid. The proposed control method can provide continuous injection of active power besides the compensation of all reactive power and harmonic current components of loads through integration of RESs into the grid. Simulation results confirm a reduced total harmonic distortion (THD), increased power factor of the grid, and injection of maximum power of RESs to the grid. The proposed model is developed in Matlab/Simulink environment and emphasis is given to the challenges met during the modeling.", "num_citations": "5\n", "authors": ["128"]}
{"title": "Rheological properties as indicator for physico-chemical processes affecting technical quality of extruded fish feed\n", "abstract": " This paper proposes important rheological properties of fish feed pellets for withstanding mechanical stress during handling and transport. Different fish feed types are subjected to mechanical stress in the DORIS tester, to measure their mechanical durability. The same feeds are also subjected to texture analyses (texture profile analyses and stress relaxation tests), where mechanical attributes of the pellets are investigated for different orientation of the pellets. A screening test for the different mechanical properties showed that a linear model including ‘cohesiveness’, elastic modulus and hardness are able to describe 68% of the variation in mechanical durability. Individual correlations against mechanical durability showed that the cohesiveness was particular important, which is a measure of the pellet’s ability to return its original state after deformation. The elasticity of a pellet was also found to be of importance. Higher cohesiveness and modulus of elasticity is shown to increase the mechanical durability, while the elasticity should be low. From these results it is proposed that the pellets should be able to relax the force applied at the surface as deformation in non-elastic type behaviour. Also, a durable feed pellet should have a high elastic modulus and a viscoelastic nature promoting stress relaxation and reversible deformation.", "num_citations": "5\n", "authors": ["128"]}
{"title": "Towards a generic controller for arbitrary robotic manipulators\n", "abstract": " The design and implementation of flexible and generic control systems is one of the major challenges in robotics. In this article we present an elegant approach to generic control aimed at controlling high performance robotic manipulators. The approach is based on the idea that high flexibility of the control system can best be achieved by ensuring that modifications can be made in easy accessible software components rather than trying to change a traditional black box controller. At lts core the generic controller contains an advanced and easily adjustable physically based mathematical model of the robot. High accunacy of t~ e model is ensured during operation through the utUiiation of very efficient on-line parameter optimization techniques.The generic control system is applied to a 7-axis Mitsubishi PA-10 robot. It is demonstrated that the controller can automatically estimate the normally un· known parameters of the robot, and that the generated motion for the PA-10 robot is precise.", "num_citations": "5\n", "authors": ["128"]}
{"title": "System architecture modelling framework applied to the integration of electric vehicles in the grid\n", "abstract": " A structured approach for the design of a model architecture is presented. From a simplified representation of the current situation, the aim is to implement regulations and test solutions in order to reach future climate targets. The challenge is to combine model accuracy to minimise uncertainty of the results on one side, and ease of implementation/plausibility of scenarios on the other side, which often decreases as systems complexify. A stage-wise model expansion is suggested to balance these two criteria. This approach is applied to the case of increased grid integration of electric vehicles (EVs) in Denmark.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Optimization of greenhouse production process: an investigation of energy efficiency potentials\n", "abstract": " Political focus has in recent years focused on climate and energy efficiency as part of the global goals of a fossil-free future. The introduction of the term industry 4.0, the fourth industrial revolution, provides a solution. Industry 4.0 seeks to combine the real and virtual space to achieve maximum efficiency and autonomy. This paper aims to investigate the energy efficiency potentials in the industrial production processes with a case study of a large commercial greenhouse grower in Denmark. The discrete event simulation software- Arena is used in this study for performing the simulations of the greenhouse production. The simulation results in the total yearly electricity consumption of 1,970.83 MWh. This paper finds that there is not big energy efficiency potential in the greenhouse production process without response to the hourly electricity price signals, and the results indicate a bottleneck at the transportation from …", "num_citations": "4\n", "authors": ["128"]}
{"title": "Combining Performance Testing and Metadata Models to Support Fault Detection and Diagnostics in Smart Buildings\n", "abstract": " Performance testing of components and subsystems of buildings is a promising practice for increasing energy efficiency and closing gaps between intended and actual performance of buildings. A typical shortcoming of performance testing is the difficulty of linking a failing test to a faulty or underperforming component. Furthermore, a failing test can also be linked to a wrongly configured performance test. In this paper, we present Building Metadata Performance Testing (BuMPeT), a method that addresses this shortcoming by using building metadata models to extend performance testing with fault detection and diagnostics (FDD) capabilities. We present four different procedures that apply BuMPeT to different data sources and components. We have applied the proposed method to a case study building, located in Denmark, to test its capacity and benefits. Additionally, we use two real case scenarios to showcase examples of failing performance tests in the building, as well as discovery of causes of underperformance. Finally, to examine the limits to the benefits of the applied procedure, a detailed elaboration of a hypothetical scenario is presented. Our findings demonstrate that the method has potential and it can serve to increase the energy efficiency of a wide range of buildings. View Full-Text", "num_citations": "4\n", "authors": ["128"]}
{"title": "Demand response with model predictive comfort compliance in an office building\n", "abstract": " The change in the electricity supply towards solar and wind is creating new stability and balancing challenges for the electricity grid. A solution to these challenges is to change the consumption of the demand-side in particular buildings. Efforts to help change the demand-side in buildings evolves around the idea of Demand-Response. However, the impact of moving, shedding or filling loads in buildings has a large impact on building occupants. In order to further the spread of DR systems, it is necessary to consider the impact of DR on comfort. In particular to assess it to ensure compliance with both soft demands for comfort, as well as harder demands such as minimum running systems and law requirements. Furthermore, the impact on comfort needs to be calculated to an order of accuracy that is high enough to ensure proper scheduling of DR events while also meeting acceptable thresholds for the effects on the …", "num_citations": "4\n", "authors": ["128"]}
{"title": "An extensible component-based multi-objective evolutionary algorithm framework\n", "abstract": " The ability to easily modify the problem definition is currently missing in Multi-Objective Evolutionary Algorithms (MOEA). Existing MOEA frameworks do not support dynamic addition and extension of the problem formulation. The existing frameworks require a re-specification of the problem definition and recompilation of source code implementing the problem specification.", "num_citations": "4\n", "authors": ["128"]}
{"title": "The national multi-island smart energy system in Philippines\n", "abstract": " Ten percent of the world's population lives on islands. The majority of the islands face challenges filling the gap between energy supply and demand, especially islands in countries consisting of many islands. The development of the national multi-island energy system is influenced by country characteristics, technology readiness, political support, etc. This paper uses the development of the Philippines' energy system as case study for analyzing the challenges, opportunities and influential factors for the development and integration of a national multi-island energy system. The paper concludes its analysis by presenting a framework for multi-island energy system design with the consideration of both single and multi-islands.", "num_citations": "4\n", "authors": ["128"]}
{"title": "The smart grid impact on the Danish DSOs' business model\n", "abstract": " The transformation progress of the smart grid challenges the market players' business models. One of those market players is the Distribution System Operators (DSOs). This paper aims to elaborate how smart grid influences the DSOs' business models with case studies of two Danish DSOs - EnergiFyn and TREFOR. The main findings indicate that the Danish smart grid transformation process influences the Danish DSOs' business models via four smart grid related factors: (1) smart meters, (2) Distributed Energy Resources (DERs), (3) Bidirectional electricity flow, and (4) R&D. Therefore, the results show that the smart grid incrementally not revolutionary influences the Danish DSOs' business models, and the smart grid transformation of the Danish electricity grid is slower than the agenda of the official Danish smart grid development strategy.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Global Smart Grid Transferability: Insights from Europe, the US, and China\n", "abstract": " The paper tries to address the question of whether the smart grid solution can be transferred internationally, and explore the transferability of the smart grid across countries with three national comparisons: USA, Europe and China. A qualitative content analysis in which data (the academic papers) are coded in preparation for comparison and interpretation is chosen to find the similarities and differences of smart grid development in different national contexts. Trough a comparative analysis of the smart grid development in USA, Europe and China, this paper conducts a transferable framework of smart grid solution with global and local features.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Mathematical modeling of the drying of extruded fish feed and its experimental demonstration\n", "abstract": " This paper present a mathematical model for the drying of extruded fish feed pellets. The model relies on conservation balances for moisture and energy. Sorption isotherms from literature are used together with diffusion and transfer coefficients obtained from dual parameter regression analysis against experimental data. The lumped capacitance method for the estimation of the heat transfer coefficient is used. The model performs well at temperatures±5 C from sorption isotherm specificity, and for different pellet sizes. There is a slight under-estimation of surface temperature of denser feed pellets with lower mass diffusivities, possibly owing to a mischievously low conductivity used for these pellets.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Dynamic Software Updating with Gosh! Current Status and the Road Ahead\n", "abstract": " Any non-trivial software system has to be upgraded regularly to incorporate bug fixes and security patches or simply to keep up with the inevitable evolution in end-user requirements. Software upgrading is challenging, especially when it comes to online upgrading of running systems. In this paper, we present the", "num_citations": "4\n", "authors": ["128"]}
{"title": "Modularization of Legacy Features by Relocation and Reconceptualization: How Much is Enough?\n", "abstract": " As programs become larger and start evolving, they often need to be split into modules, in order to facilitate independent evolution of end-user features and consolidate reusable core abstractions. Achieving this for legacy object-oriented software is, however, problematic due to scattering and tangling of feature implementations. While relocation of classes among packages can be used to significantly reduce these phenomena, achieving complete separation of features requires reconceptualization of existing classes. In this paper, we investigate the tradeoffs between relocation and reconceptualization of classes during a migration of the NDV is neuroscience application to the Net Beans Module System. We do this by comparing the manually modularized version of NDV is with three automatically optimized designs that exhibit various degrees of relocation and reconceptualization. The obtained findings shed new …", "num_citations": "4\n", "authors": ["128"]}
{"title": "Application of multi-agent systems in offshore oil and gas production\n", "abstract": " Continuous evolution of produ ction contro l sch emes for rapidly maturing offsh ore oil and g as fields is in gen eral a challenging task. Especially the development of control system software that can accommodate the required changes to the con trol log ic is cha llenging, as the logic of indivi dual con trol obje ctives a re t ypically scat tered across m ultiple software components. Hence, modification of the implementation of a cont rol objective r equires full inspection of the control s ystem’s software components to ensur e th at the change does no t co nflict with the logics of o ther control objectives. The result is relatively fixed control schemes, as changes to the control system are very expensive and timeconsuming to perform. This scattering of control objectiv es is especially a pr oblem when introducing new control objectives or changing the existing production configurations in way s, which could not be foreseen in the in itial design phase. In this p aper, we presen ta nov el application of m ulti-agent s ystems to faci litate int elligent stra tified multiobjective control for maturing oil and gas fields. Our approach provides im proved opennes s allowing inclusion, replacement and upgrades ofb oth con trol ob jectives and equipmen t, as d ynamic properties of the installation an d reservoirs are d escribed by software ag ents, and interactions between agents implementing the logics of ind ependent objectives are automatically handled by a negotiation mechanism. Using our approach, we d emonstrate that a multiagent-based control system can have better performance than an operator-based control s ystem. The demonstration is based on real …", "num_citations": "4\n", "authors": ["128"]}
{"title": "Understanding Legacy Features with Featureous\n", "abstract": " Feature-centric comprehension of source code is essential during software evolution. However, such comprehension is oftentimes difficult to achieve due the lack of correspondence between functional features and structural units of object-oriented programs. We present a tool for feature-centric analysis of legacy Java programs called Feature us that addresses this issue. Feature us allows a programmer to easily establish feature-code trace ability links and to analyze their characteristics using a number of visualizations. Feature us is an extension to the Net Beans IDE, and can itself be extended by third-party plugins.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Multi-agents in the North Sea-The case of oil and gas production\n", "abstract": " Developing control systems for offshore oil and gas production is a challenging task, due to the complex inherent issues of the domain, ie changing properties of the oil and gas reservoirs, and variations in production configuration, due to new wells and production technologies. In this paper, we propose a multi-agent system with a stratified architecture that provides the necessary flexibility to meet the complexity of the domain. Finally, we discuss how the stratified architecture can be evaluated using simulation of a real production-like setup.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Experiences initiating software product line engineering in small teams with pulse\n", "abstract": " Small teams of software engineers are represented both in small companies and semi-independent fractions in medium and large companies. Even though some results and experience papers have been published in the context of Small-and Medium-Sized Enterprises (SMEs), there is a lack of experience papers and collective results on Software Product Line Engineering (SPLE) in the context of small teams.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Language support for incremental integration of independently developed components in java\n", "abstract": " The aim of component-based software development is to assembly applications from existing components, writing as little extra code as possible. For programmers, assembly of applications from existing components should increase reuse, thus allowing them to concentrate on value-added tasks and to produce high-quality software within a shorter time. For users, component-based software development promises tailor made functionality from the adaptaion of ready-made components. However, this ideal scenario has not yet become reality: today, many applications are still developed from scratch, and there are still relatively few ready-made components that can be easily reused in new applications. Why is it so? We believe that part of the answer is that current object-oriented programming languages are missing support for non-invasive dynamic adaptation that works at the level of multiple objects …", "num_citations": "4\n", "authors": ["128"]}
{"title": "The sandwich code file structure: An architectural support for software engineering in simulation based development of embedded control applications.\n", "abstract": " This paper reports on our experiences with applying reengineering to a subset of the present simulation library of control algorithms at Danfoss Drives. A code architecture called the sandwich code file structure has been developed. The purpose is to keep the control algorithm source code (the middle of the sandwich) stable to variation. By the use of subject orientation principles some architectural variation points were confined to the upper part, whereas other variation points were moved to the lower part by use of wrapper techniques. One of the main contributions, compared to the old architecture, is a clear division of responsibility between the involved developers.", "num_citations": "4\n", "authors": ["128"]}
{"title": "Technical, Economic, Social and Regulatory Feasibility Evaluation of Dynamic Distribution Tariff Designs\n", "abstract": " The increasing number of distributed energy resources in the distribution grids creates the risk of grid congestion and the high cost of grid expansion. The implementation of the dynamic distribution grid tariffs can potentially avoid grid congestion. Meanwhile, the design and implementation of any distribution tariff need to consider and match the regional/national requirements. However, there is no sufficient evaluation method available to review and evaluate the feasibility of the dynamic distribution tariffs. Therefore, this paper introduces a feasibility evaluation method with four dimensions of technical, economic, social, and regulatory to review dynamic distribution tariffs. The literature on dynamic distribution tariffs is collected, and 29 dynamic distribution tariffs are selected and further categorized into five attributes of rationale, cost drivers, dynamics, events, and active demand. The evaluation results show that the time-of-use tariff is the most feasible dynamic distribution tariff, and the review of a proposed future distribution tariff model in Denmark verifies the evaluation method and results. The developed feasibility evaluation method for dynamic distribution tariffs can ensure the design and implementation of a dynamic distribution tariff to be feasible and applicable in a region. View Full-Text", "num_citations": "3\n", "authors": ["128"]}
{"title": "Suitability assessment of electricity market mechanisms for electric vehicle grid integration\n", "abstract": " This paper proposes a set of criteria to assess the suitability of different market-oriented solutions for distribution grid congestion alleviation. The case of electric vehicles uptake is analyzed due to the particularly high predicted strain from transport electrification on existing network infrastructure. Solutions are assessed on the basis of plausibility and accuracy, while taking into account the physical, communication, information and business layers of the electricity network ecosystem, with Denmark taken as case study. The paper concludes with a call for more integrated modeling approaches, which consider the interactions of proposed solutions with other components of the electricity market. Particular emphasis is put on the importance of placing the market adequately upstream of real-time electricity delivery time, to reach a balance between low uncertainties and ease of market integration.", "num_citations": "3\n", "authors": ["128"]}
{"title": "Impact of Social Welfare Metrics on Energy Allocation in Multi-Objective Optimization\n", "abstract": " Resource allocation problems are at the core of the smart grid where energy supply and demand must match. Multi-objective optimization can be applied in such cases to find the optimal allocation of energy resources among consumers considering energy domain factors such as variable and intermittent production, market prices, or demand response events. In this regard, this paper considers consumer energy demand and system-wide energy constraints to be individual objectives and optimization variables to be the allocation of energy over time to each of the consumers. This paper considers a case in which multi-objective optimization is used to generate Pareto sets of solutions containing possible allocations for multiple energy intensive consumers constituted by commercial greenhouse growers. We consider the problem of selecting a final solution from these Pareto sets, one of maximizing the social welfare between objectives. Social welfare is a set of metrics often applied to multi-agent systems to evaluate the overall system performance. We introduce and apply social welfare ordering using different social welfare metrics to select solutions from these sets to investigate the impact of the type of social welfare metric on the optimization outcome. The results of our experiments indicate how different social welfare metrics affect the optimization outcome and how that translates to general resource allocation strategies. View Full-Text", "num_citations": "3\n", "authors": ["128"]}
{"title": "Impact of Social Welfare Methods on Multi-objective Resource Allocation in Energy Systems.\n", "abstract": " Multi-agent resource allocation refers to the distribution of resources among agents. Resource allocation can be particularly challenging if the agents have conflicting objectives over multiple interdependent issues. In such cases, multi-objective optimization methods can be used to find an optimal allocation of resources, that maximizes social welfare. Social welfare refers to the welfare of the entire society of agents and therefore considered as a suitable metric for assessing the overall system performance in multi-agent resource allocation. In this paper we study and discuss different notions of social welfare and investigate their impact on the optimization outcome specifically for the problems comprising multiple conflicting objectives with interdependent issues. To this end, we implement and apply different notions of social welfare to a real-world, complex problem, where a resource domain is responsible for making allocation of energy resources to multiple energy intensive consumers (Commercial Greenhouse Growers). The problem is modeled as a multi-objective optimization context. Our results show how different social welfare methods affect the optimization outcome and result in different socially optimal resource allocations, depending on the behavior we expect from the system.", "num_citations": "3\n", "authors": ["128"]}
{"title": "Multi-objective model predictive control framework for buildings\n", "abstract": " The aim of this paper is to present the implementation and performance of an MPC framework based on a multi-objective genetic algorithm. The framework optimizes building control by firstly identifying the Pareto frontier with respect to multiple objectives considered, and then selecting the final strategy based on the user-defined priorities for the respective objectives. Although the approach requires more computing resources than the more traditional constrained convex optimization, it is more flexible in terms of the optimization problem formulation. New objectives can be easily added, and the objective priorities altered during the operation of the system. This flexibility makes the framework attractive for global optimization of multiple systems, including systems based on on/off control. The framework is compatible with the Functional Mock-Up Interface and uses models exported to Functional Mock-Up Units. The framework performance is tested in a virtual experimental testbed using a building modeled in EnergyPlus.", "num_citations": "3\n", "authors": ["128"]}
{"title": "Experimental investigation of physical properties and mechanical durability of extruded fish feed in the drying process\n", "abstract": " Mechanical durability and structural properties of extruded fish feed subjected to convective hot air drying are evaluated experimentally using a custom-built batch dryer. A double replicated 4x2 full factorial design is carried out with variable drying parameters; air temperature and air velocity. Obtained structural properties are assessed from textural analyses, and mechanical durability is assessed from a special pellet durability tester,‘DORIS’, which is widely used in the fish feed industry. The effects of temperature and velocity are evaluated using two-way ANOVA, to provide a possible explanation to the influence of the drying parameters on mechanical durability. High temperature give high durability, high cohesiveness, high elasticity, high shrinkage and high pellet hardness. High air velocity was also found to significantly reduce the elasticity of the pellets; low elasticity has previously been shown to improve the durability of extruded fish feed.", "num_citations": "3\n", "authors": ["128"]}
{"title": "An agent based approach for coordination of energy allocation and demand in cyber-physical systems\n", "abstract": " Energy efficient systems are receiving worldwide attention in response to the negative effects of global warming. Energy efficient systems are concerned with allocation of adequate resources in the Energy Domain to meet the energy demand in possibly several Process Domains. In allocation, a balancing problem arises when the energy resources demanded by the Process Domains do not match the resources allocated in the Energy Domain. This situation may lead to suboptimal process performance and inefficient usage of energy. Solving this allocation problem requires a coordination and control mechanism that can balance allocation and demand between multiple coupled subsystems. In this paper, we propose a novel agent-based software system for solving this type of cooperative control problem. The system performs energy allocation for several Process Domains while considering the individual requirements of each domain. In case of resource inadequacy the proposed solution is able to handle the resulting conflicts according to domain specific requirements for system operation. The efficacy of the proposed approach is demonstrated through simulation. Our results show that it is possible to create a coordination mechanism that can achieve a global stable state for energy allocation and demand between multiple coupled systems.", "num_citations": "3\n", "authors": ["128"]}
{"title": "A numerical model of the deep-bed drying of extruded fish feed and its experimental validation\n", "abstract": " A deep bed drying model for the description of moisture and temperature on an individual pellet level has been developed. Experimental validation is carried out in a special designed lab batch dryer, based on recordings of average moisture content and pellet surface temperature, on the air exhaust side. The model comprise empirical recording of moisture desorption isotherms and semi-empirical relations for moisture diffusivity and heat and mass transfer coefficients, in particular including the effect of air temperature on moisture diffusivity.", "num_citations": "3\n", "authors": ["128"]}
{"title": "Evolution of Feature-Oriented Software: how to stay on course and avoid the Cliffs of modularity drift\n", "abstract": " With time software systems easily become obsolete if not updated to reflect the ever-changing needs of their users. This update process is far from trivial as each feature is not necessarily captured by a single module, but rather scattered across a number of different modules. The situation is further aggravated by the fact that a module can encompass a number of different features. Our goal is to measure and evaluate how easy it is to trace back and update a given piece of software based on its modularity. Modularity is known as the degree to which a system’s components may be separated and recombined. The approach that we propose is based on the idea of using relative, as opposed to absolute, modularity metrics that measure the distance between the actual metric values for a given source code and their values achievable for the source code’s ideally modularized counterpart. The approach, termed …", "num_citations": "3\n", "authors": ["128"]}
{"title": "State of the art of dynamic software updating in Java\n", "abstract": " The dynamic software updating system JRebel from Zeroturnaround has proven to be an efficient mean to improve developer productivity, as it allows developers to change the code of their applications while developing and testing them. Hence, developers no longer have to go through the tedious cycle of serializing application state, halting execution, redeploy the binary, restarting, and de-serializing state before they can test the effect of a code change. However, the current version of JRebel has its limits, as it does not support all kinds of code changes. In this paper, we compare the three most comprehensive dynamic updating systems developed for Java to date. Together, these systems provide comprehensive support for changing class definitions of live objects, including adding, removing and moving fields, methods, classes and interfaces anywhere in the inheritance hierarchy. We then investigate …", "num_citations": "3\n", "authors": ["128"]}
{"title": "The smart grid research network: Road map for Smart Grid research, development and demonstration up to 2020\n", "abstract": " This road map is a result of part-recommendation no. 25 in ‘MAIN REPORT–The Smart Grid Network’s recommendations’, written by the Smart Grid Network for the Danish Ministry of Climate, Energy and Building in October 2011. This part-recommendation states:", "num_citations": "3\n", "authors": ["128"]}
{"title": "Satisficing-based Approach to Resolve Feature Interactions in Control Systems\n", "abstract": " To handle the complexity of modern control systems there is an urgent need to develop features as independently developed units of extension. However, when independently developed features are later composed they become coupled through the shared environment resources. As a consequence, the system requirements may no longer be entailed when independent features try to control the same shared environment. Malfunctioning behavior as a consequence of feature interference is know in the literature as the feature interaction problem. This paper present an approach that uses designtime specification of independent requirements, in combination with a runtime arbitrator that search for feature interaction free programs which entail the system requirements. In case of conflicting requirements that can’t be satisfied simultaneously, the mechanism supports explanation of the interactions as a context …", "num_citations": "3\n", "authors": ["128"]}
{"title": "Featureous: an integrated environment for feature-centric analysis and modification of object-oriented software\n", "abstract": " The decentralized nature of collaborations between objects in object-oriented software makes it difficult to understand the implementations of user-observable program features and their respective interdependencies. As feature-centric program understanding and modification are essential during software maintenance and evolution, this situation needs to change. In this paper, we present Featureous, an integrated development environment built on top of the NetBeans IDE that facilitates feature-centric analysis of object-oriented software. Our integrated development environment encompasses a lightweight feature location mechanism, a number of reusable analytical views, and necessary APIs for supporting future extensions. The base of the integrated development environment is a conceptual framework comprising of three complementary dimensions of comprehension: perspective, abstraction and granularity. Together, these dimensions allow the analyst to focus the analysis at the right mode of comprehension during software evolution. We demonstrate applicability of our integrated development environment by conducting a case study of change adoption using the JHotDraw SVG.", "num_citations": "3\n", "authors": ["128"]}
{"title": "Coping with variability in product-line architectures using component technology\n", "abstract": " Since any successful software product is continuously evolving in order to fulfill market requirements, it needs an architectural basis that can sustain the necessary variability to meet changing requirements. In this paper we presents a component-oriented approach for developing product-line architectures that can accommodate variability through separation of architectural, functional and non-functional concerns. The approach is based on our experiences from developing a product-line architecture for building experimental robot controllers that can control arbitrary robotic manipulators.", "num_citations": "3\n", "authors": ["128"]}
{"title": "Component architecture for dynamic reconfiguration of object request brokers\n", "abstract": " Problem Statement Support for run-time reconfiguration of component-based systems is a necessity for achieving flexible component-based Object Request Brokers that incorporate support for various non-functional requirements on a per application use-case basis. However, current component architectures do not meet the requirements of run-time reconfiguration of component-based systems. In fact, current dynamic reconfiguration practices in component-oriented programming often result in ad-hoc solutions.", "num_citations": "3\n", "authors": ["128"]}
{"title": "Dynamic scheduling of object invocations in distributed object oriented real-time systems\n", "abstract": " This paper describes some of the issues that we investigate in order to develop distributed object computing middleware for application domains where timely cooperation and coordination between objects are crucial for guaranteeing correct system behavior. In particular, issues on admission control, resource reservation, and dynamic scheduling of invocations are discussed.", "num_citations": "3\n", "authors": ["128"]}
{"title": "A Systematic Literature Review of Machine Learning Methods for Short-term Electricity Forecasting\n", "abstract": " Research in energy prediction is widely explored as it is used in long term planning like development investment and resource planning to estimating tariffs and analyzing and scheduling of distribution network. One of the methods applied in performing the forecasting is machine learning. There are many machine learning algorithms, dataset features, and evaluation metrics used. This paper offers to review articles on energy prediction published from 2016 until 2019. The review is made based on Systematic Literature Review method. A total of 119 articles were gathered from various sources such as IEEE, Science Direct and ResearchGate. The search made based on keywords such as machine learning, electricity, energy demand, forecast, and prediction. Based on the articles gathered, 31 articles were selected based on thorough examination on the title and abstracts. Six full materials are chosen for the final …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Methodology for a Large Scale Building Internet of Things Retrofit\n", "abstract": " With the presence of sensing technologies today, buildings can be built fitted with various sensors and systems to encourage energy efficiency and sustainability. However, legacy buildings are not originally built to support internet-of-things (IoT) technology or to promote sustainability. Thus, legacy buildings that are still being actively used today require retrofitting works to improve the efficiency of the buildings. Retrofitting the legacy buildings with IoT capabilities can be very challenging due to the active use of the buildings, dynamic building functions, undocumented indoor modifications and vulnerable physical structure, among others. Therefore, a comprehensive methodology is needed for systematic deployment of the sensors and associated systems into the building, covering a complete cycle from identifying the needs and requirements of the system until its full operation. This study aims to devise and …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Digital Twin Framework for Energy Efficient Greenhouse Industry 4.0\n", "abstract": " This paper introduces the ongoing research conducted on enabling industrial greenhouse growers to optimize production using multi-agent systems and digital twin technology. The project seeks to develop a production process framework for greenhouses, based on several case studies, that can be applied to different greenhouse facilities to enable a broad implementation in the industrial horticulture sector. The research will incorporate AI technology to support the production process agent in forecasting and learning optimal operating conditions within set parameters that will be feedback to the grower through a common information model. Furthermore, the production agent will communicate with other process agents to co-optimize the essential aspects of production. In turn, this allows the growers to optimize the production cost with minimal risk to product quality while aiding in upholding grid stability. The …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Principles of Energy Flexible Buildings: Energy in Buildings and Communities Programme Annex 67 Energy Flexible Buildings\n", "abstract": " Energy flexibility of a building is really not a new concept. It originates from the demand side management regime, which for decades has been applied by the designers and operators to foster stable and bottleneck-free operation of the electrical energy systems. However, as the transition of both the demand and supply side of the energy system imposes new challenges to the management of the whole energy system, such as the variability and limited control of energy supply from renewables or the increasing load variations over the day, the energy Flexible Building concept has gained more international attention. However, despite the given attention, a uniform understanding and a commonly accepted definition is still not in place for this building concept. The lack of a clear international framework for the requirements and properties of energy Flexible Buildings leads to numerous definitions that are being developed in parallel and are applied to specific cases when evaluating and/or quantifying energy flexibility. Although the concept of energy flexibility of buildings is relatively simple to understand, its application in reality can be complex and difficult to explain in simple terms. This complexity is not helped by the myriad of ways in which energy flexibility can be achieved or the wide range of stakeholders involved; especially when many stakeholders have very little understanding, or interest, in the supply and demand of energy in buildings.", "num_citations": "2\n", "authors": ["128"]}
{"title": "International Energy Agency-Principles of Energy Flexible Buildings: Energy in Buildings and Communities Programme Annex 67 Energy Flexible Buildings\n", "abstract": " International Energy Agency - Principles of Energy Flexible Buildings: Energy in Buildings and Communities Programme Annex 67 Energy Flexible Buildings — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation International Energy Agency - Principles of Energy Flexible Buildings: Energy in Buildings and Communities Programme Annex 67 Energy Flexible Buildings Anna Marszal-Pomianowska, Hicham Johra, Armin Knotzer, Jaume Salom, Thibault Péan, Søren Østergaard Jensen, Erwin Mlecnik, Hussain Kazmi, Roberta Pernet, Konstantin Klein, Lilli Frison, Péter Engelmann, James Parker, Laura Aelenei, Rui Amaral Lopes, Daniel Aelenei, Rune Grønborg , , , 4 , …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Distributed energy resource adoption for campus microgrid\n", "abstract": " Security of energy supply and energy efficiency are challenges for many university campuses. Campus microgrid with distributed energy resources is considered as a solution for solving these challenges. However, the microgrid adoption for university campuses has to consider various factors due to the cost of DER installation and operation, campus activities and energy regulation etc. This paper investigates the possibility and feasibility of microgrid adoption for a university in Denmark, by analyzing the electricity and heat consumption patterns, the capacity of existing installed DERs, and the benefits and barriers for future installation of possible DER technologies. Based on this analysis the paper proposes three energy scenarios with different potential DER solutions, and provides simulations for investigating the energy balance and economic feasibility of each scenario.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Location-based energy efficiency and flexibility strategies for smart campuses\n", "abstract": " This paper proposes an approach to investigate building typologies on a selected campus to propose a locationbased energy efficiency and flexibility strategy for campuses to provide energy flexibility without compromising educational activities. To do so, this paper selects four different typologies and conduct an analysis on energy consumption patterns based on energy data provided by submeters located throughout the campus. Quantitative and qualitative methods in form of interviews and surveys were used to understand the consumption patterns in each selected type of buildings. Furthermore, the potential flexibilities have been evaluated based on the interview results and electricity market data. This paper defines the buildings intelligence level based on the EU standards EN15232. The proposed strategy is based on both the intelligence level and the importance level of different building typology. The results show that laboratories have the highest importance level with no flexibility at all. All other building typologies have flexibility in some amount where the canteen is found to have the most possibility for energy savings. This paper also finds that the chosen classrooms in a newly built building have the highest intelligence level, the classrooms in older buildings have the lowest intelligent level, and the rest of the building typologies have the same level of intelligence and have potentials improving the energy efficiency.", "num_citations": "2\n", "authors": ["128"]}
{"title": "A cross-national comparative study of the political and regulatory impact on the adoption of demand response in Denmark and Austria\n", "abstract": " The energy sector is undergoing a green transition which entails the challenge of balancing electricity demand and supply. A way to deal with this problem is to make the electricity demand flexible by introducing demand response, which leads to new business opportunities and stakeholders in the market. Furthermore, the business opportunities for demand response and new stakeholders, like the so called aggregators (a service company that pools flexibility from customers and converts it into electricity market services), are strongly influenced by national and international policies and regulation. Therefore, this paper aims to investigate the business opportunities of aggregators and how aggregators, in the smart energy business ecosystem, are influenced by the changes in policy and regulation.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Adverse condition and critical event prediction in commercial buildings: Danish case study\n", "abstract": " Over the last two decades, there has been a growing realization that the actual energy performances of many buildings fail to meet the original intent of building design. Faults in systems and equipment, incorrectly configured control systems and inappropriate operating procedures increase the energy consumption about 20% and therefore compromise the building energy performance. To improve the energy performance of buildings and to prevent occupant discomfort, adverse condition and critical event prediction plays an important role. The Adverse Condition and Critical Event Prediction Toolbox (ACCEPT) is a generic framework to compare and contrast methods that enable prediction of an adverse event, with low false alarm and missed detection rates. In this paper, ACCEPT is used for fault detection and prediction in a real building at the University of Southern Denmark. To make fault detection and prediction possible, machine learning methods such as Kernel Density Estimation (KDE), and Principal Component Analysis (PCA) are used. A new PCA–based method is developed for artificial fault generation. While the proposed method finds applications in different areas, it has been used primarily for analysis purposes in this work. The results are evaluated, discussed and compared with results from Canonical Variate Analysis (CVA) with KDE. The results show that ACCEPT is more powerful than CVA with KDE which is known to be one of the best multivariate data-driven techniques in particular, under dynamically changing operational conditions.", "num_citations": "2\n", "authors": ["128"]}
{"title": "A Holistic Fuzzy Measure for Load Priority in Under Frequency Load Shedding Schemes\n", "abstract": " Electrical Power Systems should be designed in order to minimize the effects of system disturbances and to enable decision-making based on different configurations and relevant priority analysis. Automatic Under Frequency Load Shedding is a known effective solution to the problem of contingencies in the electrical power grid and it is the last resource to mitigate the damage caused by severe and unexpected contingencies. However, to the best of our knowledge, the load priority configuration, which have been presented so far in load shedding process do not take into account some important aspects, such as social, economic or political importance of the connected loads, as well as how negative is the impact on the public image of power utilities when disconnecting specific load branches. This paper aims to provide a general priority holistic function which can be applied to different load shedding schemes …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Deep Energy Retrofit vs Improving Building Intelligence: Danish Case Study\n", "abstract": " This study provides a preliminary assessment of the trade-off between deep energy retrofit and improving the building intelligence within an energy renovation process. A standard Danish office building from the 1980’s is considered as a case study. A detailed energy model was developed in EnergyPlus to simulate the dynamic performance of the case study building. Various deep energy retrofit measures were implemented and assessed. In addition, different measures to improve the energy efficiency and intelligence of the building were investigated and simulated with emphasis on European Standard EN 15232 recommendations for control and management of heating, ventilation and lighting systems.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Technical and Economic Assessment of a Danish Public School Energy Renovation using Dynamic Energy Performance Model\n", "abstract": " This study targets the public schools sector in Denmark, considering a case study of an 11,900 m2 School in Odense, and reporting the overall process of energy modeling, performance simulation and assessment of renovation measures. A holistic model was developed and calibrated using measured energy data. Various energy renovation measures and packages were investigated employing a holistic approach and considering the technical, economic and environmental impacts. A deep energy renovation package was recommended lifting the school energy rating to comply with the BR15 Danish building regulations, reducing energy consumption by 54.2% with an annual primary energy consumption of 65.5 kWh/m2.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Dynamic Model-Driven Energy Retrofit of Bøgevangen and Runevej Daycare Centers in Aarhus\n", "abstract": " With the huge ambition to achieve a fossil fuel-free energy sector by 2050, the Danish government has targeted the building stock as a priority, offering large potential for feasible and cost-effective energy savings. Around 75% of the existing buildings in Denmark were constructed before 1979 and therefore a special focus has been directed in the recent years towards buildings’ energy renovation especially non-residential and public buildings. A comprehensive strategy for energy renovation of the existing Danish building stock was established with multiple initiatives to enhance cost-effective and energy-efficient renovation of buildings. In this context, Aarhus Municipality is investing 450 million DKK for public buildings energy renovation covering an area of about 1 million m2 and aiming to cut CO2 emissions by 40%. Thus, two daycare centers, Bøgevangen 101 and Runevej 107-109, have been selected as case …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Energy flexibility in the power system: challenges and opportunites in Philippines\n", "abstract": " Energy flexibility can address the challenges of large scale integration of renewable energy resources and thereby increasing imbalance in the power system. Flexible power system can provide reliable supply, low electricity cost and sustainability. Various situations and factors influence the adoption of the flexibility solutions, such as flexible electricity generation, demand-response, and electricity storage. This paper tries to analyze the current energy flexibility solutions and the factors that can influence the energy flexibility adoption. This paper takes Philippines as case study to provide an overview of the current condition of the Philippines’ power system and discuss the energy flexibility in the Philippines’ power system. A further discussion and recommendation is conducted in the end of the paper.", "num_citations": "2\n", "authors": ["128"]}
{"title": "DynaGrow: next generation software for multi-objective and energy cost-efficient control of supplemental light in greenhouses\n", "abstract": " It is not possible for growers to compromise product quality by saving energy but the increasing electricity prices challenge the growers economically. Optimization of such multiple conflicting goals requires advanced strategies that are currently not supported in existing greenhouse climate control systems. DynaGrow is built on top of the existing climate control computers and utilizes the existing hardware. By integrating with exiting hardware it is possibly to support advanced multi-objective optimization of climate parameters without investing in new hardware. Furthermore, DynaGrow integrates with local climate data, electricity price forecasts and outdoor weather forecasts, in order to formulate advanced control objectives. In September 2014 and February 2015 two greenhouse experiments were run to evaluate the effects of DynaGrow. By applying multi-objective optimization, it was possible to produce a number …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Ecosystem Based Business Model of Smart Grid\n", "abstract": " This paper investigates an ecosystem based business model in a smart grid infrastructure and the potential of value capture in a highly complex macro infrastructure such as a smart grid. It proposes an alternative perspective in studying the smart grid business ecosystem to support infrastructural challenges, such as the interoperability of business components for a smart grid. So far, little research has explored the business ecosystem in the smart grid concept. A study on a smart grid with the theory of business ecosystem may open opportunities to understand market catalysts. This study contributes towards an understanding of a business ecosystem applicable for a smart grid. Smart grid infrastructure is an intricate business ecosystem, which has several intentions to deliver the value proposition and what it should be. The findings help to identify and capture value from markets.", "num_citations": "2\n", "authors": ["128"]}
{"title": "An agent-based negotiation approach for balancing multiple coupled control domains\n", "abstract": " Solving multi-objective multi-issue negotiation problems involving interdependent issues distributed among multiple control domains is inherent to most non-trivial cyber-physical systems. In these systems, the coordinated operation of interconnected subsystems performing autonomous control is essential to achieve overall system goals. In spite of its importance, the area has received limited attention to date. In this paper, we propose an innovative agent-based coordination approach for coordinating and controlling interconnected subsystems in cyber-physical systems with interdependent issues. The proposed approach can solve negotiation problems with interdependent issues across multiple coupled control domains. We demonstrate our approach by solving a coordination problem where a Combined Heat and Power Plant must allocate electricity for three commercial greenhouses to ensure the required plant …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Global Smart Grid Transmission: Comparison of Europe, the US, and China\n", "abstract": " The paper tries to address the question of whether the smart grid solution can be transited internationally, and explore the possibility of international transition with three national comparisons: USA, Europe, and China. A qualitative content analysis in which data (the academic papers) are coded in preparation for comparison and interpretation is chosen to find the similarities and differences of smart grid development in different national context. Trough a comparative analysis of smart grid development in USA, Europe and China, this paper conducts a transferable framework of smart grid solution with global and local features.", "num_citations": "2\n", "authors": ["128"]}
{"title": "A flexible control strategy for integration of DG sources into the power grid\n", "abstract": " This paper deals with a multi-objective control strategy for integration of distributed generation (DG) sources to the power grid. The proposed control technique can provide simultaneous compensation for active and reactive power, and harmonic current components of loads through integration of DG sources to the grid, which is the main contribution of this work over the other proposed methods. A dynamic model of the proposed DG model is first formulated in the stationary reference frame and then transformed into the synchronous orthogonal reference frame. The transformed variables are used in control of voltage source converter (VSC) as the heart of an interfacing system between DG sources and utility grid. By setting appropriate reference currents in the control loop of DG, the maximum available power of DG source will be injected to the grid with fast dynamic response, thereby achieving sinusoidal grid …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Prediction of mechanical durability of dried, extruded fish feed using structural mechanics models and experimental justification of relaxation times\n", "abstract": " Prediction of mechanical durability of dried, extruded fish feed using structural mechanics models and experimental justification of relaxation times — University of Southern Denmark Skip to main navigation Skip to search Skip to main content University of Southern Denmark Logo Help & FAQ Dansk English Home Researchers Research Units Research output Activities Projects Press / Media Prizes Teaching Impacts Datasets Search by expertise, name or affiliation Prediction of mechanical durability of dried, extruded fish feed using structural mechanics models and experimental justification of relaxation times Anders Fjeldbo Haubjerg, Benny Simonsen, Sti Løvgreen, Bo Nørregaard Jørgensen, Christian Veje Department of Technology and Innovation Research output: Contribution to conference without publisher/journal › Poster › Research › peer-review Overview Original language Danish Publication date 25. Aug - …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Smart Grid in China—The Key Stakeholders, Policies, Regulations and Challenges\n", "abstract": " China is planning to transform its traditional power grid in favour of a smart grid, since it allows a more economically efficient and a more environmentally friendly transmission and distribution of electricity. Thus, a nationwide smart grid is likely to save tremendous amounts of resources and costs. This paper elaborates on the key stakeholders, crucial polices and general challenges in the context of the Chinese smart grid development. The paper finds that the Chinese energy market is a state monopoly and foreign companies can only become key stakeholders in the role of suppliers or service providers. It can be concluded that the Chinese smart grid development has still to overcome technological and political issues, such as overlapping authority structures, not installed or immature key technologies, the absence of standards and governmental market protectionism.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Ensuring technical product quality in energy efficient hot air drying of extruded fish feed: Definition of an industrial research project\n", "abstract": " Low technical product quality of fish feed reduces uptake ratios in marine fish farming and pollutes marine environment. No formalized work exists on quantification of technical quality of extruded feed, or on the coupling to the drying process. This project aims to establish a relation between the governing parameters in the drying process of extruded fish feed pellets and the final technical product quality. The aim is to be able to control the technical quality of produced fish feed pellets without compromising energy efficiency. The project can be split up into four elements which will be approached in parallel;(i) development of a quantitative method for characterization of technical quality,(ii) experimental analysis of influential parameters on technical quality,(iii) development of a mathematical model of the drying process and (iv) expansion of this model to include the relation between drying process parameters, energy efficiency, and product quality measures.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Applying multi-agent systems to multi-objective simulation and control for offshore oil and gas production\n", "abstract": " Production optimization for offshore oil and gas production is in general a challenging task due to the many and potentially conflicting control objectives that arise from the intrinsic complexity of the domain with its multi-level feedback loops. Therefore the development of control system software that can accommodate the required changes to the control logic as oil fields mature is equally challenging. In this paper, we present a novel, extensible stratified multi-agent system that facilitates multi-objective control across multiple decision layers at oil and gas production platforms. Using a case study, we demonstrate that the stratified multi-agent system can perform better than the control of today and support fields with very complex configurations.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Towards Next Generation of Smart Fields Using Intelligent Online Multi-Objective Control\n", "abstract": " Production optimization for offshore oil and gas production is in general a challenging task, even at fields operated\" Smart\" with continues 24/7 optimization, due to the intrinsic complexity of the domain. In this paper, we present an intelligent multi-objective-control-software approach for the next generation of Smart Fields.", "num_citations": "2\n", "authors": ["128"]}
{"title": "An evaluation of the NetBeans Module System as a Product Line Implementation Technology\n", "abstract": " Variability is one of the key concepts of software reuse in software product line engineering (SPLE). Rich client platforms (RCPs) have been designed to facilitate development of modern client applications. They facilitate this with concepts, structures and pre-made functionality which support the development and conceptualization of flexible and modular applications. These characteristics make them interesting in the context of SPLE. Despite the fact that modularity, extensibility and flexibility are characteristics, which in general are even more important to software product lines (SPLs) than to standalone applications, these platforms and their facilities have not been investigated scientifically from a SPLE perspective. This paper remedies the situation by providing an evaluation and a discussion of the module system provided by NetBeans Platform (a RCP). The paper contributes to the catalog of SPL implementation technologies, it introduces SPLE practitioners and theoreticians to RCP technologies, and sheds light on some of the concepts, which can help to make a more informed decision when it comes to choosing implementation technology for development of SPLs.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Enhancing NetBeans with Transparent Fault Tolerance Using Meta-Level Architecture.\n", "abstract": " In component-based systems, fault-tolerance concerns are typically handled by manually programmed fault containers. The purpose of fault containers is to prevent error propagation across component boundaries by means of redundant service providers. However, manually programmed fault containers are often subject to evolutionary pressure when components change. In this paper we present a meta-level architecture that eliminates the need for manually programmed fault containers. The meta-level achieves fault tolerance using dynamic fault containers, thereby reducing evolutionary pressure. We present an implementation and evaluation of our approach in context of the NetBeans Rich Client Platform.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Superimposed Delegation.\n", "abstract": " Object composition a well-known programming technique for supporting dynamic adaptation in statically typed class-based object-oriented programming languages suffers from two non-trivial problems; the common-self problem and the object reference update problem. Recently, it has been shown that the common-self problem can be solved for object composition in statically typed class-based languages by introducing delegation, ie, object-based inheritance as known from class-free prototype-based languages. With delegation the commonself problem disappears, but the object reference update problem remains. In this paper we propose superimposed delegation, a novel form of delegation, which simultaneously solves both problems. The paper presents superimposed delegation by a systematic but informal discussion of its similarities and differences with delegation.", "num_citations": "2\n", "authors": ["128"]}
{"title": "Customization of on-line services with simultaneous client-specific views\n", "abstract": " With the Internet success, a new trend has come up: online distributed services. Business companies (acting as client systems of these services) that are able to integrate such services effectively within their internal workflow will become leaders in their business markets. This however introduces the situation where multiple independent client systems are simultaneously accessing the same on-line service instance. This introduces a new research challenge concerning client-specific customization of an on-line service: different client systems may have different–possibly conflicting-customization needs with respect to the functional and non-functional features of the on-line service. The problem with this is that all the different clientspecific views must be simultaneously imposed on the same distributed service instance; thus after the distributed service has become operational. We propose a dynamic customization model, Lasagne, that supports such client-specific combination of features at the instance level. In Lasagne a distributed service is structured as consisting of a minimal functional core–implemented as a component-based system, and an unbound set of potential extensions that can be selectively integrated within this core functionality. An extension to this core may be a new service, due to new requirements of end users. Another important category of extensions we consider, are non-functional services such as authentication, which typically introduce interaction refinements at the application level. Each extension is implemented as a layer of mixin-like wrappers. Wrappers are utterly useful for customizing on-line distributed services, since …", "num_citations": "2\n", "authors": ["128"]}
{"title": "Business ecosystem architecture development: a case study of Electric Vehicle home charging\n", "abstract": " Due to the complexity of business ecosystems, the architecture of business ecosystems has not been well discussed in the literature, and modeling or simulation of business ecosystems has been rarely focused. Therefore, this paper proposes a business ecosystem ontology and introduces a methodology for business ecosystem architecture design. The proposed methodology includes five stages: 1) Boundary identification of a business ecosystem; 2) Identification of actors and their roles in the business ecosystem; 3) Identification of actors’ value propositions; 4) Identification of interaction between actors; 5) Verification of business ecosystem architecture design. This paper uses the Danish electricity system as an example to introduce the methodology, and use Electric Vehicle home charging as a case study to demonstrate the application of the developed methodology. The case study demonstrates that the …", "num_citations": "1\n", "authors": ["128"]}
{"title": "A Comprehensive Review of Machine Learning in Multi-objective Optimization\n", "abstract": " In the real world, it is challenging to calculate a trade-off alternative with traditional classical methods for complex non-linear systems, which always involve multiple conflicting objectives. Such complicated systems urgently desire advanced methods to conquer the multi-objective optimization problems (MOPs). As a promising AI method, the development and application of Machine Learning (ML) attract increasingly more attention from researchers. The natures of ML methods, such as parallel computation possibility, no need for any priori assumptions, etc., ensure the effectiveness and efficiency for solving MOPs. However, as we know, there is no literature related to the comprehensive review of ML in multi-objective optimization domain until now. This literature review aims to provide researchers a global view of mainstream ML methods for MOO in a general domain and a reference for applying ML methods to …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Energy Management Systems and Strategies in Buildings Sector: A Scoping Review\n", "abstract": " Energy management systems in buildings (EMSs-in-Bs) play key roles in energy saving and management to which an efficient energy management system in buildings (EMS-in-Bs) design contributes. Different scope-based designs of EMS-in-Bs are reviewed. The objective is to highlight different scope-based designs of EMS-in-Bs in which scopes of reviewed papers aim to implement a function of, for example“, monitor energy performance”“, estimate energy-use”, or “control energy-use”. This paper aims to constitute a comprehensive conception of how efficient such an EMS-in-Bs to perform more than one scope (i.e., function). Meaning, is the proposed EMS-in-Bs able to perform several sequential functions? This paper’s contribution is to give a function-focused EMS’s review utilizing the scope of reviewed papers. That is, reviewed papers are classified based on the scope/function the selected EMS-in-Bs is …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Smart buildings and urban spaces\n", "abstract": " The understanding of the smart buildings in urban spaces covers various aspects of the smart buildings in relation to the urban spaces. This chapter introduces four aspects that are strongly interconnected: the software and hardware of the smart building systems, building types in the urban spaces, permits and standards for smart buildings, and smart building market potentials. A case study of the smart buildings in the Philippines is discussed in each section to provide an overview and understanding.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Lighting Systems Designed for Energy Savings in Buildings (LSD-ESB): A Review\n", "abstract": " Recently, lighting systems (LSs) have received much attention due to their importance in energy savings in buildings. There are different types of lighting systems designed (LSD) to save energy in buildings. Those systems have produced different energy savings rate(s) depending on the design's accuracy, parameters and factors considered during design, and the real scenario (i.e., building) for which the system is designed. All these factors play important roles in enhancing energy saving performance. Therefore, this review paper aims to compose a group of akin types of systems (ToSs) achieving a high level of “energy savings” rate when applied to a certain type of building (ToB). This paper has considered different ToS and ToBs. Due to the huge number of LSs applied to different ToBs, therefore cited papers from literature review are determined by two conditions, which are: selected papers are within the …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Transient Analysis of Electrical Circuits using Block Backward Differentiation Formula\n", "abstract": " Transient is the time-varying currents and voltages resulting from the sudden change in supply current or voltage. This phenomenon usually occurs due to any switching, interrupting, short-circuiting as well as any rapid changes in the structure of an electrical circuit. To avoid any damage in certain components resulting from the transient, it is important to analyze the change of voltage or current across the circuit elements. This paper studies the transient analysis of a second order RLC circuit that consists of resistors (R) and two energy storage elements, which are inductor (L) and capacitor (C). Such circuit is normally represented in the form of second order ordinary differential equations (ODEs) and such problems are not easily solved analytically. Therefore, a numerical method, namely block backward differentiation formula (BBDF) is applied for solving the ODEs by taking into consideration the damping factor and …", "num_citations": "1\n", "authors": ["128"]}
{"title": "ASEAN power grid 20 years after: An overview of its progress and achievements\n", "abstract": " ASEAN Power Grid (APG) is one of the six programme areas initially identified in the first ASEAN Plan of Action for Energy Cooperation (APAEC) series, APAEC 1999-2004. It is an initiative to ensure security and sustainability of energy in the region, particularly the electricity. In each series, the APG objectives, strategies and actions are revised and updated to reflect its current state and progress. It has been twenty years since the first APAEC series and a lot of APG strategies and actions have been implemented to achieve the stated objectives. It is therefore timely to review the current state of its implementation to gain insight on its progress. In this paper, the action plans are presented and their current states of implementation are reviewed with the aim to determine their progress and achievements to date. Most of the information needed for this study was obtained from the official APAEC reports …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Ecosystem-Driven State-of-the-Art Investigation for Social Workers' Back Pain\n", "abstract": " The state-of-the-art investigation is important in new product development. It can avoid wasting time and effort on developing solutions that has already been patented or introduced in the market. However, there is lack of a systematic approach for the state-of-the-art investigation. This paper introduces an ecosystem-driven approach for the state-of-the-art investigation. With the example of social workers' back pain, this paper demonstrates a three-step process of the state-of-the-art investigation (Step 1- ecosystem mapping, Step 2- patent and literature review, and Step 3- gap analysis). Each step includes several activities and produces outcomes for the next step. The contribution of this ecosystem-driven approach is a state-of-the-art investigation that helps innovators to identify gaps where state-of-the-art fails to meet unmet market needs.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Dynamic Energy Model-Based Automatic Building Performance Testing for Continuous Commissioning\n", "abstract": " Relying on the fact that a building has met its energy targets at the design stage doesn’t guarantee that it is going to perform properly in the operational phase. Generally, there is a clear mismatch between the actual energy usage and the expected levels, referred to as the ‘building performance gap’. This paper presents an innovative framework for building energy performance monitoring and evaluation using a set of performance tests targeting various building energy subsystems. The framework employs a calibrated whole-building energy model to provide a dynamic baseline for assessment. The presented framework serves as a backbone for an automatic and continuous building commissioning process, supporting systematic building fault detection and diagnostics. The framework implementation in a highly energy efficient case study building is presented and discussed. A specific case of a malfunctioning ventilation unit, that was captured and reported by the implemented framework, is presented. This highlights the technical and economic added value of the framework in reducing the building performance gap and restoring a proper operation.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Stakeholders’ perspectives on Energy Flexible Buildings: Energy in Buildings and Communities Programme Annex 67 Energy Flexible Buildings\n", "abstract": " There is a wide range of different stakeholders who may be affected by energy flexibility measures: end-users (occupants of buildings), building owners, facility managers, Energy Service Companies (ESCOs), developers, architects, contractors, and product/system suppliers. The energy flexibility is ultimately useful for aggregators, DSOs (Distribution System Operators), TSOs (Transmission System Operators), and district heating suppliers. This report establishes a comprehensive understanding of acceptance, behaviour, and motivation at different levels of involvement for the relevant stakeholders.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Distributed consensus-based economic dispatch considering grid operation\n", "abstract": " In this paper, an optimal distributed approach is presented to solve the economic dispatch (ED) problem in an islanded microgrid. Active and reactive resources are taken into account in the optimization problem aiming to consider the operational requirements of the electrical system. The optimization framework is based on primal-dual constrained decomposition. Additionally, two consensus algorithms are develop to be executed in parallel by each unit, aiming to estimate locally the value of the dual variables. Convergence is guaranteed under the common convexity assumptions. Simulations were performed on the standard IEEE 30-bus system considering dispatchable and renewable generation units. The capability of the algorithm to responds in variations in load consumption, renewable generation and faults in units were assessed. Result shows the flexibility and effectiveness of the proposed approach.", "num_citations": "1\n", "authors": ["128"]}
{"title": "System and method for automatic invocation of constructor code for superclasses\n", "abstract": " A system and method for automatic invocation of object initializers, or constructors, for superclasses featuring the ability to modify the contents of classes of existing applications at runtime, which includes adding new superclasses to the class inheritance hierarchy of the existing classes. The system redefines the content of classes of the existing classes and the new superclasses during the loading of the classes to additionally include code statements that invoke constructors of the redefined classes and the new superclasses. The invocation of the constructors at runtime performs the initialization of the objects.", "num_citations": "1\n", "authors": ["128"]}
{"title": "The island smart energy system and market\n", "abstract": " Developing island smart energy systems with the integration of renewable energy resources can increase the energy supply and address the global island energy issues. The island smart energy system operates either in a single-island or in multi-islands. However the island characteristics and influential factors impact on the development of the single-island or multi-island smart energy system are different. This paper presents the influential factors of the island smart energy system development by the literature analysis. Meanwhile, taking Philippines as a case study to investigate the differences between the single-island and multi-island smart energy system, and examine the integration challenges of the multi-island smart energy system in the Philippines. The integration challenges of the national energy system with island smart energy development are discussed with suggestions.", "num_citations": "1\n", "authors": ["128"]}
{"title": "The Overview of Smart Building Market and Potentials in Philippines\n", "abstract": " Today, different countries from all over the world develop smart buildings that operates as stand-alone energyconsuming entities [1]. Countries like Korea, Japan, Singapore, Hong Kong and Dubai are among the known countries engaged to smart buildings [2]. Smart buildings are high performance, user-friendly and automated buildings that save energy and increase efficiency and security through integration of Information and communication technologies [3].The high number of population in Philippines reflects a high demand of electricity for residential, commercial, industrial buildings. In 2014, 79% of electricity consumed by buildings while at least 10% of power losses in Philippines [1]. Smart and green technologies provide efficient and energy-saving buildings. This paper discusses the features and market potential of smart buildings in Philippines.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Smart energy in the Philippines\n", "abstract": " Philippines is an archipelago situated in Southeast Asia and known as the Pearl of the orient seas for being abundant in natural resources. As time passed by, Philippines improved its economy and people learned to adapt new technologies. The standard of living in the country has changed that increased the demand for electricity.Establishing an electricity system in the Philippines is a big challenge. Geographical location of the country is one thing to consider. Philippines is prone to natural disasters such as typhoons, earthquakes and volcanic eruptions damaging the country’s economy and infrastructures. Philippines consisting 7,100 islands, 2800 of which are populated, also create huge challenge in developing the power infrastructure of the country.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Influential Factors to The Industrial Consumers’ Smart Grid Adoption\n", "abstract": " Understanding customers' needs and behaviour in the smart grid are essential as it lies at the foundation of the energy markets design. However, the empirical studies on the smart grid still mainly address the residential consumer sector. Therefore, this study tries to investigate the influential factors that impact the industrial consumers’ acceptance and continuous participation in the Smart Grid. This study summarizes and categorises the factors through a compound exploration of the empirical research. Fourteen influential factors and tendencies are identified that may influence the Smart Grid adoption by industrial consumers: Awareness of multiple context, Shared support, Safety and security, Expendability, Ease of use, Service quality, Return on investment, Adoption cost, Liberalisation and energy tariff structure, Flexibility and dynamic pricing, Community-based initiatives, customer focus, green branding, and solution integration.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Dynalight Next Generation: Smart Grid Ready Energy Efficient Lighting System for Green House Horticulture.\n", "abstract": " The project aims to develop the next generation of energy cost-efficient artificial lighting control that", "num_citations": "1\n", "authors": ["128"]}
{"title": "Energy efficiency in a mobile world\n", "abstract": " The Danish path to a sustainable energy system focuses on increasing energy efficiency and flexible consumption via smart grid technologies. Information and communication technology is fundamental for achieving these goals by enabling among others new methods and systems for data collection and decision support. This book chapter covers new data collection options exemplified in the concrete case of a living lab for smart grid technologies. Furthermore, the chapter covers the use of visualisation to design decision support for such collected data. We formulate energy management based on energy data as a visualisation problem in the nested model for information visualisation. We prototype a visualisation tool chain to produce a rich set of visualisations based on energy data from five commercial and industrial buildings. Finally, we present qualitative study results for the value of visualisations as …", "num_citations": "1\n", "authors": ["128"]}
{"title": "A Soil-Based Seasonal Thermal Energy Storage System Assisted By A PV-Driven Heat Pump Under Danish Conditions\n", "abstract": " A Soil-Based Seasonal Thermal Energy Storage System Assisted By A PV-Driven Heat Pump Under Danish Conditions — University of Southern Denmark Skip to main navigation Skip to search Skip to main content University of Southern Denmark Logo Help & FAQ Dansk English Home Researchers Research Units Research Output Activities Projects Press / Media Prizes Teaching Impacts Datasets A Soil-Based Seasonal Thermal Energy Storage System Assisted By A PV-Driven Heat Pump Under Danish Conditions Muhyiddine Jradi, Christian Veje, Bo Nørregaard Jørgensen The Maersk Mc-Kinney Moller Institute SDU Center for Energy Informatics Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Overview Original language English Title of host publication Proceeding of 28th International Conference on Efficiency, Cost, Optimization, Simulation of …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Coordinating energy allocation and process performance using an agent-based approach\n", "abstract": " Energy efficient systems are receiving worldwide attention in response to the negative effects of global warming. Energy efficient systems are concerned with allocation of adequate resources in the energy domain to meet the energy demand in the process domain. In allocation, a balancing problem arises when the energy resources demanded by the process domain are either lesser or greater than the resources allocated in the energy domain. This situation may lead to suboptimal process performance and inefficient usage of energy. Solving this allocation problem requires a coordination and control mechanism that can balance allocation and demand. In this paper, we propose a novel agent-based software system for solving cooperative control problems. The system produces a Pareto-optimal energy allocation for the process domain while striving to achieve a group objective for balancing the individual requirements of the coupled domains. The efficacy of the proposed approach is demonstrated through simulation. Our preliminary results show that it is possible to create a cooperative coordination mechanism that can achieve a group objective without risking sub-optimality or sub-optimization of individual domains.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Modularization compass navigating the white waters of feature-oriented modularity\n", "abstract": " Successful software systems have to adapt to the evolving needs of their users. However, adding and extending functional features often becomes more difficult over time due to aggregated complexity and eroded modularity. This erosion can be quantified by measuring scattering and tangling of feature implementations in the source code, to track long-term regressions and to plan refactorings. This paper argues that the traditional usage of only the absolute values of modularity metrics is, however, insufficient and proposes to use their relative values instead. These relative values are referred to as the drift of feature-oriented modularity, and are defined as the distance between the actual metric values for a given source code and their values achievable for the source code's ideally modularized counterpart. The proposed approach, called modularization compass, computes the modularity drift by optimizing the …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Multi-layered satisficing decision making in oil and gas production platforms\n", "abstract": " From a control perspective, offshore oil and gas production is very challenging due to the many and potentially conflicting production objectives that arise from the intrinsic complexity of the oil and gas domain. In this paper, we show how a multi-layered multi-agent system can be used to implement a satisficing decision-making process for allocation of production resources. Through simulations using real-world production data, we illustrate that this satisficing decision-making process performs better than existing control systems applied on marginal fields, even though satisficing decision making often only provides near-optimal solutions.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Demonstrating multi-layered MAS in control of offshore oil and gas production\n", "abstract": " From a control perspective, offshore oil and gas production is very challenging due to the many and potentially conflicting production objectives that arise from the intrinsic complexity of the oil and gas domain. In this paper, we demonstrate how a multi-layered multi-agent system can be used in a satisficing decision-making process for allocation of production resources.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Applying Distributed Object Technology to Distributed Embedded Control Systems\n", "abstract": " In this paper, we describe our Java RMI inspired Object Request Broker architecture MicroRMI for use with networked embedded devices. MicroRMI relieves the software developer from the tedious and error- prone job of writing communication protocols for interacting with such embedded devices. MicroRMI supports easy integration of high-level application specific control logic with low-level device specific control logic. Our experience from applying MicroRMI in the context of a distributed robotics control application, clearly demonstrates that it is feasible to use distributed object technology in developing control systems for distributed embedded platforms possessing severe resource restrictions.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Using Agent Satisfiability to Identify and Explain Interactions among Independent Greenhouse Climate Control Requirements\n", "abstract": " The slow adoption pace of new control strategies for sustainable greenhouse climate control by industrial growers, is mainly due to the complexity of identifying and explaining potentially conflicts when integrating independently climate control requirements. In this paper, we show how the satisfiability of agents, implementing independent climate control requirements, can be used to identify and explain conflicting control interactions, which emerge because the agents share the same resources in the controlled environment. Potential conflicts due to unfulfilled climate control requirements correspond to low agent satisfiability. Low satisfiability indicates that an agent’s goal is conflicting with the proposed settings of the greenhouse climate. This allows us to explain to which degree independent climate control requirements are fulfilled by visualizing the satisfiability of the corresponding agents. We have …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Decouplink: dynamic links for Java\n", "abstract": " Software entities should be open for extension, but closed to modification. Unfortunately, unanticipated requirements emerging during software evolution makes it difficult to always enforce this principle. This situation poses a dilemma that is particularly important when considering component-based systems: On the one hand, violating the open/closed principle by allowing for modification compromises independent extensibility. On the other hand, trying to enforce the open/closed principle by prohibiting modification precludes unanticipated dimensions of extension. Dynamic links increase the number of dimensions of extension that can be exploited without performing modification of existing types. Thus, dynamic links make it possible to enforce the open/closed principle in situations where it would otherwise not be possible. We present Decouplink – a library-based implementation of dynamic links for Java …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Counter-proposal: A Multi-Agent Negotiation Protocol for Resolving Resource Contention in Open Control Systems\n", "abstract": " The resource contention problem in control systems based on software agents occurs when agents with different goals compete with each other, to control a shared resource. In this paper we propose the counter-proposal protocol, a negotiation protocol that resolves the resource contention problem in control systems based on software agents. The protocol is evaluated by an example of a real control problem. The evaluation of the example demonstrates that the protocol is able to find acceptable solutions between competing software agents, if they exist. The focus of this paper is to present the design and implementation of the protocol.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Composing objects in open contexts using dynamic links\n", "abstract": " Composing Objects in Open Contexts Using Dynamic Links — University of Southern Denmark Skip to main navigation Skip to search Skip to main content University of Southern Denmark Logo Help & FAQ Dansk English Home Researchers Research Units Research Output Activities Projects Press / Media Prizes Teaching Impacts Composing Objects in Open Contexts Using Dynamic Links Martin Lykke Rytter Jensen, Bo Nørregaard Jørgensen The Maersk Mc-Kinney Moller Institute Faculty of Engineering Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Overview Original language English Title of host publication Proceedings of the IASTED International Conferences on Informatics 2010 : Software Engineering and Applications Editors PJ Clarke, T. Gonzalez, G. Singh Number of pages 9 Publisher ACTA Press Publication date 2010 Pages 451 - - () (…", "num_citations": "1\n", "authors": ["128"]}
{"title": "Composing Objects in Open Contexts using Dynamic Links\n", "abstract": " In object-oriented software development, the use of links between objects is often constrained by developers’ ability to anticipate the need for static association at the class level–ie declaration of fields and corresponding accessor and modifier methods. Failing to anticipate the need for links may lead to evolutionary pressure–ie introduction of associations. We propose dynamic links, an approach that allows for creation, deletion, and navigation of links between objects of statically unrelated classes. Our approach reduces evolutionary pressure by eliminating the need for static associations between classes with no functional dependencies. In doing so, it facilitates object-oriented modeling of open contexts, whose scope may change in unanticipated ways at runtime.", "num_citations": "1\n", "authors": ["128"]}
{"title": "PREDICT-A component-based software platform for dynamic climate control\n", "abstract": " PREDICT - A component-based software platform for dynamic climate control — University of Southern Denmark Skip to main navigation Skip to search Skip to main content University of Southern Denmark Logo Help & FAQ Dansk English Home Researchers Research Units Research Output Activities Projects Press / Media Prizes Teaching Impacts PREDICT - A component-based software platform for dynamic climate control Martin Lykke Rytter Jensen, Bo Nørregaard Jørgensen, Oliver Körner, Carl-Otto Ottosen The Maersk Mc-Kinney Moller Institute Faculty of Engineering Research output: Contribution to journal › Journal article › Communication Overview Abstract Udgivelsesdato: October Original language English Journal Gartner Tidende Pages (from-to) 43-44 Number of pages 2 ISSN 0106-8393 Publication status Published - 1. Oct 2009 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Jensen, , , …", "num_citations": "1\n", "authors": ["128"]}
{"title": "Object oriented C++ programming in SIMULINK®-A reengineered simulation architecture for the control algorithm code view\n", "abstract": " By the use of MATLAB tools Simulink® models of control algorithms can be translated into an equivalent C-program. This paper treats a different approach of building control algorithm block components in C++ for use both in Simulink® models and in application code development. The object oriented reengineering has been applied to a subset of the present simulation library of control algorithms at Danfoss Drives, one of the world’s largest producers of frequency converters. A frequency converter is an electronic device controlling the rotational speed of an electrical AC motor. By the use of object orientation, the chosen subset of control algorithms was transformed from a collection of C-functions into a collection of C++ components. Thus by confining control algorithm state variables and functions to objects and Simulink® specific code to Simulink® S-function wrapper files an entangling of the code has been achieved. Thus control algorithm clarity has improved. By utilizing advanced features in C++ the same control code text could be simulated using a fixed-point calculation library and a library of calculations with physical units (Volt, Ampere, Ohm, Radians etc), where improper use of physical units are caught on compile-time. Furthermore calculations can be monitored on runtime for overflow, underflow and the degree of precision when dealing with fixed-point calculations. As control algorithm blocks are represented as C++ objects, inter connected control algorithm blocks can be synthesized in a new class, which in turn becomes a building block of a higher abstraction level. Such high level building blocks can be handed out to be used in …", "num_citations": "1\n", "authors": ["128"]}
{"title": "The Censor Compound Design Pattern\n", "abstract": " The censor design pattern deals with non-functional concerns on run-time. Function censors are put in front of functions in a class interface. The function censors apply pipes of censor filters. Invocation of censored functions is transparent to clients. The censor filter constitutes a modularisation and abstraction for programming a nonfunctional concern.", "num_citations": "1\n", "authors": ["128"]}
{"title": "RoBlock: a prototype autonomous manufacturing cell\n", "abstract": " RoBlock is the first phase of an internally financed project at the Institute aimed at building a system in which two industrial robots suspended from a gantry, as shown below, cooperate to perform a task specified by an external user, in this case, assembling an unstructured collection of colored wooden blocks into a specified 3D pattern. The blocks are identified and localized using computer vision and grasped with a suction cup mechanism. Future phases of the project will involve other processes such as grasping and lifting, as well as other types of robot such as autonomous vehicles or variable geometry trusses. Innovative features of the control software system include: The use of an advanced trajectory planning system which ensures collision avoidance based on a generalization of the method of artificial potential fields, the use of a generic model-based controller which learns the values of parameters …", "num_citations": "1\n", "authors": ["128"]}
{"title": "A metadata-driven approach that combines family polymorphism, delegation and flexible composition semantics\n", "abstract": " The Lasagne object and component model enables customizations that create multiple, independent context-specific views on an application. Applications are collaborating objects and customizations are refining multiple points in an application in a non-invasive way. We achieve this goal by supporting selective combination of behavioral extensions. Different customizations can be deployed and activated simultaneously without jeopardizing the consistency of the core applications or its clients. The Lasagne primitives are generic building blocks that support the execution of high-level language constructs such as class qualification, delegation and predicate dispatching. In this paper, we show how these primitives support object-based inheritance (delegation) and family polymorphism, while leaving flexibility to fine-tune the composition semantics of the inheritance link.", "num_citations": "1\n", "authors": ["128"]}
{"title": "Middleware Technology for Supporting Tangible Objects in Pervasive Computing\n", "abstract": " In this paper, we propose a novel architectural framework for organizing pervasive systems. The framework provides architectural abstractions for decomposing a pervasive system into manageable and comprehensive parts and middleware technologies for supporting them. The comprehensiveness of the decomposition is founded in the intuitive correlation between the architectural abstractions and the concepts they model in the problem domain. The middleware technologies that are part of the framework allow objects to participate in new collaborations through dynamic and selective customization of behavior and interaction.", "num_citations": "1\n", "authors": ["128"]}