{"title": "Tax fraud detection for under-reporting declarations using an unsupervised machine learning approach\n", "abstract": " Tax fraud is the intentional act of lying on a tax return form with intent to lower one's tax liability. Under-reporting is one of the most common types of tax fraud, it consists in filling a tax return form with a lesser tax base. As a result of this act, fiscal revenues are reduced, undermining public investment.", "num_citations": "38\n", "authors": ["1331"]}
{"title": "Applying data mining techniques to predict student dropout: a case study\n", "abstract": " The prevention of students dropping out is considered very important in many educational institutions. In this paper we describe the results of an educational data analytics case study focused on detection of dropout of System Engineering (SE) undergraduate students after 7 years of enrollment in a Colombian university. Original data is extended and enriched using a feature engineering process. Our experimental results showed that simple algorithms achieve reliable levels of accuracy to identify predictors of dropout. Decision Trees, Logistic Regression and Näıve Bayes results were compared in order to propose the best option. Also, Watson Analytics is evaluated to establish the usability of the service for a non expert user. Main results are presented in order to decrease the dropout rate by identifying potential causes. In addition, we present some findings related to data quality to improve the students data …", "num_citations": "29\n", "authors": ["1331"]}
{"title": "Predicting student drop-out rates using data mining techniques: A case study\n", "abstract": " The prevention of students dropping out is considered very important in many educational institutions. In this paper we describe the results of an educational data analytics case study focused on detection of dropout of Systems Engineering (SE) undergraduate students after 6 years of enrollment in a Colombian university. Original data is extended and enriched using a feature engineering process. Our experimental results showed that simple algorithms achieve reliable levels of accuracy to identify predictors of dropout. Decision Trees, Logistic Regression, Naive Bayes and Random Forest results were compared in order to propose the best option. Also, Watson Analytics is evaluated to establish the usability of the service for a non expert user. Main results are presented in order to decrease the dropout rate by identifying potential causes. In addition, we present some findings related to data quality to …", "num_citations": "21\n", "authors": ["1331"]}
{"title": "Caracterización microscópica de texturas superficiales fabricadas aditivamente mediante estereolitografía láser\n", "abstract": " Objetivo: En nuestro trabajo presentamos el desarrollo de texturas superficiales con diferentes geometrías fabricadas por manufactura aditiva. Metodología: Los sustratos con diferentes texturas superficiales son diseñados por medio de programas asistidos por computador (CAD). La fabricación de las diferentes superficies se realiza capa a capa, en un solo proceso, por medio de la técnica de estereolitografía láser (SLA), directamente desde los archivos CAD. Resultados: Las superficies de los sustratos fueron evaluadas mediante ensayos ópticos con el objetivo de medir la topografía de las superficies, validar el acabado superficial y controlar los métodos de fabricación a través de las estrategias de medición en diferentes perfiles. Conclusión: En este estudio mostramos que las texturas superficiales impresas presentaron una reducción de los valores de medidas de longitud, volumen y masa en comparación con la definida en el diseño. Palabras clave: Manufactura aditiva, Microscopía óptica, Resina fotocurable.", "num_citations": "15\n", "authors": ["1331"]}
{"title": "Estimate of the concentration of implanted ions in solid substrates using a web application\n", "abstract": " The three-dimensional ionic implantation technique (3DII) is used to modify the surface of solid metal by electric discharges pulsed of high voltage at low pressures. Knowing the density of ions implanted in the surface of a functional element, in a faster and estimated way, will help to optimize the surface treatment technique. Therefore, a web application was developed which from experimental parameters established in a process 3DII estimates the concentration of ions implanted in solid metal substrates. The results obtained in this research work demonstrate the feasibility of the computational web tool to perfect the experiments of surface modification by ion implantation.", "num_citations": "7\n", "authors": ["1331"]}
{"title": "A model driven approach to the analysis of quality scenarios within self-adaptable soa systems\n", "abstract": " Self-adaptive behavior is a feature which architects needs to include in their systems in order to improve its reliability. However, despite several ways to get it, it is still hard to implement a self-adaptive system focused on non-functional properties. Difficulties to express quality attributes in the system without combining business logic with the self-adaptation logic and to include new services on runtime are some of them. In this paper we propose a model-driven analysis approach to offer a mechanism which allow the desired quality requirements to be expressed in a simple and non-intrusive manner, to find the best services available in a system and, to offer a code generation mechanism which takes the models created under the first objective and generates the necessary code for autonomously monitoring and adapting a SOA system.", "num_citations": "5\n", "authors": ["1331"]}
{"title": "How do software architects perceive technical debt in Colombian industry? An analysis of technical debt causes\n", "abstract": " Technical debt is a metaphor used to describe technical decisions that can give the company a benefit in the short term but possibly hurting the overall quality of the software in the long term. Architectural decisions are considered one of the most common sources of technical debt, therefore, it becomes relevant to understand what causes lead to technical debt from the point of view of software architects. To accomplish this task, we used a survey research method to collect and analyze a corpus of 28 software architects from Colombia, as a part of the InsighTD project. Results showed that inappropriate planning is the most cited technical debt cause by software architects. However, results differ when comparison against engineers and manager are performed. Innacurate time estimate and producing more without quality were the most selected causes of technical debt according to engineers and …", "num_citations": "4\n", "authors": ["1331"]}
{"title": "A proposed model-driven approach to manage architectural technical debt life cycle\n", "abstract": " Architectural Technical Debt (ATD) is a metaphor used to describe consciously decisions taken by software architects to accomplish short-term goals but possibly negatively affecting the long-term health of the system. However, difficulties arise when repayment strategies are defined because software architects need to be aware of the consequences of these strategies over others decisions in the software architecture. This article proposes REBEL, a semi-automated model-driven approach that exploits natural language processing, machine learning and model checking techniques on heterogeneous project artifacts to build a model that allows to locate and visualize the impact produced by the consciously injected ATD and its repayment strategy on the other architectural decisions. The technique is illustrated with a data analytics project in Colombia where software architects are unaware of the consequences of …", "num_citations": "4\n", "authors": ["1331"]}
{"title": "Modelo de desarrollo ágil de un “cloud erp” para las pequeñas y medianas empresas (pymes) de norte de santander\n", "abstract": " En este artículo se propone un modelo que establece las fases, métodos, procedimientos y herramientas necesarias para estructurar y controlar el desarrollo de un ERP en la nube para las PYMES (Pequeñas y medianas empresas) de Norte de Santander. Este trabajo se realizó en 4 fases: primero se realizó una fundamentación teórica, luego una revisión de las metodologías de desarrollo ágil y por último se plantea el modelo de desarrollo ágil propuesto para la creación del ERP para las PYMES.", "num_citations": "3\n", "authors": ["1331"]}
{"title": "Design and implementation of a web application to estimate the surface density of implanted ions in solid substrates\n", "abstract": " In the present research a web application is designed and implemented allowing us to calculate the dose of implanted ions on solid substrates from experimental parameters (repetition rate and pulse duration of current, potential difference, work pressure and treatment time) and current pulses acquired during start-up and shutdown of high voltage electrical discharges at low pressures. By physical and mathematical processing, it is achieved at first estimate the value of the ionic charge, and then the areal density. This study will provide more accurate and suitable developments in relation to applications of ion implantation as an alternative technique to increase the service life of the surfaces of the materials used in various industrial sectors developments.", "num_citations": "3\n", "authors": ["1331"]}
{"title": "Estimation of the ionic charge of non-metallic species into an electrical discharge through a web application\n", "abstract": " Estimate the ionic charge generated in electrical discharges will allow us to know more accurately the concentration of ions implanted on the surfaces of nonmetallic solids. For this reason, in this research a web application was developed to allow us to calculate the ionic charge generated in an electrical discharge from the experimental parameters established in an ion implantation process performed in the JUPITER (Joint Universal Plasma and Ion Technologies Experimental Reactor) reactor. The estimated value of the ionic charge will be determined from data acquired on an oscilloscope, during startup and shutdown of electrical discharge, which will then be analyzed and processed. The study will provide best developments with regard to the application of ion implantation in various industrial sectors.", "num_citations": "3\n", "authors": ["1331"]}
{"title": "Comparación de técnicas de mineria de datos para identificar indicios de deserción estudiantil, a partir del desempeño académico\n", "abstract": " Uno de los grandes retos en las instituciones educativas consiste en poder establecer la posibilidad de retiro o deserción de sus estudiantes. En este artículo se presentan los resultados de un estudio de comparación de técnicas para apoyar la identificación de deserción estudiantil a partir del registro académico de los estudiantes de una Universidad en Colombia para el programa de Ingeniería de Sistemas. El registro académico se estableció para un periodo de 7 años. Árboles de decisión, regresión logística y Naive Bayes, fueron comparados para lograr establecer la mejor técnica de detección de desertores. Adicionalmente, la herramienta Watson Analytics de IBM fue utilizada para comparar su usabilidad y precisión para un usuario no experto. Nuestra experimentación demostró que el uso de algoritmos simples es suficiente para alcanzar niveles ideales de precisión. Estos resultados son presentados a la comunidad académica para ayudar en la disminución de la deserción estudiantil.", "num_citations": "2\n", "authors": ["1331"]}
{"title": "Modelo de nube híbrida (hybrid cloud) de Infraestructura como servicio para mejorar el rendimiento de la plataforma Sandbox-UFPS\n", "abstract": " El presente estudio consiste en desarrollo de un modelo de nube hibrida de infraestructura como servicio con el fin de mejorar el rendimiento de la plataforma Sandbox de la Universidad Francisco de Paula Santander (UFPS). Sandbox-UFPS es una plataforma de desarrollo en la nube para la gestión y configuración de servidores de aplicaciones (apache, tomcat, glassfish, IIS) para uso académico, que permite el desarrollo y despliegue de aplicaciones web, haciendo uso de tecnologías como PHP, Python, JSP,. Net y servicios de bases de datos relacionales y no relacionales. Se realizó una fase de diagnóstico donde se analizó el estado actual de Sandbox-UFPS en relación a la integridad, disponibilidad, servicios ofrecidos y tecnología; posteriormente se estudiaron los proveedores de computación en la nube existentes en el mercado con el fin de plantear un modelo de nube hibrida y aplicarlo para la plataforma Sandbox–UFPS. Con este tipo de propuesta se mejora la disponibilidad, integridad y respaldo de la plataforma, siendo un referente para otras instituciones, empresas en general y para proveedores de infraestructura. Con este tipo de herramientas se automatiza el proceso de despliegue de aplicaciones y bases de datos y facilita el trabajo en equipo.", "num_citations": "2\n", "authors": ["1331"]}
{"title": "Smart Transportation: A Reference Architecture for Big Data Analytics\n", "abstract": " Smart transportation systems (STS) play a key role in smart cities as an underlying infrastructure that supports cities’ core services, such as public transport, mobility, and logistics. Information sources and analytics in STS include datasets with high volume, speed, and heterogeneity characteristics. Next-generation architectures must deal with the quality attributes of big data analytics (BDA) applications to store and process this kind of data. The combination of the extensive catalog of new technologies and multiple big data sources implies a large number of possible software solutions. Hence, organizations managing STS are facing many challenges when requiring fast adoption of these technologies, due to the lack of guidance on finding the right solution architecture. Previous works have proposed reference architectures (RA) for BDA or STS, but not both. The current STS RAs do not pay special attention …", "num_citations": "1\n", "authors": ["1331"]}
{"title": "Measuring the quality of the blended learning approach to teaching computational sciences\n", "abstract": " Teaching models are a very interesting area of study that can be applied to any science. Finding the best way to transfer knowledge to students, so that they internalize it and can successfully transfer it to the field, is key to the country building. This article measures the quality of a teaching model that can be applied in physics or engineering, which requires a correct theoretical foundation before addressing practical elements. Blended learning is an approach to education that combines online educational materials and opportunities for interaction online with traditional place-based classroom methods. This model was applied in agile software architectures course and measured through an anonymous survey of students in software architecture, who were enrolled for the periods 2015-2018. The results showed that 39.7% of the respondents considered that they learned better compared to face-to-face courses.", "num_citations": "1\n", "authors": ["1331"]}
{"title": "Designing educational video games to improve spatial learning\n", "abstract": " Video games can play a vital part in a young child's education, particularly those that look to strengthen their spatial abilities. This study will look at a mixed gender group of 5 year olds from the Institución Educativa Julio Perez Ferrero focussing on the identification of signs to find the way out of a maze. This plays an important role in a childs sense of direction and finding the correct path, hence developing spatial skills. Results have shown that video game use improved the childrens abilities, albeit at differing speeds, to read signs and avoid enemies, such signs included both images and sounds. We discovered that the girls were more attentive at spotting signs and consider the use of virtual mazes to strengthen children's spatial skills highly effective, although implications and direction of this research are open to discussion.", "num_citations": "1\n", "authors": ["1331"]}
{"title": "Using learning styles in learning objects: a case study in a colombian public university\n", "abstract": " Background: computer-programming courses aren’t easy to study. Some authors have studied the difficulties in learning programming to support developing learning materials for basic programming courses. In Colombia there is an approach to teaching programming using an active learning approach (Interactive Learning Objects–ILOs) as one of the components that reinforce their pedagogical model, by supporting the generation of high-level programming skills. Objective: we want to explore the possibilities of using Learning Styles and Team Learning to increase the learning levels of Computer Programming students. Methods: this study was applied outside of the classroom in order to encourage autonomous learning. To do this we’ll pick a sample and apply a series of comparative tests between research groups. Results: the objective was met by effectively showing that providing content based LS and team-based leaning can improve a student’s performance. The intervention group grades were better than those of the comparison group though they should be analyzed further to get a more accurate conclusion. Conclusion: This study will give us the chance to see whether the strategy can be applied to the Francisco de Paula Santander University students.", "num_citations": "1\n", "authors": ["1331"]}
{"title": "MENTA: A model-driven architecture to enable self-adaptive SOA systems\n", "abstract": " Self-adaptive behavior is a feature which architects wants to include in their systems in order to improve its reliability. However, despite several ways to get it, it is still hard to implement a self-adaptive system which take in consideration quality attributes. Difficulties are related with architect's advanced knowledge in modelling, validating and implementing this kind of systems. In this paper we propose a model-driven architectural approach to allow the architect to define adaptation rules based on quality attributes enabling self-adaptive behavior in a SOA system.", "num_citations": "1\n", "authors": ["1331"]}