{"title": "IPython: a system for interactive scientific computing\n", "abstract": " Python offers basic facilities for interactive work and a comprehensive library on top of which more sophisticated systems can be built. The IPython project provides on enhanced interactive environment that includes, among other features, support for data visualization and facilities for distributed and parallel computation", "num_citations": "3613\n", "authors": ["836"]}
{"title": "Jupyter Notebooks-a publishing format for reproducible computational workflows.\n", "abstract": " It is increasingly necessary for researchers in all fields to write computer code, and in order to reproduce research results, it is important that this code is published. We present Jupyter notebooks, a document format for publishing code, results and explanations in a form that is both readable and executable. We discuss various tools and use cases for notebook documents.", "num_citations": "1451\n", "authors": ["836"]}
{"title": "Python: an ecosystem for scientific computing\n", "abstract": " As the relationship between research and computing evolves, new tools are required to not only treat numerical problems, but also to solve various problems that involve large datasets in different formats, new algorithms, and computational systems such as databases and Internet servers. Python can help develop these computational research tools by providing a balance of clarity and flexibility without sacrificing performance.", "num_citations": "229\n", "authors": ["836"]}
{"title": "Tuning the interactions of spin-polarized fermions using quasi-one-dimensional confinement\n", "abstract": " We develop a multichannel scattering theory for atom-atom collisions in quasi-1D geometries. We apply our general framework to the low energy scattering of two spin-polarized fermions and show that tightly confined fermions have infinitely strong interactions at a particular value of the 3D, free-space p-wave scattering volume. Moreover, we describe a mapping of this strongly interacting system of two quasi-1D fermions to a weakly interacting system of two 1D bosons.", "num_citations": "166\n", "authors": ["836"]}
{"title": "Characterization and remediation of sample index swaps by non-redundant dual indexing on massively parallel sequencing platforms\n", "abstract": " Here we present an in-depth characterization of the mechanism of sequencer-induced sample contamination due to the phenomenon of index swapping that impacts Illumina sequencers employing patterned flow cells with Exclusion Amplification (ExAmp) chemistry (HiSeqX, HiSeq4000, and NovaSeq). We also present a remediation method that minimizes the impact of such swaps. Leveraging data collected over a two-year period, we demonstrate the widespread prevalence of index swapping in patterned flow cell data. We calculate mean swap rates across multiple sample preparation methods and sequencer models, demonstrating that different library methods can have vastly different swapping rates and that even non-ExAmp chemistry instruments display trace levels of index swapping. We provide methods for eliminating sample data cross contamination by utilizing non-redundant dual indexing for complete filtering of index swapped reads, and share the sequences for 96 non-combinatorial dual indexes we have validated across various library preparation methods and sequencer models. Finally, using computational methods we provide a greater insight into the mechanism of index swapping. Index swapping in pooled libraries is a prevalent phenomenon that we observe at a rate of 0.2 to 6% in all sequencing runs on HiSeqX, HiSeq 4000/3000, and NovaSeq. Utilizing non-redundant dual indexing allows for the removal (flagging/filtering) of these swapped reads and eliminates swapping induced sample contamination, which is critical for sensitive applications such as RNA-seq, single cell, blood biopsy using circulating tumor DNA, or …", "num_citations": "142\n", "authors": ["836"]}
{"title": "The Jupyter/IPython architecture: a unified view of computational research, from interactive exploration to communication and publication.\n", "abstract": " IPython has provided terminal-based tools for interactive computing in Python since 2001. The notebook document format and multi-process architecture introduced in 2011 have expanded the applicable scope of IPython into teaching, presenting, and sharing computational work, in addition to interactive exploration. The new architecture also allows users to work in any language, with implementations in Python, R, Julia, Haskell, and several other languages. The language agnostic parts of IPython have been renamed to Jupyter, to better capture the notion that a cross-language design can encapsulate commonalities present in computational research regardless of the programming language being used. This architecture offers components like the web-based Notebook interface, that supports rich documents that combine code and computational results with text narratives, mathematics, images, video and any …", "num_citations": "128\n", "authors": ["836"]}
{"title": "Project Jupyter: Computational narratives as the engine of collaborative data science\n", "abstract": " Note: this is the full text of the grant proposal that was funded by the Helmsley Trust, the Gordon and Betty Moore Foundation and the Alfred P. Sloan Foundation on April 2015, as described on these two announcements from UC Berkeley and Cal Poly, and press releases from the Helmsley Trust and the Moore Foundation. A PDF version of this document can be found here.", "num_citations": "106\n", "authors": ["836"]}
{"title": "Altair: interactive statistical visualizations for Python\n", "abstract": " Altair is a declarative statistical visualization library for Python. Statistical visualization is a constrained subset of data visualization focused on the creation of visualizations that are helpful in statistical modeling. The constrained model of statistical visualization is usually expressed in terms of a visualization grammar (Wilkinson, 2005) that specifies how input data is transformed and mapped to visual properties (position, color, size, etc.).Altair is based on the Vega-Lite visualization grammar (Satyanarayan, Moritz, Wongsuphasawat, & Heer, 2017), which allows a wide range of statistical visualizations to be expressed using a small number of grammar primitives. Vega-Lite implements a view composition algebra in conjunction with a novel grammar of interactions that allow users to specify interactive charts in a few lines of code. Vega-Lite is declarative; visualizations are specified using JSON data that follows the Vega-Lite JSON schema. As a Python library, Altair provides an API oriented towards scientists and data scientists doing exploratory data analysis (Tukey, 1977). Altair’s Python API emits Vega-Lite JSON data, which is then rendered in a user-interface such as the Jupyter Notebook, JupyterLab, or nteract using the Vega-Lite JavaScript library. Vega-Lite JSON is compiled to a full Vega specification (Satyanarayan, Russell, Hoffswell, & Heer, 2016), which is then parsed and executed using a reactive runtime that internally makes use of D3. js (Bostock, Ogievetsky, & Heer, 2011).", "num_citations": "94\n", "authors": ["836"]}
{"title": "Quasi-one-dimensional Bose gases with a large scattering length\n", "abstract": " Bose gases confined in highly elongated harmonic traps are investigated over a wide range of interaction strengths using quantum Monte Carlo techniques. We find that the properties of a Bose gas under tight transverse confinement are well reproduced by a 1D model Hamiltonian with contact interactions. We point out the existence of a unitary regime, where the properties of the quasi-1D Bose gas become independent of the actual value of the 3D scattering length a 3 D. In this unitary regime, the energy of the system is well described by a hard-rod equation of state. We investigate the stability of quasi-1D Bose gases with positive and negative a 3 D.", "num_citations": "89\n", "authors": ["836"]}
{"title": "Highly extended image states around nanotubes\n", "abstract": " We predict that freely suspended, linear molecular conductors or dielectrics, such as carbon nanotubes, can support electronic states that are localized far from the surface. These “tubular image states” are formed in extended potential wells resulting from the tug of war between the external electron’s attraction to its image charge in the nanotube, and its repulsion from the tube due to its transverse angular momentum. The displacement of these states (> 10 n m) away from the surface prevents their wave functions from collapsing, resulting in long lifetimes at low temperatures. We predict that tubular image states with binding energies of 1–10 m e V can be formed via radiative recombination.", "num_citations": "80\n", "authors": ["836"]}
{"title": "Open source computer algebra systems: SymPy\n", "abstract": " This survey will look at SymPy, a free and open source computer algebra system started in 2005 by the second author (O.Č.). It is written entirely in Python, available from http://sympy.org. SymPy is licensed under the \"modified BSD\" license, as is its beautiful logo designed by Fredrik Johansson.", "num_citations": "76\n", "authors": ["836"]}
{"title": "Strongly magnetized antihydrogen and its field ionization\n", "abstract": " Internal orbits of experimentally analyzed antihydrogen (H) atoms depend as much on an external magnetic field as on the Coulomb force. A circular “guiding center atom” model is used to understand their field ionization. This useful model, assumed in the theory of three-body H recombination so far, ignores the important coupling between internal and center-of-mass motion. A conserved pseudomomentum, effective potential, saddle point analysis, and numerical simulation show where the simple model is valid and classify the features of the general case, including “giant dipole states.”", "num_citations": "51\n", "authors": ["836"]}
{"title": "Quantum and semiclassical analysis of long-range Rydberg molecules\n", "abstract": " A recent study suggests the existence of highly polar and nonpolar long-range Rydberg molecules under temperature and density conditions representative of those found in atomic Bose-Einstein condensates. The electronic wave functions of these Rydberg molecules are characterized by an elliptically shaped nodal structure. We use a combination of quantum and semiclassical methods to explore this unique nodal structure and its correlations with the Born-Oppenheimer potential curves of the molecules. We demonstrate a special “quasiseparability” that arises in elliptic coordinates at certain internuclear separations and give a semiclassical interpretation of this in terms of quantized Einstein-Brillouin-Keller orbits.", "num_citations": "51\n", "authors": ["836"]}
{"title": "GPULib: GPU computing in high-level languages\n", "abstract": " GPULib helps scientists and engineers take advantage of GPUs from within high-level programming environments without requiring any detailed knowledge of the GPU architecture.", "num_citations": "45\n", "authors": ["836"]}
{"title": "Python for scientific computing\n", "abstract": " Python in Scientific Computing Page 1 SciComp Examples Python PDEs Summary Python in Scientific Computing An Illustration with Multiwavelets for PDEs Fernando Pérez <Fernando.Perez@colorado.edu> Department of Applied Mathematics University of Colorado Boulder, Colorado Colorado School of Mines November 19th, 2004 Page 2 SciComp Examples Python PDEs Summary Outline 1 Scientific Computing Traditional approaches Python? 2 Interlude: Python in the real world PMV: molecular structures EEG analysis for epilepsy MayaVi: data visualization 3 Python and Scientific Computing Basic features A better development model 4 PDEs, Green’s Functions and Multiwavelets The ‘curse of dimensionality’ Multiresolution analysis Poisson’s equation FP (App. Math - CU Boulder) Python, Scientific Computing & PDEs CS Mines - 11/19/04 2 / 44 Page 3 SciComp Examples Python PDEs Summary Outline 1 …", "num_citations": "31\n", "authors": ["836"]}
{"title": "Exponentially decaying correlations in a gas of strongly interacting spin-polarized 1D fermions with zero-range interactions\n", "abstract": " We consider the single-particle correlations and momentum distributions in a gas of strongly interacting, spinless 1D fermions with zero-range interactions. This system represents a fermionic version of the Tonks-Girardeau gas of impenetrable bosons as it can be mapped to a system of noninteracting 1D bosons. We use this duality to show that the T= 0, single-particle correlations exhibit an exponential decay with distance. This strongly interacting system is experimentally accessible using ultracold atoms and has a Lorentzian momentum distribution at large momenta whose width is given by the linear density.", "num_citations": "30\n", "authors": ["836"]}
{"title": "Extending closed-orbit theory using quantum-defect ideas: Basic concepts and derivations\n", "abstract": " High-resolution spectra of complex atoms and molecules have been described efficiently in the energy domain using quantum-defect methods. At the same time, the coarser modulations in energy associated with external field effects such as quasi-Landau phenomena have been most fruitfully described in the framework of semiclassical closed-orbit theory, which relates the short-time quantum-mechanical behavior to the classical orbits of the system. In this paper, we demonstrate a unified theory based on semiclassical scattering matrices that adds to the power and generality of both methodologies.", "num_citations": "30\n", "authors": ["836"]}
{"title": "Collaborative cloud-enabled tools allow rapid, reproducible biological insights\n", "abstract": " Microbial ecologists today face critical computational barriers. The rapid increase in the quantity of data acquired by modern sequencing instruments makes analysis by hand infeasible, and even software developed just a few years ago cannot scale to modern data sets. As a result, making advanced, scalable algorithms and large-scale computational resources available to end-users is necessary to advancing our understanding of microbial ecology. One challenge many face when developing software for the first time is the gap between writing a script that can run on a single processor and writing a script that will scale to a larger cluster. A second is that knowledge required for a project is often distributed among many individuals, including software developers, subject matter experts and experts in the use of specific computer systems. Although computation can be a language that bridges many disciplines …", "num_citations": "29\n", "authors": ["836"]}
{"title": "Quantum Monte Carlo study of quasi-one-dimensional Bose gases\n", "abstract": " We study the behaviour of quasi-one-dimensional (quasi-1D) Bose gases by Monte Carlo techniques, ie by the variational Monte Carlo, the diffusion Monte Carlo and the fixed-node diffusion Monte Carlo techniques. Our calculations confirm and extend our results of an earlier study (Astrakharchik et al 2003 Preprint cond-mat/0308585). We find that a quasi-1D Bose gas (i) is well described by a 1D model Hamiltonian with contact interactions and renormalized coupling constant;(ii) reaches the Tonks–Girardeau regime for a critical value of the 3D scattering length a 3D;(iii) enters a unitary regime for| a 3D|→∞, where the properties of the gas are independent of a 3D and are similar to those of a 1D gas of hard-rods and (iv) becomes unstable against cluster formation for a critical value of the 1D gas parameter. The accuracy and implications of our results are discussed in detail.", "num_citations": "27\n", "authors": ["836"]}
{"title": "nbgrader: A tool for creating and grading assignments in the Jupyter Notebook\n", "abstract": " Summary nbgrader is a flexible tool for creating and grading assignments in the Jupyter Notebook (Kluyver et al., 2016). nbgrader allows instructors to create a single, master copy of an assignment, including tests and canonical solutions. From the master copy, a student version is generated without the solutions, thus obviating the need to maintain two separate versions. nbgrader also automatically grades submitted assignments by executing the notebooks and storing the results of the tests in a database. After auto-grading, instructors can manually grade free responses and provide partial credit using the formgrader Jupyter Notebook extension. Finally, instructors can use nbgrader to leave personalized feedback for each student’s submission, including comments as well as detailed error information. nbgrader can also be used with JupyterHub (Jupyter Development Team, 2018), which is a centralized, server …", "num_citations": "18\n", "authors": ["836"]}
{"title": "Tunable bands of electronic image states in nanowire lattices\n", "abstract": " We demonstrate that suspended arrays of parallel nanowires support bound electron image states with rich band structures. Surprisingly, these Bloch states can be highly detached from the surfaces of the nanowires, similar to the single-tube wave functions. This is because an electron hovering in such a periodic lattice of nanowires is influenced by a Coulombic-like attraction and a centrifugal repulsion, which are both central symmetric around each wire. These novel states could be used in building of waveguides, mirrors, and storage places for Rydberg-like electrons.", "num_citations": "15\n", "authors": ["836"]}
{"title": "Feshbach resonance cooling of trapped atom pairs\n", "abstract": " Spectroscopic studies of few-body systems at ultracold temperatures provide valuable information that often cannot be extracted in a hot environment. Considering a pair of atoms, we propose a cooling mechanism that makes use of a scattering Feshbach resonance. Application of a series of time-dependent magnetic field ramps results in either zero, one, or two atoms remaining trapped. If two atoms remain in the trap after the field ramps are completed, then they have been cooled. Application of the proposed cooling mechanism to optical traps or lattices is considered.", "num_citations": "13\n", "authors": ["836"]}
{"title": "Interaction of laser light and electrons with nanotubes\n", "abstract": " Electronic states in designed geometries are attracting considerable attention. In this work, it is shown that it may be possible to induce ultrafast mechanical rotation in nanotubes using circularly polarized light. We predict a novel set of Rydberg-like electronic states around nanotubes having long lifetimes and exotic properties. Preliminary work on the interaction of slow electrons with an array of parallel nanotubes is discussed.", "num_citations": "11\n", "authors": ["836"]}
{"title": "Nonclassical paths in the recurrence spectrum of diamagnetic atoms\n", "abstract": " Using time-independent scattering matrices, we study how the effects of nonclassical paths on the recurrence spectra of diamagnetic atoms can be extracted from purely quantal calculations. This study reveals an intimate relationship between two types of nonclassical paths: exotic ghost orbits and diffractive orbits. This relationship proves to be a previously unrecognized reason for the success of semiclassical theories, such as closed-orbit theory, and permits a comprehensive reformulation of the semiclassical theory that elucidates its convergence properties.", "num_citations": "11\n", "authors": ["836"]}
{"title": "JupyterLab: Building blocks for interactive computing\n", "abstract": " SciPy 2016 Brian E. Granger, Cal Poly Jason Grout, Bloomberg LP Page 1 JupyterLab: Building Blocks for Interactive Computing SciPy 2016 Brian E. Granger, Cal Poly Jason Grout, Bloomberg LP Chris Colbert, Continuum Sylvain Corlay, Bloomberg Afshin Darian, Continuum Cameron Oelsen, Cal Poly Fernando Perez, LBNL/Berkeley Steven Silvester, Continuum David Willmer The larger Jupyter Team Page 2 20 Minutes Ago Page 3 5 Minutes Ago (rebase) Page 4 Where Are We Today? Page 5 ~3M Jupyter Users https://github.com/jupyter/design/blob/master/surveys/2015-notebook-ux/analysis/report_dashboard.ipynb Page 6 Over 500k Notebooks on GitHub https://github.com/trending/jupyter-notebook?since=weekly Page 7 Enabling Reproducible Science https://losc.ligo.org/about/ Page 8 Enabling Open Data Journalism Page 9 More Than Just Notebooks Page 10 Building Blocks File Browser Notebooks Text …", "num_citations": "10\n", "authors": ["836"]}
{"title": "Jupyter: Thinking and storytelling with code and data\n", "abstract": " Project Jupyter is an open-source project for interactive computing widely used in data science, machine learning, and scientific computing. We argue that even though Jupyter helps users perform complex, technical work, Jupyter itself solves problems that are fundamentally human in nature. Namely, Jupyter helps humans to think and tell stories with code and data. We illustrate this by describing three dimensions of Jupyter: interactive computing, computational narratives, and  the idea that Jupyter is more than software. We illustrate the impact of these dimensions on a community of practice in Earth and climate science.", "num_citations": "8\n", "authors": ["836"]}
{"title": "The principles of tomorrow's university\n", "abstract": " In the 21st Century, research is increasingly data-and computation-driven. Researchers, funders, and the larger community today emphasize the traits of openness and reproducibility. In March 2017, 13 mostly early-career research leaders who are building their careers around these traits came together with ten university leaders (presidents, vice presidents, and vice provosts), representatives from four funding agencies, and eleven organizers and other stakeholders in an NIH-and NSF-funded one-day, invitation-only workshop titled\" Imagining Tomorrow's University.\" Workshop attendees were charged with launching a new dialog around open research–the current status, opportunities for advancement, and challenges that limit sharing.", "num_citations": "4\n", "authors": ["836"]}
{"title": "An open source framework for interactive, collaborative and reproducible scientific computing and education\n", "abstract": " We propose to build open source tools to support the various phases of computational work that are typical in scientific research and education. Our tools will span the entire life-cycle of a research idea, from initial exploration to publication and teaching. They will enable reproducible research as a natural outcome and will bridge the gaps between code, published results and educational materials. This project is based on existing, proven open source technologies developed by our team over the last decade that have been widely adopted in academia and industry.", "num_citations": "4\n", "authors": ["836"]}
{"title": "Quantum and semiclassical scattering matrix theory for atomic photoabsorption in external fields\n", "abstract": " The photoabsorption spectra of Rydberg atoms in static, external electric and magnetic fields provide an excellent opportunity to study the properties of a nonintegrable physical system. This thesis develops a general theory for predicting and interpreting the photoabsorption spectra of these systems. Using ideas from both quantum-defect theory and semiclassical approximations, such as closed-orbit theory, I introduce scattering matrices to describe the final state of an electron in a photoabsorption experiment. The scattering matrices encapsulate all of the important physics of the system, and are related to important observables of the system, such as the bound state spectrum and the photoabsorption cross section.", "num_citations": "4\n", "authors": ["836"]}
{"title": "Reproducing machine learning research on binder\n", "abstract": " Binder is an open-source project that lets users share interactive, reproducible science. Binder’s goal is to allow researchers to create interactive versions of their code utilizing pre-existing workflows and minimal additional effort. It uses standard configuration files in software engineering to let researchers create interactive versions of code they have hosted on commonly-used platforms like GitHub. Binder’s underlying technology, BinderHub, is entirely open-source and utilizes entirely open-source tools. By leveraging tools such as Kubernetes and Docker, it manages the technical complexity around creating containers to capture a repository and its dependencies, generating user sessions, and providing public URLs to share the built images with others. BinderHub combines two open-source projects within the Jupyter ecosystem: repo2docker and JupyterHub. repo2docker builds the Docker image of the git repository specified by the user, installs dependencies, and provides various front-ends to explore the image. JupyterHub then spawns and serves instances of these built images using Kubernetes to scale as needed. Because each of these pieces is open-source and uses popular tools in cloud orchestration, BinderHub can be deployed on a variety of cloud platforms, or even on your own hardware.", "num_citations": "3\n", "authors": ["836"]}
{"title": "Granger and Greene reply\n", "abstract": " In his Comment [3], Matzkin asserts that this expansion is ‘‘purely formal’’and questions whether or not it is physically meaningful to extract physics from its individual terms (through a Fourier transform). We are unclear what is meant by purely formal in this context; this series converges absolutely to the closed form expression, Eq.(1), when Seff is evaluated at a complex ‘‘energy’’w i= 2. While Matzkin correctly points out that the series form of the cross section, Eq.(3), can and will oscillate wildly about the closed form result, Eq.(1), as more terms are added to the series, we disagree that this invalidates our interpretations. This is made clear by recognizing that the semiclassical expansion of COT, Eq.(2), has the exact same property of oscillating wildly as more terms are added. In spite of this, researchers have long agreed that each individual term in the semiclassical cross section can be interpreted physically; they …", "num_citations": "3\n", "authors": ["836"]}
{"title": "IPython: components for interactive and parallel computing across disciplines.\n", "abstract": " Scientific computing is an inherently exploratory activity that requires constantly cycling between code, data and results, each time adjusting the computations as new insights and questions arise. To support such a workflow, good interactive environments are critical. The IPython project (http://ipython. org) provides a rich architecture for interactive computing with: 1. Terminal-based and graphical interactive consoles. 2. A web-based Notebook system with support for code, text, mathematical expressions, inline plots and other rich media. 3. Easy to use, high performance tools for parallel computing. Despite its roots in Python, the IPython architecture is designed in a language-agnostic way to facilitate interactive computing in any language. This allows users to mix Python with Julia, R, Octave, Ruby, Perl, Bash and more, as well as to develop native clients in other languages that reuse the IPython clients. In this talk, I …", "num_citations": "1\n", "authors": ["836"]}