{"title": "A randomized trial of vertebroplasty for osteoporotic spinal fractures\n", "abstract": " Background Vertebroplasty is commonly used to treat painful, osteoporotic vertebral compression fractures.   Methods In this multicenter trial, we randomly assigned 131 patients who had one to three painful osteoporotic vertebral compression fractures to undergo either vertebroplasty or a simulated procedure without cement (control group). The primary outcomes were scores on the modified Roland–Morris Disability Questionnaire (RDQ) (on a scale of 0 to 23, with higher scores indicating greater disability) and patients' ratings of average pain intensity during the preceding 24 hours at 1 month (on a scale of 0 to 10, with higher scores indicating more severe pain). Patients were allowed to cross over to the other study group after 1 month.   Results All patients underwent the assigned intervention (68 vertebroplasties and 63 simulated procedures). The baseline characteristics were similar in the two groups. At 1 …", "num_citations": "1606\n", "authors": ["2089"]}
{"title": "Expenditures and health status among adults with back and neck problems\n", "abstract": " ContextBack and neck problems are among the symptoms most commonly encountered in clinical practice. However, few studies have examined national trends in expenditures for back and neck problems or related these trends to health status measures.ObjectivesTo estimate inpatient, outpatient, emergency department, and pharmacy expenditures related to back and neck problems in the United States from 1997 through 2005 and to examine associated trends in health status.Design and SettingAge- and sex-adjusted analysis of the nationally representative Medical Expenditure Panel Survey (MEPS) from 1997 to 2005 using complex survey regression methods. The MEPS is a household survey of medical expenditures weighted to represent national estimates. Respondents were US adults (> 17 years) who self-reported back and neck problems (referred to as “spine problems” based on MEPS descriptions …", "num_citations": "1596\n", "authors": ["2089"]}
{"title": "Systematic literature review of imaging features of spinal degeneration in asymptomatic populations\n", "abstract": " BACKGROUND AND PURPOSE: Degenerative changes are commonly found in spine imaging but often occur in pain-free individuals as well as those with back pain. We sought to estimate the prevalence, by age, of common degenerative spine conditions by performing a systematic review studying the prevalence of spine degeneration on imaging in asymptomatic individuals.MATERIALS AND METHODS: We performed a systematic review of articles reporting the prevalence of imaging findings (CT or MR imaging) in asymptomatic individuals from published English literature through April 2014. Two reviewers evaluated each manuscript. We selected age groupings by decade (20, 30, 40, 50, 60, 70, 80 years), determining age-specific prevalence estimates. For each imaging finding, we fit a generalized linear mixed-effects model for the age-specific prevalence estimate clustering in the study, adjusting for the …", "num_citations": "779\n", "authors": ["2089"]}
{"title": "Reoperation rates following lumbar spine surgery and the influence of spinal fusion procedures\n", "abstract": " Study Design.Retrospective cohort study using a hospital discharge registry of all nonfederal acute care hospitals in Washington state.Objectives.To determine the cumulative incidence of reoperation following lumbar surgery for degenerative disease and, for specific diagnoses, to compare the frequency of reoperation following fusion with that following decompression alone.Summary of Background Data.Repeat lumbar spine operations are generally undesirable, implying persistent symptoms, progression of degenerative changes, or treatment complications. Compared to decompression alone, spine fusion is commonly viewed as a stabilizing treatment that may reduce the need for additional surgery. However, indications for fusion surgery in degenerative spine disorders remain controversial, and the effects of fusion on reoperation rates are unclear.Methods.Adults who underwent inpatient lumbar surgery for …", "num_citations": "454\n", "authors": ["2089"]}
{"title": "Trends in health care expenditures, utilization, and health status among US adults with spine problems, 1997–2006\n", "abstract": " Study Design.Analysis of nationally representative survey data for spine-related health care expenditures, utilization and self-reported health status.Objective.To study trends from 1997 to 2006 in per-user expenditures for spine-related inpatient, outpatient, pharmacy, and emergency services; and to compare these trends to changes in health status.Summary of Background Data.Although prior work has shown overall spine-related expenditures accounted for $86 billion in 2005, increasing 65% since 1997, the study did not report per-user expenditures. Understanding population-level per-user expenditure for specific services relative to changes in the health status may help assess the value of these services.Methods.We analyzed data from the Medical Expenditure Panel Survey, a multistage survey sample designed to produce unbiased national estimates of health care utilization and expenditure. Spine-related …", "num_citations": "421\n", "authors": ["2089"]}
{"title": "A randomized trial of epidural glucocorticoid injections for spinal stenosis\n", "abstract": " Background Epidural glucocorticoid injections are widely used to treat symptoms of lumbar spinal stenosis, a common cause of pain and disability in older adults. However, rigorous data are lacking regarding the effectiveness and safety of these injections.   Methods In a double-blind, multisite trial, we randomly assigned 400 patients who had lumbar central spinal stenosis and moderate-to-severe leg pain and disability to receive epidural injections of glucocorticoids plus lidocaine or lidocaine alone. The patients received one or two injections before the primary outcome evaluation, performed 6 weeks after randomization and the first injection. The primary outcomes were the score on the Roland–Morris Disability Questionnaire (RMDQ, in which scores range from 0 to 24, with higher scores indicating greater physical disability) and the rating of the intensity of leg pain (on a scale from 0 to 10, with 0 indicating no …", "num_citations": "327\n", "authors": ["2089"]}
{"title": "A systematic literature review of magnetic resonance spectroscopy for the characterization of brain tumors\n", "abstract": " BACKGROUND AND PURPOSE: Proton MR spectroscopy (1H-MR spectroscopy) is a potentially useful adjunct to anatomic MR imaging in the characterization of brain tumors. We performed an updated systematic review of the evidence.METHODS: We employed a standardized search strategy to find studies published during 2002–2004. We reviewed studies measuring diagnostic accuracy and diagnostic, therapeutic, or health impact of 1H-MR spectroscopy. We abstracted information on study design, 1H-MR spectroscopy technique, and methodologic quality. We categorized studies into 5 subgroups: (1) metastasis versus high-grade tumor; (2) high-versus low-grade tumor; (3) recurrent tumor versus radiation necrosis; (4) tumor extent; and (5) tumor versus non-neoplastic lesion.RESULTS: We identified 26 studies evaluating diagnostic performance, diagnostic impact, or therapeutic impact. No articles evaluated …", "num_citations": "284\n", "authors": ["2089"]}
{"title": "Population-based trends in volumes and rates of ambulatory lumbar spine surgery\n", "abstract": " Study Design.Sequential cross-sectional study.Objectives.To quantify patterns of outpatient lumbar spine surgery.Summary of Background Data.Outpatient lumbar spine surgery patterns are undocumented.Methods.We used CPT-4 and ICD-9-CM diagnosis/procedure codes to identify lumbar spine operations in 20+ year olds. We combined sample volume estimates from the National Hospital Discharge Survey (NHDS), the National Survey of Ambulatory Surgery (NSAS), and the Healthcare Cost and Utilization Project (HCUP) Nationwide Inpatient Sample (NIS) with complete case counts from HCUP's State Inpatient Databases (SIDs) and State Ambulatory Surgery Databases (SASDs) for four geographically diverse states. We excluded pregnant patients and those with vertebral fractures, cancer, trauma, or infection. We calculated age-and sex-adjusted rates.Results.Ambulatory cases comprised 4% to 13% of …", "num_citations": "276\n", "authors": ["2089"]}
{"title": "Surgery versus non-surgical therapy for carpal tunnel syndrome: a randomised parallel-group trial\n", "abstract": " BackgroundA previous randomised controlled trial reported greater efficacy of surgery than of splinting for patients with carpal tunnel syndrome. Our aim was to compare surgical versus multi-modality, non-surgical treatment for patients with carpal tunnel syndrome without denervation. We hypothesised that surgery would result in improved functional and symptom outcomes.MethodsIn this parallel-group randomised controlled trial, we randomly assigned 116 patients from eight academic and private practice centres, using computer-generated random allocation stratified by site, to carpal tunnel surgery (n=57) or to a well-defined, non-surgical treatment (including hand therapy and ultrasound; n=59). The primary outcome was hand function measured by the Carpal Tunnel Syndrome Assessment Questionnaire (CTSAQ) at 12 months assessed by research personnel unaware of group assignment. Analysis was by …", "num_citations": "230\n", "authors": ["2089"]}
{"title": "Safety and efficacy of video-assisted retroperitoneal debridement for infected pancreatic collections: a multicenter, prospective, single-arm phase 2 study\n", "abstract": " BackgroundThe feasibility of video-assisted retroperitoneal debridement (VARD) for infected pancreatic walled-off necrosis is established. We provide prospective data on the safety and efficacy of VARD.DesignMulticenter, prospective, single-arm phase 2 study.SettingSix academic medical centers.PatientsWe evaluated 40 patients with pancreatic necrosis who had infection determined using Gram stain or culture.InterventionsPercutaneous drains were placed at enrollment, and computed tomographic scans were repeated at 10 days. Patients who had more than a 75% reduction in collection size were treated with drains. Other patients were treated with VARD. Crossover to open surgery was performed for technical reasons and/or according to surgeon judgment.Main Outcome MeasuresEfficacy (ie, successful VARD treatment without crossover to open surgery or death) and safety (based on mortality and …", "num_citations": "224\n", "authors": ["2089"]}
{"title": "Are lumbar spine reoperation rates falling with greater use of fusion surgery and new surgical technology?\n", "abstract": " Study Design.A retrospective analysis of population-based hospital discharge registry from all nonfederal acute care hospitals in Washington State.Objective.We examined the cumulative incidence of second lumbar spine operation following an initial lumbar operation for degenerative conditions. We aimed to determine if the cumulative incidence of a second lumbar spine operation decreased in the 1990s following an increase in the rate of fusion surgery and the introduction of several newer fusion technologies.Summary of Background Data.Repeat lumbar spine operations are generally undesirable, implying persistent symptoms, progression of degenerative changes, or treatment complications. Improved technology is expected to improve alignment, healing, and instability, and to reduce repeat operations.Methods.Among the patients who had an inpatient lumbar decompression or lumbar fusion surgery for …", "num_citations": "179\n", "authors": ["2089"]}
{"title": "Pilot randomized controlled trial of web-based acceptance and commitment therapy for smoking cessation\n", "abstract": " Objective:           Web-based smoking cessation interventions have high reach, but low effectiveness. To address this problem, we conducted a pilot randomized controlled trial of the first web-based acceptance and commitment therapy (ACT) intervention for smoking cessation. The aims were to determine design feasibility, user receptivity, effect on 30-day point prevalence quit rate at 3 months post-randomization, and mediation by ACT theory-based processes of acceptance.                             Methods:           Adult participants were recruited nationally into the double-blind randomized controlled pilot trial (N = 222), which compared web-based ACT for smoking cessation (WebQuit.org) with the National Cancer Institute’s Smokefree.gov—the U.S. national standard for web-based smoking cessation interventions.                             Results:           We recruited 222 participants in 10 weeks. Participants spent …", "num_citations": "175\n", "authors": ["2089"]}
{"title": "High-dose erythropoietin and hypothermia for hypoxic-ischemic encephalopathy: a phase II trial\n", "abstract": " OBJECTIVE: To determine if multiple doses of erythropoietin (Epo) administered with hypothermia improve neuroradiographic and short-term outcomes of newborns with hypoxic-ischemic encephalopathy.METHODS: In a phase II double-blinded, placebo-controlled trial, we randomized newborns to receive Epo (1000 U/kg intravenously; n = 24) or placebo (n = 26) at 1, 2, 3, 5, and 7 days of age. All infants had moderate/severe encephalopathy; perinatal depression (10 minute Apgar <5, pH <7.00 or base deficit ≥15, or resuscitation at 10 minutes); and received hypothermia. Primary outcome was neurodevelopment at 12 months assessed by the Alberta Infant Motor Scale and Warner Initial Developmental Evaluation. Two independent observers rated MRI brain injury severity by using an established scoring system.RESULTS: The mean age at first study drug was 16.5 hours (SD, 5.9). Neonatal deaths did not …", "num_citations": "172\n", "authors": ["2089"]}
{"title": "The relationship between electrodiagnostic findings and patient symptoms and function in carpal tunnel syndrome\n", "abstract": " Chan L, Turner JA, Comstock BA, Levenson LM, Hollingworth W, Heagerty PJ, Kliot M, Jarvik JG. The relationship between electrodiagnostic findings and patient symptoms and function in carpal tunnel syndrome.ObjectiveTo examine whether, in patients with carpal tunnel syndrome (CTS), electrodiagnostic study findings were associated with patient symptom severity and functional limitations after controlling for potentially confounding variables including depression, somatization, and pain-related catastrophizing.DesignCross-sectional design including data from 2 ongoing CTS studies.SettingPatients enrolled from hospitals and clinics in Washington State between October 2002 and February 2006.ParticipantsAdults with CTS (N=215) (based on symptoms and abnormal electrodiagnostic findings) were analyzed. Exclusion criteria were any mass, tumor, severe trauma, or deformity in the hand or wrist …", "num_citations": "161\n", "authors": ["2089"]}
{"title": "Crowd-sourced assessment of technical skills: a novel method to evaluate surgical performance\n", "abstract": " BackgroundValidated methods of objective assessments of surgical skills are resource intensive. We sought to test a web-based grading tool using crowdsourcing called Crowd-Sourced Assessment of Technical Skill.Materials and methodsInstitutional Review Board approval was granted to test the accuracy of Amazon.com's Mechanical Turk and Facebook crowdworkers compared with experienced surgical faculty grading a recorded dry-laboratory robotic surgical suturing performance using three performance domains from a validated assessment tool. Assessor free-text comments describing their rating rationale were used to explore a relationship between the language used by the crowd and grading accuracy.ResultsOf a total possible global performance score of 3–15, 10 experienced surgeons graded the suturing video at a mean score of 12.11 (95% confidence interval [CI], 11.11–13.11). Mechanical Turk …", "num_citations": "146\n", "authors": ["2089"]}
{"title": "The impact of e-prescribing on prescriber and staff time in ambulatory care clinics: a time–motion study\n", "abstract": " Electronic prescribing has improved the quality and safety of care. One barrier preventing widespread adoption is the potential detrimental impact on workflow. We used time-motion techniques to compare prescribing times at three ambulatory care sites that used paper-based prescribing, desktop, or laptop e-prescribing. An observer timed all prescriber (n = 27) and staff (n = 42) tasks performed during a 4-hour period. At the sites with optional e-prescribing >75% of prescription-related events were performed electronically. Prescribers at e-prescribing sites spent less time writing, but time-savings were offset by increased computer tasks. After adjusting for site, prescriber and prescription type, e-prescribing tasks took marginally longer than hand written prescriptions (12.0 seconds; −1.6, 25.6 CI). Nursing staff at the e-prescribing sites spent longer on computer tasks (5.4 minutes/hour; 0.0, 10.7 CI). E-prescribing …", "num_citations": "143\n", "authors": ["2089"]}
{"title": "Effectiveness of vertebroplasty using individual patient data from two randomised placebo controlled trials: meta-analysis\n", "abstract": " Objective To determine whether vertebroplasty is more effective than placebo for patients with pain of recent onset (≤6 weeks) or severe pain (score ≥8 on 0-10 numerical rating scale).Design Meta-analysis of combined individual patient level data.Setting Two multicentred randomised controlled trials of vertebroplasty; one based in Australia, the other in the United States.Participants 209 participants (Australian trial n=78, US trial n=131) with at least one radiographically confirmed vertebral compression fracture. 57 (27%) participants had pain of recent onset (vertebroplasty n=25, placebo n=32) and 99 (47%) had severe pain at baseline (vertebroplasty n=50, placebo n=49).Intervention Percutaneous vertebroplasty versus a placebo procedure.Main outcome measure Scores for pain (0-10 scale) and function (modified, 23 item Roland-Morris disability questionnaire) at one month.Results For participants with pain …", "num_citations": "139\n", "authors": ["2089"]}
{"title": "Association of early imaging for back pain with clinical outcomes in older adults\n", "abstract": " ImportanceIn contrast to the recommendations for younger adults, many guidelines allow for older adults with back pain to undergo imaging without waiting 4 to 6 weeks. However, early imaging may precipitate interventions that do not improve outcomes.ObjectiveTo compare function and pain at the 12-month follow-up visit among older adults who received early imaging with those who did not receive early imaging after a new primary care visit for back pain without radiculopathy.Design, Setting, and ParticipantsProspective cohort of 5239 patients 65 years or older with a new primary care visit for back pain (2011-2013) in 3 US health care systems. We matched controls 1:1 using propensity score matching of demographic and clinical characteristics, including diagnosis, pain severity, pain duration, functional status, and prior resource use.ExposuresDiagnostic imaging (plain films, computed tomography [CT …", "num_citations": "133\n", "authors": ["2089"]}
{"title": "A randomized trial of erythropoietin for neuroprotection in preterm infants\n", "abstract": " Background High-dose erythropoietin has been shown to have a neuroprotective effect in preclinical models of neonatal brain injury, and phase 2 trials have suggested possible efficacy; however, the benefits and safety of this therapy in extremely preterm infants have not been established.   Methods In this multicenter, randomized, double-blind trial of high-dose erythropoietin, we assigned 941 infants who were born at 24 weeks 0 days to 27 weeks 6 days of gestation to receive erythropoietin or placebo within 24 hours after birth. Erythropoietin was administered intravenously at a dose of 1000 U per kilogram of body weight every 48 hours for a total of six doses, followed by a maintenance dose of 400 U per kilogram three times per week by subcutaneous injection through 32 completed weeks of postmenstrual age. Placebo was administered as intravenous saline followed by sham injections. The primary outcome …", "num_citations": "121\n", "authors": ["2089"]}
{"title": "Spinal cord stimulation for failed back surgery syndrome: outcomes in a workers’ compensation setting\n", "abstract": " Questions remain concerning effectiveness and risks of spinal cord stimulation (SCS) for chronic back and leg pain after spine surgery (“failed back surgery syndrome” [FBSS]). This prospective, population-based controlled cohort study evaluated outcomes of workers’ compensation recipients with FBSS who received at least a trial of SCS (SCS group, n = 51) versus those who (1) were evaluated at a multidisciplinary pain clinic and did not receive SCS (Pain Clinic, n = 39) or (2) received neither SCS nor pain clinic evaluation (Usual Care, n = 68). Patients completed measures of pain, function, medication use, and work status at baseline and 6, 12, and 24 months later. We also examined work time loss compensation over 24 months. Few (<10%) patients in any group achieved success at any follow-up on the composite primary outcome encompassing less than daily opioid use and improvement in leg pain and …", "num_citations": "104\n", "authors": ["2089"]}
{"title": "INvestigational Vertebroplasty Efficacy and Safety Trial (INVEST): a randomized controlled trial of percutaneous vertebroplasty\n", "abstract": " The treatment of painful osteoporotic vertebral compression fractures has historically been limited to several weeks of bed rest, anti-inflammatory and analgesic medications, calcitonin injections, or external bracing. Percutaneous vertebroplasty (the injection of bone cement into the fractured vertebral body) is a relatively new procedure used to treat these fractures. There is increasing interest to examine the efficacy and safety of percutaneous vertebroplasty and to study the possibility of a placebo effect or whether the pain relief is from local anesthetics placed directly on the bone during the vertebroplasty procedure. Our goal is to test the hypothesis that patients with painful osteoporotic vertebral compression fractures who undergo vertebroplasty have less disability and pain at 1 month than patients who undergo a control intervention. The control intervention is placement of local anesthesia near the fracture, without …", "num_citations": "97\n", "authors": ["2089"]}
{"title": "A randomized trial comparing antibiotics with appendectomy for appendicitis\n", "abstract": " Background Antibiotic therapy has been proposed as an alternative to surgery for the treatment of appendicitis.   Methods We conducted a pragmatic, nonblinded, noninferiority, randomized trial comparing antibiotic therapy (10-day course) with appendectomy in patients with appendicitis at 25 U.S. centers. The primary outcome was 30-day health status, as assessed with the European Quality of Life–5 Dimensions (EQ-5D) questionnaire (scores range from 0 to 1, with higher scores indicating better health status; noninferiority margin, 0.05 points). Secondary outcomes included appendectomy in the antibiotics group and complications through 90 days; analyses were prespecified in subgroups defined according to the presence or absence of an appendicolith.   Results In total, 1552 adults (414 with an appendicolith) underwent randomization; 776 were assigned to receive antibiotics (47% of whom were not …", "num_citations": "96\n", "authors": ["2089"]}
{"title": "Plasma biomarkers of brain injury in neonatal hypoxic-ischemic encephalopathy\n", "abstract": " ObjectivesTo evaluate plasma brain specific proteins and cytokines as biomarkers of brain injury in newborns with hypoxic-ischemic encephalopathy (HIE) and, secondarily, to assess the effect of erythropoietin (Epo) treatment on the relationship between biomarkers and outcomes.Study designA study of candidate brain injury biomarkers was conducted in the context of a phase II multicenter randomized trial evaluating Epo for neuroprotection in HIE. Plasma was collected at baseline (<24 hours) and on day 5. Brain injury was assessed by magnetic resonance imaging (MRI) and neurodevelopmental assessments at 1 year. The relationships between Epo, brain-specific proteins (S100B, ubiquitin carboxy-terminal hydrolase-L1 [UCH-L1], total Tau, neuron specific enolase), cytokines (interleukin [IL]-1β, IL-6, IL-8, IL-10, IL-12P70, IL-13, interferon-gamma [IFN-γ], tumor necrosis factor alpha [TNF-α], brain-derived …", "num_citations": "94\n", "authors": ["2089"]}
{"title": "Measuring to improve: peer and crowd-sourced assessments of technical skill with robot-assisted radical prostatectomy\n", "abstract": " Because surgical skill may be a key determinant of patient outcomes, there is growing interest in skill assessment. In the Michigan Urological Surgery Improvement Collaborative (MUSIC), we assessed whether peer and crowd-sourced (ie, layperson) video review of robot-assisted radical prostatectomy (RARP) could distinguish technical skill among practicing surgeons. A total of 76 video clips from 12 MUSIC surgeons consisted of one of four parts of RARP and underwent blinded review by MUSIC peer surgeons and prequalified crowd-sourced reviewers. Videos were rated for global skill (Global Evaluation Assessment of Robotic Skills) and procedure-specific skill (Robotic Anastomosis and Competency Evaluation). We fit linear mixed-effects models to estimate mean peer and crowd ratings for each video. Individual video ratings were aggregated to calculate surgeon skill scores. Peers (n = 25) completed 351 …", "num_citations": "93\n", "authors": ["2089"]}
{"title": "The prognosis for improvement in comfort and function after the ream-and-run arthroplasty for glenohumeral arthritis: an analysis of 176 consecutive cases\n", "abstract": " Background:Knowledge of the factors affecting the prognosis for improvement in function and comfort with time after shoulder arthroplasty is important to clinical decision-making. This study sought to identify some of these factors in 176 consecutive patients undergoing the ream-and-run procedure.Methods:The time course for improvement in patient function and comfort was determined for the entire group as well as for subsets by sex, age, diagnosis, preoperative function, and surgery date. Patients having repeat surgery were analyzed in detail.Results:Shoulder comfort and function increased progressively after the ream-and-run procedure, reaching a steady state by approximately twenty months. The shoulders in 124 patients with at least two years of follow-up were improved by a minimal clinically important difference. The shoulders in sixteen patients with at least two years of follow-up were not improved by the …", "num_citations": "88\n", "authors": ["2089"]}
{"title": "Evaluation of vertebroplasty with a validated outcome measure: the Roland-Morris Disability Questionnaire\n", "abstract": " BACKGROUND AND PURPOSE: Vertebroplasty is rapidly disseminating as a treatment for vertebral compression fractures, but its efficacy has not been assessed with a well-validated, back pain–specific instrument. We report the use of the Roland-Morris Disability Questionnaire (RDQ) in patients undergoing vertebroplasty for painful osteoporotic compression fractures.METHODS: Retrospective review of patients treated with vertebroplasty who completed the RDQ and 2 verbal pain scales (0–10) for pain at rest and pain with activity at baseline, 1 week, 1 month, 6 months, and 1 year post-vertebroplasty. Changes in outcome measures were analyzed by using a paired t test and correlations were assessed with Spearman ρ. Multiple linear regression was used to analyze the relationship between baseline scores and independent variables.RESULTS: One hundred thirteen patients were treated at 164 vertebral …", "num_citations": "80\n", "authors": ["2089"]}
{"title": "Systemic effects of epidural steroid injections for spinal stenosis\n", "abstract": " This analysis of the lumbar epidural steroid injections for spinal stenosis multicenter randomized controlled trial data identifies the degree of and risk factors for cortisol suppression after epidural steroid injections in older adults with spinal stenosis. Four hundred patients aged 50 years and older with back or leg pain and central lumbar spinal stenosis completed baseline demographic and psychosocial measures. Morning serum cortisol levels were measured at baseline and 3 weeks after initial injection. Patients were randomized to receive epidural injections of either local anesthetic with corticosteroid (n 5 200) or local anesthetic only (n 5 200). The specific corticosteroid was chosen at the treating physician’s discretion (methylprednisolone, betamethasone, triamcinolone, or dexamethasone). Thirty-two patients (20.3%) treated with corticosteroid experienced cortisol reduction at 3 weeks of. 50% compared with 10 …", "num_citations": "72\n", "authors": ["2089"]}
{"title": "Magnetic resonance imaging compared with electrodiagnostic studies in patients with suspected carpal tunnel syndrome: predicting symptoms, function, and surgical benefit at 1 year\n", "abstract": " Object The goal in this study of patients with clinical carpal tunnel syndrome (CTS) was to compare the usefulness of magnetic resonance (MR) imaging with that of electrodiagnostic studies (EDSs) for the following purposes: 1) prediction of 1-year outcomes and 2) identification of patients who are likely to benefit from surgical treatment.  Methods The authors prospectively enrolled 120 patients with clinically suspected CTS. The participants were tested using standardized EDSs, MR imaging, and a battery of questionnaires, including the Carpal Tunnel Syndrome Assessment Questionnaire, a well-validated 5-point score of symptoms and function. The EDSs and MR images were each interpreted independently. Patients were reevaluated after 1 year. The decision to treat patients conservatively or by carpal tunnel release was made by the individual surgeon, who had access to the initial EDS but not MR imaging …", "num_citations": "70\n", "authors": ["2089"]}
{"title": "High-Dose erythropoietin for asphyxia and encephalopathy (heal): a randomized controlled trial–background, aims, and study protocol\n", "abstract": " Background: Hypoxic-ischemic encephalopathy (HIE) remains an important cause of neonatal death and frequently leads to significant long-term disability in survivors. Therapeutic hypothermia, while beneficial, still leaves many treated infants with lifelong disabilities. Adjunctive therapies are needed, and erythropoietin (Epo) has the potential to provide additional neuroprotection. Objectives: The aim of this study was to review the current incidence, mechanism of injury, and sequelae of HIE, and to describe a new phase III randomized, placebo-controlled trial of Epo neuroprotection in term and near-term infants with moderate to severe HIE treated with therapeutic hypothermia. Methods: This article presents an overview of HIE, neuroprotective functions of Epo, and the design of a double-blind, placebo-controlled, multicenter trial of high-dose Epo administration, enrolling 500 neonates≥ 36 weeks of gestation with …", "num_citations": "69\n", "authors": ["2089"]}
{"title": "Interrater reliability in assessing quality of diagnostic accuracy studies using the QUADAS tool: a preliminary assessment\n", "abstract": " Rationale and ObjectivesQuality Assessment of Diagnostic Accuracy Studies (QUADAS) is a new tool to measure the methodological quality of diagnostic accuracy studies in systematic reviews. We used data from a systematic review of magnetic resonance spectroscopy (MRS) in the characterization of suspected brain tumors to provide a preliminary evaluation of the inter-rater reliability of QUADAS.Materials and MethodsA structured literature search identified 19 diagnostic accuracy studies. These publications were distributed randomly to primary and secondary reviewers for dual independent assessment. Reviewers recorded methodological quality by using QUADAS on a custom-designed spreadsheet. We calculated correlation, percentage of agreement, and κ statistic to assess inter-rater reliability.ResultsMost studies in our review were judged to have used an accurate reference standard. Conversely, the …", "num_citations": "69\n", "authors": ["2089"]}
{"title": "Overcoming recruitment challenges of web-based interventions for tobacco use: the case of web-based acceptance and commitment therapy for smoking cessation\n", "abstract": " Web-based behavioral interventions for substance use are being developed at a rapid pace, yet there is a dearth of information regarding the most effective methods for recruiting participants into web-based intervention trials. In this paper, we describe our successful recruitment of participants into a pilot trial of web-based Acceptance and Commitment Therapy (ACT) for smoking cessation and compare traditional and web-based methods of recruitment in terms of their effects on baseline participant characteristics, association with study retention and treatment outcome, yield, and cost-effectiveness. Over a 10-week period starting June 15, 2010, we recruited 222 smokers for a web-based smoking cessation study using a variety of recruitment methods. The largest portion of randomized participants were recruited through Google AdWords (36%), followed by medical Internet media (23%), standard media (14 …", "num_citations": "67\n", "authors": ["2089"]}
{"title": "Costs and cost-effectiveness of spinal cord stimulation (SCS) for failed back surgery syndrome: an observational study in a workers' compensation population\n", "abstract": " Study Design.Prospective cohort study.Objective.We estimated the cost-effectiveness of spinal cord stimulation (SCS) among workers' compensation recipients with failed back surgery syndrome (FBSS).Summary of Background Data.Randomized controlled trial (RCT) evidence suggests that SCS is more effective at 6 months than medical management for patients with FBSS. However, procedure costs are high and workers' compensation claimants often have worse outcomes than other patients.Methods.We enrolled 158 FBSS patients receiving workers' compensation into three treatment groups: trial SCS with or without permanent device implant (n= 51), pain clinic (PC) evaluation with or without treatment (n= 39), and usual care (UC; n= 68). The primary outcome was a composite measure of pain, disability and opioid medication use. As reported previously, 5% of SCS patients, 3% of PC patients and 10% of UC …", "num_citations": "66\n", "authors": ["2089"]}
{"title": "Crowd-sourced assessment of technical skill: a valid method for discriminating basic robotic surgery skills\n", "abstract": " Background: A surgeon's skill in the operating room has been shown to correlate with a patient's clinical outcome. The prompt accurate assessment of surgical skill remains a challenge, in part, because expert faculty reviewers are often unavailable. By harnessing the power of large readily available crowds through the Internet, rapid, accurate, and low-cost assessments may be achieved. We hypothesized that assessments provided by crowd workers highly correlate with expert surgeons' assessments. Materials and Methods: A group of 49 surgeons from two hospitals performed two dry-laboratory robotic surgical skill assessment tasks. The performance of these tasks was video recorded and posted online for evaluation using Amazon Mechanical Turk. The surgical tasks in each video were graded by (n=30) varying crowd workers and (n=3) experts using a modified global evaluative assessment of Robotic Skills …", "num_citations": "65\n", "authors": ["2089"]}
{"title": "Neuroprotective potential of erythropoietin in neonates; design of a randomized trial\n", "abstract": " In 2013, nearly four million babies were born in the U.S., among whom 447,875 were born preterm. Approximately 30,000 of these infants were born before 28 weeks of gestation. These infants, termed Extremely Low Gestational Age Neonates (ELGANs), experience high morbidity and mortality despite modern therapies: approximately 20 % of ELGANs admitted to an NICU die before discharge, 20 % of survivors have severe, and 20 % moderate neurodevelopmental impairment (NDI). New approaches are needed to improve neonatal outcomes. Recombinant erythropoietin (Epo) is a promising neuroprotective agent that is widely available, affordable, and has been used safely in neonates to stimulate erythropoiesis. There are extensive preclinical data to support its use as a neuroprotective intervention: Epo promotes normal brain maturation by increasing neurogenesis, angiogenesis, and by protecting oligodendrocytes. Epo also decreases acute brain injury following hypoxia ischemia by decreasing inflammation, oxidative and excitotoxic injury, resulting in decreased apoptosis. Despite the availability of both preclinical and safety data there has not been a definitive clinical evaluation of the benefit of Epo, and a large phase III trial is necessary to provide evidence to support potential changes in practice guidelines. We first review the preclinical data motivating further clinical trials, and then describe in detail the design of the PENUT study (Preterm Epo Neuroprotection). PENUT is a phase III study evaluating the effect of neonatal Epo treatment on the combined outcome of death or severe NDI among ELGANS. 940 subjects will be randomized …", "num_citations": "64\n", "authors": ["2089"]}
{"title": "What factors are predictive of patient-reported outcomes? A prospective study of 337 shoulder arthroplasties\n", "abstract": " Background                 Although shoulder arthroplasties generally are effective in improving patients’ comfort and function, the results are variable for reasons that are not well understood.                                               Questions/Purposes                 We posed two questions: (1) What factors are associated with better 2-year outcomes after shoulder arthroplasty? (2) What are the sensitivities, specificities, and positive and negative predictive values of a multivariate predictive model for better outcome?                                               Methods                 Three hundred thirty-nine patients having a shoulder arthroplasty (hemiarthroplasty, arthroplasty for cuff tear arthropathy, ream and run arthroplasty, total shoulder or reverse total shoulder arthroplasty) between August 24, 2010 and December 31, 2012 consented to participate in this prospective study. Two patients were excluded because they were missing …", "num_citations": "63\n", "authors": ["2089"]}
{"title": "Major medical outcomes with spinal augmentation vs conservative therapy\n", "abstract": " ImportanceThe symptomatic benefits of spinal augmentation (vertebroplasty or kyphoplasty) for the treatment of osteoporotic vertebral compression fractures are controversial. Recent population-based studies using medical billing claims have reported significant reductions in mortality with spinal augmentation compared with conservative therapy, but in nonrandomized settings such as these, there is the potential for selection bias to influence results.ObjectiveTo compare major medical outcomes following treatment of osteoporotic vertebral fractures with spinal augmentation or conservative therapy. Additionally, we evaluate the role of selection bias using preprocedure outcomes and propensity score analysis.Design, Setting, and ParticipantsRetrospective cohort analysis of Medicare claims for the 2002-2006 period. We compared 30-day and 1-year outcomes in patients with newly diagnosed vertebral fractures …", "num_citations": "57\n", "authors": ["2089"]}
{"title": "Crowd-sourced assessment of technical skills for validation of basic laparoscopic urologic skills tasks\n", "abstract": " Purpose: The BLUS (Basic Laparoscopic Urologic Skills) consortium sought to address the construct validity of BLUS tasks and the wider problem of accurate, scalable and affordable skill evaluation by investigating the concordance of 2 novel candidate methods with faculty panel scores, those of automated motion metrics and crowdsourcing.Materials and Methods: A faculty panel of surgeons (5) and anonymous crowdworkers blindly reviewed a randomized sequence of a representative sample of 24 videos (12 pegboard and 12 suturing) extracted from the BLUS validation study (454) using the GOALS (Global Objective Assessment of Laparoscopic Skills) survey tool with appended pass-fail anchors via the same web based user interface. Pre-recorded motion metrics (tool path length, jerk cost etc) were available for each video. Cronbach’s alpha, Pearson’s R and ROC with AUC statistics were used to evaluate …", "num_citations": "55\n", "authors": ["2089"]}
{"title": "Trajectories of symptoms and function in older adults with low back disorders\n", "abstract": " Study Design. Prospective cohort study.  Objective. To determine whether there are distinct trajectories of back pain and function among older adults and to identify characteristics that distinguish among patients with substantially different prognoses. Summary of Background Data. Although the differential diagnosis and course of low back pain among older adults may differ from middle-aged adults, there is little evidence. Better understanding variability in recovery among older adults may help target patients for more intensive clinical interventions, plan resource use, and design clinical studies of more homogeneous patient groups.  Methods. Patients aged 65 years or older with a new episode of care for back pain were recruited at 3 geographically diverse sites. Patients completed pain intensity and Roland-Morris Disability measures at baseline and 3, 6, and 12 months later. We used latent class analysis to identify …", "num_citations": "53\n", "authors": ["2089"]}
{"title": "Crowd-sourced assessment of technical skills: an opportunity for improvement in the assessment of laparoscopic surgical skills\n", "abstract": " BackgroundObjective, unbiased assessment of surgical skills remains a challenge in surgical education. We sought to evaluate the feasibility and reliability of Crowd-Sourced Assessment of Technical Skills.MethodsSeven volunteer general surgery interns were given time for training and then testing, on laparoscopic peg transfer, precision cutting, and intracorporeal knot-tying. Six faculty experts (FEs) and 203 Amazon.com Mechanical Turk crowd workers (CWs) evaluated 21 deidentified video clips using the Global Objective Assessment of Laparoscopic Skills validated rating instrument.ResultsWithin 19 hours and 15 minutes we received 662 eligible ratings from 203 CWs and 126 ratings from 6 FEs over 10 days. FE video ratings were of borderline internal consistency (Krippendorff’s alpha = .55). FE ratings were highly correlated with CW ratings (Pearson’s correlation coefficient = .78, P < .001).ConclusionWe …", "num_citations": "52\n", "authors": ["2089"]}
{"title": "Genetic variation in the HLA region is associated with susceptibility to herpes zoster\n", "abstract": " Herpes zoster, commonly referred to as shingles, is caused by the varicella zoster virus (VZV). VZV initially manifests as chicken pox, most commonly in childhood, can remain asymptomatically latent in nerve tissues for many years and often re-emerges as shingles. Although reactivation may be related to immune suppression, aging and female sex, most inter-individual variability in re-emergence risk has not been explained to date. We performed a genome-wide association analyses in 22 981 participants (2280 shingles cases) from the electronic Medical Records and Genomics Network. Using Cox survival and logistic regression, we identified a genomic region in the combined and European ancestry groups that has an age of onset effect reaching genome-wide significance (P> 1.0× 10− 8). This region tags the non-coding gene HCP5 (HLA Complex P5) in the major histocompatibility complex. This gene is an …", "num_citations": "52\n", "authors": ["2089"]}
{"title": "Back pain in seniors: the Back pain Outcomes using Longitudinal Data (BOLD) cohort baseline data\n", "abstract": " Back pain represents a substantial burden globally, ranking first in a recent assessment among causes of years lived with disability. Though back pain is widely studied among working age adults, there are gaps with respect to basic descriptive epidemiology among seniors, especially in the United States. Our goal was to describe how pain, function and health-related quality of life vary by demographic and geographic factors among seniors presenting to primary care providers with new episodes of care for back pain. We examined baseline data from the Back pain Outcomes using Longitudinal Data (BOLD) registry, the largest inception cohort to date of seniors presenting to a primary care provider for back pain. The sample included 5,239 patients ≥ 65 years old with a new primary care visit for back pain at three integrated health systems (Northern California Kaiser-Permanente, Henry Ford Health System [Detroit …", "num_citations": "52\n", "authors": ["2089"]}
{"title": "Crowdsourcing: a valid alternative to expert evaluation of robotic surgery skills\n", "abstract": " BackgroundRobotic-assisted gynecologic surgery is common, but requires unique training. A validated assessment tool for evaluating trainees’ robotic surgery skills is Robotic-Objective Structured Assessments of Technical Skills.ObjectiveWe sought to assess whether crowdsourcing can be used as an alternative to expert surgical evaluators in scoring Robotic-Objective Structured Assessments of Technical Skills.Study DesignThe Robotic Training Network produced the Robotic-Objective Structured Assessments of Technical Skills, which evaluate trainees across 5 dry lab robotic surgical drills. Robotic-Objective Structured Assessments of Technical Skills were previously validated in a study of 105 participants, where dry lab surgical drills were recorded, de-identified, and scored by 3 expert surgeons using the Robotic-Objective Structured Assessments of Technical Skills checklist. Our methods-comparison study …", "num_citations": "51\n", "authors": ["2089"]}
{"title": "Social cognitive mediators of adolescent smoking cessation: results from a large randomized intervention trial.\n", "abstract": " Only one prior study has examined why adolescent smoking cessation interventions are effective. To address this understudied and important issue, we examined whether a large adolescent smoking cessation intervention trial's outcomes were mediated by social cognitive theory processes. In a randomized trial (N= 2,151), counselors proactively delivered a telephone intervention to senior year high school smokers. Mediators and smoking status were self-reported at 12-months postintervention eligibility (88.8% retention). At least 6-months abstinence was the outcome. Among all enrolled smokers, increased self-efficacy to resist smoking in (a) social and (b) stressful situations together statistically mediated 55.6% of the intervention's effect on smoking cessation (p<. 001). Among baseline daily smokers, increased self-efficacy to resist smoking in stressful situations statistically mediated 56.9% of the intervention's …", "num_citations": "50\n", "authors": ["2089"]}
{"title": "Study Protocol-Lumbar Epidural Steroid Injections for Spinal Stenosis (LESS): a double-blind randomized controlled trial of epidural steroid injections for lumbar spinal …\n", "abstract": " Lumbar spinal stenosis is one of the most common causes of low back pain among older adults and can cause significant disability. Despite its prevalence, treatment of spinal stenosis symptoms remains controversial. Epidural steroid injections are used with increasing frequency as a less invasive, potentially safer, and more cost-effective treatment than surgery. However, there is a lack of data to judge the effectiveness and safety of epidural steroid injections for spinal stenosis. We describe our prospective, double-blind, randomized controlled trial that tests the hypothesis that epidural injections with steroids plus local anesthetic are more effective than epidural injections of local anesthetic alone in improving pain and function among older adults with lumbar spinal stenosis. We will recruit up to 400 patients with lumbar central canal spinal stenosis from at least 9 clinical sites over 2 years. Patients with spinal …", "num_citations": "49\n", "authors": ["2089"]}
{"title": "Investigational vertebroplasty safety and efficacy trial (INVEST): patient-reported outcomes through 1 year\n", "abstract": " PurposeTo evaluate 1-year outcomes of the Investigational Vertebroplasty Safety and Efficacy Trial (INVEST), a blinded, randomized, controlled trial to investigate the effectiveness of percutaneous vertebroplasty in the treatment of osteoporotic vertebral compression fractures.Materials and MethodsPatients were enrolled at 11 sites in the United States, the United Kingdom, and Australia by using an institutional review board–approved protocol and HIPAA compliance, and all patients provided written informed consent. Patients were randomized to undergo vertebroplasty or a control procedure. After 1 month, patients were allowed to cross over and undergo the alternate procedure. Coprimary outcomes were patient-reported function, measured with the modified Roland-Morris Disability Questionnaire (RDQ), and pain (on a scale of one to 10) at 1 year. Intention-to-treat (ITT) and as-treated (AT) analyses were used to …", "num_citations": "47\n", "authors": ["2089"]}
{"title": "Study protocol: The back pain outcomes using longitudinal data (BOLD) registry\n", "abstract": " Back pain is one of the most important causes of functional limitation, disability, and utilization of health care resources for adults of all ages, but especially among older adults. Despite the high prevalence of back pain in this population, important questions remain unanswered regarding the comparative effectiveness of commonly used diagnostic tests and treatments in the elderly. The overall goal of the Back pain Outcomes using Longitudinal Data (BOLD) project is to establish a rich, sustainable registry to describe the natural history and evaluate prospectively the effectiveness, safety, and cost-effectiveness of interventions for patients 65 and older with back pain. BOLD is enrolling 5,000 patients ≥ 65 years old who present to a primary care physician with a new episode of back pain. We are recruiting study participants from three integrated health systems (Kaiser-Permanente Northern California, Henry Ford Health System in Detroit and Harvard Vanguard Medical Associates/ Harvard Pilgrim Health Care in Boston). Registry patients complete validated, standardized measures of pain, back pain-related disability, and health-related quality of life at enrollment and 3, 6 and 12 months later. We also have available for analysis the clinical and administrative data in the participating health systems’ electronic medical records. Using registry data, we will conduct an observational cohort study of early imaging compared to no early imaging among patients with new episodes of back pain. The aims are to: 1) identify predictors of early imaging and; 2) compare pain, functional outcomes, diagnostic testing and treatment utilization of patients who …", "num_citations": "46\n", "authors": ["2089"]}
{"title": "An effectiveness-implementation hybrid trial study protocol targeting posttraumatic stress disorder and comorbidity\n", "abstract": " Each year in the USA, 1.5–2.5 million Americans are so severely injured that they require inpatient hospitalization. Multiple conditions including posttraumatic stress disorder (PTSD), alcohol and drug use problems, depression, and chronic medical conditions are endemic among physical trauma survivors with and without traumatic brain injuries. The trauma survivors outcomes and support (TSOS) effectiveness-implementation hybrid trial is designed to test the delivery of high-quality screening and intervention for PTSD and comorbidities across 24 US level I trauma center sites. The pragmatic trial aims to recruit 960 patients. The TSOS investigation employs a stepped wedge cluster randomized design in which sites are randomized sequentially to initiate the intervention. Patients identified by a 10-domain electronic health record screen as high risk for PTSD are formally assessed with the PTSD Checklist for study entry. Patients randomized to the intervention condition will receive stepped collaborative care, while patients randomized to the control condition will receive enhanced usual care. The intervention training begins with a 1-day on-site workshop in the collaborative care intervention core elements that include care management, medication, cognitive behavioral therapy, and motivational-interviewing elements targeting PTSD and comorbidity. The training is followed by site supervision from the study team. The investigation aims to determine if intervention patients demonstrate significant reductions in PTSD and depressive symptoms, suicidal ideation, alcohol consumption, and improvements in physical function when compared to control …", "num_citations": "43\n", "authors": ["2089"]}
{"title": "One-year outcomes of surgical versus nonsurgical treatments for discogenic back pain: a community-based prospective cohort study\n", "abstract": " Background contextThe clinical entity “discogenic back pain” remains controversial at fundamental levels, including its pathophysiology, diagnostic criteria, and optimal treatment. This is true despite availability of four randomized trials comparing the efficacy of surgical and nonsurgical treatments. One trial showed benefit for lumbar fusion compared with unstructured nonoperative care, and three others showed roughly similar results for lumbar surgery and structured rehabilitation.PurposeTo compare outcomes of community-based surgical and nonsurgical treatments for patients with chronic back pain attributed to degeneration at one or two lumbar disc levels.DesignProspective observational cohort study.Patient samplePatients presenting with axial back pain to academic and private practice orthopedic surgeons and neurosurgeons in a large metropolitan area.Outcome measuresRoland-Morris back disability …", "num_citations": "41\n", "authors": ["2089"]}
{"title": "Rationale and design of a trial of sertraline vs. cognitive behavioral therapy for end-stage renal disease patients with depression (ASCEND)\n", "abstract": " Major Depressive Disorder (MDD) is highly prevalent in patients with End Stage Renal Disease (ESRD) treated with maintenance hemodialysis (HD). Despite the high prevalence and robust data demonstrating an independent association between depression and poor clinical and patient-reported outcomes, MDD is under-treated when identified in such patients. This may in part be due to the paucity of evidence confirming the safety and efficacy of treatments for depression in this population. It is also unclear whether HD patients are interested in receiving treatment for depression. ASCEND (Clinical Trials Identifier Number NCT02358343), A Trial of Sertraline vs. Cognitive Behavioral Therapy (CBT) for End-stage Renal Disease Patients with Depression, was designed as a multi-center, 12-week, open-label, randomized, controlled trial of prevalent HD patients with comorbid MDD or dysthymia. It will compare (1) a …", "num_citations": "40\n", "authors": ["2089"]}
{"title": "Response to “randomized vertebroplasty trials: bad news or sham news?”\n", "abstract": " Any day, while we are all distracted by the fire and smoke arising from the great debates on health care reform, that mandate could slip under the radar as an amendment or rider to a totally unrelated congressional bill, like the creation of the FCCCER included in the $787 billion Recovery Act of 2009. 8 The elderly, who are affected most by this disease, may then awake to find that they are mandated to enter a painful new era on a road paved by research studies such as these. Such an outcome must be clear to Dr Weinstein who, in his editorial in the same issue of the New England Journal of Medicine, 9 clearly recognized that these studies will be used by the government for exactly this purpose. I wish to remind him that it is one thing to tell a patient whom you do not know that he or she cannot have vertebroplasty on the basis of studies, regardless of whether they are as flawed as these studies, and it is quite …", "num_citations": "38\n", "authors": ["2089"]}
{"title": "Development and validation of an objective scoring tool for robot-assisted radical prostatectomy: prostatectomy assessment and competency evaluation\n", "abstract": " Purpose: Comprehensive training and skill acquisition by urological surgeons are vital to optimize surgical outcomes and patient safety. We sought to develop and validate PACE (Prostatectomy Assessment and Competence Evaluation), an objective and procedure specific tool to assess the quality of robot-assisted radical prostatectomy.Materials and Methods: Development and content validation of PACE was performed by deconstructing robot-assisted radical prostatectomy into 7 key domains utilizing the Delphi methodology. Reliability and construct validation were then assessed using de-identified videos performed by practicing surgeons and fellows. Consensus for each domain was defined as achieving a content validity index of 0.75 or greater. Reliability was assessed by the intraclass correlation and construct validation using a mixed linear model accounting for multiple ratings on the same video …", "num_citations": "36\n", "authors": ["2089"]}
{"title": "Clinical utility of vertebroplasty: elevating the evidence\n", "abstract": " In contrast to previous studies that have used less rigorous designs, our trials provided independent, valid, and unbiased estimates of the efficacy of vertebroplasty; the negative results of these two independent trials were consistent with each other, as well as consistent with the negative results of two open randomized controlled trials that compared vertebroplasty with usual care.", "num_citations": "35\n", "authors": ["2089"]}
{"title": "Lumbar Imaging with Reporting of Epidemiology (LIRE)—protocol for a pragmatic cluster randomized trial\n", "abstract": " BackgroundDiagnostic imaging is often the first step in evaluating patients with back pain and likely functions as a “gateway” to a subsequent cascade of interventions. However, lumbar spine imaging frequently reveals incidental findings among normal, pain-free individuals suggesting that treatment of these “abnormalities” may not be warranted. Our prior work suggested that inserting the prevalence of imaging findings in patients without back pain into spine imaging reports may reduce subsequent interventions. We are now conducting a pragmatic cluster randomized clinical trial to test the hypothesis that inserting this prevalence data into lumbar spine imaging reports for studies ordered by primary care providers will reduce subsequent spine-related interventions.Methods/designWe are using a stepped wedge design that sequentially randomizes 100 primary care clinics at four health systems to receive either …", "num_citations": "33\n", "authors": ["2089"]}
{"title": "Personal bankruptcy after traumatic brain or spinal cord injury: the role of medical debt\n", "abstract": " Relyea-Chew A, Hollingworth W, Chan L, Comstock BA, Overstreet KA, Jarvik JG. Personal bankruptcy after traumatic brain or spinal cord injury: the role of medical debt.ObjectiveTo estimate the prevalence of medical debt among traumatic brain injury (TBI) and spinal cord injury (SCI) patients who discharged their debts through bankruptcy.DesignA cross-sectional comparison of bankruptcy filings of injured versus randomly selected bankruptcy petitioners.SettingPatients hospitalized with SCI or TBI (1996–2002) and personal bankruptcy petitioners (2001–2004) in western Washington State.ParticipantsSubjects (N=186) who filed for bankruptcy, comprised of 93 patients with previous SCI or TBI and 93 randomly selected bankruptcy petitioners.InterventionsNot applicable.Main Outcome MeasuresMedical and nonmedical debt, assets, income, expenses, and employment recorded in the bankruptcy petition …", "num_citations": "33\n", "authors": ["2089"]}
{"title": "Computer intervention impact on psychosocial adaptation of rural women with chronic conditions\n", "abstract": " Background:Adapting to living with chronic conditions is a life-long psychosocial challenge.Objective:The purpose of this study was to report the effect of a computer intervention on the psychosocial adaptation of rural women with chronic conditions.Methods:A two-group study design was used with 309 middle-aged, rural women who had chronic conditions, randomized into either a computer-based intervention or a control group. Data were collected at baseline, at the end of the intervention, and 6 months later on the psychosocial indicators of social support, self-esteem, acceptance of illness, stress, depression, and loneliness.Results:The impact of the computer-based intervention was statistically significant for five of six of the psychosocial outcomes measured, with a modest impact on social support. The largest benefits were seen in depression, stress, and acceptance.Discussion:The women-to-women …", "num_citations": "32\n", "authors": ["2089"]}
{"title": "Predictors of persistent disability and back pain in older adults with a new episode of care for back pain\n", "abstract": " Objective. To identify predictors of persistent disability and back pain in older adults.                    Design. Prospective cohort study.                    Setting. Back pain outcomes using longitudinal data registry.                    Subjects. Five thousand two hundred twenty adults age 65 years and older with a new primary care visit for back pain.                    Methods. Baseline measurements included: demographics, health, and back pain characteristics. We abstracted imaging findings from 348 radiology reports. The primary outcomes were the Roland-Morris Disability Questionnaire (RMDQ) and back pain intensity. We defined persistent disability as RMDQ of 4/24 or higher at both six and 12 months and persistent back pain as pain 3/10 or higher at both six and 12 months.                    Results. There were 2,498 of 4,143 (60.3%) participants with persistent disability, and 2,099 of 4,144 (50.7%) had persistent …", "num_citations": "30\n", "authors": ["2089"]}
{"title": "Baseline pain and disability in the Investigational Vertebroplasty Efficacy and Safety Trial\n", "abstract": " BACKGROUND AND PURPOSE: Multiple case series of vertebroplasty outcomes have been published, though no large, placebo controlled trial has yet been performed. Our aim was to report baseline characteristics for the Investigational Vertebroplasty Efficacy and Safety Trial (INVEST), a randomized blinded controlled study of vertebroplasty.MATERIALS AND METHODS: We compared baseline demographics, pain scores, and scores on the modified Roland-Morris Disability Scale (RMDS), a back pain−specific metric, between 2 groups. One group included subjects enrolled at the lead INVEST site (n = 27 to date). The second group consisted of eligible patients seen concurrently at the lead INVEST site, who declined enrollment (n = 70). Comparisons were made by using 2-sample t tests.RESULTS: Mean ages were similar between groups, averaging approximately 74 years among study participants and 77 …", "num_citations": "30\n", "authors": ["2089"]}
{"title": "The feelings about genomiC testing results (FACToR) questionnaire: development and preliminary validation\n", "abstract": " The purpose of this study was to develop a brief instrument, the Feelings About genomiC Testing Results (FACToR), to measure the psychosocial impact of returning genomic findings to patients in research and clinical practice. To create the FACToR, we modified and augmented the Multidimensional Impact of Cancer Risk Assessment (MICRA) questionnaire based on findings from a literature review, two focus groups (N = 12), and cognitive interviews (N = 6). We evaluated data from 122 participants referred for evaluation for inherited colorectal cancer or polyposis from the New EXome Technology in (NEXT) Medicine Study, an RCT of exome sequencing versus usual care. We assessed floor and ceiling effects of each item, conducted principal component analysis to identify subscales, and evaluated each subscale’s internal consistency, test‐retest reliability, and construct validity. After excluding items that were …", "num_citations": "29\n", "authors": ["2089"]}
{"title": "The risk of bankruptcy before and after brain or spinal cord injury: a glimpse of the iceberg's tip\n", "abstract": " Background: Injury and illness are often cited as causes of bankruptcy. However, the incidence of bankruptcy after an acute medical event is unknown. Objectives: Determine the incidence of bankruptcy in survivors of brain and spinal cord trauma, identify vulnerable subgroups, and compare the incidence pre- and postinjury. Design: Retrospective cohort study of patients injured from 1991 to 2002. Bankruptcy tracked from 1991 to 2004. Subjects: Consecutive sample of 6345 adult residents of Western Washington State admitted to hospital with brain or spinal cord injuries. Measures: Multivariate Cox proportional hazard regression to examine incidence of bankruptcy 5 years postinjury. We used Poisson regression to measure the incidence rate ratio (IRR) of bankruptcy before and after injury in a subgroup of 3527 subjects. Results: The incidence of bankruptcy 5 years postinjury was 3.5%. Bankruptcy was more …", "num_citations": "28\n", "authors": ["2089"]}
{"title": "Using natural language processing of free-text radiology reports to identify type 1 modic endplate changes\n", "abstract": " Electronic medical record (EMR) systems provide easy access to radiology reports and offer great potential to support quality improvement efforts and clinical research. Harnessing the full potential of the EMR requires scalable approaches such as natural language processing (NLP) to convert text into variables used for evaluation or analysis. Our goal was to determine the feasibility of using NLP to identify patients with Type 1 Modic endplate changes using clinical reports of magnetic resonance (MR) imaging examinations of the spine. Identifying patients with Type 1 Modic change who may be eligible for clinical trials is important as these findings may be important targets for intervention. Four annotators identified all reports that contained Type 1 Modic change, using N = 458 randomly selected lumbar spine MR reports. We then implemented a rule-based NLP algorithm in Java using regular expressions …", "num_citations": "24\n", "authors": ["2089"]}
{"title": "Problem areas identified as important to older adults with lumbar spinal stenosis\n", "abstract": " Background contextThere is growing concern that patient-reported outcomes (PROs) commonly used in clinical research evaluating treatments such as epidural steroid injections (ESIs) for lumbar spinal stenosis may not adequately capture outcomes of greatest importance to older adults.PurposeThe purpose of the study was to determine what outcomes are most important to older adults with spinal stenosis, how well commonly used PROs reflect what is most important to these participants, and which outcomes older adults with spinal stenosis would want improved to consider having ESI.Study design/settingThis is an outcome prioritization study.Patient sampleCommunity sample of 33 older adults with spinal stenosis were included.Outcome measuresThe outcome measures were Swiss Spinal Stenosis Questionnaire and Roland-Morris Disability Questionnaire.MethodsThe methods involve individual sorting and …", "num_citations": "24\n", "authors": ["2089"]}
{"title": "Comparative effectiveness of next generation genomic sequencing for disease diagnosis: design of a randomized controlled trial in patients with colorectal cancer/polyposis …\n", "abstract": " Whole exome and whole genome sequencing are applications of next generation sequencing transforming clinical care, but there is little evidence whether these tests improve patient outcomes or if they are cost effective compared to current standard of care. These gaps in knowledge can be addressed by comparative effectiveness and patient-centered outcomes research. We designed a randomized controlled trial that incorporates these research methods to evaluate whole exome sequencing compared to usual care in patients being evaluated for hereditary colorectal cancer and polyposis syndromes. Approximately 220 patients will be randomized and followed for 12 months after return of genomic findings. Patients will receive findings associated with colorectal cancer in a first return of results visit, and findings not associated with colorectal cancer (incidental findings) during a second return of results visit. The …", "num_citations": "24\n", "authors": ["2089"]}
{"title": "Does avoidant coping influence young adults’ smoking?: a ten-year longitudinal study\n", "abstract": " Introduction:           Young adults who avoid their emotions may be at risk for starting smoking or not quitting smoking. This study investigated whether a preliminary measure of avoidant coping longitudinally predicts young adults’ smoking escalation and cessation.                             Methods:           In a sample of the 3,305 participants, originally from Washington State, a preliminary measure of self-reported avoidant coping at age 18 was used to predict both smoking escalation and cessation at ages 20 and 28 with both probability and logistic regression models (10-year retention: 98.5%).                             Results:           Individuals who scored high on avoidant coping at 18 were 2.52 (p = .001) times more likely to acquire smoking by 20. However, there was no evidence that avoidant coping at age 18 predicted smoking escalation at 28 or cessation for 20- and 28-year-olds …", "num_citations": "24\n", "authors": ["2089"]}
{"title": "Long-term effects of repeated injections of local anesthetic with or without corticosteroid for lumbar spinal stenosis: a randomized trial\n", "abstract": " ObjectiveTo determine the overall long-term effectiveness of treatment with epidural corticosteroid injections for lumbar central spinal stenosis and the effect of repeat injections, including crossover injections, on outcomes through 12 months.DesignMulticenter, double-blind, randomized controlled trial comparing epidural injections of corticosteroid plus lidocaine versus lidocaine alone.SettingSixteen clinical sites.ParticipantsParticipants with imaging-confirmed lumbar central spinal stenosis (N=400).InterventionsParticipants were randomized to receive either epidural injections with corticosteroid plus lidocaine or lidocaine alone with the option of blinded crossover after 6 weeks to receive the alternate treatment. Participants could receive 1 to 2 injections from 0 to 6 weeks and up to 2 injections from 6 to 12 weeks. After 12 weeks, participants received usual care.Main Outcome MeasuresPrimary outcomes were the …", "num_citations": "23\n", "authors": ["2089"]}
{"title": "Local Anesthesia with Bupivacaine and Lidocaine for Vertebral Fracture trial (LABEL): a report of outcomes and comparison with the Investigational Vertebroplasty Efficacy and …\n", "abstract": " BACKGROUND AND PURPOSE: INVEST is a recently published double-blind placebo controlled randomized trial that demonstrated similar improvements in pain between blinded vertebroplasty and sham-vertebroplasty groups. LABEL is a trial determining the efficacy of pain relief of an injection of lidocaine and bupivacaine at the site of painful osteoporotic vertebral compression fractures in unblinded patients. We compared outcomes from the unblinded LABEL trial with those of blinded control patients from the lead site of the INVEST, exploring the role of blinding on the benefit of local anesthesia infusion for painful vertebral compression  fractures.MATERIALS AND METHODS: Nineteen patients with painful osteoporotic vertebral compression fractures underwent unblinded injection of lidocaine and bupivacaine at the site of painful osteoporotic vertebral compression fractures. Patients were given the option of …", "num_citations": "22\n", "authors": ["2089"]}
{"title": "Comparison of Outcomes of antibiotic Drugs and Appendectomy (CODA) trial: a protocol for the pragmatic randomised study of appendicitis treatment\n", "abstract": " Introduction Several European studies suggest that some patients with appendicitis can be treated safely with antibiotics. A portion of patients eventually undergo appendectomy within a year, with 10%–15% failing to respond in the initial period and a similar additional proportion with suspected recurrent episodes requiring appendectomy. Nearly all patients with appendicitis in the USA are still treated with surgery. A rigorous comparative effectiveness trial in the USA that is sufficiently large and pragmatic to incorporate usual variations in care and measures the patient experience is needed to determine whether antibiotics are as good as appendectomy.Objectives The Comparing Outcomes of Antibiotic Drugs and Appendectomy (CODA) trial for acute appendicitis aims to determine whether the antibiotic treatment strategy is non-inferior to appendectomy.Methods/Analysis CODA is a randomised, pragmatic non …", "num_citations": "21\n", "authors": ["2089"]}
{"title": "Impact of a chronic care coordinator intervention on diabetes quality of care in a community health center\n", "abstract": " Purpose To evaluate the impact of a clinic‐based chronic care coordinator (CCC) intervention on quality of diabetes care, health outcomes and health service utilization within six community health centers serving predominantly low‐income Hispanic and non‐Hispanic white patients.   Methods We used a retrospective cohort study design with a 12‐month pre‐ and 12‐month postintervention analysis to evaluate the effect of the CCC intervention and examined: (1) the frequency of testing for glycated hemoglobin (HbAIC), cholesterol LDL level, and microalbumin screen and frequency of retinal and foot exam; (2) outcomes for HbAIC levels, lipid, and blood pressure control; and (3) health care service utilization. Patients with diabetes who received the CCC intervention (n = 329) were compared to a propensity score adjusted control group who are not exposed to the CCC intervention (n = 329). All of the data came …", "num_citations": "21\n", "authors": ["2089"]}
{"title": "Adolescent psychological and social predictors of young adult smoking acquisition and cessation: A 10-year longitudinal study.\n", "abstract": " Objective: A 10-year follow-up study to test the extent to which theory-based adolescent psychological and social factors directly predict and moderate the prediction of young adult smoking acquisition and cessation. Design: A prospective community-based sample. A total of 2,970 adolescents participated in the large Washington State Hutchinson Smoking Prevention Project (HSPP) longitudinal cohort. As predictors, psychological factors (ie, parentnoncompliance, friendcompliance, rebelliousness, achievement motivation, and thrill seeking) and social environmental factors (ie, parent's and friend's smoking) were measured when adolescents were 17–18 years old. Main Outcome Measures: As main outcome measures, smoking acquisition and cessation were assessed both at ages 18 and 28. Results: Psychological and social factors predicted 3% to 7% probability (p<. 05) of smoking acquisition and a …", "num_citations": "21\n", "authors": ["2089"]}
{"title": "Subsequent health-care utilization associated with early physical therapy for new episodes of low back pain in older adults\n", "abstract": " BackgroundThe association between early physical therapy (PT) and subsequent health-care utilization following a new visit for low back pain is not clear, particularly in the setting of acute low back pain.PurposeThis study aimed to estimate the association between initiating early PT following a new visit for an episode of low back pain and subsequent back pain–specific health-care utilization in older adults.Design/SettingThis is a prospective cohort study. Data were collected at three integrated health-care systems in the United States through the Back Pain Outcomes using Longitudinal Data (BOLD) registry.Patient SampleWe recruited 4,723 adults, aged 65 and older, presenting to a primary care setting with a new episode of low back pain.Outcome MeasuresPrimary outcome was total back pain–specific relative value units (RVUs), from days 29 to 365. Secondary outcomes included overall RVUs for all health …", "num_citations": "20\n", "authors": ["2089"]}
{"title": "Can Acceptance & Commitment Therapy be delivered with fidelity as a brief telephone-intervention?\n", "abstract": " This study examined therapist adherence and competence of the first telephone-based Acceptance & Commitment Therapy (ACT) intervention for smoking cessation. An independent rater assessed 100% (n = 54 sessions) of the recorded phone sessions for adherence and competence on a 1 (never addressed) to 5 (addressed extensively) scale. A separate 20% random sample was rated by both the same independent rater and a second independent rater. The two coders were in perfect agreement (kappa of 1.0). Overall adherence (x = 4.61, SD = 0.63) and competence (x = 4.81, SD = 0.39) was high. Except self-as-context, benchmark ratings (i.e., 4 or more) were between 93% and 100%. Results suggest ACT therapy can be delivered competently over the telephone, opening many options for future research on the potential uses of telephone-based ACT for smoking and other behaviors.", "num_citations": "20\n", "authors": ["2089"]}
{"title": "Effect of high-dose erythropoietin on blood transfusions in extremely low gestational age neonates: post hoc analysis of a randomized clinical trial\n", "abstract": " ImportanceExtremely preterm infants are among the populations receiving the highest levels of transfusions. Erythropoietin has not been recommended for premature infants because most studies have not demonstrated a decrease in donor exposure.ObjectivesTo determine whether high-dose erythropoietin given within 24 hours of birth through postmenstrual age of 32 completed weeks will decrease the need for blood transfusions.Design, Setting, and ParticipantsThe Preterm Erythropoietin Neuroprotection Trial (PENUT) is a randomized, double-masked clinical trial with participants enrolled at 19 sites consisting of 30 neonatal intensive care units across the United States. Participants were born at a gestational age of 24 weeks (0-6 days) to 27 weeks (6-7 days). Exclusion criteria included conditions known to affect neurodevelopmental outcomes. Of 3266 patients screened, 2325 were excluded, and 941 were …", "num_citations": "19\n", "authors": ["2089"]}
{"title": "Comparative effectiveness research and policy: experiences conducting a coverage with evidence development study of a therapeutic device\n", "abstract": " Background and Objective: The Washington State workers' compensation agency funded a coverage with evidence development study to evaluate spinal cord stimulation (SCS) for chronic back and leg pain after spine surgery (failed back surgery syndrome). We previously published the study outcomes. We now report results from a second patient cohort; study costs; and industry, provider, and payer responses. Reserach Design, Subjects, and Measures: This prospective cohort study compared patients with failed back surgery syndrome who received at least a trial of SCS (n = 51), Pain Clinic evaluation (n = 39), or Usual Care only (n = 68) on measures of pain, physical functioning, and opioid medication use at baseline and 6, 12, and 24 months. Between the end of subject enrollment and availability of final study results, a second SCS cohort (n = 30) was followed for 12 months. Results: SCS was associated with …", "num_citations": "19\n", "authors": ["2089"]}
{"title": "Prioritizing research topics: a comparison of crowdsourcing and patient registry\n", "abstract": " Purpose                 A cornerstone of patient-centered outcome research is direct patient involvement throughout the research process. Identifying and prioritizing research topics is a critical but often overlooked point for involvement, as it guides what research questions are asked. We assess the feasibility of involving individuals with low back pain in identifying and prioritizing research topics using two approaches: an existing patient registry and an online crowdsourcing platform. We compare and contrast the diversity of participants recruited, their responses, and resources involved.                                               Methods                 Eligible participants completed a survey ranking their five highest priority topics from an existing list and supplying additional topics not previously identified. We analyzed their responses using descriptive statistics and content analysis …", "num_citations": "18\n", "authors": ["2089"]}
{"title": "Clinical outcomes of early and later physical therapist services for older adults with back pain\n", "abstract": " Background contextThe timing of physical therapy (PT) services and its association with later function and pain are not clear, especially in older adults.PurposeThe purpose of this study was to compare clinical outcomes of patients receiving early or later PT services with those not receiving PT among older adults presenting to primary care for a new visit for back pain.Study design/settingProspective cohort study using the Back Pain Outcomes Using Longitudinal Data registry.Patient sampleA total of 3,705 adults 65 years and older with a new visit for back pain were included.Outcome measuresThe outcome measures were Roland-Morris Disability Questionnaire (RMDQ), Pain Numerical Rating Scales, and EuroQol-5D.MethodsWe studied two phases of PT utilization: early (0–28 days) and later (3–6 months). At baseline, we selected the participants with complete 12 months of patient-reported outcomes and …", "num_citations": "18\n", "authors": ["2089"]}
{"title": "A harness for enhanced comfort and loading during treadmill exercise in space\n", "abstract": " IntroductionLocomotor and some resistance exercises in space require a gravity replacement force in order to allow 1g-like ground reaction forces to be generated. Currently bungee cords, or other loading devices, interface with the crew member through a harness with a waist belt and shoulder straps. Crew members often find the application of the required loads to be uncomfortable, particularly at the hips.MethodsAn experimental harness was built that differed from previous in-flight designs by having a wider, moldable waist belt and contoured shoulder straps with additional padding. Eight subjects ran at 100% body weight (BW) loading for a total duration of 30 min per day on 12 days over a 3-week period in simulated 0-g conditions using horizontal suspension. A 100 mm Visual Analog Scale (VAS)1 was used to assess harness-related and lower extremity discomfort at the end of each run.ResultsThe overall …", "num_citations": "18\n", "authors": ["2089"]}
{"title": "Optical biopsy of bladder cancer using crowd-sourced assessment\n", "abstract": " Discussion| In the present study, alcoholism and tobacco use were both independently associated with a decrease in helmet use. This correlation has been shown in previous studies. 3, 4 Unhelmeted riders were more likely to either self-pay or be covered under government insurance. These trends may reflect a tendency to engage in high-risk behavior while either ignoring or dismissing the potential consequences of these actions.The data on the Abbreviated Injury Scale scores indicated that helmeted riders had a higher number of injuries to the spine, trunk, and extremities and had significantly more orthopedic procedures. One possible explanation for this is that helmeted riders are surviving higher-force impacts than unhelmeted riders and are thus presenting with more extensive injuries. Helmet use itself may be a factor in contributing to high-impact collisions because a helmeted rider’s increased sense of …", "num_citations": "17\n", "authors": ["2089"]}
{"title": "Psychological predictors of male smokeless tobacco use initiation and cessation: a 16‐year longitudinal study\n", "abstract": " Aims To test whether psychological factors predict male smokeless tobacco (SLT) initiation and cessation longitudinally.   Design Sixteen‐year longitudinal design with 95% retention at year 6 and 82% at year 16.   Setting Forty Washington State school districts.   Participants SLT use data were gathered on a cohort of adolescents (91% Caucasian). For SLT initiation, the sample size was 2468. For SLT cessation, sample sizes were 219 (age 20 outcome) and 192 (age 28 outcome).   Measurements Self‐reported psychological measures of parental disobedience (‘parent non‐compliance’), peer influence (‘friend compliance’), rebelliousness and thrill‐seeking were taken at ages 12 and 18. SLT use was measured at ages 12, 18, 20 and 28 years.   Findings For SLT initiation, scoring highly on the following psychological factors at age 12 at least doubled the odds of daily SLT use at age 18 (P < 0.001): friend …", "num_citations": "16\n", "authors": ["2089"]}
{"title": "Investigational Vertebroplasty Efficacy and Safety Trial: detailed analysis of blinding efficacy\n", "abstract": " PurposeTo perform a detailed analysis of blinding efficacy in the Investigational Vertebroplasty Efficacy and Safety Trial (INVEST) to determine any factors associated with patient unblinding.Materials and MethodsOne hundred thirty-one patients were enrolled in this HIPAA-compliant, institutional review board–approved trial and were randomized to vertebroplasty (n = 68) or control intervention (n = 63). At multiple times up to 1 month, patients guessed their treatment allocation (vertebroplasty or control) with a forced-choice response. Patients offered a confidence level (scale, 0–10) for each guess and, when possible, a reason for their guess. Univariable logistic regression models were used to test for an association between baseline characteristics of the patients and correctly guessing their randomized treatment assignment. A two-sample t test was used to determine whether change in pain score differed …", "num_citations": "16\n", "authors": ["2089"]}
{"title": "Long-term outcomes of a large, prospective observational cohort of older adults with back pain\n", "abstract": " Background ContextAlthough back pain is common among older adults, there is relatively little research on the course of back pain in this age group.PurposeOur primary goals were to report 2-year outcomes of older adults initiating primary care for back pain and to examine the relative importance of patient factors versus medical interventions in predicting 2-year disability and pain.Study Design/SettingThis study used a predictive model using data from a prospective, observational cohort from a primary care setting.Patient SampleThe study included patients aged ≥65 years at the time of new primary care visits for back pain.Outcome MeasuresSelf-reported 2-year disability (Roland-Morris Disability Questionnaire [RDQ]) and back pain (0–10 numerical rating scale [NRS]).MethodsWe developed our models using a machine learning least absolute shrinkage and selection operator approach. We evaluated the …", "num_citations": "15\n", "authors": ["2089"]}
{"title": "Correlation of virtual reality simulation and dry lab robotic technical skills\n", "abstract": " Study ObjectiveTo examine whether a set of virtual reality (VR) surgical simulation drills have correlative validity when compared with the validated Robotic Objective Structured Assessment of Technical Skills (R-OSATS) dry lab drills.DesignA prospective methods comparison study (Canadian Task Force classification II-2).SettingA teaching hospital.ParticipantsThirty current residents, fellows, and faculty from the Departments of Obstetrics and Gynecology, Urology, and General Surgery.InterventionsParticipants completed 5 VR drills on the da Vinci Skills Simulator and 5 dry lab drills. Participants were randomized to the order of completion.Measurements and Main ResultsVR drills were scored automatically by the simulator. Dry lab drills were recorded, reviewed by 3 blinded experts, and scored using the R-OSATS assessment tool. Spearman correlation coefficients were calculated comparing simulator scores and …", "num_citations": "15\n", "authors": ["2089"]}
{"title": "Exploration of lagged associations using longitudinal data\n", "abstract": " Several statistical approaches for the analysis of longitudinal data require that models be correctly specified for the association between a current outcome and the full history of past outcomes and time‐dependent exposures. It is empirically challenging to determine the specific aspects of the outcome and/or exposure history that are predictive of a current outcome because the potential number of variables representing the history can be quite large. The purpose of this article is to outline statistical methods that can characterize lagged effects and to provide a structured approach for data analysis with the goal of appropriate model development. One of the main contributions of the article is to emphasize the possibility that in practice transition models may frequently require more than simple additive and linear models for the predictors representing the history of the outcome and covariate processes. We illustrate the …", "num_citations": "15\n", "authors": ["2089"]}
{"title": "Can patient characteristics predict benefit from epidural corticosteroid injections for lumbar spinal stenosis symptoms?\n", "abstract": " Background contextEpidural corticosteroid injections are commonly used to treat back and leg pain associated with lumbar spinal stenosis. However, little is known about which patient characteristics may predict favorable responses.PurposeThe aim was to identify patient characteristics associated with benefits from epidural injections of corticosteroid with lidocaine versus epidural injections of lidocaine only for lumbar spinal stenosis symptoms.Study design/settingThis was a secondary analysis of Lumbar Epidural steroid injections for Spinal Stenosis randomized controlled trial data from 16 US clinical sites.Patient samplePatients aged older than or equal to 50 years with moderate-to-severe leg pain and lumbar central spinal stenosis randomized to epidural injections of corticosteroids with lidocaine (n=200) or lidocaine only (n=200) were included.Outcome measuresPrimary outcomes were the Roland-Morris …", "num_citations": "14\n", "authors": ["2089"]}
{"title": "Effect of comorbid knee and hip osteoarthritis on longitudinal clinical and health care use outcomes in older adults with new visits for back pain\n", "abstract": " ObjectiveTo examine if a comorbid diagnosis of knee or hip osteoarthritis (OA) in older adults with new back pain visits is associated with long-term patient-reported outcomes and back-related health care use.DesignProspective cohort study.SettingThree integrated health systems forming the Back pain Outcomes using Longitudinal Data cohort.ParticipantsParticipants (N=5155) were older adults (≥65y) with a new visit for back pain and a complete electronic health record data.InterventionsNot applicable; we obtained OA diagnoses using diagnostic codes in the electronic health record 12 months prior to the new back pain visit.Main Outcome MeasuresThe Roland-Morris Disability Questionnaire (RDQ) and the EuroQol-5D (EQ-5D) were key patient-reported outcomes. Health care use, measured by relative-value units (RVUs), was summed for the 12 months after the initial visit. We used linear mixed-effects models …", "num_citations": "13\n", "authors": ["2089"]}
{"title": "The promise and pitfalls of using crowdsourcing in research prioritization for back pain: cross-sectional surveys\n", "abstract": " Background         The involvement of patients in research better aligns evidence generation to the gaps that patients themselves face when making decisions about health care. However, obtaining patients’ perspectives is challenging. Amazon’s Mechanical Turk (MTurk) has gained popularity over the past decade as a crowdsourcing platform to reach large numbers of individuals to perform tasks for a small reward for the respondent, at small cost to the investigator. The appropriateness of such crowdsourcing methods in medical research has yet to be clarified.                       Objective         The goals of this study were to (1) understand how those on MTurk who screen positive for back pain prioritize research topics compared with those who screen negative for back pain, and (2) determine the qualitative differences in open-ended comments between groups.                       Methods         We conducted cross-sectional surveys on MTurk to assess participants’ back pain and allow them to prioritize research topics. We paid respondents US $0.10 to complete the 24-point Roland Morris Disability Questionnaire (RMDQ) to categorize participants as those “with back pain” and those “without back pain,” then offered both those with (RMDQ score ≥7) and those without back pain (RMDQ <7) an opportunity to rank their top 5 (of 18) research topics for an additional US $0.75. We compared demographic information and research priorities between the 2 groups and performed qualitative analyses on free-text commentary that participants provided.                       Results         We conducted 2 screening waves. We first screened 2189 individuals for back pain …", "num_citations": "12\n", "authors": ["2089"]}
{"title": "PD30-05 wisdom of the crowds: use of crowdsourcing to assess surgical skill of robot-assisted radical prostatectomy in a statewide surgical collaborative\n", "abstract": " METHODSMUSIC is a statewide consortium of 42 urology practices. Twelve MUSIC surgeons submitted a video of a representative RARP which were reviewed by 25 surgical experts from MUSIC and crowdsourced reviewers from the Amazon Mechanical Turk platform using the Crowd-Sourced Assessment of Technical Skills (C-SATS) on-line survey tool. Four key steps (bladder neck division, nerve sparing, apical dissection, and urethrovesical anastomosis) from each video were edited into 76 video-clips (maximum duration 10 minutes) for analysis using the Global Evaluation Assessment of Robotic Skills (GEARS) instrument. Unedited complete anastomosis clips from 8/12 surgeons (range 9-37 minutes) were also assessed using the Robotic Anastomosis Competency Evaluation (RACE) instrument. Inter-rater reliability was evaluated using Krippendorff's alpha and intraclass correlation coefficient (ICC). Linear …", "num_citations": "11\n", "authors": ["2089"]}
{"title": "Parental smoking cessation and child daily smoking: A 9-year longitudinal study of mediation by child cognitions about smoking.\n", "abstract": " Objective: This study investigated to what extent the prospective relationship between parental smoking cessation and child daily smoking is mediated by child cognitions about smoking. Design: The study drew its sample from the 40 Washington State school districts involved in the Hutchinson Smoking Prevention Project. The predictor variable of parental smoking cessation was measured during third grade. The mediator measures, consistent with the Theory of Planned Behavior and Social Cognitive Theory, were measured during ninth grade, and the smoking status outcome was measured during twelfth grade. Main Outcome Measures: Smoking status at twelfth grade. Results: Negative general attitudes toward smoking, attitude that cigarette smoke is bothersome, and tobacco refusal self-efficacy together significantly mediated 49% of the prospective relationship between parental smoking cessation and child …", "num_citations": "11\n", "authors": ["2089"]}
{"title": "Transfusions and neurodevelopmental outcomes in extremely low gestation neonates enrolled in the PENUT Trial: a randomized clinical trial\n", "abstract": " BackgroundOutcomes of extremely low gestational age neonates (ELGANs) may be adversely impacted by packed red blood cell (pRBC) transfusions. We investigated the impact of transfusions on neurodevelopmental outcome in the Preterm Erythropoietin (Epo) Neuroprotection (PENUT) Trial population.MethodsThis is a post hoc analysis of 936 infants 24-0/6 to 27-6/7 weeks’ gestation enrolled in the PENUT Trial. Epo 1000 U/kg or placebo was given every 48 h× 6 doses, followed by 400 U/kg or sham injections 3 times a week through 32 weeks postmenstrual age. Six hundred and twenty-eight (315 placebo, 313 Epo) survived and were assessed at 2 years of age. We evaluated associations between BSID-III scores and the number and volume of pRBC transfusions.ResultsEach transfusion was associated with a decrease in mean cognitive score of 0.96 (95% CI of [− 1.34,− 0.57]), a decrease in mean motor …", "num_citations": "10\n", "authors": ["2089"]}
{"title": "The effect of including benchmark prevalence data of common imaging findings in spine image reports on health care utilization among adults undergoing spine imaging: a stepped …\n", "abstract": " ImportanceLumbar spine imaging frequently reveals findings that may seem alarming but are likely unrelated to pain. Prior work has suggested that inserting data on the prevalence of imaging findings among asymptomatic individuals into spine imaging reports may reduce unnecessary subsequent interventions.ObjectiveTo evaluate the impact of including benchmark prevalence data in routine spinal imaging reports on subsequent spine-related health care utilization and opioid prescriptions.Design, Setting, and ParticipantsThis stepped-wedge, pragmatic randomized clinical trial included 250 401 adult participants receiving care from 98 primary care clinics at 4 large health systems in the United States. Participants had imaging of their backs between October 2013 and September 2016 without having had spine imaging in the prior year. Data analysis was conducted from November 2018 to October 2019 …", "num_citations": "10\n", "authors": ["2089"]}
{"title": "PNFBA-02 technical skill assessment of surgeons performing robot-assisted radical prostatectomy: relationship between crowdsourced review and patient outcomes\n", "abstract": " METHODSSurgeons in MUSIC were invited to submit a representative video of a nerve-sparing RARP. Edited video clips of the urethrovesical anastomosis from surgeons underwent evaluation of global skill by crowdworkers via C-SATS Inc,(Seattle, WA) using the Global Evaluative Assessment of Robotic Skills (GEARS) tool (maximum score 25). A mean GEARS score for each video clip was derived using a linear mixed effects model. Surgeons were ranked on their skill scores and sorted into quartiles of skill. Using data from a prospective registry involving 2,256 patients, we compared risk-adjusted peri-operative complication rates at the patient level between surgeons (n= 7) in the lowest (Q1) skill quartile to surgeons (n= 8) in the highest (Q4) quartile (n= 8). Odds ratios (OR) were calculated using logistic regression models. Likelihood ratio tests were used to statistically assess whether outcomes differed …", "num_citations": "10\n", "authors": ["2089"]}
{"title": "Raven Surgical Robot Training in Preparation for da Vinci® Use: A Randomized Prospective Trial.\n", "abstract": " The rapid adoption of robotic assisted surgery challenges the pace at which adequate robotic training can occur due to access limitations to the da Vinci robot. Thirty medical students completed a randomized controlled trial evaluating whether the Raven robot could be used as an alternative training tool for the Fundamentals of Laparoscopic Surgery (FLS) block transfer task on the da Vinci robot. Two groups, one trained on the da Vinci and one trained on the Raven, were tested on a criterion FLS block transfer task on the da Vinci. After robotic FLS block transfer proficiency training there was no statistically significant difference between path length (p= 0.39) and economy of motion scores (p= 0.06) between the two groups, but those trained on the da Vinci did have faster task times (p= 0.01). These results provide evidence for the value of using the Raven robot for training prior to using the da Vinci surgical system for similar tasks.", "num_citations": "10\n", "authors": ["2089"]}
{"title": "Associations of early opioid use with patient-reported outcomes and healthcare utilization among older adults with low back pain\n", "abstract": " ObjectivesTo compare outcomes and healthcare utilization of older patients who did versus did not fill opioid prescriptions within 90 days of initiating care for low back pain.Materials and MethodsFor patients≥ 65 years with new back pain visits, we used propensity scores to match those who filled no opioid prescriptions to those who filled≥ 2 opioid prescriptions within 90 days (and the first opioid prescription within 30 days) of the index visit. Over 24 months, we examined patient-reported outcomes, healthcare utilization, and subsequent opioid prescription fills.ResultsAmong 1954 patients eligible for matching, 238 (12%) filled≥ 2 opioid prescriptions within 90 days; 200 of these were matched to controls. Patients with versus without early opioid prescriptions had similar patient-reported outcomes but were more likely to have filled≥ 1 opioid prescription 18–24 months after the index visit (odds ratio (95% CI)= 2.4 …", "num_citations": "9\n", "authors": ["2089"]}
{"title": "Lumbar Muscle Cross‐Sectional Areas Do Not Predict Clinical Outcomes in Adults With Spinal Stenosis: A Longitudinal Study\n", "abstract": " Background Minimal longitudinal data exist regarding the role of lumbar musculature in predicting back pain and function. In cross‐sectional study designs, there is often atrophy of the segmental multifidus muscle in subjects with low back pain compared with matched controls. However, the cross‐sectional design of these studies prevents drawing conclusions regarding whether lumbar muscle characteristics predict or modify future back pain or function.   Objective The primary objective of this study is to determine whether the cross‐sectional area (CSA) of lumbar muscles predict functional status or back pain at 6‐ or 12‐month follow‐up in older adults with spinal degeneration. The secondary objective is to evaluate whether these muscle characteristics improve outcome prediction above and beyond the prognostic information conferred by demographic and psychosocial variables.   Design Secondary analysis of …", "num_citations": "9\n", "authors": ["2089"]}
{"title": "Short-term improvements in disability mediate patient satisfaction after epidural corticosteroid injections for symptomatic lumbar spinal stenosis\n", "abstract": " Study Design. Secondary analysis of data from a double-blind randomized controlled trial.  Objective. To identify mediators of the effect of lumbar epidural injections of corticosteroid plus lidocaine on patient satisfaction at 6 weeks postinjection in patients with lumbar spinal stenosis. We hypothesized that short-term (≤3 wk) change in leg pain would be a significant mediator of satisfaction.  Summary of Background Data. No prior studies have identified mediators of effects of epidural injections on patient satisfaction with treatment of lumbar spinal stenosis.  Methods. We used mediation analysis methods to examine selected intermediate variables (adverse events and change in leg pain, back pain, disability, depression, and fatigue at 3 wk) as potential mediators of the effect of lumbar epidural injections of corticosteroid plus lidocaine on patient satisfaction with treatment. We used the overall satisfaction item from the …", "num_citations": "9\n", "authors": ["2089"]}
{"title": "Study of Methods for Assessing Research Topic Elicitation and pRioritization (SMARTER): study protocol to compare qualitative research methods and advance patient engagement in …\n", "abstract": " Background: Involving patients as partners in research is a defining characteristic of patient-centered outcomes research (PCOR). While patients’ experiential knowledge of a health condition or treatment may yield research priorities not reflected by researchers and policy makers, the methods for identifying and effectively collaborating with patients are still evolving. Patient registries and crowdsourcing may offer ease of access and convenience to both researchers and patients. Surveys and focus groups, including online modalities, have been described for prioritizing research topics. However, little is known about how these different methods compare in producing consistent priorities and similar perceptions of engagement quality among participants.Objective: The aims of this study are (1) to compare how different engagement methods used to elicit patient priorities for research perform as measured by rankings for priorities generated and participant satisfaction; and (2) to determine characteristics of individuals choosing to participate in research prioritization activities.Methods: Participants in the Back pain Outcomes using Longitudinal Data (BOLD) patient registry, established to evaluate the natural history of back pain among individuals 65 years and older, and participants on the Amazon Mechanical Turk (MTurk) crowdsourcing platform, to provide input on priorities for research via a questionnaire, are invited. For BOLD participants, we subsequently randomize interested respondents to 1 of 3 interactive prioritization activities to further develop priorities: a Delphi panel, an online crowd voting activity, or an in-person facilitated prioritization …", "num_citations": "8\n", "authors": ["2089"]}
{"title": "Disease-specific self-efficacy in spasmodic dysphonia patients\n", "abstract": " ObjectiveSelf-efficacy (SE) is an optimistic self-belief that one can perform a novel task. This concept involves empowerment, self-esteem, and adaptation to a stressful situation. SE is a strong predictor of health behaviors. Our objectives were to study SE in spasmodic dysphonia (SD) and to develop a disease-specific SE-SD scale.Study DesignProspective study.SettingAcademic hospital.Subject and MethodsDisease-specific SE-SD items were developed with laryngologists, speech pathologists, and SD patients. These items, General SE Scale, Voice Handicap Index-10 (VHI-10), Consensus Auditory Perceptual Evaluation of Voice (CAPE-V), and Hospital Anxiety and Depression Scale (HADS), were administered to SD patients who presented for botulinum toxin injections.ResultsOne hundred forty-five SD patients (mean age 59.5 ± 13.6 years) had a general SE score (Cronbach’s α = 0.894) of 33.4 ± 5.2 out of 40 …", "num_citations": "8\n", "authors": ["2089"]}
{"title": "Mapping a patient-reported functional outcome measure to a utility measure for comparative effectiveness and economic evaluations in older adults with low back pain\n", "abstract": " Background. Linking patient-reported back pain outcomes with health utility measures is valuable for informing economic evaluations. Methods. We used the Back pain Outcomes using Longitudinal Data (BOLD) registry to assess back pain and quality-of-life measures. The BOLD registry includes participants≥ 65 years from 3 health systems. We used multiple baseline outcome measures: Roland-Morris Disability Questionnaire (RMDQ), Euroqol-5D (EQ-5D), and back and leg pain numerical rating scales (NRS). To develop and validate a model, we used a standard split-sample method and a novel multisite validation approach. We applied linear regression to map RMDQ to EQ-5D, adjusting for age, sex, pain numerical rating scores, and nonlinear transformations of outcome measures. We computed R 2, root mean squared error, and mean absolute error (MAE) for purposes of model selection. The final model …", "num_citations": "7\n", "authors": ["2089"]}
{"title": "Challenges conducting comparative effectiveness research: the Clinical and Health Outcomes Initiative in Comparative Effectiveness (CHOICE) experience\n", "abstract": " The Clinical and Health Outcomes Initiative in Comparative Effectiveness (CHOICE) program, which includes 12 ongoing comparative effectiveness research (CER) trials funded by the Agency for Healthcare Research and Quality under the American Recovery and Reinvestment Act of 2009, has had firsthand experience in dealing with the unique challenges of conducting CER since the trials started in the fall of 2010. This paper will explore the collective experience of the CHOICE program and discuss common challenges and successes the CHOICE investigators have experienced conducting CER research in the United States. The specific aims of this paper are to describe the common features of the CHOICE award studies (observational studies and trials), to summarize the strategies undertaken to address the challenges in conducting comparative effectiveness pragmatic trials and observational studies from …", "num_citations": "7\n", "authors": ["2089"]}
{"title": "Associations between relative value units and patient-reported back pain and disability\n", "abstract": " Objective: To describe associations between health care utilization measures and patient-reported outcomes (PROs). Method: Primary data were collected from patients≥ 65 years with low back pain visits from 2011 to 2013. Six PROs of pain and functionality were collected 12 and 24 months after the index visits and total and spine-specific relative value units (RVUs) from electronic health records were tabulated over 1 year. We calculated correlation coefficients between RVUs and 12-and 24-month PROs and conducted linear regressions with each 12-and 24-month PRO as the outcome variables and RVUs as predictors of interest. Results: We observed very weak correlations between worse PROs at 12 and 24 months and greater 12-month utilization. In regression analyses, we observed slight associations between greater utilization and worse 12-and 24-month PROs. Discussion: We found that 12-month …", "num_citations": "6\n", "authors": ["2089"]}
{"title": "PD6-08 CROWD-SOURCED ASSESSMENT OF TECHNICAL SKILLS (C-SATS™): FAST, ECONOMICAL AND ACCURATE ASSESSMENT OF ROBOTIC SURGERY\n", "abstract": " METHODSFifty-one urology residents and faculty performed two dry-lab surgical training tasks on a da Vinci surgical robot: 1) Fundamentals of Laparoscopic Surgery intracorporeal suturing and 2) a rocking pegboard transfer task. Forty-nine recorded performances from each were available to be uploaded to a website built to facilitate efficient grading using the depth perception, bimanual dexterity and efficiency domains of the validated Global Evaluative Assessment of Robotic Surgery scoring tool. Three surgical faculty graded the tasks after completing a grader training session to maximize agreement. Each performance was then scored by 30 Amazon. com Mechanical Turk crowd workers in return for a payment of $0.25 to $0.50. Mean surgeon and mean crowd scores were computed and compared using correlation coefficient (CC) and Cronbach’s Alpha (CA), a measure of crowd-surgeon agreement.RESULTS …", "num_citations": "6\n", "authors": ["2089"]}
{"title": "Commentary: No comparison: conservative management of painful spontaneous osteoporotic compression fractures is the way to go\n", "abstract": " Commentary onLee HM, Park SY, Lee SH, et al. Comparative analysis of clinical outcomes in patients with osteoporotic vertebral compression fractures (OVCFs): conservative treatment versus balloon kyphoplasty. Spine J 2012;12:998–1005 (in this issue).", "num_citations": "6\n", "authors": ["2089"]}
{"title": "The Impact of Erythropoietin on Short-and Long-Term Kidney-Related Outcomes in Neonates of Extremely Low Gestational Age. Results of a Multicenter, Double-Blind, Placebo …\n", "abstract": " ObjectiveTo evaluate whether extremely low gestational age neonates (ELGANs) randomized to erythropoietin have better or worse kidney-related outcomes during hospitalization and at 22-26 months of corrected gestational age (cGA) compared with those randomized to placebo.Study designWe performed an ancillary study to a multicenter double-blind, placebo-controlled randomized clinical trial of erythropoietin in ELGANs.ResultsThe prevalence of severe (stage 2 or 3) acute kidney injury (AKI) was 18.2%. We did not find a statistically significant difference between those randomized to erythropoietin vs placebo for in-hospital primary (severe AKI) or secondary outcomes (any AKI and serum creatinine/cystatin C values at days 0, 7, 9, and 14). At 22-26 months of cGA, 16% of the cohort had an estimated glomerular filtration rate (eGFR) <90 mL/min/1.73 m2, 35.8% had urine albumin/creatinine ratio >30 mg/g, 23 …", "num_citations": "5\n", "authors": ["2089"]}
{"title": "Crowdsourcing: a valid alternative to expert evaluation of robotic surgery skills\n", "abstract": " Study ObjectiveThe Robotic Training Network (RTN), a group of surgical educators, uses the Robotic-Objective Structured Assessment of Technical Skills (R-OSATS) to score dry lab robotic surgery drills. This is a valid and reliable method, but requires experts to evaluate each trainee. We sought to assess whether crowdsourcing (via Amazon Mechanical Turk) can be used as an alternative to expert evaluators for scoring dry lab surgical drills.Design", "num_citations": "5\n", "authors": ["2089"]}
{"title": "Clinical exome sequencing vs. usual care for hereditary colorectal cancer diagnosis: a pilot comparative effectiveness study\n", "abstract": " BackgroundClinical exome sequencing (CES) provides the advantage of assessing genetic variation across the human exome compared to a traditional stepwise diagnostic approach or multi-gene panels. Comparative effectiveness research methods offer an approach to better understand the patient-centered and economic outcomes of CES.PurposeTo evaluate CES compared to usual care (UC) in the diagnostic work-up of inherited colorectal cancer/polyposis (CRCP) in a randomized controlled trial (RCT).MethodsThe primary outcome was clinical sensitivity for the diagnosis of inherited CRCP; secondary outcomes included psychosocial outcomes, family communication, and healthcare resource utilization. Participants were surveyed 2 and 4 weeks after results return and at 3-month intervals up to 1 year.ResultsEvolving outcome measures and standard of care presented critical challenges. The majority of …", "num_citations": "4\n", "authors": ["2089"]}
{"title": "Patient priority weighting of the Roland Morris disability questionnaire does not change results of the lumbar epidural steroid injections for spinal stenosis trial\n", "abstract": " ObjectiveTo re-evaluate whether outcomes for older adults receiving epidural steroid injections with or without corticosteroid improve after using patient-prioritized Roland-Morris Disability Questionnaire (RDQ) items.", "num_citations": "4\n", "authors": ["2089"]}
{"title": "Replacement of daily load attenuates but does not prevent changes to the musculoskeletal system during bed rest\n", "abstract": " The dose-response effects of exercise in reduced gravity on musculoskeletal health have not been well documented. It is not known whether or not individualized exercise prescriptions can be effective in preventing the substantial loss in bone mineral density and muscle function that have been observed in space flight and in bed rest. In this study, typical daily loads to the lower extremities were quantified in free-living subjects who were then randomly assigned to control or exercise groups. Subjects were confined to 6-degree head-down bed rest for 84 days. The exercise group performed individually prescribed 1 g loaded locomotor exercise to replace their free-living daily load. Eleven subjects (5 exercise, 6 control) completed the protocol. Volumetric bone mineral density results from quantitative computed tomography demonstrated that control subjects lost significant amounts of bone in the intertrochanteric and …", "num_citations": "4\n", "authors": ["2089"]}
{"title": "PD19-05 HIGH-VOLUME ASSESSMENT OF SURGICAL VIDEOS VIA CROWD-SOURCING: THE BASIC LAPAROSCOPIC UROLOGIC SKILLS (BLUS) INITIATIVE\n", "abstract": " METHODSA total of 454 videos performed by urology trainees and experienced faculty of dry-lab laparoscopic tasks: Peg Transfer (n= 110), Cutting (n= 110), Intracorporeal Suturing (n= 115), and Clip Apply (n= 119) tasks were recorded with the Electronic Data Generation and Evaluation (EDGE) system (Simulab Corp, Seattle WA). We sought at least 30 Crowd-Sourced Assessment of Technical Skills (C-SATS) ratings via the GOALS survey tool with an added pass/fail domain by crowdworkers from the Amazon. com Mechancial Turk Platform (Amazon Inc., Seattle WA). We created a custom-built web-based video display and survey tool (Zoho Corp., Pleasanton, CA) that automatically uploads and manages hundreds of video ratings. We employed Receiver-Operator Characteristic (ROC) curves and the area under the curve (AUC) metric to characterize crowd scores.RESULTSCrowdworkers provided 16,418 …", "num_citations": "4\n", "authors": ["2089"]}
{"title": "Enteral Iron Supplementation in Infants Born Extremely Preterm and its Positive Correlation with Neurodevelopment; Post Hoc Analysis of the Preterm Erythropoietin …\n", "abstract": " ObjectivesTo test whether an increased iron dose is associated with improved neurodevelopment as assessed by the Bayley Scales of Infant Development, third edition (BSID-III) among infants enrolled in the Preterm Erythropoietin (Epo) Neuroprotection Trial (PENUT).Study designThis is a post hoc analysis of a randomized trial that enrolled infants born at 24-28 completed weeks of gestation. All infants in PENUT who were assessed with BSID-III at 2 years were included in this study. The associations between enteral iron dose at 60 and 90 days and BSID-III component scores were evaluated using generalized estimating equations models adjusted for potential confounders.ResultsIn total, 692 infants were analyzed (355 placebo, 337 Epo). Enteral iron supplementation ranged from 0 to 14.7 mg/kg/d (IQR 2.1-5.8 mg/kg/d) at day 60, with a mean of 3.6 mg/kg/d in infants treated with placebo and 4.8 mg/kg/d in …", "num_citations": "3\n", "authors": ["2089"]}
{"title": "Acute and Chronic Placental Abnormalities in a Multicenter Cohort of Newborn Infants With Hypoxic-Ischemic Encephalopathy\n", "abstract": " ObjectiveTo examine the frequency of placental abnormalities in a multicenter cohort of newborn infants with hypoxic-ischemic encephalopathy (HIE), and to determine the association between acuity of placental abnormalities and clinical characteristics of HIE.Study designInfants born at ≥ 36 weeks of gestation (n=500) with moderate or severe HIE were enrolled in the High-dose Erythropoietin for Asphyxia and Encephalopathy (HEAL) Trial. A placental pathologist blinded to clinical information reviewed clinical pathology reports to determine the presence of acute and chronic placental abnormalities using a standard classification system.ResultsComplete placental pathologic examination was available for 321/500 (64%) trial participants. Placental abnormalities were identified in 273/321 (85%) and were more common in infants ≥ 40 weeks of gestation (93% vs. 81%, p=0.01). A combination of acute and chronic …", "num_citations": "3\n", "authors": ["2089"]}
{"title": "Tumor length as a prognostic factor in esophageal cancer management\n", "abstract": " Objective                 To determine whether tumor length provides additional prognostic information beyond traditional TNM staging alone.                                               Methods                 A retrospective review was conducted of 356 patients with stage I–III esophageal cancer treated with curative intent at the University of Washington between 1995 and 2010. All patients had esophagoduodenoscopy prior to treatment. Multivariate Cox models were performed to evaluate the impact of tumor length on mortality as both a continuous and binary variable (≤3 and >3 cm), controlling for stage, histology, treatment, gender, and age.                                               Results                 Among all patients, each increasing centimeter of tumor involvement was associated with a 13 % increased risk of mortality (hazard ratio (HR) = 1.13, p < 0.001). The hazard ratio for death was 1.22 (p = 0.009) for stage I patients, 1.12 …", "num_citations": "3\n", "authors": ["2089"]}
{"title": "Computer intervention: Illness self-management/quality of life of rural women\n", "abstract": " The Women To Women project, a computer-based support and educational research intervention, was designed to help rural women better understand and manage their chronic illnesses. Its impact on psychosocial adaptation has been reported elsewhere. This article reports on the effect of a computer intervention on chronic illness self-management skills and quality of life. Using a parallel 2-group study design, the researchers randomized 309 middle-aged rural women with chronic conditions to either a computer-based intervention or a control group. They collected data on self-management of chronic illness and quality of life indicators at baseline and at the end of the intervention. Women in the intervention group reported significantly more self-efficacy in managing their chronic disease than those in the control group and the observed effect was of moderate size. Women in the intervention group also reported statistically significant gains in quality of life; effect sizes were small but consistent. Select chronic illness self-management skills and quality of life can be positively influenced by a well-designed computer intervention.", "num_citations": "3\n", "authors": ["2089"]}
{"title": "High-Dose Erythropoietin in Extremely Low Gestational Age Neonates Does Not Alter Risk of Retinopathy of Prematurity\n", "abstract": " Introduction: The Preterm Erythropoietin (Epo) Neuroprotection (PENUT) Trial sought to determine the safety and efficacy of early high-dose Epo as a potential neuroprotective treatment. We hypothesized that Epo would not increase the incidence or severity of retinopathy of prematurity (ROP). Methods: A total of 941 infants born between 24–0/7 and 27–6/7 weeks’ gestation were randomized to 1,000 U/kg Epo or placebo intravenously for 6 doses, followed by subcutaneous or sham injections of 400 U/kg Epo 3 times a week through 32 weeks post-menstrual age. In this secondary analysis of PENUT trial data, survivors were evaluated for ROP. A modified intention-to-treat approach was used to compare treatment groups. In addition, risk factors for ROP were evaluated using regression methods that account for multiples and allow for adjustment for treatment and gestational age at birth. Results: Of 845 subjects who …", "num_citations": "2\n", "authors": ["2089"]}
{"title": "PD46-03 IS CROWDSOURCING SURGICAL SKILL ASSESSMENT RELIABLE? AN ANALYSIS OF ROBOTIC PROSTATECTOMIES\n", "abstract": " METHODSWe used five urethrovesical anastomosis videos previously assessed by faculty-level surgeons within the Michigan Urological Surgery Improvement Collaborative (MUSIC) using the Global Evaluative Assessment of Robotic Skills (GEARS),(highest score 25). The bottom and top scoring videos and three videos evenly distributed across a range of peer rater scores were selected from a larger pool of videos. Each video was assessed through the C-SATS platform (C-SATS, Inc. Seattle, WA) by n= 32 random crowdworkers at one of ten different days/times over one week. A C-SATS GEARS average score was generated for each video; reliability was assessed using intraclass correlation coefficient (ICC). We then evaluated the 5 anastomosis videos with n= 23 faculty experts as a comparative example of expert rating performance. Experts were not subjected to the same repeated trials of reviews. Expert …", "num_citations": "2\n", "authors": ["2089"]}
{"title": "192 Wisdom of the crowds: Use of crowdsourcing to assess surgical skill of robot-assisted radical prostatectomy in a statewide surgical collaborative\n", "abstract": " 192 Wisdom of the crowds: Use of crowdsourcing to assess surgical skill of robot-assisted radical prostatectomy in a statewide surgical collaborative × Close The Infona portal uses cookies, ie strings of text saved by a browser on the user's device. The portal can access those files and use them to remember the user's data, such as their chosen settings (screen view, interface language, etc.), or their login data. By using the Infona portal the user accepts automatic saving and using this information for portal operation purposes. More information on the subject can be found in the Privacy Policy and Terms of Service. By closing this window the user confirms that they have read the information on cookie usage, and they accept the privacy policy and the way cookies are used by the portal. You can change the cookie settings in your browser. I accept Polski English Login or register account remember me Password recovery …", "num_citations": "2\n", "authors": ["2089"]}
{"title": "A randomized trial of epidural glucocorticoid injections for spinal stenosis\n", "abstract": " 目的腰部脊柱管狭窄症の腰下肢痛に対する硬膜外ブロックについて, 局所麻酔薬+ ステロイド剤混合群と局所麻酔薬単独群を比較する", "num_citations": "2\n", "authors": ["2089"]}
{"title": "Do Extremely Low Gestational Age Neonates Regulate Iron Absorption via Hepcidin?\n", "abstract": " ObjectivesTo evaluate whether extremely preterm infants regulate iron status via hepcidin.Study designIn this retrospective analysis of infants from the Preterm Epo Neuroprotection (PENUT) Trial, urine hepcidin (Uhep) normalized to creatinine (Uhep/UCr) was evaluated among infants randomized to erythropoietin (Epo) or placebo.ResultsThe correlation (r) between Uhep/UCr and serum markers of iron status (ferritin and zinc protoporphyrin-to-heme ratio [ZnPP/H]) and iron dose was assessed. A total of 243 urine samples from 76 infants born at 24-276/7 weeks gestation were analyzed. The median Uhep/UCr concentration was 0.3, 1.3, 0.4, and 0.1 ng/mg at baseline, 2 weeks, 4 weeks, and 12 weeks, respectively, in placebo-treated infants. The median Uhep/UCr value in Epo-treated infants were not significantly different, with the exception of the value at the 2-week time point (median Uhep/UCr, 0.1 ng/mg; P < …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Early biomarkers of hypoxia and inflammation and two-year neurodevelopmental outcomes in the preterm erythropoietin neuroprotection (PENUT) trial\n", "abstract": " BackgroundIn the Preterm Erythropoietin (Epo) NeUroproTection (PENUT) Trial, potential biomarkers of neurological injury were measured to determine their association with outcomes at two years of age and whether Epo treatment decreased markers of inflammation in extremely preterm (<28 weeks’ gestation) infants.MethodsPlasma Epo was measured (n=391 Epo, n=384 placebo) within 24h after birth (baseline), 30min after study drug administration (day 7), 30min before study drug (day 9), and on day 14. A subset of infants (n=113 Epo, n=107 placebo) had interferon-gamma (IFN-γ), Interleukin (IL)-6, IL-8, IL-10, Tau, and tumour necrosis factor-α (TNF-α) levels evaluated at baseline, day 7 and 14. Infants were then evaluated at 2 years using the Bayley Scales of Infant and Toddler Development, 3rd Edition (BSID-III).FindingsElevated baseline Epo was associated with increased risk of death or severe disability …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Intracranial Hemorrhage and 2-year Neurodevelopmental Outcomes in Extremely Preterm Infants.\n", "abstract": " ObjectivesTo determine the incidence, timing, progression, and risk factors for intracranial hemorrhage (ICH) in infants 24-0/7 to 27-6/7 weeks' gestational age (GA), and to characterize the association between ICH and death or neurodevelopmental impairment (NDI) at 2 years corrected age (CA).Study designInfants enrolled in the Preterm Erythropoietin Neuroprotection Trial had serial cranial ultrasounds performed on day 1, day 7-9, and 36-weeks postmenstrual age (PMA) to evaluate ICH. Potential risk factors for development of ICH were examined. Outcomes included death or severe NDI as well as Bayley Scales of Infant and Toddler Developmental, 3 rd Edition (BSID-III) at 2-years CA.ResultsICH was identified in 38%(n= 339) of 883 enrolled infants. Multiple gestation and cesarean delivery reduced the risk of any ICH on day 1. Risk factors for development of bilateral Grade 2, or Grade 3 or 4 ICH at day 7-9 included any ICH at day 1, and two or more doses of prenatal steroids decreased risk. Bilateral Grade 2, Grade 3, or Grade 4 ICH at 36-weeks were associated with prior ICH at day 7-9. Bilateral Grade 2, any Grade 3, and any Grade 4 ICH at 7-9 days or 36-weeks PMA were associated with increased risk of death or severe NDI and lower BSID-III scores.ConclusionRisk factors for ICH varied by timing of bleed. Bilateral and increasing grade of ICH were associated with death or NDI in infants born extremely preterm.", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Assessment of 2-Year Neurodevelopmental Outcomes in Extremely Preterm Infants Receiving Opioids and Benzodiazepines\n", "abstract": " ImportanceExtremely preterm (EP) infants frequently receive opioids and/or benzodiazepines, but these drugs’ association with neurodevelopmental outcomes is poorly understood.ObjectivesTo describe the use of opioids and benzodiazepines in EP infants during neonatal intensive care unit (NICU) hospitalization and to explore these drugs’ association with neurodevelopmental outcomes at 2 years’ corrected age.Design, Setting, and ParticipantsThis cohort study was a secondary analysis of data from the Preterm Erythropoietin Neuroprotection (PENUT) Trial, which was conducted among infants born between gestational ages of 24 weeks, 0 days, and 27 weeks, 6 days. Infants received care at 19 sites in the United States, and data were collected from December 2013 to September 2016. Data analysis for this study was conducted from March to December 2020.ExposuresShort (ie, ≤7 days) and prolonged (ie …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Whole genome methylation and transcriptome analyses to identify risk for cerebral palsy (CP) in extremely low gestational age neonates (ELGAN)\n", "abstract": " Preterm birth remains the leading identifiable risk factor for cerebral palsy (CP), a devastating form of motor impairment due to developmental brain injury occurring around the time of birth. We performed genome wide methylation and whole transcriptome analyses to elucidate the early pathogenesis of CP in extremely low gestational age neonates (ELGANs). We evaluated peripheral blood cell specimens collected during a randomized trial of erythropoietin for neuroprotection in the ELGAN (PENUT Trial, NCT# 01378273). DNA methylation data were generated from 94 PENUT subjects (n= 47 CP vs. n= 47 Control) on day 1 and 14 of life. Gene expression data were generated from a subset of 56 subjects. Only one differentially methylated region was identified for the day 1 to 14 change between CP versus no CP, without evidence for differential gene expression of the associated gene RNA Pseudouridine …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Cytokine and chemokine responses to injury and treatment in a nonhuman primate model of hypoxic-ischemic encephalopathy treated with hypothermia and erythropoietin\n", "abstract": " Predicting long-term outcome in infants with hypoxic-ischemic encephalopathy (HIE) remains an ongoing clinical challenge. We investigated plasma biomarkers and their association with 6-month outcomes in a nonhuman primate model of HIE with or without therapeutic hypothermia (TH) and erythropoietin (Epo). Twenty-nine Macaca nemestrina were randomized to control cesarean section (n = 7) or 20 min of umbilical cord occlusion (UCO, n = 22) with either no treatment (n = 11) or TH/Epo (n = 11). Initial injury severity was scored using 30-min arterial pH, base deficit, and 10-min Apgar score. Twenty-four plasma cytokines, chemokines, and growth factors were measured 3, 6, 24, 72, and 96 h after UCO. Interleukin 17 (IL-17) and macrophage-derived chemokine (MDC) differentiated the normal/mild from moderate/severe injury groups. Treatment with TH/Epo was associated with increased monocyte …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Crowd-Sourced Reliability of an Assessment of Lower Facial Aging Using a Validated Visual Scale\n", "abstract": " Background:Reliable and valid assessments of the visual endpoints of aesthetic surgery procedures are needed. Currently, most assessments are based on the opinion of patients and their plastic surgeons. The objective of this research was to analyze the reliability of crowdworkers assessing de-identified photographs using a validated scale that depicts lower facial aging.Methods:Twenty photographs of the facial nasolabial region of various non-identifiable faces were obtained for which various degrees of facial aging were present. Independent crowds of 100 crowd workers were tasked with assessing the degree of aging using a photograph numeric scale. Independent groups of crowdworkers were surveyed at 4 different times (weekday daytime, weekday nighttime, weekend daytime, weekend nighttime), once a week for 2 weeks.Results:Crowds assessing midface region photographs had an overall correlation …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "The diagnosis conundrum: Comparison of crowdsourced and expert assessments of toddlers with high and low risk of autism spectrum disorder\n", "abstract": " As the diagnosis and treatment of Autism Spectrum Disorder (ASD) becomes a greater public health concern, access to professionals and expert assessment becomes increasingly more challenging. Novel techniques to improve efficiency of assessment of young children with social communication concerns are desperately needed to address significant barriers to accessing diagnostic evaluations. Utilizing crowdsourcing technology, we compared ratings by experts and crowdworkers of social communication behaviors in videos of 18‐month‐old children. Of note, 563 crowdworkers and 24 expert responses were collected in approximately 7 hr and 57 days, respectively. Summed scores of social communication behaviors observed by crowdworkers showed high correlation to those of experts. These data introduce a novel and perhaps efficient way in which to examine of social communication impairments in …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "MP20-14 VARIATION IN THE TECHNICAL SKILL OF SURGEONS PERFORMING ROBOT-ASSISTED RADICAL PROSTATECTOMY\n", "abstract": " METHODSTen MUSIC surgeons provided complete RARP videos that were segmented and rated in a blinded manner by peers, and layperson crowd-sourced reviewers from Amazon. com Mechanical Turk. Videos were evaluated using a new procedure-specific tool, Prostatectomy Assessment and Competence Evaluation (PACE), and for global skill using Global Evaluative Assessment of Robotic Skills (GEARS). PACE has 7 domains: bladder drop, preparation of prostate, bladder neck dissection, dissection of seminal vesicles, nerve-sparing, apical dissection, and anastomosis. Anchors for poor and ideal performance were assigned scores 1 and 5, respectively. Linear mixed-effects models derived mean ratings for each segment. Individual segments were aggregated to provide weighted surgeon scores.RESULTS23 peer surgeons completed 328 video ratings, while 784 crowdworkers provided 2715 ratings …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "PD19-02 USING THE WISDOM OF CROWDS: VALIDATION THROUGH THE BASIC LAPAROSCOPIC UROLOGIC SURGERY (BLUS) CURRICULUM\n", "abstract": " METHODSTwenty-four candidate videos of laparoscopic skill tasks performed by surgeons of varying levels of laparoscopic case experience-12 suturing and 12 pegboard transfer performances were evaluated by five faculty experts and at least 60 Amazon. com Mechanical Turk crowd-workers. Each rater provided responses to the same four-domained rating scale from the Global Objective Assessment of Laparoscopic Skills (GOALS) tool. We compared mean global performance scores provided by experts and crowd-workers using Cronbach's alpha and estimated performance-specific passing probabilities by cut-offs established with receiver operating characteristic (ROC) curves.RESULTSWithin 48 hours we received 1,840 crowd-worker ratings, of which 1,438 (78.2%) passed analysis eligibility criteria based on discrimination and attention questions used to assess the integrity of the scorer's responses. Faculty …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "MP37-05 THE DA VINCI ROBOT TRAINING DILEMMA: EVALUATING THE RAVEN ROBOT AS A SOLUTION\n", "abstract": " METHODSA total of 30 medical students were enrolled and were randomly assigned to Raven training (RT) or da Vinci training (DT). Both groups practiced to proficiency on their assigned robot for the FLS block transfer and subsequently completed a criterion test on the da Vinci robot during a separate session.RESULTSUpon completion of robotic FLS block transfer proficiency training, there were no statistically significant differences between path length (p= 0.39) or economy of motion (EOM)(p= 0.06) between the two groups. The RT group had an average path length of 355±44 in and the DT group averaged 339±49 in (p= 0.39, 95% CI-1.56 to 33.31. The average EOM for the RT and DT groups was 3.74 in/s±0.99 and 4.43 in/s±0.83, respectively (p= 0.06, 95% CI-1.04 to-0.33). Video review of the criterion tasks were performed by a panel of experienced robotic surgeons to provide a composite performance score …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Response to letter from Dr North\n", "abstract": " We are pleased to respond to Dr North’s letter. Dr North faults us for not mentioning “palliative.” We were referring in our article1 to Washington State law (WAC 296-20-01002), which states that treatment in workers’ compensation must be curative or rehabilitative, and that rehabilitative treatment must be associated with functional recovery and long-term changes. This legal code does not mention “palliative.” We also note that the Washington State workers’ compensation program has never covered spinal cord stimulation (SCS)(except as part of our study), so its policy precedes our study by many years. We leave it to policymakers and payers to make decisions regarding future funding of specific therapies. We stated in our Pain article that “RCTs are regarded as the gold standard for assessing treatment efficacy” but also discussed how RCTs and observational studies are differentially suited to answering different …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Response to Letter From Ms Jane Shipley\n", "abstract": " Disclosures: The Medical Care article was written by the authors independently of the Washington State Department of Labor and Industries (DLI) and was not funded by the DLI, although the study it describes was funded by the DLI. Dr Turner has worked on other projects supported by the DLI. Dr Turner has also worked on, and consulted to, studies funded by Johnson & Johnson that do not involve drugs or therapeutic devices. Dr Deyo receives honoraria from the non-profit Foundation for Informed Medical Decision-Making, where he is a member of the Board of Directors, and from the Robert Wood Johnson Foundation, where he is on an advisory committee for a research career development program. Dr. Hollingworth and Mr. Comstock report no conflicts of interest.", "num_citations": "1\n", "authors": ["2089"]}
{"title": "Response to letter by North et al.\n", "abstract": " We are pleased to respond to the letter from Dr. North et al. We disagree that our study could have been a ‘‘well-designed RCT”‘‘for a similar effort and cost” and that an RCT would have improved the ‘‘equity of access to SCS among subjects”. We point out that the goal of our study was not to evaluate the efficacy of SCS, but rather to evaluate its benefits and risks in actual practice for FBSS in the Washington State workers’ compensation population [7]. Observational studies may be better suited than RCTs for evaluating the long-term risks and benefits of a therapy [4]. Conclusions regarding long-term benefits of a therapy evaluated in RCTs are often hampered by patient crossover to a non-randomized treatment. Most observers would agree that other advantages of observational studies relative to RCTs include their greater ease and lower costs, as well as the benefit of not restricting access to desired treatments [4 …", "num_citations": "1\n", "authors": ["2089"]}
{"title": "A response to Wasan editorial “Spinal cord stimulation in a workers’ compensation population: How difficult it can be to interpret a clinical trial”: Stimulating discussion\n", "abstract": " Regarding Dr. Wasan's concern about including opioid medication use in the primary composite outcome measure, we note that we also presented the results separately for the individual measures of pain intensity and function, and that the results and conclusions were similar: no difference between the spinal cord stimulation (SCS) group and the pain clinic and usual care groups at 12 or 24months.Dr. Wasan also raised the issue of our decision to include patients with unsuccessful trials in the SCS primary analysis group. The multi-center randomized clinical trial (RCT)[3] also considered the primary SCS analysis group to be all the patients who received a trial. As we explained in our article, excluding the patients who did not receive a permanent stimulator would have introduced bias by analyzing only the patients with a good initial response to SCS, but not similarly weeding out the patients with a poor initial …", "num_citations": "1\n", "authors": ["2089"]}