{"title": "Annotation: from paper books to the digital library\n", "abstract": " Readers annotate paper books as a routine part of their engagement with the materials; it is a useful practice. manifested through a wide variety of markings made in service of very different purposes. This paper examines the practice of annotation in a particular situation: the markings students make in university-level textbooks. The study focuses on the form and function of these annotations, and their status within a community of fellow textbook readers. Using this study as a basis, I discuss issues and implications for the design of annotation tools for a digital library setting.", "num_citations": "667\n", "authors": ["2088"]}
{"title": "Toward an ecology of hypertext annotation\n", "abstract": " Annotation is a key way in which hypertexts grow and increase in value. This paper first characterizes annotation according to a set of dimensions to situate a long-term study of a community of annotators. Then, using the results of the study, the paper explores the implications of annotative practice for hypertext concepts and for the development of an ecology of hypertext annotation, in which consensus creates a reading structure from an authorial structure.", "num_citations": "556\n", "authors": ["2088"]}
{"title": "Going digital: A look at assumptions underlying digital libraries\n", "abstract": " What are digital libraries, how should they be designed, how will they be used, and what relationship will they bear to what we now call “libraries”? Although we cannot hope to answer all these crucial questions in this short article, we do hope to encourage, and in some small measure to shape, the dialog among computer scientists, librarians, and other interested parties out of which answers may arise. Our contribution here is to make explicit, and to question, certain assumptions that underlie current digital library efforts. We will argue that current efforts are limited by a largely unexamined and unintended allegiance to an idealized view of what libraries have been, rather than what they actually are or could be. Since these limits come from current ways of thinking about the problem, rather than being inherent in the technology or in social practice, expanding our conception of digital libraries should serve to expand …", "num_citations": "407\n", "authors": ["2088"]}
{"title": "Formality considered harmful: Experiences, emerging themes, and directions on the use of formal representations in interactive systems\n", "abstract": " This paper reflects on experiences designing, developing, and working with users of a variety of interactive computer systems. The authors propose, based on these experiences, that the cause of a number of unexpected difficulties in human-computer interaction lies in users' unwillingness or inability to make structure, content, or procedures explicit. Besides recounting experiences with system use, this paper discusses why users reject or circumvent formalisms which require such explicit expression, and suggests how system designers can anticipate and compensate for problems users have in making implicit aspects of their tasks explicit. The authors propose computational approaches that address this problem, including incremental and system-assisted formalization mechanisms and methods for recognizing and using undeclared structure; they also propose non-computational solutions that involve …", "num_citations": "359\n", "authors": ["2088"]}
{"title": "Spatial hypertext: designing for change\n", "abstract": " Spatial hypertext has its origins in browser-based approaches in which the emerging hypertext network is portrayed graphically, in an overview, to promote coherence (see Thüring et al. in this issue); authors and readers interact with the hypertext using a map of its structure. In early conceptions of browser-based hypertext, boxes or other icons symbolized nodes, while lines represented the links among them; hypertext browsers were oriented toward presenting a graph representation of a network. NoteCards [9] and gIBIS [5] are examples of hypertext systems that used such a spatial map. But gIBIS differed from NoteCards in one crucial way: in NoteCards, the browser was used mainly as a means of visualizing existing network structure2; in gIBIS, the browser was the primary means of interacting with the emerging network as well as presenting it. Extensions to the node-link model, such as types and complex …", "num_citations": "344\n", "authors": ["2088"]}
{"title": "VIKI: Spatial hypertext supporting emergent structure\n", "abstract": " The emergent nature of structure is a crucial, but often ignored, constraint on authoring hypertexts. VIKI is a spatial hypertext system that supports the emergent qualities of structure and the abstractions that guide its creation. We have found that a visual/spatial metaphor for hypertext allows people to express the nuances of structure, especialy ambiguous, partial, or emerging structure, more easily. VIKI supports interpretation of a collected body of materials, a task that becomes increasingly important with the availability of on-line information sources. The tool's data model includes semi-structured objects, collections that provide the basis for spatial navigation, and object composites, all of which may evolve into types. A spatial parser supports this evolution and enhances user interaction with changing, visually apparent organizations.", "num_citations": "333\n", "authors": ["2088"]}
{"title": "Aquanet: a hypertext tool to hold your knowledge in place\n", "abstract": " Hypertext systems have traditionally focused on information management and presentation. In contrast, the Aquanet hypertext system described in this paper is designed to support knowledge structuring tasks. Aquanet is a browser-based tool that allows users to graphically represent information in order to explore its structure. In this paper, we discuss our motivaticms for developing Aquanet. We then describe the basic concepts underlying the tool and give an overview of the user interface. We close with some brief comments about our initial experiences with the tool in use and some of the directions we see the Aquanet research moving in the near future.1. iNTRODUCTIONThe power of hypertext derives from its dual nature: hypertext is simultaneously a tool for managing and presenting information and a tool for representing the underlying structure of that information. Aithough this essential duaiity has been duly …", "num_citations": "293\n", "authors": ["2088"]}
{"title": "Spatial hypertext and the practice of information triage\n", "abstract": " Information triage is the process of sorting through relevant materials, and organizing them to meet the needs of the task at hand. It is a practice that has become increasingly common with the advent of “at your fingertips” information resources, To explore the characteristics of information triage and its interaction with spatial hypertext, a medium we claim supports the process, we have studied subjects engaged in a time-constrained decision-making task using a large set of relevant documents. We use the study task to investigate information triage under three different conditions: one in which the participants used paper documents, and two others in which the participants used variants of VIKI, a spatial hypertext system. Our findings suggest that during information triage attentional resources are devoted to evaluating materials and organizing them, so they can be read and reread as they return to mind. Accordingly …", "num_citations": "248\n", "authors": ["2088"]}
{"title": "Exploring the relationship between personal and public annotations\n", "abstract": " Today people typically read and annotate printed documents even if they are obtained from electronic sources like digital libraries If there is a reason for them to share these personal annotations online, they must re-enter them. Given the advent of better computer support for reading and annotation, including tablet interfaces, will people ever share their personal digital ink annotations as is, or will they make substantial changes to them? What can we do to anticipate and support the transition from personal to public annotations? To investigate these questions, we performed a study to characterize and compare students' personal annotations as they read assigned papers with those they shared with each other using an online system. By analyzing over 1, 700 annotations, we confirmed three hypotheses:(1) only a small fraction of annotations made while reading are directly related to those shared in discussion;(2 …", "num_citations": "238\n", "authors": ["2088"]}
{"title": "Which semantic web?\n", "abstract": " Through scenarios in the popular press and technical papers in the research literature, the promise of the Semantic Web has raised a number of different expectations. These expectations can be traced to three different perspectives on the Semantic Web. The Semantic Web is portrayed as:(1) a universal library, to be readily accessed and used by humans in a variety of information use contexts;(2) the backdrop for the work of computational agents completing sophisticated activities on behalf of their human counterparts; and (3) a method for federating particular knowledge bases and databases to perform anticipated tasks for humans and their agents. Each of these perspectives has both theoretical and pragmatic entailments, and a wealth of past experiences to guide and temper our expectations. In this paper, we examine all three perspectives from rhetorical, theoretical, and pragmatic viewpoints with an eye …", "num_citations": "192\n", "authors": ["2088"]}
{"title": "Dynamic content database for multiple document genres\n", "abstract": " A system and method for receiving, analyzing, and managing key information extracted from input documents in multiple document genres. A document “genre” is the social environment that defines the document's expected structure and content. Information is extracted from the input documents based on their genre, and is synthesized into a distributed genre document, or database, representing all extracted information from all input documents. An output document having a selected genre is created by assembling information from the database consistent with the selected genre.", "num_citations": "183\n", "authors": ["2088"]}
{"title": "Hypertext paths and the World-Wide Web: experiences with Walden's Paths\n", "abstract": " Walden’s Paths applies the concept of hypertextual paths to the World-Wide Web. Walden’s Paths is being developed for use in the K-12 school environment. Theheterogeneity of the Web coupled with the desirability of supporting the teacher-student relationship make this an interesting and challenging project. We describe the Walden’s Paths implementation, discuss the elements that affected its design and architecture, and report on our experiences with the system in use.", "num_citations": "176\n", "authors": ["2088"]}
{"title": "Finding and using implicit structure in human-organized spatial layouts of information\n", "abstract": " Many interfaces allow users to manipulate graphical objects, icons representing underlying data or the data themselves, against a spatial backdrop or canvas. Users take advantage of the flexibility offered by spatial manipulation to create evolving lightweight structures. We have been investigating these implicit organizations so we can support user activities like information management or exploratory analysis. To accomplish this goal, we have analyzed the spatial structures people create in diverse settings and tasks, developed algorithms to detect the common suiictures we identified in our survey, and experimented with new facilities based on recognized structure. Similar recognitionbased functionality can be used within many common applications, providing more support for users' activities with less attendant overhead.", "num_citations": "171\n", "authors": ["2088"]}
{"title": "Guided tours and on-line presentations: How authors make existing hypertext intelligible for readers\n", "abstract": " Hypertext systems like NoteCards provide facilities for authoring large networks. But they provide little support for the associated task of making these networks intelligible to future readers. Presentation conventions may be imported from other related media, but because the conventions have not yet been negotiated within a community of hypertext readers and writers, they provide only a partial solution to the problem of guiding a reader through an existing network of information. In this paper, we will discuss how a recent facility, Guided Tours, has been used to organize hypertext networks for presentation. The use of Guided Tours in NoteCards has exposed a set of authoring issues, and has provided us with examples of solutions to the problems associated with on-line presentations.", "num_citations": "167\n", "authors": ["2088"]}
{"title": "The reading appliance revolution\n", "abstract": " In the 1970s, Alan Kay and his colleagues at Xerox PARC envisioned a dynamic, interactive electronic book. Now, nearly 30 years later, that vision has become a reality. A new kind of personal information appliance-the reading appliance-is emerging as a tool for serious readers. But is the world ready for reading appliances? The authors believe that these appliances are indeed viable. Advances in mobile hardware have made it possible to build the necessary hardware. Additionally, the Web has created a market for online reading by introducing millions of people to it, and books, magazines, newspapers, advertisements, and other printed matter can be produced and read at very low cost. Network based digital libraries increase the availability of information, but people still tend to print the documents to work with them. Electronic book and document readers will neither replace paper nor will they replace desktop …", "num_citations": "165\n", "authors": ["2088"]}
{"title": "Distributed document-based calendaring system\n", "abstract": " A system and method for receiving, analyzing, and managing a database of calendar information obtained from a variety of source documents. Information derived and extracted from calendar documents is used establish a database of events. Extraction of relevant information from the calendar documents is facilitated by guidance in the form of user input, document templates, or other specification of the structure and content of the calendar documents.", "num_citations": "161\n", "authors": ["2088"]}
{"title": "Anchored conversations: adhesive, in-context, virtual discussion forums\n", "abstract": " Anchored conversations are maintained by a conversation coordinator that retrieves an anchor position from an artifact and maintains a position of a conversation client relative to the retrieved anchor position. The conversations are synchronous and asynchronous communications. The anchors, and hence the conversations may be moved within the artifact or to other artifacts. The conversation clients include detach and re-attach buttons that allow a conversation to be detached and reattached from/to a corresponding anchor. The conversation coordinator manages conversations anchored in any number of different applications. Each conversation is accessible either by invoking an associated anchor within a corresponding artifact (embodied as an ActiveX control, for example), or via the conversation coordinator. A database is connected to each conversation and is a silent participant maintaining a record of the …", "num_citations": "152\n", "authors": ["2088"]}
{"title": "Searching for the missing link: Discovering implicit structure in spatial hypertext\n", "abstract": " Hypertext may be implicitly structured, based on either node content or context. In this paper, we examine implicit structures that rely on the interpretation of node’s spatiial context. Hypertext authors and readers can perceive and understand these idiosyncratic structures, but, because they are implicit, they cannot be used by the system to support users’ activities. We have explored spatially structured hypertext authored in three different systems, and have developed heuristic recognition algorithms based on the results of our analyses of the kinds of structures that people build. Our results indicate that (1) recognition of implicit structures in spatial hypertext is feasible,(2) interaction will be important in guiding such recognition, and (3) the hypertext system can provide layout facilities that will render later systematic interpretation much easier. Found structures can be used as a basis for supporting information …", "num_citations": "150\n", "authors": ["2088"]}
{"title": "Reading and writing the electronic book\n", "abstract": " Developments over the last twenty years have fueled considerable speculation about the future of the book and of reading itself. This book begins with a gloss over the history of electronic books, including the social and technical forces that have shaped their development. The focus then shifts to reading and how we interact with what we read: basic issues such as legibility, annotation, and navigation are examined as aspects of reading that ebooks inherit from their print legacy. Because reading is fundamentally communicative, I also take a closer look at the sociality of reading: how we read in a group and how we share what we read. Studies of reading and ebook use are integrated throughout the book, but Chapter 5 \"goes meta\" to explore how a researcher might go about designing his or her own reading-related studies. No book about ebooks is complete without an explicit discussion of content preparation, i.e …", "num_citations": "142\n", "authors": ["2088"]}
{"title": "Turning the page on navigation\n", "abstract": " In this paper, we discuss the findings of an in-depth observational study of reading and within-document navigation and add to these findings the results of a second analysis of how people read comparable digital materials on the screen, given limited navigational functionality. We chose periodicals as our initial foil since they represent a type of material that invites many different kinds of reading and strategies for navigation. Using multiple sources of evidence from the data, we first characterize readers' navigation strategies and specific practices as they make their way through the magazines. We then focus on two observed phenomena that occur when people read paper magazines, but are absent in their digital equivalents: the lightweight navigation that readers use unself-consciously when they are reading a particular article and the approximate navigation readers engage in when they flip multiple pages at a …", "num_citations": "141\n", "authors": ["2088"]}
{"title": "Two years before the mist: experiences with Aquanet\n", "abstract": " Aquanet is a collaborative hypertext tool that combines elements of frame-based knowledge representation and graphical presentation. In this paper, we examine the first major application of the tool in an analysis task, a two year long technology assessment that Rsulted in ahnost 2000 nodes and more than 20 representational types. First, we cover the implications of the representational resourees provided and representational deeisions that were made. Then we discuss how spatial layout was used in lieu of the complex relations Aquanet’s data model supports. Finally, we show how distinct regions emerged to refleet particular activities and how they were subsequently used as the basis for a later collaboration on a Similar task.", "num_citations": "134\n", "authors": ["2088"]}
{"title": "Cimbiosys: A platform for content-based partial replication\n", "abstract": " Increasingly people manage and share information across a wide variety of computing devices from cell phones to Internet services. Selective replication of content is essential because devices, especially portable ones, have limited resources for storage and communication. Cimbiosys is a novel replication platform that permits each device to define its own content-based filtering criteria and to share updates directly with other devices. In the face of fluid network connectivity, redefinable content filters, and changing content, Cimbiosys ensures two properties not achieved by previous systems. First, every device eventually stores exactly those items whose latest version matches its filter. Second, every device represents its replication-specific metadata in a compact form, with state proportional to the number of devices rather than the number of items. Such compact representation results in low data synchronization overhead, which permits ad hoc replication between newly encountered devices and frequent replication between established partners, even over low bandwidth wireless networks.", "num_citations": "133\n", "authors": ["2088"]}
{"title": "Digital memories in an era of ubiquitous computing and abundant storage\n", "abstract": " A lifetime of digital memories is possible but raises many social, as well as technological, questions.", "num_citations": "133\n", "authors": ["2088"]}
{"title": "The long term fate of our digital belongings: Toward a service model for personal archives\n", "abstract": " We conducted a preliminary field study to understand the current state of personal digital archiving in practice. Our aim is to design a service for the long-term storage, preservation, and access of digital belongings by examining how personal archiving needs intersect with existing and emerging archiving technologies, best practices, and policies. Our findings not only confirmed that experienced home computer users are creating, receiving, and finding an increasing number of digital belongings, but also that they have already lost irreplaceable digital artifacts such as photos, creative efforts, and records. Although participants reported strategies such as backup and file replication for digital safekeeping, they were seldom able to implement them consistently. Four central archiving themes emerged from the data: (1) people find it difficult to evaluate the worth of accumulated materials; (2) personal storage is highly …", "num_citations": "126\n", "authors": ["2088"]}
{"title": "The future of annotation in a digital (paper) world\n", "abstract": " If order-making in the large is part of the institutional mission of libraries, then order-making in the small—i.e., the informal work of annotating and organizing materials collected in the service of particular dayto- day work or pleasure—is part of the business of library patrons. This discussion focuses on just such activities; activities that stem from readers' engagements with texts, and possibly with each other, against a backdrop of real-world settings and practices. I hesitate to call digital library patrons users, since that is the word computer scientists tend to use to hide the characteristics of what we hope is a diverse population.", "num_citations": "119\n", "authors": ["2088"]}
{"title": "Sharing encountered information: digital libraries get a social life\n", "abstract": " As part of a more extensive study of reading-related practices, we have explored how people share information they encounter in their everyday reading as a complement to the more traditional digital library focus on sharing intentionally retrieved materials. In twenty contextual interviews in home and workplace settings, we investigated how people encounter and save published material in the form of paper and electronic clippings. We found that sharing forms a significant use for, encountered materials. Furthermore, the function of these clippings extends far beyond a simple exchange of content to inform the recipient; in fact, the content itself may have little immediate value to the recipient. We also found the practice to be ubiquitous: all of our participants had both shared clippings with others and received them themselves. Specifically, This work reports on: (1) how sharing encountered items fits into the broader …", "num_citations": "113\n", "authors": ["2088"]}
{"title": "Introducing a digital library reading appliance into a reading group\n", "abstract": " How will we read digital library materials? This paper describes the reading practices of an on-going reading group, and how these practices changed when we introduced XLibris, a digital library reading appliance that uses a pen tablet computer to provide a paper-like interface. We interviewed group members about their reading practices, observed their meetings, and analyzed their annotations, both when they read a paper document and when they read using XLibris. We use these data to characterize their analytic reading, reference use, and annotation practices. We also describe the use of the Reader’s Notebook, a list of clippings that XLibris computes from a reader’s annotations. Implications for digital libraries stem from our findings on reading and mobility, the complexity of analytic reading, the social nature of reference following, and the unselfconscious nature of readers’ annotations.", "num_citations": "111\n", "authors": ["2088"]}
{"title": "Reading-in-the-small: a study of reading on small form factor devices\n", "abstract": " The growing ubiquity of small form factor devices such as Palm Pilots and Pocket PCs, coupled with widespread availability of digital library materials and users' increasing willingness to read on the screen, raises the question of whether people can and will read digital library materials on handhelds. We investigated this question by performing a field study based on a university library's technology deployment: two classes were conducted using materials that were available in e-book format on Pocket PCs in addition to other electronic and paper formats. The handheld devices, the course materials, and technical support were all provided to students in the courses to use as they saw fit. We found that the handhelds were a good platform for reading secondary materials, excerpts, and shorter readings; they were used in a variety of circumstances where portability is important, including collaborative situations such …", "num_citations": "109\n", "authors": ["2088"]}
{"title": "System and method for extracting data from audio messages\n", "abstract": " A system and method for extracting key information from digitized audio messages, including telephone voice messages. Information, such as a telephone number and the name of the caller, is derived and extracted from a voice message and used to establish links to the information within the message. The telephone number and name of the caller can then be replayed without the need to replay the entire voice message. The telephone number and name of the caller can also be used as indices into an information database.", "num_citations": "109\n", "authors": ["2088"]}
{"title": "Digital Libraries: Issues and Architectures.\n", "abstract": " The research field of digital libraries must be viewed as a union of subfields from a variety of domains combined with new research issues in order to realize its full potential. A clear exposition of the research issues involved has not yet been given. Most approaches to building digital library systems have thus far been limited to addressing specific digital library problems as variations of problems from other fields. This paper presents a taxonomy of digital library elements. Consideration of the elements in this taxonomy helps suggest a variety of issues. Example elements and some issues they suggest are used to populate the taxonomy. The paper continues by presenting a general digital library system architecture. Issues suggested by the taxonomy are shown to have implications at many levels of digital library system architectures for both design and implementation. This is illustrated by considering the implications of one issue (personalizing presentations) at several architectural levels and in the context of a set of current technologies.", "num_citations": "108\n", "authors": ["2088"]}
{"title": "Detection and processing of annotated anchors\n", "abstract": " A system, apparatus, and article of manufacture for detecting a reader's interest in a particular external document through their markings and annotations, and processing the marks in various ways, is provided. By detecting anchors proximal to annotations made by a reader, a collection of the annotated anchors and the related documents may be organized and generated for a reader to process according to their desires.", "num_citations": "107\n", "authors": ["2088"]}
{"title": "Spatial hypertext: an alternative to navigational and semantic links\n", "abstract": " Hypertext began as a vision of interconnected reference materials [Bush 1945] and literature [Robertson 1998]. These early visions were joined by working systems that supported link-based navigation among documents as well as branching points within (hyper) documents [Engelbart 1984]. As the use of hypertext systems became more widespread, researchers realized that readers could become confused or lost as they navigated large networks [Conklin 1987a]. Systems such as NoteCards [Halasz 1987] addressed this problem by displaying maps of the hypertext's network structure. The success of NoteCards's\" browser cards\" and other hypertext maps gave rise to systems in which the user's main interaction with the hypertext was through a network map rather than a document viewer. For example, systems such as gIBIS [Conklin 1988] and Aquanet [Marshall 1991] presented a visual network containing typed …", "num_citations": "103\n", "authors": ["2088"]}
{"title": "Representing the structure of a legal argument\n", "abstract": " As our representational starting point, we used Toulmin’s formalism for logical structure [Toulmin 19581. According to his scheme, a datum is some fact or observation about the situation under discussion that leads to some further observation or fact, the claim. The relation between the two is characterized by a rule of inference, a warrant, that serves to link the information set forth in the datum and claim. A backing supports the warrant with some knowledge structure from the argument’s domain. A Toulmin argument structure may also include various kinds of qualifications of the claim (quulifiers) and allow for exceptions (rebuttals). The categories provided by this structure are useful for expressing portions of argument logic.", "num_citations": "103\n", "authors": ["2088"]}
{"title": "How people manage personal information over a lifetime\n", "abstract": " How will we manage our heterogeneous collections of digital information over a lifetime? How will we look through many decades worth of digital belongings? What will our digital legacy be? We can think of long-term PIM issues from three equally important perspectives:(1) storing the digital belongings we have amassed over the years (long-term storage);(2) maintaining these belongings in a form that allows them to be viewed, used, or possibly even changed (preservation); and (3) providing individual and collaborative mechanisms for reclaiming these belongings from long-term digital storage (access).", "num_citations": "97\n", "authors": ["2088"]}
{"title": "Saving and using encountered information: implications for electronic periodicals\n", "abstract": " As part of a focus on electronic publications, we undertook an exploratory study of how people saved and used the information they encountered while reading. In particular, we wanted to understand the role of clipping and whether it would be a necessary form of interaction with electronic publications. We interviewed 20 diverse individuals at home and at work, bringing together narrative accounts and physical and digital examples to investigate how people currently collect and use clippings from their everyday reading. All study participants had examples of materials they had deliberately saved from periodicals, ranging from ads torn from newspapers and URLs received in email messages to large stacks of magazines. Participants rarely read periodicals specifically to clip but rather recognized items of interest when they were encountered. The work highlights the importance of encountering information as an …", "num_citations": "92\n", "authors": ["2088"]}
{"title": "Pushing Toulmin too far: Learning from an argument representation scheme\n", "abstract": " Many researchers have proposed representational schemes to capture complex reasoned discourses. In this paper, we use our experiences with argument representation to examine some of the issues affecting the design of these representational schemes. Our discussions focus on how well a particular scheme, Toulmin structures, maps into the domain of argumentative discourse and captures and highlights various phenomena we consider central to argumentation. We then use this analysis to explore several complementary representational schemes. Finally, we discuss some relatively unexplored factors that influence the usability of these schemes.", "num_citations": "88\n", "authors": ["2088"]}
{"title": "Designing e-books for legal research\n", "abstract": " In this paper we report the findings from a field study of legal resea rch in a first-tier law school and on the resulting redesign of XLibris, a next-generation e-book. We first characterize a work setting in which we expected an e-book to be a useful interface for reading and otherwise using a mix of physical and digital library materials, and explore what kinds of reading-related functionality would bring value to this setting. We do this by describing important aspects of legal research in a heterogeneous information environment, including mobility, reading, annotation, link following and writing practices, and their general implications for design. We then discuss how our work with a user community and an evolving e-book prototype allowed us to examine tandem issues of usability and utility, and to redesign an existing e-book user interface to suit the needs of law students. The study caused us to move away from the …", "num_citations": "87\n", "authors": ["2088"]}
{"title": "Making Metadata: a study of metadata creation for a mixed physical-digital collection\n", "abstract": " Metadata is an important way of creating order in emerging distributed digital library collections. This paper presents an analysis of ethnographic data gathered in a university library’s educational technology center as the staff develops metadata for a mixed physical-digital collection of visual resources. In particular, the paper explores issues associated with the application of standards, uncertain collection and metadata boundaries, distribution and responsibility, the types of description that arise in practice, and metadata temporality and scope. These issues help to characterize a problem space, and to explore the trade-offs collection maintainers must face when they create metadata for heterogeneous materials.", "num_citations": "87\n", "authors": ["2088"]}
{"title": "Rethinking the web as a personal archive\n", "abstract": " In recent years the Web has evolved substantially, transforming from a place where we primarily find information to a place where we also leave, share and keep it. This presents a fresh set of challenges for the management of personal information, which include how to underpin greater awareness and more control over digital belongings and other personally meaningful content that is hosted online. In the study reported here, we follow up on research that suggests a sense of ownership and control can be reinforced by federating online content as a virtual, single store; we do this by conducting interviews with 14 individuals about their Web-based content. Participants were asked to give the researchers a tour of online content that is personally meaningful to them; to perform a search for themselves in order to uncover additional content; and to respond to a series of design envisionments. We examine whether …", "num_citations": "82\n", "authors": ["2088"]}
{"title": "Recognizing user interest and document value from reading and organizing activities in document triage\n", "abstract": " People frequently must sort through large sets of documents to identify useful materials, for example, when they look through web search results. This document triage process may involve both reading and organizing, possibly using different applications for each activity. Users' interests may be inferred from what they read and how they interact with individual documents; these interests may in turn be used as a basis for identifying other documents or document elements of potential interest within the set. To most effectively identify related documents of interest, activity data must be collected from all applications used in document triage. In this paper we present a common framework (the Interest Profile Manager) for collecting and analyzing user interest. We also present models for detecting user interest based on reading activity alone, on organizing activity alone, and on combined reading and organizing activity. A …", "num_citations": "82\n", "authors": ["2088"]}
{"title": "That syncing feeling: early user experiences with the cloud\n", "abstract": " We studied how people use file sync and sharing services to better understand how early adopters conceptualize their interactions with the cloud. A survey of 106 users provided background information about current use of these cloud storage services and identified 19 people for in-depth interviews. Use cases described in the interviews revealed a hierarchy of concepts that participants needed to master to make full use of these services. Five pivotal concepts demonstrate that users make sense of the cloud as a: personal file repository, shared file repository, personal replicated file store, shared replicated file store, and synchronization mechanism that coordinates among replicas. We propose specific ways in which process transparency and interface scaffolding can help users build a more robust model of cloud services.", "num_citations": "79\n", "authors": ["2088"]}
{"title": "Reading and interactivity in the digital library: Creating an experience that transcends paper\n", "abstract": " Recently I read two articles in the Communications of the ACM that made parallel, if somewhat alarming, claims. The first, from Peter Neumann’s column,“Inside Risks,” observed that “we seem to have evolved into a mentality of ‘If it’s not on the Internet, it doesn’t exist.’” He also notes that the Web duplicates very little of the material we might find in traditional institutions like public libraries [24]. The second article, by Leah Graham and Panagiotis Takis Mataxas, points to experimental evidence that although most of today’s students do research exclusively on the Internet, very few of them double-check the information that they find, or–better yet–locate multiple independent sources to corroborate what they’ve learned from a single source [6].From my point of view, these articles point to two important research questions. First, and most fundamentally, much of what we read when we research a topic now arrives in digital form; how can we ensure that people are able to read it when and where they retrieve it? The second, and more provocative of the two questions is: How will people interact and work with these digital materials in a way that transcends paper to take advantage of digital media and the power of computers? The Graham and Mataxas article implies that there is a need to go beyond simply reading a single digital resource; critical thinking must be taught and the tools to support critical thinking must be available too. In other words, people must be able to interact with what they’ve found.", "num_citations": "79\n", "authors": ["2088"]}
{"title": "From personal to shared annotations\n", "abstract": " Preliminary results obtained by comparing personal annotations on paper with shared annotations made on-line show that only a small fraction of personal annotations are used in initiating and responding to related on-line discussions. The personal annotations that are shared tended to correspond to explicit marginalia; much effort is still put into rendering both the content and anchors of thse annotations intelligible to others.", "num_citations": "77\n", "authors": ["2088"]}
{"title": "Identifying useful passages in documents based on annotation patterns\n", "abstract": " Many readers annotate passages that are important to their work. If we understand the relationship between the types of marks on a passage and the passage’s ultimate utility in a task, then we can design e-book software to facilitate access to the most important annotated parts of the documents. To investigate this hypothesis and to guide software design, we have analyzed annotations collected during an earlier study of law students reading printed case law and writing Moot Court briefs. This study has allowed us to characterize the relation-ship between the students’ annotations and the citations they use in their final written briefs. We think of annotations that relate directly to the written brief as high-value annotations; these annotations have particular, detectable characteristics. Based on this study we have designed a mark parser that analyzes freeform digital ink to identify such high-value annotations.", "num_citations": "76\n", "authors": ["2088"]}
{"title": "Systems and methods for automatic emphasis of freeform annotations\n", "abstract": " A system for automatic emphasis of freeform annotations contained within an electronic document is performed based on a determined importance of each annotation. The importance of each annotation is determined by a mark parser that groups, types and ranks each of the annotations. A weighted value is assigned to each grouped, ranked and typed annotation based on temporal and spatial information. The display characteristics of the weighted annotation is altered based on the weighted value.", "num_citations": "75\n", "authors": ["2088"]}
{"title": "Experiences surveying the crowd: Reflections on methods, participation, and reliability\n", "abstract": " Crowdsourcing services such as Amazon's Mechanical Turk (MTurk) provide new venues for recruiting participants and conducting studies; hundreds of surveys may be offered to workers at any given time. We reflect on the results of six related studies we performed on MTurk over a two year period. The studies used a combination of open-ended questions and structured hypothetical statements about story-like scenarios to engage the efforts of 1252 participants. We describe the method used in the studies and reflect on what we have learned about identified best practices. We analyze the aggregated data to profile the types of Turkers who take surveys and examine how the characteristics of the surveys may influence data reliability. The results point to the value of participant engagement, identify potential changes in MTurk as a study venue, and highlight how communication among Turkers influences the data …", "num_citations": "73\n", "authors": ["2088"]}
{"title": "System and method for displaying and navigating links\n", "abstract": " A Web browser provides the ability to separate content and hyper-links from a Web page and provides a list of the links for viewing on a mobile device display screen, enabling more effective Web page navigating using the limited mobile device display. In addition to the links from the Web page, further links are created to telephone numbers, addresses, and other communication-related information in the Web page to further enhance usability of the Web page information for mobile device users. Further, once a link is selected using the mobile device, a services portal link is provided to the mobile device display to provide selection of services to be performed on the selected link, such as faxing or printing. Further, the services are made link dependent, or user dependent so that specific services can be displayed depending on factors such as the availability of services provided specifically from a Web page owner for …", "num_citations": "73\n", "authors": ["2088"]}
{"title": "Making large-scale information resources serve communities of practice\n", "abstract": " Community memory can provide the crucial bridge between large-scale information bases like digital libraries and the day-to-day activities ofa community’s members. Just as a digital library is based on a general structure and conventional means of access to diverse collections of materials, a community memory will help cull and shape the structure and contents of this collection to meet more particular needs. But it is by no means straightforward for people to collect, maintain, share, and apply the materials that are part of a community memory. Useful and usable community memories require support for: (1) the acquisition and evolution of content and structure; (2) the identification of materials and community members relevant to a particular task; and (3) the maintenance of organizations that are mutually intelligible across the community. In this paper, we explore issues related to these three requirements based on …", "num_citations": "73\n", "authors": ["2088"]}
{"title": "Evaluating personal archiving strategies for Internet-based information\n", "abstract": " Internet-based personal digital belongings present different vulnerabilities than locally stored materials. We use responses to a survey of people who have recovered lost websites, in combination with supplementary interviews, to paint a fuller picture of current curatorial strategies and practices. We examine the types of personal, topical, and commercial websites that respondents have lost and the reasons they have lost this potentially valuable material. We further explore what they have tried to recover and how the loss influences their subsequent practices. We found that curation of personal digital materials in online stores bears some striking similarities to the curation of similar materials stored locally in that study participants continue to archive personal assets by relying on a combination of benign neglect, sporadic backups, and unsystematic file replication. However, we have also identified issues specific to …", "num_citations": "69\n", "authors": ["2088"]}
{"title": "Exploring representation problems using hypertext\n", "abstract": " Hypertext is a technology well-suited to exploring different kinds of representational problems. It can be used first as an informal mechanism to describe the attributes of objects and to capture relationships between the objects. Then hypertext structures can be constrained into a more formal representation of a domain, model, or analytic technique. A range of strategies for using hypertext can be employed to describe a problem and converge on an appropriate representation; competing representations can be informally evaluated to compare their relative expressive power.", "num_citations": "69\n", "authors": ["2088"]}
{"title": "Multi-moded scanning pen with feedback\n", "abstract": " A scanning pen for use in an information management system having multiple modes adapted to scan and process different data types. The scanning pen has an optical scanning head, various user controls, and a wireless link to the information management system. The pen has several input modes of operation governing the interpretation of data received through the scanning head, and feedback on the current input mode is provided to the user through visual, audible, or tactile feedback.", "num_citations": "68\n", "authors": ["2088"]}
{"title": "Collaborating over portable reading appliances\n", "abstract": " Reading appliances or e-books hold substantial promise to help us collaborate. In this paper, we use a study of group activity — a reading group that meets to discuss articles of mutual interest — to explore four scenarios for collaborating with e-books: (1) meetings and face-to-face discussions; (2) serendipitous sharing of annotations, as when we borrow a document from a colleague or buy a used book; (3) community-wide use of anonymous annotations to guide future readers; and (4) e-books as a basis for initiating interaction between people. In so doing, we describe some methods for implementing these facilities, and introduce design guidelines.", "num_citations": "62\n", "authors": ["2088"]}
{"title": "Beyond location: hypertext workspaces and non-linear views\n", "abstract": " With the growth of the Web as a public information resource, users need workspaces to support the collection, evaluation, organization, and annotation of the materials they retrieve. These analytic workspaces should be designed for both the casual and professional analyst, keeping in mind that different environments may be appropriate for each type of use. In this paper, we derive a set of requirements from observations and reports on the use of information workspaces, coupled with observations of people performing analytical tasks. These workspace requirements include:(1) support for performing multiple simultaneous tasks;(2) a variety of activity-based connections to information resources;(3) tailorable and manipulable reduced document representations; and (4) visualizations to help users manage screen space. We explore the trade-offs implied by these requirements using our implementation of multiple …", "num_citations": "62\n", "authors": ["2088"]}
{"title": "Systems and methods for sharing high value annotations\n", "abstract": " Techniques are provided for displaying sets of high value annotation information while maintaining the contextual relevance of the high value annotations to the source portion of the annotated document. A selection criteria such as annotator name, time or other criteria, is applied to the high value annotations. High value annotations having overlapping display locations in the source document are determined and the overlap resolved based on a presentation style. The high value annotations and the document is displayed based on the presentation style.", "num_citations": "61\n", "authors": ["2088"]}
{"title": "Systems and methods for supporting document centered discussion across heterogeneous devices and displays\n", "abstract": " The decreasing cost of communication has led to a focus on including workgroup participants based on their abilities rather than their physical location. However, collaboration workgroup participants are still dependent on electronic documents which are difficult or impossible to view on smaller web-enabled devices such as web-enabled phones, web-enabled personal digital assistants and the like. If the documents can be viewed at all, they must be pre-encoded for a single format supported across all devices, or the range of participating devices must be limited to a single display type. Furthermore, some document types may require hardware upgrades including expanded memory to load the additional code necessary to view the document. This excludes impromptu workgroup formation since the device types of the collaborating users and/or the set of required documents for a meeting cannot always be …", "num_citations": "61\n", "authors": ["2088"]}
{"title": "Washington’s white horse? A look at assumptions underlying digital libraries\n", "abstract": " Are digital libraries necessarily archival collections of digital materials to be browsed and queried by information-seeking individuals? While this seems to be the prevailing view, we argue instead that the design of digital libraries must take into account a broader range of materials, technologies, and practices--transient as well as permanent documents, fluid as well as fixed materials, paper as well as digital technologies, and collaborative as well as individual practices. To illustrate, we discuss the work practices of one particular community, information analysts, and conclude by exploring some implications for technology development raised by this broadened perspective.", "num_citations": "58\n", "authors": ["2088"]}
{"title": "Service portal for links separated from Web content\n", "abstract": " A Web browser provides the ability to separate content and hyper-links from a Web page and provides a list of the links for viewing on a mobile device display screen, and once a link is selected using the mobile device, a services portal link is provided to the mobile device display to provide selection of services to be performed on the selected link, such as faxing or printing. Further, the services are made link dependent, or user dependent so that specific services can be displayed depending on factors such as the availability of services provided specifically from a Web page owner for link dependent services, or for the location of a user relative to a print service provider for user dependent services.", "num_citations": "52\n", "authors": ["2088"]}
{"title": "Keeping encountered information\n", "abstract": " Utility, serendipity, and the pleasure of encountering what we save relies on more than search alone when using PIM tools.", "num_citations": "50\n", "authors": ["2088"]}
{"title": "Creating educational guided paths over the world-wide web\n", "abstract": " The extensive and encyclopedic materials found on the World-Wide Web must be tailored and contextualized to support the instructional goals of education. We have applied the concept of a guided path, an ordered list of pages independent of the existing Web structure, and have implemented a prototype (Walden’s Paths). Besides creating the structure, a teacher may annotate the individual pages of a path to provide transition, emphasis, and missing explanation. In addition, some limited interactivity and control over the display of remote information is possible in our prototype. Walden’s Paths works with existing Web browsers and servers allowing its integration into an educational setting with existing hardware and software.", "num_citations": "50\n", "authors": ["2088"]}
{"title": "Challenges and opportunities for personal digital archiving\n", "abstract": " Until recently, the question of what people saved and valued centered on physical artifacts. It is only in the last decade or so, with the rise of cheap digital recording equipment (eg cameras), and equally cheap storage, that people began to accumulate significant collections of digital belongings. Using qualitative data gathered across a range of different personal digital archiving studies, this chapter examines the kinds of digital belongings people keep, how they think about deletion and loss, and how these notions translate into strategies and tactics for keeping digital material safe, both at home, and in the cloud. The chapter also explores elements of digital stewardship and personal collection building practiced by everyday people with an eye toward guiding them to a set of best practices to supplement what they already do.", "num_citations": "47\n", "authors": ["2088"]}
{"title": "Genre as reflection of technology in the world-wide web\n", "abstract": " The World-Wide Web has greatly increased the number of hypermedia designers and practitioners—the people who read and write, and otherwise use, hypermedia in their day-to-day activities. Through practice, they have developed new communicative forms: a set of hypermedia document genres. We examine the genres that are arising on the World-Wide Web as a foil for discussing the interaction between hypermedia design practice, hypermedia technology, and the types of hyperdocuments that evolve. The Web creates a particularly fertile environment for looking at such interactions, since the technology is familiar, examples abound, and evolution is rapid.", "num_citations": "47\n", "authors": ["2088"]}
{"title": "Putting digital libraries to work: Issues from experience with community memories\n", "abstract": " Community memory can provide the crucial bridge between large-scale digital libraries and the day-to-day activities of a community's members. Just as a digital library is based on a general structure and conventional means of access to diverse collections of materials, a community memory culls and shapes the structure of this collection to meet more particular needs; it provides a unique perspective on a larger, more general collection. Useful and usable community memories require support for:(1) the acquisition and evolution of content and structure;(2) the maintenance of mutually intelligible organizations; and (3) the identification of relevant materials. In this paper, we explore issues related to these three requirements based on our experiences with the development and use of shared hypermedia information resources.", "num_citations": "47\n", "authors": ["2088"]}
{"title": "Social media ownership: using twitter as a window onto current attitudes and beliefs\n", "abstract": " Social media, by its very nature, introduces questions about ownership. Ownership comes into play most crucially when we investigate how social media is saved or archived; how it is reused; and whether it can be removed or deleted. We investigate these social media ownership issues using a Mechanical Turk survey of Twitter users; the survey uses open-ended questions and statements of belief about realistic Twitter-based scenarios to give us a window onto current attitudes and beliefs. Our findings reveal that respondents take a liberal attitude toward saving and storing the tweets that they encounter. More caution is exercised with republishing the material, and still more with sharing the material among friends and associates. Respondents approach removal of this type of lightweight social media most cautiously. The material's provenance and the respondents' relationship to the material (whether they are the …", "num_citations": "43\n", "authors": ["2088"]}
{"title": "Are some tweets more interesting than others?# hardquestion\n", "abstract": " Twitter has evolved into a significant communication nexus, coupling personal and highly contextual utterances with local news, memes, celebrity gossip, headlines, and other microblogging subgenres. If we take Twitter as a large and varied dynamic collection, how can we predict which tweets will be interesting to a broad audience in advance of lagging social indicators of interest such as retweets? The telegraphic form of tweets, coupled with the subjective notion of interestingness, makes it difficult for human judges to agree on which tweets are indeed interesting.", "num_citations": "41\n", "authors": ["2088"]}
{"title": "The ownership and reuse of visual media\n", "abstract": " This paper presents the results of a study of the ownership and reuse of visual media. A survey was administered to 250 social media-savvy respondents to investigate their attitudes about saving, sharing, publishing, and removing online photos; the survey also explored participants' current photo-sharing and reuse practices, and their general expectations of photo reuse. Our probe of respondent attitudes revealed that respondents felt:(1) people should be able to save visual media, regardless of its source;(2) people have slightly less right to reuse photos than they do to save them;(3) a photo's subject has a slightly greater right than the photographer to reuse the photo in non-commercial situations;(4) removal is controversial, but trends more positive when it involves only metadata (eg tags); and (5) access to institutional archives of personal photos is better deferred for 50 years. Participants explained their own …", "num_citations": "37\n", "authors": ["2088"]}
{"title": "Formality considered harmful: Experiences, emerging themes, and directions\n", "abstract": " This paper reviews experiences in designing, developing, and working with the users of a variety of interactive computer systems. The authors suggest, based on a number of experiences, that the cause of a number of unexpected difficulties in human-computer interaction is users' unwillingness to make structure, content, or procedures explicit. Besides recounting experiences with system use, this paper discusses why users are often justified in rejecting formalisms and how system designers can anticipate and compensate for problems users have in making implicit aspects of their tasks explicit. Incremental and system-assisted formalization mechanisms, as well as techniques to evaluate the task situation, are proposed as approaches to this problem.", "num_citations": "37\n", "authors": ["2088"]}
{"title": "From writing and analysis to the repository: Taking the scholars' perspective on scholarly archiving\n", "abstract": " This paper reports the results of a qualitative field study of the scholarly writing, collaboration, information management, and long-term archiving practices of researchers in five related subdisciplines. The study focuses on the kinds of artifacts the researchers create in the process of writing a paper, how they exchange and store materials over the short term, how they handle references and bibliographic resources, and the strategies they use to guarantee the long term safety of their scholarly materials. The findings reveal:(1) the adoption of a new CIM infrastructure relies crucially on whether it compares favorably to email along six critical dimensions;(2) personal scholarly archives should be maintained as a side-effect of collaboration and the role of ancillary material such as datasets remains to be worked out; and (3) it is vital to consider agency when we talk about depositing new types of scholarly materials into …", "num_citations": "36\n", "authors": ["2088"]}
{"title": "I give up! Five factors that contribute to the abandonment of information management strategies\n", "abstract": " In this paper, we present initial findings from a six‐month study involving qualitative interviews on the topic of project‐related personal information management. Specifically, we report on the emergent theme of information management strategy abandonment ‐ that is, what factors in particular might cause people to give up on their systems for managing documents, calendars, email, and other sorts of project information. In exploring the recurrence of this theme throughout the interview data, five factors emerged as particularly compelling and frequently‐cited reasons for system abandonment: (1) visibility, (2) integration, (3) co‐adoption, (4) scalability, and (5) return on investment. We describe each of these factors in turn, using examples from the interviews for illustration. These findings, though preliminary in nature, provide a starting point for understanding why systems fail and how future systems might be …", "num_citations": "33\n", "authors": ["2088"]}
{"title": "Hypertext interaction revisited\n", "abstract": " Much of hypertext narrative relies on links to shape a reader's interaction with the text. But links may be too limited to express ambiguity, imprecision, and entropy, or to admit new modes of participation short of full collaboration. We use an e-book form to explore the implications of freeform annotation-based interaction with hypertext narrative. Readers' marks on the text can be used to guide navigation, create a persistent record of a reading, or to recombine textual elements as a means of creating a new narrative. In this paper, we describe how such an experimental capability was created on top of XLibris, a next generation e-book, using Forward Anywhere as the hypernarrative. We work through a scenario of interaction, and discuss the issues the work raises.", "num_citations": "33\n", "authors": ["2088"]}
{"title": "Docx2go: collaborative editing of fidelity reduced documents on mobile devices\n", "abstract": " Docx2Go is a new framework to support editing of shared documents on mobile devices. Three high-level requirements influenced its design--namely, the need to adapt content, especially textual content, on the fly according to the quality of the network connection and the form factor of each device; support for concurrent, uncoordinated editing on different devices, whose effects will later be merged on all devices in a convergent and consistent manner without sacrificing the semantics of the edits; and a flexible replication architecture that accommodates both device-to-device and cloud-mediated synchronization. Docx2Go supports on-the-go editing for XML documents, such as documents in Microsoft Word and other commonly used formats. It combines the best practices from content adaptation systems, weakly consistent replication systems, and collaborative editing systems, while extending the state of the art in …", "num_citations": "31\n", "authors": ["2088"]}
{"title": "Why web sites are lost (and how they're sometimes found)\n", "abstract": " Introduction The web is in constant flux---new pages and Web sites appear daily, and old pages and sites disappear almost as quickly. One study estimates that about two percent of the Web disappears from its current location every week.2 Although Web users have become accustomed to seeing the infamous \"404 Not Found\" page, they are more taken aback when they own, are responsible for, or have come to rely on the missing material. Web archivists like those at the Internet Archive have responded to the Web's transience by archiving as much of it as possible, hoping to preserve snapshots of the Web for future generations.3 Search engines have also responded by offering pages that have been cached as a result of the indexing process. These straightforward archiving and caching efforts have been used by the public in unintended ways: individuals and organizations have used them to restore their own …", "num_citations": "31\n", "authors": ["2088"]}
{"title": "Digital libraries and mobility\n", "abstract": " People may use mobile digital library technologies to cross physical and digital boundaries. For example, many attorneys and law students use print treatises—in essence, legal encyclopedias—to initiate legal research; the familiar geography of the book helps them get started. They then transition to legal digital libraries (such as those offered by Lexis or Westlaw) to continue their research and to ensure they have checked the most current cases [5]. Patrons also start from digital metadata like Online Public Access Catalogs (OPACs) to access physical holdings. Library patrons can quickly search for new references in a mobile digital catalog while they are browsing the physical shelves [2]. Hence, wireless on-the-spot access can be a compelling advantage of mobile technologies. Reading is opportunistic; people read when they have time, where they have a comfortable place to sit, and where there are other …", "num_citations": "30\n", "authors": ["2088"]}
{"title": "No bull, no spin: a comparison of tags with other forms of user metadata\n", "abstract": " User-contributed tags have shown promise as a means of indexing multimedia collections by harnessing the combined efforts and enthusiasm of online communities. But tags are only one way of describing multimedia items. In this study, I compare the characteristics of public tags with other forms of descriptive metadata'titles and narrative captions' that users have assigned to a collection of very similar images gathered from the photo-sharing service Flickr. The study shows that tags converge on different descriptions than the other forms of metadata do, and that narrative metadata may be more effective than tags for capturing certain aspects of images that may influence their subsequent retrieval and use. The study also examines how photographers use peoples' names to personalize the different types of metadata and how they tell stories across short sequences of images. The study results are then brought to …", "num_citations": "29\n", "authors": ["2088"]}
{"title": "Generating Web-based presentations in spatial hypertext\n", "abstract": " Presentations frequently include material appropriated from external sources; they may incorporate tabular data from published reports, photographs from books, or clip art from purchased collections. With the growing use of the World-Wide Web to disseminate information, there is the emerging potential for a new style of presentation: one that interprets and organizes materials produced by others and published on-line. Authoring such presentations requires the analysis of the source information. However, current presentation authoring software is designed to support traditional presentations, where analysis is assumed a separate task at best supported by separate software. This paper discusses experiences with using VIKI, a system designed to support information analysis, for the authoring of such presentations. VIKI includes a spatial parser to recognize implicit spatial structure generated during analysis. This …", "num_citations": "29\n", "authors": ["2088"]}
{"title": "Effects of display configurations on document triage\n", "abstract": " Document triage is the practice of quickly determining the merit and disposition of relevant documents. This practice involves selection of documents from a document overview and quick forms of reading: skimming, reading short portions of a longer document, and navigating through headings, indices, and tables of contents. Earlier studies of document triage practice showed considerable overhead related to window management during transitions between the document overview and reading interfaces. This study examines the impact of multiple display configurations on document triage practice. In particular, it compares (1) configurations with same and different size displays, and (2) configurations with and without user control over which activity is performed on which display. Results show a significant increase in the number of transitions between activities when a multi-display configuration is …", "num_citations": "28\n", "authors": ["2088"]}
{"title": "The gray lady gets a new dress: a field study of the times news reader\n", "abstract": " Increasingly individuals are turning to online sources for their daily news. Traditional newspapers have developed significant web presences to compete with newer services such as news aggregators and emerging genres such as blogs and other forms of citizen journalism. This paper reports the results of a field study to investigate the use of a new RSS-driven, template-based presentation mechanism that delivers a daily newspaper to subscribers' laptops and desktops; the Times News Reader hybridizes elements of print newspapers with aspects of online news. We explore how this application compares with print and web-based news reading and evaluate functionality developed to draw in readers from both audiences. Finally we examine three general technological implications drawn from current use: how the news reader may adapt to different styles of reading; how the news reader's functionality may be …", "num_citations": "27\n", "authors": ["2088"]}
{"title": "On the institutional archiving of social media\n", "abstract": " Social media records the thoughts and activities of countless cultures and subcultures around the globe. Yet institutional efforts to archive social media content remain controversial. We report on 988 responses across six surveys of social media users that included questions to explore this controversy. The quantitative and qualitative results show that the way people think about the issue depends on how personal and ephemeral they view the content to be. They use concepts such as creator privacy, content characteristics, technological capabilities, perceived legal rights, and intrinsic social good to reason about the boundaries of institutional social media archiving efforts.", "num_citations": "26\n", "authors": ["2088"]}
{"title": "Physical objects in the digital library\n", "abstract": " Physicrd objects are the foundation for many of today’s areas of scholarship, research, and education. Beeause physical objects are tangible, any digital representation of one is an approximation of the object, Knowing how to approximate requires an understanding of the work practices and needs of the library’s constituencies. We consider issues arising from the creation of digital libraries based on physical objects, focusing particularly on the characteristics of botanical herbaria and their users.", "num_citations": "25\n", "authors": ["2088"]}
{"title": "Supporting document triage via annotation-based multi-application visualizations\n", "abstract": " For open-ended information tasks, users must sift through many potentially relevant documents, a practice we refer to as document triage. Normally, people perform triage using multiple applications in concert: a search engine interface presents lists of potentially relevant documents; a document reader displays their contents; and a third tool--a text editor or personal information management application--is used to record notes and assessments. To support document triage, we have developed an extensible multi-application architecture that initially includes an information workspace and a document reader. An Interest Profile Manager infers users' interests from their interactions with the triage applications, coupled with the characteristics of the documents they are interacting with. The resulting interest profile is used to generate visualizations that direct users' attention to documents or parts of documents that match …", "num_citations": "22\n", "authors": ["2088"]}
{"title": "Effective and efficient compromise recovery for weakly consistent replication\n", "abstract": " Weakly consistent replication of data has become increasingly important both for loosely-coupled collections of personal devices and for large-scale infrastructure services. Unfortunately, automatic replication mechanisms are agnostic about the quality of the data they replicate. Inappropriate updates, whether malicious or simply the result of misuse, propagate automatically and quickly. The consequences may not be noticed until days later, when the corrupted data has been fully replicated, thereby deleting or overwriting all traces of the valid data. In this sort of situation, it can be hard or impossible to restore an entire distributed system to a clean state without losing data and disrupting users.", "num_citations": "21\n", "authors": ["2088"]}
{"title": "The CALLE project\n", "abstract": " Traditional computer-aided instruction strategies have a number of well-known limitations. CALLE, a dialogue-based Spanish language instruction system, avoids many of these limitations by allowing the student to concentrate on the creative process of formulating a conversational response in the context of a simulated discourse. Natural language processing techniques enable errors in student input to be diagnosed on the basis of a linguistic analysis. This analysis is performed using Lexical Functional Grammar theory. This article discusses CALLE's theoretical basis, its implementation, extensibility issues, pedagogical considerations, and its relationship to ICAI. It is based on a talk given at the CALICO '85 Symposium in Baltimore.", "num_citations": "21\n", "authors": ["2088"]}
{"title": "Exploring the ownership and persistent value of Facebook content\n", "abstract": " In this paper, we present the results of a study examining 244 participants' attitudes about the value, ownership, and control of social network data. We use Facebook-based scenarios to elicit reactions to hypothetical statements about saving social network content that belongs to others, reusing, repurposing, and monetizing social network data, and removing social network content that is not specifically one's own. Participants also report on their own practices in each of these areas. Findings not only address issues related to ownership, but also explore the use of social networks as documentary records, and the discrepancies between participants' perceptions of how they would like their social network content to be used, and how it is actually used.", "num_citations": "20\n", "authors": ["2088"]}
{"title": "Patterns of reading and organizing information in document triage\n", "abstract": " People engaged in knowledge work must often rapidly identify valuable material from within large sets of potentially relevant documents. Document triage is a type of sensemaking task that involves skimming documents to get a sense of their content, evaluating documents to assess their worth in the context of the current activity, and organizing documents to prepare for their subsequent use and more in‐depth reading. We have performed a study of document triage by collecting multiple forms of qualitative and quantitative data to characterize how 24 subjects read about a new topic and assessed and organized a set of 40 relevant Web documents. Our results indicate that there are multiple strategies for document triage, each involving different styles of reading, interacting, and organizing. Common strategies include: 1) focused reading early in the task, relegating the organizing until later in the process; 2 …", "num_citations": "20\n", "authors": ["2088"]}
{"title": "For Richer, for Poorer, in Sickness or in Health... The Long-Term Management of Personal Information\n", "abstract": " People are amassing large personal information stores. These stores present rich opportunities for analysis and use in matters of wealth, health, living and legacy. But these stores also bring with them new challenges for managing information across long periods of time. Hence personal information management (PIM) research increasingly must address the long term. For the seventh PIM workshop in a successful series started in 2005, we propose taking a look at personal information with exactly this longitudinal perspective. We expect the workshop to attract a range of people doing research related to PIM, HCI, personal digital archiving, aging, and the design of informational spaces for later life. Attendees will discuss issues related to storing information for the long run, how stored information can benefit a person throughout their lifetime (and into old age), and the legacy of a person's personal information.", "num_citations": "19\n", "authors": ["2088"]}
{"title": "Storage or removal actions based on priority\n", "abstract": " Techniques for providing content management services are described. Managing content services includes determining a value of content and determining storage actions of the content based on the value. The value of the content is determined by weighting factors, such as access frequency, a rating, a size of the content, a type of the content, and a security level of the content. Based on the value of the content, one or more storage actions may be determined for the content to optimize storage. The storage actions may include identifying a version of the content to be saved, compressing the content, determining a back up of the content to store, identifying a location to store the content, performing erasure encoding of the content, and/or removing the content.", "num_citations": "19\n", "authors": ["2088"]}
{"title": "Finding the boundaries of the library without walls\n", "abstract": " In the first years of digital library efforts, there was much talk of the\" library without walls.\" The introduction of electronic resources into the traditional library showed promise for bringing about seamless\" anytime, anywhere\" access. How has this seamless access played out as digital collections grow and as an increasing number of institutions and individuals have come to maintain and use them? Contrary to this picture of seamlessness, the practical everyday reality of workplaces and public institutions like libraries is rife with boundaries that shape human interaction and any associated engagement with technology and documents. What do I mean by boundaries? Instead of relying on a hard-and-fast definition, I appeal to the reader's intuition: a boundary is something that tends to separate, to interpose; a boundary is a perceptible seam in the social fabric, the technological infrastructure, or a physical setting or may span all three. 1 Physical and social factors—such as work setting, organizational structure, and the introduction of noninteroperable technologies—produce some of the most noticeable boundaries. For example, studies have demonstrated that people tend to work with those colleagues who are close by (Kraut and Egido 1988). Tightly coupled work performed over a distance (using technology like videoconferencing) may be reorganized so that it is performed by colocated team members (Olsen and Teasley 1996). Distance, then, imposes a perceptible boundary that is not necessarily bridged by videoconferencing technology. On the other hand, complex work situations might have boundaries because, for example, various …", "num_citations": "19\n", "authors": ["2088"]}
{"title": "Mitigation of obsolescence for archival services\n", "abstract": " The claimed subject matter relates to an architecture that can determine costs associated with updating file formats. In particular, the architecture can interface with a network-accessible data storage service in order to determine a cost-benefit to the data storage service for a wide variety of conversion scenarios applicable to the particular topology of the data storage service. For example, the cost-benefit can differ for storage services configured according to a client-server model relative to storage services configured according to a distributed topology. Regardless, the architecture can identify a legacy format, select a converter for converting the legacy format to the updated format, and then determine the cost-benefit for a variety of conversion or migration scenarios.", "num_citations": "18\n", "authors": ["2088"]}
{"title": "What do you see in the cloud? Understanding the cloud-based user experience through practices\n", "abstract": " End users have begun to incorporate cloud-based services into their collaborative practices. What spurs and constrains this adoption? Are the cloud services understood adequately and used effectively? How might we intervene to promote a better connection between user practices and cloud services? In this study, we focus on collaborative practices that surround the adoption, use, and understanding of two popular, but sometimes contrasting, cloud services for creating and sharing content: Dropbox and Google Docs. We conducted 22 in-depth interviews with people who used these services, including collaborators who used the services together, and people who had migrated from Google Docs to Google Drive. We found that users thought of the cloud in terms of the practices it helped them accomplish. Their understanding of the cloud was often shaped by the particular file storage and sharing …", "num_citations": "18\n", "authors": ["2088"]}
{"title": "Supporting research collaboration through bi-level file synchronization\n", "abstract": " In this paper, we describe the design and use of Cimetric, a file synchronization application that supports scholarly collaboration. The system design incorporates results of earlier studies that suggest replicating content on a user's personal devices may have different characteristics than replicating content to share it with collaborators. To realize this distinction, Cimetric performs bi-level synchronization: it synchronizes local copies of a versioned repository among collaborators' computers, while it separately synchronizes private working files between each user's personal devices. Through a year's worth of in-house use of Cimetric in a variety of configurations, we were able to investigate key file synchronization issues, including the role of cloud storage given the ability to sync between peers; the strengths and weaknesses of a bi-level design; and which aspects of the synchronization process to reveal to users.", "num_citations": "18\n", "authors": ["2088"]}
{"title": "Big data, the crowd, and me\n", "abstract": " Like many of you, I’ve been swept up by the romance of Big Data. But instead of stepping back and taking the long view, in this account I plan to get enmired in the details and tell you a story about my own Big Data dalliance. Furthermore, in an effort to explore some fresh territory, I’m not going to take a curatorial perspective (see, for example, Borgman, Wallis, and Mayernik, 2010, or Tibbo et al., 2009), nor address the challenges of data storage and processing (eg Yu et al., 2008) or data sharing (eg Reichman, Jones, and Schildhauer, 2011). Instead, I’m going to look outside of the pool of light, in among the digital dust bunnies, to see if I can tell a slightly different, more personal story about what someone like me (a qualitative researcher) might need to know to be part of a Big Data effort (bearing in mind boyd and Crawford’s (2011) thoughtful scholarly reflections on the implications of manipulating and analyzing Big Data) 1 Big Data is surely the Gold Rush of the Information Age. Researchers across many disciplines have been seduced: currently, mining a carefully-wrought chunk of the Twitter feed can mean a high-visibility (and relatively straightforward) publication in CS or Information Science; an n-gram analysis of Google Books can form the spine of a Digital Humanities study. Every researcher I’ve talked to who does one of these analyses realizes its limitations, but like me, they have been seduced by Big Data’s availability and held in its thrall. 2", "num_citations": "18\n", "authors": ["2088"]}
{"title": "Link navigator method and system for locating web content\n", "abstract": " A Web browser provides the ability to separate content and hyper-links from a Web page and provides a list of the links for viewing on a mobile device display screen, enabling more effective Web page navigating using the limited mobile device display. In addition to the links from the Web page, further links are created to telephone numbers, addresses, and other communication-related information in the Web page to further enhance usability of the Web page information for mobile device users. Further, once a link is selected using the mobile device, a services portal link is provided to the mobile device display to provide selection of services to be performed on the selected link, such as faxing or printing. Further, the services are made link dependent, or user dependent so that specific services can be displayed depending on factors such as the availability of services provided specifically from a Web page owner for …", "num_citations": "18\n", "authors": ["2088"]}
{"title": "Using networked information to create educational guided paths\n", "abstract": " The extensive and encyclopedic materials found on the World Wide Web must be tailored and contextualized to support the instructional goals of education. We have explored the concept of\" guided paths,\" ordered lists of pages independent of the existing Web structure, and have implemented a prototype, Walden's Paths. In addition to creating paths, a teacher may annotate the individual pages of a path to provide transition, emphasis, and missing explanation. In addition, some limited interactivity and control over the display of remote information is possible in our prototype. Walden's Paths works with standard Web browsers and servers so it can be integrated into an educational setting using existing hardware and software.", "num_citations": "18\n", "authors": ["2088"]}
{"title": "An argument for archiving Facebook as a heterogeneous personal store\n", "abstract": " A decade ago, the locus of activity for our digital belongings-photos, email, videos, documents, and the like-was on our personal computers. Now the situation is different. Not only is personal media born-digital, it may also spend its entire life stored online in social media services and cloud stores, and locally on portable devices. Studies have revealed that most people lack the requisite skills to archive their digital belongings, regardless of where they are stored; furthermore people value the context offered by these large-scale, socially intertwined online stores. So why not archive the contents of a major social media service like Facebook to ensure the permanence of a meaningful portion of peoples' personal digital belongings? Rather than being delighted by this idea, participants in a study of digital ownership have expressed squeamishness about institutional efforts to archive social media: Facebook is not only …", "num_citations": "17\n", "authors": ["2088"]}
{"title": "Online virtual safe deposit box user experience\n", "abstract": " The claimed subject matter provides a system and/or a method that facilitates seamless integration of a data storage service within an operating system (OS). An online safe deposit box can store a portion of data, wherein the online safe deposit box is hosted by a data storage service provider. A local operating system associated with a device can leverage a graphic user interface (GUI) to interact with a portion of data associated with the device. A map component can create a mapped drive that integrates the online safe deposit box within the local operating system to enable seamless data interaction between the local operating system and the online safe deposit box, wherein the data interaction is at least one of a data upload from the local operating system to the online safe deposit box or a data download from the online safe deposit box to the local operating system.", "num_citations": "16\n", "authors": ["2088"]}
{"title": "Saving, reusing, and remixing web video: using attitudes and practices to reveal social norms\n", "abstract": " The growth of online videos has spurred a concomitant increase in the storage, reuse, and remix of this content. As we gain more experience with video content, social norms about ownership have evolved accordingly, spelling out what people think is appropriate use of content that is not necessarily their own. We use a series of three studies, each centering on a different genre of recordings, to probe 634 participants' attitudes toward video storage, reuse, and remix; we also question participants about their own experiences with online video. The results allow us to characterize current practice and emerging social norms and to establish the relationship between the two. Hypotheticals borrowed from legal research are used as the primary vehicle for testing attitudes, and for identifying boundaries between socially acceptable and unacceptable behavior.", "num_citations": "16\n", "authors": ["2088"]}
{"title": "Data detector for creating links from web content for mobile devices\n", "abstract": " A Web browser provides the ability to separate content and hyper-links from a Web page and provides a list of the links for viewing on a mobile device display screen along with links to telephone numbers, addresses, email addresses, and other communication-related information in the Web page detected by a data detector portion of the Web browser to further enhance usability of the Web page information for mobile device users. Further, once a link is selected using the mobile device, a services portal link is provided to the mobile device display to provide selection of services to be performed on the selected link, such as faxing or printing.", "num_citations": "16\n", "authors": ["2088"]}
{"title": "Debugging a crowdsourced task with low inter-rater agreement\n", "abstract": " In this paper, we describe the process we used to debug a crowdsourced labeling task with low inter-rater agreement. In the labeling task, the workers' subjective judgment was used to detect high-quality social media content-interesting tweets-with the ultimate aim of building a classifier that would automatically curate Twitter content. We describe the effects of varying the genre and recency of the dataset, of testing the reliability of the workers, and of recruiting workers from different crowdsourcing platforms. We also examined the effect of redesigning the work itself, both to make it easier and to potentially improve inter-rater agreement. As a result of the debugging process, we have developed a framework for diagnosing similar efforts and a technique to evaluate worker reliability. The technique for evaluating worker reliability, Human Intelligence Data-Driven Enquiries (HIDDENs), differs from other such schemes, in …", "num_citations": "15\n", "authors": ["2088"]}