{"title": "NMR, IR/Raman, and Structural Properties in HNO and RNO (R = Alkyl and Aryl) Metalloporphyrins with Implication for the HNO−Myoglobin Complex\n", "abstract": " Structural and functional details of heme protein complexes with HNO and the isoelectronic RNO (R = alkyl and aryl) molecules (metabolic intermediates) are largely unknown. We report a quantum chemical investigation of three characteristic spectroscopic properties, 1H and 15N NMR chemical shifts and NO vibrational frequencies in synthetic HNO and RNO heme complexes, with theory-versus-experiment correlation coefficients R2 = 0.990−0.998. A new density functional theory (DFT) method was found to yield excellent predictions of experimental structures of HNO, RNO, and NO heme systems. Interestingly, this method also helps the identification of an excellent linear quantitative structure observable relationship between NO vibrational frequencies and bond lengths in all of these NO-containing systems. This suggests that NO vibrations are largely local effects of the NO bonds in these complexes and may …", "num_citations": "37\n", "authors": ["1981"]}
{"title": "Automating traceability link recovery through classification\n", "abstract": " Traceability Link Recovery (TLR) is an important software engineering task in which a stakeholder establishes links between related items in two sets of software artifacts. Most existing approaches leverage Information Retrieval (IR) techniques, and formulate the TLR task as a retrieval problem, where pairs of similar artifacts are retrieved and presented to a user. These approaches still require significant human effort, as a stakeholder needs to manually inspect the list of recommendations and decide which ones are true links and which ones are false. In this work, we aim to automate TLR by re-imagining it as a binary classification problem. More specifically, our machine learning classification approach is able to automatically classify each link in the set of all potential links as either valid or invalid, therefore circumventing the substantial human effort required by existing techniques.", "num_citations": "11\n", "authors": ["1981"]}
{"title": "Towards the automatic classification of traceability links\n", "abstract": " A wide range of text-based artifacts contribute to software projects (e.g., source code, test cases, use cases, project requirements, interaction diagrams, etc.). Traceability Link Recovery (TLR) is the software task in which relevant documents in these various sets are linked to one another, uncovering information about the project that is not available when considering only the documents themselves. This information is helpful for enabling other tasks such as improving test coverage, impact analysis, and ensuring that system or regulatory requirements are met. However, while traceability links are useful, performing TLR manually is time consuming and fraught with error. Previous work has applied Information Retrieval (IR) and other techniques to reduce the human effort involved; however, that effort remains significant. In this research we seek to take the next step in reducing it by using machine learning (ML …", "num_citations": "7\n", "authors": ["1981"]}
{"title": "Method of approximate fundamental solutions for ill-posed elliptic boundary value problems\n", "abstract": " The method of approximate fundamental solutions (MAFS) is coupled with the Tikhonov regularization technique for solving a Cauchy problem of an equation of the elliptic type. The techniques of the Lanczos regularization and the Abel regularization are used for the construction of approximate fundamental solutions. The Tikhonov regularized solution is obtained for the discretized system. Our numerical results show that the MAFS coupled with the Tikhonov regularization provides satisfactory solutions for the ill-posed problem. This method can handle effectively problems defined on irregular shaped domains, and differential operators for which closed form fundamental solutions are not known.", "num_citations": "2\n", "authors": ["1981"]}