{"title": "Agile portfolio management: An empirical perspective on the practice in use\n", "abstract": " Agile project management methods revolutionized the way how software projects are executed and organized. The question, however, on how to enable agility outside of individual projects and help larger organizations to compete with small entrepreneurial companies requires further attention. As a possible perspective, project portfolio management provides a global view on resources and their distribution across individual projects according to strategic choices. Based on 30 interviews conducted in 14 large European organizations this study contributes to the understanding of agile project management methods applied in IT project portfolios. First, we empirically identify the domains of practice. Then, guided by literature and our data we discuss the characteristics and implications of the agile portfolio management practice in our case organizations.", "num_citations": "218\n", "authors": ["1380"]}
{"title": "Necessary and neglected? An empirical study of internal documentation in agile software development teams\n", "abstract": " When compared to traditional development methods, agile development practices are associated with more direct communication and less documentation. However, few empirical studies exist that investigate the role of documentation in agile development teams. We thus employed a questionnaire to measure the perceptions of a group of agile practitioners with regard to the documentation in their projects. We obtained responses from 79 agile software development professionals and 8 teams in 13 different countries. Our findings include that over half of developers in our data set find documentation important or even very important but that too little documentation is available in their projects. Agile practitioners do not seem to agree with the agile principle that\" The most efficient and effective method of conveying information to and within a development team is face-to-face conversation.\" We were able to validate …", "num_citations": "103\n", "authors": ["1380"]}
{"title": "Five agile factors: helping self-management to self-reflect\n", "abstract": " In this paper a tool is proposed to foster reflection in agile software development teams. Based upon the qualitative model of Moe et al. [11], we contribute a quantitative questionnaire organized along five dimensions of agile teamwork analogous to the “Five Factor Model” in contemporary psychology. To test this survey tool and its alignment with existing studies, we have executed an empirical validation of the tool with 79 individuals and 8 international Scrum teams. We find that inter-team agreement on the factors is high and that the survey tool is found very useful. The instrument offers a comparable measure to agile teams and gives recommendations for each of the factors helping to understand individual as well as organizational level barriers.", "num_citations": "51\n", "authors": ["1380"]}
{"title": "Documentation work in agile teams: The role of documentation formalism in achieving a sustainable practice\n", "abstract": " As its second guiding principle, agile software development promotes working software over comprehensive documentation. In this paper we investigate alignment between two different documentation practices and agile development. We report upon an experiment conducted to explore the impact of formalism and media type on various dimensions of documentation practice in agile teams. 28 students in 8 teams were divided into two groups: SAD and UML. Group SAD was to update and deliver their high-level software architecture in form of a textual description defined by RUP templates. Group UML was instructed to update and deliver their low-level software design in form of UML models. Our results show that iterative documentation practices led to more extensive and more detailed textual documentation. We found that writing documentation was perceived as a intrusive task leading to task specialization and …", "num_citations": "49\n", "authors": ["1380"]}
{"title": "Academic education of software engineering practices: towards planning and improving capstone courses based upon intensive coaching and team routines\n", "abstract": " Academic education of professional processes is challenged by a necessary balance of practical activities with academic reflection. In this paper we address this issue by discussing our experiences with teaching software engineering practices and their continuous improvement. By designing a graduate course we embed an intensive coaching routine based upon agile practices with research activities to leverage knowledge of students and coaches. As a concrete example of an embedded research project we conduct an experiment on the impact of two different meeting routines on the teams satisfaction with information exchange. Our results show that the intensive coaching in individual teams is shorter in nature and more appealing to the students. Our findings suggest that software engineering education can benefit from the notion of team routines and process improvement practices contributing to maturity of …", "num_citations": "29\n", "authors": ["1380"]}
{"title": "Is there an agile handover? an empirical study of documentation and project handover practices across agile software teams\n", "abstract": " The growing use of agile and lean methods has heated the discussion on efficiency and sustainability of software engineering processes. During project handovers, for example, loss of knowledge has been indicated and critics of agile methods point at a lack of documentation. In this paper we take the perspective of patterns of human action, looking at the actions the teams take and the artifacts they use during a software project handover. Our results from 30 teams in small to large size projects cover the perceptions of a variety of roles and indicate that the adoption is a learning process in three interdependent phases: Environment, System and Architecture. The participants in our study perceived the biggest gaps in the usefulness of available design and requirements documentation. Based on our findings we suggest that documentation artifacts should rather support the learning process and that including …", "num_citations": "27\n", "authors": ["1380"]}
{"title": "Non-technical individual skills are weakly connected to the maturity of agile practices\n", "abstract": " Context: Existing knowledge in agile software development suggests that individual competency (e.g. skills) is a critical success factor for agile projects. While assuming that technical skills are important for every kind of software development project, many researchers suggest that non-technical individual skills are especially important in agile software development.Objective: In this paper, we investigate whether non-technical individual skills can predict the use of agile practices.Method: Through creating a set of multiple linear regression models using a total of 113 participants from agile teams in six software development organizations from The Netherlands and Brazil, we analyzed the predictive power of non-technical individual skills in relation to agile practices.Results: The results show that there is surprisingly low power in using non-technical individual skills to predict (i.e. explain variance in) the mature use of …", "num_citations": "18\n", "authors": ["1380"]}
{"title": "Gaming for agility: using serious games to enable agile project & portfolio management capabilities in practice\n", "abstract": " Organizations creating new products and services are increasingly adopting agile project and portfolio management capabilities to remain innovative. However, acquiring the necessary skills and spirit is troublesome for many organizations as they rely heavily on a distinct mindset and experience that can only be acquired in the process. Literature indicates that serious games can help to bridge that gap. In this paper we take the example of agile project management methods to understand how games are applied to support the acquisition of agile and entrepreneurial capabilities. In an explorative study, we conducted qualitative interviews with game developers, business consultants, and agile coaches from nine different companies, and conducted desk research on available open source serious games. Based on 475 minutes of recorded audio, 81 pages of transcripts as well as 26 identified open source games …", "num_citations": "17\n", "authors": ["1380"]}
{"title": "The Corporate Entrepreneur: A driving force for strategic renewal and radical innovation in established companies\n", "abstract": " corporate entrepreneurship is one tool for established companies to strengthen their capabilities for strategic renewal and innovativeness. The question, however, which factors are influencing the success of a corporate entrepreneurship initiative requires further attention. The corporate entrepreneur who is acting as both the leader of embedded entrepreneurial teams and linking pin to the corporate, is providing one possible perspective. Based on 6 interviews conducted in 6 German organizations this study contributes to the understanding of the role of the corporate entrepreneur and how this role can be distinguished from other roles in the context of innovation.", "num_citations": "16\n", "authors": ["1380"]}
{"title": "On the future of project management innovation: A call for discussion towards project management 2030\n", "abstract": " Rethinking Project Management (PM)* has been a recurring theme for some time [1]-[9]. In context of the current era of Digital Transformation, which is also referred to as the time of VUCA (Volatile, Uncertain, Complex and Ambiguous) it seems fair to assess if the current PM curricula match the needs of the market, both public and private. Professional bodies like IPMA †  and PMI ‡  similarly re-assess such which then leads to new editions of their standards to emerge. The current paper provides a short overview of the current developments of the profession. As well, it identifies related recent, current and ongoing research addressing similar questions regarding the success chances and rates of projects in light of the use and application of various PM methods. It aims to propose a new approach to learn using “Research through Project Management” (RtPM). Understanding the impact PM can have on the manner in …", "num_citations": "14\n", "authors": ["1380"]}
{"title": "Don’t forget to breathe: a controlled trial of mindfulness practices in agile project teams\n", "abstract": " While the effects of mindfulness are increasingly explored across different fields, little is known about the application of these practices in agile project teams. In this paper we report on a rigorous controlled trial executed to understand the impact of the three minute breathing exercise on the perceived effectiveness of stand-up meetings. We compare (1) an active group using a three minute breathing exercise, to (2) a placebo, and (3) a control group in 3 organizations and 8 teams with over 152 measurements. Our findings indicate an immediate positive impact on perceived effectiveness, decision-making and improved listening in the active groups compared to the placebo and natural history groups. We provide a preliminary agenda for future research based on our findings and previous evidence from other fields.", "num_citations": "13\n", "authors": ["1380"]}
{"title": "Managing weak ties in collaborative work\n", "abstract": " Information and communication technology, ICT, has introduced new styles of working. Based on ICT, these styles have a strong virtual flavour, ranging from flexwork, hot-desking and telework to virtual teams and virtual organizations. The virtuality of the styles has impacts on how employees within an organization perform their task and how they interact with colleagues, clients and supervisors, but the impact is not yet well understood. 24 board level executives from 18 Swiss knowledge firms have been interviewed about virtual work arrangements and the change these bring in networking dynamics within their organization. The contribution of the paper is that new networking dynamics can be related to complement the theory on weak, strong and absent ties. More in particular, virtual networks can be located in weak ties, thereby making strong ties less important. We point out how network dynamics are located in …", "num_citations": "12\n", "authors": ["1380"]}
{"title": "Evolution of scrum transcending business domains and the future of agile project management\n", "abstract": " The growing popularity of Agile management methods has led to their application to a number of areas inside, but also outside, the software development domain. However, despite many practitioner reports, research exploring whether and how Agile practices have been applied in domains beyond software development has been rather patchy with little empirical evidence. What is there behind the hype and how can other domains learn from it? To address this gap in the research, we present the findings of our study on the application of Agile management practices in other domains, including an outlook towards a potential expansion enabling Business Agility. To practitioners, this study presents examples of Scrum applied outside the software development domain including concrete practices applied. To researchers, it presents an empirical starting point for further exploration.", "num_citations": "11\n", "authors": ["1380"]}
{"title": "Business capabilities: A systematic literature review and a research agenda\n", "abstract": " The omnipresent need for business transformations, be it digital, agile, or lean, forces organizations to make good choices regarding their optimal business capabilities. Business capabilities provide a link between strategy (the `why') and implementation (the `how'). Currently, a comprehensive view on business capabilities is missing. We conducted a systematic literature review on business capabilities. We identified 720 scientific studies, of which 20 were analyzed in-depth. In this review, we investigate how business capabilities are defined, what business capability frameworks are available, and what future research has been suggested for business capability research. From this literature review emerges an extensive analysis on the state of art in business capability research, a new definition for business capabilities, and a potential research agenda for future research.", "num_citations": "11\n", "authors": ["1380"]}
{"title": "Towards responsible workplace innovation: The rise of NWW in public knowledge organizations and their impact on governance\n", "abstract": " Triggered by ICT development and the need to cut costs, private organizations initiated a number of initiatives to prepare for a more network centric reign. One of such initiatives is commonly referred to as New Ways of Working (NWW). While the private sector has been busy finding its way through the change process, how such a workspace innovation can be made sustainable is yet to be defined. In order to contribute to responsible workspace innovation, this study takes the example of public knowledge organizations. In this multiple case study we for the first time discuss the reasons for NWW adoption in public Dutch organizations, interpretations and actual practices in use and their impact on work organization and governance mechanisms.", "num_citations": "10\n", "authors": ["1380"]}
{"title": "Contracting in agile software projects: State of art and how to understand it\n", "abstract": " The iterative nature of Agile methods paves the way for new and more dynamic contract arrangements in software development projects. However, while new types and adaptations of existing contract types have emerged in practice, a shared view on these arrangements is missing in literature. In this paper we review common contract types discussed in Agile and traditional project management. Based on existing literature and empirical data collected during a workshop and semi-structured interviews we present a preliminary framework to help understand and choose contracting practices in context.", "num_citations": "9\n", "authors": ["1380"]}
{"title": "Women in Agile: The Impact of Organizational Support for Women’s Advancement on Teamwork Quality and Performance in Agile Software Development Teams\n", "abstract": " In this research we investigate how organizational support for women’s advancement and gender diversity as a headcount is related to teamwork quality and team performance based upon Hoegl and Gemuenden’s teamwork quality model (TWQ). Using an online survey we obtained data from 77 professionals working in agile software development teams. The results show that organizational support for women’s advancement has a positive impact on all TWQ dimensions, while gender diversity expressed as an equal headcount number has only a positive impact on coordination and balance of member contributions in our data set. Further, in line with previous research, our data shows that all dimensions of the TWQ model have a positive impact on team performance in agile software development teams. Our findings indicate that an organization’s mindset towards gender diversity has a stronger effect on …", "num_citations": "6\n", "authors": ["1380"]}
{"title": "Team portfolio scrum: an action research on multitasking in multi-project scrum teams\n", "abstract": " Multi-project agile software development is a relatively new area of research. While original Scrum caters to co-located teams working on a single project, multi-project Scrum teams are a day-to-day reality, especially in small organizations. Multitasking across projects is frequently associated with loss of effectiveness, but this assumption is not sufficiently supported by empirical evidence. In order to better understand the phenomenon, we review existing literature across scientific domains and execute an action research project. Our findings show that the Team Portfolio Scrum (TPS) practice designed to support multitasking across projects is perceived to be useful, but with an associated increase in overhead.", "num_citations": "5\n", "authors": ["1380"]}
{"title": "Reporting in agile portfolio management: routines, metrics and artefacts to maintain an effective oversight\n", "abstract": " In a world where the speed of change is faster than ever, a growing number of organisations adopts Agile Portfolio Management (APM) to connect their agile teams to business strategy. A domain which has been little explored in literature and professional frameworks. Based on 14 interviews conducted in 10 large European organisations, in this paper we report the preliminary results of our study on reporting routines, artefacts and metrics in Agile Portfolio Management. In our findings we discuss the three generic domains of reporting responsibility and the novel types of reporting routines found in practice. Further, we use the concept of boundary objects to recommend which types of artefacts are effective for which reporting routines.", "num_citations": "3\n", "authors": ["1380"]}
{"title": "The kindergarten of entrepreneurship: Developing entrepreneurial spirit and skills through community building at universities\n", "abstract": " How can universities stimulate students to develop entrepreneurial skills and ambitions? This work provides insights into how community building compliments traditional theory-based entrepreneurship education at universities. Based on 21 interviews across university-based organizations supporting entrepreneurship across students we provide insights on (1) motivation, (2) ways of working, and (3) challenges of organizations when mobilizing an entrepreneurial spirit and developing entrepreneurial skills of students. Based on our findings we recommend to (1) provide local role models, (2) design an environment enabling and encouraging experimentation, and (3) facilitate network creation of participants.", "num_citations": "3\n", "authors": ["1380"]}
{"title": "Innovation Labs: A Taxonomy of Four Different Types\n", "abstract": " Today's increasing pace of change and intense competition places demands on organizations to use a different approach to innovation, going beyond the incremental innovation that is typically developed within the core of the organization. As an option to escape the existing beliefs of the core organization, innovation labs are used to develop more discontinuous innovation. Despite the abundance of these so-called innovation labs in practice, researchers have devoted little effort to scrutinizing the concept and to provide managers with a framework for exploiting this form of innovation. In this paper, we aim to perform an empirical investigation and to create a consensus around the concept of innovation labs. To do so, we conducted a multiple case study in large international organizations with a total of 31 interviews of an average length of 70 minutes. We offer a framework by identifying four innovation lab types …", "num_citations": "2\n", "authors": ["1380"]}
{"title": "Towards flexibility and dynamic coordination in computer-interpretable enterprise process models\n", "abstract": " We contribute to the understanding of collaboration in enterprise process models and adaptation to unforeseen variations thereof. To address the need for flexibility we take an example from the life-saving domain and translate qualitatively collected process data of a concrete medical intervention into a computer-interpretable guideline model. To overcome implementation barriers we apply the coordination modeling language Paradigm, as a possible approach, which addresses coordination of collaborating components in terms of dynamic constraints. Its component McPal enables adding new behavior, and, subsequently, gradually adapting the system without quiescence.", "num_citations": "2\n", "authors": ["1380"]}
{"title": "Data-Driven Innovation for NGO’s: How to define and mobilise the Data Revolution for Sustainable Development?\n", "abstract": " How can data be leveraged for sustainable development? This paper aims to help understanding the current state-ofart on data-driven innovation, and how Non-Governmental Organisations [NGOs] in the field of sustainable development can learn from it. Based on the preliminary analysis of 187 scientific articles on data-driven innovation, and scoping interviews we provide a view on (1) the definition of data-driven innovation,(2) challenges of NGOs in implementing data-driven innovation, and (3) across which sectors NGOs could find potentially valuable examples for further implementation.", "num_citations": "1\n", "authors": ["1380"]}
{"title": "Structuring Medical Agility.\n", "abstract": " Technology is omnipresent in intervention rooms, potentially having enormous impact on workflows and on flexibility. Despite ICT systems’ more flexible support of medical protocols, the styles of collaborating do not really match. Intervention support systems are as yet stand alone and not sufficiently interoperable. Taking an ICT perspective, we seek to understand medical work, how to view the way it is organized and how to improve its integration with intervention support systems, driven by highly dynamic coordination models embedded in the framework of clinical pathways.", "num_citations": "1\n", "authors": ["1380"]}