{"title": "Modeling component connectors in Reo by constraint automata\n", "abstract": " In this paper we introduce constraint automata and propose them as an operational model for Reo, an exogenous coordination language for compositional construction of component connectors based on a calculus of channels. By providing composition operators for constraint automata and defining notions of equivalence and refinement relations for them, this paper covers the foundations for building tools to address concerns such as the automated construction of the automaton for a given component connector, equivalence checking or containment checking of the behavior of two given connectors, and verification of coordination mechanisms.", "num_citations": "357\n", "authors": ["1617"]}
{"title": "Model checking for a probabilistic branching time logic with fairness\n", "abstract": " We consider concurrent probabilistic systems, based on probabilistic automata of Segala & Lynch [55], which allow non-deterministic choice between probability distributions. These systems can be decomposed into a collection of “computation trees” which arise by resolving the non-deterministic, but not probabilistic, choices. The presence of non-determinism means that certain liveness properties cannot be established unless fairness is assumed. We introduce a probabilistic branching time logic PBTL, based on the logic TPCTL of Hansson [30] and the logic PCTL of [55], resp. pCTL [14]. The formulas of the logic express properties such as “every request is eventually granted with probability at least p”. We give three interpretations for PBTL on concurrent probabilistic processes: the first is standard, while in the remaining two interpretations the branching time quantifiers are taken to range over a certain kind of …", "num_citations": "293\n", "authors": ["1617"]}
{"title": "On algorithmic verification methods for probabilistic systems\n", "abstract": " Parallel systems (such as operating systems, telecommunication systems, aircraft controlling systems, banking systems, etc.) arise in many industrial applications. For applications where errors might be expensive and lead to dangerous or even catastrophal situations a precise analysis of the possible system behaviours is an important task. The quality of a parallel system depends on several properties, typically classi ed into safety properties which state that\\nothing bad happens\"(eg mutual exclusion, deadlock freedom or the computation of su ciently exact numerical values) and liveness or progress properties which assert that\\something good will eventually happen\"(eg termination, starvation freedom) OwLa82]. In realistic applications, not only the functionality of a parallel system is important, also quantitative aspects (such as time or probabilities) play a crucial role. For instance, in practice, it is useless to establish a property like\\each request will eventually be answered\" as there is no bound on how much time will pass between a request and the response. Typically, one aims at a property like\\each request will eventually be answered within the next 5 seconds\". Whether or not a property of this type can be established not only depends on the design of the system but also on the reliability of the interface with the environment or the resources that the system uses. For instance, if the response is transmitted via an uncertain medium that might loose messages a property as above can never hold. However, the cases where a physical error happens might be rare. If the failure rates are known (or can be estimated by experimental results), it makes …", "num_citations": "199\n", "authors": ["1617"]}
{"title": "Deciding bisimilarity and similarity for probabilistic processes\n", "abstract": " This paper deals with probabilistic and nondeterministic processes represented by a variant of labeled transition systems where any outgoing transition of a state s is augmented with probabilities for the possible successor states. Our main contributions are algorithms for computing this bisimulation equivalence classes as introduced by Larsen and Skou (1996, Inform. and Comput. 99, 1–28), and the simulation preorder à la Segala and Lynch (1995, Nordic J. Comput. 2, 250–273). The algorithm for deciding bisimilarity is based on a variant of the traditional partitioning technique and runs in time O (mn (log m+ log n)) where m is the number of transitions and n the number of states. The main idea for computing the simulation preorder is the reduction to maximum flow problems in suitable networks. Using the method of Cheriyan, Hagerup, and Mehlhorn,(1990, Lecture Notes in Computer Science, Vol. 443, pp. 235 …", "num_citations": "159\n", "authors": ["1617"]}
{"title": "Liquor: A tool for qualitative and quantitative linear time analysis of reactive systems\n", "abstract": " LiQuor is a tool for verifying probabilistic reactive systems modelled Probmela programs, which are terms of a probabilistic guarded command language with an operational semantics based on (finite) Markov decision processes. LiQuor provides the facility to perform a qualitative or quantitative analysis for omega-regular linear time properties by means of automata-based model checking algorithms", "num_citations": "138\n", "authors": ["1617"]}
{"title": "Model checking Markov chains with actions and state labels\n", "abstract": " In the past, logics of several kinds have been proposed for reasoning about discrete-time or continuous-time Markov chains. Most of these logics rely on either state labels (atomic propositions) or on transition labels (actions). However, in several applications it is useful to reason about both state properties and action sequences. For this purpose, we introduce the logic as CSL which provides a powerful means to characterize execution paths of Markov chains with actions and state labels. asCSL can be regarded as an extension of the purely state-based logic CSL (continuous stochastic logic). In asCSL, path properties are characterized by regular expressions over actions and state formulas. Thus, the truth value of path formulas depends not only on the available actions in a given time interval, but also on the validity of certain state formulas in intermediate states. We compare the expressive power of CSL and …", "num_citations": "132\n", "authors": ["1617"]}
{"title": "Experiments with deterministic ω-automata for formulas of linear temporal logic\n", "abstract": " This paper addresses the problem of generating deterministic ω-automata for formulas of linear temporal logic, which can be solved by applying well-known algorithms to construct a nondeterministic Büchi automaton for the given formula on which we then apply a determinization algorithm. We study here in detail Safra's determinization algorithm, present several heuristics that attempt to decrease the size of the resulting automata and report on experimental results.", "num_citations": "122\n", "authors": ["1617"]}
{"title": "Controller synthesis for probabilistic systems\n", "abstract": " Controller synthesis addresses the question of how to limit the internal behavior of a given implementation to meet its specification, regardless of the behavior enforced by the environment. In this paper, we consider a model with probabilism and nondeterminism where the nondeterministic choices in some states are assumed to be controllable, while the others are under the control of an unpredictable environment. We first consider probabilistic computation tree logic as specification formalism, discuss the role of strategy-types for the controller and show the NP-hardness of the controller synthesis problem. The second part of the paper presents a controller synthesis algorithm for automata-specifications which relies on a reduction to the synthesis problem for PCTL with fairness.", "num_citations": "111\n", "authors": ["1617"]}
{"title": "Partial Order Reduction for Probabilistic Systems.\n", "abstract": " In the past, several model checking algorithms have been proposed to verify probabilistic reactive systems. The techniques to combat the state-explosion problem have mainly concentrated on symbolic methods with variants of decision diagrams or abstraction methods. In this paper, we show how partial order reduction with a variant of Peled’s ample set method can be applied in the context of LTL model checking for probabilistic systems modelled by Markov decision processes.", "num_citations": "103\n", "authors": ["1617"]}
{"title": "Probabilistic ω-automata\n", "abstract": " Probabilistic ω-automata are variants of nondeterministic automata over infinite words where all choices are resolved by probabilistic distributions. Acceptance of a run for an infinite input word can be defined using traditional acceptance criteria for ω-automata, such as Büchi, Rabin or Streett conditions. The accepted language of a probabilistic ω-automata is then defined by imposing a constraint on the probability measure of the accepting runs. In this paper, we study a series of fundamental properties of probabilistic ω-automata with three different language-semantics: (1) the probable semantics that requires positive acceptance probability, (2) the almost-sure semantics that requires acceptance with probability 1, and (3) the threshold semantics that relies on an additional parameter λ ∈ ]0,1[ that specifies a lower probability bound for the acceptance probability. We provide a comparison of probabilistic ω-automata …", "num_citations": "98\n", "authors": ["1617"]}
{"title": "Modeling component connectors in Reo by constraint automata\n", "abstract": " Reo is an exogenous coordination language for compositional construction of component connectors based on a calculus of channels. Building automated tools to address such concerns as equivalence or containment of the behavior of two given connectors, verification of the behavior of a connector, etc. requires an operational semantic model suitable for model checking. In this paper we introduce constraint automata and propose them as a semantic model for Reo.", "num_citations": "98\n", "authors": ["1617"]}
{"title": "On decision problems for probabilistic Büchi automata\n", "abstract": " Probabilistic Büchi automata (PBA) are finite-state acceptors for infinite words where all choices are resolved by fixed distributions and where the accepted language is defined by the requirement that the measure of the accepting runs is positive. The main contribution of this paper is a complementation operator for PBA and a discussion on several algorithmic problems for PBA. All interesting problems, such as checking emptiness or equivalence for PBA or checking whether a finite transition system satisfies a PBA-specification, turn out to be undecidable. An important consequence of these results are several undecidability results for stochastic games with incomplete information, modelled by partially-observable Markov decision processes and ω-regular winning objectives. Furthermore, we discuss an alternative semantics for PBA where it is required that almost all runs for an accepted word are accepting …", "num_citations": "97\n", "authors": ["1617"]}
{"title": "Polynomial time algorithms for testing probabilistic bisimulation and simulation\n", "abstract": " Various models and equivalence relations or preorders for probabilistic processes are proposed in the literature. This paper deals with a model based on labelled transition systems extended to the probabalistic setting and gives an O(n2·m) algorithm for testing probabilistic bisimulation and an O (n 5 ·m 2) algorithm for testing probabilistic simulation where n is the number of states and m the number of transitions in the underlying probabilistic transition systems.", "num_citations": "88\n", "authors": ["1617"]}
{"title": "Trade-off analysis meets probabilistic model checking\n", "abstract": " Probabilistic model checking (PMC) is a well-established and powerful method for the automated quantitative analysis of parallel distributed systems. Classical PMC-approaches focus on computing probabilities and expectations in Markovian models annotated with numerical values for costs and utility, such as energy and performance. Usually, the utility gained and the costs invested are dependent and a trade-off analysis is of utter interest.", "num_citations": "80\n", "authors": ["1617"]}
{"title": "ProFeat: feature-oriented engineering for family-based probabilistic model checking\n", "abstract": " The concept of features provides an elegant way to specify families of systems. Given a base system, features encapsulate additional functionalities that can be activated or deactivated to enhance or restrict the base system’s behaviors. Features can also facilitate the analysis of families of systems by exploiting commonalities of the family members and performing an all-in-one analysis, where all systems of the family are analyzed at once on a single family model instead of one-by-one. Most prominent, the concept of features has been successfully applied to describe and analyze (software) product lines. We present the tool ProFeat that supports the feature-oriented engineering process for stochastic systems by probabilistic model checking. To describe families of stochastic systems, ProFeat extends models for the prominent probabilistic model checker Prism by feature-oriented concepts, including support …", "num_citations": "77\n", "authors": ["1617"]}
{"title": "Symbolic model checking for channel-based component connectors\n", "abstract": " The paper reports on the foundations and experimental results with a model checker for component connectors modelled by networks of channels in the calculus Reo. The specification formalisms is a branching time logic that allows to reason about the coordination principles of and the data flow in the network. The underlying model checking algorithm relies on variants of standard automata-based approaches and model checking for CTL-like logics. The implementation uses a symbolic representation of the network and the enabled I/O-operations by means of binary decision diagrams. It has been applied to a couple examples that illustrate the efficiency of our model checker.", "num_citations": "77\n", "authors": ["1617"]}
{"title": "Probabilistic model checking for feature-oriented systems\n", "abstract": " Within product lines, collections of several related products are defined through their commonalities in terms of features rather than specifying them individually one-by-one. In this paper we present a compositional framework for modeling dynamic product lines by a state-based formalism with both probabilistic and nondeterministic behaviors. Rules for feature changes in products made during runtime are formalized by a coordination component imposing constraints on possible feature activations and deactivations. Our framework supports large-scaled product lines described through multi-features, i.e., where products may involve multiple instances of a feature.                 To establish temporal properties for products in a product line, verification techniques have to face a combinatorial blow-up that arises when reasoning about several feature combinations. This blow-up can be avoided by family-based …", "num_citations": "76\n", "authors": ["1617"]}
{"title": "PROBMELA: a modeling language for communicating probabilistic processes\n", "abstract": " Building automated tools to address the analysis of reactive probabilistic systems requires a simple, but expressive input language with a formal semantics based on a probabilistic operational model that can serve as starting point for verification algorithms. We introduce for probabilistic parallel programs with shared variables, message passing via synchronous and (perfect or lossy) fifo channels and atomic regions and provide a structured operational semantics. Applied to finite-state systems, the semantics can serve as basis for the algorithmic generation of a Markov decision process that models the stepwise behavior of the given system.", "num_citations": "76\n", "authors": ["1617"]}
{"title": "Domain equations for probabilistic processes\n", "abstract": " In this paper we consider Milner's calculus CCS enriched by a probabilistic choice operator. The calculus is given operational semantics based on probabilistic transition systems. We define operational notions of preorder and equivalence as probabilistic extensions of the simulation preorder and the bisimulation equivalence respectively. We extend existing category-theoretic techniques for solving domain equations to the probabilistic case and give two denotational semantics for the calculus. The first, ‘smooth’, semantic model arises as a solution of a domain equation involving the probabilistic powerdomain and solved in the category CONT⊥ of continuous domains. The second model also involves an appropriately restricted probabilistic powerdomain, but is constructed in the category CUM of complete ultra-metric spaces, and hence is necessarily ‘discrete’. We show that the domain-theoretic semantics is fully …", "num_citations": "76\n", "authors": ["1617"]}
{"title": "Models and temporal logics for timed component connectors\n", "abstract": " The coordination language Reo supports compositional system construction through connectors with real-time properties that exogenously coordinate the interactions among the constituent components into a coherent collaboration. In this paper, we present an operational semantics for the channel-based component connectors of Reo in terms of Timed Constraint Automata and introduce a temporal-logic for specification and verification of their real-time properties.", "num_citations": "74\n", "authors": ["1617"]}
{"title": "Theoretische Informatik\n", "abstract": " pub H-BRS | Theoretische Informatik Deutsch Login Hochschule Bonn-Rhein-Sieg Open Access Home Search Browse Publish Help Volltext-Downloads (blau) und Frontdoor-Views (grau) Schließen Theoretische Informatik Alexander Asteroth, Christel Baier Eine anschauliche Einführung in die klassischen Themenbereiche der Theoretischen Informatik für Studierende der Informatik im Haupt- und Nebenfach. Die Autoren wählen einen Ansatz, der durch zahlreiche ausgearbeitete Beispiele auch LeserInnen mit nur elementaren Mathematikkenntnissen den Zugang zu Berechenbarkeit, Komplexitätstheorie und formalen Sprachen ermöglicht. Die mathematischen Konzepte werden sowohl formal eingeführt als auch informell erläutert und durch grafische Darstellungen veranschaulicht. Das Buch umfasst den Lehrstoff einführender Vorlesungen in die Theoretische Informatik und bietet zahlreiche Übungsaufgaben zu …", "num_citations": "74\n", "authors": ["1617"]}
{"title": "Partial order reduction for probabilistic branching time\n", "abstract": " In the past, partial order reduction has been used successfully to combat the state explosion problem in the context of model checking for non-probabilistic systems. For both linear time and branching time specifications, methods have been developed to apply partial order reduction in the context of model checking. Only recently, results were published that give criteria on applying partial order reduction for verifying quantitative linear time properties for probabilistic systems. This paper presents partial order reduction criteria for Markov decision processes and branching time properties, such as formulas of probabilistic computation tree logic. Moreover, we provide a comparison of the results established so far about reduction conditions for Markov decision processes.", "num_citations": "73\n", "authors": ["1617"]}
{"title": "Recognizing/spl omega/-regular languages with probabilistic automata\n", "abstract": " Probabilistic finite automata as acceptors for languages over finite words have been studied by many researchers. In this paper, we show how probabilistic automata can serve as acceptors for /spl omega/-regular languages. Our main results are that our variant of probabilistic Buchi automata (PBA) is more expressive than non-deterministic /spl omega/-automata, but a certain subclass of PBA, called uniform PBA, has exactly the power of /spl omega/-regular languages. This also holds for probabilistic /spl omega/-automata with Streett or Rabin acceptance. We show that certain /spl omega/-regular languages have uniform PBA of linear size, while any nondeterministic Streett automaton is of exponential size, and vice versa. Finally, we discuss the emptiness problem for uniform PBA and the use of PBA for the verification of Markov chains against qualitative linear-time properties.", "num_citations": "72\n", "authors": ["1617"]}
{"title": "A uniform framework for modeling and verifying components and connectors\n", "abstract": " The purpose of this paper is to present a framework to model component interfaces and the component connectors that provide the glue code for the components. Our modeling approach is based on two input languages which rely on the same automata model. One of them is a scripting language which can serve to specify exogenous or endogenous coordination mechanisms. The other one is a guarded command language which has been designed to specify behavioral component interfaces, but can also be used to design component connectors. This hybrid approach allows nesting of the two specification languages, supports compositional design, modular verification and reusability of components or component connectors. It yields the input language of our verification toolset Vereofy which realizes several model checking algorithms for components, component connectors, and the composite system.", "num_citations": "66\n", "authors": ["1617"]}
{"title": "On the verification of qualitative properties of probabilistic processes under fairness constraints\n", "abstract": " We consider sequential and concurrent probabilistic processes and propose a general notion of fairness with respect to probabilistic choice, which allows to express various notions of fairness such as process fairness and event fairness. We show the soundness of proving the validity of qualitative properties of probabilistic processes under fairness constraints in the sense that whenever all fair executions of a probabilistic process fulfill a certain linear time property E then E holds for almost all executions (i.e., E holds with probability 1). It follows that in order to verify probabilistic processes with respect to linear time specifications, it suffices to establish that—for some instance of our general notion of fairness—all fair executions satisfy the specification. This generalizes the soundness results for extreme and α-fairness established by Pnueli in 1983 and 1993, respectively. Furthermore, we show that the α-fairness of …", "num_citations": "65\n", "authors": ["1617"]}
{"title": "Models and temporal logical specifications for timed component connectors\n", "abstract": " Component-based software engineering advocates construction of software systems through composition of coordinated autonomous components. Significant benefits of this approach include software reuse, simpler and faster construction, enhanced reliability, and dramatic reductions in the complexity of construction of provably correct critical systems, many of which involve real-time concerns. Effective, flexible component composition by itself still poses a challenge today and yet the special nature of real-time constraints makes component-based construction of real-time systems even more demanding. The coordination language Reo supports compositional system construction through connectors that exogenously coordinate the interactions among the constituent components which unawarely comprise a complex system, into a coherent collaboration. The simple, yet surprisingly rich, calculus of channel …", "num_citations": "63\n", "authors": ["1617"]}
{"title": "Model checking probabilistic systems\n", "abstract": " The model-checking approach was originally formulated for verifying qualitative properties of systems, for example safety and liveness (see Chap.                2                            ), and subsequently extended to also handle quantitative features, such as real time (see Chap.                29                            ), continuous flows (see Chap.                30                            ), as well as stochastic phenomena, where system evolution is governed by a given probability distribution. Probabilistic model checking aims to establish the correctness of probabilistic system models against quantitative probabilistic specifications, such as those capable of expressing, for example, the probability of an unsafe event occurring, expected time to termination, or expected power consumption in the start-up phase. In this chapter, we present the foundations of probabilistic model checking, focusing on finite-state Markov decision processes as models …", "num_citations": "61\n", "authors": ["1617"]}
{"title": "Design and verification of systems with exogenous coordination using Vereofy\n", "abstract": " The feasibility of formal methods for the analysis of complex systems crucially depends on a modeling framework that supports compositional design, stepwise refinement and abstractions. An important feature is the clear separation of coordination and computation which permits to apply various verification techniques for the computation performed by components and interactions as well as dependencies between the components. We report here on a model-checking approach using the tool Vereofy that is based on an exogenous coordination model, where the components are represented by their behavioral interfaces. Vereofy supports the verification of the components and their communication structure. Our approach is illustrated by means of a case study with a sensor network where Vereofy has been used to establish several properties of the sensor nodes and their routing procedures.", "num_citations": "58\n", "authors": ["1617"]}
{"title": "Model checking linear-time properties of probabilistic systems\n", "abstract": " This chapter is about the verification of Markov decision processes (MDPs) which incorporate one of the fundamental models for reasoning about probabilistic and nondeterministic phenomena in reactive systems. MDPs have their roots in the field of operations research and are nowadays used in a wide variety of areas including verification, robotics, planning, controlling, reinforcement learning, economics and semantics of randomized systems. Furthermore, MDPs served as the basis for the introduction of probabilistic automata which are related to weighted automata. We describe the use of MDPs as an operational model for randomized systems, e.g., systems that employ randomized algorithms, multi-agent systems or systems with unreliable components or surroundings. In this context we outline the theory of verifying ω-regular properties of such operational models. As an integral part of this theory we …", "num_citations": "58\n", "authors": ["1617"]}
{"title": "Reduction techniques for model checking Markov decision processes\n", "abstract": " The quantitative analysis of a randomized system, modeled by a Markov decision process, against an LTL formula can be performed by a combination of graph algorithms, automata-theoretic concepts and numerical methods to compute maximal or minimal reachability probabilities. In this paper, we present various reduction techniques that serve to improve the performance of the quantitative analysis, and report on their implementation on the top of the probabilistic model checker \\LiQuor. Although our techniques are purely heuristic and cannot improve the worst-case time complexity of standard algorithms for the quantitative analysis, a series of examples illustrates that the proposed methods can yield a major speed-up.", "num_citations": "56\n", "authors": ["1617"]}
{"title": "Reasoning about probabilistic lossy channel systems\n", "abstract": " We consider the problem of deciding whether an infinite-state system (expressed as a Markov chain) satisfies a correctness property with probability 1. This problem is, of course, undecidable for general infinite-state systems. We focus our attention on the model of probabilistic lossy channel systems consisting of finite-state processes that communicating over unbounded lossy FIFO channels. Abdulla and Jonsson have shown that safety properties are decidable while progress properties are not for non-probabilistic lossy channel systems. Under assumptions of “sufficiently high” probability of loss, Baier and Engelen have shown how to check whether a property holds of probabilistic lossy channel system with probability 1.               In this paper we show that the problem of checking whether a progress property holds with probability 1 is undecidable, if the assumption about “sufficiently high” probability of loss …", "num_citations": "56\n", "authors": ["1617"]}
{"title": "Metric semantics for true concurrent real time\n", "abstract": " This paper investigates the use of a complete metric space framework for providing denotational semantics to a real-time process algebra. The study is carried out in a non-interleaving setting and is based on a timed extension of Langerak's bundle event structures, a variant of Winskel's event structures. The distance function is based on the amount of time to which event structures do ‘agree’. We show that this intuitive notion of distance is a pseudo metric (but not a metric) on the set of timed event structures. A generalisation to equivalence classes of timed event structures in which we abstract from event names and non-executable events (events that can never appear) is shown to be a complete ultra-metric space. We show that the resulting metric semantics is an abstraction of an existing cpo-based denotational and a related operational semantics for the considered language.", "num_citations": "56\n", "authors": ["1617"]}
{"title": "Advances in probabilistic model checking with PRISM: variable reordering, quantiles and weak deterministic Büchi automata\n", "abstract": " The popular model checker PRISM has been successfully used for the modeling and analysis of complex probabilistic systems. As one way to tackle the challenging state explosion problem, PRISM supports symbolic storage and manipulation using multi-terminal binary decision diagrams for representing the models and in the computations. However, it lacks automated heuristics for variable reordering, even though it is well known that the order of BDD variables plays a crucial role for compact representations and efficient computations. In this article, we present a collection of extensions to PRISM. First, we provide support for automatic variable reordering within the symbolic engines of PRISM and allow users to manually control the variable ordering at a fine-grained level. Second, we provide extensions in the realm of reward-bounded properties, namely symbolic computations of quantiles in Markov …", "num_citations": "54\n", "authors": ["1617"]}
{"title": "Energy-utility quantiles\n", "abstract": " The concept of quantiles is well-known in statistics, but its benefits for the formal quantitative analysis of probabilistic systems have been noticed only recently. To compute quantiles in Markov decision processes where the objective is a probability constraint for an until (i.e., constrained reachability) property with an upper reward bound, an iterative linear-programming (LP) approach has been proposed in a recent paper. We consider here a more general class of quantiles with probability or expectation objectives, allowing to reason about the trade-off between costs in terms of energy and some utility measure. We show how the iterative LP approach can be adapted for these types of quantiles and propose another iterative approach that decomposes the LP to be solved into smaller ones. This algorithm has been implemented and evaluated in case studies for quantiles where the objective is a probability …", "num_citations": "53\n", "authors": ["1617"]}
{"title": "Ensuring the reliability of your model checker: Interval iteration for Markov decision processes\n", "abstract": " Probabilistic model checking provides formal guarantees on quantitative properties such as reliability, performance or risk, so the accuracy of the numerical results that it returns is critical. However, recent results have shown that implementations of value iteration, a widely used iterative numerical method for computing reachability probabilities, can return results that are incorrect by several orders of magnitude. To remedy this, interval iteration, which instead converges simultaneously from both above and below, has been proposed. In this paper, we present interval iteration techniques for computing expected accumulated weights (or costs), a considerably broader class of properties. This relies on an efficient, mainly graph-based method to determine lower and upper bounds for extremal expected accumulated weights. To offset the additional effort of dual convergence, we also propose topological interval …", "num_citations": "50\n", "authors": ["1617"]}
{"title": "Computing conditional probabilities in Markovian models efficiently\n", "abstract": " The fundamentals of probabilistic model checking for Markovian models and temporal properties have been studied extensively in the past 20 years. Research on methods for computing conditional probabilities for temporal properties under temporal conditions is, however, comparably rare. For computing conditional probabilities or expected values under ω-regular conditions in Markov chains, we introduce a new transformation of Markov chains that incorporates the effect of the condition into the model. For Markov decision processes, we show that the task to compute maximal reachability probabilities under reachability conditions is solvable in polynomial time, while it was conjectured to be computationally hard. Using adaptions of known automata-based methods, our algorithm can be generalized for computing the maximal conditional probabilities for ω-regular events under ω-regular conditions. The …", "num_citations": "48\n", "authors": ["1617"]}
{"title": "Computing quantiles in Markov reward models\n", "abstract": " Probabilistic model checking mainly concentrates on techniques for reasoning about the probabilities of certain path properties or expected values of certain random variables. For the quantitative system analysis, however, there is also another type of interesting performance measure, namely quantiles. A typical quantile query takes as input a lower probability bound p ∈ ]0,1] and a reachability property. The task is then to compute the minimal reward bound r such that with probability at least p the target set will be reached before the accumulated reward exceeds r. Quantiles are well-known from mathematical statistics, but to the best of our knowledge they have not been addressed by the model checking community so far.               In this paper, we study the complexity of quantile queries for until properties in discrete-time finite-state Markov decision processes with nonnegative rewards on states. We …", "num_citations": "48\n", "authors": ["1617"]}
{"title": "Denotational semantics in the cpo and metric approach\n", "abstract": " We investigate the implications of choosing a cpo-framework resp. a complete metric space framework for defining denotational semantics of languages that allow for recursion/iteration, communication and concurrency. We first establish a general framework for the cpo and the metric approach. The existence and uniqueness of meaning functions is studied. In the metric case the existence and uniqueness of a meaning function can be established under some reasonable assumptions. In the cpo-case we obtain the existence of a least meaning function. From these theorems consistency results can be concluded. In the second part we study the impact of the choice between cpo and metric for semantics based on event-structures and for semantics based on pomset classes.", "num_citations": "44\n", "authors": ["1617"]}
{"title": "Stochastic game logic\n", "abstract": " Stochastic game logic (SGL) is a new temporal logic for multi-agent systems modeled by turn-based multi-player games with discrete transition probabilities. It combines features of alternating-time temporal logic (ATL), probabilistic computation tree logic and extended temporal logic. SGL contains an ATL-like modality to specify the individual cooperation and reaction facilities of agents in the multi-player game to enforce a certain winning objective. While the standard ATL modality states the existence of a strategy for a certain coalition of agents without restricting the range of strategies for the semantics of inner SGL formulae, we deal with a more general modality. It also requires the existence of a strategy for some coalition, but imposes some kind of strategy binding to inner SGL formulae. This paper presents the syntax and semantics of SGL and discusses its model checking problem for different types of …", "num_citations": "43\n", "authors": ["1617"]}
{"title": "Probabilistic Models for Reo Connector Circuits.\n", "abstract": " Constraint automata have been used as an operational model for Reo which offers a channel-based framework to compose complex component connectors. In this paper, we introduce a variant of constraint automata with discrete probabilities and nondeterminism, called probabilistic constraint automata. These can serve for compositional reasoning about connector components, modelled by Reo circuits with unreliable channels, eg, that might lose or corrupt messages, or channels with random output values that, eg, can be helpful to model randomized coordination principles.", "num_citations": "42\n", "authors": ["1617"]}
{"title": "Synthesis of Reo circuits for implementation of component-connector automata specifications\n", "abstract": " Composition of a concurrent system out of components involves coordination of their mutual interactions. In component-based construction, this coordination becomes the responsibility of the glue-code language and its underlying run-time middle-ware. Reo offers an expressive glue-language for construction of coordinating component connectors out of primitive channels. In this paper we consider the problem of synthesizing Reo coordination code from a specification of a behavior as a relation on scheduled-data streams. The specification is given as a constraint automaton that describes the desired input/output behavior at the ports of the components. The main contribution in this paper is an algorithm that generates Reo code from a given constraint automaton.", "num_citations": "42\n", "authors": ["1617"]}
{"title": "Establishing qualitative properties for probabilistic lossy channel systems\n", "abstract": " Lossy channel systems (LCSs) are models for communicating systems where the subprocesses are linked via unbounded FIFO channels which might lose messages. Link protocols, such as the Alternating Bit Protocol and HDLC can be modelled with these systems. The decidability of several verification problems of LCSs has been investigated by Abdulla & Jonsson [AJ93], AJ94], e.g. they have shown that the reach-ability problem for LCSs is decidable while LTL model checking is not. In this paper, we consider probabilistic LCSs (which are LCSs where the transitions are augmented with appropriate probabilities) as introduced by [IN97] and show that the question of whether or not a linear time property holds with probability 1 is decidable. More precisely, we show how LTL ∖X  model checking for (certain types of) probabilistic LCSs can be reduced to a reachability problem in a (non-probabilistic) LCS …", "num_citations": "41\n", "authors": ["1617"]}
{"title": "Genetic algorithms for the variable ordering problem of binary decision diagrams\n", "abstract": " Ordered binary decision diagrams (BDDs) yield a data structure for switching functions that has been proven to be very useful in many areas of computer science. The major problem with BDD-based calculations is the variable ordering problem which addresses the question of finding an ordering of the input variables which minimizes the size of the BDD-representation. In this paper, we discuss the use of genetic algorithms to improve the variable ordering of a given BDD. First, we explain the main features of an implementation and report on experimental studies. In this context, we present a new crossover technique that turned out to be very useful in combination with sifting as hybridization technique. Second, we provide a definition of a distance graph which can serve as formal framework for efficient schemes for the fitness evaluation.", "num_citations": "40\n", "authors": ["1617"]}
{"title": "Stochastic reasoning about channel-based component connectors\n", "abstract": " Constraint automata have been used as an operational model for component connectors that coordinate the cooperation and communication of the components by means of a network of channels. In this paper, we introduce a variant of constraint automata (called continuous-time constraint automata) that allows us to specify time-dependent stochastic assumptions about the channel connections or the component interfaces, such as the arrival rates of communication requests, the average delay of enabled I/O-operations at the channel ends or the stochastic duration of internal computations. This yields the basis for a performance analysis of channel-based coordination mechanisms. We focus on compositional reasoning and discuss several bisimulation relations on continuous-time constraint automata. For this, we adapt notions of strong and weak bisimulation that have been introduced for similar stochastic …", "num_citations": "37\n", "authors": ["1617"]}
{"title": "Trace machines for observing continuous-time Markov chains\n", "abstract": " In this paper, we study several linear-time equivalences (Markovian trace equivalence, failure and ready trace equivalence) for continuous-time Markov chains that refer to the probabilities for timed execution paths. Our focus is on testing scenarios by means of push-button experiments with appropriate trace machines and a discussion of the connections between the equivalences. For Markovian trace equivalence, we provide alternative characterizations, including one that abstracts away from the time instances where actions are observed, but just reports on the average sojourn times in the states. This result is used for a reduction of the question whether two finite-state continuous-time Markov chains are Markovian trace equivalent to the probabilistic trace equivalence problem for discrete-time Markov chains (and the latter is known to be solvable in polynomial time).", "num_citations": "37\n", "authors": ["1617"]}
{"title": "On-the-Fly Stuttering in the Construction of Deterministic ω-Automata\n", "abstract": " We propose to use the knowledge that an ω-regular property is stutter insensitive to construct potentially smaller deterministic ω-automata for such a property, e.g. using Safra’s determinization construction. This knowledge allows us to skip states that are redundant under stuttering, which can reduce the size of the generated automaton. In order to use this technique even for automata that are not completely insensitive to stuttering, we introduce the notion of partial stutter insensitiveness and apply our construction only on the subset of symbols for which stuttering is allowed. We evaluate the benefits of this heuristic in practice using multiple sets of benchmark formulas.", "num_citations": "36\n", "authors": ["1617"]}
{"title": "Parametric Markov chains: PCTL complexity and fraction-free Gaussian elimination\n", "abstract": " Parametric Markov chains have been introduced as a model for families of stochastic systems that rely on the same graph structure, but differ in the concrete transition probabilities. The latter are specified by polynomial constraints over a finite set of parameters. Important tasks in the analysis of parametric Markov chains are (1) computing closed-form solutions for reachability probabilities and other quantitative measures and (2) finding symbolic representations of the set of parameter valuations for which a given temporal logical formula holds as well as (3) the decision variant of (2) that asks whether there exists a parameter valuation where a temporal logical formula holds. Our contribution to (1) is to show that existing implementations for computing rational functions for reachability probabilities or expected costs in parametric Markov chains can be improved by using fraction-free Gaussian elimination, a long-known …", "num_citations": "35\n", "authors": ["1617"]}
{"title": "Weight monitoring with linear temporal logic: complexity and decidability\n", "abstract": " Many important performance and reliability measures can be formalized as the accumulated values of weight functions. In this paper, we introduce an extension of linear time logic including past (LTL) with new operators that impose constraints on the accumulated weight along path fragments. The fragments are characterized by regular conditions formalized by deterministic finite automata (monitor DFA). This new logic covers properties expressible by several recently proposed formalisms. We study the model-checking problem for weighted transition systems, Markov chains and Markov decision processes with rational weights. While the general problem is undecidable, we provide algorithms and sharp complexity bounds for several sublogics that arise by restricting the monitoring DFA.", "num_citations": "33\n", "authors": ["1617"]}
{"title": "Synthesis of Reo circuits from scenario-based interaction specifications\n", "abstract": " It is difficult to construct correct models for distributed large-scale service-oriented applications. Typically, the behavior of such an application emerges from the interaction and collaboration of multiple components/services. On the other hand, each component, in general, takes part in multiple scenarios. Consequently, not only components, but also their interaction protocols are important in the development process for distributed systems. Coordination models and languages, like Reo, offer powerful “glue-code” to encode interaction protocols. In this paper we propose a novel synthesis technique, which can be used to generate Reo circuits directly from scenario specifications. Inspired by the way UML2.0 sequence diagrams can be algebraically composed, we define an algebraic framework for merging connectors generated from partial specifications by exploiting the algebraic structure of UML sequence diagrams.", "num_citations": "32\n", "authors": ["1617"]}
{"title": "Verifying nondeterministic probabilistic channel systems against ω-regular linear-time properties\n", "abstract": " Lossy channel systems (LCS's) are systems of finite state processes that communicate via unreliable unbounded fifo channels. We introduce NPLCS's, a variant of LCS's where message losses have a probabilistic behavior while the component processes behave nondeterministically, and study the decidability of qualitative verification problems for ω-regular linear-time properties. We show that—in contrast to finite-state Markov decision processes—the satisfaction relation for linear-time formulas depends on the type of schedulers that resolve the nondeterminism. While the qualitative model checking problem for the full class of history-dependent schedulers is undecidable, the same question for finite-memory schedulers can be solved algorithmically. Additionally, some special kinds of reachability, or recurrent reachability, qualitative properties yield decidable verification problems for the full class of schedulers …", "num_citations": "30\n", "authors": ["1617"]}
{"title": "The connection between an event structure semantics and an operational semantics forTCSP\n", "abstract": " The relation between an operational interleaving semantics forTSCP based on a transition system and a compositional true concurrency semantics based on event structures is studied. In particular we extend the consistency result of Goltz and Loogan [15] forTCSP processes without recursion to the general case. Thus we obtain for everyTCSP processP that its operational meaningO(P) and the interleaving behaviourO( M∥3P∥3) which is derived from the event structureM∥3P∥3 associated withP are bisimilar.", "num_citations": "30\n", "authors": ["1617"]}
{"title": "Markov chains and unambiguous Büchi automata\n", "abstract": " Unambiguous automata, i.e., nondeterministic automata with the restriction of having at most one accepting run over a word, have the potential to be used instead of deterministic automata in settings where nondeterministic automata can not be applied in general. In this paper, we provide a polynomially time-bounded algorithm for probabilistic model checking of discrete-time Markov chains against unambiguous Büchi automata specifications and report on our implementation and experiments.", "num_citations": "28\n", "authors": ["1617"]}
{"title": "Architecture and advanced electronics pathways toward highly adaptive energy-efficient computing\n", "abstract": " With the explosion of the number of compute nodes, the bottleneck of future computing systems lies in the network architecture connecting the nodes. Addressing the bottleneck requires replacing current backplane-based network topologies. We propose to revolutionize computing electronics by realizing embedded optical waveguides for onboard networking and wireless chip-to-chip links at 200-GHz carrier frequency connecting neighboring boards in a rack. The control of novel rate-adaptive optical and mm-wave transceivers needs tight interlinking with the system software for runtime resource management.", "num_citations": "27\n", "authors": ["1617"]}
{"title": "Locks: Picking key methods for a scalable quantitative analysis\n", "abstract": " Functional correctness of low-level operating-system (OS) code is an indispensable requirement. However, many applications rely also on quantitative aspects such as speed, energy efficiency, resilience with regards to errors and other cost factors. We report on our experiences of applying probabilistic model-checking techniques for analysing the quantitative long-run behaviour of low-level OS-code. Our approach, illustrated in a case study analysing a simple test-and-test-and-set (TTS) spinlock protocol, combines measure-based simulation with probabilistic model-checking to obtain high-level models of the performance of realistic systems and to tune the models to predict future system behaviour. We report how we obtained a nearly perfect match of analytic results and measurements and how we tackled the state-explosion problem to obtain model-checking results for a large number of processes where …", "num_citations": "26\n", "authors": ["1617"]}
{"title": "On computing fixpoints in well-structured regular model checking, with applications to lossy channel systems\n", "abstract": " We prove a general finite convergence theorem for “upward-guarded” fixpoint expressions over a well-quasi-ordered set. This has immediate applications in regular model checking of well-structured systems, where a main issue is the eventual convergence of fixpoint computations. In particular, we are able to directly obtain several new decidability results on lossy channel systems.", "num_citations": "26\n", "authors": ["1617"]}
{"title": "Decision making improves sperm chemotaxis in the presence of noise\n", "abstract": " To navigate their surroundings, cells rely on sensory input that is corrupted by noise. In cells performing chemotaxis, such noise arises from the stochastic binding of signalling molecules at low chemoattractant concentrations. We reveal a fundamental relationship between the speed of chemotactic steering and the strength of directional fluctuations that result from the amplification of noise in a chemical input signal. This relation implies a trade-off between steering that is slow and reliable, and steering that is fast but less reliable. We show that dynamic switching between these two modes of steering can substantially increase the probability to find a target, such as an egg to be found by sperm cells. This decision making confers no advantage in the absence of noise, but is beneficial when chemical signals are detectable, yet characterized by low signal-to-noise ratios. The latter applies at intermediate distances from a target, where signalling molecules are diluted, thus defining a ‘noise zone’ that cells have to cross. Our results explain decision making observed in recent experiments on sea urchin sperm chemotaxis. More generally, our theory demonstrates how decision making enables chemotactic agents to cope with high levels of noise in gradient sensing by dynamically adjusting the persistence length of a biased random walk.", "num_citations": "25\n", "authors": ["1617"]}
{"title": "Quantitative analysis under fairness constraints\n", "abstract": " It is well-known that fairness assumptions can be crucial for verifying progress, reactivity or other liveness properties for interleaving models. This also applies to Markov decision processes as an operational model for concurrent probabilistic systems and the task to establish tight lower or upper probability bounds for events that are specified by liveness properties. In this paper, we study general notions of strong and weak fairness constraints for Markov decision processes, formalized in an action- or state-based setting. We present a polynomially time-bounded algorithm for the quantitative analysis of an MDP against ω-automata specifications under fair worst- or best-case scenarios. Furthermore, we discuss the treatment of strong and weak fairness and process fairness constraints in the context of partial order reduction techniques for Markov decision processes that have been realized in the model …", "num_citations": "25\n", "authors": ["1617"]}
{"title": "A uniform framework for weighted decision diagrams and its implementation\n", "abstract": " This paper introduces a generic framework for OBDD variants with weighted edges. It covers many boolean and multi-valued OBDD-variants that have been studied in the literature and applied to the symbolic representation and manipulation of discrete functions. Our framework supports reasoning about reducedness and canonicity of new OBDD-variants and provides a platform for the implementation and comparison of OBDD-variants. Furthermore, we introduce a new multi-valued OBDD-variant, called normalized algebraic decision diagram, which supports min/max-operations and turns out to be very useful for, e.g., integer linear programming and model checking probabilistic systems. Finally, we explain the main features of an implementation of a newly developed BDD-package, called JINC, which relies on our generic notion of weighted decision diagrams, and realizes various synthesis algorithms …", "num_citations": "25\n", "authors": ["1617"]}
{"title": "Compositional construction of most general controllers\n", "abstract": " Given a system  and an objective , the task of controller synthesis is to design a decision making policy that ensures  to be satisfied. This article deals with transition system-like system models and controllers that base their decisions on the observables of the actions performed so far. We present a framework for the compositional construction of controllers for conjunctive sequences of linear-time objectives in an online manner. For this approach, it is crucial that the controllers enforce the objectives in a most general manner, being as permissive as possible. We then present game-based algorithms for the construction of such most general controllers for invariance, reachability and -regular objectives.", "num_citations": "24\n", "authors": ["1617"]}
{"title": "Norm functions for probabilistic bisimulations with delays\n", "abstract": " We consider action-labelled systems with non-deterministic and probabilistic choice. Using the concept of norm functions [17], we introduce two types of bisimulations (called (strict) normed bisimulation equivalence) that allow for delays when simulating a transition and are strictly between strong and weak bisimulation equivalence à la [26,36,37]. Using a suitable modification of the prominent splitter/partitioning technique [25,30], we present polynomial-time algorithms that constructs the quotient space of the (strict) normed bisimulation equivalence classes.", "num_citations": "24\n", "authors": ["1617"]}
{"title": "Alternating-time stream logic for multi-agent systems\n", "abstract": " Constraint automata have been introduced to provide a uniform operational model for specifying service interfaces of components, the network that yields the glue code for the components, and the operational behavior of the composite system. Constraint automata have been used as the basis for equivalence checking and model checking temporal logical properties. This paper presents a multi-player semantics for constraint automata which serves to reason about controllability, interaction and cooperation facilities of individual components or coalitions of components in a given network. We introduce a temporal logic framework, called alternating-time stream logic, that combines classical features of alternating-time logic (ATL) for concurrent games with special operators for specifying regular conditions on the data streams in the network and on the write and read operations at the I/O-ports of the components …", "num_citations": "22\n", "authors": ["1617"]}
{"title": "Metric semantics from partial order semantics\n", "abstract": " In dealing with denotational semantics of programming languages partial orders resp. metric spaces have been used with great benefit in order to provide a meaning to recursive and repetitive constructs. This paper presents two methods to define a metric on a subset   of a complete partial order   such that   is a complete metric spaces and the metric semantics on   coincides with the partial order semantics on   when the same semantic operators are used. The first method is to add a ‘length’ on a complete partial order which means a function   of increasing power. The second is based on the ideas of [11] and uses pseudo rank orderings, i.e. monotone sequences of monotone functions  . We show that SFP domains can be characterized as special kinds of rank orderded cpo's. We also discuss the connection between the Lawson topology and the topology induced by the …", "num_citations": "22\n", "authors": ["1617"]}
{"title": "Compositional semantics of an actor-based language using constraint automata\n", "abstract": " Rebeca is an actor-based language which has been successfully applied to model concurrent and distributed systems. The semantics of Rebeca in labeled transition system is not compositional. In this paper, we investigate the possibility of mapping Rebeca models into a coordination language, Reo, and present a natural mapping that provides a compositional semantics of Rebeca. To this end, we consider reactive objects in Rebeca as components in Reo, and specify their behavior using constraint automata as black-box components within Reo circuits. Modeling coordination and communication among reactive objects as Reo circuits, and the behavior of reactive objects as constraint automata, provides a compositional semantics for Rebeca. Although the result is a compositional model, its visual representation in Reo shows very well that it still reflects the tight coupling inherent in the communication …", "num_citations": "21\n", "authors": ["1617"]}
{"title": "A hardware/software stack for heterogeneous systems\n", "abstract": " Plenty of novel emerging technologies are being proposed and evaluated today, mostly at the device and circuit levels. It is unclear what the impact of different new technologies at the system level will be. What is clear, however, is that new technologies will make their way into systems and will increase the already high complexity of heterogeneous parallel computing platforms, making it ever so difficult to program them. This paper discusses a programming stack for heterogeneous systems that combines and adapts well-understood principles from different areas, including capability-based operating systems, adaptive application runtimes, dataflow programming models, and model checking. We argue why we think that these principles built into the stack and the interfaces among the layers will also be applicable to future systems that integrate heterogeneous technologies. The programming stack is evaluated on a …", "num_citations": "20\n", "authors": ["1617"]}
{"title": "Distributed wait state tracking for runtime MPI deadlock detection\n", "abstract": " The widely used Message Passing Interface (MPI) with its multitude of communication functions is prone to usage errors. Runtime error detection tools aid in the removal of these errors. We develop MUST as one such tool that provides a wide variety of automatic correctness checks. Its correctness checks can be run in a distributed mode, except for its deadlock detection. This limitation applies to a wide range of tools that either use centralized detection algorithms or a timeout approach. In order to provide scalable and distributed deadlock detection with detailed insight into deadlock situations, we propose a model for MPI blocking conditions that we use to formulate a distributed algorithm. This algorithm implements scalable MPI deadlock detection in MUST. Stress tests at up to 4,096 processes demonstrate the scalability of our approach. Finally, overhead results for a complex benchmark suite demonstrate an …", "num_citations": "20\n", "authors": ["1617"]}
{"title": "A note on the attractor-property of infinite-state Markov chains\n", "abstract": " In the past 5 years, a series of verification algorithms has been proposed for infinite Markov chains that have a finite attractor, ie, a set that will be visited infinitely often almost surely starting from any state. In this paper, we establish a sufficient criterion for the existence of an attractor. We show that if the states of a Markov chain can be given levels (positive integers) such that the expected next level for states at some level n> 0 is less than n− Δ for some positive Δ, then the states at level 0 constitute an attractor for the chain. As an application, we obtain a direct proof that some probabilistic channel systems combining message losses with duplication and insertion errors have a finite attractor.", "num_citations": "20\n", "authors": ["1617"]}
{"title": "Generating Compact MTBDD-Representations from Probmela Specifications\n", "abstract": " The purpose of the paper is to provide an automatic transformation of parallel programs of an imperative probabilistic guarded command language (called Probmela) into probabilistic reactive module specifications. The latter serve as basis for the input language of the symbolic MTBDD-based probabilistic model checker PRISM, while Probmela is the modeling language of the model checker LiQuor which relies on an enumerative approach and supports partial order reduction and other reduction techniques. By providing the link between the model checkers PRISM and LiQuor, our translation supports comparative studies of different verification paradigms and can serve to use the (more comfortable) guarded command language for a MTBDD-based quantitative analysis. The challenges were (1) to ensure that the translation preserves the Markov decision process semantics, (2) the efficiency of the …", "num_citations": "19\n", "authors": ["1617"]}
{"title": "The algebraic mu-calculus and MTBDDs\n", "abstract": " The paper presents a new calculus (called algebraic mu-calculus) which generalizes Park's relational mu-calculus by representing arithmetric expressions and real-valued functions rather than formulas and relations. Moreover, we give an algorithm for computing the MTBDD-representation of the semantics for the expressions and terms and show how several problems (such as graph theoretic problems or veri cation problems) can be embedded into the algebraic mu-calculus (and hence, can be solved using our MTBDD-based method).", "num_citations": "18\n", "authors": ["1617"]}
{"title": "Are Good-for-Games Automata Good for Probabilistic Model Checking?\n", "abstract": " The potential double exponential blow-up for the generation of deterministic ω-automata for linear temporal logic formulas motivates research on weaker forms of determinism. One of these notions is the good-for-games property that has been introduced by Henzinger and Piterman together with an algorithm for generating good-for-games automata from nondeterministic Büchi automata. The contribution of our paper is twofold. First, we report on an implementation of this algorithms and exhaustive experiments. Second, we show how good-for-games automata can be used for the quantitative analysis of systems modeled by Markov decision processes against ω-regular specifications and evaluate this new method by a series of experiments.", "num_citations": "17\n", "authors": ["1617"]}
{"title": "Maximizing the conditional expected reward for reaching the goal\n", "abstract": " The paper addresses the problem of computing maximal conditional expected accumulated rewards until reaching a target state (briefly called maximal conditional expectations) in finite-state Markov decision processes where the condition is given as a reachability constraint. Conditional expectations of this type can, e.g., stand for the maximal expected termination time of probabilistic programs with non-determinism, under the condition that the program eventually terminates, or for the worst-case expected penalty to be paid, assuming that at least three deadlines are missed. The main results of the paper are (i) a polynomial-time algorithm to check the finiteness of maximal conditional expectations, (ii) PSPACE-completeness for the threshold problem in acyclic Markov decision processes where the task is to check whether the maximal conditional expectation exceeds a given threshold, (iii) a pseudo …", "num_citations": "16\n", "authors": ["1617"]}
{"title": "Synthesis of Reo connectors for strategies and controllers\n", "abstract": " In controller synthesis, ie, the question whether there is a controller or strategy to achieve some objective in a given system, the controller is often realized as some kind of automaton. In the context of the exogenous coordination language Reo, where the coordination glue code between the components is realized as a network of channels, it is desirable for such synthesized controllers to also take the form of a Reo connector built from a repertoire of basic channels. In this paper, we address the automatic construction of such Reo connectors directly from a constraint automaton representation.", "num_citations": "14\n", "authors": ["1617"]}
{"title": "Recurrence and transience for probabilistic automata\n", "abstract": " In a context of -regular specifications for infinite execution sequences, the classical B\\\" uchi condition, or repeated liveness condition, asks that an accepting state is visited infinitely often. In this paper, we show that in a probabilistic context it is relevant to strengthen this infinitely often condition. An execution path is now accepting if the\\emph {proportion} of time spent on an accepting state does not go to zero as the length of the path goes to infinity. We introduce associated notions of recurrence and transience for non-homogeneous finite Markov chains and study the computational complexity of the associated problems. As Probabilistic B\\\" uchi Automata (PBA) have been an attempt to generalize B\\\" uchi automata to a probabilistic context, we define a class of Constrained Probabilistic Automata with our new accepting condition on runs. The accepted language is defined by the requirement that the measure of the set of accepting runs is positive (probable semantics) or equals 1 (almost-sure semantics). In contrast to the PBA case, we prove that the emptiness problem for the language of a constrained probabilistic B\\\" uchi automaton with the probable semantics is decidable.", "num_citations": "14\n", "authors": ["1617"]}
{"title": "Stochastic shortest paths and weight-bounded properties in Markov decision processes\n", "abstract": " The paper deals with finite-state Markov decision processes (MDPs) with integer weights assigned to each state-action pair. New algorithms are presented to classify end components according to their limiting behavior with respect to the accumulated weights. These algorithms are used to provide solutions for two types of fundamental problems for integer-weighted MDPs. First, a polynomial-time algorithm for the classical stochastic shortest path problem is presented, generalizing known results for special classes of weighted MDPs. Second, qualitative probability constraints for weight-bounded (repeated) reachability conditions are addressed. Among others, it is shown that the problem to decide whether a disjunction of weight-bounded reachability conditions holds almost surely under some scheduler belongs to NP∩ coNP, is solvable in pseudo-polynomial time and is at least as hard as solving two-player mean …", "num_citations": "13\n", "authors": ["1617"]}
{"title": "The connection between initial and unique solutions of domain equations in the partial order and metric approach\n", "abstract": " The purpose of this paper is twofold: First, we show in which way the initial solution of a domain equation for cpo's and the unique solution of a corresponding domain equation for metric spaces are related. Second, we present a technique to lift a given domain equation for cpo's to a corresponding domain equation for metric spaces.", "num_citations": "13\n", "authors": ["1617"]}
{"title": "Metric completion versus ideal completion\n", "abstract": " Complete partial orders have been used for a long time for defining semantics of programming languages. In the context of concurrency de Bakker and Zucker (1982) proposed a metric setting for handling concurrency, recursion and nontermination, which has proved to be very successful in many applications. Starting with a semantic domain D for ‘finite behaviour’ we investigate the relation between the ideal completion Idl(D) and the metric completion which are both suitable to model recursion and infinite behaviour. We also consider the properties of semantic operators.", "num_citations": "13\n", "authors": ["1617"]}
{"title": "Trace semantics for stochastic systems with nondeterminism\n", "abstract": " This paper discusses trace semantics of interactive Markov chains (IMCs) that are a generalisation of continuous-time Markov chains. In IMCs besides probabilistic alternatives there may be a nondeterministic choice between several action-labelled transitions in a state. We analyse several variants of trace equivalences that arise from the different ways one has to resolve nondeterministic branching. Button pushing testing scenarios are used to motivate each abstraction level induced by the trace semantics and associated equivalences are sorted according to their distinguishing power.", "num_citations": "12\n", "authors": ["1617"]}
{"title": "On topological hierarchies of temporal properties\n", "abstract": " The classification of properties of concurrent programs into safety and liveness was first proposed by Lamport [22]. Since then several characterizations of hierarchies of properties have been given, see eg [3, 20, 9, 21]; this includes syntactic characterizations (in terms classes of formulas of logics such as the linear temporal logic) as well as extensional (as sets of computations in some abstract domain). The latter often admits a topological characterization with respect to the natural topologies of the domain of computations. We introduce a general notion of a linear time model of computation which consists of partial and completed computations satisfying certain axioms. The model is endowed with a natural topology. We show that the usual topologies on strings, Mazurkiewicz traces and pomsets arise as special cases. We then introduce a hierarchy of properties including safety, liveness, guarantee, response and …", "num_citations": "12\n", "authors": ["1617"]}
{"title": "On the semantic foundations of Probabilistic VERUS\n", "abstract": " In this paper we explain the semantic foundations of the tool Probabilistic VERUS Har98]. A Probabilistic VERUS program P consists of sequential randomized processes S1;:::; Sk that are executed in parallel and that communicate via shared variables.First we give an operational semantics for the sequential components on the basis of a transition relation de ned in the classical SOS-style a la Plotkin Plo81] which we use to specify the behaviour of the P by a Markov chain whose transitions stand for the cumulative e ect of the activities of the components S1;::: Sk within one time step. Second, we provide a denotational semantics for P that is based on a (denotational) least xed point semantics for the sequential components which formalizes the input/output behaviour of the sequential components within one time step. While the operational (declarative) semantics might be the one that a designer (who provides the input for the tool) has in mind the denotational (procedural) semantics is the one that the compiler of Probabilistic VERUS uses. We establish a consistency result stating that the Markov chains induced by the operational and denotational semantics are bisimilar in the sense of LS91].", "num_citations": "12\n", "authors": ["1617"]}
{"title": "Ratio and weight quantiles\n", "abstract": " Several types of weighted-automata models and formalisms to specify and verify constraints on accumulated weights have been studied in the past. The lack of monotonicity for weight functions with positive and negative values as well as for ratios of the accumulated values of non-negative weight functions renders many verification problems to be undecidable or computationally hard. Our contribution comprises polynomial-time algorithms for computing ratio and weight quantiles in Markov chains, which provide optimal bounds guaranteed almost surely or with positive probability on, e.g., cost-utility ratios or the energy conversion efficiency.", "num_citations": "10\n", "authors": ["1617"]}
{"title": "A probabilistic quantitative analysis of probabilistic-write/copy-select\n", "abstract": " Probabilistic-Write/Copy-Select (PWCS) is a novel synchronization scheme suggested by Nicholas Mc Guire which avoids expensive atomic operations for synchronizing access to shared objects. Instead, PWCS makes inconsistencies detectable and recoverable. It builds on the assumption that, for typical workloads, the probability for data races is very small. Mc Guire describes PWCS for multiple readers but only one writer of a shared data structure. In this paper, we report on the formal analysis of the PWCS protocol using a continuous-time Markov chain model and probabilistic model checking techniques. Besides the original PWCS protocol, we also considered a variant with multiple writers. The results were obtained by the model checker PRISM and served to identify scenarios in which the use of the PWCS protocol is justified by guarantees on the probability of data races. Moreover, the analysis …", "num_citations": "10\n", "authors": ["1617"]}
{"title": "How to interpret and establish consistency results for semantics of concurrent programming languages\n", "abstract": " It is meaningful that a language is provided with several semantic descriptions: eg one which serves the needs of the implementor, another one that is suitable for specification and yet another one that will be used to explain the language to the user. In this case one has to guarantee that the various semantics are ‘consistent’. The attempt of this paper is to clarify the notion ‘consistency’and to present a general framework and theorems for consistency results.", "num_citations": "10\n", "authors": ["1617"]}
{"title": "Composition of stochastic transition systems based on spans and couplings\n", "abstract": " Conventional approaches for parallel composition of stochastic systems relate probability measures of the individual components in terms of product measures. Such approaches rely on the assumption that components interact stochastically independent, which might be too rigid for modeling real world systems. In this paper, we introduce a parallel-composition operator for stochastic transition systems that is based on couplings of probability measures and does not impose any stochastic assumptions. When composing systems within our framework, the intended dependencies between components can be determined by providing so-called spans and span couplings. We present a congruence result for our operator with respect to a standard notion of bisimilarity and develop a general theory for spans, exploiting deep results from descriptive set theory. As an application of our general approach, we propose a model for stochastic hybrid systems called stochastic hybrid motion automata.", "num_citations": "9\n", "authors": ["1617"]}
{"title": "Static partial order reduction for probabilistic concurrent systems\n", "abstract": " Sound criteria for partial order reduction for probabilistic concurrent systems have been presented in the literature. Their realization relies on a depth-first search-based approach for generating the reduced model. The drawback of this dynamic approach is that it can hardly be combined with other techniques to tackle the state explosion problem, e.g., symbolic probabilistic model checking with multi-terminal variants of binary decision diagrams. Following the approach presented by Kurshan et al. for non-probabilistic systems, we study partial order reduction techniques for probabilistic concurrent systems that can be realized by a static analysis. The idea is to inject the reduction criteria into the control flow graphs of the processes of the system to be analyzed. We provide the theoretical foundations of static partial order reduction for probabilistic concurrent systems and present algorithms to realize them. Finally, we …", "num_citations": "9\n", "authors": ["1617"]}
{"title": "Model checking with formula-dependent abstract models\n", "abstract": " We present a model checking algorithm for ∀CTL (and full CTL) which uses an iterative abstraction refinement strategy.               It terminates at least for all transition systems M that have a finite simulation or bisimulation quotient. In contrast to other abstraction refinement algorithms, we always work with abstract models whose sizes depend only on the length of the formula θ (but not on the size of the system, which might be infinite).", "num_citations": "9\n", "authors": ["1617"]}
{"title": "Towards automated configuration of systems with non-functional constraints\n", "abstract": " The paper reports on first steps towards a systematic design process that ensures quantitative stochastic requirements like requirements on the expected energy consumption or resilience requirements by construction. The idea is to automatically extract a formal model from a configurable system and to use formal analysis techniques to automatically determine a configuration such that the system meets the quantitative requirements. As a proof of concept we present a tool that supports the automated synthesis of protocol parameters for IPC (interprocess communication). The tool takes as input a Lua script describing the communication structure of several processes. This script is annotated with quantitative information such as error probabilities and timing information. The output is a Markov chain specified in the input language of the prominent probabilistic model checker PRISM. This Markov chain yields the basis …", "num_citations": "8\n", "authors": ["1617"]}
{"title": "The orchestration stack: the impossible task of designing software for unknown future post-CMOS hardware\n", "abstract": " [en] Future systems based on post-CMOS technologies will be wildly heterogeneous, with properties largely unknown today.This paper presents our design of a new hardware/software stack to address the challenge of preparing software development for such systems. It combines well-understood technologies from different areas, eg, network-on-chips, capability operating systems, flexible programming models and model checking. We describe our approach and provide details on key technologies.", "num_citations": "8\n", "authors": ["1617"]}
{"title": "Modeling role-based systems with exogenous coordination\n", "abstract": " The concept of roles is a promising approach to cope with context dependency and adaptivity of modern software systems. While roles have been investigated in conceptual modeling, programming languages and multi-agent systems, they have been given little consideration within component-based systems.                 In this paper, we propose a hierarchical role-based approach for modeling relationships and collaborations between components. In particular, we consider the channel-based, exogenous coordination language Reo and discuss possible realizations of roles and related concepts. The static requirements on the binding of roles are modeled by rule sets expressed in many-sorted second-order logic and annotations on the Reo networks for role binding, context and collaborations, while Reo connectors are used to model the coordination of runtime role playing. The ideas presented in this …", "num_citations": "8\n", "authors": ["1617"]}
{"title": "Partially-shared zero-suppressed multi-terminal BDDs: concept, algorithms and applications\n", "abstract": " Multi-Terminal Binary Decision Diagrams (MTBDDs) are a well accepted technique for the state graph (SG) based quantitative analysis of large and complex systems specified by means of high-level model description techniques. However, this type of Decision Diagram (DD) is not always the best choice, since finite functions with small satisfaction sets, and where the fulfilling assignments possess many 0-assigned positions, may yield relatively large MTBDD based representations. Therefore, this article introduces zero-suppressed MTBDDs and proves that they are canonical representations of multi-valued functions on finite input sets. For manipulating DDs of this new type, possibly defined over different sets of function variables, the concept of partially-shared                         zero-suppressed MTBDDs and respective algorithms are developed. The efficiency of this new approach is demonstrated by …", "num_citations": "8\n", "authors": ["1617"]}
{"title": "Mean-payoff optimization in continuous-time Markov chains with parametric alarms\n", "abstract": " Continuous-time Markov chains with alarms (ACTMCs) allow for alarm events that can be non-exponentially distributed. Within parametric ACTMCs, the parameters of alarm-event distributions are not given explicitly and can be subject of parameter synthesis. An algorithm solving the -optimal parameter synthesis problem for parametric ACTMCs with long-run average optimization objectives is presented. Our approach is based on reduction of the problem to finding long-run average optimal strategies in semi-Markov decision processes (semi-MDPs) and sufficient discretization of parameter (i.e., action) space. Since the set of actions in the discretized semi-MDP can be very large, a straightforward approach based on explicit action-space construction fails to solve even simple instances of the problem. The presented algorithm uses an enhanced policy iteration on symbolic representations of the action …", "num_citations": "7\n", "authors": ["1617"]}
{"title": "Farkas certificates and minimal witnesses for probabilistic reachability constraints\n", "abstract": " This paper introduces Farkas certificates for lower and upper bounds on minimal and maximal reachability probabilities in Markov decision processes (MDP), which we derive using an MDP-variant of Farkas' Lemma. The set of all such certificates is shown to form a polytope whose points correspond to witnessing subsystems of the model and the property. Using this correspondence we can translate the problem of finding minimal witnesses to the problem of finding vertices with a maximal number of zeros. While computing such vertices is computationally hard in general, we derive new heuristics from our formulations that exhibit competitive performance compared to state-of-the-art techniques. As an argument that asymptotically better algorithms cannot be hoped for, we show that the decision version of finding minimal witnesses is NP-complete even for acyclic Markov chains.", "num_citations": "7\n", "authors": ["1617"]}
{"title": "Energy-utility analysis of probabilistic systems with exogenous coordination\n", "abstract": " We present an extension of the popular probabilistic model checker  with multi-actions that enables the modeling of complex coordination between stochastic components in an exogenous manner. This is supported by tooling that allows the use of the exogenous coordination language  for specifying the coordination glue code. The tool provides an automatic compilation feature for translating a  network of channels into ’s guarded command language. Additionally, the tool supports the translation of reward monitoring components that can be attached to the  network to assign rewards or cost to activity within the coordination network. The semantics of the translated model is then based on weighted Markov decision processes that yield the basis, e.g., for a quantitative analysis using . Feasibility of the approach is shown by a quantitative analysis of an energy-aware network system …", "num_citations": "7\n", "authors": ["1617"]}
{"title": "Symbolic verification of communicating systems with probabilistic message losses: liveness and fairness\n", "abstract": " NPLCS’s are a new model for nondeterministic channel systems where unreliable communication is modeled by probabilistic message losses. We show that, for ω-regular linear-time properties and finite-memory schedulers, qualitative model-checking is decidable. The techniques extend smoothly to questions where fairness restrictions are imposed on the schedulers. The symbolic procedure underlying our decidability proofs has been implemented and used to study a simple protocol handling two-way transfers in an unreliable setting.", "num_citations": "6\n", "authors": ["1617"]}
{"title": "On Skolem-hardness and saturation points in Markov decision processes\n", "abstract": " The Skolem problem and the related Positivity problem for linear recurrence sequences are outstanding number-theoretic problems whose decidability has been open for many decades. In this paper, the inherent mathematical difficulty of a series of optimization problems on Markov decision processes (MDPs) is shown by a reduction from the Positivity problem to the associated decision problems which establishes that the problems are also at least as hard as the Skolem problem as an immediate consequence. The optimization problems under consideration are two non-classical variants of the stochastic shortest path problem (SSPP) in terms of expected partial or conditional accumulated weights, the optimization of the conditional value-at-risk for accumulated weights, and two problems addressing the long-run satisfaction of path properties, namely the optimization of long-run probabilities of regular co-safety properties and the model-checking problem of the logic frequency-LTL. To prove the Positivity- and hence Skolem-hardness for the latter two problems, a new auxiliary path measure, called weighted long-run frequency, is introduced and the Positivity-hardness of the corresponding decision problem is shown as an intermediate step. For the partial and conditional SSPP on MDPs with non-negative weights and for the optimization of long-run probabilities of constrained reachability properties (a U b), solutions are known that rely on the identification of a bound on the accumulated weight or the number of consecutive visits to certain sates, called a saturation point, from which on optimal schedulers behave memorylessly. In this paper, it is …", "num_citations": "5\n", "authors": ["1617"]}
{"title": "Generic emptiness check for fun and profit\n", "abstract": " We present a new algorithm for checking the emptiness of -automata with an Emerson-Lei acceptance condition (i.e., a positive Boolean formula over sets of states or transitions that must be visited infinitely or finitely often). The algorithm can also solve the model checking problem of probabilistic positiveness of MDP under a property given as a deterministic Emerson-Lei automaton. Although both these problems are known to be NP-complete and our algorithm is exponential in general, it runs in polynomial time for simpler acceptance conditions like generalized Rabin, Streett, or parity. In fact, the algorithm provides a unifying view on emptiness checks for these simpler automata classes. We have implemented the algorithm in Spot and PRISM and our experiments show improved performance over previous solutions.", "num_citations": "5\n", "authors": ["1617"]}
{"title": "From verification to synthesis under cost-utility constraints\n", "abstract": " Various algorithms and tools for the formal verification of systems with respect to their quantitative behavior have been developed in the past decades. Many of these techniques inherently support the automated synthesis of strategies that guarantee the satisfaction of performance or reliability constraints by resolving controllable nondeterministic choices in an adequate way. More recently, such techniques have been further developed towards the analysis or strategy synthesis under multiple cost and utility constraints. This article deals with Markov decision processes (MDPs) for modeling systems and their environment and provides an overview of recent directions for different types of synthesis problems in MDPs that aim to achieve an acceptable cost-utility tradeoff.", "num_citations": "5\n", "authors": ["1617"]}
{"title": "Formal parameter synthesis for energy-utility-optimal fault tolerance\n", "abstract": " Fault-tolerance techniques are widely used to improve the resiliency of hardware/software systems. An important step for the deployment of such techniques in a concrete setting is to find reasonable configurations balancing the tradeoff between resiliency and energy. The paper reports on a case study where we employ probabilistic model checking to synthesize values for tunable system parameters of a redo-based fault-tolerance mechanism. We consider discrete parameters of a finite range (as the number of redos) as well as continuous parameters to encode the error detection rates of the underlying control- and data-flow checkers. To tackle the state-explosion problem, we exploit structural properties of redo-based protocols. The parameter synthesis approach combines probabilistic model checking for Markov chains with parametric transition probabilities and reward values and computer-algebra …", "num_citations": "5\n", "authors": ["1617"]}
{"title": "Bisimulations, logics, and trace distributions for stochastic systems with rewards\n", "abstract": " Stochastic systems with rewards yield a generic stochastic model where both the state and the action space might be uncountable and where every action is decorated by a real-valued reward. For every deterministic stochastic system with rewards we prove that the bisimulation relation and the trace-distribution relation collapse. As a second result, we also establish a characterisation of the bisimulation relation in terms of an expressive action-based probabilistic logic and show that this characterisation is still maintained by a small fragment of this logic.", "num_citations": "5\n", "authors": ["1617"]}
{"title": "Synthesis of optimal resilient control strategies\n", "abstract": " Repair mechanisms are important within resilient systems to maintain the system in an operational state after an error occurred. Usually, constraints on the repair mechanisms are imposed, e.g., concerning the time or resources required (such as energy consumption or other kinds of costs). For systems modeled by Markov decision processes (MDPs), we introduce the concept of resilient schedulers, which represent control strategies guaranteeing that these constraints are always met within some given probability. Assigning rewards to the operational states of the system, we then aim towards resilient schedulers which maximize the long-run average reward, i.e., the expected mean payoff. We present a pseudo-polynomial algorithm that decides whether a resilient scheduler exists and if so, yields an optimal resilient scheduler. We show also that already the decision problem asking whether there exists a …", "num_citations": "5\n", "authors": ["1617"]}
{"title": "Computing conditional probabilities: Implementation and evaluation\n", "abstract": " Conditional probabilities and expectations are an important concept in the quantitative analysis of stochastic systems, e.g., to analyze the impact and cost of error handling mechanisms in rare failure scenarios or for a utility-analysis assuming an exceptional shortage of resources. This paper reports on the main features of an implementation of computation schemes for conditional probabilities in discrete-time Markov chains and Markov decision processes within the probabilistic model checker Prism and a comparative experimental evaluation. Our implementation has full support for computing conditional probabilities where both the objective and condition are given as linear temporal logic formulas, as well as specialized algorithms for reachability and other simple types of path properties. In the case of Markov chains we provide implementations for three alternative methods (quotient, scale and reset). We …", "num_citations": "5\n", "authors": ["1617"]}
{"title": "Reduction methods on probabilistic control-flow programs for reliability analysis\n", "abstract": " Modern safety-critical systems are heterogeneous, complex, and highly dynamic. They require reliability evaluation methods that go beyond the classical static methods such as fault trees, event trees, or reliability block diagrams. Promising dynamic reliability analysis methods employ probabilistic model checking on various probabilistic state-based models. However, such methods have to tackle the well-known state-space explosion problem. To compete with this problem, reduction methods such as symmetry reduction and partial-order reduction have been successfully applied to probabilistic models by means of discrete Markov chains or Markov decision processes. Such models are usually specified using probabilistic programs provided in guarded command language. In this paper, we propose two automated reduction methods for probabilistic programs that operate on a purely syntactic level: reset value optimization and register allocation optimization. The presented techniques rely on concepts well known from compiler construction such as live range analysis and register allocation through interference graph coloring. Applied on a redundancy system model for an aircraft velocity control loop modeled in SIMULINK, we show effectiveness of our implementation of the reduction methods. We demonstrate that model-size reductions in three orders of magnitude are possible and show that we can achieve significant speedups for a reliability analysis.", "num_citations": "4\n", "authors": ["1617"]}
{"title": "Breaking the limits of redundancy systems analysis\n", "abstract": " Redundancy mechanisms such as triple modular redundancy protect safety-critical components by replication and thus improve systems fault tolerance. However, the gained fault tolerance comes along with costs to be invested, e.g., increasing execution time, energy consumption, or packaging size, for which constraints have to be obeyed during system design. This turns the question of finding suitable combinations of components to be protected into a challenging task as the number of possible protection combinations grows exponentially in the number of components. We propose family-based approaches to tackle the combinatorial blowup in redundancy systems modeling and analysis phases. Based on systems designed in SIMULINK we show how to obtain models that include all possible protection combinations and present a tool chain that, given a probabilistic error model, generates discrete Markov chain families. Using symbolic techniques that enable concise family representation and analysis, we show how SIMULINK models of realistic size can be protected and analyzed with a single family-based analysis run while a one-by-one analysis of each protection combination would clearly exceed any realistic time constraints.", "num_citations": "4\n", "authors": ["1617"]}
{"title": "Greener bits: Formal analysis of demand response\n", "abstract": " Demand response is a promising approach to deal with the emerging power generation fluctuations introduced by the increasing amount of renewable energy sources fed into the grid. Consumers need to be able to adapt their energy consumption with respect to the given demand pattern and at the same time ensure that their adaptation (i.e., response) does not interfere with their various operational objectives. Finding, evaluating and verifying adaptation strategies which aim to be optimal w.r.t. multiple criteria is a challenging task and is currently mainly addressed by hand, heuristics or guided simulation. In this paper we carry out a case study of a demand response system with an energy adaptive data center on the consumer side for which we propose a formal model and perform a quantitative system analysis using probabilistic model checking. Our first contribution is a fine-grained formal model and …", "num_citations": "4\n", "authors": ["1617"]}
{"title": "Model checking probabilistic systems against pushdown specifications\n", "abstract": " Model checking is a fully automatic verification technique traditionally used to verify finite-state systems against regular specifications. Although regular specifications have been proven to be feasible in practice, many desirable specifications are non-regular. For instance, requirements which involve counting cannot be formalized by regular specifications but using pushdown specifications, i.e., context-free properties represented by pushdown automata. Research on model-checking techniques for pushdown specifications is, however, rare and limited to the verification of non-probabilistic systems.In this paper, we address the probabilistic model-checking problem for systems modeled by discrete-time Markov chains and specifications that are provided by deterministic pushdown automata over infinite words. We first consider finite-state Markov chains and show that the quantitative and qualitative model-checking …", "num_citations": "4\n", "authors": ["1617"]}
{"title": "Denotational linear time semantics and sequential composition\n", "abstract": " This paper focuses on the issue of modelling sequential composition in denotational linear time semantics for (nondeterministic) languages which admit infinite computations. This operator deserves special attention as it causes problems to meet the requirements of a standard denotational semantics based on metric spaces or cpo's. We present a general framework for the treatment of sequential composition.", "num_citations": "4\n", "authors": ["1617"]}
{"title": "Construction of a cms on a given cpo\n", "abstract": " In dealing with denotational semantics of programming languages partial orders resp. metric spaces have been used with great benefit in order to provide a meaning to recursive and repetitive constructs. This paper presents two methods to define a metric on a subset M of a cpo D such that M is a complete metric spaces and the metric semantics on M coincides with the cpo semantics on D when the same semantic operators are used. The first method is to add a'length'on a cpo which means a function &# 961;: D &# 8594; IN 0 ∪{&# 8734;} of increasing power. The second is based on the ideas of [9] and uses pseudo rank orderings, ie monotone sequences of monotone functions ϖ n: D &# 8594; D. We show that SFP domains can be characterized as special kinds of rank orderded cpo's. We also discuss the connection between the Lawson topology and the topology induced by the metric.", "num_citations": "4\n", "authors": ["1617"]}
{"title": "From features to roles\n", "abstract": " The detection of interactions is a challenging task present in almost all stages of software development. In feature-oriented system design, this task is mainly investigated for interactions of features within a single system, detected by their emergent behaviors. We propose a formalism to describe interactions in hierarchies of feature-oriented systems (hierarchical interactions) and the actual situations where features interact (active interplays). Based on the observation that such interactions are also crucial in role-based systems, we introduce a compositional modeling framework based on concepts and notions of roles, comprising role-based automata (RBAs). To describe RBAs, we present a modeling language that is close to the input language of the probabilistic model checker Prism. To exemplify the use of RBAs, we implemented a tool that translates RBA models into Prism and thus enables the formal analysis of …", "num_citations": "3\n", "authors": ["1617"]}
{"title": "Quantitative Characterization of Reconfigurable Transistor Logic Gates\n", "abstract": " We present a new approach for early analysis of logic gates that is based on formal methods. As device technology research takes years and is very expensive, it is desirable to evaluate a technology’s potential as early as possible, which is hard to do with current techniques. The actual impact of new devices on circuit design and their performance in complex circuits, are difficult to predict using simulation-based techniques. We propose a new approach that supplements simulation-based analysis and enables the development of standard cells alongside ongoing fundamental device research. Thereby, it potentially shortens the development cycle and time to market of a new technology. We develop a new discrete charge-transport model for electrical networks and a new flexible model of polarity-reconfigurable transistors as our formal basis. These models make circuit designs accessible to an analysis using …", "num_citations": "3\n", "authors": ["1617"]}
{"title": "Partial and conditional expectations in Markov decision processes with integer weights\n", "abstract": " The paper addresses two variants of the stochastic shortest path problem ('optimize the accumulated weight until reaching a goal state') in Markov decision processes (MDPs) with integer weights. The first variant optimizes partial expected accumulated weights, where paths not leading to a goal state are assigned weight 0, while the second variant considers conditional expected accumulated weights, where the probability mass is redistributed to paths reaching the goal. Both variants constitute useful approaches to the analysis of systems without guarantees on the occurrence of an event of interest (reaching a goal state), but have only been studied in structures with non-negative weights. Our main results are as follows. There are polynomial-time algorithms to check the finiteness of the supremum of the partial or conditional expectations in MDPs with arbitrary integer weights. If finite, then optimal weight-based deterministic schedulers exist. In contrast to the setting of non-negative weights, optimal schedulers can need infinite memory and their value can be irrational. However, the optimal value can be approximated up to an absolute error of  in time exponential in the size of the MDP and polynomial in .", "num_citations": "3\n", "authors": ["1617"]}
{"title": "Trees and semantics\n", "abstract": " Several types of trees are proposed in the literature to model the behaviour of nondeterministic processes. The purpose of this paper is to clarify the distinction between the various types of trees and to discuss their use as semantic domains. Trees (in the sense of Milner's derivation trees) and bisimulation equivalence classes of trees are considered in three different settings: in the category of sets, in the metric setting and in the partial order setting. Each type of tree is characterized by a domain equation. Special attention is given to the use of trees as models for processes which allow for unbounded nondeterminism as for instance Milners CCS processes. In this case one has to deal with infinitely branching trees which cause problems to give denotational semantics that are fully abstract w.r.t. a transition system based operational semantics.", "num_citations": "3\n", "authors": ["1617"]}
{"title": "Minimal witnesses for probabilistic timed automata\n", "abstract": " Witnessing subsystems have proven to be a useful concept in the analysis of probabilistic systems, for example as diagnostic information on why a given property holds or as input to refinement algorithms. This paper introduces witnessing subsystems for reachability problems in probabilistic timed automata (PTA). Using a new operation on difference bounds matrices, it is shown how Farkas certificates of finite-state bisimulation quotients of a PTA can be translated into witnessing subsystems. We present algorithms for the computation of minimal witnessing subsystems under three notions of minimality, which capture the timed behavior from different perspectives, and discuss their complexity.", "num_citations": "2\n", "authors": ["1617"]}
{"title": "SWITSS: Computing Small Witnessing Subsystems\n", "abstract": " Witnessing subsystems for probabilistic reachability thresholds in discrete Markovian models are an important concept both as diagnostic information on why a property holds, and as input to refinement algorithms. We present SWITSS, a tool for the computation of Small WITnessing SubSystems. SWITSS implements exact and heuristic approaches based on reducing the problem to (mixed integer) linear programming. Returned subsystems can automatically be rendered graphically and are accompanied with a certificate which proves that the subsystem is indeed a witness.", "num_citations": "2\n", "authors": ["1617"]}
{"title": "Performance evaluation of thermal-constrained scheduling strategies in multi-core systems\n", "abstract": " The increasing usage of multi-cores in safety-critical applications, such as autonomous control, demands high levels of reliability, which crucially depends on the temperature. On the other hand, there is a natural trade-off between reliability and performance. The scheduling of tasks is one of the key factors which determine the resulting system performance as well as reliability. Commonly used techniques, such as simulation based on benchmarks, can simulate only a limited number of input sequences of system runs and hardly optimize the performancereliability trade-off. In order to accurately evaluate the schedulers and provide formal guarantees suitable in early design stages, we use formal methods for a quantitative performance-reliability trade-off analysis. Specifically, we propose to use energy-utility quantiles as a metric to evaluate the effectiveness of a given scheduler. For illustration, we evaluate TAPE, a state-of-the-art thermal-constrained scheduler, with theoretical optimal ones.", "num_citations": "2\n", "authors": ["1617"]}
{"title": "From LTL to unambiguous Büchi automata via disambiguation of alternating automata\n", "abstract": " This paper proposes a new algorithm for the generation of unambiguous Büchi automata (UBA) from LTL formulas. Unlike existing tableau-based LTL-to-UBA translations, our algorithm deals with very weak alternating automata (VWAA) as an intermediate representation. It relies on a new notion of unambiguity for VWAA and a disambiguation procedure for VWAA. We introduce optimizations on the VWAA level and new LTL simplifications targeted at generating small UBA. We report on an implementation of the construction in our tool Duggi and discuss experimental results that compare the automata sizes and computation times of Duggi with the tableau-based LTL-to-UBA translation of the SPOT tool set. Our experiments also cover the analysis of Markov chains under LTL specifications, which is an important application of UBA.", "num_citations": "2\n", "authors": ["1617"]}
{"title": "Long-run satisfaction of path properties\n", "abstract": " The paper introduces the concepts of long-run frequency of path properties for paths in Kripke structures, and their generalization to long-run probabilities for schedulers in Markov decision processes. We then study the natural optimization problem of computing the optimal values of these measures, when ranging over all paths or all schedulers, and the corresponding decision problem when given a threshold. The main results are as follows. For (repeated) reachability and other simple properties, optimal long-run probabilities and corresponding optimal memoryless schedulers are computable in polynomial time. When it comes to constrained reachability properties, memoryless schedulers are no longer sufficient, even in the non-probabilistic setting. Nevertheless, optimal long-run probabilities for constrained reachability are computable in pseudo-polynomial time in the probabilistic setting and in polynomial time …", "num_citations": "2\n", "authors": ["1617"]}
{"title": "Towards automated variant selection for heterogeneous tiled architectures\n", "abstract": " Heterogeneous hardware/software systems that include many components with different characteristics offer great potential for high performance and energy-efficient computing. To exploit this potential, adaptive allocation and scheduling algorithms are needed for selecting software variants and mapping them to processing elements that attempt to achieve a good balance between resource-awareness and performance. The evaluation is typically carried out using simulation techniques. However, the space spanned by the possible combinations of hardware/software variants and management strategies is huge, which makes it nearly impossible to find an optimum using simulation-based methods. The purpose of the paper is to illustrate the general feasibility of an alternative approach using probabilistic model checking for families of systems that are obtained by varying, e.g., the hardware-software …", "num_citations": "2\n", "authors": ["1617"]}
{"title": "Preface to the special issue on probabilistic model checking\n", "abstract": " As guest editors, we are delighted to introduce this special issue devoted to Probabilistic Model Checking to the wider readership. Probabilistic modelling dates back to the work of Markov in early 1900s, and over the years has established itself as a fundamental methodology in science and technology, with numerous applications across several domains. Markovian models feature in probabilistic programming; wireless communication, anonymity and security protocols; performance, reliability and dependability analysis; robotics and planning; scheduling and optimisation; predictive modelling of biological systems; population models of epidemic spread; and techniques such as page ranking of search engines. Probabilistic model checking aims to achieve automated analysis of probabilistic models against specifications given in temporal logic, and involves an intricate combination of conventional model checking …", "num_citations": "2\n", "authors": ["1617"]}
{"title": "Causality-Based Game Solving\n", "abstract": " We present a causality-based algorithm for solving two-player reachability games represented by logical constraints. These games are a useful formalism to model a wide array of problems arising, e.g., in program synthesis. Our technique for solving these games is based on the notion of subgoals, which are slices of the game that the reachability player necessarily needs to pass through in order to reach the goal. We use Craig interpolation to identify these necessary sets of moves and recursively slice the game along these subgoals. Our approach allows us to infer winning strategies that are structured along the subgoals. If the game is won by the reachability player, this is a strategy that progresses through the subgoals towards the final goal; if the game is won by the safety player, it is a permissive strategy that completely avoids a single subgoal. We evaluate our prototype implementation on a range of different games. On multiple benchmark families, our prototype scales dramatically better than previously available tools.", "num_citations": "1\n", "authors": ["1617"]}
{"title": "Probabilistic causes in Markov chains\n", "abstract": " The paper studies a probabilistic notion of causes in Markov chains that relies on the counterfactuality principle and the probability-raising property. This notion is motivated by the use of causes for monitoring purposes where the aim is to detect faulty or undesired behaviours before they actually occur. A cause is a set of finite executions of the system after which the probability of the effect exceeds a given threshold. We introduce multiple types of costs that capture the consumption of resources from different perspectives, and study the complexity of computing cost-minimal causes.", "num_citations": "1\n", "authors": ["1617"]}
{"title": "Responsibility and verification: Importance value in temporal logics\n", "abstract": " We aim at measuring the influence of the nondeterministic choices of a part of a system on its ability to satisfy a specification. For this purpose, we apply the concept of Shapley values to verification as a means to evaluate how important a part of a system is. The importance of a component is measured by giving its control to an adversary, alone or along with other components, and testing whether the system can still fulfill the specification. We study this idea in the framework of model-checking with various classical types of linear-time specification, and propose several ways to transpose it to branching ones. We also provide tight complexity bounds in almost every case.", "num_citations": "1\n", "authors": ["1617"]}
{"title": "Tactile computing: Essential building blocks for the Tactile Internet\n", "abstract": " In this chapter, we present essential building blocks for developing applications in the domain of the Tactile Internet. Our building blocks belong to the fields of (i) safe, secure, and scalable computing infrastructures;(i i) world capturing and modeling; and (i i i) context adaptive software and self-explanation. They cover topics, such as resource allocation and scheduling, secure machine learning, network security, privacy, world modeling, programmability, and self-explanation of software. We will report about the current state of the art, open research questions, our methodology to approach them, and expected results.", "num_citations": "1\n", "authors": ["1617"]}
{"title": "Iterative variable reordering: Taming huge system families\n", "abstract": " For the verification of systems using model-checking techniques, symbolic representations based on binary decision diagrams (BDDs) often help to tackle the well-known state-space explosion problem. Symbolic BDD-based representations have been also shown to be successful for the analysis of families of systems that arise, e.g., through configurable parameters or following the feature-oriented modeling approach. The state space of such system families face an additional exponential blowup in the number of parameters or features. It is well known that the order of variables in ordered BDDs is crucial for the size of the model representation. Especially for automatically generated models from real-world systems, family models might even be not constructible due to bad variable orders. In this paper we describe a technique, called iterative variable reordering, that can enable the construction of large-scale family models. We exemplify feasibility of our approach by means of an aircraft velocity control system with redundancy mechanisms modeled in the input language of the probabilistic model checker PRISM. We show that standard reordering and dynamic reordering techniques fail to construct the family model due to memory and time constraints, respectively, while the new iterative approach succeeds to generate a symbolic family model.", "num_citations": "1\n", "authors": ["1617"]}
{"title": "Quantitative analysis of communication scenarios\n", "abstract": " Message sequence charts (MSCs) and their higher-order formalism in terms of message sequence graphs (MSGs) provide an intuitive way to describe communication scenarios. Naturally, quantitative aspects such as the probability of failure, maximal latency or the expected energy consumption play a crucial role for communication systems. In this paper, we introduce quantitative MSGs with costs or rewards and stochastic timing information in terms of rates. To perform a quantitative analysis, we propose a branching-time semantics for MSGs as possibly infinite continuous-time Markov chains (CTMCs) interpreting delayed choice on the partial-order semantics of MSGs. Whereas for locally synchronized MSGs a finite-state bisimulation quotient can be found and thus, standard algorithms for CTMCs can be applied, this is not the case in general. However, using a truncation-based approach we show how …", "num_citations": "1\n", "authors": ["1617"]}
{"title": "On model checking techniques for randomized distributed systems\n", "abstract": " The automata-based model checking approach for randomized distributed systems relies on an operational interleaving semantics of the system by means of a Markov decision process and a formalization of the desired event E by an ω-regular linear-time property, e.g., an LTL formula. The task is then to compute the greatest lower bound for the probability for E that can be guaranteed even in worst-case scenarios. Such bounds can be computed by a combination of polynomially time-bounded graph algorithm with methods for solving linear programs. In the classical approach, the “worst-case” is determined when ranging over all schedulers that decide which action to perform next. In particular, all possible interleavings and resolutions of other nondeterministic choices in the system model are taken into account. The worst-case analysis relying on this general notion of schedulers is often too pessimistic and …", "num_citations": "1\n", "authors": ["1617"]}