{"title": "Open sources: Voices from the open source revolution\n", "abstract": " Freely available source code, with contributions from thousands of programmers around the world: this is the spirit of the software revolution known as Open Source. Open Source has grabbed the computer industry's attention. Netscape has opened the source code to Mozilla; IBM supports Apache; major database vendors haved ported their products to Linux. As enterprises realize the power of the open-source development model, Open Source is becoming a viable mainstream alternative to commercial software. Now in Open Sources, leaders of Open Source come together for the first time to discuss the new vision of the software industry they have created. The essays in this volume offer insight into how the Open Source movement works, why it succeeds, and where it is going. For programmers who have labored on open-source projects, Open Sources is the new gospel: a powerful vision from the movement's spiritual leaders. For businesses integrating open-source software into their enterprise, Open Sources reveals the mysteries of how open development builds better software, and how businesses can leverage freely available software for a competitive business advantage. The contributors here have been the leaders in the open-source arena: Brian Behlendorf (Apache) Kirk McKusick (Berkeley Unix) Tim O'Reilly (Publisher, O'Reilly & Associates) Bruce Perens (Debian Project, Open Source Initiative) Tom Paquin and Jim Hamerly (mozilla. org, Netscape) Eric Raymond (Open Source Initiative) Richard Stallman (GNU, Free Software Foundation, Emacs) Michael Tiemann (Cygnus Solutions) Linus Torvalds (Linux) Paul Vixie (Bind) Larry …", "num_citations": "1089\n", "authors": ["867"]}
{"title": "Open sources 2.0: The continuing evolution\n", "abstract": " Open Sources 2.0 is a collection of insightful and thought-provoking essays from today's technology leaders that continues painting the evolutionary picture that developed in the 1999 book Open Sources: Voices from the Revolution. These essays explore open source's impact on the software industry and reveal how open source concepts are infiltrating other areas of commerce and society. The essays appeal to a broad audience: the software developer will find thoughtful reflections on practices and methodology from leading open source developers like Jeremy Allison and Ben Laurie, while the business executive will find analyses of business strategies from the likes of Sleepycat co-founder and CEO Michael Olson and Open Source Business Conference founder Matt Asay. From China, Europe, India, and Brazil we get essays that describe the developing world's efforts to join the technology forefront and use open source to take control of its high tech destiny. For anyone with a strong interest in technology trends, these essays are a must-read. The enduring significance of open source goes well beyond high technology, however. At the heart of the new paradigm is network-enabled distributed collaboration: the growing impact of this model on all forms of online collaboration is fundamentally challenging our modern notion of community. What does the future hold? Veteran open source commentators Tim O'Reilly and Doc Searls offer their perspectives, as do leading open source scholars Steven Weber and Sonali Shah. Andrew Hessel traces the migration of open source ideas from computer technology to biotechnology, and Wikipedia co …", "num_citations": "157\n", "authors": ["867"]}
{"title": "The boston consulting group hacker survey\n", "abstract": " The Boston Consulting Group Hacker Survey Page 1 The Boston Consulting Group Hacker Survey Release 0.73 In Cooperation with OSDN Karim R. Lakhani (karim@bcg.com) Bob Wolf (bob@bcg.com) Jeff Bates (hemos@slashdot.org) Chris DiBona (dibona@osdn.com) © The Boston Consulting Group, July 24, 2002 – Distributed under the GNU Free Document License v1.1 Page 2 The Boston Consulting Group O’Reilly Open Source Conference July 24 2002 Distributed under the GNU Free Document License v1.1 AGENDA Overview of key findings Who and why? • Who is BCG? • Why the Interest in the Free/Open Source Software community? • What is SourceForge.net? The study • Methodology • Data & findings Questions and implications Page 3 The Boston Consulting Group O’Reilly Open Source Conference July 24 2002 Distributed under the GNU Free Document License v1.1 OVERVIEW OF KEY FINDINGS …", "num_citations": "141\n", "authors": ["867"]}
{"title": "The GNU Operating System and the Free Software Movement. Open Sources: Voices from the Open Source Revolution. C. Dibona, S. Ockman and M. Stone. Calif\n", "abstract": " When I started working at the MIT Artificial Intelligence Lab in 1971, I became part of a software-sharing community that had existed for many years. Sharing of software was not limited to our particular community; it is as old as computers, just as sharing of recipes is as old as cooking. But we did it more than most.The AI Lab used a time-sharing operating system called ITS (the Incompatible Timesharing System) that the Labss staff hackers [1] had designed and written in assembler language for the Digital PDP-10, one of the large computers of the era. As a member of this community, an AI Lab staff system hacker, my job was to improve this system.", "num_citations": "25\n", "authors": ["867"]}
{"title": "Open source and proprietary software development\n", "abstract": " Before you go any further, throw off any notion that the proprietary developer is somehow a different person from the open source developer. It is uncommon for a member of the open source developer community to do only open source for a living. Only the most prominent, or loaded, members of the open source community come close to having this kind of freedom. It is indeed rare to find a developer who develops only with proprietary tools and libraries. Even Visual C++ and C# developers benefit from a great variety of code and libraries that are free for use in their programs. 1My career has focused on open source development for the last 10 years, and I’m constantly pleasantly surprised by how open source development and proprietary resemble each other. I believe this is because proprietary developers are educated by the adventures of their slightly crazy open source cousins, but I also know that open source developers have learned just as much from proprietary developers.", "num_citations": "22\n", "authors": ["867"]}
{"title": "OSS in India\n", "abstract": " Three earlier revolutions using collaboration have dramatically improved the basic infrastructure within the country. The first revolution was called the Green Revolution, which started in the 1970s and took India from being a grain deficit to a grain surplus country. The second revolution, in the 1980s, was the White Revolution, which used the power of dairy cooperatives to enable large-scale milk production. Not only could India’s own population be satisfied, India also became an exporter of dairy products. The third revolution, in the 1990s, was the Gray Revolution, which used India’s plethora of English-speaking engineers and scientists to capture a significant share of the world’s outsourcing business in software and pharmaceuticals.", "num_citations": "21\n", "authors": ["867"]}
{"title": "Open Sources. Voci dalla rivoluzione Open Source\n", "abstract": " “Breve storia sugli Hacker” e “La vendetta degli hacker” Copyright© 1998 di Eric S. Raymond.“La Open Source Definition” Copyright© 1998 di Bruce Perens. Questi saggi sono liberi; è possibile distribuirli e/o modificarli secondo i termini della licenza GNU General Public License come pubblicata dalla Free Software Foundation; si applica la versione 2 0 (a propria discrezione) qualsiasi versione successiva della Licenza. Tali saggi sono distribuiti nella speranza che possano risultare utili, ma SENZA", "num_citations": "12\n", "authors": ["867"]}
{"title": "Open source biology\n", "abstract": " Open source software (OSS) has played a central role in the growth of the Internet and increases in economic importance each year. It has rapidly changed the face of computing, with server side companies like Sun Microsystems, to end-user companies such as Adobe, to full platform/service companies like IBM incorporating open source into their offerings. With this success, open source is poised to diversify its influence. One experiment is open source biology (OSB), the idea that biological products such as drugs, vaccines, or pest-resistant crops, can be developed using open intellectual property (IP) models.Academic science, like open source, supports the belief that knowledge evolves best when ideas, data, and methods are freely shared, and each contributor can build on the works of others. Universities have housed and promoted scientific thought for more than 1,000 years, creating a public commons. In contrast, alchemy is the forerunner of modern business. Today, with academic research a valuable economic good, weighing the societal benefits of freeing or protecting IP is a pressing challenge. In no scientific discipline is this more important than biology, central to all living things.", "num_citations": "10\n", "authors": ["867"]}
{"title": "The hacker survey\n", "abstract": " HACKERS NOT CRACKERS!“hacker n.[originally, someone who makes furniture with an axe] 1. A person who enjoys exploring the details of programmable systems and how to stretch their capabilities, as opposed to most users, who prefer to learn only the minimum necessary. 2. One who programs enthusiastically (even obsessively) or who enjoys programming rather than just theorizing about programming. 3. A person capable of appreciating hack value. 4. A person who is good at programming quickly. 5. An expert at a particular program, or one who frequently does work using it or on it; as ina Unix hacker'.(Definitions 1 through 5 are correlated, and people who fit them congregate.) 6. An expert or enthusiast of any kind. One might be an astronomy hacker, for example. 7. One who enjoys the intellectual challenge of creatively overcoming or circumventing limitations. 8.[deprecated] A malicious meddler who tries …", "num_citations": "10\n", "authors": ["867"]}
{"title": "When China dances with OSS\n", "abstract": " One of the key challenges for China’s Information and Communication Technology (ICT) industry is to ensure that China has the right software solutions to support usage models and value requirements. The advent of open source software (OSS), along with its business model with respect to intellectual property and value proposition, brings this business force to the fast-growing software industry in China. That, in turn, will provide an opportunity for the OSS community to promote and popularize this model throughout the People’s Republic of China (PRC). This chapter analyzes how OSS has developed in China and where it is heading.", "num_citations": "9\n", "authors": ["867"]}
{"title": "A conversation with Will Harvey\n", "abstract": " In many ways online games are on the bleeding edge of software development. That puts Will Harvey, founder and executive vice president of Menlo Park-based There, right at the front of the pack. There, which just launched its product in October, is a virtual 3D world designed for online socializing.Harvey developed his first game at age 15, after teaching himself assembly language on his Apple II. He has never stopped. While earning his bachelor’s, master’s and Ph. D. in computer science from Stanford, he founded several game companies that have produced platinum and gold game titles including Zany Golf, Immortal, and Music Construction Set. He has filed five patents related to networking, graphics, and automated scheduling.", "num_citations": "7\n", "authors": ["867"]}
{"title": "OPENSOURCES\n", "abstract": " No book like this happens without the help and counsel of a number of people, so I thank my Mom, Dad, Trish, Denise, Neil, and Mickey. I’d also like to thank the folks at the Coffeenet, who have been there for me. And of course my thanks to the contributors who have wasted valuable coding time to work on this book; I appreciate it!To the people at VA Research Linux Systems, I couldn’t have hoped for a better collection of smart, dedicated people; thanks for putting up with me during the writing of this book. This book would not have happened without the continual support and dedication of Mark Stone. He is the true hero behind this book’s creation. He has said that “A book could be written about how this book was written,” which I’m sure he means in the nicest way possible. I’m sure one day he will look back and laugh at this time—right, Mark? Mark? In the initial brainstorming period for the book, a number of people contributed ideas and support that eventually led to Open Sources. These people include Paul Crowley, Paul Russell, Corey Saltiel, Edward Avis, Jeff Licquia, Jeff Knox, Becky Wood, and the guy whose site (http://slashdot. org) acted as the catalyst, Rob Malda. Thanks to all; I hope this book is everything you had wished it to be.", "num_citations": "3\n", "authors": ["867"]}
{"title": "Eof: why i don't worry about SCO, and never did\n", "abstract": " Eof: why i don't worry about SCO, and never did | Linux Journal ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Linux Journal Journal Home Forthcoming Latest Issue Archive Author List Affiliations Award Winners More HomeCollectionsHosted ContentLinux JournalVol. , No. Eof: why i don't worry about SCO, and never did article Eof: why i don't worry about SCO, and never did Share on Author: Chris DiBona View Profile Authors Info & Affiliations Publication: Linux JournalJune 2005 0citation 99 Downloads Metrics Total Citations0 Total Downloads99 Last 12 Months0 Last 6 weeks0 Get Citation Alerts New Citation Alert added! This alert has been successfully added and will be sent to: You will be notified …", "num_citations": "1\n", "authors": ["867"]}
{"title": "Eof: why open source wins\n", "abstract": " Eof: why open source wins | Linux Journal ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Linux Journal Journal Home Forthcoming Latest Issue Archive Author List Affiliations Award Winners More HomeCollectionsHosted ContentLinux JournalVol. , No. Eof: why open source wins article Eof: why open source wins Share on Author: Chris DiBona profile image Chris DiBona View Profile Authors Info & Affiliations Publication: Linux JournalMarch 2004 0citation 300 Downloads Metrics Total Citations0 Total Downloads300 Last 12 Months0 Last 6 weeks0 Get Citation Alerts New Citation Alert added! This alert has been successfully added and will be sent to: You will be notified whenever a record that you …", "num_citations": "1\n", "authors": ["867"]}