{"title": "Aesthetic layout of wiring diagrams\n", "abstract": " A wiring diagram plays an important role in electrical machine design. The layout of a wiring diagram must facilitate a designer’s understanding of the schematic as well as the real electrical machine. Even though wiring diagrams are undirected graphs, standard algorithms and libraries for graph drawing are not sufficient to achieve adequate diagrams that preserve the structure and further characteristics of the real machine. We argue that specialized algorithms are required to achieve adequate and aesthetic diagrams without compromising the characteristics of an electrical machine. In this paper, we describe a new algorithm for positioning diagram elements and a customized algorithm for connector routing for aesthetic wiring diagrams.", "num_citations": "4\n", "authors": ["1904"]}
{"title": "Establishing a User-Centered Design Process for Human-Machine Interfaces: Threats to Success\n", "abstract": " While user-centered design (UCD) processes have widely been established in domains like end-user electronics and business-to-consumer products, such processes still lack widespread adaptation for the development of industrial human-machine interfaces (HMIs). Over a period of more than two years, we have worked as part of a development team at a company from the manufacturing domain in a pilot project to introduce a UCD process. During this period, we have - via participant observation - collected a set of observed practices and behaviors that violate well-known UCD principles. Furthermore, we derived some root causes of these violations. Our insights are that introducing a UCD processes cannot be performed isolated for a single development team but impacts the entire organization including management and requires trust as well as changes with regard to mindset, methods, technologies …", "num_citations": "2\n", "authors": ["1904"]}
{"title": "The 6th Finger: Practical Challenges in the Design of a Multitouch Audio Appliance\n", "abstract": " Effective multitouch interaction does not reduce itself to a simple tracking of five fingers, there are several emerging effects that could prevent intuitive interaction in industrial appliances. This use-case describes practical challenges that were documented during the design and implementation of a holistic user interaction design in the domain of high-end audio equipments. The engineering process had to combine tangible user interface controls with state-of-the-art multitouch software fader panels in an intuitive way. This work also gives some background information about complex distributed audio routing equipment and user interaction along with technology and usability issues that appear during the design of a multitouch appliance. Several experiments were implemented in order to gain empiric data to substantiate our practical findings.", "num_citations": "1\n", "authors": ["1904"]}