{"title": "Real-time adaptive A\n", "abstract": " Characters in real-time computer games need to move smoothly and thus need to search in real time. In this paper, we describe a simple but powerful way of speeding up repeated A* searches with the same goal states, namely by updating the heuristics between A* searches. We then use this technique to develop a novel real-time heuristic search method, called Real-Time Adaptive A*, which is able to choose its local search spaces in a fine-grained way. It updates the values of all states in its local search spaces and can do so very quickly. Our experimental results for characters in real-time computer games that need to move to given goal coordinates in unknown terrain demonstrate that this property allows Real-Time Adaptive A* to follow trajectories of smaller cost for given time limits per search episode than a recently proposed real-time heuristic search method [5] that is more difficult to implement.", "num_citations": "164\n", "authors": ["1959"]}
{"title": "Modern DevOps: Optimizing software development through effective system interactions\n", "abstract": " Software development processes are fundamentally based on efficient and effective communication. Communication between engineers, between engineers and managers, and between teams and clients are all essential components of a successful project. Requirements must be effectively transferred from client to engineer, specifications must be transitioned from architect to engineer, and constant communication between project team members, managers, and clients throughout the project life cycle is critical to the success of projects of any complexity. To succeed in a world where technologies, requirements, ideas, tools, and timelines are constantly changing, information must be accurate, readily available, easily found, and ideally delivered constantly, in real-time, to all team members. To meet these challenges, modern software development has evolved to encompass key concepts of adaptability to change …", "num_citations": "68\n", "authors": ["1959"]}
{"title": "Amygdalae morphometry in late‐life depression\n", "abstract": " Objective The amygdalae have been a focus of mood disorder research due to their key role in processing emotional information. It has been long known that depressed individuals demonstrate impaired functional performance while engaged in emotional tasks. The structural basis for these functional differences has been investigated via volumetric analysis with mixed findings. In this study, we examined the morphometric basis for these functional changes in late‐life depression (LLD) by analyzing both the size and shape of the amygdalae with the hypothesis that shape differences may be apparent even when overall volume differences are inconsistent.   Methods Magnetic resonance imaging data were acquired from 11 healthy, elderly individuals and 14 depressed, elderly individuals. Amygdalar size was quantified by computing total volume and amygdalar shape was quantified with a shape analysis method …", "num_citations": "43\n", "authors": ["1959"]}
{"title": "Mobile robot programming in education\n", "abstract": " The mobile robot programming laboratory course has been taught at Carnegie Mellon University for the past twelve years. It is a problem-driven class designed for students with little or no experience with robots. In this paper, we first present the current status of the class, and show how it improves the education and training of students in a robotics curriculum by giving them a hands-on experience with a real robot. We show that, in addition to core subjects such as perception, action and cognition, students also have the opportunity to learn advanced topics such as reinforcement learning and multi-robot coordination. We then discuss the evolution of the class under general categories: hardware and programming environment, team experiments, and assignments. We present important lessons learned in each category, and how they affect the learning experience of participating students. We conclude by discussing …", "num_citations": "36\n", "authors": ["1959"]}
{"title": "C-Mode Real-time Tomographic Reflection for a Matrix Array Ultrasound Sonic Flashlight1\n", "abstract": " Rationale and objectivesReal-time tomographic reflection (RTTR) permits in situ visualization of tomographic images so that natural hand-eye coordination can be used directly during invasive procedures. The method uses a half-silvered mirror to merge the visual outer surface of the patient with a simultaneous scan of the patient’s interior without requiring a head-mounted display or tracking. A viewpoint-independent virtual image is reflected precisely into its actual location. When applied to ultrasound, we call the resulting RTTR device the sonic flashlight. We previously implemented the sonic flashlight using conventional two-dimensional ultrasound scanners that produce B-mode slices. Real-time three-dimensional (RT3D) ultrasound scanners recently have been developed that permit RTTR to be applied to slices with other orientations, including C-mode (parallel to the face of the transducer). Such slice …", "num_citations": "19\n", "authors": ["1959"]}
{"title": "Anytime dynamic A*: the proofs\n", "abstract": " This paper presents a thorough theoretical analysis of a recently developed anytime incremental planning algorithm called Anytime Dynamic A*(AD*). The analysis includes proofs for the correctness of the algorithm and as well as the proofs for several properties of the algorithm related to its efficiency.", "num_citations": "13\n", "authors": ["1959"]}
{"title": "Teaching medical image analysis with the insight toolkit\n", "abstract": " We present several case studies which examine the role that the Insight Toolkit (ITK) played in three medical image analysis courses and several conference tutorials. These courses represent the first use of ITK in a teaching environment, and we believe that a discussion of the teaching approach in each case and the benefits and challenges of ITK will be useful to future medical image analysis course development. ITK was found to provide significant value in a classroom setting since it provides both working “canned” algorithms, including some recently developed methods that are unavailable elsewhere, as well as a framework for developing new techniques and applications. Several areas of difficulty, particularly in regards to code complexity and advanced object-oriented design techniques, have been identified which may make the learning curve of ITK somewhat more complex than a language such as …", "num_citations": "12\n", "authors": ["1959"]}
{"title": "Pulmonary artery conduit in vivo dimensional requirements in a growing ovine model: comparisons with the ascending aorta\n", "abstract": " Methods: Eleven Dorset sheep (aged 4-12 months) underwent a single cardiac magnetic resonance imaging study, from which luminal arterial surface points were obtained using a novel semi-automated segmentation technique. The three-dimensional shapes of the PT and ascending aorta (AA) were measured over the same time period to gain insight into differences in the geometric changes between these two great vessels.Results: The volumetric growth of the PT appeared to be a linear function of age, whereas its surface geometry demonstrated non-uniform growth patterns. While tortuosity was maintained with age, the cross-sectional shape of the main pulmonary artery (MPA) evolved from circular in young animals to elliptical at 12 months. In addition, the distal MPA near the pulmonary artery bifurcation tapered with age.Conclusion: It can be concluded that postnatal growth of the PT is not a simple proportionate (ie isotropic) size increase, but rather exhibits complex three-dimensional geometric features during somatic growth.", "num_citations": "11\n", "authors": ["1959"]}
{"title": "C-mode real time tomographic reflection for a matrix array ultrasound sonic flashlight\n", "abstract": " Real Time Tomographic Reflection (RTTR), permits in situ visualization of tomographic images, so that natural hand-eye coordination can be employed directly during invasive procedures. The method merges the visual outer surface of the patient with a simultaneous scan of the patient’s interior, using a half-silvered mirror. A viewpoint-independent virtual image is reflected precisely into the proper location. When applied to ultrasound, we call the resulting RTTR device the sonic flashlight. We have previously implemented the sonic flashlight using conventional 2D ultrasound. In this paper we present the first images from a new sonic flashlight based on Real Time 3D (RT3D) ultrasound, which uses a matrix array to electronically steer the ultrasound beam at very high speed. We show in situ C-mode images, which are parallel to the face of the transducer, of the hand and the cardiac ventricles.", "num_citations": "9\n", "authors": ["1959"]}
{"title": "Automated segmentation of the right heart using an optimized shells and spheres algorithm\n", "abstract": " We have developed a novel framework for medical image analysis, known as shells and spheres. This framework utilizes spherical operators of variable radius centered at each image pixel and sized to reach, but not cross, the nearest object boundary. Statistical population tests are performed on adjacent spheres to compare image regions across boundaries. Previously, our framework was applied to segmentation of cardiac CT data with promising results. In this paper, we present a more accurate and versatile system by optimizing algorithm parameters for a particular data set to maximize agreement to manual segmentations. We perform parameter optimization on a selected 2D slice from a 3D image data set, generating effective parameters for 3D segmentation in practical computational time. Details of this approach are given, along with a validated application to cardiac MR data.", "num_citations": "8\n", "authors": ["1959"]}
{"title": "Improving Federal Cybersecurity Governance Through Data-Driven Decision Making and Execution\n", "abstract": " Although efforts are underway through Information Security Continuous Monitoring initiatives to improve situational awareness and risk mitigation at the operational level, the federal government must make better enterprise-level cybersecurity decisions in the shortest time possible. This report outlines an approach called Data Driven Cybersecurity Governance Decision Making. This approach leverages the Observe, Orient, Decide, Act OODA loop used by the US Department of Defense to enable decision makers at the strategic levels of government to best set the conditions for success at the point of execution. To best target the unique considerations of enterprise decision makers, this report discusses the difference between cybersecurity governance and cybersecurity operations. Within this context, it describes best practices in collecting and analyzing authoritative data present in the federal space to develop a level of situational awareness tailored to decision makers needs in a cybersecurity governance scorecard. Cybersecurity governance decision makers can leverage this enhanced situational awareness to support a data-driven decision-making process that targets root causes of the problems facing the Federal government enterprise. Finally, the report discusses key considerations to ensure success at the point of execution based on work performed in the Observe, Orient, and Decide phases of the OODA Loop.Descriptors:", "num_citations": "7\n", "authors": ["1959"]}
{"title": "Shells and spheres: An n-dimensional framework for medial-based image segmentation\n", "abstract": " We have developed a method for extracting anatomical shape models from n-dimensional images using an image analysis framework we call Shells and Spheres. This framework utilizes a set of spherical operators centered at each image pixel, grown to reach, but not cross, the nearest object boundary by incorporating “shells” of pixel intensity values while analyzing intensity mean, variance, and first-order moment. Pairs of spheres on opposite sides of putative boundaries are then analyzed to determine boundary reflectance which is used to further constrain sphere size, establishing a consensus as to boundary location. The centers of a subset of spheres identified as medial (touching at least two boundaries) are connected to identify the interior of a particular anatomical structure. For the automated 3D algorithm, the only manual interaction consists of tracing a single contour on a 2D slice to optimize parameters, and identifying an initial point within the target structure.", "num_citations": "6\n", "authors": ["1959"]}
{"title": "Shells and Spheres: A Novel Framework for Variable Scale Statistical Image Analysis\n", "abstract": " A framework for analyzing images, called emph{Shells and Spheres},has been developed based on a set of spheres with adjustable radii,with exactly one sphere centered at each image pixel. This set ofspheres, known as a emph{sphere map}, is considered optimized wheneach sphere reaches, but does not cross, the nearest boundary.Calculations denoted as emph{Variable-Scale Statistics} (VSS) areperformed on populations of pixels within spheres, as well aspopulations of adjacent and overlapping spheres, in order to deducethe proper radius of each sphere. Spheres grow or shrink by addingor deleting an outer shell one pixel thick . Unlike conventionalfixed-scale kernels, our spherical operators consider as many pixelsas possible to differentiate between objects and accuratelydelineate boundaries. The term ``sphere\" is used for brevity, thoughthe approach is not limited to 3D and is valid in -dimensions.The approach is illustrated using both real images and noiselesssynthetic images containing objects with uniform intensity, and moreclosely examined and validated using various synthetic images withadded white noise and multiple contrast enhanced CT scans of theaortic arch. A particular algorithm using Shells and Spheres isdescribed and demonstrated on segmentation of the aortic arch in acontrast-enhanced CT scan, both in 2D and 3D.", "num_citations": "5\n", "authors": ["1959"]}
{"title": "Variable scale statistics for cardiac segmentation and shape analysis\n", "abstract": " A novel framework for medical image analysis, known as Shells and Spheres, has been developed by our research lab. This framework utilizes spherical operators of variable radius, centered at each image pixel and sized to reach, but not cross, the nearest boundary. Statistical population tests are performed on the populations of pixels within adjacent spheres to compare image regions across boundaries, delineating both independent image objects and the boundaries between them. This research has focused on developing the Shells and Spheres framework and applying it to the problem of segmentation of anatomical objects. Furthermore, we have rigorously studied the framework and its applications to clinical segmentation, validating and improving our n-dimensional segmentation algorithm. To this end, we have enhanced the original Shells and Spheres segmentation algorithm by adding a priori …", "num_citations": "4\n", "authors": ["1959"]}
{"title": "Shells and Spheres: A Framework for Variable Scale Statistical Image Analysis\n", "abstract": " We have developed a framework for analyzing images, called Shells and Spheres, based on a set of spheres with adjustable radii, with exactly one sphere centered at each image pixel. This set of spheres, known as a sphere map, is considered optimized when each sphere reaches, but does not cross, the nearest boundary. Calculations denoted as Variable-Scale Statistics (VSS) are performed on populations of pixels within spheres, as well as populations of adjacent and overlapping spheres, in order to deduce the proper radius of each sphere. Spheres grow or shrink by adding or deleting an outer shell one pixel thick. Unlike conventional fixed-scale kernels, our spherical operators consider as many pixels as possible to differentiate between objects and accurately delineate boundaries. We use the word “sphere” here for brevity, though the approach is not limited to 3D and is valid in n-dimensions. We illustrate our approach on synthetic images containing objects with uniform intensity. We then describe a particular algorithm using Shells and Spheres and demonstrate it by segmenting the aortic arch in a contrast-enhanced CT scan, both in 2D and 3D.", "num_citations": "4\n", "authors": ["1959"]}
{"title": "Localizing amygdala structure differences in late-life depression\n", "abstract": " The amygdala is critical for processing emotional information and plays an important role in late-life depression (LLD). Volumetric studies of the amygdala have been inconclusive with reports of increased, decreased, and no volume changes. This study investigates amygdala shape morphometry to test the hypothesis that if structural changes are specific to certain nuclei, then shape changes may be apparent even when overall volume changes are inconsistent. We have developed a method of shape morphometry based on the work of to localize regions of structural differences. The method relies on generating surface meshes for segmented amygdalae, calculating distances from surface points to the medial manifold, and comparing the distance measures at corresponding surface points between groups. Resulting statistical maps revealed significant structural differences in multiple regions of both amygdalae …", "num_citations": "3\n", "authors": ["1959"]}
{"title": "Medial node correspondences towards automated registration\n", "abstract": " Many modern forms of segmentation and registration require manual input making it a tedious and time-consuming process. There have been some successes with automating these methods, but these tend to be unreliable because of inherent variations in anatomical shapes and image quality. It is toward this goal that we have developed an automated method of generating landmarks for registration that will not require supervision or manual initialization. We have chosen medial based image features because they have proven robust against image noise and shape variation, and provide the rotationally invariant properties of dimensionality and scale, which can be used by a unary metric. We introduce a new metric for comparing the geometric relationships between medial features, which overcomes problems introduced by symmetry within a medial feature. With these metrics, we are able to find …", "num_citations": "1\n", "authors": ["1959"]}