{"title": "NIH Image to ImageJ: 25 years of image analysis\n", "abstract": " For the past 25 years NIH Image and ImageJ software have been pioneers as open tools for the analysis of scientific images. We discuss the origins, challenges and solutions of these two programs, and how their history can serve to advise and inform other software projects.", "num_citations": "38402\n", "authors": ["619"]}
{"title": "Fiji: an open-source platform for biological-image analysis\n", "abstract": " Fiji is a distribution of the popular open-source software ImageJ focused on biological-image analysis. Fiji uses modern software engineering practices to combine powerful software libraries with a broad range of scripting languages to enable rapid prototyping of image-processing algorithms. Fiji facilitates the transformation of new algorithms into ImageJ plugins that can be shared with end users through an integrated update system. We propose Fiji as a platform for productive collaboration between computer science and biology research communities.", "num_citations": "32946\n", "authors": ["619"]}
{"title": "ImageJ2: ImageJ for the next generation of scientific image data\n", "abstract": " ImageJ is an image analysis program extensively used in the biological sciences and beyond. Due to its ease of use, recordable macro language, and extensible plug-in architecture, ImageJ enjoys contributions from non-programmers, amateur programmers, and professional developers alike. Enabling such a diversity of contributors has resulted in a large community that spans the biological and physical sciences. However, a rapidly growing user base, diverging plugin suites, and technical limitations have revealed a clear need for a concerted software engineering effort to support emerging imaging paradigms, to ensure the software’s ability to handle the requirements of modern science. We rewrote the entire ImageJ codebase, engineering a redesigned plugin mechanism intended to facilitate extensibility at every level, with the goal of creating a more powerful tool that continues to serve the existing community …", "num_citations": "3471\n", "authors": ["619"]}
{"title": "The ImageJ ecosystem: An open platform for biomedical image analysis\n", "abstract": " Technology in microscopy advances rapidly, enabling increasingly affordable, faster, and more precise quantitative biomedical imaging, which necessitates correspondingly more‐advanced image processing and analysis techniques. A wide range of software is available—from commercial to academic, special‐purpose to Swiss army knife, small to large—but a key characteristic of software that is suitable for scientific inquiry is its accessibility. Open‐source software is ideal for scientific endeavors because it can be freely inspected, modified, and redistributed; in particular, the open‐software platform ImageJ has had a huge impact on the life sciences, and continues to do so. From its inception, ImageJ has grown significantly due largely to being freely available and its vibrant and helpful user community. Scientists as diverse as interested hobbyists, technical assistants, students, scientific staff, and advanced …", "num_citations": "1982\n", "authors": ["619"]}
{"title": "Collagen density promotes mammary tumor initiation and progression\n", "abstract": " Mammographically dense breast tissue is one of the greatest risk factors for developing breast carcinoma. Despite the strong clinical correlation, breast density has not been causally linked to tumorigenesis, largely because no animal model has existed for studying breast tissue density. Importantly, regions of high breast density are associated with increased stromal collagen. Thus, the influence of the extracellular matrix on breast carcinoma development and the underlying molecular mechanisms are not understood. To study the effects of collagen density on mammary tumor formation and progression, we utilized a bi-transgenic tumor model with increased stromal collagen in mouse mammary tissue. Imaging of the tumors and tumor-stromal interface in live tumor tissue was performed with multiphoton laser-scanning microscopy to generate multiphoton excitation and spectrally resolved fluorescent lifetimes of endogenous fluorophores. Second harmonic generation was utilized to image stromal collagen. Herein we demonstrate that increased stromal collagen in mouse mammary tissue significantly increases tumor formation approximately three-fold (p < 0.00001) and results in a significantly more invasive phenotype with approximately three times more lung metastasis (p < 0.05). Furthermore, the increased invasive phenotype of tumor cells that arose within collagen-dense mammary tissues remains after tumor explants are cultured within reconstituted three-dimensional collagen gels. To better understand this behavior we imaged live tumors using nonlinear optical imaging approaches to demonstrate that local invasion is facilitated by stromal …", "num_citations": "1249\n", "authors": ["619"]}
{"title": "Trainable Weka Segmentation: a machine learning tool for microscopy pixel classification\n", "abstract": " Summary           State-of-the-art light and electron microscopes are capable of acquiring large image datasets, but quantitatively evaluating the data often involves manually annotating structures of interest. This process is time-consuming and often a major bottleneck in the evaluation pipeline. To overcome this problem, we have introduced the Trainable Weka Segmentation (TWS), a machine learning tool that leverages a limited number of manual annotations in order to train a classifier and segment the remaining data automatically. In addition, TWS can provide unsupervised segmentation learning schemes (clustering) and can be customized to employ user-designed image features or classifiers.                             Availability and Implementation           TWS is distributed as open-source software as part of the Fiji image processing distribution of ImageJ at http://imagej.net/Trainable_Weka_Segmentation …", "num_citations": "1159\n", "authors": ["619"]}
{"title": "Improved structure, function and compatibility for CellProfiler: modular high-throughput image analysis software\n", "abstract": " Summary: There is a strong and growing need in the biology research community for accurate, automated image analysis. Here, we describe CellProfiler 2.0, which has been engineered to meet the needs of its growing user base. It is more robust and user friendly, with new algorithms and features to facilitate high-throughput work. ImageJ plugins can now be run within a CellProfiler pipeline.                    Availability and Implementation: CellProfiler 2.0 is free and open source, available at http://www.cellprofiler.org under the GPL v. 2 license. It is available as a packaged application for Macintosh OS X and Microsoft Windows and can be compiled for Linux.                    Contact:           anne@broadinstitute.org                             Supplementary information:           Supplementary data are available at Bioinformatics online.", "num_citations": "946\n", "authors": ["619"]}
{"title": "Metadata matters: access to image data in the real world\n", "abstract": " Data sharing is important in the biological sciences to prevent duplication of effort, to promote scientific integrity, and to facilitate and disseminate scientific discovery. Sharing requires centralized repositories, and submission to and utility of these resources require common data formats. This is particularly challenging for multidimensional microscopy image data, which are acquired from a variety of platforms with a myriad of proprietary file formats (PFFs). In this paper, we describe an open standard format that we have developed for microscopy image data. We call on the community to use open image data standards and to insist that all imaging platforms support these file formats. This will build the foundation for an open image data repository.", "num_citations": "668\n", "authors": ["619"]}
{"title": "Tools for visualizing multidimensional images from living specimens\n", "abstract": " Over the last 50 years modern cell biology has been driven by the development of powerful imaging techniques. In particular, new developments in light microscopy that provide the potential to image the dynamics of biological events have had significant impact. Optical sectioning techniques allow three‐dimensional information to be obtained from living specimens noninvasively. When used with multimodal fluorescence microscopy, advanced optical sectioning techniques provide multidimensional image data that can reveal information not only about the changing cytoarchitecture of a cell but also about its physiology. These additional dimensions of information, although providing powerful tools, also pose significant visualization challenges to the investigator. Particularly in the current postgenomic era there is a greater need than ever for the development of effective tools for image visualization and management …", "num_citations": "141\n", "authors": ["619"]}
{"title": "Visualization approaches for multidimensional biological image data\n", "abstract": " Laboratory for Optical and Computational Instrumentation, University of Wisconsin at Madison, Madison, WI, USA sional approaches with an emphasis on 4-D data and present some of the approaches of visualizing such data. The great advances in computing in recent years have allowed for the increased development of advanced multidimensional microscopy approaches by allowing for improved acquisition capabilities, including automated collection, larger data set collection, faster collection, and hardware-based image processing at acquisition. These computational advances have had a profound impact on how one can analyze data as well. With the advent of digital data collection and readily available personal computer workstations has come the widespread use of sophisticated computational analysis by the microscopist. However despite these advances, surprisingly there lacks a common infrastructure …", "num_citations": "129\n", "authors": ["619"]}
{"title": "Assessing microscope image focus quality with deep learning\n", "abstract": " Large image datasets acquired on automated microscopes typically have some fraction of low quality, out-of-focus images, despite the use of hardware autofocus systems. Identification of these images using automated image analysis with high accuracy is important for obtaining a clean, unbiased image dataset. Complicating this task is the fact that image focus quality is only well-defined in foreground regions of images, and as a result, most previous approaches only enable a computation of the relative difference in quality between two or more images, rather than an absolute measure of quality. We present a deep neural network model capable of predicting an absolute measure of image focus on a single image in isolation, without any user-specified parameters. The model operates at the image-patch level, and also outputs a measure of prediction certainty, enabling interpretable predictions. The model was …", "num_citations": "100\n", "authors": ["619"]}
{"title": "Quantitating the cell: turning images into numbers with ImageJ\n", "abstract": " Modern biological research particularly in the fields of developmental and cell biology has been transformed by the rapid evolution of the light microscope. The light microscope, long a mainstay of the experimental biologist, is now used for a wide array of biological experimental scenarios and sample types. Much of the great developments in advanced biological imaging have been driven by the digital imaging revolution with powerful processors and algorithms. In particular, this combination of advanced imaging and computational analysis has resulted in the drive of the modern biologist to not only visually inspect dynamic phenomena, but to quantify the involved processes. This need to quantitate images has become a major thrust within the bioimaging community and requires extensible and accessible image processing routines with corresponding intuitive software packages. Novel algorithms both made …", "num_citations": "78\n", "authors": ["619"]}
{"title": "Nonlinear optical imaging and spectral-lifetime computational analysis of endogenous and exogenous fluorophores in breast cancer\n", "abstract": " Multiphoton laser scanning microscopy (MPLSM) utilizing techniques such as multiphoton excitation (MPE), second harmonic generation (SHG), and multiphoton fluorescence lifetime imaging and spectral lifetime imaging (FLIM and SLIM, respectively) are greatly expanding the degree of information obtainable with optical imaging in biomedical research. The application of these nonlinear optical approaches to the study of breast cancer holds particular promise. These noninvasive, multidimensional techniques are well suited to image exogenous fluorophores that allow relevant questions regarding protein localization and signaling to be addressed both in vivo and in vitro. Furthermore, MPLSM imaging of endogenous signals from collagen and fluorophores such as nicotinamide adenine dinucleotide (NADH) or flavin adenine dinucleotide (FAD), address important questions regarding the tumor-stromal interaction …", "num_citations": "64\n", "authors": ["619"]}
{"title": "VisBio: a computational tool for visualization of multidimensional biological image data\n", "abstract": " New laser scanning microscopy techniques enable biologists to acquire larger, more complex image datasets. Emerging imaging modalities such as multispectral, harmonic, and fluorescence lifetime can generate data with six or more dimensions; however, existing software is not well suited to the visualization or analysis of such data. To address these concerns, we have developed VisBio, an application and toolkit for visualization and analysis of multidimensional, biological image data of any dimensionality.", "num_citations": "49\n", "authors": ["619"]}
{"title": "Applications of combined spectral lifetime microscopy for biology\n", "abstract": " Live cell imaging has been greatly advanced by the recent development of new fluorescence microscopy-based methods such as multiphoton laser-scanning microscopy, which can noninvasively image deep into live specimens and generate images of extrinsic and intrinsic signals. Of recent interest has been the development of techniques that can harness properties of a fluorescence, other than intensity, such as the emission spectrum and ezcited state lifetime of a fluorophore. Spectra can be used to discriminate between fluorophores, and lifetime can be used to report on the microenvironment of fluorophores. We describe a novel technique—combined spectral and lifetime imaging—which combines the benefits of multiphoton microscopy, spectral discrimination, and lifetime analysis and allows for the simultaneous collection of all three dimensions of data along with spatial and temporal information.", "num_citations": "31\n", "authors": ["619"]}
{"title": "Multiphoton flow cytometry to assess intrinsic and extrinsic fluorescence in cellular aggregates: applications to stem cells\n", "abstract": " Detection and tracking of stem cell state are difficult due to insufficient means for rapidly screening cell state in a noninvasive manner. This challenge is compounded when stem cells are cultured in aggregates or three-dimensional (3D) constructs because living cells in this form are difficult to analyze without disrupting cellular contacts. Multiphoton laser scanning microscopy is uniquely suited to analyze 3D structures due to the broad tunability of excitation sources, deep sectioning capacity, and minimal phototoxicity but is throughput limited. A novel multiphoton fluorescence excitation flow cytometry (MPFC) instrument could be used to accurately probe cells in the interior of multicell aggregates or tissue constructs in an enhanced-throughput manner and measure corresponding fluorescent properties. By exciting endogenous fluorophores as intrinsic biomarkers or exciting extrinsic reporter molecules, the …", "num_citations": "24\n", "authors": ["619"]}
{"title": "SCIFIO: an extensible framework to support scientific image formats\n", "abstract": " No gold standard exists in the world of scientific image acquisition; a proliferation of instruments each with its own proprietary data format has made out-of-the-box sharing of that data nearly impossible. In the field of light microscopy, the Bio-Formats library was designed to translate such proprietary data formats to a common, open-source schema, enabling sharing and reproduction of scientific results. While Bio-Formats has proved successful for microscopy images, the greater scientific community was lacking a domain-independent framework for format translation. SCIFIO (SCientific Image Format Input and Output) is presented as a freely available, open-source library unifying the mechanisms of reading and writing image data. The core of SCIFIO is its modular definition of formats, the design of which clearly outlines the components of image I/O to encourage extensibility, facilitated by the dynamic discovery of the SciJava plugin framework. SCIFIO is structured to support coexistence of multiple domain-specific open exchange formats, such as Bio-Formats’ OME-TIFF, within a unified environment. SCIFIO is a freely available software library developed to standardize the process of reading and writing scientific image formats.", "num_citations": "20\n", "authors": ["619"]}
{"title": "ImageJ-MATLAB: a bidirectional framework for scientific image analysis interoperability\n", "abstract": " Summary           ImageJ-MATLAB is a lightweight Java library facilitating bi-directional interoperability between MATLAB and ImageJ. By defining a standard for translation between matrix and image data structures, researchers are empowered to select the best tool for their image-analysis tasks.                             Availability and Implementation           Freely available extension to ImageJ2 (http://imagej.net/Downloads). Installation and use instructions available at http://imagej.net/MATLAB_Scripting. Tested with ImageJ 2.0.0-rc-54, Java 1.8.0_66 and MATLAB R2015b.                             Supplementary information                        Supplementary data are available at Bioinformatics online.", "num_citations": "18\n", "authors": ["619"]}
{"title": "Nonlinear optical microscopy and computational analysis of intrinsic signatures in breast cancer\n", "abstract": " Recently, new non-invasive imaging methods have been developed and applied to cellular and animal mammary models that have enabled breast cancer researchers to track key players and events in mammary metastasis. Noninvasive nonlinear optical methods such as multiphoton laser scanning microscopy (MPLSM), Fluorescence Lifetime Microscopy (FLIM) and second harmonic generation (SHG) imaging provide an unrivaled ability for obtaining high-resolution images from deep within tissue that can be exploited in the quest to understand breast cancer progression. These optical methods can add greatly to our knowledge of cancer progression by allowing key processes to be non-invasively imaged such as metabolism (on the basis of free and bound NADH detection via FLIM) and interactions with the extracellular matrix (SHG imaging of collagen). In this short application note we present a survey of our …", "num_citations": "18\n", "authors": ["619"]}
{"title": "Java distributed components for numerical visualization in VisAD\n", "abstract": " Combining a flexible data model and distributed objects, they support the sharing of data, visualizations, and user interfaces among multiple data sources, computers, and scientific disciplines.", "num_citations": "18\n", "authors": ["619"]}
{"title": "Java distributed objects for numerical visualization in VisAD\n", "abstract": " The scientific world is evolving to require more collaboration among different institutions and disciplines. Understanding long-term changes in the Earth environment, for example, requires models that integrate disciplines such as meteorology, oceanography, hydrology (rivers and groundwater), soil science and geology. During the past 15 years, scientists have started sharing data using FTP and software on the Internet, but collaborative work and more routine data sharing require a new kind of scientific software.", "num_citations": "17\n", "authors": ["619"]}
{"title": "The ImageJ ecosystem: Open‐source software for image visualization, processing, and analysis\n", "abstract": " For decades, biologists have relied on software to visualize and interpret imaging data. As techniques for acquiring images increase in complexity, resulting in larger multidimensional datasets, imaging software must adapt. ImageJ is an open‐source image analysis software platform that has aided researchers with a variety of image analysis applications, driven mainly by engaged and collaborative user and developer communities. The close collaboration between programmers and users has resulted in adaptations to accommodate new challenges in image analysis that address the needs of ImageJ's diverse user base. ImageJ consists of many components, some relevant primarily for developers and a vast collection of user‐centric plugins. It is available in many forms, including the widely used Fiji distribution. We refer to this entire ImageJ codebase and community as the ImageJ ecosystem. Here we review the …", "num_citations": "15\n", "authors": ["619"]}
{"title": "Integration of the ImageJ Ecosystem in KNIME Analytics Platform\n", "abstract": " Open-source software tools are often used for analysis of scientific image data due to their flexibility and transparency in dealing with rapidly evolving imaging technologies. The complex nature of image analysis problems frequently requires many tools to be used in conjunction, including image processing and analysis, data processing, machine learning and deep learning, statistical analysis of the results, visualization, correlation to heterogeneous but related data, and more. However, the development, and therefore application, of these computational tools is impeded by a lack of integration across platforms. Integration of tools goes beyond convenience, as it is impractical for one tool to anticipate and accommodate the current and future needs of every user. This problem is emphasized in the field of bioimage analysis, where various rapidly emerging methods are quickly being adopted by researchers. ImageJ is a popular open-source image analysis platform, with contributions from a worldwide community resulting in hundreds of specialized routines for a wide array of scientific tasks. ImageJ’s strength lies in its accessibility and extensibility, allowing researchers to easily improve the software to solve their image analysis tasks. However, ImageJ is not designed for development of complex end-to-end image analysis workflows. Scientists are often forced to create highly specialized and hard-to-reproduce scripts to orchestrate individual software fragments and cover the entire life-cycle of an analysis of an image dataset. KNIME Analytics Platform, a user-friendly data integration, analysis, and exploration workflow system, designed to handle …", "num_citations": "13\n", "authors": ["619"]}
{"title": "ImageJ for the next generation of scientific image data\n", "abstract": " //static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS1431927619001442/resource/name/firstPage-S1431927619001442a.jpg", "num_citations": "11\n", "authors": ["619"]}
{"title": "Scientific Community Image Forum: A discussion forum for scientific image software\n", "abstract": " Forums and email lists play a major role in assisting scientists in using software. Previously, each open-source bioimaging software package had its own distinct forum or email list. Although each provided access to experts from various software teams, this fragmentation resulted in many scientists not knowing where to begin with their projects. Thus, the scientific imaging community lacked a central platform where solutions could be discussed in an open, software-independent manner. In response, we introduce the Scientific Community Image Forum, where users can pose software-related questions about digital image analysis, acquisition, and data management.", "num_citations": "9\n", "authors": ["619"]}
{"title": "The ImageJ Ecosystem: An Open and Extensible Platform for Biomedical Image Analysis.\n", "abstract": " //static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS1431927617001817/resource/name/firstPage-S1431927617001817a.jpg", "num_citations": "9\n", "authors": ["619"]}
{"title": "16.3 COLLABORATIVE VISUALIZATION AND COMPUTATION IN THE EARTH SCIENCES USING VisAD\n", "abstract": " We described our plans for a Java implementation of VisAD at this conference two years ago (Hibbard, Anderson and Paul, 1997) and demonstrated it at this conference last year. Now it is freely available via the world wide web from http://www. ssec. wisc. edu/~ billh/visad. html and ready to serve as the foundation for development of interactive meteorology, oceanography and hydrology systems. This paper explains the advantages of using VisAD in your system development efforts. These can be summarized as:", "num_citations": "9\n", "authors": ["619"]}
{"title": "Analysis of multidimensional biological image data\n", "abstract": " Relatively recent strides in noninvasive medical imaging and in vital microscopy have yielded a new form of massive data type: the multi-channel, 3-D, time-course image recording. These multidimensional datasets document dynamic changes within the full volume of a specimen over time, often simultaneously monitoring several different parameters. As a result, visual data collected from a single living specimen can now go beyond the 2-D domain, engaging the viewer’s full capacity to discern changes across space, time, and additional dimensions such as image spectra. A challenge rising out of these advances is to display these data so that the investigator can visualize and interactively explore the recording’s full spatial, temporal. and spectral content, to better understand what cannot be seen directly through the microscope eyepiece. The challenges of multidimensional image analysis are not unique to the …", "num_citations": "8\n", "authors": ["619"]}
{"title": "FLIMJ: An open-source ImageJ toolkit for fluorescence lifetime image data analysis\n", "abstract": " In the field of fluorescence microscopy, there is continued demand for dynamic technologies that can exploit the complete information from every pixel of an image. One imaging technique with proven ability for yielding additional information from fluorescence imaging is Fluorescence Lifetime Imaging Microscopy (FLIM). FLIM allows for the measurement of how long a fluorophore stays in an excited energy state, and this measurement is affected by changes in its chemical microenvironment, such as proximity to other fluorophores, pH, and hydrophobic regions. This ability to provide information about the microenvironment has made FLIM a powerful tool for cellular imaging studies ranging from metabolic measurement to measuring distances between proteins. The increased use of FLIM has necessitated the development of computational tools for integrating FLIM analysis with image and data processing. To address this need, we have created FLIMJ, an ImageJ plugin and toolkit that allows for easy use and development of extensible image analysis workflows with FLIM data. Built on the FLIMLib decay curve fitting library and the ImageJ Ops framework, FLIMJ offers FLIM fitting routines with seamless integration with many other ImageJ components, and the ability to be extended to create complex FLIM analysis workflows. Building on ImageJ Ops also enables FLIMJ’s routines to be used with Jupyter notebooks and integrate naturally with science-friendly programming in, e.g., Python and Groovy. We show the extensibility of FLIMJ in two analysis scenarios: lifetime-based image segmentation and image colocalization. We also validate the fitting …", "num_citations": "6\n", "authors": ["619"]}
{"title": "ImageJ: Image analysis interoperability for the next generation of biological image data\n", "abstract": " //static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS143192761601117X/resource/name/firstPage-S143192761601117Xa.jpg", "num_citations": "6\n", "authors": ["619"]}
{"title": "Noninvasive sorting of stem cell aggregates based on intrinsic markers\n", "abstract": " Noninvasive biomarkers hold important potential for the characterization and purification of stem cells because the addition of exogenous labels, probes, or reporters, as well as the disruption of cell‐cell and cell‐extracellular matrix interactions, can unintentionally but dramatically alter stem cell state. We recently showed that intensity of the intrinsically fluorescent metabolite, nicotinamide adenine dinucleotide (NADH), fluctuates predictably with changes in stem cell viability and differentiation state. Here, we use multiphoton flow cytometry developed in our laboratory to rapidly and noninvasively characterize and purify populations of intact stem cell aggregates based on NADH intensity and assessed the differentiation capacity of sorted populations. We found removal of aggregates with NADH intensity indicative of cell death resulted in a remaining population of aggregates significantly more likely to produce beating …", "num_citations": "5\n", "authors": ["619"]}
{"title": "Large particle multiphoton flow cytometry to purify intact embryoid bodies exhibiting enhanced potential for cardiomyocyte differentiation\n", "abstract": " Embryoid bodies (EBs) are large (>100 μm) 3D microtissues composed of stem cells, differentiating cells and extracellular matrix (ECM) proteins that roughly recapitulate early embryonic development. EBs are widely used as in vitro model systems to study stem cell differentiation and the complex physical and chemical interactions contributing to tissue development. Though much has been learned about differentiation from EBs, the practical and technical difficulties of effectively probing and properly analyzing these 3D microtissues has limited their utility and further application. We describe advancement of a technology platform developed in our laboratory, multiphoton flow cytometry (MPFC), to detect and sort large numbers of intact EBs based on size and fluorescent reporters. Real-time and simultaneous measurement of size and fluorescence intensity are now possible, through the implementation of …", "num_citations": "5\n", "authors": ["619"]}
{"title": "FunImageJ: a Lisp framework for scientific image processing\n", "abstract": " Summary           FunImageJ is a Lisp framework for scientific image processing built upon the ImageJ software ecosystem. The framework provides a natural functional-style for programming, while accounting for the performance requirements necessary in big data processing commonly encountered in biological image analysis.                             Availability and implementation           Freely available plugin to Fiji (http://fiji.sc/#download). Installation and use instructions available at http://imagej.net/FunImageJ.                             Supplementary information                        Supplementary data are available at Bioinformatics online.", "num_citations": "4\n", "authors": ["619"]}
{"title": "Open Source BioImage Informatics: Tools for Interoperability\n", "abstract": " Extended abstract of a paper presented at Microscopy and Microanalysis 2013 in Indianapolis, Indiana, USA, August 4 – August 8, 2013.", "num_citations": "1\n", "authors": ["619"]}
{"title": "The Open Microscopy Environment: Informatics and Quantitative Analysis for Biological Microscopy\n", "abstract": " Extended abstract of a paper presented at Microscopy and Microanalysis 2009 in Richmond, Virginia, USA, July 26 – July 30, 2009", "num_citations": "1\n", "authors": ["619"]}
{"title": "Open file formats for high-content analysis\n", "abstract": " The growth of quantitative analysis in basic and applied biological research has driven a desperate need for data management tools. One of the best examples of such a need is in the rapidly growing field of high content assays. Effective use of the data from these assays critically requires the development of open data formats to allow the access of data by different processing and visualization applications, and sharing of data between scientific collaborators. In this chapter, we discuss the requirements for such formats, focusing on the necessity for flexibility and adaptability, and the development of software tools to support these formats. Finally, we provide examples of adaptable open formats and file-format tools for biological image and high content analysis provided by the Open Microscopy Environment Consortium, including OME-XML, OME-TIFF, and Bio-Formats.", "num_citations": "1\n", "authors": ["619"]}