{"title": "Gender-specific influences of balance, speed, and power on agility performance\n", "abstract": " Sekulic, D, Spasic, M, Mirkov, D, Cavar, M and Sattler, T. Gender-specific influences of balance, speed, and power on agility performance. J Strength Cond Res 27 (3): 802–811, 2013—The quick change of direction (ie, agility) is an important athletic ability in numerous sports. Because of the diverse and therefore hardly predictable manifestations of agility in sports, studies noted that the improvement in speed, power, and balance should result in an improvement of agility. However, there is evident lack of data regarding the influence of potential predictors on different agility manifestations. The aim of this study was to determine the gender-specific influence of speed, power, and balance on different agility tests. A total of 32 college-aged male athletes and 31 college-aged female athletes (age 20.02±1.89 years) participated in this study. The subjects were mostly involved in team sports (soccer, team handball …", "num_citations": "232\n", "authors": ["1055"]}
{"title": "Vertical jumping tests in volleyball: reliability, validity, and playing-position specifics\n", "abstract": " Sattler, T, Sekulic, D, Hadzic, V, Uljevic, O, and Dervisevic, E. Vertical jumping tests in volleyball: reliability, validity, and playing-position specifics. J Strength Cond Res 26 (6): 1532–1538, 2012—Vertical jumping is known to be important in volleyball, and jumping performance tests are frequently studied for their reliability and validity. However, most studies concerning jumping in volleyball have dealt with standard rather than sport-specific jumping procedures and tests. The aims of this study, therefore, were (a) to determine the reliability and factorial validity of 2 volleyball-specific jumping tests, the block jump (BJ) test and the attack jump (AJ) test, relative to 2 frequently used and systematically validated jumping tests, the countermovement jump test and the squat jump test and (b) to establish volleyball position–specific differences in the jumping tests and simple anthropometric indices (body height [BH], body …", "num_citations": "205\n", "authors": ["1055"]}
{"title": "Anthropometric characteristics of high level European junior basketball players\n", "abstract": " The purpose of the research was to assess anthropometric status of European highlevel junior basketball players and to determine anthropometric differences between the players playing in different game positions (guards, forwards, centers). The sample consisted of I32 young basketball players, participants of the European Junior Basketball Championship, Zadar; 2000. Participants were measured with 31 measures (anthropo-metric variables), on the basis of which tuvo body composition measures (BMI and relative body fat) and somatotype were calculated. The basic statistical parameters were computed. The analysis of variance and discriminant canonical analysis were employed to determine the differences betuveen positions in play. Results indicate that promi-nent longitudinal and transversal skeletal dimensions as well as circumference measures characterize players on the position of centers, but they do …", "num_citations": "117\n", "authors": ["1055"]}
{"title": "The physiological demands of table tennis: a review\n", "abstract": " Although table tennis has a tradition lasting more than 100 years, relatively little is known about players’ physiological requirements–especially during competition. In this review we discuss research studies that have led to our current understanding of how the body functions during table tennis training and competition and how this is altered by training. Match and practice analysis of the table tennis game indicates that during intense practice and competition it is predominantly the anaerobic alactic system that is called into play, while the endurance system is relied on to recovery the anaerobic stores used during such effort. It is thus important for coaches to keep in mind that, while the anaerobic alactic system is the most energetic system used during periods of exertion in a table tennis game, a strong capacity for endurance is what helps a player recover quicker for the following match and the next day of …", "num_citations": "106\n", "authors": ["1055"]}
{"title": "Reactive agility performance in handball; development and evaluation of a sport-specific measurement protocol\n", "abstract": " There is no current study that examined sport-specific tests of reactive-agility and change-of-direction-speed (CODS) to replicate real-sport environment in handball (team-handball). This investigation evaluated the reliability and validity of two novel tests designed to assess reactive-agility and CODS of handball players. Participants were female (25.14±3.71 years of age; 1.77±0.09 m and 74.1±6.1 kg) and male handball players (26.9±4.1 years of age; 1.90±0.09 m and 93.90±4.6 kg). Variables included body height, body mass, body mass index, broad jump, 5-m sprint, CODS and reactive-agility tests. Results showed satisfactory reliability for reactive-agility-test and CODS-test (ICC of 0.85-0.93, and CV of 2.4-4.8%). The reactive-agility and CODS shared less than 20% of the common variance. The calculated index of perceptual and reactive capacity (P&RC; ratio between reactive-agility-and CODS-performance) is …", "num_citations": "80\n", "authors": ["1055"]}
{"title": "Is there a danger for myopia in anti-doping education? Comparative analysis of substance use and misuse in Olympic racket sports calls for a broader approach\n", "abstract": " Racket sports are typically not associated with doping. Despite the common characteristics of being non-contact and mostly individual, racket sports differ in their physiological demands, which might be reflected in substance use and misuse (SUM). The aim of this study was to investigate SUM among Slovenian Olympic racket sport players in the context of educational, sociodemographic and sport-specific factors. Elite athletes (N = 187; mean age = 22 ± 2.3; 64% male) representing one of the three racket sports, table tennis, badminton, and tennis, completed a paper-and-pencil questionnaire on substance use habits. Athletes in this sample had participated in at least one of the two most recent competitions at the highest national level and had no significant difference in competitive achievement or status within their sport. A significant proportion of athletes (46% for both sexes) reported using nutritional supplements. Between 10% and 24% of the studied males would use doping if the practice would help them achieve better results in competition and if it had no negative health consequences; a further 5% to 10% indicated potential doping behaviour regardless of potential health hazards. Females were generally less oriented toward SUM than their male counterparts with no significant differences between sports, except for badminton players. Substances that have no direct effect on sport performance (if timed carefully to avoid detrimental effects) are more commonly consumed (20% binge drink at least once a week and 18% report using opioids), whereas athletes avoid substances that can impair and threaten athletic achievement by …", "num_citations": "68\n", "authors": ["1055"]}
{"title": "Substance abuse prevalence and its relation to scholastic achievement and sport factors: an analysis among adolescents of the Herzegovina–Neretva Canton in Bosnia and Herzegovina\n", "abstract": " Substance abuse among adolescents is a major public health and social problem. However, studies rarely investigate the relationships between substance abuse, educational achievement and sport factors. Substance abuse is an even more significant problem in societies that have experienced trauma, such as Bosnia and Herzegovina, which have had recent wars. The aims of this study were to investigate substance abuse among adolescents in Bosnia and Herzegovina and to study the potential gender-specific relationships between a) sport factors (physical activity/exercise/athletic participation) and substance abuse and b) scholastic achievement and substance abuse. Our sample consisted of 1,032 adolescents who were 17 to 18 years old (435 boys and 597 girls) and who were in the final grade of high school. These subjects were randomly selected from the territory of Herzegovina-Neretva Canton of …", "num_citations": "66\n", "authors": ["1055"]}
{"title": "Levels and changes of physical activity in adolescents during the COVID-19 pandemic: contextualizing urban vs. rural living environment\n", "abstract": " The COVID-19 pandemic and the social distancing implemented shortly after influence physical activity levels (PALs). The purpose of this investigation was to evaluate the changes in PAL and factors associated with PALs among Croatian adolescents while considering the impact of community (urban vs. rural living environment). The sample included 823 adolescents (mean age: 16.5±2.1 years) who were tested on baseline (from October 2019 to March 2020; before COVID-19 pandemic in Croatia) and follow-up (in April 2020; during the COVID-19 pandemic and imposed rules of social distancing). Baseline testing included anthropometrics, physical fitness status, and evaluation of PALs, while follow-up included only PALs (evaluated by a standardized questionnaire through an internet application). The results showed a significant influence of the living environment on the decrease of PAL, with a larger decrease in urban adolescents. Logistic regression showed a higher likelihood for normal PALs at baseline in adolescents who had better fitness status, with no strong confounding effect of the urban/rural environment. The fitness status of urban adolescents predicted their PALs at follow-up. The differences between urban and rural adolescents with regard to the established changes in PALs and relationships between the predictors and PALs are explained by the characteristics of the living communities (lack of organized sports in rural areas), and the level of social distancing in the studied period and region/country. View Full-Text", "num_citations": "65\n", "authors": ["1055"]}
{"title": "Evaluation of basketball-specific agility: applicability of preplanned and nonplanned agility performances for differentiating playing positions and playing levels\n", "abstract": " Sekulic, D, Pehar, M, Krolo, A, Spasic, M, Uljevic, O, Calleja-González, J, and Sattler, T. Evaluation of basketball-specific agility: applicability of preplanned and nonplanned agility performances for differentiating playing positions and playing levels. J Strength Cond Res 31 (8): 2278–2288, 2017—The importance of agility in basketball is well known, but there is an evident lack of studies examining basketball-specific agility performances in high-level players. The aim of this study was to determine the reliability and discriminative validity of 1 standard agility test (test of preplanned agility [change-of-direction speed] over T course, T-TEST), and 4 newly developed basketball-specific agility tests, in defining playing positions and performance levels in basketball. The study comprised 110 high-level male basketball players (height: 194.92±8.09 cm; body mass: 89.33±10.91 kg; age: 21.58±3.92 years). The variables …", "num_citations": "64\n", "authors": ["1055"]}
{"title": "Substance use and misuse among professional ballet dancers\n", "abstract": " This study investigated substance use and misuse among 16 female and 9 male Croatian ballet professionals in 2008 using an original questionnaire. We analyzed social, personal, activity- and training-related, and educational factors, and criteria such as: binge alcohol drinking, cigarette smoking, appetite suppressant consumption, analgesic use, and actual and potential “doping” habits. Frequency tables and rank-order correlation were calculated. More than one third of the male dancers reported binge drinking, while 20% of the females smoked more than a box of cigarettes per day. Almost 25% of these dancers will use “doping” if it will ensure successful ballet performance, regardless of negative health consequences. In males, the risk of potential “doping” behavior increased with age. In females, education level was negatively related to cigarette smoking, but positively correlated to potential “doping” habits …", "num_citations": "61\n", "authors": ["1055"]}
{"title": "Dietary supplementation and doping-related factors in high-level sailing\n", "abstract": " Although dietary supplements (DSs) in sports are considered a natural need resulting from athletes’ increased physical demands, and although they are often consumed by athletes, data on DS usage in Olympic sailing are scarce. The aim of this study was to study the use of and attitudes towards DSs and doping problems in high-level competitive sailing. The sample consisted of 44 high-level sailing athletes (5 of whom were female; total mean age 24.13 ± 6.67 years) and 34 coaches (1 of whom was female; total mean age 37.01 ± 11.70). An extensive, self-administered questionnaire of substance use was used, and the subjects were asked about sociodemographic data, sport-related factors, DS-related factors (i.e., usage of and knowledge about DSs, sources of information), and doping-related factors. The Kruskal-Wallis ANOVA was used to determine the differences in group characteristics, and Spearman’s rank order correlation and a logistic regression analysis were used to define the relationships between the studied variables. DS usage is relatively high. More than 77% of athletes consume DSs, and 38% do so on a regular basis (daily). The athletes place a high degree of trust in their coaches and/or physicians regarding DSs and doping. The most important reason for not consuming DSs is the opinion that DSs are useless and a lack of knowledge about DSs. The likelihood of doping is low, and one-third of the subjects believe that doping occurs in sailing (no significant differences between athletes and coaches). The logistic regression found crew number (i.e., single vs. double crew) to be the single significant predictor of DS usage …", "num_citations": "60\n", "authors": ["1055"]}
{"title": "Plyometric training improves sprinting, jumping and throwing capacities of high level female volleyball players better than skill-based conditioning\n", "abstract": " There is an evident lack of studies on the effectiveness of plyometric-and skill-based-conditioning in volleyball. This study aimed to evaluate effects of 12-week plyometric-and volleyball-skill-based training on specific conditioning abilities in female volleyball players. The sample included 41 high-level female volleyball players (21.8±2.1 years of age; 1.76±0.06 cm; 60.8±7.0 kg), who participated in plyometric-(n= 21), or skill-based-conditioning-program (n= 20). Both programs were performed twice per week. Participants were tested on body-height, body-mass (BM), countermovement jump (CMJ), standing broad jump (SBJ), medicine ball throw,(MBT) and 20-m sprint (S20M). All tests were assessed at the study baseline (pre-) and at the end of the 12-week programs (post-testing). Two-way ANOVA for repeated measurements showed significant (p< 0.05)“Group x Time” effects for all variables but body-height …", "num_citations": "58\n", "authors": ["1055"]}
{"title": "Can we consider religiousness as a protective factor against doping behavior in sport?\n", "abstract": " Religiousness is rarely studied in relation to doping behaviors in sport. In this study, we sampled 27 weightlifting/powerlifting athletes from Bosnia and Herzegovina. Using the originally developed questionnaire and by means of Spearman’s correlation, we interpreted data and discussed relationships between (a) social, religious, sport, and educational factors, and (b) substance use criteria, including cigarettes, alcohol, analgesics, nutritional supplementation, and doping behaviors. In conclusion, we found (1) that religiousness can be considered as a potential protective factor against doping, but also (2) that religious subjects tend to deny and underestimate the doping behaviors in their sport. Both of these findings should be extensively studied in future investigations.", "num_citations": "57\n", "authors": ["1055"]}
{"title": "Prospective analysis of levels and correlates of physical activity during COVID-19 pandemic and imposed rules of social distancing; gender specific study among adolescents from …\n", "abstract": " Background: Due to the COVID-19 pandemic, global authorities have imposed rules of social distancing that directly influence overall physical activity in populations. The aim of this study was to evaluate the trends of changes in physical-activity levels (PALs) in adolescents and factors that may be associated with PALs among the studied boys and girls. Methods: Participants in this prospective study comprised 388 adolescents (126 females; mean age: 16.4 ± 1.9 years) from southern Croatia who were tested at a baseline (before the imposed rules of social distancing) and at a follow-up measurement (three weeks after the initiation). Baseline testing included anthropometric variables, variables of fitness status (done at the beginning of the school year), and PALs. At the follow-up, participants were tested on PALs. PALs were evaluated over an online platform using the Physical Activity Questionnaire for Adolescents. Results: A significant decrease of PALs was evidenced for the total sample (t-test = 3.46, p < 0.001), which was primarily influenced by a significant decrease of PALs in boys (t-test = 5.15, p < 0.001). The fitness status (jumping capacity, abdominal strength, aerobic endurance, and anaerobic endurance) was systematically positively correlated with PALs at the baseline and follow-up among boys and girls, with the most evident association between aerobic and anaerobic endurance capacities and PALs. Correlations between anthropometric and fitness variables with changes in physical activity (e.g., the difference between baseline and follow-up PALs) were negligible. Conclusions: Differences in PAL changes between genders were …", "num_citations": "56\n", "authors": ["1055"]}
{"title": "An examination of the ethnicity-specific prevalence of and factors associated with substance use and misuse: Cross-sectional analysis of Croatian and Bosniak adolescents in …\n", "abstract": " Substance use and misuse (SUM) in adolescence is a significant public health problem and the extent to which adolescents exhibit SUM behaviors differs across ethnicity. This study aimed to explore the ethnicity-specific and gender-specific associations among sports factors, familial factors, and personal satisfaction with physical appearance (ie, covariates) and SUM in a sample of adolescents from Federation of Bosnia and Herzegovina. In this cross-sectional study the participants were 1742 adolescents (17–18 years of age) from Bosnia and Herzegovina who were in their last year of high school education (high school seniors). The sample comprised 772 Croatian (558 females) and 970 Bosniak (485 females) adolescents. Variables were collected using a previously developed and validated questionnaire that included questions on SUM (alcohol drinking, cigarette smoking, and consumption of other drugs), sport factors, parental education, socioeconomic status, and satisfaction with physical appearance and body weight. The consumption of cigarettes remains high (37% of adolescents smoke cigarettes), with a higher prevalence among Croatians. Harmful drinking is also alarming (evidenced in 28.4% of adolescents). The consumption of illicit drugs remains low with 5.7% of adolescents who consume drugs, with a higher prevalence among Bosniaks. A higher likelihood of engaging in SUM is found among children who quit sports (for smoking and drinking), boys who perceive themselves to be good looking (for smoking), and girls who are not satisfied with their body weight (for smoking). Higher maternal education is systematically found to …", "num_citations": "56\n", "authors": ["1055"]}
{"title": "Sport nutrition and doping in tennis: An analysis of athletes’ attitudes and knowledge\n", "abstract": " Nutrition and doping issues are rarely studied in the sport of tennis. The aims of this investigation were to determine knowledge on doping (KD) and knowledge on sport nutrition (KSN), and corresponding socio-demographic-, sport-, and sport-nutrition-and doping-factors among an international sample of high-level tennis players of both sexes (43 females; 22 years old on average). In the first phase of the investigation, the KSN and KD questionnaires were studied for their reliability and validity. The consumption of NS is found to be very high, with almost of all the females and 80% of the males using NS at least occasionally. The athletes showed a low tendency regarding future doping usage, although most of them are convinced that doping does exist in tennis. Since athletes declared that their coaches are their main source of information about NS and doping, future studies should investigate what coaches …", "num_citations": "56\n", "authors": ["1055"]}
{"title": "Is agility related to strength qualities?--Analysis in latent space.\n", "abstract": " In this study we examined an influence of leg extensor strength qualities on agility performance in a latent space. Male physical education students (N= 168) were tested with three standard agility performance tests (lateral stepping, 20-yard shuttle run, and slalom run). Nine measures of leg extensor strength qualities including explosive strength, elastic strength, and maximal strength, were also assessed. As expected, factor analysis of all tests revealed four relatively independent factors: explosive strength, elastic strength, agility, and maximal strength. All three extracted strength factors were included into a regression analysis as predictors to evaluate their influence of the agility factor (ie criterion). Although the regression analysis revealed significant multiple correlation between predictors and the criterion (R= 0.41; p< 0.001), the amount of explained variance of agility performance by the strength factors was …", "num_citations": "56\n", "authors": ["1055"]}
{"title": "Importance of reactive agility and change of direction speed in differentiating performance levels in junior soccer players: Reliability and validity of newly developed soccer …\n", "abstract": " Agility is a significant determinant of success in soccer; however, studies have rarely presented and evaluated soccer-specific tests of reactive agility (S_RAG) and non-reactive agility (change of direction speed - S_CODS) or their applicability in this sport. The aim of this study was to define the reliability and validity of newly developed tests of the S_RAG and S_CODS to discriminate between the performance levels of junior soccer players. The study consisted of 20 players who were involved at the highest national competitive rank (all males; age: 17.0 ± 0.9 years), divided into three playing positions (defenders, midfielders, and forwards) and two performance levels (U17 and U19). Variables included body mass, body height, body fat percentage, 20-m sprint, squat jump, countermovement jump, reactive-strength-index, unilateral jump, 1RM-back-squat, S_CODS, and three protocols of S_RAG. The reliabilities of the S_RAG and S_CODS were appropriate to high (ICC: 0.70 to 0.92), with the strongest reliability evidenced for the S_CODS. The S_CODS and S_RAG shared 25-40% of the common variance. Playing positions significantly differed in body mass (large effect-size differences [ES]; midfielders were lightest) and 1RM-back-squat (large ES; lowest results in midfielders). The performance levels significantly differed in age and experience in soccer; U19 achieved better results in the S_CODS (t-test: 3.61, p < 0.05, large ES) and two S_RAG protocols (t-test: 2.14 and 2.41, p < 0.05, moderate ES). Newly developed tests of soccer-specific agility are applicable to differentiateU17 and U19 players. Coaches who work with young soccer athletes …", "num_citations": "55\n", "authors": ["1055"]}
{"title": "Modeling the influence of body size on weightlifting and powerlifting performance\n", "abstract": " The purpose of this study was to examine 1) if lifting performance in both the weightlifting (WL) and powerlifting", "num_citations": "55\n", "authors": ["1055"]}
{"title": "Sport nutrition and doping factors in swimming; parallel analysis among athletes and coaches\n", "abstract": " The sport nutrition and doping are known to be important issues in sports, but there is evident lack of studies which investigated those issues in swimming, especially with regard to parallel analysis of coaches and athletes. The first aim of this study was to compare knowledge of swimming coaches and their athletes about nutrition and doping. Also, we have identified interrelationships between studied sociodemographic-, sport-; nutrition-and doping-related-factors. The sample of subjects comprised 55 athletes (20.3±2.2 years of age; 24 females) and 22 coaches (mean age 36.5±7.8 years; 4 females) from Croatia (98% of respondents). In the first phase of the investigation we have validated specific questionnaires", "num_citations": "51\n", "authors": ["1055"]}
{"title": "Substance use and misuse among Slovenian table tennis players\n", "abstract": " Substance use and misuse (SU&M) is regularly studied in sports, but we have found no such data for table tennis. We have studied SU&M in athletes competing at the Slovenian Nationals 2008–2009 (responding rate was 100%%; 50 males and 29 females; aged 18 years or older). The anonymous questionnaire for studying SU&M and corresponding educational, socio-demographic, and sport factors was used. More than 90%% of all the athletes included in our study do not rely on coaches’ and/or physicians’ opinion regarding nutritional supplements and doping. Chi-square test revealed higher prevalence of binge drinking, cigarette smoking, and potential doping behavior in males. In both genders, with the advancement of the sport status, the probability for potential doping behavior increases. In conclusion, we strongly suggest permanent SU&M educational programs for table tennis athletes as well as for their …", "num_citations": "51\n", "authors": ["1055"]}
{"title": "Evaluation of different jumping tests in defining position-specific and performance-level differences in high level basketball players\n", "abstract": " The importance of jumping ability in basketball is well known, but there is an evident lack of studies that have examined different jumping testing protocols in basketball players at advanced levels. The aim of this study was to assess the applicability of different tests of jumping capacity in identifying differences between (i) playing position and (ii) competitive levels of professional players. Participants were 110 male professional basketball players (height: 194.92±8.09 cm; body mass: 89.33±10.91 kg; 21.58±3.92 years of age; Guards, 49; Forwards, 22; Centres, 39) who competed in the first (n= 58) and second division (n= 52). The variables included anthropometrics and jumping test performance. Jumping performances were evaluated by the standing broad jump (SBJ), countermovement jump (CMJ), reactive strength index (RSI), repeated reactive strength ability (RRSA) and four running vertical jumps: maximal …", "num_citations": "49\n", "authors": ["1055"]}
{"title": "Substance use and misuse and potential doping behaviour in rugby union players\n", "abstract": " The aims of this investigation were to compile evidence on substance-use-and-misuse (SUM) and to identify factors related to potential-doping-behaviour (PDB) in rugby union. The subjects were 105 rugby athletes (all males; 23.4 ± 4.1 years; 99% respondents). The variables included socio-demographic factors, SUM-data, sport-factors, knowledge-on-doping (KD), and PDB. Data showed high alcohol consumption, with more than 30% of the athletes binge drinking at least once per week. Approximately 52% of the subjects used dietary-supplementation (DS) and 23% reported PDB, whereas 55% believed that doping is present in rugby. Forward conditional logistic regression revealed that less rugby experience (OR:1.286; 95%CI:1.058–1.563; p < 0.05), less smoking (OR:2.034; 95%CI:1.100–3.760; p < 0.05), higher DS usage (OR:5.543; 95%CI:1.666–18.444; p < 0.01), and a stronger belief that doping is present …", "num_citations": "49\n", "authors": ["1055"]}
{"title": "General anthropometric and specific physical fitness profile of high-level junior water polo players\n", "abstract": " The aim of this study was to investigate the status and playing position differences in anthropometric measures and specific physical fitness in high-level junior water polo players.", "num_citations": "47\n", "authors": ["1055"]}
{"title": "The development of a New Stop'n’go reactive-agility test\n", "abstract": " Sekulic, D, Krolo, A, Spasic, M, Uljevic, O, and Peric, M. The development of a new stop'n'go reactive-agility test. J Strength Cond Res 28 (11): 3306–3312, 2014—The main objective of this study was to evaluate the reliability and the validity of a newly constructed reactive-agility test that can be used to define the reactive-agility performance in sports that employ repeated scenarios of “stop'n'go” agility. Measuring is done by original hardware based on the ATMEL microcontroller AT89C51RE2. A total of 36 college-aged male athletes (age, 22.1±2.4 years; body height, 182.45±5.19 cm; body mass, 80.67±7.69 kg) and 21 college-aged female athletes (age, 21.4±2.5 years; body height, 171.45±6.81 cm; body mass, 61.95±6.70 kg) were evaluated for a stop'n'go reactive-agility test (SNG-RAT), stop'n'go change of direction speed (SNG-CODS), countermovement jump, and anthropometrics. The reliability analyses …", "num_citations": "46\n", "authors": ["1055"]}
{"title": "Analysis of the association between running performance and game performance indicators in professional soccer players\n", "abstract": " Running performance (RP) and game performance indicators (GPI) are important determinants of success in soccer (football), but there is an evident lack of knowledge about the possible associations between RP and GPI. This study aimed to identify associations between RP and GPI in professional soccer players and to compare RP and GPI among soccer playing positions. One hundred one match performances were observed over the course of half of a season at the highest level of national competition in Croatia. Players (mean±SD, age: 23.85±2.88 years; body height: 183.05±8.88 cm; body mass: 78.69±7.17 kg) were classified into five playing positions (central defenders (n= 26), full-backs (n= 24), central midfielders (n= 33), wide midfielders (n= 10), and forwards (n= 8). RP, as measured by global positioning system, included the total distance covered, distance covered in five speed categories (walking, jogging, running, high-speed running, and maximal sprinting), total number of accelerations, number of high-intensity accelerations, total number of decelerations, and number of high-intensity decelerations. The GPI were collected by the position-specific performance statistics index (InStat index). The average total distance was 10,298.4±928.7 m, with central defenders having the shortest and central midfielders having the greatest covered distances. The running (r= 0.419, p= 0.03) and high-intensity accelerations (r= 0.493, p= 0.01) were correlated with the InStat index for central defenders. The number of decelerations of full-backs (r=− 0.43, p= 0.04) and the distance covered during sprinting of forwards (r= 0.80, p= 0.02) were …", "num_citations": "45\n", "authors": ["1055"]}
{"title": "A retrospective survey on injuries in Croatian football/soccer referees\n", "abstract": " Injury among soccer referees is rarely studied, especially with regard to differences in the quality level of the refereeing. Additionally, we have found no study that has reported injury occurrence during official physical fitness testing for soccer referees. The aim of this study was to investigate the frequency, type and consequences of match-related and fitness-testing related injuries among soccer referees of different competitive levels. We studied 342 soccer referees (all males; mean age 32.9 ± 5.02 years). The study was retrospective, and a self-administered questionnaire was used. In the first phase of the study, the questionnaire was tested for its reliability and applicability. The questionnaire included morphological/anthropometric data, refereeing variables, and musculoskeletal disorders together with the consequences. The sample comprised 157 main referees (MR; mean age 31.4 ± 4.9 years) and 185 assistant referees (AR; mean age 34.1 ± 5.1 years) divided into: international level (Union of European Football Associations-UEFA) referees (N = 18; 6 MRs; 12 ARs) ; 1st (N = 78; 31 MRs; 47 ARs), 2nd (N = 91; 45 MRs; 46 ARs); or 3rd national level referees (N = 155; 75 MRs; 80 ARs). In total, 29% (95%CI: 0.23–0.37) of the MRs and 30% (95%CI: 0.22–0.36) of the ARs had experienced an injury during the previous year, while 13% (95%CI: 0.05–0.14) of the MRs, and 19% (95%CI: 0.14–0.25) of the ARs suffered from an injury that occurred during fitness testing. There was an obvious increase in injury severity as the refereeing advanced at the national level, but the UEFA referees were the least injured of all referees. The …", "num_citations": "45\n", "authors": ["1055"]}
{"title": "Substance use in dance sport\n", "abstract": " Very few studies have been conducted on substance use (SU) in performing sports. In the current study, we analyzed SU and factors related to SU in dance sport. The sample subjects consisted of 21 female and 22 male dancers, all >19 years of age, who were given an anonymous questionnaire developed for this study. The questionnaire consisted of questions about 1) social, cultural, educational, and sport-related factors, and 2) SU, including alcohol, opiates, cigarettes, and doping consumption, and personal opinions. The chi-square test was used to define the differences between male and female dancers. To identify the relationships between the studied factors and SU, the Pearson's correlation coefficient was calculated separately in males and females. We found a relatively low incidence of cigarette smoking (p < 0.05). Based on these results, we recommend educational programs regarding SU, especially …", "num_citations": "45\n", "authors": ["1055"]}
{"title": "Anthropological determinants of success in young judoists\n", "abstract": " There is an evident lack of experimental studies dealing with the anthropological determinants of success in judo, especially concerning young athletes. In this paper we have attempted to establish some of the anthropological factors potentially related to judo competition achievement in 15–16 year old athletes. A set of 14 anthropometric and 12 motor-endurance variables was tested on the best young judoists in Croatia (all males, N= 34). All the subjects had competed on the National Championship (NC), and the criterion was defined according to their final NC achievement. Factor analysis and discriminant canonical analysis (DISCRA) were calculated separately on the motor-endurance and anthropometric status variables. DISCRA showed the successful judoists as dominant in strength and endurance status. In contrast, there were no significant differences in the anthropometric dimensions regarding any differentiation between the more and less successful athletes. Possible explanations are discussed.", "num_citations": "45\n", "authors": ["1055"]}
{"title": "Religiousness as a protective factor for substance use in dance sport\n", "abstract": " Although religiousness is found to be a significant protective factor in substance use, there is an evidential lack of studies of such in athletes. The aim of the study was to identify the predictive value of the religiousness and some social, educational, and sport factors on substance use in 43 sport dancers. An originally developed questionnaire for studying substance use and precipitation factors was applied. The Chi-square showed male dancers as more religious than females. Using the Spearman’s correlation, religiousness was found to be a significant protective factor in cigarette smoking, sport nutritional supplementation, and the likelihood of doping. Data were interpreted emphasizing the previous findings from the literature.", "num_citations": "43\n", "authors": ["1055"]}
{"title": "Agility performance in high-level junior basketball players: the predictive value of anthropometrics and power qualities.\n", "abstract": " In basketball, anthropometric status is an important factor when identifying and selecting talents, while agility is one of the most vital motor performances. The aim of this investigation was to evaluate the influence of anthropometric variables and power capacities on different preplanned agility performances. The participants were 92 high-level, junior-age basketball players (16-17 years of age; 187.6±8.72 cm in body height, 78.40±12.26 kg in body mass), randomly divided into a validation and cross-validation subsample. The predictors set consisted of 16 anthropometric variables, three tests of power-capacities (Sargent-jump, broad-jump and medicine-ball-throw) as predictors. The criteria were three tests of agility: a T-Shape-Test; a Zig-Zag-Test, and a test of running with a 180-degree turn (T180). Forward stepwise multiple regressions were calculated for validation subsamples and then cross-validated. Cross validation included correlations between observed and predicted scores, dependent samples t-test between predicted and observed scores; and Bland Altman graphics. Analysis of the variance identified centres being advanced in most of the anthropometric indices, and medicine-ball-throw (all at P< 0.05); with no significant between-position-differences for other studied motor performances. Multiple regression models originally calculated for the validation subsample were then cross-validated, and confirmed for Zig-zag-Test (R of 0.71 and 0.72 for the validation and cross-validation subsample, respectively). Anthropometrics were not strongly related to agility performance, but leg length is found to be negatively associated with …", "num_citations": "42\n", "authors": ["1055"]}
{"title": "Judo training is more effective for fitness development than recreational sports for 7-year-old boys\n", "abstract": " In this article we compared the effects of 9 months of judo training (JT; N = 41) and recreational sports games training (SGT; N = 57) on the fitness development of 7-year-old boys. Both programs were performed three times per week. Apart from body height, body weight, and skinfold thickness (SUM2SF), changes in muscular and cardiovascular endurance, flexibility, speed, agility, and coordination were studied. Using the analysis of variance, we found no differences between the groups at study entry, but after 9 months the JT participants achieved significantly better results in the shuttle-run task to test agility, the sit-up test for abdominal muscle endurance, and the sit-and-reach test for flexibility. The JT group also maintained their SUM2SF over the 9-month period, whereas the SGT group showed a significant increase in SUM2SF. No differences were observed between the groups in coordination, flexibility of the …", "num_citations": "41\n", "authors": ["1055"]}
{"title": "Analysis of the association between motor and anthropometric variables with change of direction speed and reactive agility performance\n", "abstract": " There is an evident lack of studies examining the factors associated with reactive agility performances. The aim of this study was to evaluate the association between anthropometrics, body composition, jumping capacity, reactive strength, and balance with a stop-and-go change of direction speed (CODS) and reactive agility. The total sample comprised 39 male (body height: 182.95±5.19 cm; body mass: 80.66±7.69 kg) and 34 female (body height: 171.45±6.81 cm; body mass: 61.95±6.70 kg) college-level athletes (21.9±1.9 years of age). The variables included body height, body mass, the percentage of body fat (BF%), balance as measured by an overall-stability index, the countermovement jump (CMJ), a reactive-strength index (RSI), stop-and-go reactive agility, and stop-and-go CODS. To define the associations between motor and anthropometric variables with CODS and reactive agility, the participants were …", "num_citations": "40\n", "authors": ["1055"]}
{"title": "Does SAQ training improve the speed and flexibility of young soccer players? A randomized controlled trial\n", "abstract": " The aim of this study was to determine the effects of a 12 week speed, agility and quickness (SAQ) training program on speed and flexibility in young soccer players. One hundred and thirty-two soccer players were randomly assigned to experimental (EG; n = 66, mean ± SD: age: 18.5 ± 0.4 years (range 17–19 years); body mass: 71.30 ± 5.93 kg; stature: 177.2 ± 6.5 cm) and control groups (CG; n = 66, mean ± SD: age: 18.6 ± 0.6 years (range 17–19 years); body mass: 70.63 ± 4.87 kg; stature: 175.9 ± 5.7 cm). The experimental group performed SAQ training whilst the control group undertook straight-line sprint training matched for volume and duration. Sprint performance was assessed using 5 and 10 m sprints and a further test including maximal speed, a 20 m sprint. Flexibility was assessed using sit and reach, V-sit and reach, leg lift from supine position and lateral leg lift while lying on the side tests. Sprints over 5 …", "num_citations": "39\n", "authors": ["1055"]}
{"title": "Religiousness as a factor of hesitation against doping behavior in college-age athletes\n", "abstract": " Religiousness is rarely studied as protective factor against substance use and misuse in sport. Further, we have found no investigation where college-age athletes were sampled and studied accordingly. The aim of the present study was to identify gender-specific protective effects of the religiousness (measured by Santa Clara Questionnaire) and other social, educational, and sport variables as a potential factors of hesitation against doping behaviors in sport-science-students from Mostar, Bosnia, and Herzegovina (51 women and 111 men; age range, 18–26). The gender differences for the non-parametric variables were established by Kruskall–Wallis test, while for the parametric variables the t-test for independent samples was used. Multiple regression calculations revealed religiousness as the most significant predictor of the social, health, sport and legal factors of hesitation against doping behaviors in …", "num_citations": "39\n", "authors": ["1055"]}
{"title": "EMG analysis of muscle load during simulation of characteristic postures in dinghy sailing\n", "abstract": " AIM: The aim of this work was to establish the characteristic values of the particular electromyographic (EMG) indicators in the simulation of hiking in the laser-standard class in dinghy sailing. METHODS: Seven top-level competitors participated in the study (age: 21.1+/-2.5 years; height: 184.1+/-5.7 cm; weight: 78.4+/-3.7 kp). The 4 muscle groups analyzed were those which, according to expertise are exposed to the most strain during training and competition in all classes of dinghy sailing, as well as in the Olympic laser standard class (extensors of the lower leg, abdominal, lumbar and tibial muscles). A portable surface EMG apparatus was used for the recording of EMG signals. Digitized EMG data were full-wave rectified and smoothed. Their mean values during characteristic hiking positions (sitting--S, upright hiking--UH, leaning backwards hiking--LBH) were compared by means of repeated ANOVA measures …", "num_citations": "39\n", "authors": ["1055"]}
{"title": "Analysis of the association between isokinetic knee strength with offensive and defensive jumping capacity in high-level female volleyball athletes\n", "abstract": " ObjectivesIsokinetic-knee-strength was hypothesized to be an important factor related to jumping performance. However, studies examining this relation among elite female athletes and sport-specific jumps are lacking. This investigation determined the influence of isokinetic-knee flexor/extensor strength measures on spike-jump (offensive) and block-jump (defensive) performance among high-level female volleyball players.DesignCross-sectional laboratory study.MethodsEighty-two female volleyball athletes (age = 21.3 ± 3.8 years, height = 175.4 ± 6.76 cm, and weight = 68.29 ± 8.53 kg) volunteered to participate in this study. The studied variables included spike-jump and block-jump performance and a set of isokinetic tests to evaluate the eccentric and concentric strength capacities of the knee extensors (quadriceps – Q), and flexors (hamstring – H) for both legs. Both jumping tests showed high intra-session …", "num_citations": "38\n", "authors": ["1055"]}
{"title": "Substance use and misuse among 17-to 18-year-old Croatian adolescents: Correlation with scholastic variables and sport factors\n", "abstract": " Substance use and misuse (SUM) and the relation to physical activity/exercise/athletic participation (sport factors) and scholastic achievement are rarely studied in Croatia. The aim of this study was: (1) to investigate the SUM habits in Croatian adolescents (17–18 years of age, 254 males, and 218 females), and (2) to study potential gender-specific interrelationships between scholastic and sport factors in relation to SUM. The testing was done using an extensive, anonymous, self-administered questionnaire that consisted of scholastic variables, sport factors, and SUM data. Descriptive statistics, counts, and proportions were calculated. Gender differences were established using the Kruskal–Wallis test. Gender-specific correlations within and between studied variables were established using the Spearman's correlation. The incidence of smoking habits and alcohol consumption among Croatian adolescents was …", "num_citations": "38\n", "authors": ["1055"]}
{"title": "Doping attitudes and covariates of potential doping behaviour in high-level team-sport athletes; gender specific analysis\n", "abstract": " Team sports are rarely studied with regard to doping behaviour and doping-related factors regardless of their global popularity. This study aimed to investigate doping factors and covariates of potential doping behaviour in high-level team-sport athletes. The subjects were 457 high-performing, national-and international-level athletes (21.9±3.4 years of age; 179 females) involved in volleyball (n= 77), soccer (n= 163), basketball (n= 114) and handball (n= 103). Previously validated self-administered questionnaires aimed at evidencing sport factors, doping-related factors, knowledge on sport nutrition and doping, and attitudes to performance enhancement were used. The results indicated a higher doping likelihood in male athletes, with a significant gender difference for basketball and handball. In males, a higher doping likelihood is found for athletes who had achieved better results at junior-age level, those who …", "num_citations": "36\n", "authors": ["1055"]}
{"title": "Harmful alcohol drinking among adolescents: the influence of sport participation, religiosity, and parental factors\n", "abstract": " Studies that have investigated the potential protective/risk factors for alcohol drinking in Bosnia and Herzegovina and surrounding countries are lacking. The aim of this study was to examine the gender-specific protective/risk factors for harmful alcohol drinking among adolescents in Bosnia and Herzegovina. The study sample was composed of 1,015 17- to 18-year-old adolescents (426 boys and 589 girls). The logistic analysis predictors were as follows: parental monitoring, parents’ education, and sport factors. Among boys, individual sports participation, higher paternal education, and lower self-reported conflict with parents were protective factors against harmful drinking. Among girls, higher conflict with parents was the single significant risk factor for harmful alcohol drinking.", "num_citations": "36\n", "authors": ["1055"]}
{"title": "Sport-specific motor fitness tests in water polo: reliability, validity and playing position differences\n", "abstract": " Sport-specific motor fitness tests are not often examined in water polo. In this study we examined the reliability, factorial and discriminative validity of 10 water-polo-specific motor-fitness tests, namely: three tests of in-water jumps (thrusts), two characteristic swimming sprints (10 and 20 metres from the water start), three ball-throws (shoots), one test of passing precision (accuracy), and a test of the dynamometric force produced while using the eggbeater kick. The sample of subjects consisted of 54 young male water polo players (15 to 17 years of age; 1.86±0.07 m, and 83.1±9.9 kg). All tests were applied over three testing trials. Reliability analyses included Cronbach Alpha coefficients (CA), inter-item-correlations (IIR) and coefficients of the variation (CV), while an analysis of variance was used to define any systematic bias between the testing trials. All tests except the test of accuracy (precision) were found to be …", "num_citations": "35\n", "authors": ["1055"]}
{"title": "The reliability, validity and applicability of two sport-specific power tests in synchronized swimming\n", "abstract": " Sport-specific tests are rarely investigated in synchronized swimming (synchro). The aim of this research was to study the reliability and the validity of two sport-specific tests that are based on synchro elements, namely, the Barracuda thrust (“Barracuda”) and the Boost. The Barracuda is a move in which the swimmer begins in the back pike position (head down with the legs perpendicular to the surface of the water) and then moves the legs and hips rapidly upward, unrolling the body to obtain a maximal vertical position above the surface of the water. The Boost occurs when the swimmer rises rapidly out of the water, head first, to bring as much of the body as possible above the surface of the water. Both patterns are considered power moves and are therefore theoretically related to explosive strength. This study involved 22 female competitive synchro swimmers aged 16–18 years. The variables examined included …", "num_citations": "35\n", "authors": ["1055"]}
{"title": "Sleep duration and sleep quality are associated with physical activity in elderly people living in nursing homes\n", "abstract": " The main purpose of the study was to explore the associations of sleep duration and sleep quality with physical activity (PA). In this cross-sectional study, participants were 894 elderly individuals (mean age 80±3 years; 56.0% women) living in nursing homes. PA, sleep duration, and sleep quality (based on the Pittsburgh Sleep Quality Index (PSQI)) were self-reported. The associations of sleep duration and sleep quality with PA at the nursing home level were analyzed using generalized estimating equations with clustering. Participants reporting short sleep duration (< 6 h; OR= 0.45; 95% CI 0.25–0.80) were less likely to report sufficient PA, yet those reporting long sleep duration (> 9 h; OR= 2.61; 95% CI 1.35–5.02) and good sleep quality (< 5 points; OR= 1.59; 95% CI 1.19–2.12) were more likely to report sufficient PA. When sleep duration and sleep quality were entered into the same model, the same associations remained. This study shows that elderly individuals who report short sleep duration are less likely to meet PA guidelines, while those who report long sleep duration and good sleep quality are more likely to meet PA guidelines. Strategies aiming to improve sleep duration and sleep quality are warranted. View Full-Text", "num_citations": "34\n", "authors": ["1055"]}
{"title": "Disordered eating, amenorrhea, and substance use and misuse among professional ballet dancers: Preliminary analysis\n", "abstract": " Background: Substance use and misuse (SUM), eating disorders (ED) and consequent amenorrhea (AM) occur frequently in professional ballet dancing. The objective of this study has been to explore the prevalence and association between ED, AM and SUM in ballet. Material and Methods: The sample comprised 21 ballet dancers, 23.1±4.5 years old, members of the professional National Ballet Ensemble from Croatia. Variables were collected by questionnaires examining SUM, occurrence of amenorrhea, and corresponding ballet-specific and socio-demographic factors (Questionnaire on Substance Use–QSU) and the level of ED (Brief Eating Disorder in Athletes Questionnaire–BEDA-Q). Results: Smoking is prevalent in 40% of dancers (25% smoke on a daily basis), 36% often use analgesics, and 25% engage in binge drinking at least once a month. Smoking and binge drinking are less frequent in ballerinas with a higher academic level (r= 0.60 and r= 0.54 for binge drinking and smoking, respectively; p< 0.05). Alcohol drinking is higher among dancers who consume analgesics more often and those with a higher BEDA-Q score (r= 0.53 and r= 0.54 for analgesics and BEDA-Q, respectively; p< 0.05). Amenorrhea is more prevalent among those dancers with a higher BEDA-Q score. Women who consume nutritional supplements are less likely to use analgesics (Mann Whitney U test= 2.11; p< 0.05). Conclusions: Efforts seeking to prevent ED in ballet should target dancers who consume alcohol to a greater extent. Future studies should specifically explore the less frequent consumption of analgesics among dancers who consume nutritional …", "num_citations": "34\n", "authors": ["1055"]}
{"title": "Reliability, validity, and applicability of isolated and combined sport-specific tests of conditioning capacities in top-level junior water polo athletes\n", "abstract": " Uljevic, O, Esco, MR, and Sekulic, D. Reliability, validity and applicability of isolated and combined sport-specific tests of conditioning capacities in top-level junior water polo athletes. J Strength Cond Res 28 (6): 1595–1605, 2014—Standard testing procedures are of limited applicability in water sports, such as water polo. The aim of this investigation was to construct and validate methods for determining water polo-specific conditioning capacities. We constructed 4 combined-capacity tests that were designed to mimic real-game water polo performances: sprint swimming performance, shooting performance, jumping performance, and precision performance. In all cases, combined-capacity tests included a period of standardized exhaustion followed by the performance of the targeted quality (swimming, shooting, jumping, and precision). In the first part of the study, single-capacity tests (sprint swim, in-water jump …", "num_citations": "34\n", "authors": ["1055"]}
{"title": "Non linear relationships between anthropometric and motor-endurance variables\n", "abstract": " Nonlinear regressions are rare in anthropology. In this paper we have tried to identify the significance and the character of the linear and non-linear relations between some anthropometric measures and the motor-endurance status. All subjects (300 moderately physically active males, mean aged 24_3. 4 years) were measured for body weight, body", "num_citations": "34\n", "authors": ["1055"]}
{"title": "Prevalence and factors associated with substance use and misuse among Kosovar adolescents; cross sectional study of scholastic, familial-, and sports-related factors of influence\n", "abstract": " Adolescence is considered to be the most important period for the prevention of substance use and misuse (SUM). The aim of this study was to investigate the problem of SUM and to establish potentially important factors associated with SUM in Kosovar adolescents. Multi-stage simple random sampling was used to select participants. At the end of their high school education, 980 adolescents (623 females) ages 17 to 19 years old were enrolled in the study. The prevalence of smoking, alcohol consumption (measured by Alcohol Use Disorder Identification Test–AUDIT), and illegal drug use (dependent variables), as well as socio-demographic, scholastic, familial, and sports-related factors (independent variables), were assessed. Boys smoke cigarettes more often than girls with daily-smoking prevalence of 16% among boys and 9% among girls (OR= 1.85, 95%= CI 1.25–2.75). The prevalence of harmful drinking (ie, AUDIT scores of> 10) is found to be alarming (41% and 37% for boys and girls, respectively; OR= 1.13, 95% CI= 0.87–1.48), while 17% of boys and 9% of girls used illegal drugs (OR= 2.01, 95% CI= 1.35–2.95). The behavioral grade (observed as: excellent–average-poor) is the factor that was most significantly correlated with SUM both in boys and girls, with lower behavioral grades among those adolescents who consume substances. In girls, lower maternal education levels were associated with a decreased likelihood of SUM, whereas sports achievement was negatively associated with risky drinking. In boys, sports achievement decreased the likelihood of daily smoking. Information on the factors associated with SUM should be …", "num_citations": "32\n", "authors": ["1055"]}
{"title": "THE LEAPING PERFORMANCE OF 7-YEAR-OLD NOVICE RHYTHMIC GYMNASTS IS HIGHLY INFLUENCED BY THE CONDITION OF THEIR MOTOR ABILITIES.\n", "abstract": " The aim of this study was to establish the probable influence of the characteristic motor ability and skill factors on the jumping/leaping performance in a sample of 55 novice female gymnasts (mean age 7.1±0.3 years), who had participated in a year of training. The sample of variables consisted of 12 tests of the basic motor abilities and 9 RG (rhythmic gymnastics) specific leaping performance tests, in which 5 experienced RG-judges evaluated their performance. Canonical correlation analysis was utilized to establish the relations between the scores of the motor tests and the leaping/jumping performance marks. According to the linear correlation and canonical correlation results, coordination (coordination in rhythm, primarily) and strength (leg power, in the first place), contributed mostly to the performance evaluation marks assigned for the RG leaping elements (65% variance explained). Although being expected, the influence of flexibility on the leaping performance of novices in RG was not evident.", "num_citations": "30\n", "authors": ["1055"]}
{"title": "Pulmonary function in military divers: smoking habits and physical fitness training influence\n", "abstract": " Pulmonary function (PF) tests are procedures that measure the function of the lungs, revealing problems in breathing, and therefore are highly important in diving. In this article, we studied the PF in military divers and defined the differences between (A) males (n = 32) and females (n = 27), (B) male smokers and nonsmokers, and (C) female smokers and nonsmokers. PF was established by measuring: the large airway variables: inspiratory-vital capacity, forced-vital capacity, 1-second forced-expiratory volume, and 1-second forced-expiratory volume:forced-vital capacity ratio; and small airway variables: peak-expiratory flow, maximal-mid-expiratory flow, and maximal-expiratory flow after 50% and 75% of exhalation, all in absolute and relative (predicted for age and stature) values. The t test showed a significant (p = 0.05) difference between smokers and nonsmokers, but only in the relative inspiratory-vital …", "num_citations": "29\n", "authors": ["1055"]}
{"title": "Contextualizing Parental/Familial influence on physical activity in adolescents before and during COVID-19 pandemic: a prospective analysis\n", "abstract": " Parental and familial factors influence numerous aspects of adolescents’ lives, including their physical activity level (PAL). The purpose of this study was to evaluate the changes in PAL which occurred during the COVID-19 pandemic, and to evaluate influence of sociodemographic and parental/familial factors on PAL levels before and during pandemic in adolescents from Bosnia and Herzegovina. The sample included 688 adolescents (15–18 years of age; 322 females) who were tested on two occasions: in January 2020 (baseline; before the COVID-19 pandemic) and in April 2020 (follow-up; during the COVID-19 pandemic lockdown). Variables included PAL (measured by the Physical Activity Questionnaire for Adolescents–PAQ-A) as well as sociodemographic-, parental-, and familial factors. A significant decline in PALs was recorded between baseline and follow-up (t-test: 11.88, p< 0.001). Approximately 50% of adolescents underwent sufficient PAL at baseline, while only 24% of them were achieving sufficient PAL at the time of follow-up measurement. Paternal education was positively correlated (OR (95% CI): baseline: 6.63 (4.58–9.96), follow-up: 3.33 (1.19–7.01)), while familial conflict was negatively correlated (baseline: 0.72 (0.57–0.90), follow-up: 0.77 (0.60–0.99)) with PALs before and during the pandemic. This study highlights the importance of the parent–child relationship and parental/familiar support in promoting physical activity both during regular life and during crises and health challenging situations like the COVID-19 pandemic. View Full-Text", "num_citations": "28\n", "authors": ["1055"]}
{"title": "Navy recruits: fitness measuring, validation, and norming\n", "abstract": " During the standard Army Physical Fitness Test (APFT) used on Croatian Navy recruits (CNR), we found the standard APFT battery to be both excessively demanding and time-consuming. The aim of the present study was to validate alternate APFT tests (A-APFT) that would be appropriate for CNR. In the sample of 295 CNR (mean age, 23 ± 2.6 years), we applied the standard APFT (2-minute sit-ups and push-ups, and 2-milerun) and A-APFT (30-second sit-ups and push-ups, 1,500-meter run, and 2-minute squats). Using linear correlations and linear regression equations, we established validity of the AAPFT compared to the APFT. Thirty-second push-ups, but not 30-second sit-ups, can be considered as a valuable alternative to the same 2-minute test, while the 1500-meter run may be considered as a valid replacement of the 2-mile run. The modified standards for the A-APFT and some suggestions for the …", "num_citations": "28\n", "authors": ["1055"]}
{"title": "Non linear anthropometric predictors in swimming\n", "abstract": " In this paper we have tried to identify the significance and character of the linear and non-linear relations between", "num_citations": "27\n", "authors": ["1055"]}
{"title": "Analyzing the relationship between anthropometric and motor indices with basketball specific pre-planned and non-planned agility performances.\n", "abstract": " BACKGROUND: Although agility is an important quality in basketball, factors associated with basketball specific pre-planned-agility (change-of-direction-speed, CODS) and non-planned-agility (reactive agility, RA) are rarely investigated. The aim of this study was to evaluate relationship between anthropometric and motor indices with basketball-specific CODS and RA in male basketball players of high performance level. METHODS: We tested 88 high-level male basketball players (height: 194.62±8.09 cm; body mass: 89.13±10.81 kg; age: 21.12±3.47 years). The sample was randomly divided into validation (N.= 44) and cross-validation (N.= 44) subsamples. The study variables included: broad-jump, countermovement-jump, reactive-strength-index, visual-reaction-time, body height, body mass, and body fat percentage (predictors); as well as basketball-specific CODS and RA (criteria). Univariate associations were assessed by Pearson's correlation coefficients. Multivariate relationships between the predictors and the criteria were assessed with multiple regression analysis for the validation subsample, which was then cross-validated. RESULTS: The established multiple regression models were successfully cross-validated for CODS (R2= 0.40 and 0.36; P= 0.01) and RA (R2= 0.38 and 0.41; P= 0.01, for validation and cross-validation subsample, respectively). The broad-jump (ie, horizontal displacement) is important predictor of CODS (Beta=-0.41; P= 0.01); anthropometrics and body build are specifically associated with RA (Beta= 0.51,-0.61 and 0.41 for body height, body mass and body fat percentage, respectively; all P< 0.05), while reactive …", "num_citations": "26\n", "authors": ["1055"]}
{"title": "Predicting agility performance with other performance variables in pubescent boys: a multiple-regression approach\n", "abstract": " The goal was to investigate the influence of balance, jumping power, reactive-strength, speed, and morphological variables on five different agility performances in early pubescent boys (N = 71). The predictors included body height and mass, countermovement and broad jumps, overall stability index, 5 m sprint, and bilateral side jumps test of reactive strength. Forward stepwise regressions calculated on 36 randomly selected participants explained 47% of the variance in performance of the forward-backward running test, 50% of the 180° turn test, 55% of the 20 yd. shuttle test, 62% of the T-shaped course test, and 44% of the zig-zag test, with the bilateral side jumps as the single best predictor. Regression models were cross-validated using the second half of the sample (n = 35). Correlation between predicted and achieved scores did not provide statistically significant validation statistics for the continuous …", "num_citations": "26\n", "authors": ["1055"]}
{"title": "Supplementation with guanidinoacetic acid in women with chronic fatigue syndrome\n", "abstract": " A variety of dietary interventions has been used in the management of chronic fatigue syndrome (CFS), yet no therapeutic modality has demonstrated conclusive positive results in terms of effectiveness. The main aim of this study was to evaluate the effects of orally administered guanidinoacetic acid (GAA) on multidimensional fatigue inventory (MFI), musculoskeletal soreness, health-related quality of life, exercise performance, screening laboratory studies, and the occurrence of adverse events in women with CFS. Twenty-one women (age 39.3±8.8 years, weight 62.8±8.5 kg, height 169.5±5.8 cm) who fulfilled the 1994 Centers for Disease Control and Prevention criteria for CFS were randomized in a double-blind, cross-over design, from 1 September 2014 through 31 May 2015, to receive either GAA (2.4 grams per day) or placebo (cellulose) by oral administration for three months, with a two-month wash-out period. No effects of intervention were found for the primary efficacy outcome (MFI score for general fatigue), and musculoskeletal pain at rest and during activity. After three months of intervention, participants receiving GAA significantly increased muscular creatine levels compared with the placebo group (36.3% vs. 2.4%; p< 0.01). Furthermore, changes from baseline in muscular strength and aerobic power were significantly greater in the GAA group compared with placebo (p< 0.05). Results from this study indicated that supplemental GAA can positively affect creatine metabolism and work capacity in women with CFS, yet GAA had no effect on main clinical outcomes, such as general fatigue and musculoskeletal soreness. View Full-Text", "num_citations": "25\n", "authors": ["1055"]}
{"title": "Gender-specific analyses of the prevalence and factors associated with substance use and misuse among Bosniak adolescents\n", "abstract": " Ethnicity and religion are known to be important factors associated with substance use and misuse (SUM). Ethnic Bosniaks, Muslims by religion, are the third largest ethnic group in the territory of the former Yugoslavia, but no study has examined SUM patterns among them. The aim of this study was to explore the prevalence of SUM and to examine scholastic-, familial-and sport-factors associated with SUM in adolescent Bosniaks from Bosnia-and-Herzegovina. The sample comprised 970 17-to-18-year-old adolescents (48% boys). Testing was performed using an previously validated questionnaire investigating socio-demographic-factors, scholastic-variables, and sport-factors, cigarette smoking, alcohol drinking, simultaneous smoking and drinking (multiple SUM), and the consumption of other drugs. The 30% of boys and 32% of girls smoke (OR= 1.13; 95% CI= 0.86–1.49), 41% of boys and 27% of girls are defined as harmful alcohol drinkers (OR= 1.94; 95% CI= 1.48–2.54), multiple SUM is prevalent in 17% of boys and 15% of girls (OR= 1.11; 95% CI= 0.79–1.56), while the consumption of other drugs, including sedatives, is higher in girls (6% and 15% for boys and girls, respectively; OR= 2.98; 95% CI= 1.89–4.70). Scholastic achievement is negatively associated with SUM. SUM is more prevalent in those girls who report higher income, and boys who report a worse familial financial situation. The study revealed more negative than positive associations between sport participation and SUM, especially among girls. Results can help public health authorities to develop more effective prevention campaign against SUM in adolescence. View Full-Text", "num_citations": "25\n", "authors": ["1055"]}
{"title": "Postural control and balance in a cohort of healthy people living in Europe: An observational study\n", "abstract": " In the past 20 years, posturography has been widely used in the medical field. This observational study aimed to report the values derived from posturography of a wide set of healthy subjects from various European countries using a plantar pressure platform and a standardized method of measurement.", "num_citations": "24\n", "authors": ["1055"]}
{"title": "Complex interaction of religiousness with other factors in relation to substance use and misuse among female athletes\n", "abstract": " Strength of religious faith (SRF) is rarely studied as a protective factor against substance use and misuse in sports. Herein, we studied the potential buffering effect of the complex socio-educational, sports, and religiousness factors in the protection against substance use and misuse, including cigarettes, analgesics, appetite suppressants, potential doping behavior, and binge drinking. The sample of subjects included 40 high-class female athletes (22–26 years of age). Using a strictly anonymous questionnaire, we investigated different social, educational, and sports factors (including SRF measured by the Santa Clara Strength of Religious Faith Questionnaire) in relation to substance use and misuse. Following the calculation of simple correlations, multiple regression analysis revealed that in combination with low sports experience, SRF has a significant buffering effect against binge alcohol drinking and …", "num_citations": "24\n", "authors": ["1055"]}
{"title": "Body physique and prior training experience as determinants of SEFIP score for university dancers\n", "abstract": " The Self-Estimated Functional Inability because of Pain (SEFIP) questionnaire is a simple tool used to define the pain status in different body regions of performers in aesthetic sports. In this study we revalidated the SEFIP in a sample of nonprofessional female university dancers (n = 45; mean age, 22.3 yrs). The dancers were divided into two groups according to their previous experience in dance and aesthetic-based sports: experienced (n = 24) and nonexperienced (n = 21). SEFIP was measured before and after the 6-week dance and aesthetic-based training program. Morphologic variables were measured at study entry and included body weight, height, body mass index (BMI), calf circumference, sum of two skinfolds, and percent body fat. We analyzed 1) the differences between experienced and nonexperienced dancers in all variables, 2) pre- and post-training differences in SEFIP, 3) pre- and post-training …", "num_citations": "23\n", "authors": ["1055"]}
{"title": "Changes in motor and morphological measures of young women induced by the HI-LO and Step aerobic dance programs\n", "abstract": " In previous studies a number of authors have already demonstrated the positive changes in certain dimensions of the anthropological status of female aerobic dancers induced by various treatments of modern aerobic dance programmes. Changes in motor space have been, however, rarely investigated. The authors have attempted in the present paper to define the potential differential training effects of the step (N= 24) and hi-lo (N= 23) aerobic dance programmes and to analyse the changes in the morphological (variables assessing voluminosity of the body and skinfold thickness) and motor (coordination, flexibility, movement frequency) measures of college-aged female participants. The entire programme consisted of a total of 25 separate aerobics training sessions (three times a week; each session of 60 min). Each session encompassed cardio-section routines, which consisted of the experimental aerobic dance programmes (35 min), strength-developing exercises (15 min) and stretching exercises (10 min). The results, obtained by means of ANOVA and discriminant analysis, suggest both programmes resulted in reduced skinfold measures and in improved measures of flexibility, coordination in rhythm and, to a lesser extent, measures of movement frequency. No differential influence of the two programmes of aerobic dance was confirmed.", "num_citations": "23\n", "authors": ["1055"]}
{"title": "Agility testing in youth football (soccer) players; evaluating reliability, validity, and correlates of newly developed testing protocols\n", "abstract": " Reactive agility (RAG) and change of direction speed (CODS) are important determinants of success in football (soccer), but there is an evident lack of information on reliable and valid football-specific testing procedures which will be applicable in defining sport-specific RAG and CODS in youth players. This study evaluated reliability and construct validity of newly developed tests of football-specific RAG (FS_RAG) and CODS (FS_CODS), which involved the ball kicking football technique. Additionally, factors associated with FS_RAG and FS_CODS were evaluated. The participants were youth football players (n= 59; age: 13.40±1.25 years) divided according to their age into U13 (11–12 years of age; n= 29), and U15 (13–14 years of age; n= 30) categories. Additionally, performance levels (starters [first-team] vs. non-starters [substitutes]) were observed in each age category. The dependent variables were newly developed FS_RAG and FS_CODS tests. The independent variables were sprinting capacities over 10 and 20 meters (S10M, S20M), countermovement jump (CMJ), the reactive strength index (RSI), and a generic CODS test of 20 yards (20Y). The newly developed FS_CODS and FS_RAG were observed as dependent variables. Results showed appropriate intra-testing and inter-testing reliability of the FS_RAG and FS_CODS, with somewhat better reliability of the FS_CODS (ICC= 0.82 and 0.79, respectively). Additionally, better reliability was evidenced in U15 than in U13 (ICC: 0.82–0.85, and 0.78-0.80 for U15 and U13, respectively). Independent samples t-test indicated significant differences between U13 and U15 in S10 (t-test: 3.57, p …", "num_citations": "22\n", "authors": ["1055"]}
{"title": "The association between body-built and injury occurrence in pre-professional ballet dancers-Separated analysis for the injured body-locations\n", "abstract": " Objectives: This study has aimed at identifying prevalence of injury-occurrence in 24 pre-professional-ballet-dancers (females, 16–18 years of age), and identifying the associations between the body-built and prevalence of injuries. Material and Methods: The sample of variables included: body mass, body height, and 3 somatotype characteristics (mesomorph, ectomorph and endomorph) and data on injuries over the preceding year. Results: Dancers were mostly ectomorphic-mesomorph (endomorphy: 2.6±0.54, mesomorphy: 3.99±0.77, ectomorphy: 3.23±0.54). The most commonly injured locations were the foot (17% of all injuries) and ankle (17%). Majority of the injuries occurred while practising but 37% of hip-injuries occurred while performing. Ankle-injuries resulted in longest absence from ballet. Endomorphy was related to ankle-injury (odds ratio (OR)= 1.9, 95% confidence interval (CI): 1.4–2.3), ectomorphy to foot injury (OR= 1.7, 95% CI: 1.1–2.9), and body-mass to injury to the toes (OR= 1.7, 95% CI: 1.4–3.1). Conclusions: The results of this study allow for recognizing those dancers who are particularly vulnerable to injuries of certain body location. A more profound analysis of the possible mechanisms that lead to hip-injury during performance is needed. Int J Occup Med Environ Health 2017; 30 (1): 151–159", "num_citations": "22\n", "authors": ["1055"]}
{"title": "The importance of fundamental motor skills in identifying differences in performance levels of U10 soccer players\n", "abstract": " This study examined the differences in fundamental motor skills (FMSs) and specific conditioning capacities (SCCs) between a coach’s classification of first team (FT) and second team (ST) U10 soccer players and examined the most important qualities based on how the coach differentiates them. The FT (n= 12; M age= 9.72±0.41) and ST (n= 11; M age= 9.57±0.41) soccer players were assessed using the Test of Gross Motor Development-2, standing long jump, sit and reach, diverse sprints, and the 20 m multistage fitness test (MSFT). The coach’s subjective evaluation of players was obtained using a questionnaire. No significant differences existed between the FT and ST in any variables (p> 0.05). However, large and moderate effect sizes were present in favour of the FT group in locomotor skills (d= 0.82 (0.08, 1.51)), gross motor quotient (d= 0.73 (0.00, 1.41)), height (d= 0.61 (− 0.12, 1.29)), MSFT (d= 0.58 (− 0.14, 1.25)), and maximum oxygen uptake (VO 2max)(d= 0.55 (− 0.17, 1.22)). Furthermore, the coach perceived the FT group as having greater technical and tactical qualities relative to ST players. This suggests that it might be more relevant for players of this age to develop good FMS connected to technical skills, before focusing on SCC. Therefore, it might be beneficial for soccer coaches to emphasize the development of FMSs due to their potential to identify talented young soccer players and because they underpin the technical soccer skills that are required for future soccer success. View Full-Text", "num_citations": "21\n", "authors": ["1055"]}
{"title": "The effects of 3-month skill-based and plyometric conditioning on fitness parameters in junior female volleyball players\n", "abstract": " Purpose: This study compared the effects of skill-based and plyometric conditioning (both performed in addition to regular volleyball training twice a week for 12 wk) on fitness parameters in female junior volleyball players. Methods: The participants [n= 47; age: 16.6 (0.6) y; mass: 59.4 (8.1) kg; height: 175.1 (3.0) cm] were randomized into a plyometric (n= 13), a skill-based (n= 17), and a control (n= 17) groups. The variables included body height, body mass, calf girth, calf skinfold, corrected calf girth, countermovement jump, 20-m-sprint, medicine ball toss, and sit-and-reach test. Results: Two-way analysis of variance (time× group) effects for time were significant (P<. 05) for all variables except body mass. Significant group× time interactions were observed for calf skinfold [η2=. 14; medium effect size (ES)], 20-m sprint (η2=. 09; small ES), countermovement jump (η2=. 29; large ES), medicine ball (η2=. 58; large ES …", "num_citations": "21\n", "authors": ["1055"]}
{"title": "Field-based performance tests are related to body fat percentage and fat-free mass, but not body mass index, in youth soccer players\n", "abstract": " The primary aim of this study was to determine the association between body composition and performance outcomes in youth soccer players. Twenty-five competitive male youth soccer players (age= 13.7±0.8 years, height= 167.4±9.7 cm, weight= 57.6±12.1 kg) volunteered to participate in this study. Height and weight were used to calculate body mass index (BMI). Body fat percentage (BF%) and fat-free mass (FFM) were determined with dual-energy X-ray absorptiometry. Each athlete performed the Pacer test, vertical jump, and t-test drill. Participants were predominantly normal weight (20.4±2.7 kg· m− 2). The body composition results were 20.3±4.9% for BF% and 46.5±8.7 kg for FFM. The results of the performance tests indicated a mean±standard deviation (SD) of 1418±332 m for Pacer, 57.2±7.4 cm for vertical jump, 11.6±0.7 s for t-test. Body mass index was not associated with any performance measure (r= 0.02 to− 0.21, all p> 0.05). Body fat percentage was associated with the Pacer, vertical jump, and t-test (r=− 0.62,− 0.57, 0.61, respectively; all p< 0.01) and remained after accounting for BMI. Fat-free mass was only significantly related to t-test (r=− 0.43, p< 0.01). However, after controlling for BMI, FFM was related to all three performance tests. Body fat percentage and FFM are associated with performance in youth soccer players, with stronger relationships reported in the former metric. The findings highlight the need for accurate body composition measurements as part of an assessment battery in young athletes. View Full-Text", "num_citations": "20\n", "authors": ["1055"]}
{"title": "Examination of the community-specific prevalence of and factors associated with substance use and misuse among Rural and Urban adolescents: A cross-sectional analysis in Bosnia …\n", "abstract": " Objective The community of residence (ie, urban vs rural) is one of the known factors of influence on substance use and misuse (SUM). The aim of this study was to explore the community-specific prevalence of SUM and the associations that exist between scholastic, familial, sports and sociodemographic factors with SUM in adolescents from Bosnia and Herzegovina.Methods In this cross-sectional study, which was completed between November and December 2014, the participants were 957 adolescents (aged 17 to 18 years) from Bosnia and Herzegovina (485; 50.6% females). The independent variables were sociodemographic, academic, sport and familial factors. The dependent variables consisted of questions on cigarette smoking and alcohol consumption. We have calculated differences between groups of participants (gender, community), while the logistic regressions were applied to define associations …", "num_citations": "20\n", "authors": ["1055"]}
{"title": "Cigarette smoking among 17–18 year old adolescents—prevalence and association with sociodemographic, familial, sport, and scholastic factors\n", "abstract": " Background: Though adolescence is recognised as a critical period for smoking prevention, there is a lack of research focused on this issue in Kosovo. The aim of this study has been to examine the gender-specific factors of influence (predictors) for smoking among adolescents in Pristina, Kosovo. Material and Methods: The study sample comprised 1002 adolescents at the age of 17–18 (366 boys, 636 girls), all of whom were in the school’s 12th grade. The predictors included sociodemographic variables, familial (ie, parental) monitoring, parents’ educational background, and sport-related factors. The Chi2 and forward stepwise logistic regression analyses with a dichotomous criterion (smoking vs. non-smoking) were applied. Results: The incidence of smoking was high (31% and 40% smokers, including 7% and 12% daily smokers for girls and boys, respectively). The regression model revealed more frequent absence from school (odds ratio (OR): 1.544; 95% confidence interval (CI): 1.063–2.243), more unexcused school absences (OR: 1.360; 95% CI: 1.029–1.796), and frequent parental questioning (OR: 1.530; 95% CI: 1.020–2.295) to be significant predictors of smoking among boys. For girls, a higher risk of smoking was associated with lower scholastic achievement (OR: 1.467; 95% CI: 1.089–1.977), more frequent absence from school (OR: 1.565; 95% CI: 1.137–2.155), increased conflict with parents (OR: 1.979; 95% CI: 1.405–2.789), and a self-declared perception of less parental care (OR: 0.602; 95% CI: 0.377–0.962). Sports were not found to be strongly related to smoking. However, a high risk of daily smoking was found among boys …", "num_citations": "20\n", "authors": ["1055"]}
{"title": "Gender-specific predictors of cigarette smoking in adolescents: An analysis of sport participation, parental factors and religiosity as protective/risk factors\n", "abstract": " Previous studies reported particularly high incidence of cigarette smoking among adolescents in Bosnia and Herzegovina (B&H) but there is evident lack of investigations which systematically investigated the potential protective/risk factors of smoking in B&H and surrounding countries. The aim of this study was to examine the gender-specific protective/risk factors (predictors) for daily smoking among adolescents, residents of Herzegovina-Neretva County in B&H. The study sample comprised 1036 17- to 18-year-old adolescents (435 boys and 601 girls, all of whom were in their last year of high school). The predictors included factors of parental monitoring, parents’ educational level, sport factors and religiosity of the participants. A forward stepwise conditional logistic regression analysis with single dichotomous criterion (daily smoking vs. non-smoking) was applied. Regression model revealed lower maternal …", "num_citations": "20\n", "authors": ["1055"]}
{"title": "Predictors of agility performance among early pubescent girls\n", "abstract": " Although frequently studied in adults, predictors of agility are rarely reported for children. This study investigated the influence of the balance, power, reactive strength, straight line sprinting and morphological variables on different agility performances in early pubescent girls (N = 75; 12–13 years of age, randomly divided into a validation sample and a cross-validation sample). Variables included body height, body weight, body fat %; lean body mass %; countermovement jump, broad jump, overall stability index, straight line sprint 5, 10 and 15 m, test of reactive strength (bilateral side jumps – BSJ), and five agility variables. All of the tests applied except for the 5m-sprint were found to be reliable. Different agility performances should be observed as relatively independent qualities for this age group. Multiple regressions explained 30% to 64% of the criteria’s variance. Models were then cross-validated and found valid …", "num_citations": "20\n", "authors": ["1055"]}
{"title": "Maturity status as a determinant of the relationships between conditioning qualities and preplanned agility in young handball athletes\n", "abstract": " Hammami, R, Sekulic, D, Selmi, MA, Fadhloun, M, Spasic, M, Uljevic, O, and Chaouachi, A. Maturity status as a determinant of the relationships between conditioning qualities and preplanned agility in young handball athletes. J Strength Cond Res 32 (8): 2302–2313, 2018—Studies performed thus far have not accounted for the potential influence of maturity on determinants of preplanned agility. This study aimed to examine how determinants of preplanned agility are affected by the period of peak height velocity (PHV) regarding the anthropometrics and conditioning qualities in young handball players. The sample comprised 56 handball players (male; 12–14 years of age), allocated into 2 groups according to their biological age of maturity: Pre-PHV (N= 34) and Post-PHV (N= 22). Players were evaluated on handball-specific tests of preplanned agility (CODAT and T-HALF). Predictors included anthropometrics …", "num_citations": "18\n", "authors": ["1055"]}
{"title": "Association between conditioning capacities and shooting performance in professional basketball players: an analysis of stationary and dynamic shooting skills\n", "abstract": " Pojskic, H, Sisic, N, Separovic, V, and Sekulic, D. Association between conditioning capacities and shooting performance in professional basketball players: an analysis of stationary and dynamic shooting skills. J Strength Cond Res 32 (7): 1981–1992, 2018—Little is known about the influence of conditioning capacities on shooting performance in basketball. The aim of this study was to examine the relationship between different conditioning capacities and shooting performance in professional basketball players. In this investigation, we examined 38 males (all perimeter players; height: 185.5±6.73 cm; mass: 78.66±10.35 kg). Conditioning capacities were evaluated by tests of muscular strength, aerobic endurance, jumping and throwing capacities, sprinting speed, preplanned agility, anaerobic endurance, and fatigue resistance. Shooting performance was evaluated using game statistics, as well as 6 tests of …", "num_citations": "18\n", "authors": ["1055"]}
{"title": "Gender-and sport-specific associations between religiousness and doping behavior in high-level team sports\n", "abstract": " Religiousness is known to be specifically associated with substance abuse, but there is an evident lack of studies investigating the association between religiousness and doping behavior as a specific type of substance abuse in athletes. This study aimed to provide evidence for possible gender- and sport-specific associations between religiousness and doping behavior among team-sport athletes of both genders. The participants were 886 athletes (21.9 ± 3.8 years of age; 352 females) involved in four sports: volleyball (n = 154; 78 females), handball (n = 206; 68 females), soccer (n = 316; 110 females) and basketball (n = 230; 96 females) from Croatia and Slovenia (all traditionally Roman Catholics). The data were collected using a previously validated structured questionnaire that examined sociodemographic, sport- and doping-related factors. In addition, religiousness was captured by the Santa Clara …", "num_citations": "18\n", "authors": ["1055"]}
{"title": "Sport-specific and anthropometric predictors of synchronised swimming performance\n", "abstract": " Predictors of sport-performance in synchronised swimming (Synchro) are rarely investigated. In this study we studied the applicability of sport-specific and anthropometric predictors of Synchro performance for young athletes (all females, 15–17 years of age, 6–8 years of experience in Synchro). Initially, four sport-specific tests (determining characteristic anaerobic and aerobic endurance) are examined with regard to its reliability. The results show the appropriate reliability of the four sport-specific tests (according to ICC, and the Bland Altman plot), while significant learning effects are found for one of the applied tests. Anthropometric indices (body height, body weight, body fat and lean body mass) are not significantly correlated to Synchro performance in solo-figures (criterion). Multiple regression shows the significant prediction of the Synchro solo-figure performance by means of sport-specific tests (R = 0.72; Rsq …", "num_citations": "18\n", "authors": ["1055"]}
{"title": "Importance of agility performance in professional futsal players; Reliability and applicability of newly developed testing protocols\n", "abstract": " The purpose of this study was to determine the inter-and intra-testing reliability of newly developed tests of the change of direction speed (CODS) and reactive agility (RAG) in competitive futsal players. Additionally, the developed tests were evaluated for their validity with regard to the differentiation of two performance-levels. Thirty-two professional male futsal players (age= 26.22±5.22 years; body height= 182.13±5.99 cm, body mass= 77.43±8.00 kg) participated in the study. The sample was divided into two groups based on their level of futsal performance: A top-level-group (n= 12) and a team-level-group (n= 20). The variables included body height, mass, body mass index, a sprint over a 10-m distance (S10M), and eight newly developed futsal specific CODS and RAG tests. The CODS and RAG tests were performed by dribbling the balls (CODS_D and RAG_D) and without dribbling (CODS_T and RAG_T), and the performances on the dominant and non-dominant sides were observed separately. All CODS, and RAG tests performed on dominant side and RAG_T tests performed on the non-dominant side had good inter-testing (CV= 5–8%; ICC= 0.76–0.89) and intra-testing (CV= 4–9%; ICC= 0.77–0.91) reliability. However, RAG_D performed on the non-dominant side was not reliable (ICC= 0.60, CV= 10%). The top-level-players outperformed the team-level-players in the CODS and RAG tests that involved dribbling (t-test: 4.28 and 2.40, p< 0.05; effect sizes (ES): 0.81 and 1.5, respectively), while the team-level players achieved better results in the CODS_T (t-test: 2.08, p< 0.05; ES: 0.60). The proposed CODS and RAG tests that involved …", "num_citations": "17\n", "authors": ["1055"]}
{"title": "Isokinetic knee strength qualities as predictors of jumping performance in high-level volleyball athletes: multiple regression approach.\n", "abstract": " Previous investigations noted potential importance of isokinetic strength in rapid muscular performances, such as jumping. This study aimed to identify the influence of isokinetic-knee-strength on specific jumping performance in volleyball. The secondary aim of the study was to evaluate reliability and validity of the two volleyball-specific jumping tests. The sample comprised 67 female (21.96±3.79 years; 68.26±8.52 kg; 174.43±6.85 cm) and 99 male (23.62±5.27 years; 84.83±10.37 kg; 189.01±7.21 cm) high-volleyball players who competed in 1st and 2nd National Division. Subjects were randomly divided into validation (N.= 55 and 33 for males and females, respectively) and cross-validation subsamples (N.= 54 and 34 for males and females, respectively). Set of predictors included isokinetic tests, to evaluate the eccentric and concentric strength capacities of the knee extensors, and flexors for dominant and non-dominant leg. The main outcome measure for the isokinetic testing was peak torque (PT) which was later normalized for body mass and expressed as PT/Kg. Block-jump and spike-jump performances were measured over three trials, and observed as criteria. Forward stepwise multiple regressions were calculated for validation subsamples and then cross-validated. Cross validation included correlations between and t-test differences between observed and predicted scores; and Bland Altman graphics. Jumping tests were found to be reliable (spike jump: ICC of 0.79 and 0.86; block-jump: ICC of 0.86 and 0.90; for males and females, respectively), and their validity was confirmed by significant t-test differences between 1st vs. 2nd division …", "num_citations": "17\n", "authors": ["1055"]}
{"title": "Non-linear relations between selected anthropological predictors and psycho-physiological exercise-responses\n", "abstract": " In this paper, some very useful non-linear-relation procedures are actualized. The authors have defined the characteristic correlations between a set of anthropological characteristics (14 anthropometric and 14 motor-endurance status variables) and a set of psycho-physiological exercise-responses during the hi-lo and during the step aerobic dance training (heart rate, lactate concentration and rating of the perceived exertion). 60 healthy females served as the sample of subjects (mean age 21±1.4 years). The experiment consisted of two parts. In the first one, the linear correlations between the two sets of the variables were established. In the second part, non-linear (squared) relations, between the variables of the two sets were calculated. Results confirm the statement that the non-linear correlations, in some cases, better determinate the real nature of the relations between the variables, than linear correlation models.", "num_citations": "17\n", "authors": ["1055"]}
{"title": "Rapid weight loss is not associated with competitive success in elite youth Olympic-style boxers in Europe\n", "abstract": " Purpose: To examine the influence of rapid weight loss (RWL) on competitive success in elite youth Olympic-style boxers. In addition, this study examined the practice and prevalence of weight reduction, weight-management protocols, and related symptoms in youth boxers from 12 European countries (N = 83, all males, mean [SD] age 17.1 [0.9] y). Methods: The data were collected using an extensive questionnaire on weight cutting and its associated protocols and symptoms prior to highest-level continental championships. Competition results were obtained at follow-up using a dichotomous variable: medal winning vs nonwinning at the European Championships. Results: Binary logistic regression analysis indicated that “boxing experience” was significantly related to the criterion competitive outcome (odds ratio = 1.33; 95% confidence interval, 1.06–1.66; Nagelkerke R2 = .11), with a higher likelihood of …", "num_citations": "16\n", "authors": ["1055"]}
{"title": "Prospective analysis of the influence of sport and educational factors on the prevalence and initiation of smoking in older adolescents from Croatia\n", "abstract": " The prevalence of smoking among Croatian adolescents is alarmingly high, but no previous study has prospectively examined the sport-and academic-factors associated with smoking and smoking initiation. This study aimed to prospectively examine the associations between scholastic (educational) achievement and sport factors and smoking in 16-to 18-year-old adolescents. This two-year prospective cohort study included 644 adolescents who were 16 years of age at baseline (46% females). Baseline testing was implemented at the beginning of the 3rd year of high school (September 2014) when participants were 16 years old. Follow-up testing was completed at the end of the fourth year of high school, which occurred 20 months later. The evaluated predictor variables were educational-achievement-and sport-related-factors. The outcome variables were (i) smoking at baseline;(ii) smoking at follow-up; and (iii) smoking initiation over the course of the study. We assessed the associations between predictors and outcomes using logistic regression models adjusted for age, gender, socioeconomic status, and conflict with parents. The educational variables were consistently associated with smoking, with lower grade-point-average (Baseline: odd ratio (OR): 2.01, 95% confidence interval (CI): 1.61–2.55; Follow-up: 1.59, 1.31–1.94), more frequent absence from school (Baseline: OR: 1.40, 95% CI: 1.19–1.69; Follow-up: 1.30, 1.08–1.58), and lower behavioral grades (Baseline: OR: 1.80, 95% CI: 1.10–2.89; Follow-up: 1.57, 1.03–2.41) in children who smoke. Adolescents who reported quitting sports were at greater odds of being smokers (Baseline …", "num_citations": "16\n", "authors": ["1055"]}
{"title": "What drives athletes toward dietary supplement use: objective knowledge or self-perceived competence? Cross-sectional analysis of professional team-sport players from …\n", "abstract": " Issues related to knowledge of nutrition and dietary supplementation (DS) are understudied in professional athletes. This study aimed to examine the possible association between knowledge of nutrition and DS (KN&DS) and dietary supplement use (DSU) among professional athletes involved in team sports. The sample comprised professional team-sport athletes (N = 912, age: 22.11 ± 3.37 years, 356 females) involved in four Olympic sports: basketball (N = 228), soccer (N = 324), volleyball (N = 154), and handball (N = 206). The participants were tested by previously validated questionnaires to examine their self-perceived competence on nutrition and DS (S/KN&DS), their objectively evaluated (tested) KN&DS (O/KN&DS), sociodemographic and sport-specific variables (predictors), and DSU (criterion). Associations between the predictors and the criterion (No-DSU - Irregular-DSU - Regular-DSU) were determined by multinomial regression analysis for the total sample and separately for the studied sports. DSU was found to be less prevalent in older and more successful players. The O/KN&DS and S/KN&DS were positively correlated with DSU, but S/KN&DS was a stronger predictor of DSU than O/KN&DS. Sport-specific associations between predictors and criterion were identified, with stronger correlations in sports with a higher prevalence of DSU. Due to the low correlations between O/KN&DS and S/KN&DS in the studied players, this study highlights the necessity for more frequent monitoring of biomarkers of nutritional status and its usage by coaches and practitioners to provide quantitative instruction.", "num_citations": "15\n", "authors": ["1055"]}
{"title": "Injury occurrence and return to dance in professional ballet: prospective analysis of specific correlates\n", "abstract": " Professional ballet is a highly challenging art, but studies have rarely examined factors associated with injury status in ballet professionals. This study aimed to prospectively examine gender-specific correlates of injury occurrence and time-off from injury in professional ballet dancers over a one-year period. The participants were 99 professional ballet dancers (41 males and 58 females). Variables included:(i) predictors: sociodemographic data (age, educational status), ballet-related factors (ie, experience in ballet, ballet status), cigarette smoking, alcohol drinking, and consumption of illicit drugs; and (ii) outcomes: injury occurrence and time-off from injury. Participants were questioned on predictors at the beginning of the season, while data on outcomes were collected continuously once per month over the study period. Dancers reported total of 196 injuries (1.9 injuries (95% CI: 1.6–2.3) per dancer in average), corresponding to 1.4 injuries per 1000 dance-hours (95% CI: 1.1–1.7). In females, cigarette smoking was a predictor of injury occurrence in females (OR: 4.33, 95% CI: 1.05–17.85). Alcohol drinking was a risk factor for absence from dance in females (OR: 1.29, 95% CI: 1.01–4.21) and males (OR: 1.21, 95% CI: 1.05–3.41). Less experienced dancers were more absent from dance as a result of injury than their more experienced peers (Mann-Whitney Z: 2.02, p< 0.04). Ballet dancers and their managers should be aware of the findings of this study to make informed decisions on their behavior (dancers) or to initiate specific programs aimed at the prevention of substance use and misuse in this profession (managers). View Full-Text", "num_citations": "15\n", "authors": ["1055"]}
{"title": "Identification of factors associated with potential doping behavior in sports: A cross-sectional analysis in high-level competitive swimmers\n", "abstract": " Background: Doping behavior, including the misuse of performance-enhancing drugs, is currently a serious problem in sports, and the efficacy of preventive efforts directly depends on information regarding the associations among different precipitating factors (PF) and doping behavior. This study aimed to establish the PF of potential doping behavior (PDB) in competitive swimmers. Methods: The study included 301 swimmers from Slovenia (153 females, 16.4±2.4 years), tested during the 2017 National Championship. Variables were collected by previously validated questionnaires, which included questions on sociodemographics, sports-related factors, consumption of dietary supplements, knowledge of doping, factors of hesitation, and doping-related factors (ie, number of doping tests, opinion about the presence of doping in sport). The PDB (positive, neutral, or negative intention toward doping) was observed as a criterion, while other variables were included as predictors in multinomial regression analyses (with “negative” as reference value), which additionally controlled for gender and age category (cadet-, junior-, and senior-level) as confounders. Results: The results confirmed higher susceptibility to doping in males (positive: odds ratio (OR): 2.77, 95% confidence interval (CI): 1.27–6.04), those swimmers who reported higher alcohol consumption (neutral: OR: 2.18, 95% CI: 1.06–4.16, positive: OR: 2.14, 95% CI: 1.05–4.37), and those regularly used dietary supplements (positive: OR: 3.62, 95% CI: 1.25–10.52). Competitive achievement in Olympic-(neutral: OR: 0.57, 95% CI: 0.41–0.81, positive: OR: 0.59, 95% CI: 0.39–0.88), and non …", "num_citations": "15\n", "authors": ["1055"]}
{"title": "Morphological and motor-endurance changes are highly related in Croatian Navy male recruits\n", "abstract": " A certain decrease of the physical fitness status during the second phase of a three-phase navy recruit training was observed in an experimental physical training program (PTP) performed by Croatian navy recruits in 2000. The morphological status (MS) and motor-endurance status (MES) changes in the status of these variables during the course of this study, and the influence or association of MS changes on MES were observed in 307 male navy recruits at the beginning and at the end of specialist navy training. The total sample was divided into two groups: E group (n = 199) performed experimental PTP and C group (n = 108) performed official PTP. Analysis of the variance between initial and final testing and the canonical analysis between MS changes and MES changes were calculated. Results show that the experimental PTP was more effective than the official PTP in improving MS and increasing MES …", "num_citations": "15\n", "authors": ["1055"]}
{"title": "Reliability, validity and usefulness of a new response time test for agility-based sports: A simple vs. complex motor task\n", "abstract": " The importance of response time (RT) in sports is well known, but there is an evident lack of reliable and valid sport-specific measurement tools applicable in the evaluation of RT in trained athletes. This study aimed to identify the validity, reliability, and usefulness of four newly developed RT testing protocols among athletes from agility-saturated (AG) and non-agility-saturated (NAG) sports. Thirty-seven AG and ten NAG athletes (age: 20.9±2.9; eleven females) volunteered to undergo: three randomized simple response time (SRT-1, SRT-2, and SRT-3) protocols that included a single limb movement, and one complex response time (CRT) protocol that included multi joint movements and whole body transition over a short distance (1.5 and 1.8 m). Each RT test involved 3 trials with 5 randomized attempts per trial. Two sensors were placed at the left-and right-hand side for SRT-1 and SRT-2. Three sensors were …", "num_citations": "14\n", "authors": ["1055"]}
{"title": "Educational and sport factors as predictors of harmful alcohol drinking in adolescence: A prospective study in Bosnia and Herzegovina\n", "abstract": " Objectives                 The cause–effect relationship between educational and sport factors, and alcohol drinking in adolescents is rarely prospectively investigated. This study aimed to establish the possible influence of sport, scholastic and socio-demographic factors on harmful alcohol drinking (HD) and the initiation of HD in adolescents from Bosnia–Herzegovina.                                               Methods                 Study included 881 adolescents (49% females) and consisted of (1) baseline tests (16 years of age) and (2) follow-up testing (18 years of age). The independent variables were scholastic and sport-related factors. Alcohol Use Disorders Identification Test was used, with the following dependent variables: (1) HD at baseline, (2) HD at follow-up, and (3) HD initiation. Logistic regressions were applied to define the relationships.                                               Results                 Higher likelihood of HD was …", "num_citations": "14\n", "authors": ["1055"]}
{"title": "Sport specific fitness status in junior water polo players--Playing position approach.\n", "abstract": " The aim of this investigation was to study the physical fitness differences between two qualitative levels of junior water polo players, with regard to their playing positions. The sample (N.= 54, males; 16-18 years of age) comprised 13 members of the Junior National Squad (JNS; 5 centres and 8 perimeter players), and 41 team athletes (TA; 11 centres and 30 perimeter players). The sample of variables included: body height, body mass, BMI and body fat percentage, 20 metres sprint swimming, maximal dynamometric force in eggbeater kick (DF), on-water vertical jump, drive-shoot-speed, and swimming-endurance-test (SET). Differences between JNS and TA were analysed by t-test for independent samples and by a magnitude-based Cohen's effect size (ES) statistic with modified qualitative descriptors. Forward conditional logistic regression (FCLR) was calculated to determine the impact of the physical fitness variables on the dichotomous criterion (JNS vs. TA). All variables were found to be reliable. The JNS perimeter players performed better (P< 0.05) in SET, DF, and sprint-swimming than the TA perimeter players. No significant differences were found for centres. FCLR revealed drive-shoot-speed as the only significant predictor of qualitative level (Y=-12.925+ 1.188* DSHOOT; OR: 1.023-1.380) CONCLUSION: Fitness capacities are more important as determinants of quality among perimeters than among centres. The results highlight the need for position-specific training programmes in junior water polo.", "num_citations": "14\n", "authors": ["1055"]}
{"title": "Evidencing protective and risk factors for harmful alcohol drinking in adolescence: A prospective analysis of sport-participation and scholastic-achievement in older …\n", "abstract": " Background: The prevalence of alcohol drinking (AD) in Croatian adolescents is alarming, but there is an evident lack of prospective analyses of the protective/risk factors of AD. This study aimed to prospectively investigate the relationships between scholastic and sport factors and harmful alcohol drinking (HD) in older adolescents. Methods: The participants (n= 644, 53.7% females) were 16 years of age at study baseline and were tested at baseline and again 20 months later (follow-up). The predictors included four variables of scholastic achievement and four factors evidencing involvement in sport. Criterion was AD observed on the Alcohol Use Disorders Identification Test (AUDIT), and results were later categorized into harmful drinking (HD) and non-harmful drinking (NHD). The HD at baseline, HD at follow-up and HD initiation during the study course were observed as criteria in logistic regression analyses, which were additionally controlled for confounders (age, gender, socioeconomic status, and conflict with parents). Results: With 22% and 29% adolescents who reported HD at baseline and follow-up, respectively, the prevalence of HD remains among the highest in Europe. Scholastic failure was systematically related to HD at baseline and follow-up, but scholastic variables did not predict HD initiation during the course of the study. The higher odds for HD at baseline were evidenced for current and former team sport athletes. Those who quit individual sport were more likely to engage in HD at follow-up. Longer involvement in sport (OR: 2.10, 95% CI: 1.18–3.72), higher sport result (OR: 3.15, 95% CI: 1.19–8.34), and quitting individual …", "num_citations": "13\n", "authors": ["1055"]}
{"title": "Reliability and factorial validity of non-specific and tennis-specific pre-planned agility tests; preliminary analysis\n", "abstract": " Agility is an important quality in tennis, yet there is an evident lack of studies focussing on the applicability of tennis-specific agility performances and comparing them to equivalent non-specific agility performances. The aim of this study was to evaluate the reliability and factorial validity of three tests of pre-planned agility, performed in specific (with a tennis racquet) and non-specific (without a tennis racquet) conditions. The sample consisted of 33 tennis players (13 males and 20 females; age: 18.3±1.1 years and 18.6±1.3 years; body height: 185.4±51 cm and 169.3±4.2 cm, 74.0±4.4 kg and 61.2±3.1 kg, respectively). The variables comprised three agility tests: a 20-yard test, a T-test and the Illinois test, all performed in both specific and non-specific conditions. Between-subject and within-subject reliability were found to be high (Cronbach Alpha: 0.93 to 0.98; Coefficient of Variation: 3 to 8%), with better within-subject …", "num_citations": "13\n", "authors": ["1055"]}
{"title": "Aerobic fitness and game performance indicators in professional football players; playing position specifics and associations\n", "abstract": " The aim of this study was to identify associations between aerobic fitness (AF) and game performance indicator (GPI) in elite football. Participants were professional football players (males, n = 16; age: 23.76 ± 2.64; body height: 181.62 ± 7.09 cm; body mass: 77.01 ± 6.34 kg). AF testing was conducted by direct measurement and included VO2max, running speed at aerobic threshold (AeT), and running speed at anaerobic threshold (AT). The GPI were collected by the position-specific performance statistics index (InStat index). The players were observed over one competitive half-season, resulting in 82 game performances, grouped according to the positions in game: defenders (n = 39), midfielders (n = 32) and forwards (n = 11). VO2max was not found to be a good discriminator of AF among different playing positions. AeT (F-test = 26.36. p = 0.01) and AT (F-test = 7.25, p = 0.01) were highest among midfielders …", "num_citations": "12\n", "authors": ["1055"]}
{"title": "The prevalence and covariates of potential doping behavior in kickboxing; analysis among high-level athletes\n", "abstract": " The official reports on doping behavior in kickboxing are alarming, but there have been no empirical studies that examined this problem directly. The aim of this study was to investigate the prevalence, gender differences and covariates of potential-doping-behavior, in kickboxing athletes. A total of 130 high-level kickboxing athletes (92 males, 21.37±4.83 years of age, 8.39±5.73 years of training experience; 38 women, 20.31±2.94 years of age; 9.84±4.74 years of training experience) completed questionnaires to study covariates and potential-doping behavior. The covariates were: sport factors (ie experience, success), doping-related factors (ie opinion about penalties for doping users, number of doping testing, potential-doping-behavior, etc.), sociodemographic variables, task-and ego-motivation, knowledge on sports nutrition, and knowledge on doping. Gender-based differences were established by independent t …", "num_citations": "12\n", "authors": ["1055"]}
{"title": "Sport and scholastic factors in relation to smoking and smoking initiation in older adolescents: A prospective cohort study in Bosnia and Herzegovina\n", "abstract": " Objective Sport and scholastic factors are known to be associated with cigarette smoking in adolescence, but little is known about the causality of this association. The aim of this study was to prospectively explore the relationships of different sport and scholastic factors with smoking prevalence initiation in older adolescents from Bosnia and Herzegovina.Methods In this 2-year prospective cohort study, there were 872 adolescent participants (16 years at baseline; 46% females). The study consisted of baseline tests at the beginning of the third year (September 2013) and follow-up at the end of the fourth year of high school (late May to early June 2015). The independent variables were scholastic and sport-related factors. The dependent variables were (1) smoking at baseline, (2) smoking at follow-up and (3) smoking initiation over the course of the study. Logistic regressions controlling for age, gender and …", "num_citations": "12\n", "authors": ["1055"]}
{"title": "Toward (more) effective antidoping policy in sports: what should we target in antidoping efforts\n", "abstract": " AIM: There is a substantial lack of research investigating the factors that should be targeted in doping prevention. The aim of this study was to evaluate factors associated to potential doping behaviour in college-level-athletes, students of sport-science.METHODS: The sample comprised of 60 female and 129 male athletes from Croatia and Slovenia. We administered an anonymous self-report questionnaire probing the following topics: 1) socio-demographic information, religiosity, sports, and substance use and misuse; 2) knowledge about doping and doping-side effects; and 3) factors of hesitation on doping behaviour; including health-, social-, and sports-related consequences of doping habits.RESULTS: A Mann-Whitney test revealed that females tended to worry more about negative consequences of doping behaviours than their male peers. The logistic regression indicated lower likelihood of doping behaviour …", "num_citations": "12\n", "authors": ["1055"]}
{"title": "Potential of adaptive neuro-fuzzy inference system for contact positions detection of sensing structure\n", "abstract": " Tactile sensing is the process of determining physical properties by contact with objects. Here, a novel methodology of an adaptive neuro fuzzy inference strategy (ANFIS) for detection of contact position of a new tactile sensing structure was proposes. The major task is to investigate implementations of carbon-black filled silicone rubber for tactile sensation; the silicone rubber is electrically conductive and its resistance changes by external deformations. The sensor-elements for the tactile sensing structure were made by press-curing from carbon-black filled silicone rubber. The experimental results were used as training and testing data for the ANFIS network. The ANFIS network is used to approximate correlations between contact point locations of the sensing structure. The simulation results presented in this paper show the effectiveness of the developed method. This system is capable to find any change of contact …", "num_citations": "12\n", "authors": ["1055"]}
{"title": "Playing position specifics of associations between running performance during the training and match in male soccer players\n", "abstract": " Background: The relationship between the training load and game load considering soccer playing positions has not been sufficiently examined. Objective: The aim of this study was to examine the position-specific associations between running performance (RP) during the training and match in professional-level male soccer. Methods: The RPs of 15 players (age 23.57±2.84 years, body height 181.9±5.17 cm, body mass 78.36±4.18 kg) were measured by the Global Positioning System over one half-season of the highest-level Croatian soccer competition and assessed according to their playing positions: central defenders (n= 22), fullbacks (n= 23), wide midfielders (n= 29), wingers (n= 6), and forwards (n= 12). Variables included the total distance covered; the distance covered by low intensity running, running, high-speed running, sprinting, and high intensity running; and the number of accelerations, high-intensity accelerations (HIA), decelerations, and high-intensity decelerations (HID). Results: Analysis of variance revealed significant differences in high-speed running, HID, and HIA (p=. 01, all highest in forwards), and sprinting (p=. 01, highest in the wide midfielders). The HIA and HID at training were significantly (p=. 04 and. 01, respectively) correlated (r=. 42 and. 52) with the corresponding match RP in fullbacks. The high-intensity running (high-speed running+ sprinting), running, HIA and HID performance values were significantly correlated (r=. 64,. 52,. 59, and. 52, respectively; all p=. 01) with the corresponding running performances from matches in central midfielders. Conclusions: Structure-specific training is highly recommended for …", "num_citations": "11\n", "authors": ["1055"]}
{"title": "Examination of factors explaining coaching strategy and training methodology as correlates of potential doping behavior in high-level swimming\n", "abstract": " Although coaching is considered an important determinant of athletes’ potential doping behavior (PDB), there is an evident lack of studies that have examined coaching-strategy-and-training-methodology (CS&TM) in relation to PDB. This study was aimed to identify the specific associations that may exist between CS&TM-factors and other factors, and PDB in high-level swimming. The sample comprised 94 swimmers (35 females; 19.7±2.3 years of age) and consisted of swimmers older than 18 years who participated in the 2017 National Championship. Variables were collected by previously validated questionnaires, with the addition of questions where athletes were asked about CS&TM to which they had been exposed. Multinomial logistic regression was applied for the criterion PDB (Negative PDB–Neutral PDB–Positive PDB). The higher risk for positive-PDB was found in males (OR: 6.58; 95% CI: 1.01-9.12 …", "num_citations": "11\n", "authors": ["1055"]}
{"title": "Predictors of competitive achievement among pubescent synchronized swimmers: an analysis of the solo-figure competition.\n", "abstract": " This study examined the applicability of sport-specific fitness tests (SSTs), anthropometrics, and respiratory parameters in predicting competitive results among pubescent synchronized swimmers. A total of 25 synchronized swimmers (16-17 years; 166.2±5.4 cm; and 58.4±4.3 kg) volunteered for this study. The independent variables were body mass, body height, Body Mass Index (BMI), body fat percentage (BF%), lean body mass percentage, respiratory variables, and four SSTs (two specific power tests plus one aerobic-and one anaerobic-endurance test). The dependent variable was competitive achievement in the solo figure competition. The reliability analyses, Pearson's correlation coefficient and forward stepwise regression were calculated. The SSTs were reliable for testing fitness status among pubescent synchronized swimmers. The forward stepwise regression retained two SSTs, BF% and forced vital capacity (FVC, relative for age and stature) in a set of predictors of competitive achievement. Significant Beta coefficients are found for aerobic-endurance, SST and FVC. The sport-specific measure of aerobic endurance and FVC appropriately predicted competitive achievement with regard to the figures used in the competition when competitive results (the dependent variable) were obtained. Athletes and coaches should be aware of the probable negative influence of very low body fat levels on competitive achievement.", "num_citations": "11\n", "authors": ["1055"]}
{"title": "Balance, basic anthropometrics and performance in young alpine skiers; longitudinal analysis of the associations during two competitive seasons\n", "abstract": " Balance is hypothesized to be important in alpine skiing, while it is known that balance depends on anthropometric indices. The aim of this investigation was to explore the association between balance, anthropometrics and skiing-results over two competitive seasons among youth alpine-skiers. Eighty-one skiers (40 females) participated in this study. The participants were tested twice over two competitive seasons: when they were 12-13 years old (U14) and when they were 14-15 years old (U16). The variables consisted of anthropometrics (body height and body mass) and three balance indexes (medio-lateral-, anterio-posterior-and overall-stability-index). Additionally, skiing results in U14 and U16 were evaluated. The balance status did not change significantly over the observed period of time regardless of the significant changes in body mass and height. The relationships between balance and skiing results …", "num_citations": "10\n", "authors": ["1055"]}
{"title": "Alcohol drinking among kosovar adolescents: An examination of gender-specific sociodemographic, sport, and familial factors associated with harmful drinking\n", "abstract": " Background: Adolescent alcohol consumption is a significant public-health problem, although there is a lack of studies investigating this issue in Kosovo. Objectives: The aim of this investigation was to examine the prevalence of alcohol drinking, and the factors associated with harmful drinking (HD) in Kosovar 17–18 years old adolescents. Methods: The sample comprised 636 girls and 366 boys (17–18 years old) from Pristina, Kosovo. The independent variables included sociodemographic factors, variables examining familial-monitoring and conflict (familial-variables), and sport-factors. Alcohol-drinking (dependent variable) was measured by means of the alcohol use disorders identification test scale. Results: 39% of the girls and 43% of the boys reported HD (odds ratio (OR) = 1.17; 95% confidence interval = 0.90–1.55). A higher likelihood of HD is found for those girls whose mothers have an advanced …", "num_citations": "10\n", "authors": ["1055"]}
{"title": "Use of multiple storage elements to improve the second law efficiency of a thermal energy storage system. Part II: Completion of the analysis and presentation of results.\n", "abstract": " This work investigates the use of multiple storage units connected in series to improve the thermodynamic efficiency of a sensible heat thermal energy storage system. The study is focused on two-element systems which are shown to have entropy generation numbers up to 38% smaller than those of the corresponding single-storage-element systems. Thus, the use of only two storage elements in series can provide rather dramatic increases in the thermodynamic efficiency of a thermal energy storage system. Also, the heat exchanger sizes (NTU's) predicted for the two-element systems are shown to be small enough to be practical.", "num_citations": "10\n", "authors": ["1055"]}
{"title": "Guanidinoacetic acid and creatine are associated with cardiometabolic risk factors in healthy men and women: a cross-sectional study\n", "abstract": " Guanidinoacetic acid (GAA) conversion to creatine is thought to be involved in cardiometabolic disturbances through its role in biological methylation and insulin secretion. We evaluated the association of serum GAA and creatine with cardiometabolic risk factors in a cohort of 151 apparently healthy adults (82 women and 69 men) aged 18–63 years. Serum levels of GAA and creatine were measured with liquid chromatography-tandem mass spectrometry. A multiple linear regression model adjusted for age and sex was employed to examine the relationship of serum GAA and creatine with cardiometabolic risk factors. Higher GAA levels were associated with an unfavorable cardiometabolic risk profile (higher insulin, higher total homocysteine, and higher body fat percentage), while having elevated serum creatine levels (≥ 31.1 µmol/L) was associated with being overweight (body mass index≥ 25.0 kg/m). The results from our study suggest a possible role of the GAA–creatine axis in the pathogenesis of cardiovascular and metabolic diseases. View Full-Text", "num_citations": "9\n", "authors": ["1055"]}
{"title": "Substance use and misuse in the Croatian Army Special Forces: Prevalence and influencing factors\n", "abstract": " Objectives                 In addition to being a serious health-hazard, substance-use-and-misuse (SUM) in military forces negatively influences physical fitness and army readiness. The aim of this study was to define the prevalence of SUM, which includes cigarette smoking, alcohol consumption, and multiple SUM (i.e. practice of daily smoking and harmful alcohol drinking), and factors influencing SUM in the Croatian Special Army Forces (SAF).                                               Materials and Methods                 We studied 73 SAF members. A self-administered validated questionnaire was used to gather socio-demographic and military-profession-related data, and SUM factors. The associations between studied variables were established by the Chi2 test, and forward conditional logistic regression (FCLR).                                               Results                 With less than 40% of daily smokers, smoking was within …", "num_citations": "9\n", "authors": ["1055"]}
{"title": "Bone health among indoor female athletes and associated factors; a cross-sectional study\n", "abstract": " This study aimed to compare the bone-mineral-density (BMD), vitamin-D (25(OH)D), serum-calcium and serum-phosphorus levels between female athletes engaged in weight-bearing and non-weight-bearing-sport, and to evaluate possible associations among studied variables. Study involved top-level female athletes (age: 16.9 ± 4.4 years) involved in non-weight-bearing- (swimming; n = 14)), and weight-bearing-sport (artistic gymnastic; n = 17). The variables included the BMD of left femoral neck (measured by dual-energy X-ray absorptiometry), 25-hydroxyvitamin D levels (25(OH)D), body height, body mass, body-mass-index, serum-phosphorus, and serum-calcium levels. Sufficiency for 25(OH)D (>75 nmol/L) was observed in 32.3% of the studied athletes (43% and 23% for swimmers and gymnasts, respectively). The studied athletes had appropriate BMD, with higher BMD in gymnasts compared to swimmers …", "num_citations": "8\n", "authors": ["1055"]}
{"title": "Physical activity, body mass, and adherence to the mediterranean diet in preschool children: a cross-sectional analysis in the split-dalmatia county (Croatia)\n", "abstract": " Physical activity, body mass, and dietary habits are known to be important determinants of overall health status, but there is an evident lack of studies that examine these issues specifically in preschool children. The aim of this study was to identify associations that may exist between adhering to the Mediterranean diet (MD), levels of physical activity (PA), and body composition indices in apparently healthy preschool children from southern Croatia. Participants were 5-to 6-year-old preschoolers from the Mediterranean part of the country (the Split-Dalmatia County; n= 260, 126 females). Adherence to the MD was observed by the Mediterranean Diet Quality Index (KIDMED), PA level was evaluated by the Preschool-age Children’s Physical Activity Questionnaire (Pre-PAQ), and responses were collected from the parents. The participants’ waist circumferences (in cm), waist-to-hip ratios, and body mass index (in kg/m 2, and in a z-score calculated relative to the normative value for age and sex) were used as indicators of body composition. All children were of the same age and tested over a one-month period of the same year as a part of the regular examination undertaken before attending elementary school. With only 6% of the children having a low KIDMED score, adherence to the MD was high. MD adherence was higher in girls (Chi-square= 15.31, p< 0.01) and children who live on the coast of the Adriatic Sea (Chi-square= 18.51, p< 0.01). A mixed effects logistic regression (with kindergarten as random factor) identified sedentary activity to be negatively associated with MD adherence (OR per point: 0.65, 95% CI: 0.44–0.91). High adherence to …", "num_citations": "8\n", "authors": ["1055"]}
{"title": "Evidencing the association between swimming capacities and performance indicators in water polo: a multiple regression study.\n", "abstract": " Swimming capacities are hypothesized to be important determinants of water polo performance but there is an evident lack of studies examining different swimming capacities in relation to specific offensive and defensive performance variables in this sport. The aim of this study was to determine the relationship between five swimming capacities and six performance determinants in water polo. The sample comprised 79 high-level youth water polo players (all males, 17-18 years of age). The variables included six performance-related variables (agility in offence and defense, efficacy in offence and defense, polyvalence in offence and defense), and five swimming-capacity tests (water polo sprint test [15 m], swimming sprint test [25 m], short-distance [100 m], aerobic endurance [400 m] and an anaerobic lactate endurance test [4× 50 m]). First, multiple regressions were calculated for one-half of the sample of subjects which were then validated with the remaining half of the sample. The 25-m swim was not included in the regression analyses due to the multicollinearity with other predictors. The originally calculated regression models were validated for defensive agility (R= 0.67 and R= 0.55 for the original regression calculation and validation subsample, respectively) offensive agility (R= 0.59 and R= 0.61), and offensive efficacy (R= 0.64 and R= 0.58). Anaerobic lactate endurance is a significant predictor of offensive and defensive agility, while 15 m sprint significantly contributes to offensive efficacy. Swimming capacities are not found to be related to the polyvalence of the players. The most superior offensive performance can be expected from those …", "num_citations": "8\n", "authors": ["1055"]}
{"title": "Laminar heat transfer characteristics of a plate-louver fin surface obtained by the differential fluid enthalpy method\n", "abstract": " This paper presents a continuation of presenting our experience in developing a new experimental facility for testing compact heat exchanger surfaces at the University of Novi Sad. The description of the apparatus and its performance identification method are given in (Baclic et al., 1986a). The present paper serves two main purposes:(1) to determine the laminar heat transfer and flow friction characteristics of a particular plate-louver fin surface, and (2) to describe the data reduction procedure that enables the simultaneous determination of the fluidto-surface number of heat transfer units and the test matrix specific heat. It has been discussed in (Baclic et al., 1986a) that the design of the apparatus, the operating conditions and the test matrix sampling method were selected to satisfy some specific requirements and the reader should refer to the introductory remarks given there. The theory presented here is discussed relative to its application to the test facility, to the test core sample and to the data reduction procedure. The method used to reduce the data, the Differential Fluid Enthalpy Method (DFEM)(Baclic et al., 1986b), is modified to enable the determination of the test core specific heat.", "num_citations": "8\n", "authors": ["1055"]}
{"title": "Relations of the Weekly External Training Load Indicators and Running Performances in Professional Soccer Matches\n", "abstract": " The aim of this study was (i) to examine associations between training load during the week and match outcomes;(ii) to evidence position-specific differences between playing positions of training load and match running performances in top-level soccer/football. Training load and match running performances were evaluated through external load parameters: total-distance-covered, distance covered by walking, jogging, running, highintensity-running (high-speed-running+ sprinting); the number of accelerations, high-intensity-accelerations, decelerations, and high-intensity-decelerations. All data were obtained via the Global Positioning System from twelve matches of the highest-level Croatian soccer competition and from training sessions in the preceding weeks. The players (age: 23.57±2.84 years) were divided into five playing positions: central defenders (n= 18), fullbacks (n= 20), central midfielders (n= 26), wing midfielders (n= 5) and forwards (n= 9). Significant ANOVA differences (p< 0.05) were found in all external match load variables, while in weekly training sessions only in high-intensityrunning, high-intensity-accelerations, and high-intensity-decelerations distinguished players across their playing positions. Inverse correlation for most of the external load parameters and positive correlation for the number of training sessions with match outcome was evidenced. Chances of positive match outcome were greater in weeks when the team participated in fewer training sessions and consequently had lower values of external training load.", "num_citations": "7\n", "authors": ["1055"]}
{"title": "Toward prevention of doping in youth sport: cross-sectional analysis of correlates of doping tendency in swimming\n", "abstract": " Doping is recognized as one of the most important problems in sports, but a limited number of studies have investigated doping problems in youth athletes. This study aimed to evaluate doping tendency (potential doping behavior (PDB)) and correlates of PDB in youth age swimmers. The participants were 241 competitive swimmers (131 females; 15.3±1.1 years of age, all under 18 years old). Variables included predictors and PDB (criterion). Predictors consisted of sociodemographic factors (gender and age), sport-related variables (ie, experience in swimming and sport achievement), variables explaining coaching strategy and training methodology, consumption of dietary supplements (DS), knowledge about doping, and knowledge about sports nutrition and DS (KSN). In addition to the descriptive statistics and differences between genders, a multinomial regression using PDB as the criterion (negative-, neutral-, or positive-PDB, with a negative-PDB as the reference value) was calculated to define associations between predictors and criterion. With only 71% of swimmers who declared negative-PDB results indicated an alarming figure. Boys with better KSN were more negatively oriented toward positive-PDB (OR: 0.77, 95% CI: 0.60–0.95). In girls, lower competitive achievement was evidenced as a risk factor for neutral-PDB (OR: 0.39, 95% CI: 0.24–0.63). Also, higher neutral-PDB (OR: 0.88, 95% CI: 0.81–0.96) and positive-PDB (OR: 0.90, 95% CI: 0.83–0.99) were identified in girls who began with intensive training in younger age. Because of the alarming figures of PDB, there is an evident need for the development of systematic antidoping …", "num_citations": "7\n", "authors": ["1055"]}
{"title": "Sport-specific conditioning variables predict offensive and defensive performance in high-level youth water polo athletes\n", "abstract": " Sekulic, D, Kontic, D, Esco, MR, Zenic, N, Milanovic, Z, and Zvan, M. Sport-specific conditioning variables predict offensive and defensive performance in high-level youth water polo athletes. J Strength Cond Res 30 (5): 1316–1324, 2016—Specific-conditioning capacities (SCC) are known to be generally important in water polo (WP), yet the independent associations to offensive and defensive performance is unknown. This study aimed to determine whether offense and defense abilities in WP were independently associated with SCC and anthropometrics. The participants were 82 high-level male youth WP players (all 17–19 years of age; body height, 186.3±6.07 cm; body mass, 84.8±9.6 kg). The independent variables were body height and body mass, and 5 sport-specific fitness tests: sprint swimming over 15 meters; 4× 50-meter anaerobic-endurance test; vertical in-water-jump; maximum intensity isometric force …", "num_citations": "7\n", "authors": ["1055"]}
{"title": "New parameters and reference values for monitoring iron status in Middle Eastern adolescent male athletes\n", "abstract": " Aim. Hematological and biochemical parameters of 160 Mid-dle Eastern adolescent male athletes (aged from 12-18 years) were tested in order to investigate their iron status and to establish reference values for this population. A focus of this study was also the investigation of Reticulocyte hemoglobin (RetHe) and soluble transferrin receptor (sTfR).Methods. Complete blood count, reticulocyte and sera pa-rameters were analyzed at the beginning of the training season for these adolescent athletes. As the diagnosis of iron deficiency in adolescents is extremely difficult subjects were subdivided in three age groups (12-13, 14-15, 16-18).Results. For most of the parameters our results confirmed the existing reference values reported in young athletes. Exceptions were however found with lower Mean Cell Volumes (79.9±4.3 fl) in this group when compared to other age matched data. RetHe, ferritin and sTfR levels were …", "num_citations": "7\n", "authors": ["1055"]}
{"title": "Predictors of judo performance in female athletes: insights from 27 top-level European coaches\n", "abstract": " Aim: To identify and rank the predictors of athletic performance for female judo athletes observed in three weight groups.Methods: In this study we interviewed 27 top-level European judo coaches, and asked them to rank the importance of different general physical fitness and specific strength variables in the success of female judo athletes. Coaches judged the importance of each factor separately for three weight groups: lightweight (< 52 kg), middleweight (53–63 kg), and heavyweight (> 63 kg) athletes. Additionally, we established coefficients of concordance to assess agreement among respondents (judo coaches) about judo achievement predictors.Results: The Kendall Tau coefficient showed high agreement among respondents (0.56). Among the general factors, coaches ranked physical fitness as the most important, followed by technical and tactical knowledge, psychic profile, sport-specific intelligence, and …", "num_citations": "7\n", "authors": ["1055"]}
{"title": "Why are we losing the war against doping? In fact, do we want to win at all?\n", "abstract": " Although the issue of doping an substances is one of the very popular scientifi c topics in the world, these kinds of research are very rare in Croatia. Th is paper looks at some aspects of using doping and substances in sport and discusses the reasons which have been considered to be fundamental for the growth of this problem lately, based on the professional and scientifi c experience of the author. Th ere is a separate analysis of the reasons for doping prohibition in sport; reasons that were considered by the author to be the key issues for the growth of the doping problem, as well as the position and results of Croatian science regarding the battle against doping in sport. Th e discussion is base on professional and scientifi c insights.", "num_citations": "7\n", "authors": ["1055"]}
{"title": "Factors associated with physical activity levels in late adolescence: A prospective study\n", "abstract": " Background: Reaching an appropriate physical activity level (PAL) in adolescence is an important public health problem. This study aimed to evaluate factors associated with PAL and changes in PAL in late adolescence. Material and Methods: The sample involved 411 adolescents (201 girls) who were 16 years of age at study baseline; the participants completed a structured validated questionnaire at baseline (the beginning of the third grade of high school) and again at follow-up (the end of the fourth grade; when they were 18 years of age). Variables were obtained at both testing waves and included the following predictors: sociodemographic indices (sex, socioeconomic status, parental education), sports factors (participation in individual and team sports, sports achievement, experience in sports), and PAL (the primary outcome), which was measured using the Physical Activity Questionnaire for Adolescents. Results: A significant decrease in PAL between baseline and follow-up testing was evidenced (t-test= 6.17, p< 0.001). A logistic regression model calculated with a dichotomized outcome (normal PAL vs. low PAL), and sex as a covariate, showed a significant influence of participation in team sports and maternal education on PAL, both at baseline (OR: 1.56, 95% CI: 1.11–1.87; OR: 1.38, 95% CI: 1.02–1.90) and at follow-up (OR: 1.45, 95% CI: 1.01–1.90; OR: 1.35, 95% CI: 1.08–1.70, for team sports and maternal education, respectively). Conclusions: The study confirmed certain associations between the studied variables and PAL, but there was no significant influence of the observed indicators on changes in PAL in late adolescence …", "num_citations": "6\n", "authors": ["1055"]}
{"title": "Parental and Familial Factors Influencing Physical Activity Levels in Early Adolescence: A Prospective Study\n", "abstract": " Parental/familial factors are important determinants of the physical activity level (PAL) in children and adolescents, but studies rarely prospectively evaluate their relationships. This study aimed to evaluate the changes in physical activity levels among adolescents from Bosnia and Herzegovina over a two-year period and to determine parental/familial predictors of PAL in early adolescence. A total of 651 participants (50.3% females) were tested at baseline (beginning of high school education; 14 years old on average) and at follow-up (approximately 20 months later). The predictors included sociodemographic characteristics (age, gender) and parental/familial factors (socioeconomic status of the family, maternal and paternal education, conflict with parents, parental absence from home, parental questioning, and parental monitoring). Physical activity levels were evidenced by the Physical Activity Questionnaire for Adolescents (PAQ-A; criterion). Boys were more active than girls, both at baseline (t-test= 3.09, p< 0.001) and at follow-up (t-test= 3.4, p< 0.001). Physical activity level decreased over the observed two-year period (t-test= 16.89, p< 0.001), especially in boys, which is probably a consequence of drop-out from the sport in this period. Logistic regression evidenced parental education as a positive predictor of physical activity level at baseline (OR [95% CI]; 1.38 [1.15–170], 1.35 [1.10–1.65]), and at follow-up (1.35 [1.11–1.69], 1.29 [1.09–1.59], for maternal and paternal education, respectively). Parents with a higher level of education are probably more informed about the importance of physical activity on health status, and thus transfer this …", "num_citations": "6\n", "authors": ["1055"]}
{"title": "Analiza stanja i transformacijski postupci u kineziologiji\n", "abstract": " Naravno, to je istina. Međutim, motorička znanja se, u svojoj osnovi, uče, usvajaju, i usavršavaju, a ne transformiraju. Transformacija, sama po sebi, podrazumijeva nekakav proces promjene, pa je puno primjerenije kazati kako se transformacije u kineziologiji ipak svode na prethodno navedene tri grupe osobina, odnosno sposobnosti. S druge strane, poznato je da kineziološki transformacijski postupci dovode i do promjena (transformacija) nekih drugih antropoloških dimenzija, a ne samo motoričkih sposobnosti, funkcionalnih sposobnosti i promjenjivih morfoloških dimenzija. Tako se kineziološkim transformacijskih postupcima vrlo uspješno djeluje i na promjene određenih segmenata zdravstvenog statusa. Kineziološki transformacijski postupci vrlo su učinkovito sredstvo iu različitim intervencijama u konativnu sferu, socijalni status i sl. Međutim, transformacija ovih dimenzija antropološkog statusa (zdravstveni status, socijalni status, konativne osobine, pa po nekim pretpostavkama čak i kognitivni status) nisu u osnovi cilj kineziološkog transformacijskog djelovanja, već se promjene u tim dimenzijama događaju, uvjetno rečeno,„posredno “. Naime, cilj kineziološkog transformacijskog djelovanja, au skladu sa ciljem sata tjelesnog vježbanja, može biti samo djelovanje na motoričke sposobnosti, morfološke dimenzije (i to samo neke), te funkcionalne sposobnosti. To što će promjene ovih sposobnosti, odnosno u ovim osobinama, u konačnici imati određene pozitivne reperkusije na promjene zdravstvenog statusa, možda socijalnog ili konativnog statusa, ili moguće kognitivnih sposobnosti, dakle, to što će se dogoditi kao posljedica djelovanja …", "num_citations": "6\n", "authors": ["1055"]}
{"title": "Does aerobic performance define match running performance among professional soccer players? A position-specific analysis\n", "abstract": " Aerobic performance is considered an important determinant of match running performance in soccer, but studies have rarely investigated this issue in top-level players. This study examined the possible associations between direct measures of aerobic performance and match running performance in elite soccer players. Aerobic performance was tested at the beginning of the season in laboratory settings. The match-running performance was measured by a global positioning system over a competitive half-season for a total of 82 match performances in professional players from Croatia (age: 23.76 ± 2.64; body height: 181.62 ± 7.09 cm; body mass: 77.01 ± 6.34 kg) and clustered as central player (n = 57) and side player (n = 25) performance. No significant differences in aerobic performance were noted between central and side players. The anaerobic threshold was correlated with high-speed running (19.8–25.1 …", "num_citations": "5\n", "authors": ["1055"]}
{"title": "Evidencing the influence of pre-pandemic sports participation and substance misuse on physical activity during the COVID‑19 lockdown: a prospective analysis among older adolescents\n", "abstract": " Objectives: The physical activity level (PAL) has significantly decreased as a result of the social distancing and lockdown related to the COVID‑19 pandemic, but there is a lack of knowledge on the correlates of PAL during the pandemic. The aim of this research was to examine the influence of pre‑pandemic sports participation and substance use and misuse (SUM) on PAL during the COVID‑19 pandemic. Material and Methods: The study included 661 high‑school students from Bosnia and Herzegovina (aged 15–18 years, 292 females). The investigation included 2 testing waves: before the COVID‑19 pandemic (baseline, January 2020) and during the COVID‑19 lockdown (follow‑up, April 2020). The variables included PAL as measured by the Physical Activity Questionnaire for Adolescents, sports factors, and SUM. Results: Sports factors at baseline were positively correlated with PALs at both baseline and follow‑up. Smoking tobacco negatively affected PALs at both baseline and follow‑up. Alcohol consumption was positively correlated with PAL at baseline but had no effect on PAL at follow‑up. Conclusions: This study confirmed the importance of sports participation in maintaining PAL during challenging situations, such as the COVID‑19 lockdown. The substance‑specific influence of SUM on PAL before and during the lockdown points to evident social and cultural aspects of SUM behaviors in adolescents. Further studies evidencing the cumulative effects of PAL decline during the lockdown are warranted. Int J Occup Med Environ Health. 2021; 34 (2): 151–63", "num_citations": "5\n", "authors": ["1055"]}
{"title": "Analysis of pacing strategies in 10 km open water swimming in international events\n", "abstract": " The purpose of this study was to ascertain the pacing strategies employed in 10 km open water swimming events, and to define which split time was most determinant for the final performance as a function of sex and classification in International Championships of the highest level. Six international competitions over the last five years were analysed retrospectively: Olympic Games, World Championships, and European Championships. The data corresponded to a total of 437 swimmers̕ competition histories (257 men, 180 women). A two-way analysis of variance (sex [2 levels: men, women], classification [3 levels: 1st to 3rd, 4th to 8th, 9th and below]) was performed for each split (0-2.5 km, 2.6-5.0 km, 5.1-7.5 km, and 7.6 to 10 km) and half (0-5 km, 5.1-10 km). The Bonferroni post-hoc test was used to compare means, and Pearson᾿ s simple correlation coefficient to determine correlations between the split times and the final performance (total time). In general, the medal winners and the seconde tier classified swimmers, both men and women, employed a negative pacing strategy (the first half of the race was swum slower than the second). Women, however, in proportional terms swam a faster first partial (0 to 2.5 km) than men. These results could help coaches convince their swimmers that the first split of the event should be swum as slowly as possible, while still ensuring that they are in the leading group.", "num_citations": "5\n", "authors": ["1055"]}
{"title": "Kronološka dob mladih atletičara ne definira rezultat u trčanju na 20 metara\n", "abstract": " U osnovi radi se o potrebi definiranja jednadžbe specifikacije. Na žalost za većinu sportova jednadžbe specifikacije do danas nisu izrađene. Ovaj problem dodatno se komplicira kada se uzme u obzir da bi se posebne jednadžbe specifikacije trebale izraditi za pojedine dobi sportaša, ali naravno i za spol. Jedna od bitnih smetnji izrade jednadžbe specifikacije za pojedine dobi jest i utjecaj dobi. Naime, ako uzmemo u obzir da se organizam djece i mladeži praktički svakodnevno mijenja, javlja se problem unificiranja jednadžbi specifikacije koje bi eventualno bile i izrađene za pojedinu dob. Ovaj rad upravo je pokušaj da se ovaj problem prevlada i to konkretno, za jednu specifičnu atletsku manifestaciju–trčanje na 20 metara. Trčanje na 20 metara jedna je od elementarnih mjera brzine kretanja. U osnovi radi se o vrlo popularnom testu koji se u atletici (ali iu drugim sportskim disciplinama i sportovima) koristi za …", "num_citations": "5\n", "authors": ["1055"]}
{"title": "Characteristics and differences in the heart rate and blood lactate concentration values measured during hi-lo and step aerobics classes\n", "abstract": " The investigation was carried out to determine the characteristic portion of energy demands measured during HI-LO and STEP aerobics classes, and also to establish any possible differences between these two aerobic dance programmes by monitoring the same parameters. Twenty-three female students, aged 18-20 years, experienced aerobic dancers, participated in both the HI-LO and STEP aerobics sessions. The heart rate (average HR per session) and lactic acid concentration values were measured during both classes. The obtained average values of the heart rate and blood lactate offered no evidence of differences between the HI-LO and STEP aerobics programmes in the observed parameters. Nevertheless, the results revealed a relative disproportion in the values of these two parameters, characterized by the relatively higher heart rate values than expected in relation to the blood lactate concentration values. This can be explained, as has been done in some previous research studies, by the exerted influence of the disturbed body hemodynamic balance (caused by the extensive overhead arm motions) and by emotional excitement. The results of the present research suggest the conclusion that both the HI-LO and STEP aerobics programmes were energetically equally demanding. Therefore, it could be recommended that participants should choose individually the programme they wish to be engaged in just according to their preferences, Further investigations are needed to determine any possible (anthropological) predictive values of load intensity of the respective aerobic programmes.", "num_citations": "5\n", "authors": ["1055"]}
{"title": "Are various forms of locomotion-speed diverse or unique performance quality?\n", "abstract": " The forward-sprint is considered to be, and is regularly performed as, a unique measure of “on-ground” linear-speed performance. Thus far, no investigation has simultaneously studied different forms of linear-speed or investigated whether different forms of linear-speed should be observed as unique performance quality. The purpose of this study was to determine (I) the achievements (ie execution time), and (II) the reliability and inter-relationships between various linear-speed performances. The participants were 42 male physical education students with substantial sport-specific backgrounds. We applied a total of six tests: three quadrupedal (supine backward, supine forward, and pronate backward locomotion) and three bipedal-performances (forward sprinting, backward sprinting, lateral shuffling). All of the tests showed appropriate reliability parameters (Cronbach Alpha ranged from 0.91 to 0.97; Inter-Item-R 0 …", "num_citations": "4\n", "authors": ["1055"]}
{"title": "Metrijske karakteristike baterije testova za procjenu motoričkih postignuća u predškoli\n", "abstract": " Kvaliteta rada u svim područjima primijenjene kineziologije izravno ovisi o kvaliteti procjene stanja učesnika kinezioloških programa. Objektivna i kvalitetna procjena aktualnog stanja antropološkog statusa osnova je kvalitetne primjene trenažnih–transformacijskih stimulusa u kineziologiji. Prema tom pitanju, motoričke sposobnosti i motorička postignuća trebala bi biti u prvom planu, ali se stručnjaci nerijetko susreću s karakterističnim problemima od kojih su najčešći–nedovoljno kvalitetni i nedovoljno primjereni mjerni instrumenti (Malina i sur., 2004.). Problem procjene motoričkih sposobnosti naročito je izražen u predškolskom uzrastu. Naime, motoričke sposobnosti u tom uzrastu nisu još diferencirane, pa se često postavlja pitanje upotrebljivosti i valjanosti pojedinih testova za procjenu pojedinih (hipotetskih) dimenzija motoričkog statusa. Drugi problem jest u samom protokolu mjerenja motoričkih sposobnosti …", "num_citations": "4\n", "authors": ["1055"]}
{"title": "Students'-instructors' physiological responses during step aerobic exercise\n", "abstract": " This study tried to examine some physiological response variables (PER) of step aerobics exercise (SA) for a group of aerobic instructors (n= 10) and their students (n= 16). All instructors trained an equal 30-min SA program, for a group of students. Heart rate (HR) was monitored continuously, and the average HR and% HRmax of the first half (min 1st-15, h), and the second half (min 16th-30th) of the session was calculated. Blood lactate (BL) was measured in the\\5* and 30lh min of the session. Instructors and students differentiated significantly in age, aerobic dance experience, HR and% HRmax between the 15* and 3 0th min of the SA session (t-tests AGE: 12.60, p< 0.001; Experience: 6.22, p< 0.001; HR16_30: 2.48, p< 0.05;\"/óHRmax^ o: 3.2, pO. Ol). Students, but not instructors, tended to have lower HR during the second half compared to the first half of the SA (t test: 2.3, p< 0.05). BL for both groups increased …", "num_citations": "4\n", "authors": ["1055"]}
{"title": "Motorička znanja u funkciji kondicijske prepreme sportaša\n", "abstract": " funkcionalnioh i morfoloških obilježja, sve snažnije se aktiviraju i na taj način izravno utječu na rezultate motoričkog gibanja. Tek u fazi stabilizacije dobro naučenog motoričkog znanja, završava se i konačna preraspodjela utjecaja raličitih sposbnosti i osobina, pa o toj zadnjoj strukturi ovisi i efikasnost izvođenja stečene vještine.Važno je istaći da se samo u realizaciji ovakvih (izuzetno visoko naučenih i usavršenih) motoričkih znanja mogu eksploatirati svi resursi i potencijali antropoloških dimenzija osobe koja posjeduje takva znanja. To praktički znači da o stupnju razvijenosti ovih spsobnosti i/ili osobina koje su u najvećoj mjeri aktivirane tijekom realizacije nekog automatiziranog motoričkog programa ovisi i učinkovitost izvođenja takvog programa. Istovremeno je takvo, tehnički usavršeno motoričko znanje, najracionalnije što se tiče energetskog i informacijskog napora–najučinkovitije u odnosu na aktualnu …", "num_citations": "4\n", "authors": ["1055"]}
{"title": "Dance steps: Differentiating between more and less successful 7− year old girls\n", "abstract": " On the sample of 55 seven – year – old girls the applicability of two newly constructed tests for the assessment of the knowledge of polka and waltz dance steps performance was researched. Five referees, through the video record, on Likert's fivepoint scale did the assessment of success for each test. The referees' objective assessing and their good correlation can be noticed in both tests so that the authors recommended them to be applied in practice when assessing the knowledge of dance steps performance in physical education (PE) teaching with seven year old pupils. The structure of discriminative function shows the motor superiority of the second, rhythmically better cluster, in relation to the first, less successful cluster of seven year old girls. A satisfactory level of dance steps acquisition and a faster process of learning are the best with the examinees having a pronounced coordination in rhythm, above average speed of movements and explosive strength.", "num_citations": "4\n", "authors": ["1055"]}
{"title": "Position Specific Running Performances in Professional Football (Soccer): Influence of Different Tactical Formations\n", "abstract": " Running performances (RPs) are known to be important parameters of success in football (soccer), but there is a lack of studies where RPs are contextualized regarding applied tactical solutions. This study aims to quantify and analyze the differences in position-specific RPs in professional football, when games are played with three defensive players (3DP) and four defensive players (4DP). The participants here include professional football players (M±SD, age 23.57±2.84 years, body height 181.9±5.17 cm, body mass 78.36±4.18 kg) playing at the highest competitive level in Croatia. RPs were measured by global positioning system and classified into four groups based on playing positions: central defenders (CD; n= 47), wide defenders (WD; n= 24), midfielders (MF; n= 48), or forwards (FW; n= 19). Analysis of variance and discriminant canonical analysis are used to identify differences between 3DP and 4DP tactical solutions in terms of the RPs for each playing position. The number of accelerations and decelerations most significantly contributed to the differentiation of 3DP and 4DP among MFs (Wilks λ= 0.31, p< 0.001), with higher occurrences with 3DP. For CDs, total distance, and high-intensity running were higher in 3DP (Wilks λ= 0.66, p< 0.001). No multivariate differences were found for FW and WD players in terms of the RPs between 3DP and 4DP tactical formations. The characteristics and differences shown in this study may provide useful information for coaching staff regarding changing in-season tactical formations. Additionally, the results are useful for optimizing training programs for football players with different playing positions …", "num_citations": "3\n", "authors": ["1055"]}
{"title": "Testosterone, cortisol and alpha-amylase levels during a handball match; analysis of dynamics and associations\n", "abstract": " This study evaluated dynamics of testosterone, cortisol and alpha-amylase during a handball match in high-level male players. Ten male professional players (24.1 ± 3.1 years, 188.2 ± 6.4 cm, 94.6 ± 9.6 kg) were tested on salivary-testosterone, -cortisol and -alpha-amylase levels before (prematch), at halftime, and immediately after the game. Analysis of variance for repeated measurements (ANOVA) with consecutive post-hoc analyses and effect-size differences were calculated to identify differences between measurements. The associations among biomarkers were determined by Pearson’s product moment correlation (Pearson’s r). The ANOVA indicated significant differences in testosterone (F: 14.31, p < 0.01; significant post-hoc differences between prematch and remaining two measurements), and alpha-amylase (F: 9.78, p < 0.01; significant post-hoc differences between all measurements). Significant …", "num_citations": "3\n", "authors": ["1055"]}
{"title": "Fitness profiles of professional futsal players: identifying age-related differences\n", "abstract": " Study aim: The aim of this study was to determine the fitness profiles of senior and junior futsal players and to identify potential differences between the studied age groups.Materials and methods: 44 male futsal players from 5 professional futsal teams participated in this study. Subjects were divided into two age groups (seniors [> 18 years; n= 26] vs juniors [< 18 years of age; n= 18]). Players were tested for anthropometrics (body mass, body height and body fat percentage), jumping capacity (countermovement jump and standing broad jump), kicking speed (for dominant and non-dominant leg), sprinting capacity (5-and 10-meter sprints), 20-yard test, futsal-specific reactive agility, and futsal-specific change-of-direction speed tests. Results: No significant differences between age groups were apparent for anthropometrics. Seniors achieved better results than juniors in tests of kicking speed, for both the dominant (106.81±6.94 km/h and 100.94±5.33 km/h, respectively, t-test: 3.02 [p< 0.001], Cohen’sd: 1.02) and nondominant leg (95.54±8.57 km/h and 85.28±8.71 km/h, respectively, t-test: 3.88 [p< 0.001], Cohen’sd: 1.25).Conclusions: Seniors did not achieve significantly better results than juniors in most of the observed variables. Since the maximum biological maturity occurs up to 18 years, and studied juniors were in their late adolescence, we can assume that differences between groups are related to other indices (ie technical skills, tactical knowledge).", "num_citations": "3\n", "authors": ["1055"]}
{"title": "Investigating the prevalence and predictors of injury occurrence in competitive hip hop dancers: Prospective analysis\n", "abstract": " Hip hop is a popular form of competitive and recreational sport worldwide, but studies rarely investigate injury prevalence and factors associated with injury occurrence in this sport. This study aimed to prospectively examine injury occurrence in hip hop dancers in a three-month period and to evaluate potential predictors of injury occurrence in hip hop dancers. The participants were 129 competitive hip hop dancers (114 females, 17.95±4.15 years of age). Study predictors were obtained at study baseline and included sociodemographic factors, sport-related factors, previous injury status, anthropometric and body build indices (body height, mass, body mass index, and body composition variables), and dynamic balance performance (obtained by the Star Excursion Balance Test—SEBT). The outcome was injury occurrence, which was prospectively observed once a week by the Oslo Sports Trauma Research Center Overuse Injury Questionnaire (OSTRC). During the course of the study, 101 injuries occurred, equating to an annual injury incidence of 312%. On average, each dancer suffered 0.78 injuries (95% Confidence Interval (95% CI): 0.61–0.97) across a study period of three months (0.76 (95% CI: 0.60–0.95) and 0.93 (95% CI: 0.75–1.13), in females and males, respectively; Mann Whitney Z-value: 0.68, p= 0.52). Seventeen percent of dancers suffered multiple injuries, and 49% of all injuries were time-loss injuries. The knee was the most frequently injured body location (42% of all reported injuries), followed by the back region (32%) and the ankle (15%). Previous injury was a strong predictor of injury occurrence (Odds Ratio: 3.76, 95% CI: 1 …", "num_citations": "3\n", "authors": ["1055"]}
{"title": "REAGENT STRIPS ARE RELIABLE AND VALID MEASURE IN DEFINING STATUS OF (DE) HYDRATION AMONG MALE JUNIOR BOXERS.\n", "abstract": " The dehydration is a common weight-manipulating technique in boxing, which is already known as a serious health-threatening behavior. Investigations confirmed urine-specific-gravity (USG) as the most reliable and applicable indicator of the body hydration status. In this study we have investigated reliability and concurrent validity of the reagent strips Medi--Test Combi 10 (RSC) as a method for the evaluation of hydration in elite junior boxers. As a gold standard, refractometric measurement (RF) is used. The sample of subjects comprised 14 male junior boxers from Croatia and Germany (all national team members; 16, 57±1, 15 years; 67, 33±14, 97 kg and 176, 14±7, 98 cm). The RSC measurement was done by two examiners, while the urine sample was simultaneously used for RF analysis. The Sperman range correlations between evaluators was high for three variable BLR, pH SPU of the 10 parameters …", "num_citations": "3\n", "authors": ["1055"]}
{"title": "Influence of step aerobics training programme on chosen dimensions of morphological status in males\n", "abstract": " The aim of the research was to establish the transformational effects of step aerobics programme on selected morphological parameters among 26 male subjects, participants of the programme. The programme consisted of 25 step aerobics training sessions and lasted for nine weeks. The subject of analysis was changes in four variables concerning the thickness of skin fold and four circumferences of corresponding parts of the body. Multivariate analysis of variance revealed a satisfying level of significance of differences in morphological dimensions, which can be represented by noteworthy changes in two selected variables (abdominal skin fold and thigh skin fold). We assume that changes in circumferences of selected body parts did not reach the satisfying level of significance because of minor muscle hypertrophy, which compensated the decrease caused by reduction of the subcutaneous fatty tissue.", "num_citations": "3\n", "authors": ["1055"]}
{"title": "Evidencing the Influence of the COVID-19 Pandemic and Imposed Lockdown Measures on Fitness Status in Adolescents: A Preliminary Report\n", "abstract": " It was established that the COVID-19 pandemic resulted in decreased physical activity levels, potentially leading to reduced physical fitness. The aim of this research was to investigate the impact of the COVID-19 lockdown on fitness indices in adolescents. We observed high school adolescents (33% girls; aged 15–17 years) divided into two cohorts. The first cohort (control; n= 48) included adolescents who were in school during the 2018/2019 year, while the second cohort (lockdown; n= 66) was observed during the school year 2019/2020 when COVID-19 lockdown measures were imposed. Variables included body height, body mass, BMI, sit-ups, and the 600 m dash. Both cohorts were tested at the beginning and at the end of the observed school years. A factorial analysis of variance for repeated measurements evidenced an improvement in sit-ups and the 600 m dash in the control, and a decrease of the same capacities in the lockdown cohort. In the lockdown cohort, a decrease in muscular fitness was more evident in boys than in girls. No differential changes between cohorts were evidenced in anthropometrics. Results suggest that the COVID-19 lockdown negatively influenced muscular fitness status in adolescents, especially in boys. View Full-Text", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Indices of Cardiovascular Health, Body Composition and Aerobic Endurance in Young Women; Differential Effects of Two Endurance-Based Training Modalities\n", "abstract": " Endurance training (ET) has multiple beneficial effects on cardiovascular health (CVH), but there is an evident lack of knowledge on differential effects of various types of ET on indices of CVH in women. The aim of this study was to analyse the effectiveness of two different types of ET on changes in indicators of CVH in apparently healthy adult women. The sample included 58 women (24±3 years; height: 165±6 cm, mass: 66.7±7.2 kg, BMI: 24.3±2.5 kg/m 2, at baseline) divided into one control non-exercising group (n= 19), and two exercising experimental groups (EE). The first EE participated in choreographed aerobic-endurance training (CAT; n= 19), while the second participated in treadmill-based endurance exercise (TEE; n= 20) during the experimental protocol (8 weeks, 24 training sessions). The testing included pre-and post-exercise protocols and measures of anthropometric/body composition indices, lipid panel, and endurance capacity. Two-way analysis of variance for repeated measurements with consecutive post hoc analysis was applied to the “group” and “measurement” variables. The main significant ANOVA effects found for measurement, and “Group x Measurement” interaction (p< 0.05) were found for all variables but body height. The EE induced positive changes in lipid panel variables, anthropometric/body-build status, and endurance capacity. However, TEE improved endurance capacity to a greater extent than CAT. The results suggest that that the optimal exercise intensity and self-chosen type of physical-activity may result in positive effects on indices of CVH, even in women of young age and good health status. View Full-Text", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Analysis of the Relationship between Tobacco Smoking and Physical Activity in Adolescence: A Gender Specific Study\n", "abstract": " Background and Objective: Although smoking and the physical activity level (PAL) are important determinants of health status in adolescence, there is a lack of information on the relationship between smoking and PAL in early adolescence. The objective of this study was to evaluate the gender-specific relationship between smoking and PAL in 14-to-16-year-old adolescents. Materials and Methods: The sample included 650 adolescents (337 girls, 14.7±0.5 years at first testing wave) from Bosnia and Herzegovina. During the first testing wave, participants were tested using structured questionnaires. Second testing was commenced after approximately 20 months (16.4±0.6 years). The variables were age, gender, socioeconomic status, living environment, cigarette smoking (predictors), and PAL (criterion). Predictors were measured at the first wave, and criterion at the first-wave and second-wave. Results: For girls, smoking was negatively correlated to PAL at the first-wave (OR: 0.75, 95% CI: 0.55–0.95) and at the second-wave (OR: 0.73, 95% CI: 0.71–0.96). No significant association between smoking and PAL was found for boys. Results suggest that adolescent boys and girls do not follow the equal trajectories when it comes to relationships between smoking and PAL. Conclusions: In developing promotional public health actions related to a decrease of smoking and increase of PAL, a gender-specific approach is highly recommended. Further studies analyzing the cause–effect relationship between consumption of other types of psychoactive substances and PAL in this age group are warranted.", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Familial and Parental Predictors of Physical Activity in Late Adolescence: Prospective Analysis over a Two-Year Period\n", "abstract": " Children’s health behaviors are highly influenced by their parents and family. This study aimed to prospectively evaluate the parental/familial factors associated with physical activity levels (PALs) among older adolescents. The participants were 766 adolescents, who were prospectively observed at baseline (when they were 16 years of age), at first follow-up measurement (FU1; 17 years of age), and second follow-up measurement (FU2; 18 years of age). Sociodemographic factors (age, gender, socioeconomic status, and sport participation) and parental/familial variables were evaluated at baseline. PALs (evidenced by the Physical-Activity Questionnaire-for-Adolescents) were prospectively evidenced at baseline, FU1, and FU2. Factorial analysis of variance for repeated measurements showed a significant decrease in PALs during the study course (F= 83.05, p< 0.001). Sport participation and male gender were significant predictors of PALs at baseline, FU1, and FU2. Logistic regression, controlled for sport participation and male gender, evidenced paternal education as a significant predictor of baseline PALs. Parental conflict was a significant predictor of PALs in all three testing waves. The significant influence of paternal education on the children’s PALs existed from younger adolescence until the age of 17 years. The association between parental conflict and PALs developed in older adolescence. These results should be used in the development of specific and targeted interventions aimed at the improvement of PALs and a reduction of sedentarism in youth. View Full-Text", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Physiological and anthropometric determinants of performance levels in professional futsal\n", "abstract": " There is an evident lack of studies examining the pursuit of excellence in futsal. The aim of this study was to evaluate anthropometric and physiological variables that may contribute to distinguishing among performance levels in professional players and to evaluate correlates of those variables. The participants were 75 male professionals (age = 25.1 ± 5.1 years, body height = 182.3±6.2 cm, body mass = 80.8 ± 10.4 kg), who were divided into performance levels using two criteria: (i) starters (first teams) vs. nonstarters (substitutes), and (ii) top-level players (members of the national team and players who participated in top-level team competition in Europe) vs. high-level players (team players competing at the highest national competitive rank). Variables included anthropometrics (body height and mass, BMI, body fat percentage), generic tests of physiological capacities(5- and 10-meter sprints, CMJ, broadjump, 20-yard test, reactive strength index [RSI]), and futsal-specific fitness tests (kicking speed by dominant and nondominant leg, futsal-specific tests of change of direction speed, and reactive agility [FSRAG] involving/not involving dribbling the ball). Top-level players outperformed high-level players in RSI, broadjump, kicking speed, and FSRAG involving dribbling. Starters achieved better results than nonstarters in fewer variables, including kicking speed and RSI. Body fat percentage negatively influenced FSRAG involving dribbling, and RSI. FSRAG, RSI, and kicking speed were significantly correlated, indicating the similar physiological background of these capacities. The study evidenced the importance of futsal-specific capacities and skills …", "num_citations": "2\n", "authors": ["1055"]}
{"title": "AGILNOST I ZDRAVSTVENI STATUS-RAZVOJ I VALIDACIJA SPECIFIČNIH MJERNIH PROTOKOLA\n", "abstract": " Agilnost se uglavnom razmatra kao motorička sposobnost povezana s izvedbom u sportu. Međutim, novija istraživanja i prepopruke svjetskih autoriteta u području zdravstvenog fitnesa prepoznaju važnost različitih oblika agilnosti u svakodnevnom funkcioniranju generalne populacije. Jedan od glavnih problema vezan je za pouzdano i valjano mjerenje ove sposobnosti kod netrenirane (nesportske) populacije. U ovom članku predstavljena je ova problematika i znanstveno istraživački projekt koji će se ovom problematikom baviti u narednih četiri godine, a koji se provodi na Kineziološkom fakultetu u Splitu.", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Osnove direktne digitalne sinteze\n", "abstract": " The principle of Direct Digital Frequency Synthesis (DDS) is presented in this work. The significance is put on the spectrum of output signal and on privilege method in relation to PLL. And the most frequent use of DDS synthesizers is also shown in this work.", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Gender differences in upper body explosive force production: effects of maximal.\n", "abstract": " This study analyzed gender differences in upper body explosive strengfh (1) before, and (2) after partiaiiing out of the influence of fat free mass (FFM) and upper body maximal strength. Altogether 20 male and 21 female physical education students volunteered in this study. Maximal strength of the upper was assessed using one repetition nnaximum bench press test (1RM BP), while upper body explosive strength was assessed using seated ball (0.55 kg) or medicine ball (2 kg and 4 kg) throwing test, respectively. Throwing velocity was assessed using a radar gun. The results showed that men have significantly higher upper body explosive strength than women at all loading conditions, both before (-30%; p< 0.001) and after controlling for FFM (-10%; p< 0.05). When both FFM and upper body maximal strength (1RM BP) were controlled for, gender differences in upper body explosive strength disappeared (p= 0.15 …", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Trening s teretima kod djece i mladih sportaša: Zašto da, a zašto ne\n", "abstract": " Trening s opterećenjem (teretima) je općeniti pojam koji se koristi kako bi se opisali sustavi treninga koji se temelje na upotrebi dinamičkog\" vanjskog\" opterećenja, as prvenstvenim ciljem razvoja pojedinih dimenzija snage, pa se nerijetko koristi i sinonim–trening snage. Uopćeno, trening s opterećenjem rijetko se preporučuje djeci i mladim sportašima 1 do ulaska u pubertet iu ranom pubertetu. Generalno, vjeruje se da (1) nedostatna razina prirodnih anaboličkih hormona u organizmu djece u predpubertetu i (2) nedovršen i/ili izrazito buran razvoj lokomotornog (u prvom redu koštano-zglobnog) sustava djece u pubertetu, predstavljaju glavne limitirajuće faktore u primjeni treninga s opterećenjem.Prvi faktor (nedostatna razina anaboličkih hormona u organizmu djece u predpubertetu) više je praktičan nego formalan razlog za izostavljanje treninga s opterećenjem kod djece. Preciznije, postavlja se logično pitanje–koliko je smisleno provoditi treninga s opterećenjem kod djece sportaša, as obzirom da zbog nepovoljne hormonske ravnoteže djeca imaju smanjenu mogućnost napredovanja u dimenzijama snage, a zbog kojih se u krajnjoj liniji ovi treninzi i provode? Drugi faktor međutim počiva na puno\" ozbiljnijoj\" i formalnijoj pretpostavci, koja bi ukoliko se pokaže točnom, trebala biti nedvosmislen faktor ograničenja u primjeni treninga s opterećenjem kod djece. Naime, postoje razmišljanja da bi trening s opterećenjem mogao uzrokovati ozljede i prerano zatvaranje koštanih epifiza, a jedno i drugo zbog (pre) velikog opterećenja kojem je lokomotorni sustav izložen pri takvom treningu. Upravo o ovim problemima nešto će se kazati u daljnjem tekstu.", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Uvod u NondicijsNo treniranje u jedrenju\n", "abstract": " U ovom tekstu i pratecem DVD-u pokušala se obraditi problematika kondicijske pripreme u jedrenju. Medutim, materijal nije osmišljen, a niti napisan po sistemu\" kuharice\". Drugim rijecima, u njemu se ne nalaze\" recepti\" za provodenje kondicijskog treninga. Naime, iz osobnog iskustva znam da to ne bi bilo pametno. Jednostavno, svaki sportaš je prica za sebe i treninzi koji odgovaraju jednom ne bi odgovarali drugom sportašu, a pogotovo ako se uzme u obzir da bi prakticki bilo nemoguce predstaviti treninge za sve dobne kategorije, oba spola i sve jedrilicarske klase. Doduše, prateci DVD sadrži neke trenažne programe, ali oni su tu jer smatram da ce se oblici treninga o kojima govorim puno bolje razumjeti kroz video prikaz nego da sam ih prezentirao kroz tekst. Moja osnovna namjera je bila–objasniti problematiku kondicijske pripreme u jedrenju, te na taj nacin omoguciti trenerima da sami uspješno formiraju i …", "num_citations": "2\n", "authors": ["1055"]}
{"title": "Mogućnost primjene RPE skale kod programiranja i kontrole treninga s vanjskim opterećenjem\n", "abstract": " Procjena stvarnog volumena opterećenja jedan je od elementarnih problema u programiranju i kontroli svakog treninga, pa tako i kod treninga s vanjskim opterećenjem. Najčešći način kojim se procjenjuje volumen rada kod ove vrste treninga jest procjena ukupnog intenziteta, kroz ukupnu masu podignutog tereta tijekom pojedine trenažne jedinice. Međutim, postavlja se pitanje koliko je takva procjena volumena uopće ispravna. Naime, pojedini modaliteti rada prilikom treninga s vanjskim opterećenjem osobito su stresni za organizam (trening maksimalne snage piramidalnim modalitetom na primjer), a tijekom treninga ukupna količina podignutog tereta nije velika. Neki drugi modaliteti nasuprot (kružni trening primjerice) nisu tako stresni, a tijekom treninga se podiže jako velika količina tereta. Stoga je opravdano postaviti pitanje postoji li bolji način procjene volumena rada, koji će u konačnici rezultirati i pravilnijim …", "num_citations": "2\n", "authors": ["1055"]}
{"title": "The Impact of Scholastic Factors on Physical Activity Levels during the COVID-19 Lockdown: A Prospective Study on Adolescents from Bosnia and Herzegovina\n", "abstract": " Scholastic factors (academic achievement) are hypothesized to be important determinants of health-related behaviors in adolescents, but there is a lack of knowledge on their influence on physical activity levels (PAL), especially considering the COVID-19 pandemic and the imposed lockdown. This study aimed to investigate the associations between scholastic factors and PAL before and during the pandemic lockdown. The participants were adolescents form Bosnia and Herzegovina (n = 525, 46% females), who were observed prospectively at the baseline (before the pandemic lockdown) and during the lockdown in 2020 (follow-up). The scholastic factors (grade point average, behavioral grade, school absences, unexcused absences) were evidenced at the baseline (predictors). The outcome (PAL) was evaluated using the Physical Activity Questionnaire for Adolescents at the baseline and the follow-up. Gender, age, parental/familial conflict, and sport participation were observed as confounders. No significant influence of the predictors on PAL were evidenced at the baseline or at the follow-up. The scholastic variables were significantly associated with the changes of PAL which occurred due to pandemic lockdown, with a lower risk for negative changes in PAL among adolescents who were better in school (OR = 0.56, 95%CI: 0.34–0.81, and OR = 0.66, 95%CI: 0.34–0.97, for the grade point average and behavioral grade, respectively). Students who do well in school are probably more aware of the health benefits of proper PAL, and therefore are devoted to the maintenance of their PAL even during the home-confinement of lockdown. Public …", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Differential Effects of Resistance-and Endurance-Based Exercise Programs on Muscular Fitness, Body Composition, and Cardiovascular Variables in Young Adult Women …\n", "abstract": " There is an evident lack of research simultaneously investigating endurance training (ET) and resistance training (RT) with regard to their potential influence on fitness and health status in young women. This study aimed to determine the effects of RT and ET three times a week over an eight-week period on anthropometric/body composition indices, blood pressure (BP), and muscular fitness in apparently healthy young women who participated in a self-preferred program. The sample of participants comprised 57 young healthy women (23.9 ± 3.08 years, 165.5 ± 5.8 cm, 66.8 ± 7.2 kg) divided into ET (n = 18), RT (n = 19), and non-exercising (C) (n = 20) groups. The variables consisted of anthropometric/body composition indices (body mass, BMI, body fat, and lean body mass), muscular fitness variables (lower body strength, upper body strength, abdominal strength, dynamometric force, and flexibility), and cardiovascular parameters (resting heart rate and systolic and diastolic BP). A pre- and post-testing design, with factorial analysis of variance for repeated measurements (ANOVA: Group × Measurement), including a consecutive post hoc test, was applied. The ANOVA indicated a similar improvement in body composition (increase in lean body mass and decrease in body fat percentage), resting heart rate, and flexibility in both of the exercise groups, with no significant changes in the C group. RT improved the participants’ strength and force capacities to a greater extent than ET. BP showed a trend of improvement in both of the training groups, but without statistically significant pre- to post-changes. Correlation analysis calculated with variables of …", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Physical activity before and during covid-19 pandemic; analysis of changes and correlates in croatian adolescents.\n", "abstract": " ABSTRACT IZVLEČEK Mateo Blazevic 1 Barbara Gilic 1, 2 Ivan Peric 3 Damir Sekulic 1* PHYSICAL ACTIVITY BEFORE AND DURING COVID-", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Associations between vertical and horizontal jumps with power values during deadlift exercise among youth soccer (football) players\n", "abstract": " Objectives: The similarity in joint angles and performance between the deadlift and vertical jumps was previously displayed. Additionally, the hexagonal barbell produces greater peak power compared to performance with traditional Olympic barbell. To optimally develop power and performance in explosive tasks in sport (such as jumps), training with the load that maximizes the power output is considered ideal. Therefore, the objective of this research is to investigate the relationship between jumps and power values during the deadlift exercise performed with a hexagonal barbell.Methods: 14 youth soccer players (16-18 years old) were tested on the Sargent jump test, broad jump test, one repetition maximum (1RM) using the PUSH 2.0 band that was used for displaying the power values at 45, 55, 65, 75, 85, and 95% of 1RM. Correlations between jumps and power values at different percentages of 1RM were evaluated by Pearson’s correlation coefficients.Results: The significant correlation (p< 0.05) was evidenced between Sargent jump test and power value at 45, 55, 65, 75% 1RM (r= 0.75; r= 0.60; r= 0.56; r= 0.53, respectively), and between Broad jump and power at 45, 55, 65% 1RM (r= 0.71; r= 0.51; r= 0.54, respectively).Conclusion: Power values at moderate loads were significantly correlated with vertical and horizontal jumps. Therefore, it could be expected that training at moderate loads that produce the greatest power values will lead to greater development of jumping performance, which can be important also for improving soccer performance.", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Pre-Planned and Non-Planned Agility in Patients Ongoing Rehabilitation after Knee Surgery: Design, Reliability and Validity of the Newly Developed Testing Protocols\n", "abstract": " Background: Due to its association with the risk of falling and consequent injury, the importance of agility is widely recognized, but no study so far has examined the different facets of agility in an untrained/clinical population. The aim of this study was to evaluate the reliability, validity, and correlates of newly developed tests of non-planned agility (NPA) and pre-planned agility (PPA) in an untrained/clinical sample. Methods: The sample comprised 38 participants older than 40 years (22 females, age: 56.1±17.3 years, height: 170.4±10.8 cm, mass: 82.54±14.79 kg) who were involved in a rehabilitation program following total knee arthroplasty and knee arthroscopy. Variables included age, gender, type of surgery, history of fall, anthropometrics/body composition, and newly developed tests of NPA and PPA. Results: The results showed the high inter-testing-(ICC> 0.95, CV< 9%), and intra-testing-reliability (ICC> 0.96, CV< 9) of the newly developed tests. PPA and NPA were found to be valid in differentiation between age groups (> 50 yrs. vs.< 50 yrs.), and genders, with better performance in younger participants and males. Only NPA differentiated participants according to type of surgery, with better performance in those who had arthroscopic surgery, than those who had total knee arthroplasty. No differences in NPA and PPA were established between groups based on fall-history. In females, the body mass (Pearson’s r= 0.58 and 0.59, p< 0.001) and body fatness (Pearson’s r= 0.64 and 0.66, p< 0.001) were negatively correlated, while the lean body mass (Pearson’s r= 0.70 and 0.68, p< 0.001) was positively correlated with PPA and NPA. The NPA …", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Predicting Injury Status in Adolescent Dancers Involved in Different Dance Styles: A Prospective Study\n", "abstract": " The positive effects of dance on health indices in youth are widely recognized, but participation in dance is accompanied with a certain risk of injury. This prospective study aimed to investigate injury occurrence and to evaluate the possible influences of specific predictors on the occurrence of musculoskeletal problems and injuries in adolescent dancers. Participants were 126 dancers (21 males; 11–18 years), who were competitors in the urban dance, rock and roll, and standard/Latin dance genres. Predictors included sociodemographic factors, anthropometric/body build indices, sport (dance) factors, and dynamic balance. The outcome variable was injury status, and this was evaluated by the Oslo Sports Trauma Research Centre Overuse Injury Questionnaire (OSTRC). Predictors were evaluated at baseline, and outcomes were continuously monitored during the study period of 3 months. During the study course, 53% of dancers reported the occurrence of a musculoskeletal problem/injury, and dancers suffered from an average of 0.72 injuries over the study period (95% CI: 0.28–1.41), giving a yearly injury rate of 280%. Gender and dance styles were not significantly related to the occurrence of injury. Higher risk for injury was evidenced in older and more experienced dancers. Dynamic balance, as measured by the Star Excursion Balance Test (SEBT), was a significant protective factor of injury occurrence, irrespective of age/experience in dance. Knowing the simplicity and applicability of the SEBT, continuous monitoring of dynamic balance in adolescent dancers is encouraged. In order to prevent the occurrence of musculoskeletal problems …", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Factors associated with potential doping behavior in Olympic-sailing: a gender-specific analysis\n", "abstract": " BACKGROUND: Olympic-sailing is not contaminated with doping, and special efforts are needed to keep this sport free of doping. The aim of this study was to evaluate factors associated with potential doping behavior (PDB) in professional Olympic sailors.METHODS: The sample of participants were professional Olympic Laser class athletes (N.= 80, 39 females; all> 18 years). Data were collected through previously validated questionnaires, utilizing sociodemographic-variables, sportrelated-factors, and various factors of hesitation against doping (predictors), and PDB (criterion). To calculate the associations between predictors and the criterion, gender-stratified logistic regression models were calculated. RESULTS: Negative social consequences of doping were identified as the important factors of hesitation against PDB in men, while health-related problems were identified as being highly important factors of hesitation in women. Sailing conditions present particular health challenges specific to women; therefore, women tend to be much more responsive to health concerns in general.CONCLUSIONS: The results of this study provided evidence about necessity of gender-specific approach in antidoping preventive campaigns. Further studies in other sports and with younger athletes are warranted.", "num_citations": "1\n", "authors": ["1055"]}
{"title": "A total sample vs. playing-position approach to identifying relationships between different agility components in basketball\n", "abstract": " Purpose: Non-planned agility (reactive agility-RAG), and pre-planned agility (change of direction speed-CODS) are important determinants of success in basketball. However, the association between these two conditioning capacities in high-level basketball players is rarely evidenced. The aim of this investigation was to evaluate the relationship between basketball-specific CODS and RAG in the total sample, and separately for three main playing positions in the game of basketball (ie guards, forwards and centers).Methods: The sample comprised 106 national/international-level male basketball players (age: 21.9±3.5 years; body height: 195.1±7.9 cm; body mass: 90.1±10.0 kg), divided according to their playing positions in game (guards, N= 49; forwards, N= 22; centers, N= 35). The variables included body mass, body height, and body fat percentage; as well as basketball-specific CODS and-RAG. The reliability of CODS and RAG was evidenced by intra-class-coefficients (ICC). Differences among positions were established by one-way analysis of variance, consecutive post-hoc analyses, and effect size differences (η2). Finally, the relationship between variables was established by means of Pearson’s moment correlation coefficient (r), which was calculated for the total sample, and then separately for each playing position.Results: The intra-session reliability was somewhat higher for CODS, than for RAG (ICC: 0.81 and 0.76, respectively). The centers were tallest (F: 67.75, p< 0.01; η2: 0. 57), and heaviest (F: 39.01, p< 0.01, η2: 0.44), followed by forwards. The guards and forwards achieved better results than centers in CODS (F: 5.19, p< 0.01 …", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Can we consider sport as a protective factor against substance misuse in adolescence?\n", "abstract": " Substance use and misuse (SUM), which includes the consumption of alcohol, cigarette smoking, the consumption of drugs and other behaviours, is a significant public health issue in the world today. In addition to being a serious, health-threatening behaviour, SUM is often associated with detrimental consequences and creates certain difficulties for not only the individuals who misuse the substances but also their parents, families, school, peers, and society as a whole. Physical activity and sports (PA&S) helps to reduce the risk of a number of critical health problems, including obesity, heart disease, stroke, colon cancer, diabetes and osteoporosis. In addition, participation in PA&S by young people (ie adolescents) has been shown to promote their social well-being, physical and mental health, academic achievement, self-discipline, and socialisation. It is often uncritically hypothesised that participation in PA&S will …", "num_citations": "1\n", "authors": ["1055"]}
{"title": "O dopingu i nekim drugim hipokrizijama u sportu danas\n", "abstract": " U članku se razmatraju neki aspekti korištenja dopinga u sportu, te se povlači paralela s drugim problemima sporta danas. Izlažu se razlozi koje je autor smatrao osnovnima za problem porasta dopinga, uz istovremeno sve intenzivnije napore u suzbijanju dopinga koje ulažu međunarodne sportske udruge. Konačno, izlaže se trenutno stanje po pitanju ovog problema na ovim prostorima.", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Razina motoričkih sposobnosti sedmogodišnjih početnica izravno utječe na kvalitetu izvedbe skokova u ritmičkoj gimnastici\n", "abstract": " Uvod Skokovi su osnovna skupina elemenata tijelom u ritmičkoj gimnastici. Može se pretpostaviti da je dobro izvođenje skokova na svim težinskim razinama preduvjet za postizanje dobrih rezultata ritmičarki. Ackerman (1988) pretpostavlja da su opće motoričke sposobnosti presudne za izvedbu skokova na prvom stupnju usvajanja znanja iz ritmičke gimnastike (RG). Osnovni cilj ovog istraživanja je kanoničkom korelacijskom analizom utvrditi utjecaj motoričkih sposobnosti na uspjeh u izvođenju skokova kod početnica u RG. Metode Istraživanje je provedeno na uzorku od 55 sedmogodišnjih početnica u ritmičkoj gimnastici (prva godina vježbanja). Primijenjeno je 12 motoričkih testova koji pokrivaju područje latentnih kretnih i energetskih dimenzija za koje se pretpostavlja da su nazočne iu ritmičkoj gimnastici. Odabrani su sljedeći motorički testovi:(1) poligon natraške;(2) koraci u stranu;(3) taping rukom;(4) taping nogom;(5) skok u vis-Sargent;(6) bacanje medicinke iz ležanja;(7) broj podizanja trupa iz ležanja na leđima u minuti;(8) broj čučnjeva u minuti;(9) pretklon raznožno;(10) visoko prednoženje desnom nogom iz ležanja (mjereno u stupnjevima);(11) visoko prednoženje lijevom nogom iz ležanja (mjereno u stupnjevima) i (12) ritmičko bubnjanje. Za procjenu izvedbe skokova u ritmičkoj gimnastici odabrano je devet skokova bez sprave i sa spravom (težine razine A prema bodovnom pravilniku iz 2001. g.), primjerenih za početnice u ritmičkoj gimnastici:(1) kozački skok (bez sprave);(2) jelenji skok (bez sprave);(3) daleko-visoki skok (bez sprave);(4) trčeći koraci i skok škare kroz otvorenu vijaču okretanjem naprijed;(5) kruženje presavijenom …", "num_citations": "1\n", "authors": ["1055"]}
{"title": "Reliability and validity of the newly developed tests of football specific change of direction speed and reactive agility in youth players\n", "abstract": " Purpose: Agility is an important determinant of success in football (soccer), but there is a lack of reliable and valid tests applicable in the evaluation of different agility components in youth football players. In this study we evaluated the reliability and factorial validity of the two newly developed tests of agility in male youth football players. Methods: The sample comprised 44 youth football players (all males, 14–15 years of age) who were tested on anthropometrics (body height and mass), newly developed tests of football specific reactive agility (FS-RAG) and change of direction speed (FS-CODS), one standard test of CODS (20-yards), and sprinting over 20-m distance (S20M). The relative reliability is evaluated by calculation of Intra-Class-Correlation coefficients (ICC), while the absolute reliability was evaluated by calculation of the coefficient of variation (CV). Further, systematic bias was checked by analysis of variance for repeated measurements (ANOVA). The associations between studied variables were evidenced by Pearson’s correlation. Finally, factor analysis was calculated to define the factorial validity of agility tests (FS-RAG, FS-CODS, 20-yards).Results: The newly developed football-specific tests were found to be reliable, with better reliability of FS-CODS (ICC: 0.81, CV: 6%), than of FS-RAG (ICC: 0.76, CV: 9%). The ANOVA evidenced significant (p< 0.05) learning effects for FS-RAG, but post-hoc analysis indicated stabilization of the results until the third testing trial. Factor analysis extracted one significant factor under the Guttmann-Kaiser criterion (Explained Variance: 1.67), showing the appropriate factorial validity of newly developed …", "num_citations": "1\n", "authors": ["1055"]}