{"title": "Seleção de tecnologias digitais para a gerência de projetos em disciplinas de projeto integrado\n", "abstract": " A disciplina de Projeto Integrado estudada é um componente curricular de caráter interdisciplinar que visa relacionar as unidades do currículo entre si em e com a realidade profissional. Além da interlocução com outras disciplinas–seus conteúdos e docentes–tem-se equipes de alunos resolvendo problemas sociais reais, desenvolvendo projetos enquanto aprendem os conteúdos necessários para desenvolvê-los. Dificuldades em sua complexa condução levaram à constatação da importância de se utilizar métodos de gerenciamento de projetos, e posteriormente de se dispor de tecnologias digitais que as apoiassem. Este estudo teve o objetivo geral de selecionar tecnologias digitais online para apoiar a gerência dos projetos integrados. A metodologia adotada consistiu, inicialmente, da observação da prática pedagógica para identificar os requisitos necessários a serem atendidos pelas tecnologias, seguida da análise comparativa de ferramentas digitais gratuitas disponíveis, finalizando com sua configuração para uma nova turma de Projeto Integrado. A partir de princípios pedagógicos estabelecidos foram selecionadas duas ferramentas, sendo uma para gerência de projetos e, de forma complementar, outra para organização dos arquivos digitais manuseados. A análise dos resultados ainda é preliminar, porque o semestre letivo ainda está em andamento, mas já apontam para uma maior capacidade de acompanhamento do trabalho, por alunos e docentes envolvidos. Entretanto, já se observa a necessidade de se alocar mais tempo de aula para orientações tanto em gerência de projetos quando na ferramenta selecionada para …", "num_citations": "4\n", "authors": ["1312"]}
{"title": "O Processo de Design Digital: endereçando o desafio da multidisciplinaridade\n", "abstract": " Integrated Project is a type of course offered in the Digital Design program of the Federal University of Ceará, Quixadá Campus. It has the challenge of integrating into a single project some concepts from the areas of Computer Science, Design, Communication and Arts. For the interdisciplinarity to be productive, it was specified PD3 (Digital Disruptive Design Process), a design process based on HCI, Design, and Software Engineering methodologies. In this paper, we present the PD3 applied to the Integrated Project courses, describing how it has been used and evolved, as well as giving lessons learned.", "num_citations": "2\n", "authors": ["1312"]}