{"title": "Crowdsourcing as a model for problem solving: An introduction and cases\n", "abstract": " Crowdsourcing is an online, distributed problem-solving and production model that has emerged in recent years. Notable examples of the model include Threadless, iStockphoto, InnoCentive, the Goldcorp Challenge, and user-generated advertising contests. This article provides an introduction to crowdsourcing, both its theoretical grounding and exemplar cases, taking care to distinguish crowdsourcing from open source production. This article also explores the possibilities for the model, its potential to exploit a crowd of innovators, and its potential for use beyond forprofit sectors. Finally, this article proposes an agenda for research into crowdsourcing.", "num_citations": "3195\n", "authors": ["2094"]}
{"title": "Crowdsourcing\n", "abstract": " A concise introduction to crowdsourcing that goes beyond social media buzzwords to explain what crowdsourcing really is and how it works. Ever since the term “crowdsourcing” was coined in 2006 by Wired writer Jeff Howe, group activities ranging from the creation of the Oxford English Dictionary to the choosing of new colors for M&Ms have been labeled with this most buzz-generating of media buzzwords. In this accessible but authoritative account, grounded in the empirical literature, Daren Brabham explains what crowdsourcing is, what it is not, and how it works. Crowdsourcing, Brabham tells us, is an online, distributed problem solving and production model that leverages the collective intelligence of online communities for specific purposes set forth by a crowdsourcing organization—corporate, government, or volunteer. Uniquely, it combines a bottom-up, open, creative process with top-down organizational goals. Crowdsourcing is not open source production, which lacks the top-down component; it is not a market research survey that offers participants a short list of choices; and it is qualitatively different from predigital open innovation and collaborative production processes, which lacked the speed, reach, rich capability, and lowered barriers to entry enabled by the Internet. Brabham describes the intellectual roots of the idea of crowdsourcing in such concepts as collective intelligence, the wisdom of crowds, and distributed computing. He surveys the major issues in crowdsourcing, including crowd motivation, the misconception of the amateur participant, crowdfunding, and the danger of “crowdsploitation” of volunteer labor, citing real …", "num_citations": "1125\n", "authors": ["2094"]}
{"title": "Crowdsourcing the public participation process for planning projects\n", "abstract": " Public involvement is a central concern for urban planners, but the challenge for planners is how best to implement such programs, given many difficulties inherent in the typical public involvement process. The medium of the Web enables us to harness collective intellect among a population in ways face-to-face planning meetings cannot. This article argues that the crowdsourcing model, a successful, Web-based, distributed problem solving and production model for business, is an appropriate model for enabling the citizen participation process in public planning projects. This article begins with an exploration of the challenges of public participation in urban planning projects, particularly in the harnessing of creative solutions. An explanation of the theories of collective intelligence and crowd wisdom follows, arguing for the medium of the Web as an appropriate technology for harnessing far-flung genius. An …", "num_citations": "904\n", "authors": ["2094"]}
{"title": "Moving the crowd at Threadless: Motivations for participation in a crowdsourcing application\n", "abstract": " Crowdsourcing is an online, distributed problem-solving and production model already in use by businesses such as Threadless.com, iStockphoto.com, and InnoCentive.com. This model, which harnesses the collective intelligence of a crowd of Web users through an open-call format, has the potential for government and non-profit applications. Yet, in order to explore new applications for the crowdsourcing model, there must be a better understanding of why crowds participate in crowdsourcing processes. Based on 17 interviews conducted via instant messenger with members of the crowd at Threadless, the present study adds qualitatively rich data on a new crowdsourcing case to an existing body of quantitative data on motivations for participation in crowdsourcing. Four primary motivators for participation at Threadless emerge from these interview data: the opportunity to make money, the opportunity to develop …", "num_citations": "854\n", "authors": ["2094"]}
{"title": "Moving the crowd at iStockphoto: The composition of the crowd and motivations for participation in a crowdsourcing application\n", "abstract": " Crowdsourcing is an online, distributed problem solving and production model already in use by for-profit organizations such as Threadless, iStockphoto, and InnoCentive. Speculation in Weblogs and wisdom of crowds theory assumes a diverse crowd engaged in crowdsourcing labor. Furthermore, and as crowdsourcing is in some ways similar to open source software production, prior research suggests that individuals in the crowd likely participate in crowdsourcing ventures to gain peer recognition and to develop creative skills. The present study tests these assumptions in the crowdsourcing community at iStockphoto. An online survey obtained 651 responses from iStockers to demographic and motivations questions. Results indicate that the desire to make money, develop individual skills, and to have fun were the strongest motivators for participation at iStockphoto, and that the crowd at iStockphoto is quite homogenous and elite. These data have implications for future research into crowdsourcing, particularly regarding notions of professionalism and investment in online communities.", "num_citations": "474\n", "authors": ["2094"]}
{"title": "The myth of amateur crowds: A critical discourse analysis of crowdsourcing coverage\n", "abstract": " This paper analyzes the discourse of amateurism as it relates to crowdsourcing, a now relatively common model where organizations engage online communities to design goods and solve problems. This paper's findings are twofold: (1) crowdsourcing is discussed in the popular press as a process driven by amateurs and hobbyists, yet empirical research on crowdsourcing indicates that crowds are largely self-selected professionals and experts who opt-in to crowdsourcing arrangements; and (2) the myth of the amateur in crowdsourcing ventures works to label crowds as mere hobbyists who see crowdsourcing ventures as opportunities for creative expression, as entertainment, or as opportunities to pass the time when bored. This amateur/hobbyist label then undermines the fact that large amounts of real work and expert knowledge are exerted by crowds for relatively little reward and to serve the profit motives of …", "num_citations": "296\n", "authors": ["2094"]}
{"title": "Motivations for participation in a crowdsourcing application to improve public engagement in transit planning\n", "abstract": " Governments increasingly turn to the Internet to aid in transparency, accountability, and public participation activities, and there is growing interest in innovative online problem-solving models to serve the public good. One such model, the crowdsourcing model, leverages the collective intelligence of online communities for specific purposes. Understanding how and why people participate in these kinds of activities is important for developing better new media tools for the public good going forward. In 2009, the Federal Transit Administration supported the Next Stop Design project, an attempt to use crowdsourcing for public participation in transit planning. Based on interviews with 23 Next Stop Design participants, the present applied communication study discusses the motivations of those participants to engage the project.", "num_citations": "241\n", "authors": ["2094"]}
{"title": "Crowdsourcing: A Model for Leveraging Online Communities\n", "abstract": " As our understanding of participatory cultures advances, there is a growing interest among practitioners and scholars in how best to take charge of the creative, productive capabilities of Internet users for specific purposes. A number of online businesses in the past decade have actively recruited individuals in online communities to design products and solve problems for them, often motivating an online community’s creative output or harnessing their creative input through the format of an open challenge with various rewards. Organizations that issue specific tasks to online communities in an open-call format engage in the practice of “crowdsourcing.” Crowdsourcing is a model for problem solving, not merely a model for doing business (Brabham, 2008a; Brito, 2008; Fritz et al., 2009; Haklay and Weber, 2008). The crowdsourcing model is also well suited to organizations’ marketing and public relations goals, as the …", "num_citations": "237\n", "authors": ["2094"]}
{"title": "Crowdsourcing applications for public health\n", "abstract": " Crowdsourcing is an online, distributed, problem-solving, and production model that uses the collective intelligence of networked communities for specific purposes. Although its use has benefited many sectors of society, it has yet to be fully realized as a method for improving public health. This paper defines the core components of crowdsourcing and proposes a framework for understanding the potential utility of crowdsourcing in the domain of public health. Four discrete crowdsourcing approaches are described (knowledge discovery and management; distributed human intelligence tasking; broadcast search; and peer-vetted creative production types) and a number of potential applications for crowdsourcing for public health science and practice are enumerated.", "num_citations": "230\n", "authors": ["2094"]}
{"title": "Using Crowdsourcing in Government\n", "abstract": " This report begins with an overview of crowdsourcing, what makes crowdsourcing work, and what distinguishes it from other instances of participatory culture often mistaken for crowdsourcing. A problem-based typology is then presented to make sense of crowdsourcing and understand when and how to deploy crowdsourcing in the business of government. This typology is illustrated with several cases from the public sector, and other possible applications for crowdsourcing by government are presented. The report concludes with 10 best practices and considerations for crowdsourcing, drawn from research on recent private and public crowdsourcing applications.", "num_citations": "164\n", "authors": ["2094"]}
{"title": "Crowdsourcing public participation in transit planning: preliminary results from the next stop design case\n", "abstract": " We recognize that the collective intelligence of communities is largely untapped by traditional public participation (P2) methods, which may result in less-than-ideal transit plans that neglect the needs of diverse constituencies. Mediated approaches may ameliorate contextual factors which inhibit participation in traditional methods, and, specifically, Web-based participatory activities would cast a wider net in the community, harnessing more and more diverse input. This paper discusses a P2 model utilizing “crowdsourcing,” which is a Web-based, distributed problem solving model already in use by a number of online businesses, a model which promises to be such an alternative P2 method for public transit planning. This paper draws from a Federal Transit Administration (FTA) pilot project focused on the application of crowdsourcing to bus stop design at the neighborhood scale. We introduce the concept of crowdsourcing and then discuss the components of transit stop design. This is followed by preliminary results from Next Stop Design, our first case study in transit stop design.", "num_citations": "74\n", "authors": ["2094"]}
{"title": "Crowdsourcing as a model for problem solving: Leveraging the collective intelligence of online communities for public good\n", "abstract": " As an application of deliberative democratic theory in practice, traditional public participation programs in urban planning seek to cultivate citizen input and produce public decisions agreeable to all stakeholders. However, the deliberative democratic ideals of these traditional public participation programs, consisting of town hall meetings, hearings, workshops, and design charrettes, are often stymied by interpersonal dynamics, special interest groups, and an absence of key stakeholder demographics due to logistical issues of meetings or lack of interest and awareness. This dissertation project proposes crowdsourcing as an online public participation alternative that may ameliorate some of the hindrances of traditional public participation methods.", "num_citations": "55\n", "authors": ["2094"]}
{"title": "How crowdfunding discourse threatens public arts\n", "abstract": " Crowdfunding platforms, such as Kickstarter and Indiegogo, have been the focus of considerable popular press news coverage in the past few years, with stories emphasizing how crowdfunding can bring indie creative projects into being through monetary contributions from several individuals online. As a method for financing small or risky artistic products unlikely to receive mainstream corporate or government support, crowdfunding has been celebrated in press coverage for “democratizing” the arts funding process. However, these same celebratory claims about crowdfunding giving everyday people a voice in bringing art into fruition eerily echo arguments in the United States by conservative groups to de-fund public arts programs. The very language crowdfunding proponents use may well fuel politicians hoping to unravel public arts funding. This article presents a critical discourse analysis of news coverage …", "num_citations": "51\n", "authors": ["2094"]}
{"title": "Crowdsourcing in the public sector\n", "abstract": " Crowdsourcing is a term that was coined in 2006 to describe how the commercial sector was beginning to outsource problems or tasks to the public through an open call for solutions over the internet or social media. Crowdsourcing works to generate new ideas or develop innovative solutions to problems by drawing on the wisdom of the many rather than the few. US local government experimented with rudimentary crowdsourcing strategies as early as 1989, but in the last few years local, state, and federal government have increasingly turned to crowdsourcing to enhance citizen participation in problem solving, setting priorities, and decision making. While crowdsourcing in the public sector holds much promise and is part of a larger movement toward more citizen participation in democratic government, many challenges, especially legal and ethical issues, need to be addressed to successfully adapt it for use in the public sector. Daren C. Brabham has been at the forefront of the academic study of crowdsourcing. This book includes extensive interviews with public and private sector managers who have used crowdsourcing. Brabham concludes with a list of the top ten best practices for public managers.", "num_citations": "48\n", "authors": ["2094"]}
{"title": "The Effectiveness of Crowdsourcing Public Participation in a Planning Context\n", "abstract": " In late 2009, the Next Stop Design project was launched to test the crowdsourcing model in a public participation context for transit planning. Crowdsourcing is an online, distributed problem solving and production model largely in use for business. It leverages the collective intelligence of online communities by soliciting ideas and solutions for an organization from these communities through the form of an open call. Next Stop Design was an online competition where users submitted bus stop shelter designs and voted on the designs of peers to determine a best design. The project provided an opportunity to assess the effectiveness of crowdsourcing as an alternative public participation method for government administration. Online public participation alternatives are increasingly the focus of governments seeking to overcome deficiencies in traditional public participation methods, and the specific online method of crowdsourcing is a promising ideation tool for participatory decision-making. To test Next Stop Design's effectiveness as a public participation tool participants were interviewed to determine their perceptions of the project. In all, 23 Next Stop Design participants were interviewed via instant messenger for this study. Findings presented here suggest that Next Stop Design was perceived to be a generally effective online deliberative democratic process, with perceived weaknesses concerning the facilitation of the project through public voting and the equality of participants on the site in light of apparent voting fraud in the competition.", "num_citations": "36\n", "authors": ["2094"]}
{"title": "Studying normal, everyday social media\n", "abstract": " Social media research has tended to focus on stand-out cases and has made use of big data methods to make claims about human experience and sociality. This commentary urges researchers to consider the everyday, normal experiences of most social media users, to consider the place of social media in a broader social context, and to consider marrying big data approaches with interviews and surveys of users.", "num_citations": "29\n", "authors": ["2094"]}
{"title": "Recruiting individuals to a crowdsourcing community: Applying motivational categories to an ad copy test\n", "abstract": " This study operationalizes different motivational categories to participate in crowdsourcing and tests them with a series of advertisements in different countries. We found that internalized extrinsic motivations were more appealing to individuals overall and that results differed across countries, which is novel in research about crowdsourcing.", "num_citations": "28\n", "authors": ["2094"]}
{"title": "The four urban governance problem types suitable for crowdsourcing citizen participation\n", "abstract": " Crowdsourcing is a method for harnessing the collective intelligence of online communities to solve specific problems or produce goods. Largely known as a business model, crowdsourcing has begun to make inroads as a supplemental public participation tool for governance, as a way to engage citizens in the business of government functions. Validating a new typology of crowdsourcing cases, this chapter outlines the four urban governance problem types that the crowdsourcing model can successfully address. This chapter also discusses the right of free speech in online crowdsourcing communities and its relevance for urban governance crowdsourcing applications in free societies. Concluding the chapter is an examination of crowdsourcing’s place in the policy-advisory spectrum and the risks associated with bringing crowdsourcing applications into public participation programs.", "num_citations": "23\n", "authors": ["2094"]}
{"title": "Finding the diamond in the rough: Exploring communication and platform in crowdsourcing performance\n", "abstract": " Ideas that rise to the top in crowdsourcing platforms are assumed to succeed because they are perceived to be the best ideas, but questions about the factors that influence the outperformance of one solution over another remain underexplored. The Peer Vetted Ideas model is proposed as an explanation of elements that affect performance in crowdsourcing for creative ideation solutions. Using content analysis and hierarchical multiple regression, the study examined the relationship between performance in a public sector crowdsourcing competition and (a) design concepts, (b) communication about the designs, and (c) platform context. Results indicate that crowdsourcing is not always a meritocratic process to produce the objective “best” ideas, but rather also depends on subjective communicative, temporal, and platform factors.", "num_citations": "22\n", "authors": ["2094"]}
{"title": "Managing Unexpected Publics Online: The Challenge of Targeting Specific Groups with the Wide-Reaching Tool of the Internet\n", "abstract": " As Internet-based tactics become commonplace in public relations practice, targeting campaigns to specific publics becomes more challenging. The global reach of the Internet challenges a public relations practitioner’s confidence that an online message targeted at a set of specific demographics will reach only the intended audience. Internet-based public relations campaigns can attract unexpected, or even unwanted, publics to a project or brand, and practitioners must be ready to manage these unexpected participants. This article examines unexpected publics that engaged an online public participation project focused on architectural design and transit planning. The project, which was targeted at everyday bus riders in Salt Lake City, Utah, attracted an international base of design professionals. These unexpected publics, who learned of the project through the Internet, caused global-local and amateurprofessional tensions that complicated the outcomes of the project. Through website analytic data, user registration data on the website, and interviews with project participants, this article explores these tensions and offers practical advice for managing unexpected publics online.Best practices in public relations (PR) assume a set of specific publics to which PR practitioners can target messages and forge brand relationships. At the same time, the centrality of new media technologies in many people’s lives makes PR efforts via the Internet and other digital channels increasingly appealing. What happens, though, when these two assumptions collide? Online PR efforts, even those targeted to local or specific demographic groups operate on the …", "num_citations": "21\n", "authors": ["2094"]}
{"title": "Crowdsourcing\n", "abstract": " Crowdsourcing is an online, distributed problem solving and production model where organizations tap the collective intelligence of online communities. A joining of top‐down management processes with bottom‐up open innovation processes, crowdsourcing can be used by organizations to solve four general types of problems related to information management or ideation. Crowds are motivated in a variety of ways and often consist of professionals or experts who self‐select into a given challenge, giving rise in recent years to calls for ethics and fair labor practices in crowdsourcing ventures.", "num_citations": "17\n", "authors": ["2094"]}
{"title": "Animated Blackness in Shrek.\n", "abstract": " Shrek, the animated summer blockbuster of 2001, presents troubling images of blackness, embodied through the character of Donkey, voiced by Eddie Murphy. That Donkey is an animated animal without actual black skin does not hide the fact that Donkey is a black character in support of the more important narrative of white characters falling in love. This essay examines Donkey primarily through the lens of Stuart Hall's three tropes of blackness--the native, the slave-figure, and the clown to consider the role animation can play to amplify and make palatable retrogressive views of racial equality. Shrek, a Pacific Data Images/DreamWorks SKG feature film directed by Andrew Adamson and Vicky Jenson, presents a very narrow conceptualization of blackness, providing its main intended audience, children, with a potential lesson in what blackness is and should be.", "num_citations": "15\n", "authors": ["2094"]}
{"title": "The deliberative politics of the consultative layer: Participation hopes and communication as design values of civic tech founders\n", "abstract": " Drawing from communication as design and the spirit of technology, this study investigated the political values embedded in consultative layer companies, with particular attention to the influence of normative deliberative democratic ideals in tech design. Interviews with the founders of consultative layer tech startups explored (a) founders' visions for their technologies and how they were incorporated, (b) the imagined user groups for these technologies, and (c) expected broader outcomes as a result of using their platforms. Six interrelated themes emerged in the analysis that illuminate ideologies, ideals, and pragmatic considerations embedded in the consultative layer, raising new theoretical and practical questions about the role of communication in understanding this emerging industry and its reimagining of government in the online space.", "num_citations": "10\n", "authors": ["2094"]}
{"title": "Noticing design/recognizing failure in the wake of hurricane Katrina\n", "abstract": " If good design strives to be invisible, then the aftermath of Hurricane Katrina is a warning to act on the visible flaws in design before they erupt. Knowing that poverty, poor race relations, and more existed in New Orleans before the disaster was to see the flaws in a larger social design.", "num_citations": "6\n", "authors": ["2094"]}
{"title": "How today’s digital landscape redefines the notion of control in public relations\n", "abstract": " In this research study, we examine journalist Dan Savage‘s creation of the―It Gets Better Project‖ in September 2010. Through the lens of the It Gets Better Project, we argue that PR practitioners are transforming from message creators to message curators and from brand managers to brand community managers with increasing frequency.", "num_citations": "2\n", "authors": ["2094"]}