{"title": "Empirical evidence on the link between object-oriented measures and external quality attributes: a systematic literature review\n", "abstract": " There is a plethora of studies investigating object-oriented measures and their link with external quality attributes, but usefulness of the measures may differ across empirical studies. This study aims to aggregate and identify useful object-oriented measures, specifically those obtainable from the source code of object-oriented systems that have gone through such empirical evaluation. By conducting a systematic literature review, 99 primary studies were identified and traced to four external quality attributes: reliability, maintainability, effectiveness and functionality. A vote-counting approach was used to investigate the link between object-oriented measures and the attributes, and to also assess the consistency of the relation reported across empirical studies. Most of the studies investigate links between object-oriented measures and proxies for reliability attributes, followed by proxies for maintainability. The …", "num_citations": "101\n", "authors": ["1549"]}
{"title": "Global software development projects in one of the biggest companies in Latvia: is geographical distribution a problem?\n", "abstract": " Global software development appears to be the latest trend in software engineering, bringing new opportunities as reaching mobility in resources, speeding time‐to‐market, obtaining extra knowledge, and increasing operational efficiency. Despite the popularity of the topic, there is a lack of research answering all the questions about how to perform in a distributed environment. This article describes research that aims to develop a framework for global project management and performance. In particular, the research shares information about the variety of collaboration models and project characteristics, and highlights areas of concern and specific risks examined in an observation of 19 distributed projects in a software development company in Latvia. The case study gives an overview of distributed projects emphasizing the specific risks such as organizational and cultural differences, language and time zone …", "num_citations": "66\n", "authors": ["1549"]}
{"title": "Requirements management in distributed projects\n", "abstract": " Global software development expands with every year providing software developers with new opportunities. However, practitioners face global challenges and threats particular for distributed environment that require new methods and tools to be implemented. This paper provides a report on requirements management practices in globally distributed projects in one of the leading software development organizations in Latvia. The paper discusses how to form requirement analysis teams wisely, how to reduce diversity between the involved parties, what to be aware of during the development phase, and how to facilitate successful communication for entire project.", "num_citations": "43\n", "authors": ["1549"]}
{"title": "Project outcome predictions: Risk barometer based on historical data\n", "abstract": " The influence of globalization on software development has been recognized as significant by many studies. Existence of unique factors that distinguish globally distributed software development environment increases the complexity of software development processes and brings challenges to project managers in achieving project success. This paper describes a study on globally distributed projects, which aims to determine the severity of global threats and provide an approach for sustainable support in managing project outcome predictions. Risk Barometer has been developed based on empirical data from industrial projects investigated during the study. It calculates the probability of negative outcome for global threats upon historical data. The results of this study provide practitioners that lack knowledge and experience a tool for more effective risk management, as well as cost and effort estimation for a …", "num_citations": "39\n", "authors": ["1549"]}
{"title": "A case study: coordination practices in global software development\n", "abstract": " Global Software Development (GSD) is a new challenge for software developers to reach mobility in resources, obtain extra knowledge, speed time-to-market and increase operational efficiency. However, the new trend is followed by specific risks and needs a deeper analysis for successful risk overcoming. This paper gives an insight into a research on GSD project performance improvement in one of the biggest software development companies in Latvia. Project management and coordination in distributed environment is a great challenge, though being not very widely explored. In this paper the author emphasizes the necessity of research in this area and provides an overview of coordination practices used in the organization chosen for the case study.", "num_citations": "37\n", "authors": ["1549"]}
{"title": "A framework for overcoming supplier related threats in global projects\n", "abstract": " The process of globalization expands with each year along with the growing complexity of software development. Outsourcing transforms a common way of producing software to distributed software life cycle activities among teams separated by various boundaries, such as contextual, organizational, cultural, temporal, geographical, and political. Risks associated with these boundaries make managers struggle with pressures unique to this type of environment. In this paper we describe a research that aims to investigate the nature of global risks and build a comprehensive and easy to use framework for risk management. We emphasize the necessity of awareness about global factors and threats that distinguish distributed projects and require adequate attention throughout the project.", "num_citations": "35\n", "authors": ["1549"]}
{"title": "Lessons learned from transferring software products to India\n", "abstract": " Globalization has influenced the way software is developed today, and many software organizations have started to actively utilize resources from around the world. However, these endeavors are recognized as very challenging, and they have attracted a lot of attention in software research in the past decade. Unlike many other research initiatives, which explore the complexities of distributed software development activities, the focus of this paper is on software transfers. Software transfers refer to activities that are moved from one location to another. The authors draw attention to the lessons learned from an empirical investigation of two transfer projects conducted at Ericsson. Both transfers were performed between a site in Sweden and a site in India. The observations outline a set of generic practices that have been found useful for transferring software development within a company. It also highlights a number of …", "num_citations": "31\n", "authors": ["1549"]}
{"title": "Knowledge Management in Globally Distributed Agile Projects--Lesson Learned\n", "abstract": " Knowledge management (KM) is essential for success in any software project, but especially in global software development where team members are separated by time and space. Software organizations are managing knowledge in various ways to increase transparency and improve software team performance. One way to classify these strategies is proposed by Earl who defined seven knowledge management schools. The objective of this research is to study knowledge creation and sharing practices in a number of distributed agile projects, map these practices to the knowledge management strategies and determine which strategies are most common, which are applied only locally and which are applied globally. This is done by conducting a series of semi-structured qualitative interviews over a period of time span during May, 2012-June, 2013. Our results suggest that knowledge sharing across remote …", "num_citations": "24\n", "authors": ["1549"]}
{"title": "Managing uncertainty in globally distributed software development projects\n", "abstract": " Global software development is not a phenomenon but a reality nowadays. However, it is still poorly explored. Lack of awareness of the particular factors inherited in the nature of globally distributed software projects makes practitioners struggle and invent new approaches to survive. It uncovers the necessity to support risk management activities. This paper describes a Knowledge Base and a Risk Barometer developed to support practitioners who lack experience in global projects. Particularities of globally distributed projects and their effect on project performance are formalized in a reusable framework for managing uncertainty. The described tools provide input for risk identification and help to evaluate risks based on the experience from former projects.", "num_citations": "23\n", "authors": ["1549"]}
{"title": "Distributed software development in an offshore outsourcing project: A case study of source code evolution and quality\n", "abstract": " ContextOffshore outsourcing collaborations can result in distributed development, which has been linked to quality-related concerns. However, there are few studies that focus on the implication of distributed development on quality, and they report inconsistent findings using different proxies for quality. Thus, there is a need for more studies, as well as to identify useful proxies for certain distributed contexts. The presented empirical study was performed in a context that involved offshore outsourcing vendors in a multisite distributed development setting.ObjectiveThe aim of the study is to investigate how quality changes during evolution in a distributed development environment that incurs organizational changes in terms of number of companies involved.MethodA case study approach is followed in the investigation. Only post-release defects are used as a proxy for external quality due to unreliable defect data found …", "num_citations": "22\n", "authors": ["1549"]}
{"title": "An exploratory study of software evolution and quality: Before, during and after a transfer\n", "abstract": " In the light of globalization it is not uncommon that different teams from different locations get involved in the development of a software product during its evolution. However, empirical evidence that demonstrates the effect of changing team members on software quality is scarce. In this paper, we investigate quality of a software product, across subsequent software releases, that was first developed in one location of Ericsson, a large multinational corporation, then jointly with an offshore location of the same company, and finally transferred offshore. To get a better understanding multiple data sources are used in the analysis: qualitative data, consisting of interviews and documentation, and quantitative data, consisting of release history and defect statistics. Our findings confirm an initial decline in efficiency and quality after a transfer, and highlight the areas of concern for companies that are considering transferring …", "num_citations": "22\n", "authors": ["1549"]}
{"title": "Cost savings in global software engineering: Where’s the evidence\n", "abstract": " The popularity of offshoring (developing software in low cost countries) keeps growing fueled by the rumors of significant costsavings. Despite claims that offshoring is motivated for less offensive reasons than simply reducing costs, the main driving force has always been related to costs [2]. The realization of economic benefits, however, seems to be mystified, resulting in a lack of clarity. On one hand, industrial experiences demonstrate that the assumed benefits are not always achieved and thus shall not be taken for granted [5]. On the other hand, senior executives are easily driven away by promised salary differences. An industry report about a successful offshore outsourcing project with timely delivered good quality software mentions attractive hourly rates in India versus Germany and consequent “significant cost saving” expressed as “several million€/year”[1]. But how trustworthy is such claims? Is there any actual evidence and transparency in the way costs have been calculated? Other industrial studies indicate that cost-savings are not as drastic as pure salary comparisons suggest, due to additional managerial overhead [5],[6]. In fact, the benefit of low-cost labor must be weighed against the risk of missed deadlines, dissatisfied users, and failure to reduce development costs. So what shall we trust? To shed some light on this matter, we trace the claims of cost-savings and offer our judgment of the evidence.Evidence is the basis for decision-making. The most commonly known use of evidence in society is probably in law. Taking the juridical system as a metaphor, we here extend, summarize and use a concept denoted the evidence profile …", "num_citations": "20\n", "authors": ["1549"]}
{"title": "Spatial knowledge creation and sharing activities in a distributed agile project\n", "abstract": " Knowledge management (KM) is key to the success of any software organization. KM in software development has been the center of attention for researchers due to its potential to improve productivity. However, the knowledge is not only stored in repositories but is also shared in the office space. Agile software development teams use the benefits of shared space to foster knowledge creation. But it is difficult to create and share this type of knowledge, when team members are distributed. This participatory single-case study indicates that, distributed team members rely heavily on knowledge codification and application of tools for knowledge sharing. We have found that, the studied project did not use any specific software or hardware that would enable spatial knowledge creation and sharing. Therefore parts of the knowledge items not codified were destined to be unavailable for remote team members.", "num_citations": "18\n", "authors": ["1549"]}
{"title": "Software development processes in globally distributed environment\n", "abstract": " As a result of globalization, software is nowadays more often produced by development effort from multiple locations. While global software development is regarded as more challenging than even the most complex project managed entirely in-house, standards or methodologies dedicated for this type of projects are still lacking. Based on an extensive literature review towards an understanding of industrial practice regarding software development processes, authors of this paper conclude that the evidence on how such projects are organized is scarce. Despite the limited evidence, authors present the deduced models of development processes presented in selected literature and summarize the main challenges that may affect project management processes.", "num_citations": "17\n", "authors": ["1549"]}
{"title": "Towards a contemporary understanding of motivation in distributed software projects: solution proposal\n", "abstract": " Team motivation in software engineering is reported to have the largest impact on productivity, software quality and project overall success. Yet, as it is a soft factor and thus difficult to quantify, it usually takes a backseat. In fact, research on motivation and its interplay with different environmental factors in software engineering projects is scarce. Built on the basis of a recent systematic review on software engineers’ motivation, in this paper, we emphasize the lessons learned from related studies regarding the factors determining team motivation. Further implications of distributed environment on motivation and the positive impact of agile practices are discussed and illustrated by examples from related studies. The contrasted project types (distributed and agile) suggest that blending agility into distribution might solve problems inherent in this type of environment. Finally, future research directions are suggested for project improvement through motivation.", "num_citations": "16\n", "authors": ["1549"]}
{"title": "Socio-technical congruence sabotaged by a hidden onshore outsourcing relationship: lessons learned from an empirical study\n", "abstract": " Despite the popularity of outsourcing arrangements, distributed software development is still regarded as a complex endeavor. Complexity primarily comes from the challenges in communication and coordination among participating organizations. In this paper we discuss lessons learned from participatory research carried out in a highly distributed onshore outsourcing project. Previous research established that socio-technical congruence principles alleviate distributed work. In practice we have found that alignment between the systems structure and organizational structure can be studied from different abstraction levels and also during different phases of project lifecycle. We have found that official organizational structure differed from the applied one, which meant that the planned alignment in task allocation strategies was broken. Our findings indicate that the lack of socio-technical congruence caused …", "num_citations": "14\n", "authors": ["1549"]}
{"title": "Global software development project management–distance overcoming\n", "abstract": " Global software development becomes one of the most significant trends in the information technology market expansion. This research paper deals with the difficulties and risks examined in global projects in one of the software development companies in Latvia. The research uncovers areas of concern and aims to develop a standardized framework for global project management overcoming the problems brought by distance between the parties involved. The author emphasizes the necessity of unified process framework in global project management and provides her research approach on the way to a deep understanding of global software development.", "num_citations": "14\n", "authors": ["1549"]}
{"title": "Virtual teams [Guest editors' introduction]\n", "abstract": " Over the past decades, today, and in the future, business contexts in software organizations and the common ways of developing software are changing dramatically. Formation of teams in distributed environments, virtual or not, calls for new ways of working across geographic, temporal, and cultural boundaries. This, however, also requires effective leadership approaches enabled through systems, processes, technology, and people. The authors pulled together this special issue to provide some ideas and strategies for practitioners and open questions for researchers. The Web extra at http://youtu.be/YxE6S6MM3Ws is an audio recording in which author IEEE Software Multimedia Editor Davide Falessi interviews Laurence Tratt and Adam Welc, guest editors of the magazine's September/October 2014 issue, about the field of programming languages.", "num_citations": "13\n", "authors": ["1549"]}
{"title": "Measuring awareness in cross-team collaborations--distance matters\n", "abstract": " Developing and maintaining team awareness within and across teams working in the same project helps team members in aligning their activities and facilitates implicit coordination. This requires both task and presence awareness. In this paper, we share our findings from a survey in which we measured the level of team awareness in cross-team collaborations with varying degree of separation. To measure the levels of awareness we asked questions like who is who, who knows what, who is on a vacation, who depends on whom and alike. Results from surveying 17 pairs of teams from 15 organizations indicate that level of awareness in cross-team collaborations is generally lower than that within the teams. We also found that task and presence awareness levels are independent and can vary. In addition to distance, we identified a few other factors with potential positive and negative influence on team awareness.", "num_citations": "13\n", "authors": ["1549"]}
{"title": "An ISO 9001: 2000 Certificate and Quality Awards from Outside–What’s Inside?–A Case Study\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "12\n", "authors": ["1549"]}
{"title": "Distributed project management\n", "abstract": " This chapter is dedicated to companies engaged in collaborative software projects with staff distributed across several locations. The chapter is organized around ten problem areas. Each problem area starts with a common misconception, followed by a discussion of complexities associated with distributed development as opposed to co-located development, practices known for addressing these complexities, and a short list of implications for practice. The aim is to illuminate the key complexities of managing distributed development projects. While project managers in co-located projects are equipped with tools, practices, and methods, these are often of little help when dealing with the challenges of distributed environment. Hence, inexperienced managers often fail to foresee and proactively address the common problems. The readers will learn to distinguish different types of distributed projects (including …", "num_citations": "11\n", "authors": ["1549"]}
{"title": "Classification of software transfers\n", "abstract": " Many companies have development sites around the globe. This inevitably means that development work may be transferred between the sites. This paper defines a classification of software transfer types, it divides transfers into three main types: full, partial and gradual transfers to describe the context of a transfer. The differences between transfer types, and hence the need for a classification, are illustrated with staffing curves for two different transfer types. The staffing curves are obtained through a combination of interviews with both high-level management and a group of experts, and an industrial case study. From the empirical work, it is concluded that the distribution of personnel differs for different types of transfer, which means that it is crucial to be clear about different classes of software transfers. If not, it is easy to underestimate the effort needed to transfer software work as well as additional costs related to …", "num_citations": "11\n", "authors": ["1549"]}
{"title": "Agile teams in large-scale distributed context: Isolated or connected?\n", "abstract": " Background: Agile development heavily relies on effective communication and coordination. Large-scale software development, where many teams are involved in developing often complex projects-even more so. As projects grow more complex, there is a finite limit to the amount of information that one person or a team within that project can possess at a given time. When we have one or two agile teams in a project, achieving good communication and coordination is easy. In fact, agile teams can be self-going. However, when there are many teams, should they be governed and supported or autonomous? Can they work in isolation?Aim: We aim to understand how isolated or connected are the teams in large-scale software development and answer a number of questions: Who supports the teams in their daily work? How often do teams communicate and coordinate with external contacts? Are supporting roles …", "num_citations": "9\n", "authors": ["1549"]}
{"title": "Towards understanding of software engineer motivation in globally distributed projects\n", "abstract": " Motivation in software engineering is reported to be a source for performance improvement, which leads to project overall success. Since it is a soft factor and difficult to quantify it is usually neglected. Research in this field is rather scarce and outdated. On the basis of a recent systematic review of software engineers' motivation we set an agenda for further investigation of the role of motivation in contemporary projects. As software organizations nowadays seek opportunities inherited in both - global software development (GSD) and agile projects, it is important to understand how different project environments influence motivation.", "num_citations": "7\n", "authors": ["1549"]}
{"title": "Agility across time and space: making agile distributed development a success\n", "abstract": " Rather than deciding whether or not to get involved in global sourcing, many companies are facing decisions about whether or not to apply agile methods in their distributed projects. These companies are often motivated by the opportunities to solve the coordination and communication difficulties associated with global software development. Yet while agile principles prescribe close interaction and co-location, the very nature of distributed software development does not support these prerequisites. Šmite, Moe, and Ågerfalk structured the book into five parts. In “Motivation” the editors introduce the fundamentals of agile distributed software development and explain the rationale behind the application of agile practices in globally distributed software projects.“Transition” describes implementation strategies, adoption of particular agile practices for distributed projects, and general concepts of agility.“Management” details practical implications for project planning, time management, and customer and subcontractor interaction.“Teams” discusses agile distributed team configuration, effective communication and knowledge transfer, and allocation of roles and responsibilities. Finally, in the “Epilogue” the editors summarize all contributions and present future trends for research and practice in agile distributed development. This book is primarily targeted at researchers, lecturers, and students in empirical software engineering, and at practitioners involved in globally distributed software projects. The contributions are based on sound empirical research and identify gaps and commonalities in both the existing state of the art and state of the practice. In …", "num_citations": "7\n", "authors": ["1549"]}
{"title": "New forms of work in the light of globalization in software development\n", "abstract": " Globalization in software development introduced significant changes in the way organizations operate today. Software is now produced by team members from geographically, temporally and culturally remote sites. Organizations seek benefits that global markets offer and face new challenges. Naturally resistant to change, these organizations often do not realize the necessity for tailoring existing methods for distributed collaboration. Our empirical investigation shows a great variety in the ways organizations distribute responsibilities across remote sites and conclude that these can be divided into two main categories: joint collaboration that requires investments in team building and independent collaboration that requires investments in knowledge management and transfer. Finally, we discuss practices that are applied in industry to overcome these challenges and emphasize necessity to fully understand the pros …", "num_citations": "7\n", "authors": ["1549"]}
{"title": "Results of the 1st international workshop on impact of agile practices (ImpAct 2015)\n", "abstract": " Agile software development has become well known to the community and is nowadays frequently used for the development of different kinds of software systems. Agile methods are widely spread and often adapted to the context-specific needs. The adaptations constitute reductions and/or extensions of agile practices. Yet, we have limited knowledge about the impact of some of the individual practices, which is crucial to justify organizational process improvements. To work on this topic, we initiated an international workshop and invited researchers and practitioners to work on different aspects related to the impact of agile practices (ImpAct). This paper presents the results and future work of the first ImpAct-workshop. We will report in particular on a meta-model for the impact of agile practices, how to deal with context-aspects, and we instantiated some impacts based on experiences of the workshop participants. In …", "num_citations": "5\n", "authors": ["1549"]}
{"title": "Expectations and achievements: a longitudinal study on an offshoring strategy\n", "abstract": " Offshore software development has gained momentum and most of software companies today have implemented offshore strategies of some sort. Many of these strategies are enforced by corporate top management and driven by assumptions that lower development wages guarantee cheaper and better software development. In practice, offshore software development is associated with many risks, and achievement of the expected benefits is not as straightforward as the rumor has it. In this paper we explore an implementation of an offshore strategy in a Swedish software company that opened its offshore branch in Russia. Based on extensive documentation analysis we create an overview of the initially expected benefits and obstacles that prevailed among onshore product and development unit managers. Years after implementation of the offshore insourcing strategy we asked these managers about the achievement of their expectations. We observed that the company documented various expected benefits when implementing an offshoring strategy and also concerns that some of these benefits might not be achieved. Seven years after its implementation, the offshoring strategy was overall considered working, however the expected benefits were not fully achieved. More importantly, several gaps were identified, that suggest that the enforced strategy has resulted in a stable but not beneficial collaboration from the onshore perspective.", "num_citations": "5\n", "authors": ["1549"]}
{"title": "Decision support for offshore insourcing software development\n", "abstract": " Proximity to customers and the possibility of accessing new and prospective markets are some of the factors that compel companies to consider various sourcing options and go global. One sourcing option that has consequently become popular is Offshore insourcing. Though it is appealing as a business strategy due to the perceived benefits, there are some strategies that may inexplicably impact software quality. The objective of this research work is to focus on producing empirical evidence that is valuable input to support decision-making during offshore insourcing projects. The input will help with evaluating different strategies on their impact on quality.", "num_citations": "5\n", "authors": ["1549"]}
{"title": "Global software development improvement\n", "abstract": " This thesis addresses particularities of globally distributed software development (GSD). It is based on a three years long research with industrial background of one of the leading exporting software houses in Latvia.The author explores the nature of globally distributed software projects in contradiction to common in-house projects and derives a set of particular factors and threats that endanger success of global collaboration. To provide practical application of the results this research also contains a set of practices, methods and tools that help to overcome the unique factors inherited in the heterogeneous nature of globally distributed environment. Global factors, threats and practices are accumulated in a risk-oriented framework for global project outcome prediction and elimination that is supplemented by supporting tools–Knowledge Base and Risk Barometer. Using these tools, managers without prior knowledge about global projects will receive a comprehensive overview of the global factors and threats, frequency of their occurrence and computerized summary of their impact on major project success criteria, including budget, schedule, customer satisfaction and other. This thesis also includes guidelines for global risk management and sustainable process improvement. The author especially emphasizes importance of awareness of global factors and threats that even experienced managers often overlook. Additional empirical findings from the case studies and field observations provide novel and original insights in how globally distributed software projects are run by one of the major Latvian software houses. The author touches important …", "num_citations": "5\n", "authors": ["1549"]}
{"title": "A proposed way for european software industries to achieve growth within the global marketplace\n", "abstract": " Global market expansion forces the competition in the field of software development to grow extremely fast. Accordingly, countries that base their brand in the field of information technologies are looking forward to quality and productivity improvement along with price reduction. One of the major trends in the global market is outsourcing, which is considered to be an opportunity to achieve best knowledge, extra resources and assurance of quality development, speed time to market, and cut costs. The role of emerging nations in this context increases every day, pushing out the old players. This article will therefore suggest how software development should change within the Northern Ireland (NI) software industry and adopt a global software development model in order to continue as a major player within the global software development industry. Copyright © 2006 John Wiley & Sons, Ltd.", "num_citations": "5\n", "authors": ["1549"]}
{"title": "A Case Study of Job Satisfaction in an Offshore Office: Is Software Engineers’ Motivation at Risk?\n", "abstract": " Nowadays many software development companies have become global and employ people in different sites around the world. It is common that long-term maintenance software development projects at their later stages migrate to the cheaper sites, while product management and control is performed at a distance. This, however, has one important implication-offshoring of old projects might significantly influence job satisfaction and lead to high turnover of the employees in offshore sites. In this case study we investigate job satisfaction through surveying software engineers in a Russian offshore site of a Swedish company and interviewing an employee who decided to quit. Our study shows that the nature of maintenance projects and crosssite collaboration may negatively impact software engineers’ motivation, which is believed to be a key factor for project success in terms of productivity and conformance quality. The aim of this case study is to acknowledge motivational risks in order to mitigate them, and thus prevent attrition of experienced employees in the future.", "num_citations": "4\n", "authors": ["1549"]}
{"title": "Global software development process management: Problem statement\n", "abstract": " This problem statement paper represents a starting point for a research in global software development. In particular: outsourcing relationship definition and management, as well as ways of software development process improvement. The lack of research in this area precludes the full understanding of how to manage outsourcing projects and parties relationship. The authors give an overview of the existing research on this topic and outline the main problems and new trends by representing a framework for future research in this area. As a result of this research the authors plan to summarize it in a set of process diagrams, recommendations and supporting tools, which will enhance the knowledge in this area and help to standardize and improve the process of global software development.", "num_citations": "4\n", "authors": ["1549"]}
{"title": "Validity of research on large-scale agile projects\n", "abstract": " In this extended abstract we introduce and briefly discuss key challenges that possess threats to validity of empirical studies conducted within the context of distributed agile software development in the large scale. These challenges are based on our own research experience with agile and global software development. To lead our discussion we use a hypothetical research project (see Fig. 1), in which a team of researchers conducts empirical studies on a large-scale agile project consisting of three agile teams in two geographically distant locations. Common to many studies in such environments, researchers in our example have access only to one of the sites, and therefore data collection is performed primarily onshore. To get the offshore perspective researchers in our example distribute questionnaires to the remote sites with the help of the onshore team, as well as elicit additional information regarding the remote teams from the onshore team members.", "num_citations": "3\n", "authors": ["1549"]}
{"title": "What Happens, When Software Product Development Companies Go Global?\n", "abstract": " Globalization has significantly changed the way the market operates today. In particular, it motivated many software companies expand through acquisitions and utilize skillful resources regardless of their location around the globe. Global software engineering endeavors have been widely explored in the research literature for the past decade and associated with many challenges caused by geographic, temporal and cultural distances. While software development as such is quite a challenging task, involvement of dispersed and diverse software teams created a perceived crisis with respect to, so called, soft issues that have not been targeted in the past. The effect of distribution versus co-location is still under investigation, and the most commonly referred challenges are related to communication, coordination and control. Thus the focus of research to a large extent has shifted from software product as the center, to …", "num_citations": "3\n", "authors": ["1549"]}
{"title": "How European Software Industries Can Prepare For Growth Within The Global Marketplace-Northern Irish Strategies\n", "abstract": " Global market expansion forces the competition in the field of software development to grow extremely fast. Accordingly, countries that base their brand in the field of information technologies are looking forward to quality and productivity improvement along with price reduction. One of the major trends in the global market is outsourcing, which is considered to be an opportunity to achieve best knowledge, extra resources and assurance of quality development, speed time-to-market, and cut costs. The role of emerging nations in this context increases every day, pushing out the old players. This paper will therefore suggest how software development should change within the Northern Ireland (NI) software industry and adopt a global software development model in order to continue as a major player within the global software development industry.", "num_citations": "3\n", "authors": ["1549"]}
{"title": "Agile Enterprise Architecture by Leveraging Use Cases.\n", "abstract": " 1School of Business, Anhui University, No. 111 Jiulong Road, Hefei, People's Republic of China 2Department of Computer Science, Norwegian University of Science and Technology, Trondheim, Norway 3School of Business, Örebro University, Örebro, Sweden 4Department of Software Engineering, Blekinge Institute of Technology, Karlskrona, Sweden", "num_citations": "2\n", "authors": ["1549"]}
{"title": "Corporate-Level Communities at Ericsson: Parallel Organizational Structure for Fostering Alignment for Autonomy\n", "abstract": " Organizational management traditionally has taken care of all the important strategy, structure, and work-design decisions, as well as most of the ongoing decisions about work procedures. In large-scale corporations with many geographically distributed sites and high divisional detachment, such strategies are yet doomed to result in implementing irrelevant work methods and procedures that conflict with the local interests. As Tayloristic habits are disappearing, organizations willingly or unwillingly change their decision-making approaches to enable more participation and influence from the performers. These trends are associated with the rise of participation-based parallel structures, such as quality circles, task forces or communities of practice. In this paper, we present our findings from studying corporate-level communities by the means of a multicase study at Ericsson. We found that the main hindrances are related to the limited decision-making authority of parallel structure, member selection and achieving representation across the organizational units. Our results suggest that parallel structures highly depend on the authority of the members within their local communities, and their ability to not only channel the dialog between the units they represent and the community, but also enable the active engagement of the unit in the community studies. As such, we believe that special attention shall be put on the ambassador role of the community members.", "num_citations": "2\n", "authors": ["1549"]}
{"title": "Learning and Performance Evolution of Immature Remote Teams in Large-ScaleSoftware Projects: An Industrial Case Study\n", "abstract": " Background: Recruitment and onboarding of software developers are essential steps in software development undertakings. The need for adding new people is often associated with large-scale long-living projects and globally distributed projects. The formers are challenging because they may contain large amounts of legacy (and often complex) code (legacy projects). The latters are challenging, because the inability to find sufficient resources in-house may lead to onboarding people at a distance, and often in many distinct sites. While onboarding is of great importance for companies, there is little research about the challenges and implications associated with onboarding software developers and teams in large-scale globally distributed projects with large amounts of legacy code. Furthermore, no study has proposed any systematic approaches to support the design of onboarding strategies and evaluation of onboarding results in the aforementioned context.Objective: The aim of this thesis is two-fold: i) identify the challenges and implications associated with onboarding software developers and teams in large-scale globally distributed legacy projects; and ii) propose solutions to support the design of onboarding strategies and evaluation of onboarding results in large-scale globally distributed legacy projects.Method: In this thesis, we employed literature review, case study, and business process modeling. The main case investigated in this thesis is the development of a legacy telecommunication software product in Ericsson.Results: The results show that the performance (productivity, autonomy, and lead time) of new developers/teams …", "num_citations": "2\n", "authors": ["1549"]}
{"title": "Low degree of separation does not guarantee easy coordination\n", "abstract": " In the times of increased global competition, software companies are forced to search for more effective development practices and often team up with onshore and offshore partners to develop faster and better products. In this paper we empirically explore a highly distributed onshore development project with a complex coordination structure. Our findings demonstrate that onshore development projects are not protected from coordination and communication challenges and task allocation complexities. Previously reported qualitative findings regarding organizational problems in this paper are supplemented with quantitative measurements of the true coordination delays and additional analysis of coordination patterns and their evolution.", "num_citations": "2\n", "authors": ["1549"]}
{"title": "Informācijas tehnoloģijas nozares tiesību un standartu pamati\n", "abstract": " Šīs grāmatas galvenie adresāti ir pirmā līmeņa profesionālās augstākās izglītības programmu studenti, kuri vēlas iegūt ceturtā līmeņa profesionālo kvalifikāciju „programmētājs”. Pašreiz šādas studiju programmas tiek īstenotas vairākās Latvijas augstākās izglītības iestādēs. Programmas balstās uz PHARE projekta „Profesionālā izglītība 2000” atziņām un tā ietvaros izstrādāto programmētāja profesijas standartu un studiju paraugprogrammu. Profesijas standarts prasa zināšanas sadaļā „IKT nozares tiesību pamati un standarti”, bet studiju paraugprogramma paredz kursus „Nozares tiesību pamati un standarti” un „Darba aizsardzība un ergonomika”. Grāmatas trešais autors Juris Borzovs savulaik ir piedalījies minētajā PHARE projektā un izstrādājis attiecīgā kursa struktūru, bet kursa saturs fragmentāri jau agrāk ir lasīts LU un RTU bakalaurantūras un maģistrantūras kursos „Programmēšanas metodoloģija” un „Programmatūras kvalitāte”, kā arī Rīgas Informācijas tehnoloģijas institūta ts elitārajos lekciju kursos „Lielu un svarīgu informācijas sistēmu projektu uzsākšana un attīstīšana”. Grāmata ir izaugusi no pirmo divu autoru Darjas Šmites un Daiņa Dosberga maģistra darbiem, kuru izstrādi vadījis trešais autors. Juris Borzovs ir arī šīs grāmatas redaktors.", "num_citations": "2\n", "authors": ["1549"]}
{"title": "Ethics and law on the electronic frontier\n", "abstract": " The new electronic relations have brought as much benefits as duties. The society uses more often computers in every day life than ever. Unfortunately, cyberspace bounds are huge and its regulation is very complicated. In many cases the users are responsible for his security. That is why Electronic Law knowledge is useful and important for the new society. The most powerful computer and net users are those who are educated in Computer Science. Various authorities in the field of Computer Science education are urging the necessity of topics on legal regulation of the electronic society. Several universities in Latvia starting from the 2002/2003 study year have implemented a new course on``IT Industry Standards, Legislation, Labour Protection and Ergonomics''. The topic is extended considering the students being programmers, computer users and hired workers. This paper describes the demand for teaching …", "num_citations": "2\n", "authors": ["1549"]}
{"title": "Boost the Potential of EA: Essential Practices\n", "abstract": " 1School of Business, Anhui University, No. 111 Jiulong Road, Hefei, People's Republic of China 2Department of Computer Science, Norwegian University of Science and Technology, Trondheim, Norway 3School of Business, Örebro University, Örebro, Sweden 4Department of Software Engineering, Blekinge Institute of Technology, Karlskrona, Sweden", "num_citations": "1\n", "authors": ["1549"]}
{"title": "Fair comparison of developing software in different locations: dynamic decision model\n", "abstract": " While offshore software development is frequently looked at in simple economic terms, assumed benefits are not always achieved. This can be attributed to unexpectedly high transition costs and a number of extra costs for maintaining a sourcing strategy. When offshoring fails, companies need to revisit their decision. In this paper, an analytical model is proposed to support evaluation of offshoring strategies and decision options. The model focuses on value comparison, and treats outcomes of offshoring relationships more fairly and realistically than a naïve salary comparison. The model is a development of models with extensions motivated by lessons learned from two empirical cases. The model is designed to consider more decision outcomes than previously suggested. In contrast to current practice focusing on economic profits from the salary differences between onshore and offshore, we focus on the …", "num_citations": "1\n", "authors": ["1549"]}
{"title": "Summary of the 1st international workshop on impact of agile practices (ImpAct 2015)\n", "abstract": " Agile software development has become well known to the community and is nowadays frequently used for the development of different kinds of software systems. Agile methods are widely spread and often adapted to the context-specific needs. The adaptations constitute reductions and/or extensions of agile practices. Yet, we have limited knowledge about the impact of some of the individual practices, which is crucial to justify organizational changes. To systemize the knowledge of the impact of agile practices, we launch this workshop and invite researchers and practitioners to work on a documenting and accumulating their experiences in a knowledge base.", "num_citations": "1\n", "authors": ["1549"]}
{"title": "Universities and Their Underused Potential for Lifelong Education and Training\n", "abstract": " The IT industry has been declared to be a priority in Latvia. The industry has grown very rapidly to produce between 5 and 6% of Latvian GDP. At this time, there is a shortage of some 8,000 IT specialists. The importance of training new and highly professional specialists, as well as of supporting continuous professional growth and training for existing representatives of the industry–this is an urgent need. In this paper, we describe efforts that have been made in upgrading and enriching the relevant study programmes and services at the University of Latvia so as to respond to the needs of the IT industry. We emphasise the fact that the university is not used sufficiently for lifelong education and training, our hope being that there will be stronger links between academia and industry.", "num_citations": "1\n", "authors": ["1549"]}
{"title": "Towards an understanding of sourcing decisions\n", "abstract": " A variety of new forms of business are enabled through globalization and practiced by software organizations today. While companies go global to reduce their development costs, access a larger pool of resources and explore new markets, it is often assumed that the level of services shall remain the same after implementing the sourcing decisions. In contrast, critical studies identified that global software development is associated with unique challenges, and a lot of global projects fail to mitigate the implications of a particular environment. In this paper we explore offshore insourcing decisions in an empirical field study conducted at Ericsson. A set of questions for consideration emerged from empirical observations of a software transfer project and was used as a basis for building an insourcing decision model. We discuss the ingredients of insourcing decision process and emphasize that due to a wide variability in the choices, the steps towards a global initiative are not, and should not be the same for every company and project. Finally, the companies should carefully select their what, where, when, how and why strategies paying attention to alignment of each selected decision and their contribution to the achievement of the expected benefits.", "num_citations": "1\n", "authors": ["1549"]}