{"title": "Identifying structural variation in haploid microbial genomes from short-read resequencing data using breseq\n", "abstract": " Mutations that alter chromosomal structure play critical roles in evolution and disease, including in the origin of new lifestyles and pathogenic traits in microbes. Large-scale rearrangements in genomes are often mediated by recombination events involving new or existing copies of mobile genetic elements, recently duplicated genes, or other repetitive sequences. Most current software programs for predicting structural variation from short-read DNA resequencing data are intended primarily for use on human genomes. They typically disregard information in reads mapping to repeat sequences, and significant post-processing and manual examination of their output is often required to rule out false-positive predictions and precisely describe mutational events. We have implemented an algorithm for identifying structural variation from DNA resequencing data as part of the breseq computational pipeline for predicting …", "num_citations": "168\n", "authors": ["1910"]}
{"title": "Predator confusion is sufficient to evolve swarming behaviour\n", "abstract": " Swarming behaviours in animals have been extensively studied owing to their implications for the evolution of cooperation, social cognition and predator–prey dynamics. An important goal of these studies is discerning which evolutionary pressures favour the formation of swarms. One hypothesis is that swarms arise because the presence of multiple moving prey in swarms causes confusion for attacking predators, but it remains unclear how important this selective force is. Using an evolutionary model of a predator–prey system, we show that predator confusion provides a sufficient selection pressure to evolve swarming behaviour in prey. Furthermore, we demonstrate that the evolutionary effect of predator confusion on prey could in turn exert pressure on the structure of the predator's visual field, favouring the frontally oriented, high-resolution visual systems commonly observed in predators that feed on swarming …", "num_citations": "150\n", "authors": ["1910"]}
{"title": "The evolutionary origin of somatic cells under the dirty work hypothesis\n", "abstract": " Experimental evolution of digital organisms suggests that mutagenic side effects associated with performing valuable metabolic work can produce germ-soma differentiation in multicellular organisms.", "num_citations": "67\n", "authors": ["1910"]}
{"title": "Evolution of swarming behavior is shaped by how predators attack\n", "abstract": " Animal grouping behaviors have been widely studied due to their implications for understanding social intelligence, collective cognition, and potential applications in engineering, artificial intelligence, and robotics. An important biological aspect of these studies is discerning which selection pressures favor the evolution of grouping behavior. In the past decade, researchers have begun using evolutionary computation to study the evolutionary effects of these selection pressures in predator-prey models. The selfish herd hypothesis states that concentrated groups arise because prey selfishly attempt to place their conspecifics between themselves and the predator, thus causing an endless cycle of movement toward the center of the group. Using an evolutionary model of a predator-prey system, we show that how predators attack is critical to the evolution of the selfish herd. Following this discovery, we show that …", "num_citations": "46\n", "authors": ["1910"]}
{"title": "Markov brains: A technical introduction\n", "abstract": " Markov Brains are a class of evolvable artificial neural networks (ANN). They differ from conventional ANNs in many aspects, but the key difference is that instead of a layered architecture, with each node performing the same function, Markov Brains are networks built from individual computational components. These computational components interact with each other, receive inputs from sensors, and control motor outputs. The function of the computational components, their connections to each other, as well as connections to sensors and motors are all subject to evolutionary optimization. Here we describe in detail how a Markov Brain works, what techniques can be used to study them, and how they can be evolved.", "num_citations": "39\n", "authors": ["1910"]}
{"title": "Using group selection to evolve leadership in populations of self-replicating digital organisms\n", "abstract": " This paper describes a study in the evolution of distributed cooperative behavior, specifically leader election, through digital evolution and group selection. In digital evolution, a population of self-replicating computer programs exists in a user-defined computational environment and is subject to instruction-level mutations and natural selection. Group selection is the theory that the survival of the individual is linked to the survival of the group, thus encouraging cooperation. The results of experiments using the Avida digital evolution platform demonstrate that group selection can produce populations capable of electing a leader and, when that leader is terminated, electing a new leader. This result serves as an existence proof that group selection and digital evolution can produce complex cooperative behaviors, and therefore have promise in the design of robust distributed computing systems.", "num_citations": "33\n", "authors": ["1910"]}
{"title": "Critical interplay between density-dependent predation and evolution of the selfish herd\n", "abstract": " Animal grouping behaviors have been widely studied due to their implications for understanding social intelligence, collective cognition, and potential applications in engineering, artificial intelligence, and robotics. An important biological aspect of these studies is discerning which selection pressures favor the evolution of grouping behavior. The selfish herd hypothesis states that concentrated groups arise because prey selfishly attempt to place their conspecifics between themselves and the predator, thus causing an endless cycle of movement toward the center of the group. Using an evolutionary model of a predator-prey system, we show that the predator attack mode plays a critical role in the evolution of the selfish herd. Following this discovery, we show that density-dependent predation provides an abstraction of Hamilton's original formulation of\" domains of danger.\" Finally, we verify that density-dependent …", "num_citations": "28\n", "authors": ["1910"]}
{"title": "Cooperative network construction using digital germlines\n", "abstract": " This paper describes a study in the evolution of cooperative behavior, specifically the construction of communication networks, through digital evolution and multilevel selection. In digital evolution, a population of self-replicating computer programs exists in a user-defined computational environment and is subject to instruction-level mutations and natural selection. Multilevel selection links the survival of the individual to the survival of its group, thus encouraging cooperation. The results of experiments using the Avida digital evolution platform demonstrate that populations of digital organisms are capable of constructing communication networks, and that these networks can exhibit desired properties depending on the selective pressures used. We also show that the use of a digital germline can significantly improve evolvability of cooperation.", "num_citations": "22\n", "authors": ["1910"]}
{"title": "Directed evolution of communication and cooperation in digital organisms\n", "abstract": " This paper describes a study in the use of digital evolution to produce cooperative communication behavior in a population of digital organisms. The results demonstrate that digital evolution can produce organisms capable of distributed problem solving through interactions between members of the population and their environment. Specifically, the organisms cooperate to distribute among the population the largest value sensed from the environment. These digital organisms have no “built-in” ability to perform this task; each population begins with a single organism that has only the ability to self-replicate. Over thousands of generations, random mutations and natural selection produce an instruction sequence that realizes this behavior, despite continuous turnover in the population.", "num_citations": "20\n", "authors": ["1910"]}
{"title": "Evolution of an artificial visual cortex for image recognition\n", "abstract": " Evolutionary robotics has been successful in creating agents that successfully link perception with appropriate action. However, the visual fields utilized by such agents is usually extremely small compared to the retinas linked to the visual cortex of animals. Evolving a cortex that processes larger fields of view in a selective and robust manner is challenging because fitness landscapes that are sensitive to this level of details are difficult to design. Here, we decouple the perception from the action part of evolutionary robotics, and present a new way to evolve logic circuits to perform image recognition on the well-known MNIST data set, which comprises 60,000 training and 10,000 testing handwritten numerals. The logic circuits are encoded in a genome that is evolved using a fitness function based on the true positive and true negative classification rates of the numerals. Following evolution, individual circuits achieve …", "num_citations": "18\n", "authors": ["1910"]}
{"title": "Evolution of division of labor in genetically homogenous groups\n", "abstract": " Within nature, the success of many organisms, including certain species of insects, mammals, slime molds, and bacteria, is attributed to their performance of division of labor, where individuals specialize on specific roles and cooperate to survive. The evolution of division of labor is challenging to study because of the slow pace of biological evolution and imperfect historical data. In this paper, we use digital evolution to evolve groups of clonal organisms that exhibit division of labor. We then investigate what mechanisms they use to perform division of labor (ie, location awareness or communication) and discover that it varies according to the type of roles being performed. Lastly, we created an environment where groups of organisms needed to complete a set of tasks, but could do so as either generalists or specialists. We varied the costs of switching tasks and determined that increased costs can result in the …", "num_citations": "16\n", "authors": ["1910"]}
{"title": "Neuroevolution of mobile ad hoc networks\n", "abstract": " This paper describes a study of the evolution of distributed behavior, specifically the control of agents in a mobile ad hoc network, using neuroevolution. In neuroevolution, a population of artificial neural networks (ANNs) are subject to mutation and natural selection. For this study, we compare three different neuroevolutionary systems: a direct encoding, an indirect encoding, and an indirect encoding that supports heterogeneity. Multiple variations of each of these systems were tested on a problem where agents were able to coordinate their collective behavior. Specifically, movement of agents in a simulated physics environment affected which agents were able to communicate with each other. The results of experiments indicate that this is a challenging problem domain for neuroevolution, and although direct and indirect encodings tended to perform similarly in our tests, the strategies employed by indirect …", "num_citations": "15\n", "authors": ["1910"]}
{"title": "Evolution of cooperative information gathering in self-replicating digital organisms\n", "abstract": " We describe a study in the application of digital evolution to the problem of cooperative information gathering. In digital evolution, self-replicating computer programs evolve to perform tasks and optimize resource usage in order to survive within a user defined computational environment. Instruction-level mutations during replication and CPU-cycle rewards for desired behavior produce natural selection within the population. The evolution is open-ended and not limited by human preconceptions. The contributions of this work are (1) to demonstrate that cooperative information gathering can evolve in digital organisms and (2) to provide insight into the fundamental processes governing evolution of such behavior.", "num_citations": "15\n", "authors": ["1910"]}
{"title": "Evolution of resistance to quorum quenching in digital organisms\n", "abstract": " Quorum sensing (QS) is a collective behavior whereby actions of individuals depend on the density of the surrounding population. Bacteria use QS to trigger secretion of digestive enzymes, formation and destruction of biofilms, and, in the case of pathogenic organisms, expression of virulence factors that cause disease. Investigations of mechanisms that prevent or disrupt QS, referred to as quorum quenching, are of interest because they provide a new alternative to antibiotics for treating bacterial infections. Traditional antibiotics either kill bacteria or inhibit their growth, producing selective pressures that promote resistant strains. In contrast, quorum quenching and other so-called anti-infective strategies focus on altering behavior. In this article we evolve QS in populations of digital organisms, a type of self-replicating computer program, and investigate the effects of quorum quenching on these populations …", "num_citations": "14\n", "authors": ["1910"]}
{"title": "Evolution of probabilistic consensus in digital organisms\n", "abstract": " The complexity of distributed computing systems and their increasing interaction with the physical world impose challenging requirements in terms of adaptation, robustness, and resilience to attack. Based on their reliance on heuristics, algorithms for consensus, where members of a group agree on a course of action, are particularly sensitive to these conditions. Given the ability of natural organisms to respond to adversity, many researchers have investigated biologically-inspired approaches to designing robust distributed systems. In this paper, we describe a study in the use of digital evolution, a type of artificial life system, to produce a distributed behavior for reaching consensus. The evolved algorithm employs a novel mechanism for probabilistically reaching consensus based on the frequency of messaging. Moreover, this design approach enables us to change parameters based on the specifics of the desired …", "num_citations": "14\n", "authors": ["1910"]}
{"title": "The effect of conflicting pressures on the evolution of division of labor\n", "abstract": " Within nature, many groups exhibit division of labor. Individuals in these groups are under seemingly antagonistic pressures to perform the task most directly beneficial to themselves and to potentially perform a less desirable task to ensure the success of the group. Performing experiments to study how these pressures interact in an evolutionary context is challenging with organic systems because of long generation times and difficulties related to group propagation and fine-grained control of within-group and between-group pressures. Here, we use groups of digital organisms (i.e., self-replicating computer programs) to explore how populations respond to antagonistic multilevel selection pressures. Specifically, we impose a within-group pressure to perform a highly-rewarded role and a between-group pressure to perform a diverse suite of roles. Thus, individuals specializing on highly-rewarded roles will have a within-group advantage, but groups of such specialists have a between-group disadvantage. We find that digital groups could evolve to be either single-lineage or multi-lineage, depending on experimental parameters. These group compositions are reminiscent of different kinds of major evolutionary transitions that occur within nature, where either relatives divide labor (fraternal transitions) or multiple different organisms coordinate activities to form a higher-level individual (egalitarian transitions). Regardless of group composition, organisms embraced phenotypic plasticity as a means for genetically similar individuals to perform different roles. Additionally, in multi-lineage groups, organisms from lineages performing highly-rewarded …", "num_citations": "13\n", "authors": ["1910"]}
{"title": "Genetic Variation and the Evolution of Consensus in Digital Organisms\n", "abstract": " In this paper, we describe a study of the evolution of consensus, a cooperative behavior in which members in both homogeneous and heterogeneous groups, must agree on information sensed in their environment. We conducted the study using digital evolution, a form of evolutionary computation where a population of computer programs (digital organisms) exists in a user-defined computational environment and is subject to instruction-level mutations and natural selection. We placed these digital organisms into groups whose fitness relied upon their ability to perform consensus. We then tested different degrees and types of genetic variation present in the population, based on biologically inspired models of gene flow, including mutation, sexual recombination, migration, and horizontal gene transfer. Our experimental treatments examined the effect of these processes on genetic variation and groups' ability to …", "num_citations": "10\n", "authors": ["1910"]}
{"title": "Evolution of synchronization and desynchronization in digital organisms\n", "abstract": " We present a study in the evolution of temporal behavior, specifically synchronization and desynchronization, through digital evolution and group selection. In digital evolution, a population of self-replicating computer programs exists in a user-defined computational environment and is subject to instruction-level mutations and natural selection. Group selection links the survival of the individual to the survival of its group, thus encouraging cooperation. Previous approaches to engineering synchronization and desynchronization algorithms have taken inspiration from nature: In the well-known firefly model, the only form of communication between agents is in the form of flash messages among neighbors. Here we demonstrate that populations of digital organisms, provided with a similar mechanism and minimal information about their environment, are capable of evolving algorithms for synchronization and …", "num_citations": "9\n", "authors": ["1910"]}
{"title": "Evolving virtual fireflies\n", "abstract": " In this paper, we present a study in the evolution of cooperative behavior, specifically synchronization, through digital evolution and multilevel selection. In digital evolution, a population of self-replicating computer programs exists in a user-defined computational environment and is subject to instruction-level mutations and natural selection. Multilevel selection links the survival of the individual to the survival of its group, thus encouraging cooperation. Previous approaches to designing synchronization algorithms have taken inspiration from nature: In the well-known firefly model, the only form of communication between agents is in the form of “flash” messages among neighbors. Here we demonstrate that populations of digital organisms, provided with a similar mechanism and minimal information about their environment, are capable of evolving algorithms for synchronization, and that the evolved behaviors …", "num_citations": "9\n", "authors": ["1910"]}
{"title": "Breast cancer detection using haralick features of images reconstructed from ultra wideband microwave scans\n", "abstract": " Microwave scanning of the breast would provide a technology for cancer detection and screening that is significantly safer than current methods involving radiation. This research focuses on finding the best way for accurate characterization of cancerous signals and normal signals using clinical data collected from a previously developed ultra wideband (UWB) antenna, BRATUMASS (Breast Tumor Microwave Sensor System). BRATUMASS which detects changes in dielectric constants within the breast. The signals collected from the microwave scanning procedure are reconstructed into a single, informative representation of the breast via diffraction tomography. This representation contains the information of the breast’s conductivity and the change in dielectric constants. We illustrate the feasibility of using Haralick features to make distinctions among breasts with a malignant tumor present and breasts with …", "num_citations": "7\n", "authors": ["1910"]}
{"title": "Neuroevolution of controllers for self-organizing mobile ad hoc networks\n", "abstract": " This paper describes a study in the use of neuroevolution to discover controllers for a simulated mobile ad hoc network. Neuroevolution is a technique whereby an evolutionary algorithm is used to produce artificial neural networks that solve a user-defined task. Here, we use neuroevolution to study a generic coverage-based problem, where agents in the network are to maximize the area covered by the largest connected component of the network. An example application for this work is the discovery of control algorithms for an ocean-monitoring mobile network. While this is a challenging problem domain for neuroevolution, results of our experiments reveal three important characteristics to be considered when using such an approach. Specifically, we found that approaches that implicitly reduce entropy, while explicitly addressing self-organization and scalability, are capable of discovering behaviors that remain …", "num_citations": "7\n", "authors": ["1910"]}
{"title": "The evolution of division of labor\n", "abstract": " We use digital evolution to study the division of labor among heterogeneous organisms under multiple levels of selection. Although division of labor is practiced by many social organisms, the labor roles are typically associated with different individual fitness effects. This fitness variation raises the question of why an individual organism would select a less desirable role. For this study, we provide organisms with varying rewards for labor roles and impose a group-level pressure for division of labor. We demonstrate that a group selection pressure acting on a heterogeneous population is sufficient to ensure role diversity regardless of individual selection pressures, be they beneficial or detrimental.", "num_citations": "7\n", "authors": ["1910"]}
{"title": "Evolved digital ecosystems: Dynamic steady state, not optimal fixed point\n", "abstract": " Traditional models of ecosystems often assume that the species composing an unperturbed ecosystem become fixed so that only the relative abundances of the species change over time. Such ecosystems are said to have reached an optimal fixed point. However, recent work has suggested that neutral evolutionary processes can significantly alter the species composition of an ecosystem, allowing the ecosystem to exist in a dynamic steady state. Here, we investigate the stability of ecosystems and the nature of the equilibrium that forms using the digital evolution platform Avida, tracking evolving ecosystems over thousands of generations. We find that the communities that form are remarkably stable, and do not experience a significant loss of diversity in the long run even in experimental treatments where the communities suffer catastrophic population bottlenecks. When diversity rebounds, ecological communities …", "num_citations": "6\n", "authors": ["1910"]}
{"title": "Constructing Communication Networks with Evolved Digital Organisms\n", "abstract": " This paper describes a study where small computer programs called digital organisms are evolved to construct communication networks in a virtual environment. Through the application of various selection pressures, we show how these organisms first evolve to build, and subsequently use, these networks for a collective communication task, specifically the efficient distribution of data among organisms. The results of our experiments demonstrate that evolutionary algorithms can discover behaviors for constructing networks that solve communication tasks, potentially leading to a new family of distributed algorithm where the underlying logical structure of the network automatically self-adapts to suit the application.", "num_citations": "5\n", "authors": ["1910"]}
{"title": "Effects of communication impairments on quorum sensing\n", "abstract": " Many natural and artificial systems utilize QS to perform critical tasks, from self-preservation in bacteria to clustering in sensor networks. The disruption of these systems can serve many purposes, from treating diseasecausing bacteria to disabling computer worms. We have shown that digital evolution can produce solutions that are resistant to communication impairments. We demonstrated that QS digital organisms exhibit a resistance to communication impairments. Building on this work, we intend to test the effects of other types of therapies to prevent and promote QS.", "num_citations": "5\n", "authors": ["1910"]}
{"title": "Robust multi-objective evolutionary optimization to allow greenhouse production/energy use tradeoffs.\n", "abstract": " The worldwide increase in demand for fresh fruits and vegetables has led to a search for strategies to manage greenhouses greenhouses Subject Category: Infrastructuresee more details in ways that not only meet this demand, but that are also economically viable and environmentally sustainable. A promising technique for managing the greenhouse microclimate is automatic control of mechanical systems such as heaters, ventilators, and shade screens. However, conventional open-loop greenhouse controllers controllers Subject Category: Techniques, Methodologies and Equipment", "num_citations": "4\n", "authors": ["1910"]}
{"title": "Leveraging evolutionary search to discover self-adaptive and self-organizing cellular automata\n", "abstract": " Building self-adaptive and self-organizing (SASO) systems is a challenging problem, in part because SASO principles are not yet well understood and few platforms exist for exploring them. Cellular automata (CA) are a well-studied approach to exploring the principles underlying self-organization. A CA comprises a lattice of cells whose states change over time based on a discrete update function. One challenge to developing CA is that the relationship of an update function, which describes the local behavior of each cell, to the global behavior of the entire CA is often unclear. As a result, many researchers have used stochastic search techniques, such as evolutionary algorithms, to automatically discover update functions that produce a desired global behavior. However, these update functions are typically defined in a way that does not provide for self-adaptation. Here we describe an approach to discovering CA update functions that are both self-adaptive and self-organizing. Specifically, we use a novel evolutionary algorithm-based approach to discover finite state machines (FSMs) that implement update functions for CA. We show how this approach is able to evolve FSM-based update functions that perform well on the density classification task for 1-, 2-, and 3-dimensional CA. Moreover, we show that these FSMs are self-adaptive, self-organizing, and highly scalable, often performing well on CA that are orders of magnitude larger than those used to evaluate performance during the evolutionary search. These results demonstrate that CA are a viable platform for studying the integration of self-adaptation and self-organization, and strengthen …", "num_citations": "3\n", "authors": ["1910"]}