{"title": "Activity sensing in the wild: a field trial of ubifit garden\n", "abstract": " Recent advances in small inexpensive sensors, low-power processing, and activity modeling have enabled applications that use on-body sensing and machine learning to infer people's activities throughout everyday life. To address the growing rate of sedentary lifestyles, we have developed a system, UbiFit Garden, which uses these technologies and a personal, mobile display to encourage physical activity. We conducted a 3-week field trial in which 12 participants used the system and report findings focusing on their experiences with the sensing and activity inference. We discuss key implications for systems that use on-body sensing and activity inference to encourage physical activity.", "num_citations": "1375\n", "authors": ["1201"]}
{"title": "Theory-driven design strategies for technologies that support behavior change in everyday life\n", "abstract": " In this paper, we propose design strategies for persuasive technologies that help people who want to change their everyday behaviors. Our strategies use theory and prior work to substantially extend a set of existing design goals. Our extensions specifically account for social characteristics and other tactics that should be supported by persuasive technologies that target long-term discretionary use throughout everyday life. We used these strategies to design and build a system that encourages people to lead a physically active lifestyle. Results from two field studies of the system-a three-week trial and a three-month experiment-have shown that the system was successful at helping people maintain a more physically active lifestyle and validate the usefulness of the strategies.", "num_citations": "694\n", "authors": ["1201"]}
{"title": "Flowers or a robot army?: encouraging awareness & activity with personal, mobile displays\n", "abstract": " Personal, mobile displays, such as those on mobile phones, are ubiquitous, yet for the most part, underutilized. We present results from a field experiment that investigated the effectiveness of these displays as a means for improving awareness of daily life (in our case, self-monitoring of physical activity). Twenty-eight participants in three experimental conditions used our UbiFit system for a period of three months in their day-to-day lives over the winter holiday season. Our results show, for example, that participants who had an awareness display were able to maintain their physical activity level (even during the holidays), while the level of physical activity for participants who did not have an awareness display dropped significantly. We discuss our results and their general implications for the use of everyday mobile devices as awareness displays.", "num_citations": "508\n", "authors": ["1201"]}
{"title": "Goal-setting considerations for persuasive technologies that encourage physical activity\n", "abstract": " Goal-setting has been shown to be an effective strategy for changing behavior; therefore employing goal-setting in persuasive technologies could be an effective way to encourage behavior change. In our work, we are developing persuasive technologies to encourage individuals to live healthy lifestyles with a focus on being physically active. As part of our investigations, we have explored individuals' reactions to goal-setting, specifically goal sources (ie, who should set the individual's goal) and goal timeframes (ie, over what time period should an individual have to achieve the goal). In this paper, we present our findings related to various approaches for implementing goal-setting in a persuasive technology to encourage physical activity.", "num_citations": "276\n", "authors": ["1201"]}
{"title": "Dissecting a Social Botnet: Growth, Content and Influence in Twitter\n", "abstract": " Social botnets have become an important phenomenon on social media. There are many ways in which social bots can disrupt or influence online discourse, such as, spam hashtags, scam twitter users, and astroturfing. In this paper we considered one specific social botnet in Twitter to understand how it grows over time, how the content of tweets by the social botnet differ from regular users in the same dataset, and lastly, how the social botnet may have influenced the relevant discussions. Our analysis is based on a qualitative coding for approximately 3000 tweets in Arabic and English from the Syrian social bot that was active for 35 weeks on Twitter before it was shutdown. We find that the growth, behavior and content of this particular botnet did not specifically align with common conceptions of botnets. Further we identify interesting aspects of the botnet that distinguish it from regular users.", "num_citations": "270\n", "authors": ["1201"]}
{"title": "Challenge: Ubiquitous location-aware computing and the place lab initiative\n", "abstract": " To be widely adopted, location-aware computing must be as effortless, familiar and rewarding as web search tools like Google. We envisage the global scale Place Lab, consisting of an open software base and a community building activity as a way to bootstrap the broad adoption of location-aware computing. The initiative is a laboratory because it will also be a vehicle for research and instruction, especially in the formative stages. The authors draw on their experiences with campus and building-scale location systems to identify the technological and social barriers to a truly ubiquitous deployment. With a grasp of these\" barriers to adoption,\" we present a usage scenario, the problems in realizing this scenario, and how these problems will be addressed. We conclude with a sketch of the multi-organization cooperative being formed to move this effort forward.", "num_citations": "258\n", "authors": ["1201"]}
{"title": "Recommending collaboration with social networks: a comparative evaluation\n", "abstract": " Studies of information seeking and workplace collaboration often find that social relationships are a strong factor in determining who collaborates with whom. Social networks provide one means of visualizing existing and potential interaction in organizational settings. Groupware designers are using social networks to make systems more sensitive to social situations and guide users toward effective collaborations. Yet, the implications of embedding social networks in systems have not been systematically studied. This paper details an evaluation of two different social networks used in a system to recommend individuals for possible collaboration. The system matches people looking for expertise with individuals likely to have expertise. The effectiveness of social networks for matching individuals is evaluated and compared. One finding is that social networks embedded into systems do not match individuals' …", "num_citations": "247\n", "authors": ["1201"]}
{"title": "Incorporating ideas from computer-supported cooperative work\n", "abstract": " Many information systems have failed when deployed into complex health-care settings. We believe that one cause of these failures is the difficulty in systematically accounting for the collaborative and exception-filled nature of medical work. In this methodological review paper, we highlight research from the field of computer-supported cooperative work (CSCW) that could help biomedical informaticists recognize and design around the kinds of challenges that lead to unanticipated breakdowns and eventual abandonment of their systems. The field of CSCW studies how people collaborate with each other and the role that technology plays in this collaboration for a wide variety of organizational settings. Thus, biomedical informaticists could benefit from the lessons learned by CSCW researchers. In this paper, we provide a focused review of CSCW methods and ideas—we review aspects of the field that could be …", "num_citations": "223\n", "authors": ["1201"]}
{"title": "Articulations of wikiwork: uncovering valued work in wikipedia through barnstars\n", "abstract": " Successful online communities have complex cooperative arrangements, articulations of work, and integration practices. They require technical infrastructure to support a broad division of labor. Yet the research literature lacks empirical studies that detail which types of work are valued by participants in an online community. A content analysis of Wikipedia barnstars--personalized tokens of appreciation given to participants--reveals a wide range of valued work extending far beyond simple editing to include social support, administrative actions, and types of articulation work. Our analysis develops a theoretical lens for understanding how wiki software supports the creation of articulations of work. We give implications of our results for communities engaged in large-scale collaborations.", "num_citations": "201\n", "authors": ["1201"]}
{"title": "Community, consensus, coercion, control: cs* w or how policy mediates mass participation\n", "abstract": " When large groups cooperate, issues of conflict and control surface because of differences in perspective. Managing such diverse views is a persistent problem in cooperative group work. The Wikipedian community has responded with an evolving body of policies that provide shared principles, processes, and strategies for collaboration. We employ a grounded approach to study a sample of active talk pages and examine how policies are employed as contributors work towards consensus. Although policies help build a stronger community, we find that ambiguities in policies give rise to power plays. This lens demonstrates that support for mass collaboration must take into account policy and power.", "num_citations": "185\n", "authors": ["1201"]}
{"title": "Systems and methods for filtering and/or viewing collaborative indexes of recorded media\n", "abstract": " Systems and methods for filtering and viewing collaborative indexes of annotations of multimedia or video streams can include obtaining a multimedia or video stream, obtaining user indexes of annotations of the multimedia or video stream, merging the indexes, associating portions of the multimedia or video stream with the annotations, determining high-value annotations and displaying the high value annotations. Systems and methods for providing useful visualizations of the indexes of annotations and high value annotations are also provided.", "num_citations": "170\n", "authors": ["1201"]}
{"title": "Wikipedian self-governance in action: Motivating the policy lens\n", "abstract": " While previous studies have used the Wikipedia dataset to provide an understanding of its growth, there have been few attempts to quantitatively analyze the establishment and evolution of the rich social practices that support this editing community. One such social practice is the enactment and creation of Wikipedian policies. We focus on the enactment of policies in discussions on the talk pages that accompany each article. These policy citations are a valuable micro-to-macro connection between everyday action, communal norms and the governance structure of Wikipedia. We find that policies are widely used by registered users and administrators, that their use is converging and stabilizing in and across these groups, and that their use illustrates the growing importance of certain classes of work, in particular source attribution. We also find that participation in Wikipedia’s governance structure is inclusionary in practice.", "num_citations": "159\n", "authors": ["1201"]}
{"title": "Augmenting the social space of an academic conference\n", "abstract": " Academic conferences provide a social space for people to present their work, learn about others' work, and interact informally with one another. However, opportunities for interaction are unevenly distributed among the attendees. We seek to extend these opportunities by allowing attendees to easily reveal something about their background and interests in different settings through the use ofproactive displays: computer displays coupled with sensors that can sense and respond to the people nearby. We designed, implemented and deployed a suite of proactive display applications at a recent academic conference:AutoSpeakerID augmented formal conference paper sessions;Ticket2Talk augmented informal coffee breaks. A mixture of qualitative observation and survey response data are used to frame the impacts of these applications from both individual and group perspectives, highlighting the creation of new …", "num_citations": "150\n", "authors": ["1201"]}
{"title": "Learning how: the search for craft knowledge on the internet\n", "abstract": " Communicating the subtleties of a craft technique, like putting a zipper into a garment or throwing a clay pot, can be challenging even when working side by side. Yet How-To content-including text, images, animations, and videos-is available online for a wide variety of crafts. We interviewed people engaged in various crafts to investigate how online resources contributed to their craft practice. We found that participants sought creative inspiration as well as technical clarification online. In this domain, keyword search can be difficult, so supplemental strategies are used. Participants sought information iteratively, because they often needed to enact their knowledge in order to evaluate it. Our description of people learning how allows us to elaborate existing understandings of information-seeking behavior by considering how search originates and is evaluated in knowledge domains involving physical objects and …", "num_citations": "148\n", "authors": ["1201"]}
{"title": "Using mobile & personal sensing technologies to support health behavior change in everyday life: lessons learned\n", "abstract": " Lifestyle modification is a key facet of the prevention and management of chronic diseases. Mobile devices that people already carry provide a promising platform for facilitating these lifestyle changes. This paper describes key lessons learned from the development and evaluation of two mobile systems for encouraging physical activity. We argue that by supporting persistent cognitive activation of health goals, encouraging an extensive range of relevant healthy behaviors, focusing on long-term patterns of activity, and facilitating social support as an optional but not primary motivator, systems can be developed that effectively motivate behavior change and provide support when and where people make decisions that affect their health.", "num_citations": "143\n", "authors": ["1201"]}
{"title": "Perception Differences between the Depressed and Non-Depressed Users in Twitter\n", "abstract": " One's state of mind will influence her perception of the world and people within it. In this paper, we explore attitudes and behaviors toward online social media based on whether one is depressed or not. We conducted semi-structured face-to-face interviews with 14 active Twitter users, half of whom were depressed and the other half non-depressed. Our results highlight key differences between the two groups in terms of perception towards online social media and behaviors within such systems. Non-depressed individuals perceived Twitter as an information consuming and sharing tool, while depressed individuals perceived it as a tool for social awareness and emotional interaction. We discuss several design implications for future social networks that could better accommodate users with depression and provide insights towards helping depressed users meet their needs through online social media.", "num_citations": "130\n", "authors": ["1201"]}
{"title": "Designing for healthy lifestyles: Design considerations for mobile technologies to encourage consumer health and wellness\n", "abstract": " As the rates of lifestyle diseases such as obesity, diabetes, and heart disease continue to rise, the development of effective tools that can help people adopt and sustain healthier habits is becoming ever more important. Mobile computing holds great promise for providing effective support for helping people manage their health in everyday life. Yet, for this promise to be realized, mobile wellness systems need to be well designed, not only in terms of how they implement specific behavior-change techniques but also, among other factors, in terms of how much burden they put on the user, how well they integrate into", "num_citations": "119\n", "authors": ["1201"]}
{"title": "Evaluating expertise recommendations\n", "abstract": " Finding a person who has the expertise to solve a specific problem is an important application of recommender systems to a difficult organizational problem. Prior systems have made attempts to implement solutions to this problem, but few systems have undergone systematic user evaluation. This work describes a systematic evaluation of the Expertise Recommender (ER), a system that recommends people who are likely to have expertise in a specific problem. ER and the organizational context for which it was designed are described to provide a basis for understanding this evaluation. Prior to conducting the evaluation, a baseline experiment showed that people are relatively good at judging coworkers' expertise when given an appropriate context. This finding provides a way to demonstrate the effectiveness of ER by comparing ER's performance to ratings by coworkers. The evaluation, the design, and results are …", "num_citations": "112\n", "authors": ["1201"]}
{"title": "From nobody cares to way to go!: A Design Framework for Social Sharing in Personal Informatics\n", "abstract": " Many research applications and popular commercial applications include features for sharing personally collected data with others in social awareness streams. Prior work has identified several barriers to use as well as discrepancies between designer goals and how these features are used in practice. We develop a framework for designing and evaluating these features based on an extensive review of prior literature. We demonstrate the value of this framework by analyzing physical activity sharing on Twitter, coding 4,771 tweets and their responses and gathering 444 reactions from 97 potential tweet recipients, learning that specific user-generated content leads to more responses and is better received by the post audience. We conclude by extending our findings to other sharing problems and discussing the value of our design framework.", "num_citations": "108\n", "authors": ["1201"]}
{"title": "Proactive displays: Supporting awareness in fluid social environments\n", "abstract": " Academic conferences provide a social space for people to present their work and interact with one another. However, opportunities for interaction are unevenly distributed among the attendees. We seek to extend the opportunities for interaction among attendees by using technology to enable them to reveal information about their background and interests in different settings. We evaluate a suite of applications that augment three physical social spaces at an academic conference. The applications were designed to augment formal conference paper sessions and informal breaks. A mixture of qualitative observation and survey response data are used to frame the impacts from both individual and group perspectives. Respondents reported on their interactions and serendipitous findings of shared interests with other attendees. However, some respondents also identify distracting aspects of the augmentation. Our …", "num_citations": "94\n", "authors": ["1201"]}
{"title": "How-To pages: Informal systems of expertise sharing\n", "abstract": " The How-To has recently emerged as a genre of online content that describes how something is done. This study focuses on computer and electronics hobbyists and their use of How-Tos-how hobbyists use existing knowledge to solve technical challenges, how they document their new knowledge for one another, and how they exchange help and feedback. Our analysis describes How-To knowledge sharing as a fully decentralized expertise-location system in which the How-To functions as both a broadcast of the author’s expertise and a personal portfolio.", "num_citations": "93\n", "authors": ["1201"]}
{"title": "Broken expectations in the digital home\n", "abstract": " As part of an ongoing effort to understand ease of use of digital home technologies, we undertook an exploratory study of people who use their home networks for more than just broadband Internet access. In particular, we wanted to understand the overhead, or problem-time, people spent with their home network devices. As expected, we saw issues of broken hardware and broken software. We also found that problems are often caused by broken expectations, a mismatch between what a person expects to be able to do and specific device capabilities. In this paper we explore broken expectations in the digital home with examples from our study. These observations suggest further research into the ways user expectations and activities shape the digital home experience.", "num_citations": "81\n", "authors": ["1201"]}
{"title": "Technology, work, and information flows: lessons from the implementation of a wireless alert pager system.\n", "abstract": " The combination of collaborative work practices and information technology affect the flow of information in clinical settings. The introduction of a new technology into these settings can change not only established work practices but also the information flows. In this paper, we examine the introduction of a wireless alerts pager in a surgical intensive care unit (SICU). Through a qualitative study, we analyze the effects that this new information tool had on both the work practices in the SICU and the information flow in the unit. We describe four challenges that SICU staff members faced with respect to the alerts pagers. We found that the pager provided new routes of information to SICU staff but in doing so disrupted existing work practices and information flows.", "num_citations": "77\n", "authors": ["1201"]}
{"title": "Ubiquitous recommendation systems\n", "abstract": " In many popular visions of ubiquitous computing, the environment proactively responds to individuals who inhabit the space. For example, a display magically presents a personalized advertisement, the most relevant video feed, or the desired page from a secret government document. Such capability requires more than an abundance of networked displays, devices, and sensors; it relies implicitly on recommendation systems that either directly serve the end user or provide critical services to some other application. As recommendation systems evolve to exploit new advances in ubiquitous computing technology, researchers and practitioners from technical and social science disciplines must collaborate to address the challenges to their effective implementation. Although it may be impossible to perfectly anticipate each individual's needs at any place or time, ubiquitous computing will enable such systems to help …", "num_citations": "70\n", "authors": ["1201"]}
{"title": "Patient Moderator Interaction in Online Health Communities\n", "abstract": " An increasing number of people visit online health communities to share experiences and seek health information. Although studies have enumerated reasons for patients’ visits to online communities for health information from peers, we know little about how patients gain health information from the moderators in these communities. We qualitatively analyze 480 patient and moderator posts from six communities to understand how moderators fulfill patients’ information needs. Our findings show that patients use the community as an integral part of their health management practices. Based on our results, we suggest enhancements to moderated online health communities for their unique role to support patient care.", "num_citations": "69\n", "authors": ["1201"]}
{"title": "Participatory design of a collaborative clinical trial protocol writing system\n", "abstract": " ObjectiveTo explore concrete approaches to socio-technical design of collaborative healthcare information systems and to design a groupware technology for collaborative clinical trial protocol writing.MethodWe conducted “quick and dirty ethnography” through semi-structured interviews, observational studies, and work artifacts analysis to understand the group work for protocol development. We used participatory design through evolutionary prototyping to explore the feature space of a collaborative writing system. Our design strategies include role-based user advocacy, formative evaluation, and change management.ResultsQuick and dirty ethnography helped us efficiently understand relevant work practice, and participatory design helped us engage users into design and bring out their tacit work knowledge. Our approach that intertwined both techniques helped achieve a “work-informed and user-oriented …", "num_citations": "65\n", "authors": ["1201"]}
{"title": "Incorporating collaboratory concepts into informatics in support of translational interdisciplinary biomedical research\n", "abstract": " Due to its complex nature, modern biomedical research has become increasingly interdisciplinary and collaborative in nature. Although a necessity, interdisciplinary biomedical collaboration is difficult. There is, however, a growing body of literature on the study and fostering of collaboration in fields such as computer supported cooperative work (CSCW) and information science (IS). These studies of collaboration provide insight into how to potentially alleviate the difficulties of interdisciplinary collaborative research. We, therefore, undertook a cross cutting study of science and engineering collaboratories to identify emergent themes. We review many relevant collaboratory concepts: (a) general collaboratory concepts across many domains: communication, common workspace and coordination, and data sharing and management, (b) specific collaboratory concepts of particular biomedical relevance: data integration …", "num_citations": "56\n", "authors": ["1201"]}
{"title": "Locating patient expertise in everyday life\n", "abstract": " Coping with a new health issue often requires individuals to acquire knowledge and skills to manage personal health. Many patients turn to one another for experiential expertise outside the formal bounds of the health-care system. Internet-based social software can facilitate expertise sharing among patients, but provides only limited ways for users to locate sources of patient expertise. Although much prior research has investigated expertise location and systems to augment expertise sharing in workplace organizations, the transferability of this knowledge to other contexts, such as personal health, is unclear. Guided by expertise locating frameworks drawn from prior work, we conducted a field study to investigate expertise locating in the informal and everyday context of women diagnosed with breast cancer. Similarities between patients' expertise locating practices and practices of professionals in workplace …", "num_citations": "55\n", "authors": ["1201"]}
{"title": "Vandalism detection in Wikipedia: a high-performing, feature-rich model and its reduction through Lasso\n", "abstract": " User generated content (UGC) constitutes a significant fraction of the Web. However, some wiiki-based sites, such as Wikipedia, are so popular that they have become a favorite target of spammers and other vandals. In such popular sites, human vigilance is not enough to combat vandalism, and tools that detect possible vandalism and poor-quality contributions become a necessity. The application of machine learning techniques holds promise for developing efficient online algorithms for better tools to assist users in vandalism detection. We describe an efficient and accurate classifier that performs vandalism detection in UGC sites. We show the results of our classifier in the PAN Wikipedia dataset. We explore the effectiveness of a combination of 66 individual features that produce an AUC of 0.9553 on a test dataset--the best result to our knowledge. Using Lasso optimization we then reduce our feature--rich model …", "num_citations": "54\n", "authors": ["1201"]}
{"title": "Visual conversation styles in web communities\n", "abstract": " Imagery and picture sharing are an important and growing part of online communities. Many prior studies of online interaction and collaboration rely heavily on text. This study takes a different analytic approach by focusing instead on the images that individuals use to present themselves and to interact. Image data collected from several online communities is analyzed to characterize a range of visual conversational styles. Four specific styles of visual conversation are illustrated and explained; positional play, image quote, text-in-picture and animation. These visual conversation styles are contrasted with textual communication techniques that are commonly taken for granted. The discussion identifies several tradeoffs when designing communities to promote visual conversation", "num_citations": "47\n", "authors": ["1201"]}
{"title": "Bringing the field into focus: user-centered design of a patient expertise locator\n", "abstract": " Managing personal aspects of health is challenging for many patients, particularly those facing a serious condition such as cancer. Finding experienced patients, who can share their knowledge from managing a similar health situation, is of tremendous value. Users of health-related social software form a large base of such knowledge, yet these tools often lack features needed to locate peers with expertise. Informed directly by our field work with breast cancer patients, we designed a patient expertise locator for users of online health communities. Using feedback from two focus groups with breast cancer survivors, we took our design through two iterations. Focus groups concluded that expertise locating features proved useful for extending social software. They guided design enhancements by suggesting granular user control through (1) multiple mechanisms to identify expertise,(2) detailed user profiles to select …", "num_citations": "41\n", "authors": ["1201"]}
{"title": "Automatically Detecting Failures in Natural Language Processing Tools for Online Community Text\n", "abstract": " Background: The prevalence and value of patient-generated health text are increasing, but processing such text remains problematic. Although existing biomedical natural language processing (NLP) tools are appealing, most were developed to process clinician-or researcher-generated text, such as clinical notes or journal articles. In addition to being constructed for different types of text, other challenges of using existing NLP include constantly changing technologies, source vocabularies, and characteristics of text. These continuously evolving challenges warrant the need for applying low-cost systematic assessment. However, the primarily accepted evaluation method in NLP, manual annotation, requires tremendous effort and time.Objective: The primary objective of this study is to explore an alternative approach—using low-cost, automated methods to detect failures (eg, incorrect boundaries, missed terms, mismapped concepts) when processing patient-generated text with existing biomedical NLP tools. We first characterize common failures that NLP tools can make in processing online community text. We then demonstrate the feasibility of our automated approach in detecting these common failures using one of the most popular biomedical NLP tools, MetaMap.Methods: Using 9657 posts from an online cancer community, we explored our automated failure detection approach in two steps:(1) to characterize the failure types, we first manually reviewed MetaMap’s commonly occurring failures, grouped the inaccurate mappings into failure types, and then identified causes of the failures through iterative rounds of manual review using open …", "num_citations": "39\n", "authors": ["1201"]}
{"title": "Asynchronous communication among clinical researchers: A study for systems design\n", "abstract": " Group work is an essential part of modern health care. Although there have been advances in the technology of communication, these have not necessarily led to efficient and effective communication among collaborating health-care professionals. Instead, barriers such as varied organizational cultures, different training backgrounds, and varied time schedules can overwhelm technological solutions and impede efficient communication. We focus on one particular sort of collaboration, that of group work around a clinical trial protocol, where the collaboration is asynchronous and the participants are geographically distributed. In this work setting, we have applied a computer-supported cooperative work (CSCW) approach in two distinct ways. First, we used observational methods to uncover and understand a complex set of communication behaviors and needs. Second, we used participatory design and iterative …", "num_citations": "39\n", "authors": ["1201"]}
{"title": "Supporting nuance in groupware design: moving from naturalistic expertise location to expertise recommendation\n", "abstract": " The design and implementation of groupware systems that support nuanced interaction is a difficult, open problem for Computer-Supported Cooperative Work. The problem of supporting nuance in groupware is indirectly investigated through the nuanced problem of expertise location. The problem of finding expertise to solve difficult day-to-day problems, expertise location, is engaged both socially and technically in this work. The fieldwork and system development is framed in the socio-technical design cycle. This methodology is capable of encompassing both empirical social inquiry, and system design and implementation through an iterative process. The work begins with a detailed, qualitative field study of expertise location at a medium sized software company. The field study found a framework of expertise location that accounts for the social and cognitive details of expertise identification, expertise selection …", "num_citations": "39\n", "authors": ["1201"]}
{"title": "Leveraging cues from person-generated health data for peer matching in online communities\n", "abstract": " Objective Online health communities offer a diverse peer support base, yet users can struggle to identify suitable peer mentors as these communities grow. To facilitate mentoring connections, we designed a peer-matching system that automatically profiles and recommends peer mentors to mentees based on person-generated health data (PGHD). This study examined the profile characteristics that mentees value when choosing a peer mentor.                    Materials and Methods Through a mixed-methods user study, in which cancer patients and caregivers evaluated peer mentor recommendations, we examined the relative importance of four possible profile elements: health interests, language style, demographics, and sample posts. Playing the role of mentees, the study participants ranked mentors, then rated both the likelihood that they would hypothetically contact each mentor and the helpfulness of each …", "num_citations": "37\n", "authors": ["1201"]}
{"title": "Barriers to physical activity: A study of self-revelation in an online community\n", "abstract": " The importance of regular physical activity to overall health has been well established, yet adults in the United States are leading increasingly sedentary lives. Research suggests that lowering perceived barriers to exercise is an effective strategy for encouraging physical activity. This article describes the top barriers that emerged from a qualitative analysis of message board traffic from a three-month healthy lifestyle intervention that promoted physical activity and healthy eating. The findings further elaborate known barriers to physical activity—two of which are not reported as key barriers in prior research—and illustrate the value of a grounded approach to studying health and fitness behaviors. Based on our analysis, we identify design considerations for technologies that encourage and support physical activity. Understanding the needs of a population is a critical step in the design process, and this paper …", "num_citations": "36\n", "authors": ["1201"]}
{"title": "A collaborative clinical trial protocol writing system\n", "abstract": " Increasing complexity in medicine has caused clinical trial experts with disparate backgrounds from multiple organizations to collaborate when developing clinical trial protocols. Although many protocol-authoring tools provide computer-based decision support to assist protocol writing, few of them provide sufficient collaboration support for a group of protocol writers. The iterative group writing activities among interdisciplinary clinical trial experts call for advanced tool support. Here we present a web-based protocol writing system with integrated support for collaborative reviewing and collaborative editing. The system uses a shared database to store threaded review comments and version information for electronic protocols. It also captures rich group event information to provide cross-activity awareness and to facilitate self-coordination within the collaborative writing team. We believe that our system can help …", "num_citations": "34\n", "authors": ["1201"]}
{"title": "Challenges to physicians’ use of a wireless alert pager\n", "abstract": " Pagers, personal data assistants (PDAs) and other devices that have wireless connectivity are becoming a popular method for delivering patient related information to medical decision makers. Although medical informatics research has emphasized the design, and implementation of pagers as event notification mechanisms, researchers have not paid as much attention to how this technology impacts medical work. We present a case study of physicians in a Surgical Intensive Care Unit (SICU) using wireless alert pagers. The pagers provide a variety of alphanumeric clinical alert messages and are widely used by SICU physicians. However, the use of the pagers has created unanticipated challenges to the physicians’ traditional work practices. These challenges include:(1) flattening of hierarchical workflows,(2) coping with information overload and missing context, and (3) lack of feedback. These challenges are …", "num_citations": "33\n", "authors": ["1201"]}
{"title": "Editing beyond articles: diversity & dynamics of teamwork in open collaborations\n", "abstract": " We report a study of Wikipedia in which we use a mixed-methods approach to understand how participation in specialized workgroups called WikiProjects has changed over the life of the encyclopedia. While previous work has analyzed the work of WikiProjects in supporting the development of articles within particular subject domains, the collaborative role of WikiProjects that do not fit this conventional mold has not been empirically examined. We combine content analysis, interviews and analysis of edit logs to identify and characterize these alternative WikiProjects and the work they do. Our findings suggest that WikiProject participation reflects community concerns and shifts in the community's conception of valued work over the past six years. We discuss implications for other open collaborations that need flexible, adaptable coordination mechanisms to support a range of content creation, curation and community …", "num_citations": "31\n", "authors": ["1201"]}
{"title": "Building for social translucence: a domain analysis and prototype system\n", "abstract": " The relationships and work that facilitate content creation in large online contributor system are not always visible. Social translucence is a stance toward the design of systems that allows users to better understand collaborative system participation through awareness of contributions and interactions. Like many socio-technical constructs, social translucence is not something that can be simply added after a system is built; it should be at the core of system design. In this paper, we conduct a domain analysis to understand the space of architectural support required to facilitate social translucence in systems. We describe an instantiation of those requirements as a system architecture that relies on data from Wikipedia and illustrate how translucence can be propagated to some basic visualizations which we have created for Wikipedia users. We close with some reflections on the state of social translucence research …", "num_citations": "30\n", "authors": ["1201"]}
{"title": "Activity recognition for the digital home\n", "abstract": " Home networked devices enable a wide range of daily activities including multiplayer gaming, movie downloading, and music streaming as well as modern conveniences such as home automation, wireless networking, and Internet access. Nevertheless, for most of us the futuristic digital home we see in movies isn't a reality.", "num_citations": "30\n", "authors": ["1201"]}
{"title": "HCI Remixed: Reflections on Works That Have Influenced the HCI Community\n", "abstract": " Personal and reflective essays that describe how particular works—whether papers, books, or demos, from classics to forgotten gems—have influenced each writer's approach to HCI. Over almost three decades, the field of human-computer interaction (HCI) has produced a rich and varied literature. Although the focus of attention today is naturally on new work, older contributions that played a role in shaping the trajectory and character of the field have much to tell us. The contributors to HCI Remixed were asked to reflect on a single work at least ten years old that influenced their approach to HCI. The result is this collection of fifty-one short, engaging, and idiosyncratic essays, reflections on a range of works in a variety of forms that chart the emergence of a new field. An article, a demo, a book: any of these can solve a problem, demonstrate the usefulness of a new method, or prompt a shift in perspective. HCI Remixed offers us glimpses of how this comes about. The contributors consider such HCI classics as Sutherland's Sketchpad, Englebart's demo of NLS, and Fitts on Fitts' Law—and such forgotten gems as Pulfer's NRC Music Machine, and Galloway and Rabinowitz's Hole in Space. Others reflect on works somewhere in between classic and forgotten—Kidd's “The Marks Are on the Knowledge Worker,” King Beach's “Becoming a Bartender,” and others. Some contributors turn to works in neighboring disciplines—Henry Dreyfuss's book on industrial design, for example—and some range farther afield, to Lovelock's Gaia hypothesis and Jane Jacobs's The Death and Life of Great American Cities. Taken together, the essays offer an accessible …", "num_citations": "29\n", "authors": ["1201"]}
{"title": "Musical fingerprints: collaboration around home media collections\n", "abstract": " As people collect more and more digital music, photos, and video, the growing scale of the collection challenges how families share and collaborate around home media collections. We studied the intersection between physical and digital media collections. Through 20 two hour, in home interviews, we explored the when, why, and how of the households' organization, access and sharing. Our grounded approach is framed through the use of the media lifecycle and the spectrum of intimacy of the collector and others involved in the stages of the lifecycle. We found a range of accommodations to facilitate collaboration around media collections in the home. For example, media collections often begin with an individual, but as they become shared and integrated into a household, a member of the household will often play a key curatorial role that includes making changes to the organizational scheme, setting aside sub …", "num_citations": "27\n", "authors": ["1201"]}
{"title": "“How Did We Get Here?”: topic drift in online health discussions\n", "abstract": " Background         Patients increasingly use online health communities to exchange health information and peer support. During the progression of health discussions, a change of topic—topic drift—can occur. Topic drift is a frequent phenomenon linked to incoherence and frustration in online communities and other forms of computer-mediated communication. For sensitive topics, such as health, such drift could have life-altering repercussions, yet topic drift has not been studied in these contexts.                       Objective         Our goals were to understand topic drift in online health communities and then to develop and evaluate an automated approach to detect both topic drift and efforts of community members to counteract such drift.                       Methods         We manually analyzed 721 posts from 184 threads from 7 online health communities within WebMD to understand topic drift, members’ reaction towards topic drift, and their efforts to counteract topic drift. Then, we developed an automated approach to detect topic drift and counteraction efforts. We detected topic drift by calculating cosine similarity between 229,156 posts from 37,805 threads and measuring change of cosine similarity scores from the threads’ first posts to their sequential posts. Using a similar approach, we detected counteractions to topic drift in threads by focusing on the irregular increase of similarity scores compared to the previous post in threads. Finally, we evaluated the performance of our automated approaches to detect topic drift and counteracting efforts by using a manually developed gold standard.                       Results         Our qualitative analyses revealed that in …", "num_citations": "24\n", "authors": ["1201"]}
{"title": "Tagging Wikipedia: collaboratively creating a category system\n", "abstract": " Category systems have traditionally been created by small committees of people who had authority over the system they were designing. With the rise of large-scale social media systems, category schemes are being created by groups with differing perspectives, values, and expectations for how categories will be used. Prior studies of social tagging and folksonomy focused on the application and evolution of the collective category scheme, but struggled to uncover some of the collective rationale undergirding the decision-making processes in those schemes. In this paper, we qualitatively analyze the early discussions among editors of Wikipedia about the design and creation of its category system. We highlight three themes that dominated the discussion: hierarchy, scope and navigation, and relate these themes to their more formal roots in the information science literature. We distill out four styles of collaboration …", "num_citations": "24\n", "authors": ["1201"]}
{"title": "Finding patterns in behavioral observations by automatically labeling forms of wikiwork in barnstars\n", "abstract": " Our everyday observations about the behaviors of others around us shape how we decide to act or interact. In social media the ability to observe and interpret others' behavior is limited. This work describes one approach to leverage everyday behavioral observations to develop tools that could improve understanding and sense making capabilities of contributors, managers and researchers of social media systems. One example of behavioral observation is Wikipedia Barnstars. Barnstars are a type of award recognizing the activities of Wikipedia editors. We mine the entire English Wikipedia to extract barnstar observations. We develop a multi-label classifier based on a random forest technique to recognize and label distinct forms of observed and acknowledged activity. We evaluate the classifier through several means including use of separate training and testing datasets and the by application of the classifier to …", "num_citations": "23\n", "authors": ["1201"]}
{"title": "Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing\n", "abstract": " The CSCW community continues to grow. This year we received 575 papers which represents a 13% increase over the total submissions for the prior year. We had submissions from 24 countries covering all continents.  This year was the fourth year of the \"Revise and Resubmit\" (R&R) process. Over the last four years the CSCW conference community has been conducting the review process in two rounds. In the first round reviewers are encouraged to review papers with an eye to improving the intellectual strength and contributions of the paper, making it clear which changes would be helpful and which are likely required to make the paper acceptable. In the second round, the same reviewers see the same paper and review to understand whether or not the revised paper now meets the standards of the CSCW community as acceptable. This two-round review model, with encouraging and intellectual give-andtake, is designed to improve papers of good quality but in need of work that might otherwise slip just below the bar in the more common one-shot reviewing conferences. As the Papers Co-Chairs we received numerous email commenting on the high quality of the reviewing, even from some authors whose work was not accepted.  Of all the submissions, 262 were offered the opportunity to R&R, representing a little over 45% of the original submissions. A very small number of authors either withdrew their papers or otherwise declined to resubmit their papers. The Program Committee accepted 161 papers for an acceptance rate of 28% of the total.", "num_citations": "22\n", "authors": ["1201"]}
{"title": "Multi-Label Classification of Short Text: A Study on Wikipedia Barnstars\n", "abstract": " A content analysis of Wikipedia barnstars personalized tokens of appreciation given to participants reveals a wide range of valued work extending beyond simple editing to include social support, administrative actions, and types of articulation work. Barnstars are examples of short semi-structured text characterized by informal grammar and language. We propose a method to classify these barnstars which contain items of interest into various work type categories. We evaluate several multilabel text categorization classifiers and show that significant performance can be achieved by simple classifiers using features which carry context extracted from barnstars. Although this study focused specifically on work categorization via barnstar content for Wikipedia, we believe that the findings are applicable to other similar collaborative systems", "num_citations": "22\n", "authors": ["1201"]}
{"title": "Project talk: coordination work and group membership in WikiProjects\n", "abstract": " WikiProjects have contributed to Wikipedia's success in important ways, yet the range of work that WikiProjects perform and the way they coordinate that work remains largely unexplored. In this study, we perform a content analysis of 788 work-related discussions from the talk pages of 138 WikiProjects in order to understand the role WikiProjects play in collaborative work on Wikipedia. We find that the editors use WikiProjects to coordinate a wide variety of work activities beyond content production and that non-members play an active role in that work. Our research suggests that WikiProject collaboration is less structured and more open than that of many virtual teams and that WikiProjects may function more like FLOSS projects than traditional groups.", "num_citations": "21\n", "authors": ["1201"]}
{"title": "Losing it online: characterizing participation in an online weight loss community\n", "abstract": " Many people struggle with their weight and are turning to online communities for social and informational support. The aim of this study is to understand the issues commonly discussed in online weight loss communities. Through observation and content analysis of threads in one specific weight loss community, we identified 17 distinct categories discussed by the participants. We detail four categories specifically: Personal Experience, Consumption Choices, Dieting Strategy, and Exercise. Our analysis describes some key user roles and states that often relate to different phases of a person's weight loss journey. We identify a set of transient states, which are not proper roles but are significant in an online community where individuals are attempting to change their own behaviors. We close with design suggestions for encouraging and maintaining participant engagement in an online health community", "num_citations": "20\n", "authors": ["1201"]}
{"title": "Relating documents via user activity: the missing link\n", "abstract": " In this paper we describe a system for creating and exposing relationships between documents: a user's interaction with digital objects (like documents) is interpreted as links-to be discovered and maintained by the system. Such relationships are created automatically, requiring no priming by the user. Using a very simple set of heuristics, we demonstrate the uniquely useful relationships that can be established between documents that have been touched by the user. Furthermore, this mechanism for relationship building is media agnostic, thus discovering relationships that would not be found by conventional content based approaches. We describe a proof-of-concept implementation of this basic idea and discuss a couple of natural expansions of the scope of user activity monitoring.", "num_citations": "19\n", "authors": ["1201"]}
{"title": "Designing Mediating Spaces Between Citizens and Government\n", "abstract": " The regional, national, and global policy issues we are confronting are growing increasingly daunting, while institutional capacities for taking effective action are lagging. We need to better support citizens and governments in producing innovative, timely, and legitimate decisions. The emergence of online communities oriented toward the creation of useful products suggests that it may be possible to design socially mediating technology that support public-government collaborations. This is an opportunity for HCI and CSCW researchers to start to consider involvement of a wider range of stakeholders in the administration of government, and design technologies that help retool the public sphere.Consider Seattle, a city notorious for decision paralysis when it comes to taking action on critical urban planning decisions. Time and time again regional transportation projects to address what to do with an aging waterfront viaduct susceptible to collapse in the next earthquake come to a political impasse. Some want to replace it. Others want to remove it and increase surface transit options. Or build an expensive tunnel. Government officials, local businesses, metropolitan planning organizations, advocacy groups, and concerned citizens all vie to influence the outcome. Yet it is difficult for people to actually gain an honest evaluation of the tradeoffs–every group has a narrative that may or may not be rooted in truth. And yet the public comment sessions, which are one of the main ways that governments gain input from the general public, have structural flaws that prevent citizens and decision-makers from working together to come to mutual understandings …", "num_citations": "17\n", "authors": ["1201"]}
{"title": "Evaluating health interest profiles extracted from patient-generated data\n", "abstract": " Patient-generated health data (PGHD) offers a promising resource for shaping patient care, self-management, population health, and health policy. Although emerging technologies bolster opportunities to extract PGHD and profile the needs and experiences of patients, few efforts examine the validity and use of such profiles from the patient’s perspective. To address this gap, we explore health interest profiles built automatically from online community posts. Through a user evaluation with community members, we found that extracted profiles not only align with members’ stated health interests, but also expand upon those manually entered interests with little user effort. Community members express positive attitudes toward the use and expansion of profiles to connect with peers for support. Despite this promising approach, findings also point to improvements required of biomedical text processing tools to effectively …", "num_citations": "16\n", "authors": ["1201"]}
{"title": "Collaborative sensemaking during admin permission granting in wikipedia\n", "abstract": " A self-governed, open contributor system such as Wikipedia depends upon those who are invested in the system to participate as administrators. Processes for selecting which system contributors will be allowed to assume administrative roles in such communities have developed in the last few years as these systems mature. However, little is yet known about such processes, which are becoming increasingly important for the health and maintenance of contributor systems that are becoming increasingly important in the knowledge economy. This paper reports the results of an exploratory study of how members of the Wikipedia community engage in collaborative sensemaking when deciding which members to advance to admin status.", "num_citations": "16\n", "authors": ["1201"]}
{"title": "The multiple views of inter-organizational authoring\n", "abstract": " Collaborative authoring is a common workplace task. Yet, despite improvements in word processors, communication software, and file sharing, many problems continue to plague co-authors. We conducted a qualitative study in a setting where participants are loosely connected, physically separated, and work together over a period of 4-9 months to author a complex technical document-a clinical trial protocol. Our study differs from most prior work in that the collaboration is longer-lived, and that the collaborators do not share equivalent status, background, nor domains of expertise. Our data demonstrates that the participants donot share the same view or representation of the authoring process, even though it has a long organizational history. Nonetheless, the participants can still coordinate their activity while maintaining only partially consistent representations of what they are doing. We contend that partial …", "num_citations": "16\n", "authors": ["1201"]}
{"title": "An ethnographic study of collaborative clinical trial protocol writing\n", "abstract": " Clinical trial protocol documents play an important role in clinical research. However, clinical protocol writing remains a complex and relatively un-studied process. Protocols are often written by teams of people, yet little prior research has captured the problems or analyzed the collaboration support needs of protocol writers. Here we present the results of an initial ethnographic study into the clinical trial protocol writing processes at a representative cooperative clinical trial group funded by National Cancer Institute (NCI). We analyzed the collaborative nature of the writing process, identified common problems, derived information and communication support needs of collaborative clinical protocol writers, and provided recommendations to streamline the process. We believe that this paper contributes useful implications for the design of future collaborative clinical protocol writing tools.", "num_citations": "16\n", "authors": ["1201"]}
{"title": "Social issues in self-provisioned Metropolitan Area Networks\n", "abstract": " This position paper frames a set of issues in the collaborative development of self–provisioned metropolitan area networks (MANs). The tantalizing promise of this infrastructure is free access to other people, computing resources and information at any time in a reasonably large metropolitan area. The paper reviews literature in Computer Supported Cooperative Work (CSCW) and relates notions of ad–hoc collaboration to existing notions of opportunistic collaboration in CSCW. The paper briefly describes studies of networking in CSCW and preliminary investigation of a group that is developing a MAN. The paper closes by introducing several social and technical issues that will be of interest to the CSCW community.", "num_citations": "15\n", "authors": ["1201"]}
{"title": "Design and usability of interactive user profiles for online health communities\n", "abstract": " Online health communities provide a rich source of expertise from experienced patients, but uncovering “peer mentors” with shared circumstances is like finding a needle in a haystack—a problem that will escalate as these communities grow and diversify. We investigated interactive health interest profiles (HIPs) that summarize health-related terms extracted from users’ community posts. Through iterative design, we explored practical designs that accommodate differences in users’ community participation in three HIP prototypes: Text, Word Cloud, and Timeline. By comparing prototype usability with patients and design experts, we found that patients accurately used each prototype but completed some tasks faster with the Timeline HIP. Despite this advantage, patients preferred the Text HIP. Design experts and patients agreed that simple data overviews and granular details with salient cues that invite interactivity …", "num_citations": "14\n", "authors": ["1201"]}
{"title": "Homophily of Vocabulary Usage: Beneficial Effects of Vocabulary Similarity on Online Health Communities Participation\n", "abstract": " Online health communities provide popular platforms for individuals to exchange psychosocial support and form ties. Although regular active participation (ie, posting to interact with other members) in online health communities can provide important benefits, sustained active participation remains challenging for these communities. Leveraging previous literature on homophily (ie,“love of those who are like themselves”), we examined the relationship between vocabulary similarity (ie, homophily of word usage) of thread posts and members’ future interaction in online health communities. We quantitatively measured vocabulary similarity by calculating, in a vector space model, cosine similarity between the original post and the first reply in 20,499 threads. Our findings across five online health communities suggest that vocabulary similarity is a significant predictor of members’ future interaction in online health …", "num_citations": "14\n", "authors": ["1201"]}
{"title": "Music interaction research in HCI: let's get the band back together\n", "abstract": " The ubiquity of music consumption is overarching. Statistics for digital music sales, streaming video videos, computer games, and illegal sharing all speak of a huge interest. At the same, an incredible amount of data about every day interactions (sales and use) with music is accumulating through new cloud services. However, there is an amazing lack of public knowledge about everyday music interaction. This panel discusses the state of music interaction as a part of digital media research. We consider why music interaction research has become so marginal in HCI and discuss how to revive it. Our two discussion themes are: orientation towards design vs. research in music related R&D, and the question if and how private, big data on music interactions could enlighten our understanding of ubiquitous media culture.", "num_citations": "14\n", "authors": ["1201"]}
{"title": "The Organization of Home Media\n", "abstract": " The growing volume of digital music, photos and video challenges media management software and organizing schemes alike. Through 20 in situ, two hour interviews we explored the when, why and how of our participants' organizational schemes. We sought and studied significantly larger media collections than in previous studies. For these larger media collections some common assumptions like the distinction between popular and classical music collectors do not hold. Our analysis identifies organizing schemes commonly used on a day-to-day basis. We found that participants often rely on overrides or exceptions to their organizational schemes that they consider idiosyncrasies. However, our findings illustrate that those idiosyncratic behaviors are more common than participants believe. Our analysis reflects upon prior research and on the relationship between physical and digital artifacts, relating computer …", "num_citations": "14\n", "authors": ["1201"]}
{"title": "Terms of service, ethics, and bias: Tapping the social web for cscw research\n", "abstract": " Social, collaborative web applications such as Facebook, YouTube, Flickr are invaluable sources of network, social, and behavioral data. They are also increasingly used to recruit participants for experimental, survey, interview and ethnographic studies. Two sets of issues arise for conducting relevant, valuable, ethical and meaningful research. First, issues derive from restrictions imposed by companies’ legal Terms and Conditions-specifically, sites and services are laden with conditions of access that may constrain researchers from being able to collect the data they need to address research questions. Second, questions arise around research validity and research ethics-where access is possible, sampling can be skewed owing the specifics of the implementation and/or emergence of the site’s social graph, but also from the inadvertent violation of researcher/participant privacy as a result of readily available personal content. In this panel, we bring researchers, and industrial representatives together to discuss these and related issues, in at attempt to figure out how valid and ethically responsible research can be conducted while users continue to share openly and while industry protects its goals.", "num_citations": "14\n", "authors": ["1201"]}
{"title": "Place Lab's First Step: A Location-Enhanced Conference Guide\n", "abstract": " This demonstration will explore how people’s existing notebook computers, the WiFi access points in a city, a carefully selected cache of web pages, and some software glue can be combined to provide a location-enhanced conference guide. Although location-aware applications, tourist guides, museum tours, and the like are well known to the research community they have yet to see widespread availability. Part of the reason for this is that exotic infrastructure or additional mobile hardware is generally required. In contrast we will pursue a low-overhead clientbased software-only approach. Users will load a software package on their WiFi-notebook computers that adds WiFi cell-site location to their browser and lets them easily find location-relevant content about the conference hotel and surrounding neighborhood. An unusual aspect of our approach is that it requires no network connectivity: a web page cache provides content and beacons from existing WiFi access points provide location.", "num_citations": "13\n", "authors": ["1201"]}
{"title": "A content analysis of wikiproject discussions: toward a typology of coordination language used by virtual teams\n", "abstract": " Understanding the role of explicit coordination in virtual teams allows for a more meaningful understanding of how people work together online. We describe a new content analysis for classifying discussions within Wikipedia WikiProject-voluntary, self-directed teams of editors-present preliminary findings, and discuss potential applications and future research directions.", "num_citations": "12\n", "authors": ["1201"]}
{"title": "Exploring the relationship between changes in weight and utterances in an online weight loss forum: a content and correlational analysis study\n", "abstract": " Background: There is increasing interest in the use of online forums as a component of eHealth weight loss interventions. Although the research is mixed on the utility of online forums in general, results suggest that there is promise to this, particularly if the systems can be designed well to support healthful interactions that foster weight loss and continued engagement.Objective: The purpose of this study was to examine the relationship between the styles of utterances individuals make on an online weight loss forum and week-to-week fluctuations in weight. This analysis was conducted to generate hypotheses on possible strategies that could be used to improve the overall design of online support groups to facilitate more healthful interactions.Methods: A convenience sample of individuals using an online weight loss forum (N= 4132) included data both on online forum use and weight check-in data. All interactions were coded utilizing the Linguistic Inquiry and Word Count (LIWC) system. Mixed model analyses were conducted to examine the relationship between these LIWC variables and weight over time.Results: Results suggested that increased use of past-tense verbs (P=. 05) and motion (P=. 02) were associated with lower weekly weights whereas increased use of conjunctions (eg, and, but, whereas; P=. 001) and exclusion words (eg, but, without, exclude; P=. 07) were both associated with higher weight during the weeks when these utterances were used more.Conclusions: These results provide some insights on the styles of interactions that appear to be associated with weight fluctuations. Future work should explore the stability of these …", "num_citations": "11\n", "authors": ["1201"]}
{"title": "Managing complexity: strategies for group awareness and coordinated action in Wikipedia\n", "abstract": " In online groups, increasing explicit coordination can increase group cohesion and member productivity. On Wikipedia, groups called WikiProjects employ a variety of explicit coordination mechanisms to motivate and structure member contribution, with the goal of creating and improving articles related to particular topics. However, while explicit coordination works well for coordinating article-level actions, coordinating group tasks and tracking progress towards group goals that involve tracking hundreds or thousands of articles over time requires different coordination strategies.", "num_citations": "10\n", "authors": ["1201"]}
{"title": "F#%@ that noise: SoundCloud as (A‐) social media?\n", "abstract": " SoundCloud is an audio uploading, streaming and sharing website. The site allows listeners to leave public comments at specific time stamps within a graphical display of an audio file as it plays and offers support for user communication through a publicly viewable reply function. We extracted user comments and conducted a qualitative content analysis in order to characterize and examine participation on the site. Commenting consisted primarily of short, positive comments toward the song or artist and use of the reply function was minimal, though some artists made use of it to communicate with listeners. We speculate that the commenting function is used less as a means toward community‐building or social interaction and more for fostering or indicating shared mutual experiences. Comment design implications are also explored.", "num_citations": "9\n", "authors": ["1201"]}
{"title": "Discourse Analysis of User Forums in an Online Weight Loss Application\n", "abstract": " Online social communities are becoming increasingly popular platforms for people to share information, seek emotional support, and maintain accountability for losing weight. Studying the language and discourse in these communities can offer insights on how users benefit from using these applications. This paper presents a preliminary analysis of language and discourse patterns in forum posts by users who lose weight and keep it off versus users with fluctuating weight dynamics. Our results reveal differences about how the types of posts, polarity of sentiments, and semantic cohesion of posts made by users vary along with their weight loss pattern. To our knowledge, this is the first discourse-level analysis of language and weight loss dynamics.", "num_citations": "9\n", "authors": ["1201"]}
{"title": "How-to web pages\n", "abstract": " How to pages constitute unique online collections of practical instructions, personal stories, and multimedia illustrations. Though independent creations, they are linked together through the Web to form large repositories of useful information. Emerging Web 2.0 technologies are making it easier than ever for those who share a passion to communicate and collaborate. The how-to has become a common online format for procedural knowledge sharing, similar to the FAQ or personal homepage and how-to pages can be found for almost every activity. Whether you're modifying software, installing a water heater, or just packing a suitcase, you can likely find detailed instructions or suggestions on the Web for how to do it or does it better. How-to pages have been around since the Internet's early days, but the emergence of open, flexible Web 2.0 technologies, greater network bandwidth, and increased multimedia …", "num_citations": "8\n", "authors": ["1201"]}
{"title": "Evaluating a Computational Approach to Labeling Politeness: Challenges for the Application of Machine Classification to Social Computing Data\n", "abstract": " Social computing researchers are beginning to apply machine learning tools to classify and analyze social media data. Our interest in understanding politeness in an online community focused our attention on tools that would help automate politeness analysis. This paper highlights one popular classification tool designed to score the politeness of text. Our application of this tool to Wikipedia data yielded some unexpected results. Those unexpected results led us to question how the tool worked and its effectiveness relative to human judgment and classification. We designed a user study to revalidate the tool with crowdworkers labeling samples of content from Wikipedia talk pages, imitating the original efforts to validate the tool. This revalidation points to challenges for automatic labeling. Based on our results, this paper reconsiders politeness in online communities as well as broader trends in the use of machine …", "num_citations": "7\n", "authors": ["1201"]}
{"title": "Who wants to read this?: A method for measuring topical representativeness in user generated content systems\n", "abstract": " This methods paper details an approach for identifying the representativeness of content in a user generated content (UGC) system while also accounting for endogeneity bias. We leverage metadata from an independent content provider to generate sets of commercially viable terms presumed to be of interest to specific audiences linking those terms to UGC. We describe our method and heuristics at a level of detail allowing others to follow or modify it to study both content representativeness and content gaps in UGC systems. We illustrate the method by investigating how well the English language Wikipedia addresses the content interests of four sample audiences: readers of men's and women's periodicals, and readers of political periodicals geared toward either liberal or conservative ideologies. We also share preliminary findings from each case study to demonstrate our method.", "num_citations": "7\n", "authors": ["1201"]}
{"title": "Ease on Down the Code: Complex Collaborative Qualitative Coding Simplified with'Code Wizard'\n", "abstract": " This paper describes the design and development of a preliminary qualitative coding tool as well as a method to improve the process of achieving inter-coder reliability (ICR) in small teams. Software applications that support qualitative coding do not sufficiently assist collaboration among coders and overlook some fundamental issues related to ICR. We propose a new dimension of collaborative coding called 'coders' certainty\" and demonstrate its ability to illustrate valuable code disagreements that are missing from existing approaches. Through a case study, we describe the utility of our tool, Code Wizard, and how it helped a group of researchers effectively collaborate to code naturalistic observation data. We report the valuable lessons we learned from the development of our tool and method: (1) identifying coders' certainty constitutes an important part of determining the quality of data analysis and facilitates …", "num_citations": "6\n", "authors": ["1201"]}
{"title": "… is it normal to be this sore?:: using an online forum to investigate barriers to physical activity\n", "abstract": " The importance of regular physical activity to overall health has been well established, yet US adults are leading increasingly sedentary lives. Research suggests that lowering perceived barriers to physical activity is a critical part of interventions that encourage physical activity. In this paper, we describe the top five barriers---two of which have not been reported as principle barriers in the literature---that emerged from our systematic qualitative coding of an online forum used to support a three-month healthy lifestyle intervention. Based on our analysis, we identify design considerations for technologies that encourage and support physical activity. Understanding the needs of a population is a critical step in the design process, and this paper offers unique insights for those working in this growing domain.", "num_citations": "6\n", "authors": ["1201"]}
{"title": "Exploring the social realities of online communities through the lens of a Human Information Behavior framework\n", "abstract": " Sonnenwaldâ s evolving framework for human information behavior (1999) was systematically applied to a set of online community literature to examine whether the frameworkâ s propositions are supported or not, so as to uncover open problems for socio-technical studies of online communities and human information behaviorâ what aspects that are relevant to understanding the reciprocal relationships between technologically-mediated systems, communities and information resources should social informatics be examining, but hasnâ t? Findings are presented.", "num_citations": "6\n", "authors": ["1201"]}
{"title": "Scenario-based participatory design of a collaborative clinical trial protocol authoring system\n", "abstract": " We present our experience of using prototype scenarios to actively involve users in the design of a collaborative clinical trial protocol authoring system. This method enables us to do usability testing and elicit prompt user feedback at the early phase of design. We conclude that it is an effective approach to the design of complex medical information systems.BackgroundMany clinical trial protocols contain ambiguities, or inconsistencies. Such protocol problems can lead to inappropriate patient care or even endanger a patient’s life. We are designing a collaborative clinical trial protocol authoring system to enhance communication among collaborative protocol writers and to evaluate whether communication support during the writing process can improve protocol quality.", "num_citations": "6\n", "authors": ["1201"]}
{"title": "Recommending expertise in an organizational setting\n", "abstract": " This work explores how information systems can be augmented to assist users in finding other individuals who are likely to have specialized, expert information that they need. This paper describes a field study that considers the social and cognitive mechanisms that people use to find candidate sources of expertise. These mechanisms are the basis for a recommender system that can help users find expertise.", "num_citations": "6\n", "authors": ["1201"]}
{"title": "Do We All Talk Before We Type?: Understanding Collaboration in Wikipedia Language Editions\n", "abstract": " The English language Wikipedia is notable for its large number of articles and for the intricate collaborative interactions that create and sustain it. However, 288 other active language editions of Wikipedia have also developed through the coordination of contributing editors. While collaboration in the English Wikipedia has been researched extensively, these other language editions remain understudied. Our study leverages an influential collaboration model based on behaviors in the English Wikipedia as a lens to consider collaborative activity in the Spanish and French language editions. Through an analysis of collaborative interactions across article talk pages, we demonstrate that talk pages, the locus of most collaboration on the English Wikipedia, are used differently in these different language editions. Our study raises broader questions about how results from studies of the English Wikipedia generalize to …", "num_citations": "5\n", "authors": ["1201"]}
{"title": "System Design for Social Translucence in Socially Mediating Technologies\n", "abstract": " Socially mediating technologies (SMTs) like blogs, web forums, Slashdot and Wikipedia, have drastically changed the equation of mass social interaction online. As individuals participate and contribute content, many of their actions are visible to other participants. The work of making a contribution, supporting and maintaining the community are equally valuable to understanding what a community is about. Further, interpretation and understanding of those actions can influence the direction of public decision making (Borning et al. 2005), influence reputations (Resnick et al. 2000), notions of expertise (McDonald and Ackerman 1998) as well as other aspects of collaboration.Wikipedia is an example SMT where large numbers of online actions can be observed. The Wikimedia Foundation provides regular releases of the complete contents of Wikipedia. These releases include all article, user, discussion, and administrative pages, each with the complete revision history. These regular releases have made it possible for us to consider future system architectures that can assist users making observations and interpretations of others activities.", "num_citations": "5\n", "authors": ["1201"]}
{"title": "Putting Words to Work: Integrating Conversation with Workflow Modeling\n", "abstract": " The ad-hoc nature of work practice is a challenge for developers of systems that attempt to model and support the enaction of work processes. Development in workflow modeling systems has taken a number of approaches to addressing the issue of exceptions, or deviations from the “ideal” process. We suggest that one significant element, that of informal communication between process participants, has been largely overlooked by these efforts. Not only is social interaction a key component of work practice, it serves a particularly important role in addressing unusual situations, solving problems, and coordinating the implementation of those solutions. This paper explores the design space of integrating tools for conversation with workflow systems. 1", "num_citations": "5\n", "authors": ["1201"]}
{"title": "Reciprocity and Donation: How Article Topic, Quality and Dwell Time Predict Banner Donation on Wikipedia\n", "abstract": " Donation-based support for open, peer production projects such as Wikipedia is an important mechanism for preserving their integrity and independence. For this reason understanding donation behavior and incentives is crucial in this context. In this work, using a dataset of aggregated donation information from Wikimedia's 2015 fund-raising campaign, representing nearly 1 million pages from English and French language versions of Wikipedia, we explore the relationship between the properties of contents of a page and the number of donations on this page. Our results suggest the existence of a reciprocity mechanism, meaning that articles that provide more utility value attract a higher rate of donation. We discuss these and other findings focusing on the impact they may have on the design of banner-based fundraising campaigns. Our findings shed more light on the mechanisms that lead people to donate to …", "num_citations": "4\n", "authors": ["1201"]}
{"title": "Self-Presentation: Structured and semi-structured user profiles\n", "abstract": " CiteSeerX — Self-Presentation: Structured and semistructured user profiles Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced Search Include Citations Tables: DMCA Self-Presentation: Structured and semistructured user profiles Cached Download as a PDF Download Links [dub.washington.edu] [www.cs.washington.edu] [homes.cs.washington.edu] [www.cs.ubc.ca] Save to List Add to Collection Correct Errors Monitor Changes by Linda Le , Ivan Beschastnikh , David W. Mcdonald Summary Citations Active Bibliography Co-citation Clustered Documents Version History Share Facebook Twitter Reddit Bibsonomy OpenURL Abstract Copyright is held by the author/owner(s). Keyphrases user profile author owner Powered by: Apache Solr About CiteSeerX Submit and Index Documents Privacy Policy Help Data Source …", "num_citations": "4\n", "authors": ["1201"]}
{"title": "Exploring Systematic Bias through Article Deletions on Wikipedia from a Behavioral Perspective\n", "abstract": " The gender gap in participation on Wikipedia is well established. The impacts of the participation bias on content may be expressed through a number of different behaviors. This research considers potential content biases that may result from efforts to delete content. We collect deletion data on a sample of article pages selected based on a method designed to identify content of likely interest to a specific group of people; men and women in this case. The analysis illustrates that there does not appear to be a systematic bias resulting in more deletions or nominations for deletions against content of likely interest to women. We consider how these results improve our understanding of bias and the ways peer production systems can mitigate the potential for biases.", "num_citations": "3\n", "authors": ["1201"]}
{"title": "Venting Weight: Analyzing the Discourse of an Online Weight Loss Forum\n", "abstract": " Online social communities are becoming increasingly popular platforms for people to share information, seek emotional support, and maintain accountability for losing weight. Studying the discourse in these communities can offer insights on how users benefit from using these applications. This paper presents an analysis of language and discourse patterns in forum posts by users who lose weight and keep it off versus users with fluctuating weight dynamics. In contrast to prior studies, we have access to the weekly self-reported check-in weights of users along with their forum posts. This paper also presents a study on how goal-oriented forums are different from general online forums in terms of language markers. Our results reveal dierences about how the types of posts made by users vary along with their weight-loss patterns. These insights are closely related to the power dynamics of social interactions and can enable better design ofweight-loss applications thereby contributing to a healthy society.", "num_citations": "3\n", "authors": ["1201"]}
{"title": "Indicoder: an extensible system for online annotation\n", "abstract": " Online annotations provide an effective way for distributed individuals to better understand and categorize online content, both from the perspective of distilling information presented into more easily interpretable forms and by supporting content analysis to tag individual statements with their intended meaning. This poster presents Indicoder, an application to support in-place content analysis, allowing users to both annotate online corpora and providing a means of tracking those annotations over time so that living documents such as Wikipedia articles and online sources can be analyzed in their authentic contexts.", "num_citations": "3\n", "authors": ["1201"]}
{"title": "Text Classification to Weave Medical Advice with Patient Experiences\n", "abstract": " Unlike face-to-face patient support groups, clinicians providing medical advice to peer-patient conversations is challenging in online patient communities due to its large scale. We are developing a system that weaves medical advice into online patient conversations. As an initial step, we are exploring text classification of answers contributed by health professionals and patients. Using unigrams, we were able to predict with 91.9% accuracy whether an answer was written by a health professional or a patient.", "num_citations": "3\n", "authors": ["1201"]}
{"title": "Wiki architectures as social translucence enablers\n", "abstract": " Whether novice or expert, it is useful for contributors to understand the environment to which they are contributing, including the relationships of other users to the content and to users. However, the relationships and work that enable content creation in an online contributor system, such as Wikipedia, are not always visible. To expose and better understand these relationships, we have built an information visualization toolkit called Re: Flex to support components of social translucence in Wikipedia, with broad applicability to other contributor systems. By mimicking the flexible, fluid architecture of a wiki within the blackboard architecture of this visualization toolkit, we demonstrate how the composable interactions inherent to contributor systems can be mirrored in the tools that support the work which creates them.", "num_citations": "3\n", "authors": ["1201"]}
{"title": "Problem Solving Probes: A Method for Discovering Conceptual Disconnects with Digital Living Technologies\n", "abstract": " As people adopt a digital lifestyle the associated digital devices are brought into the home and family. Yet the difficulty of getting networked digital media devices to interoperate is frustrating for many households. Our research is examining how households resolve interoperability issues with digital media ensembles; sets of networked media devices. We describe our methods for studying households and some of our preliminary results. We have found that our participants have problems at different conceptual levels. Resolving problems or misconceptions at a lower level may only result in uncovering another problem at a higher level.", "num_citations": "3\n", "authors": ["1201"]}
{"title": "Collaborating Over Project Schedules\n", "abstract": " Numerous case studies and ethnographies have shown project management in software engineering to be a collaborative activity. However, project management\" tools of the trade\" do not readily support collaboration. As a result, project management breakdowns can occur. This paper discusses the issues of collaborative project management and makes recommendations for future project management tool development.", "num_citations": "3\n", "authors": ["1201"]}
{"title": "Sharing your coding schemas: Developing a Platform to fit within the Qualitative Research Workflow\n", "abstract": " Qualitative coding schemas are an essential part of qualitative research used in methods like Grounded Theory. To date, there is no platform to share these coding schemas. Sharing and exchanging these coding schemas has a great potential when it comes to the traceability of qualitative research and well as the re-use of coding schemas. Based on an interview study with qualitative researchers, we propose concepts for integrating a new platform for sharing qualitative coding schemas. Based on theoretical work by Birnholtz and Bietz (2002), it became clear that an easy-to-use system can foster the acceptance and the willingness of researchers to share their coding schemas. We identified three major points to focus for this on: the governance of the platform, the development of the ontology itself and integrating the sharing of qualitative coding schemas into the workflow of researchers by enabling direct upload …", "num_citations": "2\n", "authors": ["1201"]}
{"title": "Learning to Detect Vandalism in Social Content Systems: A Study on Wikipedia\n", "abstract": " A challenge facing user generated content systems is vandalism, i.e. edits that damage content quality. The high visibility and easy access to social networks makes them popular targets for vandals. Detecting and removing vandalism is critical for these user generated content systems. Because vandalism can take many forms, there are many different kinds of features that are potentially useful for detecting it. The complex nature of vandalism, and the large number of potential features, make vandalism detection difficult and time consuming for human editors. Machine learning techniques hold promise for developing accurate, tunable, and maintainable models that can be incorporated into vandalism detection tools. We describe a method for training classifiers for vandalism detection that yields classifiers that are more accurate on the PAN 2010 corpus than others previously developed. Because of the high …", "num_citations": "2\n", "authors": ["1201"]}
{"title": "Extracting Everyday Health Interests from Online Communities.\n", "abstract": " Increasing numbers of patients are using online communities to seek support by posting personal stories and requesting information. To leverage this trend, we investigated Natural Language Processing (NLP) tools for extracting users’ health interests from online communities. We identified relevant semantic types of the Unified Medical Language System (UMLS) for online communities. The results suggest that we can repurpose NLP tools for online communities without losing critical information.", "num_citations": "2\n", "authors": ["1201"]}
{"title": "Task dependency and the organization of the crowd\n", "abstract": " A critical challenge for crowdsourcing software and infrastructure is organizing the efforts and activities of largely disconnected individuals to achieve some larger goal. This position paper suggests that existing research in Organization Science and Management is likely to have important intellectual insights that should influence how crowdsourcing infrastructures are designed and implemented. This position paper considers one such stance on the social psychology of organizing, outlining the basic premise and characterizing how crowdsourcing, while changing some basic assumptions, could apply the finding.", "num_citations": "2\n", "authors": ["1201"]}
{"title": "Enabling social translucence for Wikipedia\n", "abstract": " Newcomers to online communities often have trouble understanding the context and activities of other participants. But this is not just a problem to newcomers; even established members can struggle to comprehend social dynamics in their own communities. Social translucence is a conceptual approach to designing systems that facilitate better sensemaking about others and their actions in online social settings. We have been developing a framework to facilitate socially translucent tools and extensions for distributed contributor communities such as Wikipedia. This demo presents example tools and an evolving architecture to illustrate characteristics of social translucence.", "num_citations": "2\n", "authors": ["1201"]}
{"title": "Navigating the Challenges of Multi-Site Research\n", "abstract": " Our full day-workshop focuses on challenges encountered by researchers attempting to design and conduct studies that span 2 or more social computing platforms, such as parallel sites for different language populations, different platforms, or different user experience designs. Social computing researchers are increasingly interested in these studies that examine user behavior across different sites. For example, researchers have conducted multi-sited studies to understand user behavior across culture, language, and media. In such studies, researchers are challenged to develop and execute methodologies that allow them to navigate frameworks that enable comparisons among multiple sites. Researchers face challenges adapting their methodologies to handle diverse populations, regulations, large datasets and more. The goal of this workshop is to come to a common understanding of what multi-site research …", "num_citations": "1\n", "authors": ["1201"]}
{"title": "Foundations and Trends® in Human–Computer Interaction\n", "abstract": " As the rates of lifestyle diseases such as obesity, diabetes, and heart disease continue to rise, the development of effective tools that can help people adopt and sustain healthier habits is becoming ever more important. Mobile computing holds great promise for providing effective support for helping people manage their health in everyday life. Yet, for this promise to be realized, mobile wellness systems need to be well designed, not only in terms of how they implement specific behavior-change techniques but also, among other factors, in terms of how much burden they put on the user, how well they integrate into the user's daily life, and how they address the user's privacy concerns. Designing for all of these constraints is difficult, and it is often not clear what tradeoffs particular design decisions have on how a wellness application is experienced and used. In this monograph, we provide an account of different …", "num_citations": "1\n", "authors": ["1201"]}
{"title": "Social Computing: A Research Topic in Search of Disciplinarity\n", "abstract": " Social Computing is facing a distinct challenge, one that faces many research topics as researchers become interested and begin to explore the topic in-depth. The challenge is whether a topic is really just some kind of conceptual space or whether there are distinct principles, theories or methods that bring the topic to the level of a new discipline. There is a repeatable, reliable progression when new disciplines emerge and Social Computing has begun that progression.This paper is a brief (and biased) review of selected disciplines that might provide a home to Social Computing. In the progression from topic to discipline, understanding what established disciplines have to offer in terms of theory and methods that we can adopt and what parts of a discipline we should avoid, is critical to reflecting on what will define Social Computing as unique and possibly worthy of being promoted to the realm of discipline. I close with three principles that I believe should differentiate Social Computing.", "num_citations": "1\n", "authors": ["1201"]}
{"title": "IT@ Home: unraveling complexities of networked devices in the home\n", "abstract": " The home is becoming a complex and hard to manage collection of computers and digital lifestyle devices. The work to setup and maintain a network of digital living devices in the home is similar to the work of IT professionals. Indeed the growing complexity of interconnected digital devices results in more and more time spent solving problems with those devices and their configurations, an important part of computer use that we call\"[email protected]\". This workshop explores the complexity of framing the right problems, methods for studying those problems, and designing to support users'[email protected]", "num_citations": "1\n", "authors": ["1201"]}