{"title": "A self-updating road map of The Cancer Genome Atlas\n", "abstract": " Motivation: Since 2011, The Cancer Genome Atlas’ (TCGA) files have been accessible through HTTP from a public site, creating entirely new possibilities for cancer informatics by enhancing data discovery and retrieval. Significantly, these enhancements enable the reporting of analysis results that can be fully traced to and reproduced using their source data. However, to realize this possibility, a continually updated road map of files in the TCGA is required. Creation of such a road map represents a significant data modeling challenge, due to the size and fluidity of this resource: each of the 33 cancer types is instantiated in only partially overlapping sets of analytical platforms, while the number of data files available doubles approximately every 7 months.                    Results: We developed an engine to index and annotate the TCGA files, relying exclusively on third-generation web technologies (Web 3.0 …", "num_citations": "40\n", "authors": ["770"]}
{"title": "ImageJS: personalized, participated, pervasive, and reproducible image bioinformatics in the web browser\n", "abstract": " Background:Image bioinformatics infrastructure typically relies on a combination of server-side high-performance computing and client desktop applications tailored for graphic rendering. On the server side, matrix manipulation environments are often used as the back-end where deployment of specialized analytical workflows takes place. However, neither the server-side nor the client-side desktop solution, by themselves or combined, is conducive to the emergence of open, collaborative, computational ecosystems for image analysis that are both self-sustained and user driven.Materials and Methods:ImageJS was developed as a browser-based webApp, untethered from a server-side backend, by making use of recent advances in the modern web browser such as a very efficient compiler, high-end graphical rendering capabilities, and I/O tailored for code migration.Results:Multiple versioned code hosting services …", "num_citations": "37\n", "authors": ["770"]}
{"title": "Information architecture of a clinical decision support system\n", "abstract": " Recent healthcare legislation, the move to electronic health records, and the accelerating pace of medical knowledge discovery combine to create an environment in which clinical decision support systems are a necessary part of most medical processes. Based on a review of current best practices, we present the information architecture of a clinical decision support system comprised of four primary components: patient model, treatment library, intelligent agents, and an authenticated knowledge base. The patient model contains all patient information in the form of measurable parameters, treatment history, and health goals. Information regarding treatment procedures, dosages, and effects is stored in treatment library. Intelligent agents are used to optimize courses of treatments to best achieve desired health goals. Finally, an authenticated knowledge base containing the most recent medical research is used to …", "num_citations": "16\n", "authors": ["770"]}
{"title": "Cyber-physical ecosystems: app-centric software ecosystems in cyber-physical environments\n", "abstract": " The conceptual frameworks and information architectures of app-centric software ecosystems and cyber-physical systems (CPS) provide complimentary approaches to modeling systems. When integrated, these frameworks combine to become cyber-physical ecosystems (CPE). CPE are CPS whose constituent members, themselves CPS, meet the criteria for consideration as apps. Alternatively, CPE may be viewed as app-centric software ecosystems whose shared data environment includes the physical operating environment of the apps. By taking an app-centric approach to CPS integration, a semantically driven, information architecture based decomposition of a larger CPS into it’s component CPS becomes possible.", "num_citations": "8\n", "authors": ["770"]}
{"title": "TCGA toolbox: an open web app framework for distributing big data analysis pipelines for cancer genomics\n", "abstract": " The diversity and volume of data generated by the cancer genome atlas (TCGA) has been increasing exponentially, with the number of data files hosted by NHI, currently 3/4 million, doubling every 7 months since January 2010. The proponents have recently developed a browser-based self-updating mechanism to catalog this dynamic big data repository. In this report, that foundation is built upon to devise a web app framework to distribute TCGA analytical pipelines in a manner that can be fully reproducible without the usual requirement for a pre-installed specialized computational statistics environment. The solution found relies exclusively of sandboxed code injection (JavaScript) and on access permission configuration by the browser's app store. This framework was devised with an open architecture such that third party analyses, ideally hosted with web-facing version control in a repository such as GitHub …", "num_citations": "2\n", "authors": ["770"]}
{"title": "Design space decomposition using concept maps\n", "abstract": " Decomposition of engineering design spaces has been performed primarily through statistical and system identification techniques. However, no approach has yet attempted to capture the semantics of a design through decomposition. This thesis presents graphical techniques for capturing the semantics of a design by developing an information architecture through design space decomposition using concept maps. In particular, concept maps are used to begin identifying the top layers of the information architecture of a problem, which has the dual effects of performing an initial decomposition of the design space and refining the parameters that will define more detailed design spaces for further decomposition using traditional techniques. By demonstrating these techniques in two case studies, the techniques are shown to capture the semantics of a design in a computable format.", "num_citations": "2\n", "authors": ["770"]}
{"title": "CLiniCaL aPPLiCations and data MininG\n", "abstract": " As the quantity of medical patient data available to the number of physicians increases, Electronic Healthcare Record (EHR) systems become a necessity for providing more reliable and better quality healthcare [1]. The benefit of using EHR’s is dramatic enough that several nations, including the United States, have enacted legislation to provide strong incentives encouraging the use of Electronic Healthcare Records (EHR), as well as penalties for failing to use them [2]. These factors combine to make the adoption of EHR over paper-based systems inevitable. As the use of EHR increases, biomedical practitioners should be expected to make the best possible use of the wealth of computable patient data EHR systems will contain.", "num_citations": "2\n", "authors": ["770"]}