{"title": "Usability of gamified knowledge learning in VR and desktop-3D\n", "abstract": " Affine Transformations (ATs) often escape an intuitive approach due to their high complexity. Therefore, we developed GEtiT that directly encodes ATs in its game mechanics and scales the knowledge's level of abstraction. This results in an intuitive application as well as audiovisual presentation of ATs and hence in a knowledge learning. We also developed a specific Virtual Reality (VR) version to explore the effects of immersive VR on the learning outcomes. This paper presents our approach of directly encoding abstract knowledge in game mechanics, the conceptual design of GEtiT and its technical implementation. Both versions are compared in regard to their usability in a user study. The results show that both GEtiT versions induce a high degree of flow and elicit a good intuitive use. They validate the effectiveness of the design and the resulting knowledge application requirements. Participants favored GEtiT …", "num_citations": "21\n", "authors": ["963"]}
{"title": "The effects of immersion on harm-inducing factors in virtual slot machines\n", "abstract": " Slot machines are one of the most played games by pathological gamblers. New technologies, e.g. immersive Virtual Reality (VR), offer more possibilities to exploit erroneous beliefs in the context of gambling. However, the risk potential of VR-based gambling has not been researched, yet. A higher immersion might increase harmful aspects, thus making VR realizations more dangerous. Measuring harm-inducing factors reveals the risk potential of virtual gambling. In a user study, we analyze a slot machine realized as a desktop 3D and as an immersive VR version. Both versions are compared in respect to effects on dissociation, urge to gamble, dark flow, and illusion of control. Our study shows significantly higher values of dissociation, dark flow, and urge to gamble in the VR version. Presence significantly correlates with all measured harm-inducing factors. We demonstrate that VR-based gambling has a higher …", "num_citations": "8\n", "authors": ["963"]}
{"title": "Interactive Gamified Virtual Reality Training for Affine Transformations.\n", "abstract": " Affine transformations which are used in many engineering areas often escape an intuitive approach due to their high level of complexity and abstractness. Learners not only need to understand the basic rules of matrix algebra but are also challenged to understand how the theoretically grounded aspects result in object transformations. Therefore, we developed the Gamified Training Environment for Affine Transformation that directly encodes this abstract learning content in its game mechanics. By intuitively presenting and demanding the application of affine transformations in a virtual gamified training environment, learners train the application of the knowledge due to repetition while receiving immediate and highly immersive visual feedback about the outcomes of their inputs. Also, by providing a flow-inducing gameplay, users are highly motivated to practice their knowledge thus experiencing a higher learning quality. As the immersion, presence and spatial knowledge presentation can have a positive effect on the training outcome, GEtiT explores the effectivity of different visual immersion levels by providing a desktop and a VR version. This article presents our approach of directly encoding the abstract learning content in game mechanics, describes the conceptual design as well as technical implementation and discusses the design differences between the two GEtiT versions.", "num_citations": "8\n", "authors": ["963"]}
{"title": "Think twice: The influence of immersion on decision making during gambling in virtual reality\n", "abstract": " Immersive Virtual Reality (VR) is increasingly being explored as an alternative medium for gambling games to attract players. Typically, gambling games try to impair a player's decision making, usually for the disadvantage of the players' financial outcome. An impaired decision making results in the inability to differentiate between advantageous and disadvantageous options. We investigated if and how immersion impacts decision making using a VR-based realization of the Iowa Gambling Task (IGT) to pinpoint potential risks and effects of gambling in VR. During the IGT, subjects are challenged to draw cards from four different decks of which two are advantageous. The selections made serve as a measure of a participant's decision making during the task. In a novel user study, we compared the effects of immersion on decision making between a low-immersive desktop-3D-based IGT realization and a high …", "num_citations": "3\n", "authors": ["963"]}