{"title": "From Mtl to Deterministic Timed Automata\n", "abstract": " In this paper we propose a novel technique for constructing timed automata from properties expressed in the logic mtl, under bounded-variability assumptions. We handle full mtl and include all future operators. Our construction is based on separation of the continuous time monitoring of the input sequence and discrete predictions regarding the future. The separation of the continuous from the discrete allows us to determinize our automata in an exponential construction that does not increase the number of clocks. This leads to a doubly exponential construction from mtl to deterministic timed automata, compared with triply exponential using existing approaches. We offer an alternative to the existing approach to linear real-time model checking, which has never been implemented. It further offers a unified framework for model checking, runtime monitoring, and synthesis, in an approach that can reuse tools …", "num_citations": "62\n", "authors": ["1650"]}
{"title": "Contracts for systems design: Theory\n", "abstract": " Aircrafts, trains, cars, plants, distributed telecommunication military or health care systems, and more, involve systems design as a critical step. Complexity has caused system design times and costs to go severely over budget so as to threaten the health of entire industrial sectors. Heuristic methods and standard practices do not seem to scale with complexity so that novel design methods and tools based on a strong theoretical foundation are sorely needed. Model-based design as well as other methodologies such as layered and compositional design have been used recently but a unified intellectual framework with a complete design flow supported by formal tools is still lacking. Recently an “orthogonal” approach has been proposed that can be applied to all methodologies introduced thus far to provide a rigorous scaffolding for verification, analysis and abstraction/refinement: contractbased design. Several results have been obtained in this domain but a unified treatment of the topic that can help in putting contract-based design in perspective is missing. This paper intends to provide such treatment where contracts are precisely defined and characterized so that they can be used in design methodologies such as the ones mentioned above with no ambiguity. In addition, the paper provides an important link between interface and contract theories to show similarities and correspondences. This paper is complemented by a companion paper where contract based design is illustrated through use cases.", "num_citations": "53\n", "authors": ["1650"]}
{"title": "Analog property checkers: a DDR2 case study\n", "abstract": " The formal specification component of verification can be exported to simulation through the idea of property checkers. The essence of this approach is the automatic construction of an observer from the specification in the form of a program that can be interfaced with a simulator and alert the user if the property is violated by a simulation trace. Although not complete, this lighter approach to formal verification has been effectively used in software and digital hardware to detect errors. Recently, the idea of property checkers has been extended to analog and mixed-signal systems.               In this paper, we apply the property-based checking methodology to an industrial and realistic example of a DDR2 memory interface. The properties describing the DDR2 analog behavior are expressed in the formal specification language stl/psl in form of assertions. The simulation traces generated from an actual DDR2 …", "num_citations": "41\n", "authors": ["1650"]}
{"title": "Robustness of sequential circuits\n", "abstract": " Digital components play a central role in the design of complex embedded systems. These components are interconnected with other, possibly analog, devices and the physical environment. This environment cannot be entirely captured and can provide inaccurate input data to the component. It is thus important for digital components to have a robust behavior, i.e. the presence of a small change in the input sequences should not result in a drastic change in the output sequences. In this paper, we study a notion of robustness for sequential circuits. However, since sequential circuits may have parts that are naturally discontinuous (e.g., digital controllers with switching behavior), we need a flexible framework that accommodates this fact and leaves discontinuous parts of the circuit out from the robustness analysis. As a consequence, we consider sequential circuits that have their input variables partitioned into two …", "num_citations": "34\n", "authors": ["1650"]}
{"title": "Checking timed and hybrid properties: Theory and applications\n", "abstract": " The growth of consumer embedded devices, where digital, analog and software components are often combined together on a single chip, results in an increase of complexity of the design and verification processes. The validation of such analog and mixed-signal systems largely relies on simulation-based techniques combined with often ad-hoc analysis methods. This thesis is motivated by the export of property-based formal techniques to the validation of analog and mixed-signal systems, at their continuous and timed levels of abstraction. Since the formal verification of non-trivial continuous systems remains very difficult, we resort to a lighter validation technique, that is, property-based monitoring.We define signal temporal logic STL as a high-level specification language that allows expressing temporal properties of continuous and timed signals. STL is as an extension of the realtime metric interval temporal logic MITL, where continuous signals are transformed into Boolean ones using numerical predicates, and the temporal relations between them are expressed using standard real-time temporal operators whose atomic propositions correspond to those predicates.We develop two monitoring procedures, offline and incremental, for checking the correctness of simulation traces with respect to STL properties and implement them into a stand alone analog monitoring tool (AMT). The property-based monitoring framework is applied, using the AMT tool, to two real-world case studies, considering properties of a FLASH memory cell and a DDR2 memory interface. We also consider the problem of property-based formal verification of timed systems …", "num_citations": "28\n", "authors": ["1650"]}
{"title": "Compositional specifications for ioco testing\n", "abstract": " Model-based testing is a promising technology for black-box software and hardware testing, in which test cases are generated automatically from high-level specifications. Nowadays, systems typically consist of multiple interacting components and, due to their complexity, testing presents a considerable portion of the effort and cost in the design process. Exploiting the compositional structure of system specifications can considerably reduce the effort in model-based testing. Moreover, inferring properties about the system from testing its individual components allows the designer to reduce the amount of integration testing. In this paper, we study compositional properties of the ioco-testing theory. We propose a new approach to composition and hiding operations, inspired by contract-based design and interface theories. These operations preserve behaviors that are compatible under composition and hiding, and …", "num_citations": "27\n", "authors": ["1650"]}
{"title": "Dynamic reactive modules\n", "abstract": " State-transition systems communicating by shared variables have been the underlying model of choice for applications of model checking. Such formalisms, however, have difficulty with modeling process creation or death and communication reconfigurability. Here, we introduce “dynamic reactive modules” (DRM), a state-transition modeling formalism that supports dynamic reconfiguration and creation/death of processes. The resulting formalism supports two types of variables, data variables and reference variables. Reference variables enable changing the connectivity between processes and referring to instances of processes. We show how this new formalism supports parallel composition and refinement through trace containment. DRM provide a natural language for modeling (and ultimately reasoning about) biological systems and multiple threads communicating through shared variables.", "num_citations": "25\n", "authors": ["1650"]}
{"title": "Interface-aware signal temporal logic\n", "abstract": " Safety and security are major concerns in the development of Cyber-Physical Systems (CPS). Signal temporal logic (STL) was proposed as a language to specify and monitor the correctness of CPS relative to formalized requirements. Incorporating STL into a development process enables designers to automatically monitor and diagnose traces, compute robustness estimates based on requirements, and perform requirement falsification, leading to productivity gains in verification and validation activities; however, in its current form STL is agnostic to the input/output classification of signals, and this negatively impacts the relevance of the analysis results.", "num_citations": "19\n", "authors": ["1650"]}
{"title": "RTAMT: Online robustness monitors from STL\n", "abstract": " We present rtamt, an online monitoring library for Signal Temporal Logic (STL) and its interface-aware variant (IA-STL), providing both discrete- and dense-time interpretation of the logic. We also introduce , a tool that integrates rtamt with Robotic Operating System (ROS), a common environment for developing robotic applications. We evaluate  and  on two robotic case studies.", "num_citations": "16\n", "authors": ["1650"]}
{"title": "Assertion-based monitoring in practice–checking correctness of an automotive sensor interface\n", "abstract": " This paper provides an evaluation of the assertion-based monitoring technology for mixed-signal systems applied to a real-world case study from the automotive domain. We first motivate the case study by presenting the state-of-the-practice verification and validation work-flow typically used in the automotive industry. We identify the shortcomings of this work-flow, and propose a more rigorous and automated methodology based on monitoring correctness of simulated mixed signal designs with respect to Signal Temporal Logic (STL) assertions, which formalize the requirements from the design specification. We apply this assertion-based monitoring framework to check the correctness of a Distributed System Interface (DSI3) mixed-signal protocol implementation in a modern airbag system-on-chip application. We present all the relevant steps in our proposed work-flow and evaluate the results. We discuss potential …", "num_citations": "15\n", "authors": ["1650"]}
{"title": "Contracts for systems design: methodology and application cases\n", "abstract": " Recently, contract based design has been proposed as an ”orthogonal” approach that can be applied to all methodologies proposed so far to cope with the complexity of system design. Contract based design provides a rigorous scaffolding for verification, analysis and abstraction/refinement. Companion report RR-8759 proposes a unified treatment of the topic that can help in putting contract-based design in perspective. This paper complements RR-8759 by further discussing methodological aspects of system design with contracts in perspective and presenting two application cases. The first application case illustrates the use of contracts in requirement engineering, an area of system design where formal methods were scarcely considered, yet are stringently needed. We focus in particular to the critical design step by which sub-contracts are generated for suppliers from a set of different viewpoints (specified as contracts) on the global system. We also discuss important issues regarding certification in requirement engineering, such as consistency, compatibility, and completeness of requirements. The second example is developed in the context of the Autosar methodology now widely advocated in the automotive sector. We propose a contract framework to support schedulability analysis, a key step in Autosar methodology. Our aim differs from the many proposals for compositional schedulability analysis in that we aim at defining sub-contracts for suppliers, not just performing the analysis by parts—we know from companion paper RR-8759 that sub-contracting to suppliers differs from a compositional analysis entirely performed by the OEM. We …", "num_citations": "15\n", "authors": ["1650"]}
{"title": "CPS/IoT Ecosystem: A platform for research and education\n", "abstract": " The CPS/IoT Ecosystem project aims to build an IoT infrastructure that will be used as a platform for research and education in multiple disciplines related to CPS and IoT. The main objective is to provide a real-world infrastructure, and allow students and researchers explore its capabilities on actual use cases.", "num_citations": "14\n", "authors": ["1650"]}
{"title": "The first-order logic of signals\n", "abstract": " Formalizing properties of systems with continuous dynamics is a challenging task. In this paper, we propose a formal framework for specifying and monitoring rich temporal properties of real-valued signals. We introduce signal first-order logic (SFO) as a specification language that combines first-order logic with linear-real arithmetic and unary function symbols interpreted as piecewise-linear signals. We first show that while the satisfiability problem for SFO is undecidable, its membership and monitoring problems are decidable. We develop an offline monitoring procedure for SFO that has polynomial complexity in the size of the input trace and the specification, for a fixed number of quantifiers and function symbols. We show that the algorithm has computation time linear in the size of the input trace for the important fragment of bounded-response specifications interpreted over input traces with finite variability. We can use our results to extend signal temporal logic with first-order quantifiers over time and value parameters, while preserving its efficient monitoring. We finally demonstrate the practical appeal of our logic through a case study in the microelectronics domain.", "num_citations": "14\n", "authors": ["1650"]}
{"title": "Independent implementability of viewpoints\n", "abstract": " Interface theories provide a formal framework for component-based development of software and hardware which supports the incremental design of systems and the independent implementability of components. These capabilities are ensured through mathematical properties of the parallel composition operator and the refinement relation for components. More recently, a conjunction operation was added to interface theories in order to provide support for handling multiple viewpoints, requirements engineering, and component reuse. Unfortunately, the conjunction operator does not allow independent implementability in general.               In this paper, we study conditions that need to be imposed on interface models in order to enforce independent implementability with respect to conjunction. We focus on multiple viewpoint specifications and propose a new compatibility criterion between two interfaces …", "num_citations": "14\n", "authors": ["1650"]}
{"title": "Complete composition operators for IOCO-testing theory\n", "abstract": " We extend the theory of input-output conformance with operators for merge and quotient. The former is useful when testing against multiple requirements or views. The latter can be used to generate tests for patches of an already tested system. Both operators can combine systems with different action alphabets, which is usually the case when constructing complex systems and specifications from parts, for instance different views as well as newly defined functionality of a previous version of the system.", "num_citations": "13\n", "authors": ["1650"]}
{"title": "A pattern-based formalization of cloud-based elastic systems\n", "abstract": " Cloud-based elastic systems leverage cloud infrastructures to implement elasticity, the ability of computing systems to dynamically adjust their capacity by changing the allocation of resources in response to fluctuating workloads. The runtime behavior of elastic systems is the result of an intricate interplay of many factors that include the input workload, the elasticity logic determining the resources allocation, and the technology of the underlying cloud. This makes elastic systems difficult to design and hard to specify. In this paper we propose a novel formalization of elasticity and related concepts that is based on timed patterns written using timed regular expressions. Timed regular expressions naturally deal with dense-time signals, and timed patterns allow us to intuitively describe relevant changes in those signals. This, in turn, enables us to directly characterize elasticity as relation between relevant changes in the …", "num_citations": "11\n", "authors": ["1650"]}
{"title": "Incremental language inclusion checking for networks of timed automata\n", "abstract": " Checking the language inclusion between two models is a fundamental problem arising in application areas such as formal verification or refinement in top-down design. We propose an incremental procedure for checking the language inclusion between two real-time specifications, modeled as networks of deterministic timed automata, where the two specifications are equivalent up to one component. For such classes of systems we aim to improve the efficiency of the language inclusion check by exploiting the compositional nature of the problem and avoiding the explicit parallel composition of the timed automata in the network. We first develop a generic procedure that gives freedom to specific implementation choices. We then propose an instantiation of the procedure that is based on bounded model checking techniques. We illustrate the application of our approach in a case study and discuss promising …", "num_citations": "10\n", "authors": ["1650"]}
{"title": "Contracts for the design of embedded systems part i: Methodology and use cases\n", "abstract": " This is Part I of a sequence of two papers on Contract-Based Design (CBD). It is intended to:. Introduce the concepts underlying CBD;. Present the challenges facing facing designers of large-scale complex systems today;", "num_citations": "10\n", "authors": ["1650"]}
{"title": "Contracts for the design of embedded systems, Part II: Theory\n", "abstract": " This is Part II of a sequence of two papers on Contract-based Design (CBD). Part I introduced concepts, presented how CBD addresses the challenges facing designers of large-scale complex systems, placed it in the context of existing design methodologies and showed how it can be used effectively together with any other methodology so far proposed.Part II covers the theoretical foundations that are essential to make CBD robust and well supported by tools and software frameworks. We believe that contract-based design is going to be a key part of the future of system design and for this reason, this contribution is important for the design community.", "num_citations": "10\n", "authors": ["1650"]}
{"title": "Shape expressions for specifying and extracting signal features\n", "abstract": " Cyber-physical systems (CPS) and the Internet-of-Things (IoT) result in a tremendous amount of generated, measured and recorded time-series data. Extracting temporal segments that encode patterns with useful information out of these huge amounts of data is an extremely difficult problem. We propose shape expressions as a declarative formalism for specifying, querying and extracting sophisticated temporal patterns from possibly noisy data. Shape expressions are regular expressions with arbitrary (linear, exponential, sinusoidal, etc.) shapes with parameters as atomic predicates and additional constraints on these parameters. We equip shape expressions with a novel noisy semantics that combines regular expression matching semantics with statistical regression. We characterize essential properties of the formalism and propose an efficient approximate shape expression matching procedure. We …", "num_citations": "9\n", "authors": ["1650"]}
{"title": "A toolchain for verifying safety properties of hybrid automata via pattern templates\n", "abstract": " In this paper, we provide a toolchain that facilitates the integration of formal verification techniques into model-based design. Applying verification tools to industrially relevant models requires three main ingredients: a formal model, a formal verification method, and a set of formal specifications. Our focus is on hybrid automata as the model and on reachability analysis as the method. Much progress has been made towards developing efficient and scalable reachability algorithms tailored to hybrid automata. However, it is not easy to encode rich formal specifications such that they can be interpreted by existing tools for reachability. Herein, we consider specifications expressed in pattern templates which are predefined properties with placeholders for state predicates. Pattern templates are close to the natural language and can be easily understood by both expert and non-expert users. We provide (i) formal definitions …", "num_citations": "8\n", "authors": ["1650"]}
{"title": "Compositional contract abstraction for system design\n", "abstract": " Contract-based design has been recently proposed as a framework for concurrent system design in the context of complex supplier chains, where sub-system design can be sub-contracted to suppliers while guaranteeing correct system integration. A unifying meta-theory of contracts was proposed in [Benveniste et al. 2012], which subsumes known frameworks such as interface theories, modal interfaces, and Assume/Guarantee contracts. This report proposes, for this meta-theory of contracts, a generic abstraction technique allowing to prove contract properties based on their abstractions. More precisely, we show how to lift abstractions, from components to contracts, in a systematic way. In doing so, fundamental relations such as being a correct implementation or a valid environment, refining, can be checked on abstractions. Our abstraction technique is fully compositional with respect to contract conjunction. Compositionality of abstraction with respect to contract composition is only partially achieved. We believe that the results we obtain are the best achievable ones and we explain the obstructions we see against improving them. Our abstraction technique complements observers, proposed as a testing technique adapted to contracts in [6]. The latter allow disproving properties, whereas abstraction allows proving them. Key-words: system design, component based design, contract, interface, abstraction, abstract interpretation.", "num_citations": "8\n", "authors": ["1650"]}
{"title": "Synchronous interface theories and time triggered scheduling\n", "abstract": " We propose synchronous interfaces, a new interface theory for discrete-time systems. We use an application to time-triggered scheduling to drive the design choices for our formalism; in particular, additionally to deriving useful mathematical properties, we focus on providing a syntax which is adapted to natural high-level system modeling. As a result, we develop an interface model that relies on a guarded-command based language and is equipped with shared variables and explicit discrete-time clocks. We define all standard interface operations: compatibility checking, composition, refinement, and shared refinement. Apart from the synchronous interface model, the contribution of this paper is the establishment of a formal relation between interface theories and real-time scheduling, where we demonstrate a fully automatic framework for the incremental computation of time-triggered schedules.", "num_citations": "5\n", "authors": ["1650"]}
{"title": "Production Tests Coverage Analysis in the Simulation Environment\n", "abstract": " In the semiconductor industry, field returns have a negative impact with large costs and potential loss of reputation. As a consequence, a good coverage of the production tests with respect to the common manufacturing defects is essential to ensure the quality of the product to be delivered. Defect simulation is imperative to obtain coverage, however long simulation duration of the production tests can be a huge obstacle. Hence, there is an emergent need for novel methodologies to obtain coverage analysis of AMS chip production tests. In this paper, we address several aspects that are necessary to develop such a methodology. We first propose a method to identify a fault model that mimics the common manufacturing defects and extract all such faults from the DUT layout, we then develop a test ordering procedure that for a given fault selects the test from an existing test suite that is the most likely to detect the fault …", "num_citations": "3\n", "authors": ["1650"]}
{"title": "Formal Modeling and Analysis of Timed Systems: 10th International Conference, FORMATS 2012, London, UK, September 18-20, 2012, Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the 10th International Conference on Formal Modeling and Analysis of Timed Systems, FORMATS 2012, held in London, UK in September 2012. The 16 revised full papers presented together with 2 invited talks were carefully reviewed and selected from 34 submissions. The book covers topics of foundations and semantics, methods and tools, techniques, algorithms, hybrid automata, appilcations, real-time software and hardware circuits.", "num_citations": "2\n", "authors": ["1650"]}
{"title": "Formal Modeling and Analysis of Timed Systems: 5th International Conference, FORMATS 2007, Salzburg, Austria, October 3-5, 2007, Proceedings\n", "abstract": " This volume consists of the proceedings of the Fifth International Conference on Formal Modelling and Analysis of Timed Systems (FORMATS 2007). The main goal of this series of conferences is to bring together diverse communities of researchers that deal with the timing aspects of computing systems. Both fundamental and practical aspects of timed systems are addressed and results reportingnewapplicationdomainsareactivelyencouraged. Further, invitedtalks that survey various aspects of this broad research domain were presented at the conference. FORMATS 2007 was co-located (during October 3–5) as a guest conference attheEmbeddedSystemsWeek, whichconstitutesaweek-longeventthatbrings togetherconferences, tutorialsandworkshopsdealingwithvariousaspectsof-bedded systemsresearchanddevelopment. Embedded Systems Week took place this year at Salzburg, Austria during September 30-October 5, 2007. Detailed information about FORMATS 2007 can be found at http://www. ulb. ac. be/di/formats07, while http://www. esweek. org provides an overview of the-bedded Systems Week Event. We would like to thank the organizers of the-bedded Systems Week for enabling FORMATS 2007 to be co-located at this exciting event and for providing valuable logistics support.", "num_citations": "2\n", "authors": ["1650"]}
{"title": "Challenges of engineering safe and secure highly automated vehicles\n", "abstract": " After more than a decade of intense focus on automated vehicles, we are still facing huge challenges for the vision of fully autonomous driving to become a reality. The same \"disillusionment\" is true in many other domains, in which autonomous Cyber-Physical Systems (CPS) could considerably help to overcome societal challenges and be highly beneficial to society and individuals. Taking the automotive domain, i.e. highly automated vehicles (HAV), as an example, this paper sets out to summarize the major challenges that are still to overcome for achieving safe, secure, reliable and trustworthy highly automated resp. autonomous CPS. We constrain ourselves to technical challenges, acknowledging the importance of (legal) regulations, certification, standardization, ethics, and societal acceptance, to name but a few, without delving deeper into them as this is beyond the scope of this paper. Four challenges have been identified as being the main obstacles to realizing HAV: Realization of continuous, post-deployment systems improvement, handling of uncertainties and incomplete information, verification of HAV with machine learning components, and prediction. Each of these challenges is described in detail, including sub-challenges and, where appropriate, possible approaches to overcome them. By working together in a common effort between industry and academy and focusing on these challenges, the authors hope to contribute to overcome the \"disillusionment\" for realizing HAV.", "num_citations": "1\n", "authors": ["1650"]}
{"title": "Specifying and detecting temporal patterns with shape expressions\n", "abstract": " Modern Cyber-physical systems (CPS) and the Internet-of-Things (IoT) are data factories generating, measuring and recording huge amounts of time series. The useful information in time series is usually present in the form of sequential patterns. We propose shape expressions as a declarative language for specification and extraction of rich temporal patterns from possibly noisy data. Shape expressions are regular expressions with arbitrary (linear, exponential, sinusoidal, etc.) shapes with parameters as atomic predicates and additional constraints on these parameters. We associate to shape expressions novel noisy semantics that combines regular expression matching semantics with statistical regression. We study essential properties of the language and propose an efficient heuristic for approximate matching of shape expressions. We demonstrate the applicability of this technique on two case studies from the health and the avionics domains.", "num_citations": "1\n", "authors": ["1650"]}
{"title": "Formally correct monitors for hybrid automata\n", "abstract": " The paper Pattern Templates and Monitors for Verifying Safety Properties of Hybrid Automata aims to facilitate the integration of formal verification techniques into model-based design. It considers specifications expressed in pattern templates, which are predefined properties with placeholders for state predicates. Pattern templates are close to the natural language and can be easily understood by both expert and non-expert users. In this report, we give formal definitions for selected patterns in the formalism of hybrid automata and provide monitors which encode the properties as the reachability of an error state. By composing these monitors with the formal model under study, the property can be checked by off-the-shelf fully automated verification tools.", "num_citations": "1\n", "authors": ["1650"]}
{"title": "Monitoring and Measuring Hybrid Behaviors\n", "abstract": " Continuous and hybrid behaviors naturally arise from many dynamical systems. In this tutorial, we present state-of-the-art techniques for qualitative and quantitative reasoning about such behaviors. We introduce Signal Temporal Logic and Timed Regular Expressions as specification languages that we use to describe properties of hybrid systems. We then provide an overview of methods for (1) checking whether a hybrid behavior is correct and robust with respect to its specification; and (2) measuring of quantitative characteristics of a hybrid system by property-driven extraction of relevant data from its behaviors. We present the tools that support such analysis and discuss their application in several application domains.", "num_citations": "1\n", "authors": ["1650"]}
{"title": "Formal Modeling and Analysis of Timed Systems\n", "abstract": " This volume contains the papers presented at the 10th International Conference on Formal Modeling and Analysis of Timed Systems (FORMATS 2012), held on September 18–20, 2012 in London, UK.Timing aspects of systems from a variety of computer science domains have been treated independently by different communities. Researchers interested in semantics, verification, and performance analysis study models such as timed automata and timed Petri nets, the digital design community focuses on propagation and switching delays, while designers of embedded controllers have to take account of the time taken by controllers to compute their responses after sampling the environment.", "num_citations": "1\n", "authors": ["1650"]}