{"title": "Medical device standards' requirements for traceability during the software development lifecycle and implementation of a traceability assessment model\n", "abstract": " Developing safety critical software is a complex process. Due to the fact that medical device software failure can lead to catastrophic consequences, numerous standards have been developed which govern software development in the medical device domain. Risk management has an important role in medical device software development as it is important to ensure that safe software is developed. Demonstrating traceability of requirements right throughout the medical device software development and maintenance lifecycles is an important part of demonstrating that ‘safe’ software has been produced through adopting defined processes. Consequently, medical device standards and guidelines emphasise the need for traceability.This paper outlines the extent and diversity of traceability requirements within medical device standards and guidelines, and identifies the requirements for traceability through each …", "num_citations": "45\n", "authors": ["1362"]}
{"title": "The barriers to traceability and their potential solutions: Towards a reference framework\n", "abstract": " Traceability of software artifacts, from requirements to design and through implementation and quality assurance, has long been promoted by the research and expert practitioner communities. However, evidence indicates that, with the exception of those operating in the safety critical domain, few software companies choose to implement traceability processes, often due to associated cost and complexity issues. This paper presents a review of traceability literature including the implementation of traceability in real organizations. Through both analyzing case studies and research published by leading traceability researchers, this paper synthesizes the barriers faced by organizations while implementing traceability, along with proposed solutions to the barriers. Additionally, given the importance of traceability in the regulated domain of safety critical software, the paper compares the barriers for organizations …", "num_citations": "43\n", "authors": ["1362"]}
{"title": "A roadmap to ISO 14971 implementation\n", "abstract": " Medical device standards outline the requirements for developing medical devices. These standards, however, do not outline how these requirements should be implemented causing difficulties for organisations entering the medical device domain. The goal of this study is to validate a roadmap for the implementation of the ISO 14971 standard. The validation examined the arrangement of the milestones within the roadmap and grouping of the goals into milestones. Five experienced risk management personnel in the medical device domain were asked to complete an online questionnaire examining their opinion on the structure and content of the roadmap. Overall participants found the roadmap, in general, to be well structured and well organised and made some recommendations for improving the roadmap through merging of specific goals and rearrangement of the milestones within the roadmap. Copyright © …", "num_citations": "22\n", "authors": ["1362"]}
{"title": "Traceability-Why do it?\n", "abstract": " Traceability of software artifacts, from requirements to design and through implementation and quality assurance, has long been promoted by the research and expert practitioner communities. However, evidence indicates that, with the exception of those operating in the safety critical domain, few software companies choose to implement traceability processes, in the most part due to cost and complexity issues. This paper presents a review of traceability literature including the implementation of traceability in real organizations. Through both analyzing case studies and research published by leading traceability researchers, this paper synthesizes the motivations of the organizations for implementing traceability. Given the importance of traceability in the regulated domain of safety critical software, the paper compares the motivations and benefits for organizations operating inside and outside of this domain …", "num_citations": "13\n", "authors": ["1362"]}
{"title": "Creation of an IEC 62304 compliant software development plan\n", "abstract": " Organizations engaged in medical device software development are required to demonstrate compliance with a set of medical device standards and regulations before the device can be marketed. One such standard IEC 62304, Medical Device Software—Software Life Cycle Processes, defines the processes that are required in order to develop safe software. Demonstrating compliance with IEC 62304 can be problematic for organizations that are new to or have limited experience in the domain. The standard defines what processes must be carried out but does not state how. In a review of a number of such organizations, it was found that the development of a software development plan proved to be a difficult task. In this work we have created a software development plan template to assist organizations with this arduous task. The software development plan template will be validated with these organizations as …", "num_citations": "9\n", "authors": ["1362"]}
{"title": "Implementation of traceability best practices within the medical device domain\n", "abstract": " Requirements validation, compliance verification and impact analysis are important activities that are performed during the software development lifecycle. Traceability of requirements through the software development lifecycle (SDLC) is essential in the development of safety critical software. Organisations such as the Food and Drug Administration and the Federal Aviation Authority in the United States require traceability as part of their approval process. However, despite its criticality there is extensive digression in the practices and usefulness of traceability across development projects. Many projects’ traceability efforts are simply focused on satisfying regulations and do not leverage the many benefits of traceability. Traceability, if fully implemented is an important tool for managing system development and there are a number of published best practices to help companies with this implementation. By means of a literature review we record a list of the commonly accepted best practices for traceability im-plementation. Furthermore, through interviews with two medical device companies we report that a number of these practices are unfamiliar to these companies and why an even greater number of these practices are not applied.", "num_citations": "9\n", "authors": ["1362"]}
{"title": "The development and validation of a traceability assessment model\n", "abstract": " Regulation normally requires critical systems to be certified before entering service. This involves submission of a safety case - a reasoned argument and supporting evidence that stringent requirements have been met and that the system is acceptably safe. A good safety case encompasses an effective risk mitigation process which is highly dependent on requirements traceability. However despite its many benefits and regulatory requirements, most existing software systems lack explicit traceability links between artefacts. Reasons for the lack of traceability include cost, complexity and lack of guidance on how to implement traceability.To assist medical device organisations in addressing the lack of guidance on how to implement effective traceability, this paper aims to present the development and validation of a traceability process assessment model and the actions to be taken as a result of the validation …", "num_citations": "7\n", "authors": ["1362"]}
{"title": "Investigation of traceability within a medical device organization\n", "abstract": " Requirements traceability helps to ensure software quality. It supports quality assurance activities such as impact analysis, regression test selection, compliance verification and validation of requirements. Its implementation has long been promoted by the research and expert practitioner communities. However, evidence indicates that few software organizations choose to implement traceability processes, in the most part due to cost and complexity issues. Organizations operating within the safety critical domains are mandated to implement traceability, and find the implementation and maintenance of an efficient and compliant traceability process a difficult and complex issue. Through interviews with a medical device SME, this paper seeks to determine how traceability is implemented within the organization, the difficulties it faces in implementing traceability, how compliant it is with the medical device …", "num_citations": "7\n", "authors": ["1362"]}
{"title": "Mobile medical app development with a focus on traceability\n", "abstract": " Today, the growth of medical devices and mobile medical applications is increasing enormously, thanks to the efficiency and enhancement of new technology. When it comes to mobile medical apps, developers need to understand what is required when a mobile application fulfils the definition of a medical device. Such applications have to be developed in compliance with medical device regulations. This can be a challenge for mobile medical application developers, as medical device software is normally developed in a manner that will also ensure the production of regulatory documentation that is essential to market such devices. In this paper, we identify the need for a mobile medical application development framework, the key criteria for such a framework, and describe how the results were collected through performing a Medical Device Software Development workshop. Furthermore, we describe how …", "num_citations": "6\n", "authors": ["1362"]}
{"title": "A methodology for software process improvement roadmaps for regulated domains–example with IEC 62366\n", "abstract": " Software process improvement initiatives offer many benefits in terms of productivity, cost savings and quality. As part of these initiatives organisations undergo an assessment and then embark on a software process improvement program to improve their existing processes to meet a desired target. These programs can be improved by the use of process improvement roadmaps that are tailored to the organisation and are usually non-transferrable. Within regulated domains, such as the medical device industry, adherence to international standards must be achieved before products can be placed on the market. This work proposes the use of software process improvement roadmaps to assist organisations achieve compliance with medical device standards. These proposed roadmaps will be generic in nature to meet the requirements of the standard, but will be subsequently tailored to meet the specific …", "num_citations": "6\n", "authors": ["1362"]}
{"title": "Evaluation of an intelligent assistive technology for voice navigation of spreadsheets\n", "abstract": " An integral part of spreadsheet auditing is navigation. For sufferers of Repetitive Strain Injury who need to use voice recognition technology this navigation can be highly problematic. To counter this the authors have developed an intelligent voice navigation system, iVoice, which replicates common spreadsheet auditing behaviours through simple voice commands. This paper outlines the iVoice system and summarizes the results of a study to evaluate iVoice when compared to a leading voice recognition technology.", "num_citations": "6\n", "authors": ["1362"]}
{"title": "Research findings from an industrial trial of a traceability assessment and implementation framework\n", "abstract": " Software systems are becoming increasingly complex. Within safety critical domains such as medical device software, this increasing complexity is placing growing demands on manufacturers who must ensure their software not only meets functional requirements but is also safe and reliable. However, the Food and Drugs Administration who regulate medical device software in the United States report a significant increase in recalls between years 2003 and 2012 and have cited software difficulties as one of the frequent causes of recalls. Furthermore a recent analysis of traceability documentation submitted to the Administration has revealed that the traceability data was incomplete, incorrect, and conflicting in many cases. This is problematic as traceability plays an important role in the development of safe and reliable software. In this paper we present the validation, through industry trial, of a traceability …", "num_citations": "5\n", "authors": ["1362"]}
{"title": "The Development and Validation of a Roadmap for Traceability\n", "abstract": " Organisations who operate in the safety critical domains such as the medical device, avaition, and automotive domains must ensure their software is safe and provide objective evidence to this effect. One way of achieving this is by adhering to domain specific regulations and guidelines which specify a comprehensive implementation of traceability. However there is a gap between regulatory traceability requirements and what is implemented in practice. This lack of compliance means that organisations find it difficult to assess the safety of their software and thus ensure its safety. One reason for non-compliance with regards to traceability is a lack of guidance on what traceability to implement or how to implement it. In this paper we present the development and validation of a roadmap for the implementation of traceability in the medical device domain. The roadmap will provide medical device organisations …", "num_citations": "5\n", "authors": ["1362"]}
{"title": "Software process improvement and roadmapping–a roadmap for implementing IEC 62304 in organizations developing and maintaining medical device software\n", "abstract": " Organizations engaged in medical device software are required to demonstrate compliance with a set of medical device standards and regulations before the device can be marketed. One such standard IEC 62304, Medical device software – Software life cycle processes, is a standard that defines the processes that are required to be executed in order to develop safe software. Demonstrating compliance with IEC 62304 can be problematic for organizations that are new to or have limited experience in the domain. The standard defines what processes must be carried out, but does not state how. This paper presents a research method for generating a roadmap that will guide organizations in the implementation of IEC 62304.", "num_citations": "5\n", "authors": ["1362"]}
{"title": "A critical evaluation of a methodology for the generation of software process improvement roadmaps\n", "abstract": " For medical device organisations to market their devices in specific geographic regions they must adhere to the regulations of that region. These regulations often recommend that organisations adhere to specific standards and guidance documents which specify “what” must be achieved without specifying “how” this may be done. Due to changes to the medical device directive, which governs the development of medical devices within the EU, in March 2010, software can now in its own right be considered a medical device. This change has meant that a number of software organisations developing software for the medical device domain must now adhere to the same regulations as other medical device manufacturers. In this work we present a concept for a Software Process Improvement (SPI) roadmap to guide such organisations through the task of implementing medical device standards and guidance …", "num_citations": "3\n", "authors": ["1362"]}
{"title": "MeD UD–A process reference model for usability design in medical devices\n", "abstract": " A critical component to the success of software systems is the incorporation of the end user. Ensuring that the end user can use the system effectively and efficiently is an important consideration. Failure to do this can lead to user error which in turn can have serious or even fatal consequences. To address this issue in the medical domain, where the risk to patient and user safety is quite high, a number of standards and guidance documents promote the use of Human Factors and Usability Engineering techniques during the development of devices. In this paper we introduce MeD UD (Medical Device Usability Design) – A Process Reference Model (PRM) for evaluating usability engineering in the medical device domain. Through a process assessment utilising the MeD UD PRM, medical device organisations can improve their usability design processes to achieve more usable products, reduce the risks …", "num_citations": "3\n", "authors": ["1362"]}
{"title": "A roadmap to implement a quality management system\n", "abstract": " In recent years the proportion and complexity of software in medical devices has increased considerably. This has presented an opportunity for software development organisations to expand into the medical device domain. Due to the high level of risk associated with medical devices, strict regulations must be adhered to in order to market such products. One key aspect of these regulations is the necessity to have in place a Quality Management System to help ensure an organisations’ ability to consistently meet customer and regulatory requirements. This paper presents a roadmap which can be used to assist organisations, wishing to develop medical device software to implement a Quality Management System.", "num_citations": "3\n", "authors": ["1362"]}
{"title": "Impact of standards on the role and application of traceability in the medical device domain\n", "abstract": " Software failure in the medical device domain can lead to injury or death. Controlling this risk is fundamental to producing quality software. To produce quality software, an effective requirements and hazards traceability process is required. Hence traceability is central to medical device software de-velopment. It is also an essential requirement for regulatory approval. The ne-cessity for traceability is reinforced by the medical device standards and guide-lines. In this paper we outline how traceability is an important part of medical device software development, what standards contain reference to traceability, and which specific clauses within those standards companies should refer to when defining their traceability processes. We also summarise the findings ob-tained when a lightweight assessment method (Med-Trace), that we created, based upon the traceability practices within these standards, was implemented in two SME organizations.", "num_citations": "3\n", "authors": ["1362"]}
{"title": "Voice-controlled Debugging of Spreadsheets\n", "abstract": " Developments in Mobile Computing are putting pressure on the software industry to research new modes of interaction that do not rely on the traditional keyboard and mouse combination. Computer users suffering from Repetitive Strain Injury also seek an alternative to keyboard and mouse devices to reduce suffering in wrist and finger joints. Voice-control is an alternative approach to spreadsheet development and debugging that has been researched and used successfully in other domains. While voice-control technology for spreadsheets is available its effectiveness has not been investigated. This study is the first to compare the performance of a set of expert spreadsheet developers that debugged a spreadsheet using voice-control technology and another set that debugged the same spreadsheet using keyboard and mouse. The study showed that voice, despite its advantages, proved to be slower and less accurate. However, it also revealed ways in which the technology might be improved to redress this imbalance.", "num_citations": "3\n", "authors": ["1362"]}
{"title": "Software process improvement roadmaps–using design patterns to aid SME’s developing medical device software in the implementation of IEC 62304\n", "abstract": " One stated objective of the European Union is to encourage SME’s expand their area of operation into other domains. The medical device domain is one such domain identified by the EU. Medical device software development must be carried out in a manner that compliance with certain medical device standards and regulations can be demonstrated. IEC 62304, Medical device software - software life cycle processes, is a standard that defines the processes that are required to be executed in order to develop safe software. SME software development organizations wishing to expand their operations into the medical device software development domain face serious challenges in demonstrating compliance with IEC 62304. The standard describes the set of processes, activities, and tasks that are required to be carried out, but importantly do not describe how they should be carried out. This paper describes …", "num_citations": "2\n", "authors": ["1362"]}
{"title": "Understanding the relationships within the Medi SPICE framework\n", "abstract": " Regulated domains, such as medical device software development, require organisations to have specific processes in place in order to secure regulatory approval. Software process improvement initiatives, such as Medi SPICE, help organisations to improve their process in conformance with these regulations. These initiatives, however, do not specify how an organisation implements these processes, instead detailing what the organisation must implement. This work proposes the development of a series of roadmaps that will guide an organisation through the implementation of the required processes in a regulatory compliant manner. This paper presents the first step towards achieving this aim, which involves an investigation of the dependencies between the base practices defined in Medi SPICE in order to ensure that the produced roadmaps form a complete software development process in line with regulatory requirements. The paper describes two complementary approaches, a structured representation and a graphical representation, to representing the links between practices in the Medi SPICE framework.", "num_citations": "2\n", "authors": ["1362"]}
{"title": "NLP-SIR: A Natural Language Approach for Spreadsheet Information Retrieval\n", "abstract": " Spreadsheets are a ubiquitous software tool, used for a wide variety of tasks such as financial modelling, statistical analysis and inventory management. Extracting meaningful information from such data can be a difficult task, especially for novice users unfamiliar with the advanced data processing features of many spreadsheet applications. We believe that through the use of Natural Language Processing (NLP) techniques this task can be made considerably easier. This paper introduces NLP-SIR, a Natural language interface for spreadsheet information retrieval. The results of a recent evaluation which compared NLP-SIR with existing Information retrieval tools are also outlined. This evaluation has shown that NLP-SIR is a more effective method of spreadsheet information retrieval.", "num_citations": "2\n", "authors": ["1362"]}
{"title": "Limited By\n", "abstract": " rian.ie - Browse - Results Institutions | About Us | Help | Gaeilge rian logo Home Browse Advanced Search Search History Marked List Statistics A A A Author(s) Institution Publication types Funder Year Limited By: Institution = Dundalk Institute of Technology ; 359 items found Sort by Order per page First Page Previous Page 1 2 3 4 5 6 7 8 9 10 Next Page Last Page RSS Export Displaying Results 26 - 50 of 359 on page 2 of 15 Mark A Risk Management Capability Model for use in Medical Device Companies (2006) Burton, John; McCaffery, Fergal; Richardson, Ita Dundalk Institute of Technology Conference item peer-reviewed Mark A roadmap to ISO 14971 implementation (2015) Rust, Peter; McCaffery, Fergal; Casey, Valentine; McKeever, Ruth; Flood, Derek Dundalk Institute of Technology Journal article peer-reviewed Mark A Security Argument Pattern for Medical Device Assurance Cases (2014) Finnegan, Anita; …", "num_citations": "2\n", "authors": ["1362"]}
{"title": "A Software Process Improvement Roadmap for IEC 62304: an Expert Review\n", "abstract": " Manufacturers of medical devices must comply with certain legislation and regulations before they can market their products in the European Union (EU). The EU has introduced this legislation and regulation to provide the frameworks by which manufacturers can produce safe and effective medical devices in a consistent manner. The EU has accomplished this by way of Medical Device Directives and harmonised standards. Manufactures, by demonstrating compliance with a harmonised standard, can be presumed to have complied with the essential requirements of the legislation. IEC 62304 Medical device software – Software lifecycle processes is a harmonised standard. However, the standard provides no clear directions for meeting the requirements of the standard. A Software Process Improvement (SPI) Roadmap for IEC 62304:2006 has been developed as a method for aiding medical device …", "num_citations": "1\n", "authors": ["1362"]}
{"title": "Spreadsheet information retrieval through natural language\n", "abstract": " The versatility of spreadsheet applications have enabled them to be used for a wide variety of tasks, from inventory management to financial modeling. When they are used for inventory management, extracting additional information can be a difficult task, especially for novice spreadsheet users. Typically, novice users have little experience of using the advanced data processing tools that are available in most spreadsheet applications. To address this issue, the authors propose the use of Natural Language Processing (NLP) techniques to enable such users to perform these tasks. A recent evaluation of NLP-SIR (Natural Language Processing for Spreadsheet Information Retrieval) has shown that natural language can be more effective than conventional data processing tools.", "num_citations": "1\n", "authors": ["1362"]}
{"title": "Intelligent voice navigation of spreadsheets\n", "abstract": " Interaction with software systems has become second nature to most computer users, however when voice recognition is introduced, this simple procedure becomes quite complex. To reduce this complexity for spreadsheet users, the authors have developed an intelligent voice navigation system called iVoice. This paper outlines the iVoice system and details an experiment that was conducted to determine the efficiency of iVoice when compared to a leading voice recognition technology.", "num_citations": "1\n", "authors": ["1362"]}