{"title": "Understanding sustained participation in open source software projects\n", "abstract": " Prior research into open source software (OSS) developer participation has emphasized individuals' motivations for joining these volunteer communities, but it has failed to explain why people stay or leave in the long run. Building upon Lave and Wenger's theory of legitimate peripheral participation (LPP), this paper offers a longitudinal investigation of one OSS community in which sustained participation is hypothesized to be associated with the coevolution of two major elements of LPP theory: \"situated learning\" (the process of acting knowledgeably and purposefully in the world) and \"identity construction\" (the process of being identified within the community). To test this hypothesis, data were collected from multiple sources, including online public project documents, electronic mail messages, tracker messages, and log files. Results from qualitative analyses revealed that initial conditions to participate did not …", "num_citations": "443\n", "authors": ["903"]}
{"title": "Examining the relationship of leadership and physical distance with business unit performance\n", "abstract": " Measures of transformational and transactional contingent reward leadership and physical distance were used to predict the business unit performance of 101 managers. Results revealed that transformational leadership positively predicted unit performance, while contingent reward leadership was not related to performance. Physical distance between leaders and followers negatively moderated the relationship between transformational leadership and unit performance, and positively moderated the relationship between contingent reward leadership and performance. Implications for future work on leadership at a distance are discussed.", "num_citations": "299\n", "authors": ["903"]}
{"title": "Charismatic leadership and user acceptance of information technology\n", "abstract": " Although there is widespread agreement that leadership has important effects on information technology (IT) acceptance and use, relatively little empirical research to date has explored this phenomenon in detail. This paper integrates the unified theory of acceptance and use of technology (UTAUT) with charismatic leadership theory, and examines the role of project champions influencing user adoption. PLS analysis of survey data collected from 209 employees in seven organizations that had engaged in a large-scale IT implementation revealed that project champion charisma was positively associated with increased performance expectancy, effort expectancy, social influence and facilitating condition perceptions of users. Theoretical and managerial implications are discussed, and suggestions for future research in this area are provided.", "num_citations": "289\n", "authors": ["903"]}
{"title": "Top management support of enterprise systems implementations\n", "abstract": " Despite the general consensus regarding the critical role of top management in the information systems (ISs) implementation process, the literature has not yet provided a clear and compelling understanding of the top management support (TMS) concept. Applying metastructuring (Orlikowski et al., 1995) as a guiding framework for understanding TMS behaviors, this paper attempts to address the gap by focusing on two key questions: (1) What supportive actions do top managers engage in during IS implementations? (2) How do these actions affect IS implementation outcomes? Analyses of in-depth case studies at two Canadian universities that had implemented a large-scale enterprise system revealed three distinct types of TMS actions: TMS - resource provision (TMSR - actions related to supplying key resources such as funds, technologies, staff, and user training programs); TMS - change management (TMSC …", "num_citations": "256\n", "authors": ["903"]}
{"title": "Remote leadership, communication effectiveness and leader performance\n", "abstract": " As remote work arrangements have gained in popularity, workforce dispersion has become increasingly widespread. Little research to date has examined how physical distance influences leader–follower communication effectiveness or leader performance. Building on top of transformational leadership theory, this paper explores how perceived leader performance is influenced by leadership style, physical distance, and communication effectiveness between leaders and followers. A survey of 138 followers, reporting to a total of 41 leaders, was conducted and data were analyzed at the individual follower-level using the Partial Least Squares (PLS) technique. Our model explained 45% of the variance in communication effectiveness and 67% of the variance in perceived leader performance. Consistent with past empirical findings, transformational leadership was associated more strongly with perceived …", "num_citations": "219\n", "authors": ["903"]}
{"title": "Telework and the balance between work and family: Is telework part of the problem or part of the solution?\n", "abstract": " Telework and the balance between work and family | The virtual workplace ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksThe virtual workplaceTelework and the balance between work and family: is telework part of the problem or part of the solution? chapter Telework and the balance between work and family: is telework part of the problem or part of the solution? Share on Authors: Linda Elizabeth Duxbury profile image Linda Duxbury View Profile , Christopher Alan Higgins profile image Christopher Higgins View Profile , Derrick J Neufeld profile image Derrick Neufeld View Profile Authors Info & Affiliations Publication: The …", "num_citations": "188\n", "authors": ["903"]}
{"title": "An empirical evaluation of the impacts of telecommuting on intra-organizational communication\n", "abstract": " This study represents a preliminary step towards developing an understanding of how telework arrangements affect intra-organizational communication. The following general research questions are addressed: (1) Do telework arrangements change the way in which teleworkers communicate with their superiors, their subordinates, their colleagues and their clients?; and (2) Do telework arrangements change the way in which managers communicate with subordinates who telework? The study, which was conducted at two Canadian federal government departments, was designed to collect information from four groups: (1) teleworkers (n=36 at Time 2); (2) managers of teleworkers (n=28 at Time 2); (3) co-workers of teleworkers (n=27 at Time 2); and (4) a control group (n=25 at Time 2). Three data collection techniques were used in this study: paper and pencil questionnaires, telephone interviews, and focus group …", "num_citations": "186\n", "authors": ["903"]}
{"title": "The Role of Information Technology in Technology-Mediated Learning: A Review of the Past for the Future\n", "abstract": " Technology-mediated learning refers to an environment in which the learner’s interactions with learning materials, peers, and/or instructors are mediated through information technologies (Alavi and Leidner, 2001). The objective of this paper is to review current research on technology-mediated learning on the basis of a theoretical framework derived from the existing literature. In the theoretical framework, three groups of determinants (human dimension, design dimension, and information technology) are presented that influence students’ psychological learning process, which eventually lead to different learning outcomes. The literature review shows that some of the relationships between information technology and other dimensions have been heavily examined (eg, the influence of a technology feature on learning outcomes), while some others have been ignored (eg, the influence of IT on student’s …", "num_citations": "137\n", "authors": ["903"]}
{"title": "Individual, social and situational determinants of telecommuter productivity\n", "abstract": " Productivity of remote workers is of critical concern to organizations and managers contemplating telecommuting arrangements. Here we suggest a general theoretical framework for understanding telecommuter productivity, and then report on a two-phased research study. In the first phase, semi-structured interviews with 32 telecommuters were conducted in one organization, and individual, social, and situational factors associated with telecommuter productivity were qualitatively explored. The second phase involved a survey of 100 telecommuters in two organizations, followed by predictive discriminant analyses to identify factors that might usefully distinguish between telecommuters exhibiting low and high levels of productivity. Results indicate that telecommuter beliefs and attitudes, and the quality of their social interactions with managers and family members, were strongly associated with productivity …", "num_citations": "134\n", "authors": ["903"]}
{"title": "Between Work and Family: Is Telework Part of the Problem\n", "abstract": " This study represents a preliminary step touvards developing an under-standing of hou teleuvork arrangements affect uork-family conflict. The follouving tuo general research questions are addressed:(1) Hou do teleuork arrangements affect an employee's ability to balance uvork and family de-mands?, and (2) What do employees perceive to be the uvork and non-uvork related advantages of teleuork arrangements? The study, uhich uvas conducted in three Canadian organizations, uas designed to collect information from four groups:(1) teleuvorkers (n= 54);(2) managers of teleuorkers (n= 26);(3) co-uvorkers of teleuvorkers (n= 22); and,(4) a control group (n= 36). Tuo data collection techniques uere used in this study: paper and pencil questionnaires and telephone interUieus. Data uere collected at tuo points in time:(1) tuo uveeks prior to the start of the teleuvork pilot, and (2) six months after the start of the …", "num_citations": "125\n", "authors": ["903"]}
{"title": "Isobord's Geographic Information System Solution\n", "abstract": " This chapter presents a case study of Isobord1, a Canadian manufacturer of high quality particleboard that uses straw instead of wood as the main raw material input. Isobord is facing critical operational problems that threaten its future. Gary Schmeichel, a biotechnology consultant hired by Isobord, must recommend how much straw collection equipment to purchase and what kind of information technology to acquire to help manage equipment dispatch operations. Schmeichel is exploring how geographic information systems (GIS) and relational database management systems (RDBMS) might help manage operations, but budget and time constraints and organizational inexperience seriously threaten these efforts. Decisions must be made immediately if there is to be any hope of implementing a system to manage the first year’s straw harvest. Readers are challenged to put themselves in Schmeichel’s shoes and …", "num_citations": "105\n", "authors": ["903"]}
{"title": "Testing Klein and Sorra’s innovation implementation model: an empirical examination\n", "abstract": " Despite a substantial volume of research activities on innovation implementation [Holahan, P.J., Aronson, Z.H., Jurkat, M.P., Schoorman, F.D., 2004. Implementing computer technology: a multiorganizational test of Klein and Sorra’s model. Journal of Engineering and Technology Management 21 (1), 31–50; Klein, K.J., Sorra, J.S., 1996. The challenge of innovation implementation. Academy of Management Review 21 (4), 1055–1080; Kwon, T.H., Zmud, R.W., 1987. Unifying the fragmented models of information systems implementation. In: Hirschheim, B.R. (Ed.), Critical Issues in Information Systems Research. John Wiley and Sons Ltd., New York, pp. 227–252], implementation outcomes continue to disappoint—particularly those related to large-scale information systems (ISs) implementation projects [Aiman-Smith, L., Green, S.G., 2002. Implementing new manufacturing technology: the related effects of technology …", "num_citations": "83\n", "authors": ["903"]}
{"title": "Intuition, risk, and the formation of online trust\n", "abstract": " Understanding how consumers evaluate website trustworthiness is a critical factor for online vendors. The dominant view espouses a deliberative trust formation process whereby shoppers evaluate security certificates, return policies, user feedback and the like, implying a highly rational underlying trust calculus. In this paper we use a laboratory experiment to explore an alternative perspective, based on the non-rational associative reasoning approach. Our findings show that when faced with a no-risk hypothetical decision about whether or not they would purchase a book from an online bookseller, subjects’ decision-making processes were indeed consistent with the dominant deliberative view. However, when confronted with a decision entailing risk (i.e., sharing sensitive personal information with an unknown website), subjects became reliant on their non-rational, gut-level intuition. We adopt a dual-process …", "num_citations": "60\n", "authors": ["903"]}
{"title": "The IS identity crisis\n", "abstract": " Defining the central identity of the information systems (IS) field is a subject of ongoing concern and debate among IS researchers. Published empirical studies to date have focused on restricted sets of IS-related journal publications spread across relatively short time periods. This paper offers a broader review of the central identity of the IS field, using three dimensions proposed by Albert and Whetten [1985]: central character (ie, what topics do IS scholars research?); temporal continuity (ie, to what extent has the identity of the IS field remained static over time?); and distinctiveness (ie, how unique is research published in IS vs. non-IS research journals?). The first two dimensions are examined using a dataset containing 6,466 journal citations drawn from seven leading IS journals over a 32-year period, and the third is evaluated by comparing results from these seven journals with research published in 15 leading …", "num_citations": "53\n", "authors": ["903"]}
{"title": "Collaborative team learning in information systems: A pedagogy for developing team skills and high performance\n", "abstract": " Business schools must learn how to deliver graduates who are capable team players, particularly in the field of information systems where IS personnel are frequently cited as lacking in interpersonal and teams skills, and where information technology work is increasingly structured around team-based projects. We report here on the effectiveness of a collaborative pedagogical approach called team learning, which was used in a database management systems course. The team learning methodology requires students and their teammates to bear sole responsibility for learning in teams, with the professor acting as a “Guide on the Side” (16). Using an experimental design, this study demonstrates that teams consistently outperformed individuals, which critical team skills improved over time, and that important team skills were positively associated with team performance.", "num_citations": "38\n", "authors": ["903"]}
{"title": "Community of practice behaviors and individual learning outcomes\n", "abstract": " The community of practice (CoP) concept has grown in popularity, yet remains under-studied. In particular, we have not developed a sufficient understanding of the individual outcomes associated with CoP engagement. This paper offers a fresh research model that identifies three practice-based concepts described in the CoP literature—shared repertoire, joint enterprise, and mutual engagement—and links them to individual learning outcomes. Survey measures are developed using a card sorting procedure, a research model is pilot tested using survey data collected from 53 graduate students in a large Canadian university, and then the model is field-tested using interview and survey data collected from 59 employees in a non-profit organization. The paper offers a new set of distinct CoP measures, and examines how they are associated with learning. A discussion of practical implications and future …", "num_citations": "31\n", "authors": ["903"]}
{"title": "The iceberg on the sea: what do you see?\n", "abstract": " Although organizations began to adopt enterprise systems (ES) in the 1980s (Hayman, 2000), academic interests have just started. This literature review of ES articles appearing in academic information systems (IS) journals indicates that while previous ES studies have provided some interesting findings, only limited aspects of enterprise systems have been explored. We have essentially focused on the iceberg above the sea, ignoring what is going on under the water. This paper contributes to the ES research by identifying strengths and weaknesses of ES research to date, and suggesting future research opportunities.", "num_citations": "29\n", "authors": ["903"]}
{"title": "Should I stay or should I go? Worker commitment to virtual organizations\n", "abstract": " As society enters the twenty-first century there is a growing realization that information technology (IT) is heavily influencing organizational structures [1]. One such structure is the virtual organization, in which individuals rely on IT to mediate traditional geographical and temporal boundaries of the firm. The result is a \"company without walls\" that operates as a virtual \"collaborative network of people,\" independent of location or affiliation [2]. This paper is concerned with exploring how this IT-enabled shift influences worker commitment, a critical factor identified in the organizational behavior literature. Using Wenger’s practice-based learning perspective and theory of legitimate peripheral participation (LPP), we conducted a longitudinal, qualitative analysis of commitment in one open-source software (OSS) project. Results indicate that commitment was strongly associated with engagement in LPP processes …", "num_citations": "18\n", "authors": ["903"]}
{"title": "Development success in open source software projects: exploring the impact of copylefted licenses\n", "abstract": " Copyleft prevents the source code of open source software (OSS) from being privately appropriated. The ethos of the OSS movement suggests that volunteer developers may particularly value and contribute to copylefted projects. Based on social movement theory, we hypothesized that copylefted OSS projects are more likely than non-copylefted OSS projects to succeed in the development process, in terms of two key indicators: developer membership and developer productivity. We performed an exploratory study using data from 62 relevant OSS projects spanning an average of three years of development time. We found that copylefted projects were associated with higher developer membership and productivity. This is the first study to empirically test the relationship between copylefted licenses and OSS project success. Implications for OSS project initiators as well as future research directions are discussed.", "num_citations": "18\n", "authors": ["903"]}
{"title": "Understanding cybercrime\n", "abstract": " Existing cybercrime research in the information systems (IS) field has focused on a subset of corporate incidents (e.g., fraud, hacking intrusions), and emphasized solutions designed to repel attacks or to minimize their aftermath (e.g., barrier technologies, enhanced security procedures). This focused, defensive, and pragmatic posture is valuable and necessary as an immediate triage response, to \"stop the bleeding\" and provide protection from imminent harm. However, the extant work has not painted a sufficiently broad picture of the scope of cybercriminal activity, nor paid adequate attention to its root causes. This paper presents a different view. It analyzes 113 U.S. Department of Justice federal cybercrime cases from 2008 and 2009, categorizes these cases using an applied criminal offense framework developed by the FBI, considers philosophical explanations for criminal motives, and then identifies the apparent …", "num_citations": "16\n", "authors": ["903"]}
{"title": "Communicating virtually in a global organization\n", "abstract": " Purpose                – The purpose of this paper is to consider the extent to which changes in communication media are associated with changes in the nature of manager-expatriate employee communications. Using an affordance lens, the authors explore how hierarchical level and communication medium interact to influence status dynamics manifested in communication attributes.                                        Design/methodology/approach                – The hypothesis was tested with a 2 (hierarchical level)×3 (communication media) multivariate analysis of covariance (experience level) in a sample of 1,193 messages that were transmitted between managers and field employees in a global organization over a ten year period.                                        Findings                – The authors found significant interaction effects between communication media and hierarchical level on communication attributes such that changes …", "num_citations": "14\n", "authors": ["903"]}
{"title": "The Pendulum Swings Back-Individual Acceptance of Re-centralized Applicatio...\n", "abstract": " I um After two decades of actively distributing computing'power to individual users in the form of desktop and notebook PCs, IT executives are now being drawn back to the beneﬁts of centralized computing", "num_citations": "13\n", "authors": ["903"]}
{"title": "An exploratory longitudinal analysis of GSS use in the case method classroom\n", "abstract": " This exploratory study reports on term-long use of a discussion-based GSS by 137 undergraduate business students in a case-based core MIS course. We develop a model of student participation in case-based learning environments and examine the role and impact of technology on participation. Overall participation increased dramatically as students became more comfortable and adept with the technology. The GSS appeared to provide marginalized students with a “voice” in the classroom, and allowed prolific participators an additional outlet. However, we observed some potentially negative consequences, such as a decline in the proportion of messages containing novel ideas, examples, information requests, and references, and some students expressed difficulty with multitasking – simultaneously typing and listening. As a result, we advocate further exploration of this technology in the classroom and …", "num_citations": "13\n", "authors": ["903"]}
{"title": "Predicting telecommuter productivity\n", "abstract": " Productivity of remote workers is of critical concern to organizations contemplating telecommuting work arrangements. This paper suggests a general theoretical framework for understanding telecommuter productivity. Based on semi-structured interviews with 32 telecommuters, we found that telecommuting productivity was positively associated with beliefs and attitudes, social factors, and situational factors, and unassociated with individual factors. Implications and future research directions are discussed.", "num_citations": "11\n", "authors": ["903"]}
{"title": "Individual consequences of telecommuting.\n", "abstract": " Degree: Ph. D.DegreeYear: 1997Institute: The University of Western Ontario (Canada)Adviser: Chris Higgins.Interest in telecommuting has been steadily growing in recent years. The literature suggests that benefits and drawbacks exist for employees, organizations and societies. While anecdotes describing these positive and negative impacts abound, very little controlled research has been undertaken to conclusively assess the effects or effectiveness of this technology-reliant work arrangement. Furthermore, almost no attempt has been made to link these telecommuting impacts to extant theory. As a result, our understanding as to why such effects occur has remained quite limited. To apply telecommuting effectively, further knowledge about its effects must be developed.", "num_citations": "10\n", "authors": ["903"]}
{"title": "Learning information systems with cases\n", "abstract": " One of the most effective pedagogical tools available is the case method of study. This approach affords students the opportunity to apply their managerial knowledge and personal experience to specific, and often messy, real-world problems. The case method is particularly effective for senior undergraduate and graduate students who have previously been exposed to a wide array of managerial tools and techniques, or have gained invaluable first-hand management experience.Many students initially experience some difficulty when approaching a case analysis. The purpose of this document is to introduce you to learning with cases. It discusses background issues regarding business cases and the case method, the typical anatomy of a business case, and an accepted method for structuring a case analysis.", "num_citations": "9\n", "authors": ["903"]}
{"title": "Individual learning and performance in communities of practice\n", "abstract": " This study examines the relationships among individuals' involvement in communities of practice (CoPs), learning, and job performance. Drawing on the CoP and learning literatures, we develop a theoretical model exploring how individuals' involvement in CoPs affects their learning and job performance. The model is tested using survey data collected from graduate students in a large Canadian university. Results support the hypothesis that CoP involvement is related to learning, and reveals a complex relationship between learning and job performance.", "num_citations": "6\n", "authors": ["903"]}
{"title": "An exploratory study of electronic mail as a rich communication medium in a global virtual organization\n", "abstract": " The paper explores how intra-organizational communication in a global virtual organization was impacted as the dominant communication mode, evolved from postal messages to facsimile to electronic mail, over a ten year period. Drawing on theories of communication media, we have proposed that changes in organizational communication mode will affect the nature and outcomes of organizational communication in terms of message frequency, message length, message cycle time, participation rate, idea generation, information gathering, social orientation, and decision-making speed. To test these propositions, we analyzed a dataset containing 907 written documents (187 regular post, 407 fax, and 312 email), collected from the archives of a global organization between 1989 and 1999. Results show support for email as a rich communication medium compared with other written media, particularly in terms of …", "num_citations": "6\n", "authors": ["903"]}
{"title": "A longitudinal analysis of GSS use in the case method classroom\n", "abstract": " The article reports on term-long use of a discussion-based GSS (group support systems) by 137 undergraduate business students in a case-based core MIS course. We develop a model of student participation in case-based learning environments and examine the role and impact of technology on participation. Overall, participation increased significantly as students became more comfortable and adept with the technology. The GSS appeared to provide marginalized students with a 'voice' in the classroom, and allowed prolific participators an additional outlet. However, there were some negative consequences, as some students had difficulty with multitasking, i.e., typing and listening. We also found that the novelty of ideas was consistently low once a strong idea had been submitted. As a result, we advocate adoption of this technology, but suggest that its use be more structured, dividing class time into \"technology …", "num_citations": "5\n", "authors": ["903"]}
{"title": "How Customers Decide Whether to Buy from Your Website\n", "abstract": " Sally’s finger hovered over the “Purchase” button. After hours of online sleuthing, she was pretty sure the green chair would complete her living room. It was the style and color she wanted, home delivery was guaranteed within three days, she had money in the bank to pay for it, and both the", "num_citations": "4\n", "authors": ["903"]}
{"title": "An investigation of information systems topic coverage in IS versus functional area business journals\n", "abstract": " The purpose of this study is to explore the extent to which IS topics have been published in non-IS business journals (ie, Accounting, Marketing, Operations, and Organizational Behavior), and to assess whether the IS research in these disciplines lags or leads the comparable coverage in the IS journals. Over 500,000 citations and abstracts have been collected from on-line sources and stored in a database, and analyses are underway.", "num_citations": "3\n", "authors": ["903"]}
{"title": "Media Naturalness and the Ability to Predict Generosity in a Give-Some–Get-Some Interaction\n", "abstract": " Evolutionary psychologists believe the human mind evolved to solve adaptive problems present in our ancestral environment. Our hominid ancestors survived in face-to-face groups by assessing the cooperative intentions of other group members. Media naturalness theory postulates face-to-face is the most ‘natural’communication medium. This paper reports results from a laboratory experiment examining the ability of student subjects to predict the generosity of a counter-party under two media conditions: Face-to-Face (FtF), the more natural condition; and Video-to-Video (VtV), the less natural, technology-mediated condition. After a five-minute interaction, subjects took part in a givesome–get-some exchange and then predicted the generosity of their counterparty. Consistent with media naturalness theory, FtF subjects predicted generosity at a frequency greater than chance. Surprisingly, generosity predictions for the VtV condition were not significantly different from chance. Generosity prediction relates to important organizational behaviors such as cooperativeness, trust, and teamwork. Implications and future research opportunities are discussed.", "num_citations": "2\n", "authors": ["903"]}
{"title": "Modeling top management influence on information technology implementation effectiveness\n", "abstract": " Top management influence has long been considered a critical factor for successful information technology (IT) implementation. However, IT implementation studies rarely seek to find theoretical foundations for top management influence. To bridge this gap, this article intends to study the impacts of top management on IT implementation effectiveness by applying transformational leadership theory to IT implementation research. By applying leadership research to Klein and Sorra's (1996) implementation model, this paper contributes to the theoretical development of both leadership research and IT implementation studies and establishes a stepping stone for further studies on top management influence on IT implementation effectiveness.", "num_citations": "2\n", "authors": ["903"]}
{"title": "Collaborative Team Learning in Information Systems: a pedagogy for developing team skills\n", "abstract": " Networks of teams rather than hierarchies of individuals are increasingly viewed as the appropriate organizational structure for coping with the turbulent environment facing most organizations today. Consequently, it is important that the educational system deliver individuals who are capable team players. This is doubly important in the field of information systems, where IT personnel are frequently cited as lacking in interpersonal and teams skills, and where IT work is increasingly structured around team based projects. In this exploratory study, a team learning pedagogy was utilized in the delivery of a database management systems course. This collaborative teaching methodology required students to bear sole responsibility for learning in teams, with the Professor acting as a “guide on the side”(Michaelsen, et al., 1993). Results indicate that this teaching methodology is effective in developing important team skills …", "num_citations": "2\n", "authors": ["903"]}
{"title": "Knowledge coordination via digital artefacts in highly dispersed teams\n", "abstract": " Virtual teams face the unique challenge of coordinating their knowledge work across time, space, and people. Information technologies, and digital artefacts in particular, are essential to supporting coordination in highly dispersed teams, yet the extant literature is limited in explaining how such teams produce and reproduce digital artefacts for coordination. This paper describes a qualitative case study that examined the day‐to‐day practices of two highly dispersed virtual teams, with the initial conceptual lens informed by Carlile's (2004) knowledge management framework. Our observations suggest that knowledge coordination in these highly dispersed virtual teams involves the continuous production and reproduction of digital artefacts (which we refer to as technology practices) through three paired modes: ‘presenting‐accessing’ (related to knowledge transfer); ‘representing‐adding’ (related to knowledge …", "num_citations": "1\n", "authors": ["903"]}
{"title": "The IT Artifact and Telecommuting\n", "abstract": " Research on the concept of telecommuting or telework, as it is known in various areas of the world, has appeared in information systems (IS) and non-IS publications for more than 20 years. Research areas with respect to telecommuting are quite varied, from Information and Communication Technologies (ICT) use, to transportation, managerial control, work-life issues, and more. A significant number of these studies have taken into account the role of technology in enabling telecommuting. However, recent awareness of the IT artifact issue [1] has raised concerns for some authors, reviewers, and editors as to when the technology component is significant enough to consider some of the telecommuting research as IS research. Others, meanwhile, believe that by definition telecommuting addresses the IT artifact issue, and that this should not be a concern. In this panel, we explore the question of whether the …", "num_citations": "1\n", "authors": ["903"]}
{"title": "Employee knowledge sharing in highly dispersed organizations\n", "abstract": " Advances in information and communication technology have enabled contemporary organizations to become increasingly dispersed. Knowledge sharing among highly dispersed employees has been widely regarded as an organizational challenge that, if not dealt with properly, would affect the organization’s competitive advantage. Based on the practice perspective of knowledge, this study aims to explore factors and mechanisms that facilitate or impede knowledge sharing among highly dispersed organizational employees. In this paper we analyze data collected from semi-structured interviews with twenty employees in a highly dispersed organization, to understand how employees share knowledge through their work practice in order to get work done. The methodology and data analysis plan is also described.", "num_citations": "1\n", "authors": ["903"]}