{"title": "Guidelines for Conducting Critical Realist Case Study Research in Information Systems\n", "abstract": " Critical realism is emerging as a viable philosophical paradigm for conducting social science research, and has been proposed as an alternative to the more prevalent paradigms of positivism and interpretivism. Few papers, however, have offered clear guidance for applying this philosophy to actual research methodologies. Under critical realism, a causal explanation for a given phenomenon is inferred by explicitly identifying the means by which structural entities and contextual conditions interact to generate a given set of events. Consistent with this view of causality, we propose a set of methodological principles for conducting and evaluating critical realism-based explanatory case study research within the information systems field. The principles are derived directly from the ontological and epistemological assumptions of critical realism. We demonstrate the utility of each of the principles through examples drawn …", "num_citations": "726\n", "authors": ["910"]}
{"title": "The penguin’s window: Corporate brands from an open-source perspective\n", "abstract": " The open source (OS) movement allows us to re-vision corporate branding from a corporate to a coproducer perspective. Corporations own their brands and unilaterally determine their positioning and evolution. Power and control are centralized and hierarchical: producers produce brands, which customers then consume. With OS, power and control are radically decentralized and heterarchical: producers and consumers coalesce into “prosumers.” The authors introduce marketers to the OS phenomenon and develop a typology of brand aspects that can be “open” or “closed”: physical, textual, meaning, and experience. The authors elaborate new dimensions for brands and revisit the functions that brands perform and link these to the evolutionary trajectory of branding, arguing that OS represents a final phase in the evolution of corporate brands from closed to open brands. The article concludes with a research …", "num_citations": "353\n", "authors": ["910"]}
{"title": "Enterprise architecture, IT effectiveness and the mediating role of IT alignment in US hospitals\n", "abstract": " Despite the possible benefits of implementing healthcare information technologies, successful implementation of effective healthcare information technology is constrained by cultural and regulatory concerns and technical obstacles encountered when establishing or upgrading an organisation's enterprise infrastructure. In this paper, we advance Ross' four‐stage model of enterprise architecture maturity as a valuable IT resource for helping healthcare organisations sustain a competitive advantage. We use partial least squares (PLS) structural equation modelling to analyse survey data from 164 US hospitals at different stages of EA maturity. Our results provide evidence that enterprise architecture maturity directly influences the effectiveness of hospitals' IT resources for achieving strategic goals. Further, enterprise architecture maturity indirectly influences the effectiveness of IT resources when IT alignment is …", "num_citations": "243\n", "authors": ["910"]}
{"title": "The business of open source\n", "abstract": " Tracking the changing competitive conditions of the software industry.", "num_citations": "164\n", "authors": ["910"]}
{"title": "Organizational structure of open source projects: A life cycle approach\n", "abstract": " The structure of open source project communities is discussed in relation to the organizational life cycle. In lieu of sales figures, the download counts for each project are used to identify the life cycle stage of a random sample of open source projects. A research model is proposed that attempts to measure the fit between the life cycle stage and the specific organizational characteristics of these projects (focus, division of labor, role of the leader, level of commitment, and coordination/control) as an indicator of the success of a project as measured by the satisfaction and involvement of both developers and users.", "num_citations": "59\n", "authors": ["910"]}
{"title": "Governance and global communities\n", "abstract": " Communities are a new form of organization in which volunteers primarily contribute to the creation of economic value. Building upon transaction cost economics, communities are investigated as a fourth form of governance structure. The concept of transaction benefits is introduced to the governance structure equation and some key variables (individual characteristics and needs, information technology, and national culture and policy) influencing transaction benefits are identified. Within communities, four major forms (restrictive, diffusive, inventive and adaptive) are identified based upon dimensions of responsiveness and transaction benefits. We conclude with a discussion of the relationship between communities and other governance structures.", "num_citations": "58\n", "authors": ["910"]}
{"title": "A research agenda for studying open source I: A multi-level framework\n", "abstract": " This paper presents a research agenda for studying information systems using open source software A multi-level research model is developed at five discrete levels of analysis:(1) the artifact;(2) the individual;(3) the team, project, and community;(4) the organization; and (5) society. Each level is discussed in terms of key issues within the level. Examples are based on prior research. In a companion paper,[Niederman, et al 2006], we view the agenda through the lens of referent discipline theories.", "num_citations": "55\n", "authors": ["910"]}
{"title": "Opening the classroom.\n", "abstract": " We argue that information systems educators—and others in similarly dynamic professional disciplines—could benefit from an alternative infrastructure for learning. We present an\" open classroom\" model of education which expands upon Ferris'(2002) collaborative partnership model of education by integrating\" open\" technologies such as Wiki and Open Source Software to create enduring\" knowledge products\" that more completely engage the students and provide value to society. We further view this concept through the lens of a social-technical system to demonstrate how such a system represents significant, third order change to traditional classroom environments. We illustrate our model with two successful cases from our personal teaching experiences.", "num_citations": "48\n", "authors": ["910"]}
{"title": "JBoss: The evolution of professional open source software\n", "abstract": " Over the past five years, JBoss has evolved from a failed dot. com-era startup to the market leader in the J2EE application server market. In the process, it has developed a business model based on the notion of Professional Open Source (POS) and built an ecosystem to support company growth. This article uses two established frameworks to describe the growth of JBoss and its associated ecosystem. It also explores the four strategic risks that face every firm: demand risk, innovation risk, inefficiency risk, and scale risk. We believe the emergence of POS has eight lessons for IS leaders:(1) the cost of running an IS unit will decline,(2) software innovation and quality should improve,(3) benign POS monopolies might emerge,(4) IS units might become less dependent on a single POS support provider,(5) POS will escalate,(6) IS leaders will experience pressures from outside the IS unit to adopt POS,(7) IS units will develop an open source strategy, and (8) traditional software companies will be forced to adapt.", "num_citations": "44\n", "authors": ["910"]}
{"title": "Choosing management information systems as a major: Understanding the smiFactors for MIS\n", "abstract": " Given declining management information systems (MIS) enrollments at our university, we seek to understand our students ‘selection of a major. Prior studies have found that students choose a major based on a number of factors, with subject matter interest consistently being most important. We contribute to the literature by developing a deeper understanding of what is meant by subject matter interest, which we refer to as smiFactors, for MIS as a major and career. Based on a qualitative analysis of open-ended survey questions completed by undergraduate business students, we confirm a number of smiFactors for MIS gleaned from recent studies and identify three new ones. We also relate our findings to broad categories of vocational interests. Of the newly identified smiFactors, one—linking business and technology—is unique to MIS, whereas the other two—practical application of course work and daily variety—apply to MIS as well as other majors and careers. Our findings provide a more complete foundation for helping students make an informed choice of MIS as a major. We use our findings and an extension of the Theory of Planned Behavior (TPB) to identify four types of intervention for increasing MIS enrollments.", "num_citations": "39\n", "authors": ["910"]}
{"title": "Critical Realism-Based Explanatory Case Study Research in Information Systems\n", "abstract": " Critical realism has been proposed as an alternative philosophical paradigm to positivism and interpretivism, but few papers have offered guidelines or suggestions for applying this philosophy to actual research methodologies. This article proposes a set of methodological principles for conducting and evaluating critical realism-based explanatory case study research within the information systems (IS) field. The principles are consistent with the ontological and epistemological assumptions of critical realism, which are discussed along with a brief comparison to the contrasting assumptions from positivism and interpretivism. Examples from published case study articles in the IS research literature are discussed in order to demonstrate each principle in more detail.", "num_citations": "38\n", "authors": ["910"]}
{"title": "Implementation of an intravenous medication infusion pump system: implications for nursing\n", "abstract": " Aim  To assess perceptions of nurses regarding the implementation of intravenous medication infusion system technology and its impact on nursing care, reporting of medication errors and job satisfaction. Background  Medication errors are placing patients at high risk and creating an economic burden for hospitals and health care providers. Infusion pumps are available to decrease errors and promote safety. Methods  Survey of 1056 nurses in a tertiary care Magnet hospital, using the Infusion System Perception Scale. Response rate was 65.43%. Results  Nurses perceived the system would enhance their ability to provide quality nursing care, reduce medication errors. Job satisfaction was related to higher ratings of the management team and nursing staff. Perceptions verified the pump was designed to promote safe nursing practices. Conclusions  It is important to consider relationships with job satisfaction …", "num_citations": "36\n", "authors": ["910"]}
{"title": "Research agenda for studying open source II: View through the lens of referent discipline theories\n", "abstract": " In a companion paper [Niederman et al., 2006] we presented a multi-level research agenda for studying information systems using open source software. This paper examines open source in terms of MIS and referent discipline theories that are the base needed for rigorous study of the research agenda.", "num_citations": "31\n", "authors": ["910"]}
{"title": "Explaining users' security behaviors with the security belief model\n", "abstract": " Information security is often viewed as a technological matter. However, security professionals will readily admit that without safe practices by users, no amount or type of technology will be effective at preventing unauthorized intrusions. By paralleling the practices of information security and health prevention, a rationale for employing constructs from existing models of health behavior is established. A comprehensive and parsimonious model (the Security Belief Model) is developed to explain information security behavior intentions. The model is tested empirically based on a sample of 237 Indian professionals. The results of the empirical study indicate general support for the model, particularly including severity, susceptibility, benefits, and a cue to action as antecedents to the intention to perform preventive information security behaviors. The paper also discusses implications of the model and results for …", "num_citations": "27\n", "authors": ["910"]}
{"title": "A critical realist script for creative theorising in information systems\n", "abstract": " Research in information systems (IS) has been dominated by an epistemic script that leads to a variety of negative consequences related to the novelty, creativity, and nature of theory produced. While having matured as a field, theory and theorising in IS tend to lack diversity, struggle in balancing the role of reference theory and empirics, inadequately internalise the information technology (IT) artefact into theories developed, and lack clear relationships to what practitioners actually experience. Our premise is that critical realism (CR), based on specific ontological and epistemological foundations, affords the potential to establish alternative epistemic scripts that can enhance the theory product in IS research. We discuss the basic concepts of theory and theorising and relate these to the current state of theory developed in IS research. Next, we review the fundamental principles of CR and describe how a research …", "num_citations": "18\n", "authors": ["910"]}
{"title": "Recent advances and opportunities for improving critical realism-based case study research in IS\n", "abstract": " Critical realism (CR) has been proposed as an alternative to positivist and interpretivist research in information systems. In recent years, there have been several articles that describe methodological guidelines for conducting CR-based empirical studies. These guidelines have been used by numerous researchers as the methodological underpinnings for empirical research articles in IS, particularly for case studies. As a result, CR-based research has evolved as these researchers address many of the challenges and issues associated with this approach. In this article, we present a review and synthesis of methodological and recent empirical CR literature. We identify the methodological advances and important gaps in the empirical research and present a set of state-of-the-art recommendations for conducting and evaluating critical realist research studies in IS.", "num_citations": "15\n", "authors": ["910"]}
{"title": "Assessing the health of an open source ecosystem\n", "abstract": " This study examines the concept of an ecosystem as originated in the field of ecology and applied to open source software projects. Additionally, a framework for assessing the three dimensions of ecosystem health is defined and explained using examples from a specific open source ecosystem. The conceptual framework is explained in the context of a case study for a sponsored open source ecosystem. The framework and case study highlight a number of characteristics and aspects of these ecosystems which can be evaluated by existing and potential members to gauge the health and sustainability of open source projects and the products and services they produce.", "num_citations": "15\n", "authors": ["910"]}
{"title": "Preventive adoption of information security behaviors\n", "abstract": " Many tools and safe computing practices are available to information system users to help them avoid the negative outcomes due to information security threats. Yet many users do not use these tools and practices. We seek to understand the factors influencing organizational users’ adoption of preventive information security behaviors. These behaviors are similar to those which individuals practice to prevent negative health outcomes. A new model incorporating the primary antecedents of users’ intentions related to preventive security, the Preventive Adoption Model (PAM), is presented and tested. PAM is derived from health behavior theories (health belief model, protection motivation theory, and theory of planned behavior) and integrates key constructs specific to the information security context. Results of the study suggest that users’ beliefs regarding the threats and their avoidability, the proposed preventive actions, and their individual capabilities have an impact on their intentions to perform the prescribed behaviors.", "num_citations": "11\n", "authors": ["910"]}
{"title": "Why students choose MIS: what makes a major-job-career in management information systems interesting?\n", "abstract": " Students choose a major based on a number of factors, with interest in the subject matter consistently being important. Given declining MIS enrollments at our university, we seek to understand our students' selection of a major so that we may take appropriate steps to address the decline. Besides understanding our situation better, we seek to contribute to the literature by developing a deeper understanding of what is meant by interest in the major. Our research is guided by the theory of planned behavior (TPB). Our primary focus is to examine students' expected outcomes that lead to attitudes, with a particular focus on aspects of an MIS major that generate interest in the major. We will use open-ended survey questions and conduct qualitative interviews with students at our university, including new and returning students, MIS and non-MIS majors. Results will be reported at the conference.", "num_citations": "11\n", "authors": ["910"]}
{"title": "Leadership and motivation in open source projects\n", "abstract": " There are nearly 75,000 open source projects and over 750,000 registered users on Sourceforge. net. Yet few of them are successful in attracting other developers and users to participate in the design, testing, and use of the intended software package. Why are some project leaders able to grow their project teams and guide their projects toward completion while others are stalled or abandoned? What attracts participants to a project and why do they continue to work on a project from which they can leave at any time? Using a model based on the Path-Goal Theory of Leadership and self-concept theory, this paper attempts to identify both the sources of motivation for participants in open source projects and the leadership behaviors that attract and motivate them to complete the project.", "num_citations": "8\n", "authors": ["910"]}
{"title": "Dragon Air: A Database Design Case\n", "abstract": " This case describes a real-world scenario based on a fictional new commuter airline seeking to develop a database to support their operations. Students are asked to design and develop a database to allow the airline to track flights, passengers, bookings, and more, based on a set of business rules, default data, and other requirements. The case is designed to be a relatively stringent test of the group’s abilities, with significant detail included in the case materials, along with a number of challenge tasks for advanced classes, groups, or individuals. The case has been designed for use as a semester-long group project in a Database Management course, focusing on reinforcing the students’ skills in entity relationship diagrams (ERDs) and SQL coding.", "num_citations": "5\n", "authors": ["910"]}
{"title": "Team and organizational identification among information systems personnel: An exploratory investigation of post IT outsourcing personnel impacts\n", "abstract": " This study examines the impact of social identification of IT employees in IT outsourcing firms. Specifically, we ask: What effect does social identification have on employee attitudes in the wake of major outsourcing initiatives? We examine social identification through the separate dimensions of team identification and organizational identification. The results suggest that when team identification and organizational identification are viewed as two distinct measures of social identity, the effect on the workplace attitudes of IT employees vary.", "num_citations": "5\n", "authors": ["910"]}
{"title": "Understanding the health of technological ecosystems: the case of professional open source software\n", "abstract": " The value attainable from information systems investments requires the contributions of not only vendors and customers, but also an interdependent network of skilled professionals and organizations. This is especially salient for open source software, as the contributions are predominantly voluntary. In this study, an ecosystems metaphor is applied from the fields of ecology and human ecology to develop an understanding of the relationships and capital flows that enable the health and sustainability of these technological networks. A healthy ecosystem is defined as one in which the members are able to achieve sufficient returns to both satisfy their needs and encourage continued contributions. Using a case study of particular incidents occurring within professional open source ecosystems, this study attempts to identify the generative mechanisms, antecedent factors, and structural means by which ecosystem health evolves despite the myriad stresses they experience. The data collection via interviews, field observations, and archival data focuses on the circulation, transformation, and accumulation of capital associated with the response to these stresses. In so doing, this research develops a more complete means of assessing not only the health, but also the potential value of participating in these ecosystems.", "num_citations": "5\n", "authors": ["910"]}
{"title": "The evolving structure and function of commercial open source software ecosystems\n", "abstract": " Commercial open source software firms depend on an ecosystem consisting of individuals and organizations to develop and support the necessary source code, services, and delivery conditions. The structure and function of this ecosystem, as a social system and technological platform, evolves based on its membership composition and the ensuing differentiation and integration of these members’ contributions. Based on an explanatory case study, we conclude that researchers and practitioners can benefit from an increased attention to these composition and interactions within a given software ecosystem.", "num_citations": "4\n", "authors": ["910"]}
{"title": "Resilience of professional open source ecosystems\n", "abstract": " This paper discusses the ability of an open source firm and its surrounding ecosystem to adapt to changing conditions in an effort to survive. Using an explanatory case study methodology, we examine a series of stresses that occurred over the life of a single professional open source ecosystem as its members attempted to adjust to the resultant impacts upon the available capital portfolios and flows. We propose that the resilience of an ecosystem is largely dependent on the ability of its members to enact available mechanisms to redirect or adjust to these changing capital flows in order to satisfy their individual needs. We also propose that the existence of a central stakeholder, such as the professional open source firm itself, to manage a portion of these capital flows.", "num_citations": "4\n", "authors": ["910"]}
{"title": "Open to all: a postmodern perspective on product development and brands in an open-source environment\n", "abstract": " While open source product development and innovation is not a new phenomenon, it is a prominent form of offering development in the post-industrial age, facilitated by networked communication media. Understanding open source presents challenges to practitioners and academics alike. This article explores the open source phenomenon using themes characterising postmodernism, which is particularly apt to an information-rich context such as open source. The article defines and describes open source and then examines the phenomenon using the postmodern themes of fragmentation, dedifferentiation, time and space interaction, antifoundationalism and the values of paradox, reflexivity, and pastiche. The contention is that postmodernism illuminates thinking concerning open source as a means of invention and production in the information age, just as modernism illuminated thinking in the traditional …", "num_citations": "4\n", "authors": ["910"]}
{"title": "Governance, leadership and management in adaptive and inventive digital communities: A research agenda to reduce waste in graduate education\n", "abstract": " Building on transaction cost economics, this work describes the four different forms of communities and introduces transaction benefits as a means of explaining their existence. A research project to investigate governance, leadership, and management in two of the four forms of communities, adaptive and inventive, is described. It is argued that these digital communities are a way of engaging graduate students in wealth creation and thus ‘waste’in graduate education can be reduced.", "num_citations": "4\n", "authors": ["910"]}
{"title": "Assessing the Emphasis on Information Security in the Systems Analysis and Design Course\n", "abstract": " Due to several recent highly publicized information breaches, information security has gained a higher profile. Hence, it is reasonable to expect that information security would receive an equally significant emphasis in the education of future systems professionals. A variety of security standards that various entities (eg, NIST, COSO, ISACA-COBIT, ISO) have put forth emphasize the importance of information security from the very beginning of the system development lifecycle (SDLC) to avoid significant redesign in later phases. To determine the emphasis on security in typical systems analysis and design (SA&D) courses, we examine (1) to what extent security is emphasized in the core SA&D courses and (2) at what phase in the SDLC do most SA&D courses begin to emphasize security. In order to address these questions, we reviewed SA&D textbooks currently on the market to identify how extensively they cover security-related issues. Given the fairly high awareness of information security in practice, we expected to see an equally high emphasis on such matters in the textbooks. However, our review suggests that this is not the case, which suggests a gap in our preparation. To address this gap, we offer a proposal for modifying a portion of the SA&D curricula.", "num_citations": "3\n", "authors": ["910"]}
{"title": "Searching for Herbert Simon: Extending the Reach and Impact of Business Intelligence Research Through Analytics\n", "abstract": " Since Herbert Simon’s seminal work (Simon, 1957) on bounded rationality researchers and practitioners have sought the “holy grail” of computer-supported decision-making. A recent wave of interest in “business analytics”(BA) has elevated interest in data-driven analytical decision making to the forefront. While reporting and prediction via business intelligence (BI) systems has been an important component to business decision making for some time, BA broadens its scope and potential impact in business decision making further by moving the focus to prescription. The authors see BA as the end-to-end process integrating the production through consumption of the data, and making more extensive use of the data through heavily automated, integrated and advanced predictive and prescriptive tools in ways that better support, or replace, the human decision maker. With the advent of “big data”, BA already extends …", "num_citations": "3\n", "authors": ["910"]}
{"title": "Open source software research: an evolving endeavor\n", "abstract": " The purpose of this special issue is to provide a rigorous examination of the open source software (OSS) movement, with special consideration to the impact it has on not only the software products, but also the software industry as a whole. Naturally, the OSS movement is large and has many facets that could be worthwhile to investigate. For this special issue, we tried to take as open an approach as possible to soliciting articles pertaining to OSS from diverse perspectives. We were particularly interested in communities and participants in the OSS development process and in the evolving positioning of OSS in the organizational environment. This special issue, as you will see, includes articles answering interesting questions from these two areas. One common speculation on OSS pertains to the effect of the idealized early model of OSS community influence domains outside of software development. In a recent …", "num_citations": "3\n", "authors": ["910"]}
{"title": "Critical Realism and Mechanisms: Moving from the Philosophical to the Empirical in the Search for Causal Explanations\n", "abstract": " Critical Realism (CR) has recently emerged as a philosophical and methodological alternative for conducting information systems research. In order to fully leverage CR, researchers must have a clear conceptual and empirical understanding of causal mechanisms and their relationship to the organizational, social, and technological structures existing in a given research setting. Unfortunately, the mechanism concept has proved to be somewhat ambiguous. The proposed panel will address these mechanisms in general, and affordances as a specific type of mechanism which has particular value in IS research. The four panelists will discuss mechanisms from four distinct but interrelated perspectives to provide interested IS researchers with several approaches for conducting empirical critical realist research.", "num_citations": "2\n", "authors": ["910"]}
{"title": "Examining the impact of user personality traits on concern for information privacy of personal health information\n", "abstract": " There is an increasing concern for the privacy of personal health information (PHI), driven by the proliferation of electronic health system utilization in the healthcare sector. The management of personal electronic health information, ie, digital report (s) of real-time patient-centered information, has multiple stakeholders and is heavily regulated. As more personal health information is stored and transmitted in electronic form, there is an increasing concern for the privacy of sensitive PHI data. This study explores how an individual’s personality traits, as measured by the “Big Five” from Costa & McCrae (2003), drive individual concerns for data privacy. Rather than viewing privacy concerns as a single multidimensional consequence, we investigate six dimensions of privacy concern–collection, errors, unauthorized secondary use, improper access, control, and awareness. We aim to understand which privacy concern dimensions are most impacted by consumers/patients will greatly contribute to both practitioners and academics alike.", "num_citations": "1\n", "authors": ["910"]}
{"title": "A Conceptual Framework of Information Systems Usage and Consequences in Organizations\n", "abstract": " This article examines the relationship between information systems usage   and the consequences which result. The concepts of system usage and   consequences are discussed in some detail, along with the interactions   between them. We develop a multilevel conceptual framework of the   processes through which usage behaviors are conducted by individuals,   and through which the outcomes of this usage are generated. Finally, we   discuss a number of methodological implications which may affect the   application of the framework in both research and practitioner contexts.", "num_citations": "1\n", "authors": ["910"]}
{"title": "Impact of software ecosystems on the implementation of open source-based electronic health record software\n", "abstract": " In this manuscript, we examine the ways in which the members of the ecosystem surrounding an open source software (OSS) based EHR system impact the quality and success of the resultant implementation. Following a brief theoretical review, we provide narratives of successful OSS-based EHRs at three US hospitals, followed by a brief discussion of the contributions and effects of the open source ecosystem that differ from those expected in proprietary EHR installations.", "num_citations": "1\n", "authors": ["910"]}