{"title": "Automated test case generation for FBD programs implementing reactor protection system software\n", "abstract": " Automated and effective testing for function block diagram (FBD) programs has become an important issue, as FBD is increasingly used in implementing safety‐critical systems. This work describes an automated test case generation technique for FBD programs and its associated tool—FBDTester. Given an FBD program and desired test coverage criteria, FBDTester generates test requirements and invokes the Satisfiability Modulo Theories solver iteratively to derive a set of test cases. An industrial case study using reactor protection system software shows that the automatically generated test suites detected at least 82% of the known faults, whereas manually generated test cases only detected approximately 35%. Mutation analysis revealed that the automatically generated test suites substantially outperformed manually generated ones. Although test sequence generation requires some manual effort in the current …", "num_citations": "43\n", "authors": ["2031"]}
{"title": "Empirical evaluation on FBD model-based test coverage criteria using mutation analysis\n", "abstract": " Function Block Diagram (FBD), one of the PLC programming languages, is a graphical modeling language which has been increasingly used to implement safety-critical software such as nuclear reactor protection software. With increased importance of structural testing for FBD models, FBD model-based test coverage criteria have been introduced. In this paper, we empirically evaluate the fault detection effectiveness of the FBD coverage criteria using mutation analysis. We produce 1800 test suites satisfying the FBD criteria and generate more than 600 mutants automatically for the target industrial FBD models. Then we evaluate mutant detection of the test suites to assess the fault detection effectiveness of the coverage criteria. Based on the experimental results, we analyze strengths and weaknesses of the FBD coverage criteria, and suggest possible improvements for the test coverage criteria.", "num_citations": "28\n", "authors": ["2031"]}
{"title": "Comparing offline and online testing of deep neural networks: An autonomous car case study\n", "abstract": " There is a growing body of research on developing testing techniques for Deep Neural Networks (DNNs). We distinguish two general modes of testing for DNNs: Offline testing where DNNs are tested as individual units based on test datasets obtained independently from the DNNs under test, and online testing where DNNs are embedded into a specific application and tested in a close-loop mode in interaction with the application environment. In addition, we identify two sources for generating test datasets for DNNs: Datasets obtained from real-life and datasets generated by simulators. While offline testing can be used with datasets obtained from either sources, online testing is largely confined to using simulators since online testing within real-life applications can be time consuming, expensive and dangerous. In this paper, we study the following two important questions aiming to compare test datasets and testing …", "num_citations": "27\n", "authors": ["2031"]}
{"title": "A theoretical framework for understanding mutation-based testing methods\n", "abstract": " In the field of mutation analysis, mutation is the systematic generation of mutated programs (i.e., mutants) from an original program. The concept of mutation has been widely applied to various testing problems, including test set selection, fault localization, and program repair. However, surprisingly little focus has been given to the theoretical foundation of mutation-based testing methods, making it difficult to understand, organize, and describe various mutation-based testing methods. This paper aims to consider a theoretical framework for understanding mutation-based testing methods. While there is a solid testing framework for general testing, this is incongruent with mutation-based testing methods, because it focuses on the correctness of a program for a test, while the essence of mutation-based testing concerns the differences between programs (including mutants) for a test. In this paper, we begin the …", "num_citations": "23\n", "authors": ["2031"]}
{"title": "Comprehensive analysis of FBD test coverage criteria using mutants\n", "abstract": " Function block diagram (FBD), a graphical modeling language for programmable logic controllers, has been widely used to implement safety critical system software such as nuclear reactor protection systems. With the growing importance of structural testing for FBD models, structural test coverage criteria for FBD models have been proposed and evaluated using mutation analysis in our previous work. We extend the previous work by comprehensively analyzing the relationships among fault detection effectiveness, test suite size, and coverage level through several research questions. We generate a large number of test suites achieving an FBD test coverage ranging from 0 to 100 %, and we also generate many artificial faults (i.e. mutants) for the FBD models. Our analysis results show that the fault detection effectiveness of the FBD coverage criteria increases with increasing coverage levels, and the …", "num_citations": "17\n", "authors": ["2031"]}
{"title": "Human resource allocation in software project with practical considerations\n", "abstract": " Software planning is very important for the success of a software project. Even if the same developers work on the same project, the time span of the project and the quality of software may change based on the project plan. When software managers plan a software project, they strive to allocate human resources in a more efficient way to produce a better software with less cost. The planning process is, however, time-consuming and complicated, especially when the size of the software project is large.         Many approaches have been proposed to help software project managers by providing optimal human resource allocations in terms of minimizing the cost. Previous approaches, however, only concentrated on minimizing the cost, and no existing works have considered the practical issues affecting project schedules in practice.         We elicited the practical considerations relating to the human resource allocation …", "num_citations": "17\n", "authors": ["2031"]}
{"title": "Modeling and verification for different types of system of systems using prism\n", "abstract": " A System of Systems (SoS) consists of complex Constituent Systems (CSs), which have managerial and operational independence. As the CSs have independence, the degree of authority to control the CSs varies depending on the different types of SoS, such as directed, acknowledged, and collaborative SoS. While many researchers have attempted to model SoSs and verify SoS-level goals, little attention has been paid to how different types of SoSs are characterized and realized during modeling and verification. Using a mass casualty incident response system as a common working example for different types of a SoS, we model the types of SoS with probabilistic models of PRISM, which can capture uncertain behaviors of an SoS in a quantitative manner and perform statistical model checking in order to verify to which extent each type of SoS achieves the SoS-level goal. Differences between the different types …", "num_citations": "16\n", "authors": ["2031"]}
{"title": "Practical Human Resource Allocation in Software Projects Using Genetic Algorithm\n", "abstract": " Software planning is becoming more complicated as the size of software project grows, making the planning process more important. Many approaches have been proposed to help software project managers by providing optimal human resource allocations in terms of minimizing the cost. Since previous approaches only concentrated on minimizing the cost, there has not been a study that considers the practical issues affecting project schedule in practice. We elicited the practical considerations on the human resource allocation problem by communicating with a group of software project experts. In this paper, we propose an approach for solving the human resource allocation problem using a genetic algorithm (GA) reflecting the practical considerations. Our experiment shows that our algorithm considers the practical considerations well, in terms of continuous allocation on relevant tasks, minimization of developer multitasking time, and balance of allocation.", "num_citations": "16\n", "authors": ["2031"]}
{"title": "Formal modeling and verification of a federated byzantine agreement algorithm for blockchain platforms\n", "abstract": " A blockchain is a type of distributed ledger that can record transactions between parties in a verifiable and permanent manner. Each node contains its ledger, and the contents of each ledger are maintained to be the same by a consensus algorithm. It is essential to ensure the safety and liveness of the consensus algorithms in blockchain platforms. The Stellar Consensus Protocol (SCP), which is a consensus algorithm for the Stellar cryptocurrency using the blockchain, is utilized for the federated Byzantine agreement. The quorum configuration is one of the essential factors for ensuring the safety and liveness of the SCP; however, it has been rarely studied. In this study, we model the SCP with timed automata and verify the model using a model checking technique, with the purpose of investigating and evaluating the SCP. Through the modeling and verification of the SCP, we could check whether a certain quorum …", "num_citations": "14\n", "authors": ["2031"]}
{"title": "A runtime verification framework for dynamically adaptive multi-agent systems\n", "abstract": " Dynamically adaptive multi-agent systems (DAMS) consist of multiple agents that adapt to changing system and environmental conditions in order to achieve collaborative goals. As DAMS are found in applications across various domains, ensuring the correct and safe adaptations of DAMS has become more important. Formal verification techniques such as model checking present a promising approach to guaranteeing the correctness of a software system with respect to certain system requirements. Previous works on formal verification for dynamically adaptive system or multi-agent system, however, have not addressed the runtime and collaborative nature inherent to DAMS operations. This work proposes a runtime verification framework for DAMS (DAMS-RV) based on an adaptive feedback loop, which is activated for each adaptation that system makes after a change in the system or environment. The proposed …", "num_citations": "9\n", "authors": ["2031"]}
{"title": "Digital Twins Are Not Monozygotic–Cross-Replicating ADAS Testing in Two Industry-Grade Automotive Simulators\n", "abstract": " The increasing levels of software- and data-intensive driving automation call for an evolution of automotive soft-ware testing. As a recommended practice of the Verification and Validation (V&V) process of ISO/PAS 21448, a candidate standard for safety of the intended functionality for road vehicles, simulation-based testing has the potential to reduce both risks and costs. There is a growing body of research on devising test automation techniques using simulators for Advanced Driver-Assistance Systems (ADAS). However, how similar are the results if the same test scenarios are executed in different simulators? We conduct a replication study of applying a Search-Based Software Testing (SBST) solution to a real-world ADAS (PeVi, a pedestrian vision detection system) using two different commercial simulators, namely, TASS/Siemens PreScan and ESI Pro-SiVIC. Based on a minimalistic scene, we compare critical …", "num_citations": "5\n", "authors": ["2031"]}
{"title": "Mutation analysis for system of systems policy testing\n", "abstract": " A System of Systems (SoS) is a set of the constituent systems (CS) which has managerial and operational independence. To address an SoS-level goal that cannot be satisfied by each CS, an SoS policy guides or forces the CSs to collaborate with each other. If there is a fault in the SoS policy, SoS may fail to reach its goal, even if there is no fault in the CSs. Such a call for SoS policy testing leads to an essential question-how can testers evaluate the effectiveness of test cases?In this paper, we suggest a mutation analysis approach for SoS policy testing. Mutation analysis is a systematic way of evaluating test cases using artificial faults called mutants. As a general mutation framework for SoS policy testing, we present an overview of mutation analysis in SoS policy testing as well as the key aspects that must be defined in practice. To demonstrate the applicability of the proposed approach, we provide a case study …", "num_citations": "5\n", "authors": ["2031"]}
{"title": "Efficient testing of self-adaptive behaviors in collective adaptive systems\n", "abstract": " Collective adaptive systems (CAS) consist of multiple agents that adapt to changing system and environmental conditions in order to satisfy system goals and quality requirements. As more applications involve using CAS in a critical context, ensuring the correct and safe adaptive behaviors of quality-driven CAS has become more important. In this paper, we propose Collective Adaptive System Testing (CAST), a scalable and efficient approach to testing self-adaptive behaviors of CAS. We propose a selective method to instantiate and execute test cases relevant to the current adaptation context. This enables testers to focus testing on key self-adaptive behaviors while dealing with the scale and dynamicity of the system. An experimental evaluation using a traffic monitoring system is performed to validate its scalability, efficiency, and fault-detection effectiveness. The experimental results provide insights into how …", "num_citations": "4\n", "authors": ["2031"]}
{"title": "ABC+ extended action-benefit-cost modeling with knowledge-based decision-making and interaction model for system of systems simulation\n", "abstract": " The system of systems (SoS) is a large-scale and complex system composed of autonomous and independent constituent systems (CSs). It deals with complex requirements as SoS-level goals that are not able to be satisfied by a single CS. To analyze SoS-level behaviors considering CSs' autonomy and independence, SoS-level engineers need to model and simulate an SoS properly. Action-Benefit-Cost (ABC) modeling provides an effective and efficient way to model and simulate the autonomous and independent behaviors of CSs by focusing on their external actions, benefits, and costs. However, ABC modeling does not support internal-knowledge of a CS. In addition, ABC modeling does not support communications between CSs. SoS engineers also have difficulty in reflecting all possible interaction into models in advance of simulation. In this paper, we propose ABC+ modeling, which supports the three …", "num_citations": "3\n", "authors": ["2031"]}
{"title": "An Applicability Study of Action-Benefit-Cost Model and Statistical Model Checking for System of Systems Goal Achievement Verification\n", "abstract": " The notion of System of Systems (SoS), which is composed by many independent systems (ie, Constituent Systems, CS), has emerged in various domains including social infrastructure. It is widely expected that complex requirements, which cannot be achieved in each CS-level, will be achieved in an SoS-level. While verification of SoS-level goal achievement is one of the most important problems, concrete case studies on SoS modeling and verification are still rare. In this paper, we focus on the fact that each CS performs an action for its own purpose by its own decision-making mechanism. We propose a novel Action-Benefit-Cost (ABC) SoS model which caters to the independent decision-making mechanisms of CSs. Using an abstract SoS example, this proposal provides a case study for the modeling and quantitative verification of the ABC SoS model.", "num_citations": "2\n", "authors": ["2031"]}
{"title": "Quality based software project staffing and scheduling with cost bound\n", "abstract": " Software project planning is becoming more complicated and important as the size of software project grows. Many approaches have been proposed to help project managers by providing optimal staffing and scheduling in terms of minimizing the cost (i.e., necessary expanse) or time (i.e., time span or duration) required for the software project. Unfortunately, the software quality, another critical factor in software project planning, is largely overlooked in previous work. In this paper, we propose the quality based software project staffing and scheduling approach using a genetic algorithm (GA). We define a quality score by considering practical issues in software project planning in addition to task severity and defect amplification model. Further, the cost is utilized as a cost-bound in the GA to consider not only quality but also cost. Case study shows that the proposed approach improves the quality while the cost is …", "num_citations": "2\n", "authors": ["2031"]}
{"title": "의료 도메인 자가 적응형 시스템 정형 검증 사례연구 및 분석\n", "abstract": " DSpace at KOASAS: 의료 도메인 자가 적응형 시스템 정형 검증 사례연구 및 분석 KOASAS menu About KOASAS KAIST Library 검색 Advanced Search Browse Communities & Collections Researchers at KAIST Titles Subject By Date rss_1.rss_2.atom_1.sherpa SEARCH DSpace at KOASAS College of Engineering(공과대학)School of Computing(전산학부)CS-Conference Papers(학술회의논문) 의료 도메인 자가 적응형 시스템 정형 검증 사례연구및 분석 Cited 0 time in webofscience Cited 0 time in scopus Hit : 197 Download : 0 Export DC(XML) Excel 임유진 / 신동환 / 지은경 / 박지훈 / 배두환researcher Publisher 소프트웨어공학 소사이어티 Issue Date 2014-02-13 Language KOR Citation 2014 한국소프트웨어공학 학술대회, v.16, no.1, pp.15 - 22 URI http://hdl.handle.net/10203/199338 Appears in Collection CS-Conference Papers(학술회 의논문) Files in This Item There are no files associated with this item. Display Full …", "num_citations": "2\n", "authors": ["2031"]}
{"title": "Effective Removal of Operational Log Messages: an Application to Model Inference\n", "abstract": " Model inference aims to extract accurate models from the execution logs of software systems. However, in reality, logs may contain some \"noise\" that could deteriorate the performance of model inference. One form of noise can commonly be found in system logs that contain not only transactional messages---logging the functional behavior of the system---but also operational messages---recording the operational state of the system (e.g., a periodic heartbeat to keep track of the memory usage). In low-quality logs, transactional and operational messages are randomly interleaved, leading to the erroneous inclusion of operational behaviors into a system model, that ideally should only reflect the functional behavior of the system. It is therefore important to remove operational messages in the logs before inferring models. In this paper, we propose LogCleaner, a novel technique for removing operational logs messages. LogCleaner first performs a periodicity analysis to filter out periodic messages, and then it performs a dependency analysis to calculate the degree of dependency for all log messages and to remove operational messages based on their dependencies. The experimental results on two proprietary and 11 publicly available log datasets show that LogCleaner, on average, can accurately remove 98% of the operational messages and preserve 81% of the transactional messages. Furthermore, using logs pre-processed with LogCleaner decreases the execution time of model inference (with a speed-up ranging from 1.5 to 946.7 depending on the characteristics of the system) and significantly improves the accuracy of the inferred models, by …", "num_citations": "1\n", "authors": ["2031"]}
{"title": "Quality-based software project staffing and scheduling with project deadline\n", "abstract": " Software project planning includes several processes for estimating the effort required to complete software project tasks, allocating human resources to tasks, and creating a project plan. Because software planning is becoming more complicated as the size of software projects grow, it is difficult for project managers to decide on a reasonable project plan. To help them, many automatic software project planning approaches have been proposed. The approaches all focus on minimizing project duration. But if the plan is simply to minimize the duration, without considering software quality, the plan can harm the eventual software quality. In our research to create a reasonable project plan, we consider software quality as well as duration of the project, by defining a software quality score. The project manager can plan the project to maximize software quality for a specific project duration.", "num_citations": "1\n", "authors": ["2031"]}
{"title": "소프트웨어 산업체 피드백을 반영한 자동화된 인력 할당\n", "abstract": " 소프트웨어 프로젝트의 성공적 수행을 위해서는 프로젝트 초기 단계에서 합리적 인력계획을 세우고 할당하는 것이 중요하다. 이 과정에서 관리자는 자동화된 인력할당 기법을 통해 합리적 의사결정을 지원받고 비합리적 인력할당으로 인해 발생할 수 있는 리스크를 줄일 수 있다. 인력할당 기법이 산업적으로 유용하기 위해서는 실제 실무에서 관리자가 고려하는 구체적 이슈들을 반영하여 합리적 할당 결과를 산출할 수 있어야 한다. 본 연구에서는 프로젝트 계획 및 관리에 있어 많은 경험을 축적해온 산업체와의 협의를 통해 실무 이슈를 반영한 인력할당 기법을 개발한다. 개발된 기법의 프로토타입 구현을 통해 기법에 반영된 실무 이슈가 할당 결과에 미치는 영향을 분석하고 해당 이슈 고려의 합리성을 파악한다. 결론적으로, 본 연구에서는 기존 기법에서 반영되지 못했던 이슈들을 반영한 새로운 기법을 제안하였다.", "num_citations": "1\n", "authors": ["2031"]}
{"title": "FBD 모델 대상 뮤테이션 연산자 정의 및 사례연구\n", "abstract": " Function Block Diagram(FBD)는 산업용 컴퓨터인 Programmable Logic Controller(PLC)의 표준 프로그래밍 언어 중 하나이다. 다양한 시험 기법들의 오류 검출 효과성을 평가하기 위해 뮤테이션 분석 기법이 널리 쓰이고 있는데, FBD 모델에 대한 뮤테이션 연산자가 정의되어 있지 않기 때문에 적용에 어려움이 있었다. 본 연구에서는 FBD 모델의 특성, 다양한 FBD 모델의 실제 오류 및 기존 뮤테이션 분석 기법에 관한 분석을 통해 뮤테이션 연산자를 정의한다. 정의된 FBD 뮤테이션 연산자를 활용하여 실제 산업계에서 쓰이는 FBD 모델을 대상으로 뮤테이션 분석을 수행하여 FBD 모델 시험 데이터와 시험 기법을 체계적으로 평가한다.", "num_citations": "1\n", "authors": ["2031"]}