{"title": "Examining the usability of touch screen gestures for children with down syndrome\n", "abstract": " The use of multi-touch devices for all types of users (from children to the elderly) has grown considerably in the recent years. However, despite the huge interest in this technology there is a lack of research addressing usability studies on children with Down’s Syndrome. This article evaluates the abilities of these children (aged from 5 to 10 years) when performing a basic set of multi-touch gestures (tap, double tap, long press, drag, scale up and down, rotation) in tablet devices. The results show that regardless of their more limited motor skills, DS children are able to perform most of the evaluated multi-touch gestures with success rates close to 100% and that this technology could be fully exploited for developing applications targeted specifically at this type of user.", "num_citations": "11\n", "authors": ["1268"]}
{"title": "Usability testing in mobile applications involving people with down syndrome: a literature review\n", "abstract": " We present a review of research related to the usability testing of mobile applications including participants with Down syndrome. The purpose is to identify good usability testing practices and possible guidelines for this process when participants are people with this cognitive disability. These practices and guidelines should account for their specific impairments. We applied document analysis techniques to searches of scientific databases. The results were filtered considering how well they matched the research topic. We processed and reported the classified and summarized results. The main findings of this literature review is that mobile applications usability testing including people with Down syndrome is an issue that has not be comprehensively investigated. While there is some related research, this is incomplete, and there is no single proposal that takes on board all the issues that could be taken into …", "num_citations": "11\n", "authors": ["1268"]}
{"title": "The role of tangible interfaces in enhancing children's engagement in learning\n", "abstract": " This paper presents the results of an exploratory study in which the authors investigated the impact of tangible interface used by children at the elementary school level. Exploration of the viability of graphics tablet and the pen tool was conducted by investigating the children's ease in acclimating to the technology and the effectiveness in engaging them to complete some tasks. Several children were invited to a workshop where they learned and played BatiKids, a game-based learning developed to support children in learning the process of making Indonesian hand-written batik. The qualitative analysis based on the notes and video recording taken on the field observational, and the responses to interview questions to the participants. The results show the main findings and discuss the design implications for a tangible interface in the context of BatiKids.", "num_citations": "10\n", "authors": ["1268"]}
{"title": "A generic user interface for energy management in smart homes\n", "abstract": " Building operating systems play an important role in monitoring energy consumption of devices and improving energy efficiency in household buildings. From this arises a need for a preferably flexible and full-featured user interface to visualize the energy data in the building and allow residents to collect and realize various needs and preferences to the system. This article introduces a generic user interface for building operating systems which is presented from aspects of design, implementation and evaluation. To ensure the user interface can be flexibly adapted to various types of buildings, we design a series of generic data models which are independent of any building operating system. Besides, three roles with different permissions and a number of functional components of the user interface are also introduced in the article. Based on the design, a prototype of such a generic user interface named Building …", "num_citations": "9\n", "authors": ["1268"]}
{"title": "Examining the usability of touch screen gestures for elderly people\n", "abstract": " This paper presents an experimental study to assess the capabilities of older adults to interact with multi-touch surfaces. The study involved 100 elderly people between 61–92 years old. We selected two different elderly centres in Madrid, with different characteristics in terms of income level. The “Gesture Games” tool was used because it allows experimenting with the seven more used multi-touch gestures: Tap, Double tap, Long press, Drag, Scale up, Scale down and One-finger rotation. The analysis of the data showed that older adults have total capacity to execute these seven tasks. Some of the tasks, such as “scale down” and “scale up” were found easier for them, while other tasks, such as “double tap” were more difficult.", "num_citations": "4\n", "authors": ["1268"]}
{"title": "Evaluation of a usability testing guide for mobile applications focused on people with down syndrome (USATESTDOWN)\n", "abstract": " Usability testing of mobile applications involving people with Down syndrome is an issue that has not been comprehensively investigated. There is no single proposal that takes on board all the issues that could potentially be taken into account to deal with the specific needs of people with Down syndrome. We propose a guide for a usability testing process involving participants with Down syndrome. This guide is called USATESTDOWN. It is based on a literature review and experience gained at a number of workshops where people with Down syndrome used mobile devices. This paper briefly describes USATESTDOWN and its application at a special employment centre called PRODIS with 10 participants.", "num_citations": "4\n", "authors": ["1268"]}
{"title": "Methodological Proposal of Policies and Procedures for Quality Assurance in Information Systems for Software Development Companies Based on CMMI.\n", "abstract": " The aim of this work is to make a guide based on Capability Maturity Model Integration (CMMI) that is adapted to the reality of software development companies in Ecuador. The current work initially analyzes a conceptual reference framework with fundamental definitions from CMMI. Then, based on surveys, it presents a study of the current quality situation in software development companies, determining the priority given to the quality of the technological product delivered to the end customer. Subsequently, it proposes a set of policies and procedures based on CMMI for information systems quality control at software development companies. These proposals are present-ed clearly and concisely for each of the processes covered by the Engineering Area of CMMI. Finally, a validation of the applicability of the proposal for a medium-sized, nationally-representative software development company is presented. Additionally, the cost-benefit analysis of the proposal is included to better visualize the investments to be made and their potential benefits.", "num_citations": "4\n", "authors": ["1268"]}
{"title": "Usability Testing Process with People with Down Syndrome Intreacting with Mobile Applications: A Literature Review\n", "abstract": " We present a review of research related to the usability testing of mobile applications including participants with Down syndrome. The purpose is to identify good usability testing practices and possible guidelines for this process when participants are people with this cognitive disability. These practices and guidelines should account for their specific impairments. We applied document analysis techniques to searches of scientific databases. The results were filtered considering how well they matched the research topic. We processed and reported the classified and summarized results. The main findings of this literature review is that mobile applications usability testing including people with Down syndrome is an issue that has not be comprehensively investigated. While there is some related research, this is incomplete, and there is no single proposal that takes on board all the issues that could be taken into account. Consequently, we propose to develop guidelines on the usability testing process involving participants with Down syndrome.", "num_citations": "4\n", "authors": ["1268"]}
{"title": "Assistive apps for activities of daily living supporting persons with down’s syndrome\n", "abstract": " Supporting persons with Down’s Syndrome in their daily activities using ICT is a key element in further advancing their independence and integration into society. The POSEIDON project embraces this goals and develops technology which creates adjustable and personalizable assistive systems. We present a system for Money-Handling Training and assistance for shopping. In this paper we present results of evaluating the Money-Handling Training App in different pilot studies and workshops, with a larger group of persons with Down’s Syndrome, comparing different interaction devices like tablet, personal computer and interactive table. Furthermore, we present evaluation results for the Shopping App.", "num_citations": "3\n", "authors": ["1268"]}
{"title": "USATESTDOWN a proposal of a Usability testing guide for mobile applications focused on persons with Down syndrome.\n", "abstract": " The usability testing of mobile applications involving persons with Down syndrome is an issue that has not be comprehensively investigated and there is no single proposal that takes on board all the issues that could be taken into account[1]. This study aims to propose a practical guide ¿USATESTDOWN¿ to measure and evaluate the usability of mobile applications focusing on Down syndrome users and their primary limitations. The study starts with an analysis of existing methodologies and tools to evaluate usability and integrates concepts related to inspection and inquiry methods into a proposal. The proposal includes the opinions of experts and representative users; their limitations, the applicability during the development process and the accessibility. This guide is based on the literature review and the author?s experience in several workshops where persons with Down syndrome used mobile devices.", "num_citations": "3\n", "authors": ["1268"]}
{"title": "Examining the usability of touchscreen gestures for adults with DS\n", "abstract": " This document is part of a global investigation that aims to establish best practices in usability testing of mobile applications, that fit the specific needs of persons with cognitive disabilities. The motivating factor is to improve the quality of life of people with special needs. As a first step, we want to discover what are the skills of people with DS (DS) when using a mobile device. Thanks to its direct manipulation interaction style, multi-touch technology is the ideal mechanism for learning activities with a view to the social inclusion of people with DS. This paper investigates the most common touchscreen gestures on commercial existing software. A commercial analysis was carried out to discover the touch screen gestures used by 103 free software Apps running on a mobile touch screen tablet of 11 where the applications run”. The commercial analysis showed that most applications support tap and drag operations on …", "num_citations": "1\n", "authors": ["1268"]}
{"title": "Usability testing guide for mobile applications focused on people with Down syndrome (USATESTDOWN)\n", "abstract": " Las pruebas de usabilidad de las aplicaciones móviles que involucran a las personas con síndrome de Down es una cuestión que no ha sido exhaustivamente investigada y no hay una sola propuesta que asuma todos los temas que deberían ser tomados en cuenta [1]. Este estudio tiene como objetivo proponer una guía práctica ¨USATESTDOWN¨ para evaluar la usabilidad de las aplicaciones móviles orientadas a usuarios de síndrome de Down y sus principales limitaciones. El estudio comienza con un análisis de las metodologías y herramientas existentes para evaluar la usabilidad e integra los conceptos relacionados con los métodos de inspección e investigación en la propuesta, la misma incluye las opiniones de expertos y usuarios representativos; sus limitaciones, la aplicabilidad durante el proceso de desarrollo y la accesibilidad. Esta guía se basa en la revisión de la literatura y la experiencia del autor en varios talleres donde más de 108 personas con síndrome de Down utilizaron dispositivos móviles con aplicaciones específicas para evaluar diferentes parámetros y destrezas. Una vez creada la guía se procedió a evaluarla en un proceso iterativo con diferentes herramientas y centros especiales para personas con Síndrome de Down. Como resultado de este proceso tenemos una guía robusta y adaptada especialmente a la realidad y necesidades de las personas con DS. ABSTRACT The usability testing of mobile applications involving persons with Down syndrome is an issue that has not be comprehensively investigated and there is no single proposal that takes on board all the issues that could be taken into account [1 …", "num_citations": "1\n", "authors": ["1268"]}