{"title": "A Categorization Model of Requirements Based on Max‐Neef's Model of Human Needs\n", "abstract": " Requirements categorization is an inherent part of the requirements engineering activity. Conventional approaches use a designer perspective (requirements organized according to design needs or attributes), a contractual perspective (requirements organized according to procurement or acquisition needs), or a combination of both. Such models present several inconveniences that result in limitation of system affordability: facilitate the generation of overlapping requirements, of design‐dependent requirements, and of a mix of requirements applicable to different levels of the architecture decomposition or to different products. The present research proposes a Need‐based Categorization (NbC) model that is system‐centric: Requirements are organized around the system. Inspired by Max‐Neef's model of human needs, the proposed model supports requirement elicitation by defining only what the system does …", "num_citations": "43\n", "authors": ["1413"]}
{"title": "The Concept of Order of Conflict in Requirements Engineering\n", "abstract": " Conventional approaches to system design use requirements as boundary conditions against which the design activity occurs. Decisions at a given level of the architecture decomposition can result in the flowing down of conflicting requirements, which are easy to fulfill in isolation but extremely difficult when dealt with simultaneously. Designing against such sets of requirements considerably limits system affordability. Existing research on the evaluation of such conflicts primarily seek to determine the level of conflicts between pairs of requirements. We assert in this paper that these methods are incomplete and using traditional methodologies can result in missing significant conflicts between groups of requirements. We provide a mathematical proof for this assertion and present two case studies that support the mathematical proof. We present the concept of “order of conflict.” The objective of this paper is to prove …", "num_citations": "34\n", "authors": ["1413"]}
{"title": "Using Maslow's hierarchy of needs to define elegance in system architecture\n", "abstract": " Despite the rising interest in developing elegant systems an integral definition of elegance in system architecture and design is lacking. Current attempts have only been able to describe emergent properties of an elegant design or system. This descriptive approach has resulted in evolving definitions and in an inability to use elegance as criteria to evaluate various design candidates. The present research proposes a need-based definition of elegance that aims at being complete yet adaptable, quantifiable, and that allows comparison between different designs or systems. Using Maslow's hierarchy of needs as a paradigm the present research proposes a structural definition that is grounded on the known and unknown needs an elegant system satisfies, rather than on its emergent properties. Specific emergent properties can then be categorized within the structural definition. The benefits of using such type of …", "num_citations": "32\n", "authors": ["1413"]}
{"title": "A contribution to the scientific foundations of systems engineering: Solution spaces and requirements\n", "abstract": " Some researchers have suggested that scientific foundations expressed in a mathematical form are needed to thrust the success of systems engineering as a discipline on its own merit. In order to contribute the development of such systems science, this paper investigates from a foundational standpoint the relationships between stakeholder needs, system requirements, and sets of systems. Various theorems and corollaries are proposed and mathematically proven. The theoretical elements are presented as a foundation for the development of a science for requirements engineering. The proposed foundations are finally tested to mathematically describe, in a rigorous and precise manner, qualities of good requirements, which are otherwise traditionally defined using vague narrative. By showcasing practical examples of the theoretical aspects, the paper is intended to serve as a bridge between …", "num_citations": "31\n", "authors": ["1413"]}
{"title": "Contextual-and behavioral-centric stakeholder identification\n", "abstract": " Proper identification of stakeholders is the first step to bound the system of interest and ultimately to correctly define the problem of concern. Research has traditionally addressed the process of identifying stakeholders using stakeholder-centric methods such as brainstorming (unstructured or with discipline-specific taxonomies). These approaches are grounded on the idea of listing entities that have a relation to the system and then analyze their mutual relationships so that their relative importance with respect to the system can be assessed. Yet, these methods do not provide any mechanism to ensure completeness and thus introduce a high level of uncertainty in the definition of the problem at the beginning of the system life-cycle. The present research proposes instead a contextual- and behavioral-centric approach for stakeholder identification. Using systems thinking the focus is put on understanding all the …", "num_citations": "27\n", "authors": ["1413"]}
{"title": "The Concept of Problem Complexity\n", "abstract": " Recognizing the impact of system complexity on the success of a system's development has created significant research efforts towards measuring system complexity. In particular, the research community has proposed techniques to measure three types of system complexity: (1) structural complexity, which measures the complexity resulting from physical interconnection of components; (2) functional complexity, which measures the complexity resulting from interconnection of system functions; and (3) organizational complexity, which measures the contractual interconnection of the different organizations developing the system. The majority of these metrics focus on measuring aspects of the complexity of an existing system or design. However, a metric to anticipate the complexity induced by the problem itself on a system's development is lacking. We therefore present the concept of Problem Complexity as the …", "num_citations": "26\n", "authors": ["1413"]}
{"title": "A mathematical model of verification strategies\n", "abstract": " The field of systems engineering has recently experienced a new push for unveiling its scientific foundations and using them to inform better practice. The majority of the research effort towards a theory of systems engineering has concentrated on the early phases of the system's lifecycle, especially in the areas of problem formulation and system architecture and design. However, and despite their importance for system success, the design of verification strategies has received little attention. Current work is of procedural nature, providing guidance instead of enabling computation, or is specific to a particular verification case. As a result, the definition of verification strategies in practice continues to be driven by heuristics and best practices. This has shown to be suboptimal. In order to fill in this gap, this paper contributes to the theory of systems engineering with a mathematical model of verification strategies. The …", "num_citations": "22\n", "authors": ["1413"]}
{"title": "Value and benefits of model‐based systems engineering (MBSE): Evidence from the literature\n", "abstract": " Traditional document‐based practices in systems engineering are being transitioned to model‐based ones. Adoption of model‐based systems engineering (MBSE) continues to grow in industry and government, and MBSE continues to be a major research theme in the systems engineering community. In fact, MBSE remains a central element in the International Council on Systems Engineering (INCOSE)’s vision for 2025. Examining systems engineering literature, this paper presents an assessment of the extent to which benefits and value of MBSE are supported by empirical evidence. A systematic review of research and practice papers in major systems engineering archival journals and conference proceedings was conducted. Evidence was categorized in four types, two of which inductively emerged from the results: measured, observed (without a formal measurement process), perceived (claimed without …", "num_citations": "21\n", "authors": ["1413"]}
{"title": "Socio-technical scales in socio-environmental modeling: managing a system-of-systems modeling approach\n", "abstract": " System-of-systems approaches for integrated assessments have become prevalent in recent years. Such approaches integrate a variety of models from different disciplines and modeling paradigms to represent a socio-environmental (or social-ecological) system aiming to holistically inform policy and decision-making processes. Central to the system-of-systems approaches is the representation of systems in a multi-tier framework with nested scales. Current modeling paradigms, however, have disciplinary-specific lineage, leading to inconsistencies in the conceptualization and integration of socio-environmental systems. In this paper, a multidisciplinary team of researchers, from engineering, natural and social sciences, have come together to detail socio-technical practices and challenges that arise in the consideration of scale throughout the socio-environmental modeling process. We identify key paths forward …", "num_citations": "19\n", "authors": ["1413"]}
{"title": "Constructing True Model-Based Requirements in SysML\n", "abstract": " Some authors suggest that transitioning requirements engineering from the traditional statements in natural language with shall clauses to model-based requirements within a Model-Based Systems Engineering (MBSE) environment could improve communication, requirements traceability, and system decomposition, among others. Requirement elements in the Systems Modeling Language (SysML) fail to fulfill this objective, as they are really a textual requirement in natural language as a model element. Current efforts to directly leverage behavioral and structural models of the system lack an overarching theoretical framework with which to assess the adequacy of how those models are used to capture requirements. This paper presents an approach to construct true model-based requirements in SysML. The presented approach leverages some of SysML’s behavioral and structural models and diagrams, with specific construction rules derived from Wymore’s mathematical framework for MBSE and taxonomies of requirements and interfaces. The central proposition of the approach is that every requirement can be modeled as an input/output transformation. Examples are used to show how attributes traditionally thought of as non-functional requirements can be captured, with higher precision, as functional transformations. View Full-Text", "num_citations": "18\n", "authors": ["1413"]}
{"title": "Capturing the information dependencies of verification activities with Bayesian networks\n", "abstract": " Verification activities provide the evidence of contractual fulfillment in the engineering of systems. Thus, the importance of adequately defining verification activities in any acquisition program is unquestionable. Its significance extends beyond contracting though. A major portion of the development financial budget is spent in executing verification activities, and verification activities are the main vehicle in discovering knowledge about the system, which is key to reduce development risk. Hence, it is important to optimize verification activities so that a given level of confidence about the proper functioning of the system is achieved with minimum investment. Current approaches to optimize verification strategies assume that a verification activity contributes to an absolute increase or decrease in such confidence. That means that the confidence generated by a verification activity is independent of the past or …", "num_citations": "16\n", "authors": ["1413"]}
{"title": "Defining Better Test Strategies with Tradespace Exploration Techniques and Pareto Fronts: Application in an Industrial Project\n", "abstract": " Test strategies are usually defined following a point‐design like method. Starting with a set of verification requirements and programmatic constraints, and usually with a generic test sequence, a baseline test approach is defined. Then, the baseline is optimized until an acceptable strategy is found. Academia has consistently shown however the benefits of using tradespace exploration techniques instead of point‐based designs. Some industrial applications seem to corroborate such findings. Yet, both academia and industry have limited the use of tradespace exploration techniques to selecting design concepts. This paper proposes that broadening the use of tradespace exploration techniques and Pareto frontiers to other activities in the field of systems engineering domain yields similar benefits. In particular, this paper presents the actual application of tradespace exploration techniques and Pareto frontiers in an …", "num_citations": "16\n", "authors": ["1413"]}
{"title": "Elemental patterns of verification strategies\n", "abstract": " This paper proposes a set of seven elemental patterns of verification strategies. These patterns can be useful in modeling verification strategies in a wide range of engineered systems. They form the building blocks under which any verification strategy can be modeled. The patterns lead to a fundamental understanding of the interplay between system parameters and verification activities, as well as an understanding of the mechanisms by which verification evidence builds up. For each pattern, we provide a description and a few examples of its application. A few important theoretical properties of the corresponding set of patterns are discussed, such as belief update, inferential properties, and graph disconnection, as well as some practical guidance to be taken into account when applying them to authentic verification problems. These patterns are intended to be a useful tool for researchers, practitioners, and …", "num_citations": "14\n", "authors": ["1413"]}
{"title": "Improving the Systems Thinking Skills of the Systems Architect via Aesthetic Interpretation of Art\n", "abstract": " Systems engineering has been considered for a long time both an art and a science. In fact, previous work has shown that principles and practices of systems engineering are exhibited in the creation of a film original score, a major artistic endeavor, and that some of the concepts employed in artistic painting to convey beauty are also used by system architects to reduce complexity and achieve elegance. Reflecting on the authors' experience as practitioners and educators of systems thinking and systems architecting, this paper discusses a common linkage between art and systems engineering through a third discipline, systems thinking, which has a unique role in helping us understand the dynamic nature of complex systems. Then we elaborate a learning model that relates art, systems thinking, and systems architecture, which results in a number of propositions to improve the systems thinking skills of systems …", "num_citations": "14\n", "authors": ["1413"]}
{"title": "Properties of the Utility of Verification\n", "abstract": " Verification is an essential aspect of systems engineering. Verification activities provide evidence that the system under development does what it was anticipated to do. In acquisition programs, verification activities provide evidence of contractual fulfilment. In fact, a major financial portion of system development is spent towards designing and executing a verification strategy. However, the design of verification strategies in current practice is often prescribed by standards and driven by good practices and gut feeling. Quantitative approaches to design verification strategies could yield significant improvement to their effectiveness and coverage. Understanding how verification contributes to a system's expected utility is necessary to enable such transformation. This paper presents four key properties of the utility of verification: the meaning of verification from an epistemological standpoint; the representation of …", "num_citations": "13\n", "authors": ["1413"]}
{"title": "Abandonment: A natural consequence of autonomy and belonging in systems-of-systems\n", "abstract": " A key element differentiating traditional systems from systems of systems is governance. While systems are characterized by belonging to a single governing authority, systems within a system of systems are often independently governed or governed by fully empowered entities. Such independence is a necessary condition for the autonomy of each constituent system and for enabling the concept of belonging. At the same time, the capability to be autonomous and the voluntary nature of belonging, enables a constituent system to voluntarily abandon the system of systems it belongs to as well. Yet, research has not addressed so far the implications and modeling of intended abandonment into the operational effectiveness of a system of systems. This paper presents the concept of system abandonment as a philosophical necessity in the definition of systems of systems, it discusses some visions to measure the risk of …", "num_citations": "13\n", "authors": ["1413"]}
{"title": "The tension matrix and the concept of elemental decomposition: Improving identification of conflicting requirements\n", "abstract": " Conventional approaches to system design use requirements as boundary conditions against which the design activity occurs. Decisions at a given level of the architecture decomposition can result in a flowing down of conflicting requirements, which are easy to fulfill in isolation but extremely difficult when dealt with simultaneously. Designing against such sets of requirements considerably limits system affordability. Conventional approaches to identifying these conflicts are either time efficient, yet ineffective, or effective, but time consuming. This paper proposes a novel method that sits between those extremes. It enables quick identification of conflicts, while still maintaining a good level of effectiveness. The proposed method, which is called the tension matrix, is built on three pillars: 1) heuristics to identify conflicting requirements, aimed at reducing completeness uncertainty; 2) targeted modeling; and 3) elemental …", "num_citations": "12\n", "authors": ["1413"]}
{"title": "Reducing Excess Requirements Through Orthogonal Categorizations During Problem Formulation: Results of a Factorial Experiment\n", "abstract": " Problem formulation lays at the heart of systems engineering. While an over-constrained solution space may yield no satisficing solution affordably, properly defined solution spaces may enable developing solutions with high levels of affordability. Therefore, effective requirement elicitation from stakeholder needs is key to achieve a proper definition of the problem to be solved. Categorizing requirements according to predefined taxonomies is an inherent part of this activity and they are as diverse as engineering industries are. Conventional approaches, which use a designer-perspective, a contractual perspective, or a combination of both, facilitate the generation of excess facilitate the generation of excess requirements during requirements elicitation due to promoted design biases and overlaps between the different categories. In order to mitigate those problems, orthogonal, system-centric categorization methods …", "num_citations": "12\n", "authors": ["1413"]}
{"title": "A research on measuring and reducing problem complexity to increase system affordability: From theory to practice\n", "abstract": " Requirement engineering is the cornerstone of systems engineering. Numerous large scale engineered systems face schedule delays, cost overruns and performance shortfalls that can be traced back to the requirements they need to fulfill. In fact, previous research has demonstrated strong relationship between requirements and systems affordability. This paper summarizes and puts into context the authors’ novel contributions in three domains of requirements engineering: systems theory, complexity science, and systems methodologies. The authors propose new theorems and their proofs on requirements affecting affordability, propose a new complexity metric at requirement stage that measures the complexity limit of the system at conceptual stage (even before a specific design is determined), and propose two methodologies to elicit excess-free requirement sets and to identify conflicting requirements more …", "num_citations": "12\n", "authors": ["1413"]}
{"title": "Systems thinking and mathematical problem solving\n", "abstract": " Problem solving lies at the core of engineering and remains central in school mathematics. Word problems are a traditional instructional mechanism for learning how to apply mathematics to solving problems. Word problems are formulated so that a student can identify data relevant to the question asked and choose a set of mathematical operations that leads to the answer. However, the complexity and interconnectedness of contemporary problems demands that problem‐solving methods be shaped by systems thinking. This article presents results from three clinical interviews that aimed at understanding the effects that traditional word problems have on a student’s ability to use systems thinking. In particular, the interviews examined how children parse word problems and how they update their answers when contextual information is provided. Results show that traditional word problems create unintended …", "num_citations": "11\n", "authors": ["1413"]}
{"title": "Painting Systems: From Art to Systems Architecting\n", "abstract": " Systems engineering has successfully contributed to develop complex systems in industries such as defense, space, energy, or transportation. Systems in those industries have in common their engineered or socio‐technical natures. However, systems engineering has been understood for a long time as both an art and a science. As a matter of fact, principles and practices of systems engineering have been exhibited in the creation of film original score, a major artistic endeavor. Therefore, it is sensible to investigate if and how the similarities and differences between the application of systems engineering in the development of engineered systems and the pursue of artistic endeavors can help in improving the understanding and practice in both domains. Specifically, this paper discusses how the same concepts are applied in artistic painting and in system architecture to reduce complexity and achieve elegance.", "num_citations": "11\n", "authors": ["1413"]}
{"title": "Adaptive Requirements Prioritization (ARP): Improving Decisions between Conflicting Requirements\n", "abstract": " Prioritization of requirements is a core activity of requirements engineering. Conventionally used to resolve conflicting requirements, it can be performed on a wide variety of attributes, reflecting, for example, stakeholder value, value to business, cost, connectivity, or risk. Its benefit in decision making is unquestionable, yet existing techniques are ineffective for realistic sets of requirements and consequently their adoption by practitioners is scarce, particularly in the fields of hardware‐intensive systems. The present research proposes an Adaptive Requirements Prioritization (ARP) method that improves decision making between conflicting requirements due to its principles of multidimensionality and objective‐base (the right criteria are used for any particular decision), and its usability due its principles of openness (it can be tailored according to specific project needs) and structure (requirements are grouped in …", "num_citations": "10\n", "authors": ["1413"]}
{"title": "A Concept for Set‐based Design of Verification Strategies\n", "abstract": " In current practice, a verification strategy is defined at the beginning of an acquisition program and is agreed upon by customer and contractor at contract signature. Hence, the resources necessary to execute verification activities at various stages of the system development are allocated and committed at the beginning, when a small amount of knowledge about the system is available. However, contractually committing to a fixed verification strategy at the beginning of an acquisition program fundamentally leads to suboptimal acquisition performance. Essentially, the uncertain nature of system development will make verification activities that were not previously planned necessary, and will make some of the planned ones unnecessary. In order to cope with these challenges, this paper presents an approach to apply set‐based design to the design of verification activities to enable the execution of dynamic contracts …", "num_citations": "9\n", "authors": ["1413"]}
{"title": "Exile: A natural consequence of autonomy and belonging in systems-of-systems\n", "abstract": " Governance is one of the key differentiating elements between traditional systems and systems of systems. While systems are governed by a single authority, systems within a system of systems are often independently governed or governed by fully empowered entities. Such independence is a necessary condition for the autonomy of each constituent system and for enabling the concept of belonging. At the same time, the capability to be autonomous and the voluntary nature of belonging, enables a system of systems to voluntarily expel or exile one or more of its constituent systems. Yet, research has not addressed so far the implications and modeling of potential exile into the operational effectiveness of a system within a system of systems and its impacts on the engineering of systems of systems. This paper presents the concept of system exile as a philosophical necessity in the definition of systems of systems, it …", "num_citations": "9\n", "authors": ["1413"]}
{"title": "Systems Engineering Practices Exhibited in the Creation of a Film Original Score\n", "abstract": " Systems engineering has been successfully applied to a wide variety of industries, which include defense, space, energy, or transportation. All those systems have in common that they are engineered systems and/or socio‐technical ones. Yet, systems engineering is considered both an art and a science. Therefore, could systems engineering be or have been applied in the domain of art, even if not done explicitly? Being one of the authors of this paper a systems engineer and the other one a music composer, this paper reports on the reflections of mutual discussions about how each of us of carried out our activities in our respective domain. Interestingly, it turns out that engineering a space system and creating a film original score abstractly follow the same set of principles and practices.", "num_citations": "9\n", "authors": ["1413"]}
{"title": "Conceptualization of a T‐Shaped engineering competency model in collaborative organizational settings: Problem and status in the Spanish aircraft industry\n", "abstract": " There are persistent factors associated with ineffective systems engineering practice inherent in interdisciplinary teams. In this context, technical silos seem to be prevalent. The concept of team‐based competencies emerges as a paradigm to facilitate effective collaborative interactions between technical specialists during a system's development. In particular, the T‐Shaped competency model, while addressing the individual member, embodies the paradigm of complementing competencies of team members. In this way, specialty engineers could see their profiles complemented with a relevant self‐awareness of the potential systemic impact of their particular tasks. Literature suggests that such self‐awareness could improve their capacities to cross disciplinary borders, to move easily between the detailed level and the bigger picture of the system, and to interact better with other branches of engineering. Hence …", "num_citations": "8\n", "authors": ["1413"]}
{"title": "On the evolution of solution spaces triggered by emerging technologies\n", "abstract": " The term solution space is widely used in the engineering community; yet there is little known about their evolution. Theoretical research in the field of systems science indicates that requirements can only reduce the solution space. Yet, some authors state that on the contrary requirements can be used to expand to or open new solution spaces. Furthermore, some practitioners defend that the requirement to use a previously nonexistent technology would actually increase the solution space or move it to a new area, while others state that more requirements make life more difficult. Who is right then? The present paper provides initial answers to this question using systems theory. In order to achieve this, the present paper differentiates between various types of solutions spaces, which depend on the systems they include. Finally, the paper provides practical examples to showcase the results of the theoretical findings …", "num_citations": "8\n", "authors": ["1413"]}
{"title": "The Need for Semantic Extension of SysML to Model the Problem Space\n", "abstract": " Requirements in natural language, like shall statements, while commonly used, present inherent limitations in terms of accuracy and precision. Modeling requirements within a Model-Based Systems Engineering (MBSE) framework shows promise to cope with these issues. Common approaches include either the definition of textual requirements as model objects or the flagging of system models as requirements. The first approach inherits the weaknesses of natural language. We show in this paper that the second approach necessarily leads to a poor set of requirements. We therefore argue that modeling languages, in particular SysML, need to be semantically extended to adequately model the problem space. We demonstrate with a specific example that simply flagging model elements as requirements is not effective to model the problem space. In fact, we show that such an approach produces a deficient definition of the problem space, since it inherently discards solutions that could otherwise be potentially acceptable to solve the problem that is being addressed. In addition, we leverage this example to discuss potential semantic extensions of SysML that could enable adequate modeling of the problem space that fulfills the formal conditions of good requirements.", "num_citations": "7\n", "authors": ["1413"]}
{"title": "Elegant space systems: How do we get there?\n", "abstract": " Can the space industry produce elegant systems? If so, how? Space systems development has become process-centric, e.g., process creation or modification is the default response to most development and/or operations challenges when problems are encountered. But is that really effective? An increasing number of researchers and practitioners disagree with such an approach and suggest that elegance is as important to a system and its operation as fulfillment of technical and contractual requirements; consequently they are proposing a review and refreshment of the systems engineering practice. Elegance is generally recognizable, but hard to achieve deterministically. The research community has begun an endeavor to define what elegance is in systems engineering terms, find ways to measure or at least characterize it, and create or adapt philosophies and methodologies that promote elegance as a design …", "num_citations": "7\n", "authors": ["1413"]}
{"title": "Elegance as Complexity Reduction in Systems Design\n", "abstract": " Elegance is often invoked as a characteristic of good design, but it cannot be pursued as a design objective because of the absence of actionable definitions that can be translated into design strategies and metrics. In this work, we analyze elegance in the context of systems engineering using a perspective that integrates visual art, Gestalt psychology, neuroscience, and complexity theory. In particular, we measure elegance as effective complexity and theorize that it can be achieved by a process of complexity resolution based on the adoption of eight visual heuristics. We present an empirical study in which a sample of systems engineers were asked to assess alternative representations of a same system and show that effective complexity is strongly correlated to perceived elegance and systems effectiveness. Our results are consistent with independent findings obtained in other fields including design and psychology of perception showing that good design must embed an effective level of complexity achievable through a mix of familiarity and novelty.", "num_citations": "6\n", "authors": ["1413"]}
{"title": "Applying tradespace exploration to verification engineering: From practice to theory and back again\n", "abstract": " Designing effective verification strategies is instrumental for succeeding in system development. Verification can be used to confirm customer demands have been met, to ensure that the as-built system is consistent with its as-designed baseline, and to reduce development risks during a system’s lifecycle. For systems that are developed in stages and decomposed in lower level elements, verification can occur at different points in time and at different levels of abstraction. Considering the development time of many large-scale systems and that system decomposition often encompasses eight levels of abstraction and more, optimizing a verification strategy to minimize development risk and verification cost is non-trivial. However, current state of practice relies on non-normative approaches such as qualitative assessments from subject matter experts, which puts into question the optimality of the resulting verification strategies. In order to overcome such limitations, tradespace exploration was previously applied ad-hoc in an actual industrial project, yielding positive results. Yet, it also informed the need for transformative research that makes its application generalizable. Using such practical application as a starting point, this paper presents initial theoretical aspects of verification engineering and applies them in a notional case as a proof of concept. Then, it sets forth a research agenda on those foundational aspects and discusses how they can be transitioned to improve systems engineering practice.© 2016 Alejandro Salado.", "num_citations": "6\n", "authors": ["1413"]}
{"title": "Increasing the Probability of Developing Affordable Systems by Maximizing and Adapting the Solution Space\n", "abstract": " The present research suggests that the size of the solution space, which for a given set of stakeholder needs is delimited by system requirements, relates to the probability of finding affordable solutions. As a result, the effectiveness of tradespace exploration techniques is limited by its size and internal ordering. Therefore, we suggest that there exist models to elicit and use requirements that, for a given set older needs, could facilitate the maximization of the solutionof stakehspace so that the probability of finding more affordable solutions during tradespace exploration is also maximized.The present research proposes a mathematical model of the requirements elicitation process that facilitates defining performance objectives for the requirements elicitation process in striving for system affordability. The uniqueness of this research lays on two elements. First, the requirements elicitation process is mathematically …", "num_citations": "6\n", "authors": ["1413"]}
{"title": "Assessing the impacts of uncertainty propagation to system requirements by evaluating requirement connectivity\n", "abstract": " Although theoretically independent, requirements within a decomposition level of a system architecture are not isolated elements. For an existing design, a change of a requirement may endanger or facilitate fulfillment of other requirements within the same level of the decomposition. The present research suggests a requirement connectivity metric to evaluate the potential consequences that changing a requirement may have on a system with respect to fulfillment of other requirements. A particular aspect of the present research is the assumption that connectivity accounts only for requirements within the same decomposition level of an architecture, not for those flowing up or down the decomposition. The metric is used to evaluate different cases in which requirements are changed due to triggering of uncertain events during a project life‐cycle.", "num_citations": "6\n", "authors": ["1413"]}
{"title": "A perspective on systems thinking, architecting, and art\n", "abstract": " Systems architecture has been considered as both an art and a science. The systems architect uses heuristics, stories, and models to communicate complex architectural concepts to stakeholders. Since the earliest times, master building architects have developed their skills broadly across the technical, business, and fine art domains. Why should engineering be different? Principles and practices of systems architecture are exhibited in the creation of film scores, fine arts, and building architecture. Why not teach art as a core skill of the systems architect? In this work, we explore a formal competency model linking art, systems thinking, and systems architecture. We associate competencies across these domains with the concept of elegant design. We explore formal education in the arts as a way to bridge the communication problems that technical architects have with their stakeholders. The goal is to improve the …", "num_citations": "5\n", "authors": ["1413"]}
{"title": "Art and architecture: Effectively communicating models of systems\n", "abstract": " Systems architecting has been considered for a long time both an art and a science. The systems architect uses heuristics, stories, and models to communicate complex architectural concepts to stakeholders. As adoption of model-based systems engineering grows, and digital models of system architecture increase in use, there is a danger that the communications gap between system architects and the stakeholders they are working for will grow. Previous work created a competency model exploring the link between art, systems thinking, and systems architecture. A further conference panel entitled \"If architectures are so useful, why are they so seldom used?\" inspired a discussion of the growing communications gap between the system architect as modeler and the system architect as communicator. Decision makers cannot read and interpret formal system models. However, principles and practices of systems …", "num_citations": "5\n", "authors": ["1413"]}
{"title": "Decision-making, information seeking, and compromise: A simulation game activity in global industrial management\n", "abstract": " In undergraduate engineering education, students are often overexposed to problem-solving methods that are unrepresentative of how problems are solved in engineering practice. For decision-making problems in particular, students are commonly taught to compare alternative solutions using information that is known and provided. However, many real-world decision-making problems require a broader range of problem-solving strategies, including information seeking, extrapolation of a decision’s consequences, and compromise between parties with competing objectives. Accordingly, this paper describes a simulation game activity designed to offer industrial engineering seniors experience in solving realistic decision-making problems. The simulation game involved students working in teams that role-played as different types of companies in a global smartphone market, where teams needed to negotiate with one another to establish profitable contracts within the game’s ruleset. In accordance with our learning objectives, we qualitatively examined how students sought information, adapted to changing conditions, and made decisions informed by constraints. Particularly, we sought to identify learning frameworks that fit the data well and would help us improve the design and assessment of the activity in later iterations. We found that the learning frameworks of metacognition and discrepancy resolution combined to explain most student activity relative to our learning objectives, and these frameworks suggest several points of improvement for the design and assessment of the simulation game.", "num_citations": "5\n", "authors": ["1413"]}
{"title": "Integrating design and verification decisions in value-driven design to increase system's expected value\n", "abstract": " Design and verification are conceived in current practice and research as two sequential decisions or optimization efforts. In the first one, a design is optimized (or chosen) by maximizing the expected value to a set of stakeholders, which is a function of its characteristics, and the preferences of the stakeholders. In the second one, a verification strategy is optimized (or chosen) for the selected design by maximizing its own expected value, which is a function of the development uncertainty it reduces, the cost and time it requires, its effects on the system’s characteristics, and the risk preferences of the stakeholders. This paper asserts that because verification activities modify the uncertainty associated to the characteristics of a system and consume its development resources, they actually influence the expected value of the system. Consequently, this paper proposes that design and verification decisions should be taken concurrently instead of sequentially in order to increase the expected value a system; pushing thus further the notion that verification should inform the design of a system with respect to embedding elements that enable and ease verification. Contributing to the scientific foundations of systems engineering, the paper mathematically proves that optimizing a verification strategy for a pre-optimized, baseline design can yield suboptimal results, in terms of system expected value, when compared against that obtained by concurrently optimizing design and verification. Using value-driven design as an underlying framework, the implications of this analytical finding are then showcased by a comparative analysis in which a notional system …", "num_citations": "5\n", "authors": ["1413"]}
{"title": "Efficient and effective systems integration and verification planning using a model-centric environment\n", "abstract": " There is an increasing interest in Model‐Based Systems Engineering (MBSE) practices in academia and industry. The majority of research and adoption in industry is relevant to the early phases of the system life‐cycle, where model‐based design is expected to provide improved results during system development. However, little attention has been paid to the application of such methodology to later phases of the development, and in particular to system integration and verification of the actual manufactured system, which continues to be done in the traditional document‐centric environment. This paper proposes a model‐centric environment for system integration and verification activities at the end of the development cycle and presents benefits in effectiveness and efficiency in planning system integration and verification activities for a system under a model‐centric environment.", "num_citations": "5\n", "authors": ["1413"]}
{"title": "A systems‐theoretic articulation of stakeholder needs and system requirements\n", "abstract": " The literature shows disparities in how fundamental systems engineering concepts in the area of requirements engineering, such as stakeholder needs, system requirements, requirements elicitation, requirements derivation, and requirements decomposition, are used within the communities‐of‐practice and in research. Such disparities can lead to conceptual and application inconsistencies, which have been shown to contribute to the formulation of poor requirements. In this paper, such concepts are articulated using systems theory as the underlying theoretical framework. The concepts of problem space, solution space, open system, and closed system are central to this work. It is argued that the proposed articulations facilitate avoiding usage disparity, ultimately resulting in better formulation of requirements. These articulations are supported by in‐depth examples that comprehensively cover different types of …", "num_citations": "4\n", "authors": ["1413"]}
{"title": "Definition of New Space—Expert Survey Results and Key Technology Trends\n", "abstract": " This article presents the results of an expert survey aimed at defining the concept of New Space. New Space is a blurry concept which is oftentimes confused with other key ideas, such as the commercialization of space activities, or the use of miniaturized technology (such as CubeSats) in space missions design and implementation. Our expert survey reveals that the three key characteristics defining New Space are instead customer focus, new product development approaches, and new business models (private versus institutional investors). This article provides a semi-quantitative comparison of these characteristics, which we define as traits, which are used to distinguish between New Space and legacy space activities. Based on the results of the comparison and literature search, we provide a brief discussion of key technology trends emerging in New Space, namely, on autonomy, miniaturization, platforms, and …", "num_citations": "4\n", "authors": ["1413"]}
{"title": "Lessons Learned from a First Attempt to Teach Systems Engineering as a Studio Art Class\n", "abstract": " Systems engineering is often described as both an art and a science, yet courses on the subject are often structured like traditional engineering science courses. Prior studies have explored the principles and practices that are common between systems engineering and major artistic endeavors and suggested that systems engineering courses could build upon this connection. In prior work, we described an approach for teaching systems architecture using methods from a studio art class, including classroom set-up, lesson structure, and course structure. This paper is the follow-up study to this proposal, in which we have implemented the proposed course format in an introductory course for graduate students in systems engineering. The studio art format was used in the second half of the semester to teach topics including problem formulation and system architecture.", "num_citations": "4\n", "authors": ["1413"]}
{"title": "Can Wymore’s Mathematical Framework Underpin SysML? An Initial Investigation of State Machines\n", "abstract": " Model-based system engineering (MBSE) has been suggested to have significant benefits to include early verification and validation cycles and predictive analytics. Multiple languages for modeling the engineering of systems exist; the most widely used being Systems Modeling Language (SysML). SysML is descriptive in nature, meaning it contextualizes the relationships in the system model. While this is useful, it lacks a rigorously established mathematical framework that would allow for understanding of emergent behavior, pattern recognition, vulnerability assessment, and a scientific approach to modeling of systems among other capabilities. An internally consistent mathematical framework for MBSE was proposed by Wayne Wymore in 1993, which may provide what is necessary to overcome the descriptive limitation of SysML. In this article, we perform an initial assessment of the feasibility of underpinning …", "num_citations": "4\n", "authors": ["1413"]}
{"title": "Implementing Value-Driven Design in Modelica for a racing solar boat\n", "abstract": " Research has shown that current design approaches, such as requirement-based design or cost as independent variable (CAIV), may fundamentally yield suboptimal designs. In response to the need for better systems, new design techniques that are based on optimization and decision-making have been proposed. In this paper, we show how Modelica can be used to implement and operationalize value-driven design (VDD) in concept selection. Modelica’s object-oriented strengths are employed to model design alternatives and its capability to execute Monte Carlo simulation enables the introduction of uncertainty in models and assessment. The proposed approach has been applied to the conceptual design of an unmanned, autonomous solar powered boat, which is aimed at racing in a student competition. Value has been defined as a function of the probability to win the said race, which expands usual …", "num_citations": "4\n", "authors": ["1413"]}
{"title": "Expert Opinion Fusion Framework Using Subjective Logic for Fault Diagnosis.\n", "abstract": " Fault diagnosis plays a critical role in maintaining and troubleshooting engineered systems. Various diagnosis models, such as Bayesian networks (BNs), have been proposed to deal with this kind of problem in the past. However, the diagnosis results may not be reliable if second-order uncertainty is involved. This article proposes a hierarchical system diagnosis fusion framework that considers the uncertainty based on a belief model, called subjective logic (SL), which explicitly deals with uncertainty representing a lack of evidence. The proposed system diagnosis fusion framework consists of three steps: 1) individual subjective BNs (SBNs) are designed to represent the knowledge architectures of individual experts; 2) experts are clustered as expert groups according to their similarity; and 3) after inferring expert opinions from respective SBNs, the one opinion fusion method was used to combine all opinions to …", "num_citations": "3\n", "authors": ["1413"]}
{"title": "Digital engineering metrics\n", "abstract": " Systems Engineering Research Center Page 1 SSRR 2019 November 19, 2019 1 Digital Engineering Metrics Sponsor: OUSD(R&E) By Tom McDermott, Nicole Hutchison, Mark Blackburn, Annie Yu, Neal Chen (Stevens) Eileen Van Aken, Alejandro Saledo, Kaitlin Henderson (Va Tech) 11th Annual SERC Sponsor Research Review November 19, 2019 FHI 360 CONFERENCE CENTER 1825 Connecticut Avenue NW, 8th Floor Washington, DC 20009 www.sercuarc.org Page 2 SSRR 2019 November 19, 2019 2 • 2018: SERC Project RT-182 conceptually modeled the 5 goals of the DoD DE Strategy to identify necessary acquisition enterprise changes • 2019: Addressing multiple OUSD/RE research priorities: —DE Metrics (WRT-1001), determine critical ROI measures and improved SE value indicators —Model Curation (WRT-1009), curation practices, enablers, and technical innovation opportunities —DE Workforce (…", "num_citations": "3\n", "authors": ["1413"]}
{"title": "Reality gaps in industrial engineering senior design or capstone projects\n", "abstract": " Undergraduate Senior Design or Capstone Projects (SDP) are intended to provide a culminating experience for undergraduate students. In SDP’s, students are expected to put into practice their engineering competences to solve a realistic problem. Realism is pursued by setting up boundary conditions that mimic to some extent those found in the corporate world. For example, projects are defined by an external company that acts as a sponsor or client, last between one and two semesters, are carried out in teams, and, in some cases, are vaguely defined. Moreover, students are often requested to complete various stages of the system’s lifecycle, including formulating the problem, conceptualizing the solution, implementing a solution in part or whole, and presenting the solution to the client. However, while these project conditions provide a decent surrogate of a real industrial problem, students’ solutions are purely academic: They lack key elements that any engineering solution to a real problem should have. For example, students’ solutions tend to be deterministic, assume seamless implementation and adoption, do not create unintended consequences, and are free of risks. Furthermore, these weaknesses are not identified in the evaluation of projects because assessments remain academic. They focus on evaluating if industrial engineering tools and methods have been properly used, and if the development process described in class has been followed. However, evaluating the value of an engineering solution in the corporate world is driven by the identification of worst-and best-cases, the contextualization of the solution within ranges of …", "num_citations": "3\n", "authors": ["1413"]}
{"title": "Understanding how problem formulation in systems engineering influences system affordability: a systems thinking investigation\n", "abstract": " Systems engineering is promoted as the engineering discipline that facilitates success in the development of large-scale systems; yet these continue to significantly fail in all major dimensions: performance, cost, and schedule. Requirements are the cornerstone of this discipline because they often set the boundary conditions on which systems are developed, but their capability to influence system affordability seems questionable. The present research explores current practices of requirements engineering and, using systems thinking, investigates how they influence system affordability. A set of measures is proposed by the authors that would enable an active use of requirements engineering to facilitate the development of affordable systems.", "num_citations": "3\n", "authors": ["1413"]}
{"title": "A set of heuristics to support early identification of conflicting requirements\n", "abstract": " Conventional approaches to system design use requirements as boundary conditions against which the design activity occurs. Decisions at a given level of the architecture decomposition can result in the flowing down of conflicting requirements, which are easy to fulfill in isolation but extremely difficult when dealt with simultaneously. Designing against such sets of requirements considerably limits system affordability. Identification of such conflicts is usually performed in industry by subject matter experts. Such evaluations are primarily driven by experience. As a result, effectiveness in identifying conflicting requirements is strongly dependent on the person making the assessment. We propose in this paper a set of heuristics that supports identification of conflicting requirements by providing direction and focus in the identification effort. The heuristics have been derived from a combination of literature review and …", "num_citations": "3\n", "authors": ["1413"]}
{"title": "An Effective Approach to Explore Conceptual Solutions in Systems of Systems\n", "abstract": " The architecting and development of systems of systems is highly complex. As a result, traditional methods based on point design approaches and detailed compliance analyses become highly ineffective. In addition, such approaches present a major drawback: it is impossible to know or even to assess with a sufficient level of confidence whether the projected solution lays within an optimal region in the solution space. Aiming at coping with complexity in a more effective manner when addressing systems of systems, this paper presents a 4-element framework that has been successfully applied to the architecting of the Space Weather System of Systems. In particular, the framework encompasses the following elements:(1) Architectural patterns were employed to define the set of potential architectures;(2) Morphological boxes were employed to define all instantiated architectures or system designs;(3) Tradespace exploration was employed to identify the Pareto frontier, ie, the set of optimal solutions within the solution space; and (4) Normalisation of key requirements was employed to avoid regression to the mean flaws when performing comparative analyses between different architectures. In addition, this methodology was supported by simple system models and fast simulation tools, based on automating performance computation and architecture generation.", "num_citations": "3\n", "authors": ["1413"]}
{"title": "Fractionated Space Systems: Decoupling Conflicting Requirements and Isolating Requirement Change Propagation\n", "abstract": " The fractionated space systems vision can potentially provide various levels of flexibility and adaptability that make a space system capable of overcoming a number of uncertain scenarios during its development and operational lifetime. Significant research is being performed on the benefits and drawbacks of such systems under operational scenarios, but their capabilities during development phase remain rather unknown. This paper evaluates how fractionated space systems can respond to requirements change during their development with higher level of adaptability and, specifically, how fractionation can facilitate the detection and resolution of conflicting requirements. We will also study how fractionation helps in isolating the effects of change propagation in requirements during system development. We suggest two frameworks for those purposes, which in addition provide analytical capabilities to evaluate …", "num_citations": "3\n", "authors": ["1413"]}
{"title": "Taxonomy and Categorization of Uncertainties in Space Systems with an Application to the Measurement of the Value of Adaptability\n", "abstract": " Space systems face multiple types of uncertainties from the design phase through production, testing, launch, operation and retirement of the space system that challenge the mission success in multiple dimensions and aspects. Therefore proper identification, classification, categorization and management of uncertainties are necessary in understanding the environment that space systems are embedded and also essential in identifying the adaptable designs, architectures, or solutions. Given the ever increasing dynamic environment of current space systems, sources of uncertainties are considerably diverse and therefore make proper identification and management a crucial part of design and operation of adaptable and Flexible Space Systems. This paper aims on a thorough and holistic taxonomy and categorization of space systems uncertainties for the purpose of keeping track of uncertainties and facilitate …", "num_citations": "3\n", "authors": ["1413"]}
{"title": "True Model-Based Requirements (TMBR): Application to an Earth Observation Satellite\n", "abstract": " The capture of system requirements with accuracy and precision remains a challenge for space systems. There is fundamental reliance within current research efforts on natural language (shall statements), which is inherently ambiguous, and thus unable to capture the problem space accurately and precisely. In this article, we suggest an approach to modeling the requirements that leverages forma modeling and system theoretic construct as opposed to reliance on natural language. The proposed approach, specifically, extends structural and behavioral model elements of the Systems Modeling Language (SysML) through definition of a solution space in system-theoretic context. We consider a system to be a transformation of inputs into outputs; and as such model the problem space as a required set of transformation of inputs into outputs. The application of the proposed model-based requirements approach is …", "num_citations": "2\n", "authors": ["1413"]}
{"title": "Coordination of verification activities with incentives: a two-firm model\n", "abstract": " In systems engineering, verification activities evaluate the extent to which a system under development satisfies its requirements. In large systems engineering projects, multiple firms are involved in the system development, and hence verification activities must be coordinated. Self-interest impedes the implementation of verification strategies that are beneficial for all firms while encouraging each firm to choose a verification strategy beneficial to itself. Incentives for verification activities can motivate a single firm to adopt verification strategies beneficial to all firms in the project, but these incentives must be offered judiciously to minimize unnecessary expenditures and prevent the abuse of goodwill. In this paper, we use game theory to model a contractor-subcontractor scenario, in which the subcontractor provides a component to the contractor, who further integrates it into their system. Our model uses belief …", "num_citations": "2\n", "authors": ["1413"]}
{"title": "Is verifying frequently an optimal strategy? A belief-based model of verification\n", "abstract": " Verification activities increase an engineering team’s confidence in its system design meeting system requirements, which in turn are derived from stakeholder needs. Conventional wisdom suggests that the system design should be verified frequently to minimize the cost of rework as the system design matures. However, this strategy is based more on experience of engineers than on a theoretical foundation. In this paper, we develop a belief-based model of verification of system design, using a single system requirement as an abstraction, to determine the conditions under which it is cost effective for an organization to verify frequently. We study the model for a broad set of growth rates in verification setup and rework costs. Our results show that verifying a system design frequently is not always an optimal verification strategy. Instead, it is only an optimal strategy when the costs of reworking a faulty design …", "num_citations": "2\n", "authors": ["1413"]}
{"title": "Integrating Reliability in Systems Engineering Management\n", "abstract": " Understanding how engineering disciplines, activities, and artifacts are connected between them is key to success as an engineering manager. However, engineering managers are often unaware of these relationships in the area of reliability engineering. This results in omitting necessary reliability activities, incorrectly executing them, and/or executing them at the wrong time. This paper discusses how reliability activities effectively integrate in the system’s life cycle, enabling engineering managers to understand what has to be done, when and why, from a reliability point of view. We contend that this understanding facilitates communication between systems engineers and reliability experts. Eight real cases are presented to show the negative consequences of managing engineering projects without a systemic understanding of reliability. Based on such experience, a number of recommendations are given for …", "num_citations": "2\n", "authors": ["1413"]}
{"title": "Why Not Teaching Systems Architecture as a Studio Art Class?\n", "abstract": " Systems architecture is both an art and a science. Its scientific side deals with producing actual designs; its artistic one drives the value of the architecture. Effective systems engineers exhibit strength in both sides. Effective architects are those that create elegant solutions to complex problems. However, most of the development and training of systems engineers focus on the analytical and procedural side. This paper addresses the question of how to teach the artistic side of systems architecting. We contend that systems architecture should be taught in a way similar to how the arts are taught, rather than the traditional instructional approaches employed when teaching engineering sciences. In support of this idea, we propose to teach systems architecture mimicking a studio art class. We discuss the classroom setting, the structure of the lessons, and the structure of the course.", "num_citations": "2\n", "authors": ["1413"]}
{"title": "A Research Plan to Discover Patterns of Unknown Vulnerabilities Associated with Adopting SysML\n", "abstract": " Much has been written about the expected benefits of adopting model-based systems engineering (MBSE), integrated modelling, and, more recently, digital twins. Among others, some of those expected benefits include better communication, earlier verification and validation cycles, and predictive analytics to anticipate and overcome unforeseen operational problems. However, research has not studied if relying on such a central, core model can also create negative unintended consequences. As the systems engineering community develops the techniques and tools to adopt such methodologies, it is essential to discover and overcome their unintended consequences. In order to contribute to this area, this paper presents a plan to study if SysML inherently creates patterns of unknown vulnerabilities, once the systems it models are realized.", "num_citations": "2\n", "authors": ["1413"]}
{"title": "An Elemental Decomposition of Systems Engineering\n", "abstract": " A part of the systems engineering and engineering design community has voiced a need to measure the goodness of systems engineering and engineering design methods or approaches. Such measurements could enable assessing the merits of novel approaches and methods and, ultimately, compare the situations and contexts in which one of them would be preferred over the other ones. Notwithstanding the complexity of such endeavor, this paper presents an elemental decomposition of systems engineering that can be used for characterizing systems engineering methods or approaches. The proposed model builds on understanding systems engineering as the application of strategies to realize systems. The proposed elemental decomposition consists of four elements, which represent the potential effects that any systems engineering activity may have on the system development: set an order on the …", "num_citations": "2\n", "authors": ["1413"]}
{"title": "Industrial Engineering Beyond Numbers: Optimizing under Ethics\n", "abstract": " Generally speaking, the essence of industrial engineering is optimization. Simplistically, the education of industrial engineers reduces to learning a number of techniques with which they can mathematically model a number of scenarios and optimize a mathematical function that is subjected to various mathematical constraints. Reality works differently though. The implementation of optimization actions in a real context yields direct and indirect impacts to society and to individual people. They are further strengthened when projects are implemented or executed in international settings, where different systems of laws, regulations, cultures, and values play a role. Several examples in the past have shown dramatic consequences for not considering ethical implications of engineering decisions in real projects. Therefore, exposing students to ethical conflicts, as well as educating them in the skills, competences, and tools necessary to cope with them, are necessary in the education of every engineer. This paper showcases the integration of ethics into an existing, traditional industrial engineering undergraduate course at the senior level. In particular, we show how traditional optimization assignments can be reformulated to blend mathematics and ethics. Therefore, we do not follow the path of developing an independent, elective course that focuses on ethical issues. Furthermore, integration of ethics is not performed through case studies on which students can reflect on past experiences. Instead, we embed ethical issues in traditional industrial engineering knowledge. In this way, ethical conflicts reveal themselves to students as students attempt to …", "num_citations": "2\n", "authors": ["1413"]}
{"title": "Effects of Fractionation on System Security in Space Systems\n", "abstract": " System security is usually described in terms of confidentiality, integrity, and availability of information. When satellite systems are used to collect and transfer information, their security level should be considered as part of the overall system security. In the last decade, the fractionated satellite architecture concept has been shown to have beneficial effects on many system characteristics, such as flexibility, adaptability, and responsiveness. This paper tries to understand whether this architectural concept has also inherent benefits to system security, and whether specific fractionated architectural patterns are more beneficial than others.", "num_citations": "2\n", "authors": ["1413"]}
{"title": "Using Requirements-Induced Complexity to Anticipate Development and Integration Problems: Analysis of Past Missions\n", "abstract": " HINKNIG broadly, system failure can occur in three dimensions: severe underperformance or mission loss, cost overrun or project cancellation, and schedule delay or project cancellation. In several cases, root cause for failure lays on the difficulty to develop a system compliant to the requested performance and programmatic constraints1-4. In the need to create novel approaches for developing complex and highly interconnected large scale systems5, systems engineering and complex systems science raise as disciplines that are able to cope with increasing complexity of systems and that can enable the development of affordable and thus successful systems1, 4, 6-7. Requirements engineering lay at the cornerstone of the systems engineering discipline8 and plays a fundamental role in facilitating system success9-15. Conventional approaches to system design use requirements as boundary conditions against …", "num_citations": "2\n", "authors": ["1413"]}
{"title": "A Parallel Tempering Approach for Efficient Exploration of the Verification Tradespace in Engineered Systems\n", "abstract": " Verification is a critical process in the development of engineered systems. Through verification, engineers gain confidence in the correct functionality of the system before it is deployed into operation. Traditionally, verification strategies are fixed at the beginning of the system's development and verification activities are executed as the development progresses. Such an approach appears to give inferior results as the selection of the verification activities does not leverage information gained through the system's development process. In contrast, a set-based design approach to verification, where verification activities are dynamically selected as the system's development progresses, has been shown to provide superior results. However, its application under realistic engineering scenarios remains unproven due to the large size of the verification tradespace. In this work, we propose a parallel tempering approach (PTA) to efficiently explore the verification tradespace. First, we formulate exploration of the verification tradespace as a tree search problem. Second, we design a parallel tempering (PT) algorithm by simulating several replicas of the verification process at different temperatures to obtain a near-optimal result. Third, We apply the PT algorithm to all possible verification states to dynamically identify near-optimal results. The effectiveness of the proposed PTA is evaluated on a partial model of a notional satellite optical instrument.", "num_citations": "1\n", "authors": ["1413"]}
{"title": "Demonstrating The Elusive Outcomes of Decision-making, Information-seeking, and Adaptability: A Market Simulation Game for Engineering Students.\n", "abstract": " In undergraduate engineering education, students are often overexposed to problemsolving methods that are unrepresentative of how engineers solve problems in practice. For decision-making problems, in particular, students are commonly taught to compare alternative solutions using known and provided information. However, many real-world decision-making problems require a broader range of problem-solving strategies, including information seeking, extrapolation of a decision’s consequences, and compromise between parties with competing objectives. To advance engineering educators’ capacity to address this need, we developed a simulation game activity designed to offer industrial engineering seniors experience in solving realistic decision-making problems. The simulation game involved students working in teams that role-played as different types of companies in a global smartphone market, where teams needed to negotiate with one another to establish profitable contracts within the game’s ruleset. Using a qualitative assessment instrument we developed through prior research, we evaluated how well success in the game aligned with learning outcome achievement in constrained decision-making, information-seeking, and adaptability. Though the game has opportunities for improvement, student success in the game was aligned with excellence in constrained decision-making, and occasionally aligned with excellence in adaptability, and effort to seek information that could guide team decisions. Additionally, student actions during the game have potential to initiate student discourse on the role of engineering ethics in …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "Shifting paradigms in verification and validation of AI-Enabled systems: A Systems-Theoretic perspective\n", "abstract": " There is a fundamental misalignment between current approaches to designing and executing verification and validation (V&V) strategies and the nature of AI-enabled systems. Current V&V approaches rely on the assumption that system behavior is preserved during a system’s lifetime. However, AI-enabled systems are developed so that they evolve their own behavior during their lifetime; this is the consequence of learning by the AI-enabled system. This misalignment makes existing approaches to designing and executing V&V strategies ineffective. In this chapter, we will provide a systems-theoretic explanation for (1) why learning capabilities originate a unique and unprecedented family of systems, and (2) why current V&V methods and processes are not fit for purpose. AI-enabled systems necessitate a paradigm shift in V&V activities. To enable this shift, we will delineate a set of theoretical advances and …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "An evaluation of the optimality of frequent verification for vertically integrated systems\n", "abstract": " Verification activities, such as inspection, testing, analysis, and demonstration, improve one's confidence in the system meeting the system requirements during the development process. Frequent verification is often advocated as a strategy that minimizes costs of rework over the entire design process, where frequent verification involves verifying after any change in the design. However, this strategy is yet to be validated. In this paper, we develop a belief‐based model of verification in systems design to determine the conditions under which frequent verification is an optimal strategy for a vertically integrated organization. Our model uses belief distributions to capture the organization's dynamic confidence in the system design meeting a requirement of interest during the development process. It also captures the organization's dynamic confidence in the correctness of its development activities (or design process) as …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "Structural Rules for an Intelligent Advisor to Identify Requirements Gaps using Model-Based Requirements\n", "abstract": " Requirements define the problem boundaries within which an engineering team tries to find acceptable solutions. Gaps in requirements formulation can lead to solutions that are not fitfor-purpose. However, the completeness of a set of requirements cannot be demonstrated; rather, completeness is an attempt, a best-effort pursuit. In current practice, where requirement gaps are frequent in system development, the human (engineer or team of engineers) becomes a major factor in the comprehensiveness of the resulting set of requirements. In this paper, we present a concept of an intelligent systems engineering (SE) advisor that supports the (human) engineer in identifying gaps as requirements are formulated, the set of structural rules that the intelligent SE advisor uses to perform the assessment, and a proof-of-concept implemented as a plugin for a Systems Modeling Language (SysML) software environment. The …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "Model-Based Security Requirements for Cyber-Physical Systems in SysML\n", "abstract": " Capturing system requirements with accuracy and precision remains a challenge for secure cyber-physical systems. Current research efforts continue to fundamentally rely on natural language (shall statements), which is inherently ambiguous, and thus unable to capture the problem space accurately and precisely. We suggest in this paper a model-based approach to security requirements that avoids the use of requirements in natural language and leverages formal modeling and system-theoretic constructs instead. Specifically, the proposed approach extends behavioral and structural model elements of the Systems Modeling Language (SysML) with a system-theoretic definition of a solution space. Considering a system model to be a transformation of inputs into output, we model the security problem space in this paper as a set of required transformations of inputs into outputs. The application of the proposed …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "The role of aesthetic reasoning in knowledge management: the case of elegant systems architecture design\n", "abstract": " Nonaka and Takeuchi foundational work brought tacit knowledge to the attention of the Knowledge Management (KM) community. During the same years, research in cognitive science was offering new insights on how tacit knowledge operates by highlighting the role of visual perception and aesthetic appreciation. Despite these developments, the relationship between tacit knowledge and aesthetics has received scarce attention in KM literature. Drawing from studies in Neuro-Aesthetics, Gestalt psychology, Art critique and Design, we focus on the relationship between aesthetics and ambiguity resolution and adopt as empirical unit engineering systems representations. We show that more effective system representations can be achieved through the application of a set of aesthetic principles supporting the achievement of an optimal level of complexity in the representation (effective complexity). The empirical …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "From Model-Based Requirements to a Virtual Systems Engineering Advisor that Identifies Gaps in Requirements: An Application to Space Systems\n", "abstract": " Requirements have traditionally had a prominent role in the development of space systems. Engineers pursue completeness when establishing sets of requirements to avoid inadvertently developing or accepting systems that are present interoperability problems or a simply not fit for purpose. Yet, requirement gaps are common in the development of space systems. If lucky, those gaps are identified (and costly corrected) before the space system is deployed. Otherwise, those gaps reduce the success of the space mission as the system becomes operational. Unfortunately, the completeness of a set of requirements cannot be demonstrated; rather, completeness is a pursuit. Hence, the level of comprehensiveness of a set of requirements that can be attained is heavily driven by the engineer or team put to the task of defining the problem space. In this paper, we present a proof-of-concept of a virtual systems …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "Efficient population of the verification tradespace using Bayesian inference\n", "abstract": " This article presents a process to efficiently elicit belief models of verification strategies in the context of applying tradespace exploration to the design of verification strategies. The need for efficiency is at the core of tradespace exploration, where a large region of the solution space needs to be explored before anchoring to a specific solution or solution set. In conceptual design and systems architecture, solutions are modeled by leveraging independent models that are connected by an overarching model. In designing verification strategies, however, verification activities cannot be modeled independently of the overall strategy in which they are used. As a result, probabilities associated with the confidence generated by each verification activity, need to be elicited for each candidate verification strategy individually. This requires, in principle, to generate a specific model for each solution in the solution space, which …", "num_citations": "1\n", "authors": ["1413"]}
{"title": "Automatic Generation of Contractual Requirements From MBSE Artifacts\n", "abstract": " This paper is intended to disseminate initial outcomes of the NPS Research Acquisition Program Automatic Generation of Contractual Requirements from MBSE Artifacts project. The research addresses the automatic generation of contractual requirements in textual form from models in a Model-Based Systems Engineering (MBSE) environment, enabling the transition from document-centric systems engineering to MBSE in acquisition programs. Textual requirements form the backbone of contracting in acquisition programs. Requirements define the problem boundaries within which contractors try to find acceptable solutions (design systems). At the same time, requirements are the criteria by which a customer measures the extent to which their contract has been fulfilled by the contractor. However, latent problems exist in acquisition programs stemming from poor practices in requirements engineering. Research suggests that transitioning to model-based requirements can be effective in coping with such challenges. We presented in prior work a framework to construct true model-based requirements within the context of the Systems Modeling Language (SysML). This research addresses the main question of whether contractual requirements in textual form can be automatically generated from those requirement models without loss of information or intent. We present in this paper an initial template of requirements and a process to support this goal.", "num_citations": "1\n", "authors": ["1413"]}