{"title": "Dtn-enabled routing protocols and their potential influence on vehicular ad hoc networks\n", "abstract": " Delay-tolerant networks are the particular class of networks which use the concept of store, carry, and forward. In delay-tolerant network, the path is not established until and unless data is transmitted. The vehicles store data, carry it, and forward it to appropriate node whenever there is an opportunity to transmit data, i.e., a vehicle in the desired direction is available. This is also introduced as message passing mechanism.", "num_citations": "11\n", "authors": ["1280"]}
{"title": "Privacy anxiety and challenges in mobile ad hoc wireless networks and its solution\n", "abstract": " Mobile Ad hoc networks are recent wireless networking model for cellular phone hosts. Ad hoc networks do not rely on any stable infrastructure because they are independent. As an alternative, to remain network connected hosts rely on each other. It signifies complex distributed systems that encompass wireless mobile nodes. These nodes can freely and dynamically self-organize into uninformed and provisional,‘‘ad-hoc’’network topologies. This topology allows citizens to effortlessly interconnect in areas where no preexisting communication infrastructure. In this paper, we talk about security issues, challenges and their solutions in the mobile ad hoc network. There are numerous security threats that disturb the development of mobile ad hoc network because of the exposed nature of the mobile ad hoc network. We have first studied the prime vulnerabilities in the mobile ad hoc networks, which have made our work much easier to endure from attacks than the usual wired network. The security criteria of the mobile ad hoc network and the main attack types that exist are explained in this paper. As a final point we analyzed the recent security solutions for the mobile ad hoc network [1].", "num_citations": "5\n", "authors": ["1280"]}
{"title": "Mobility and Scalability based Performance Analysis of DSDV, AODV and DSR Routing Protocols in MANETs-A Technical Perspective\n", "abstract": " Mobile ad hoc network is a self-directed structure of mobile nodes connected by wireless links. All nodes operate not only as an end system, but also as work as a router to forward the packets. Ad hoc wireless networks are characterized by multi-hop wireless connectivity, infrastructure less and habitually changing topology. It may be necessary for one mobile node to schedule other hosts for forwarding a packet from source to destination node due to the constrained transmission range of wireless network interfaces. Therefore a self-motivated routing protocol is required for these networks to work properly. A number of Routing protocols have been created to achieve this task. In this paper, the performance of Mobile Ad-Hoc network routing protocols DSDV, AODV and DSR are evaluated using network simulator NS2. The performance metrics includes PDF (Packet Delivery Fraction), Throughput, End to End Delay, NRL (Normalized Routing Load), routing overhead and Packet Lost. The performances of routing protocols are evaluated by varying mobility and scalability By the simulation it is observed that the performance of reactive routing protocols DSR and AODV performed significantly better than proactive routing protocol DSDV for the CBR based traffic in terms of packet delivery fraction, throughput, packet lost and NRL.", "num_citations": "3\n", "authors": ["1280"]}
{"title": "Design implementation and Analysis of Efficient AODV routing protocol in MANET\n", "abstract": " Mobile ad hoc network (MANET) is independent structure of mobile nodes connected by wireless links. Ad hoc wireless networks are illustrated by multi-hop wireless connectivity, infrastructure less and repeatedly changing structure. Each node operates not only is a host, but also as a router to forward the packets. Hence energetic routing protocol is required for these networks to function appropriately. Many Routing protocols have been developed to complete this task. AODV is one of the commonly studied on-demand ad hoc routing protocols. AODV and others of the reactive ad hoc routing protocols use single route-reply with reverse path. Quick changes in topology causes that the route-reply could not arrive to the desire node. The source node sends numerous route request messages to gain a reply message, specifically on high speed mobility. This increases in end to end delays and decreases both in packet delivery fraction and average throughput. To overcome these problems, an efficient AODV (E-AODV) is proposed. In E-AODV the destination node receives first route request message (RREQ), it generates turn around route request (TA-RREQ) message and floods it to neighbor nodes within transmission area. When the source node receives first TA-RREQ message, then it starts packet transmission, and late arrived TA-RREQs are saved for future use. It reduces route fail correction messages and gets good performance than the existing AODV. The performances of AODV and E-AODV protocols are evaluated based on varying density and mobility using NS-2 simulator. It is examined by the simulation results that the performance of E …", "num_citations": "1\n", "authors": ["1280"]}