{"title": "Study and Analysis of Object-Oriented Languages using Hybrid Clone Detection Technique\n", "abstract": " Code duplication is prevalent software development traditions that announce various complementary or identical segments of code. Clone detection is a ground of dynamic research in which great equipments previously exists to inspire code clone detection. Most of the studies have explicitly or implicitly expected that code cloning is negative. Clones are harmful for software maintenance because it increases the complexity of system and maintenance cost. If we detect software clones it can decrease software maintenance cost. Numerous code clone detection techniques were exiting. The goal of those researches is the exploration of various clone detection techniques and tools. In this study, we propose an efficient clone detection tool which is used to detect clones in various programming languages. This tool enhanced the performance metrics such as recall and precision. The result is demonstrate that the proposed tool outperform as compare to traditional tools, which are shown by simulations using Net Beans.", "num_citations": "1\n", "authors": ["2146"]}
{"title": "A Novel Composite Approach for Software Clone Detection\n", "abstract": " In recent decades, the branch of Clone Detection has undergone a great advancement. This progress is due to the development of various methods, which involves the implementation of complex algorithms and tool chains to offer clone detection. Various clone detection methods that are already available include textual comparison, token comparison, and comparison of Abstract Syntax trees, Suffix trees and Program Dependency Graphs. Moreover, these Clone Detection techniques are limited to a particular programming language environment only. The aim of the paper is to present a survey of the various existing techniques and to develop a tool which is user friendly, easy to maintain and is not limited to small and big software. This method of clone detection can also be implemented to more complex applications such as web based applications. ie a website code related to PHP or JSP or it can be an application which is linked with internet not a standalone application. In addition to this, the proposed approach is applicable to all the languages and platforms. Hence the proposed system is a platform independent system..", "num_citations": "1\n", "authors": ["2146"]}