{"title": "Enterprise Architecture Documentation: Current Practices and Future Directions\n", "abstract": " Over the past decade Enterprise Architecture (EA) management matured to a discipline commonly perceived as a strategic advantage. Among others, EA management helps to identify and realize cost saving potentials in organizations. EA initiatives commonly start by documenting the status-quo of the EA. The respective management discipline analyzes this so-called current state and derives intermediate planned states heading towards a desired target state of the architecture. Several EA frameworks describe this process in theory. However, during practical application, organizations struggle with documenting the EA and lack concrete guidance during the process. To underline our observations and confirm our hypotheses, we conducted a survey among 140 EA practitioners to analyze issues organizations face while documenting the EA and keeping the documentation up to date. In this paper we present results on current practices, challenges, and automation techniques for EA documentation in a descriptive manner.", "num_citations": "83\n", "authors": ["1955"]}
{"title": "Enterprise Architecture Documentation: Empirical Analysis of Information Sources for Automation\n", "abstract": " Over the past decade, Enterprise Architecture (EA) management emerged to a mature discipline commonly applied to realize cost saving potentials while increasing effectiveness of IT in organizations. Typically, EA management starts by documenting the current state in an EA model and deriving future planned states heading towards an optimized EA. In practice, organizations struggle with the documentation of their current state due to the complexity of their enterprise architecture and its frequent changes. Current research activities seek to automate the data collection process by integrating existing EA information sources of operative systems. However, a comprehensive analysis of possible information sources and their appropriateness for EA is not yet provided. To build an empirical basis, this paper presents findings of a survey conducted on the key problems in EA documentation as well as the …", "num_citations": "69\n", "authors": ["1955"]}
{"title": "Automation Processes for Enterprise Architecture Management\n", "abstract": " Creating and maintaining an enterprise architecture model that is both up-to-date and accurate is a difficult task due to the size and complexity of the models and the dispersed nature of EA information in organizations. In current EA maintenance processes, the models are maintained manually with only little automation, which is a time consuming task. Literature from research and practice has identified this challenge, but only few scientific publications actually address the issue of EA model maintenance and its automation. In our research effort on Living Models, we are working towards solutions for a closer connection between EA models and what they represent in the real world. In this article we present (semi-)automated processes for maintaining enterprise architecture models by gathering information from both human input and technical interfaces and discuss implementation issues for realizing the processes …", "num_citations": "60\n", "authors": ["1955"]}
{"title": "A situational method for semi-automated Enterprise Architecture Documentation\n", "abstract": " The business capabilities of modern enterprises crucially rely on the enterprises’ information systems and underlying IT infrastructure. Hence, optimization of the business-IT alignment is a key objective of Enterprise Architecture Management (EAM). To achieve this objective, EAM creates, maintains and analyzes a model of the current state of the Enterprise Architecture. This model covers different concepts reflecting both the business and the IT perspective and has to be constantly maintained in response to ongoing transformations of the enterprise. In practice, EA models grow large and are difficult to maintain, since many stakeholders from various backgrounds have to contribute architecture-relevant information. EAM literature and two practitioner surveys conducted by the authors indicate that EA model maintenance, in particular the manual documentation activities, poses one of the biggest challenges …", "num_citations": "58\n", "authors": ["1955"]}
{"title": "Requirements for automated enterprise architecture model maintenance\n", "abstract": " Enterprise Architecture Management (EAM) is the practice of modeling the business and IT artifacts in an enterprise and relating them with each other. By documenting these interdependencies between business and the supporting IT, strategic decisions can be made towards a planned and consolidated enterprise architecture that matches the business needs. However, enterprise architecture models can grow very large, thus making the manual creation and maintenance of these models a difficult and time consuming task. From this, we derived the three research questions of this paper:(i) Which related work exists on the maintenance of EA models, and does it refer to automation techniques?(ii) Is EA maintenance automation demanded by practitioners? If yes,(iii) What are the requirements for such an automation method and tool? In this paper we tackle these questions by conducting a literature analysis on EA literature from research and practice. In addition, we present the results of a survey among EA practitioners we conducted to find out current maintenance practices. We then describe a collection of requirements for an automated EA maintenance method and tool, that we derived from the results of the survey, the findings in the literature review and our own experience as EA consultants. Finally, we present several success evaluation criteria for an automated EA maintenance solution.", "num_citations": "55\n", "authors": ["1955"]}
{"title": "A Meta-Model for Automated Enterprise Architecture Model Maintenance\n", "abstract": " Maintaining a high quality enterprise architecture (EA) model that is up-to-date and consistent is a difficult but crucial task. The reasons for this difficulty are the size and complexity of EA models, frequent changes in the architecture and the challenge of collecting EA data from different stakeholders in large organizations. In our research project Living IT-Landscape Models we are working towards a tighter synchronization between EA models and what they represent in the real world, thus increasing the model actuality and consistency. With our previous work we have established semi-automated processes for EA data collection and quality assurance. To support these processes an implementing EAM tool needs to be able work with contextual information that is not typically stored alongside the EA models. In the paper at hand we describe a meta-model that incorporates the required context information and can …", "num_citations": "35\n", "authors": ["1955"]}
{"title": "Living Modeling of IT Architectures: Challenges and Solutions\n", "abstract": " Enterprise Architecture Models (EA Models) are documentations capturing the elements of an enterprise’s IT infrastructure, setting these elements in relation to each other and setting them into the context of the business. EA Models are a crucial backbone for any IT management process and activities like analysing IT related risks and planning investments. The more companies depend on reliable IT services and use IT as innovation driver, the more high quality EA Models provide competitive advantage. In this paper we describe core challenges to the maintenance of EA Models based on previously conducted surveys and our longstanding experience in industrial collaborations. This is followed by a sketch of an innovative solution to solve these challenges.", "num_citations": "32\n", "authors": ["1955"]}
{"title": "A web-based collaborative metamodeling environment with secure remote model access\n", "abstract": " This contribution presents GEMSjax – a web-based metamodeling tool for the collaborative development of domain specific languages. By making use of modern Web 2.0 technologies like Ajax and REST services, the tool allows for simultaneous web browser-based creation/editing of metamodels and model instances, as well as secure remote model access via REST, which enables remote model modification over a simple HTTP-based interface. This paper describes the complex technical challenges we faced and solutions we produced to provide browser-based synchronous model editing. It further explains on the XACML-based access control mechanisms to provide secure remote access to models and model elements. Additionally, we highlight the usefulness of our approach by describing its application in a realistic usage scenario.", "num_citations": "29\n", "authors": ["1955"]}
{"title": "Enterprise Architecture Planning: Analyses of Requirements from Practice and Research\n", "abstract": " Enterprise architecture management (EAM) has become an increasingly important topic in practice due to the growing complexity of organizations and their underlying IT. While there is a strong interest in Enterprise Architecture (EA) modeling, evaluation, and frameworks, a lack of knowledge remains in the research field of EA planning. We conducted a series of expert interviews on the topic of EA planning. From these interviews we were able to extract requirements for EA planning from practice as the foundation of our analyses. Additionally, we conducted a structured literature review to elicit requirements for EA planning from a research perspective. This paper combines the results of both the practitioner interviews and the literature review to emphasize the gaps between the two worlds. As a result, we identified that current research does not adequately address the pressing problems of EA planning in practice.", "num_citations": "22\n", "authors": ["1955"]}
{"title": "On Enterprise Architecture Change Events\n", "abstract": " In practice it is difficult to maintain a high quality enterprise architecture (EA) model with regards to its actuality and completeness. However, neither literature from practice and EA frameworks nor EA research literature provide sufficient guidance for the difficult task of maintaining EA models. Recently, researchers have presented methods to collect structured data from existing data sources, e.g. from IT operations in order to (semi-)automatically update EA models. In this paper, we make an argument for the additional use of EA change events from (management) information systems. These change events do not provide clearly mappable structured information, but can be used to trigger and guide manual EA model maintenance tasks when changes occur. We present the first classification of relevant events in EA literature, detailing on their sources and impact on the EA model. Finally, we propose a model …", "num_citations": "22\n", "authors": ["1955"]}
{"title": "Towards living landscape models: Automated integration of infrastructure cloud in enterprise architecture management\n", "abstract": " Enterprise Architecture Management (EAM), and in particular IT--landscape management try to model the IT- and business elements of a company, in order to analyze its efficiency towards supporting business goals, optimize business-IT alignment, and to plan future IT-transformation as well as IT-standardization. A major challenge in this field is the elicitation of infrastructure information from run-time systems, e.g., to answer the question which servers provide services to a specific information system. Capturing this data is a time consuming manual task which leads to quickly outdated information. Similar to traditional hardware, cloud infrastructure needs to be documented in an EA modeling order to gain insight on its relationships with business information systems and ultimately the business goals. The aim of our research in this area is the automatic integration of various runtime information sources into an EAM …", "num_citations": "19\n", "authors": ["1955"]}
{"title": "Gateway to Quality Living for the Elderly: Charting an Innovative Approach to Evidence-Based E-Health Technologies for Serving the Chronically Ill\n", "abstract": " In this paper, we explore four critical barriers to e-Health effectiveness and discuss why and how to build and evaluate e-Health technologies for the chronically ill, including: (1) gaps in knowledge about learning and health behaviors, (2) metrics for technology adoption and beneficial use, (3) sampling and decision support, and (4) adherence and adaptive care customization. Accordingly, the metaphor of a “gateway” is used to imply that healthcare providers and the individuals they serve must engage in a sensible two-way interactions, on the one hand, it should open the door for providers to offer personalized and cost-effective care, on the other hand, it should also open the door to a welcoming environment that provides easy access and motivation for sustained use by the chronically-ill individuals.", "num_citations": "11\n", "authors": ["1955"]}
{"title": "ChronoSphere: a graph-based EMF model repository for IT landscape models\n", "abstract": " IT Landscape models are representing the real-world IT infrastructure of a company. They include hardware assets such as physical servers and storage media, as well as virtual components like clusters, virtual machines and applications. These models are a critical source of information in numerous tasks, including planning, error detection and impact analysis. The responsible stakeholders often struggle to keep such a large and densely connected model up-to-date due to its inherent size and complexity, as well as due to the lack of proper tool support. Even though modeling techniques are very suitable for this domain, existing tools do not offer the required features, scalability or flexibility. In order to solve these challenges and meet the requirements that arise from this application domain, we combine domain-driven modeling concepts with scalable graph-based repository technology and a custom …", "num_citations": "10\n", "authors": ["1955"]}
{"title": "Enterprise Architecture Planning in the Context of Industry 4.0 Transformations\n", "abstract": " Industry 4.0 has become an increasing driver of change in the manufacturing industry. However, companies are struggling with the often risky and expensive IT transformation projects that are needed to reach full automation of the sales, production and logistics cycle. We observed a lack of research on the practice of modeling and planning IT transformations towards Industry 4.0. To form the basis of research in this area, we conducted a series of expert interviews on the topic of enterprise architecture transformation planning in the context of Industry 4.0. As a result, we identified several pressing challenges that need to be addressed by organizations to successfully model, plan, and execute such IT transformations. This paper contributes to theory by identifying problems and potential design artifacts that are able to mitigate these problems.", "num_citations": "10\n", "authors": ["1955"]}
{"title": "Towards a Taxonomy Framework of Evolution for SOA Solution: From a Practical Point of View\n", "abstract": " Presently, the research on evolution of SOA solution is becoming more and more important in industry. It is necessary to extract a taxonomy framework for evolution of SOA solution because by using it, evolution of SOA-based systems can be analyzed and compared comprehensively and objectively. In this paper, a taxonomy framework for evolution of SOA solution is proposed that is illustrated from four perspectives: (a) motivations for evolutionary changes (why), (b) locations where evolutionary changes happen (where), (c) times when evolutionary changes happen (when), and (d) support mechanisms in the process of evolutionary changes (how). Furthermore, the taxonomy framework is applied on analyzing a SOA-based configurable system for urban logistics delivery management, as an application of taxonomy framework.", "num_citations": "9\n", "authors": ["1955"]}
{"title": "A Case Study on Textual Enterprise Architecture Modeling\n", "abstract": " Today's Enterprise Architecture Management (EAM) tools are based on forms and graphical modeling capabilities via web-based applications or desktop clients. However, recent developments in textual modeling tools have not yet been considered for EA modeling in research and practice. In this paper we present a novel EAM-tool approach, called Txture, that consists of a textual modeling environment and a web-application to provide enterprise-wide architecture visualizations for different stakeholder groups. The tool is in production use at a major Austrian data center, where it proofed to be intuitive and provide efficient modeling capabilities compared to traditional approaches. In this paper we present lessons learned from the development of the tool as well as usage it and report on its benefits and drawbacks.", "num_citations": "8\n", "authors": ["1955"]}
{"title": "ChronoGraph: A Versioned TinkerPop Graph Database\n", "abstract": " Database content versioning is an established concept in modern SQL databases, which also became part of the SQL standard in 2011. It is used in business applications to support features such as traceability of changes, auditing, historical data analysis and trend analysis. However, versioning capabilities have barely been considered outside of the relational context so far. In particular in the emerging graph technologies, these aspects are being neglected by database vendors. This paper presents ChronoGraph (This work was partially funded by the research project “txtureSA” (FWF-Project P 29022).), the first full-featured TinkerPop-compliant graph database that provides support for transparent system-time content versioning and analysis. This paper offers two key contributions: We present the concepts and architecture of ChronoGraph as a new addition to the state of the art in graph databases, and …", "num_citations": "6\n", "authors": ["1955"]}
{"title": "Towards Automation of Enterprise Architecture Model Maintenance\n", "abstract": " Enterprise Architecture Management (EAM) is a common practice in organizations that need to have a model of how their business relates to the supporting IT-landscape in order to make informed decisions to enhance the enterprise architecture (EA). Creating and maintaining such an EA model is an expensive and time consuming but crucial task in today’s organizations. This has been recognised by both researchers and practitioners. However, only little research literature and practical approaches can be identified that target the automation of the EA model maintenance and to reduce the manual work. In this thesis we elaborate means to increase the data quality attributes of actuality and consistency of EA models via semi-automated data collection processes from external data sources and events. It is our main goal to better synchronize EA models with what they represent in the real world and thus reduce the manual labor of model maintenance.", "num_citations": "6\n", "authors": ["1955"]}
{"title": "Combining Versioning and Metamodel Evolution in the ChronoSphere Model Repository\n", "abstract": " Model Driven Engineering (MDE) has gained a lot of popularity in recent years and is being applied in a wide variety of domains. As teams, models and applications grow in size, the need for faster and more scalable technology emerges, in particular in the crucial area of model repositories. These software components are responsible for persisting, querying and versioning the model content and act as central hubs for interaction with the model. However, existing repository solutions do not consider metamodel evolution, which is important in long-running projects. In this paper, we present ChronoSphere, a novel model repository, targeted specifically towards developers working with MDE technology in industry, with a focus on models-at-runtime scenarios. By utilizing the latest innovations in graph databases and version control, ChronoSphere provides transparent and efficient versioning as well as …", "num_citations": "5\n", "authors": ["1955"]}
{"title": "Automating tendering processes with web services: A case study on building construction tendering in Hong Kong\n", "abstract": " With the recent advancements and adoption of Web Service technologies, improvements can be made for tendering processes to solve B2B interoperability and integration problems. In this paper, we detail our Tendering Process Meta-model (TPM) to improve inefficient manual or semi-automated tendering process. We further demonstrate our approach in a case study of the building and construction industries, where contracting authority invite tenderers to submit an estimate of prices, detailing the costs associated with completing a building. In this way, the contracting authority can base their decision on the tender submissions to select the most suitable contractor. Currently in Hong Kong, many of such tendering processes are still mainly manual and paper based. The tenderers need to collect the tender’s booklet, price it, and bring it back to the contracting authority’s office before the deadline. In this paper …", "num_citations": "5\n", "authors": ["1955"]}
{"title": "Service composition and interaction in a soc middleware supporting separation of concerns with flows and views\n", "abstract": " Service-Oriented Computing (SOC) has recently gained attention both within industry and academia; however, its characteristics cannot be easily solved using existing distributed computing technologies. Composition and interaction issues have been the central concerns, because SOC applications are composed of heterogeneous and distributed processes. To tackle the complexity of inter-organizational service integration, the authors propose a methodology to decompose complex process requirements into different types of flows, such as control, data, exception, and security. The subset of each type of flow necessary for the interactions with each partner can be determined in each service. These subsets collectively constitute a process view, based on which interactions can be systematically designed and managed for system integration through service composition. The authors illustrate how the proposed …", "num_citations": "4\n", "authors": ["1955"]}
{"title": "A situational method for semi-automated enterprise architecture documentation (SoSyM abstract)\n", "abstract": " Large organizations critically rely on their IT infrastructure. So called Enterprise Architecture (EA) models are often created to understand how the IT supports the business and used to optimize the IT and align it with the business. However, the models grow very large and are hard to keep up-to-date. Current approaches focus on automated data collection to tackle this problem, which is not feasible in many situations. In this paper we present a semi-automated EA documentation method and tool support that tackles this problem and takes the organizational contexts into account.", "num_citations": "3\n", "authors": ["1955"]}
{"title": "Modeling Techniques for Enterprise Architecture Documentation: Experiences from Practice\n", "abstract": " Enterprise Architecture Management (EAM) is an IT-management process in which the relationships of business services, applications and the underlying IT-infrastructure is modeled. With dedicated EA models, activities such as architectural consolidation, planning and risk analysis are facilitated. A key factor in modeling and documenting enterprise architectures is the the underlying meta-model that enables to capture the information demand of an organization. Current EA tools provide no or only inflexible mechanisms to create and evolve such organization-specific meta-models. Therefore we present a novel modeling framework that has been established from a consulting and a research project with two data centers. It makes use of both, concepts from multi-level modeling and classical three-level modeling and separates structural and ontological model ingredients. A key aspect of the presented approach is the separation of modeling tasks across different stakeholders and modeling levels and the favoring of practical usability over language feature richness.", "num_citations": "2\n", "authors": ["1955"]}
{"title": "Context-Aware Task Allocation for Quick Collaborative Responses\n", "abstract": " Under some emergencies, persons are required to arrive quickly at the scene and collaborate on sensitive tasks. To ensure effective performance of these tasks and be compliant with business regulations, user context should be considered and security requirements are desired. In this paper, we tackle this challenging problem of quick collaborative response from the view of task allocation with user authorization. The considered Quickresponse task allocation problem (QTAP) answers how to find a user-task allocation solution, the group of qualified users who can fastest arrive at the scene to fulfill the collaborative processes and satisfy the required security constraints. We study the computational complexity of this problem and solve it by the reduction to the well-studied scheduling problem. We further discuss an important extension of QTAP that supports task dependencies and propose an algorithm to solve it.", "num_citations": "2\n", "authors": ["1955"]}
{"title": "Constraint-based authorization management for mobile collaboration services\n", "abstract": " With the fast development of high speed wireless technologies and the growing population of mobile portable devices, location information is potentially available for access control systems. Such applications are especially meaningful in emergency situations, where quick responses are urgently required for persons to be physically present in a certain place to perform sensitive tasks without conflicting with security policies. In this paper, we investigate this challenging problem and propose a novel constraint-based authorization management model, which takes the mobile execution of tasks with handheld devices into account. The authorizations are activated by means of location based execution binding to handle uncertain conditions such as flexible business processes and emergency situations, considering both the user's location and attributes. With the introduced algorithms the model is capable of execution …", "num_citations": "2\n", "authors": ["1955"]}
{"title": "Combining Textual and Web-based Modeling\n", "abstract": " Documenting large scale IT-architectures is a laborious task that is executed by many different stakeholder types. We argue that a major obstacle that keeps stakeholders from keeping models up-todate is inadequate user interfaces for specific stakeholders. In this demo paper we present a novel modeling tool that provides adequate stakeholder views and describe the implementational challenges. The tool motivates users to contribute documentation by allowing textual modeling for technical users and web-based modeling via forms for business users at the same time. The tool demonstration video is available at: https://www. youtube. com/watch? v= PaP2Sppiv7g&feature= youtu. be", "num_citations": "1\n", "authors": ["1955"]}