{"title": "The survey of data mining applications and feature scope\n", "abstract": " In this paper we have focused a variety of techniques, approaches and different areas of the research which are helpful and marked as the important field of data mining Technologies. As we are aware that many Multinational companies and large organizations are operated in different places of the different countries.Each place of operation may generate large volumes of data. Corporate decision makers require access from all such sources and take strategic decisions.The data warehouse is used in the significant business value by improving the effectiveness of managerial decision-making. In an uncertain and highly competitive business environment, the value of strategic information systems such as these are easily recognized however in todays business environment,efficiency or speed is not the only key for competitiveness.This type of huge amount of data are available in the form of tera-topeta-bytes which has drastically changed in the areas of science and engineering.To analyze,manage and make a decision of such type of huge amount of data we need techniques called the data mining which will transforming in many fields.This paper imparts more number of applications of the data mining and also focuses scope of the data mining which will helpful in the further research.", "num_citations": "309\n", "authors": ["1222"]}
{"title": "Malicious node detection using heterogeneous cluster based secure routing protocol (HCBS) in wireless adhoc sensor networks\n", "abstract": " In wireless, every device can moves anywhere without any infrastructure also the information can be maintained constantly for routing the traffic. The open issues of wireless Adhoc network the attacks which are chosen the forwarding attack that is dropped by malicious node to corrupt the network performance then the information integrity exposure. Aim of the problem that existing methods in Adhoc network for malicious node detection which cannot assure the traceability of the node as well as the fairness of node detection. In this paper, the proposed heterogeneous cluster based secure routing scheme provides trust based secure network for detection of attacks such as wormhole and black hole caused by malicious nodes presence in wireless Adhoc network. The simulation result shows that the proposed model is detect the malicious nodes effectively in wireless Adhoc networks. The malicious node detection …", "num_citations": "41\n", "authors": ["1222"]}
{"title": "Cost-effective and fault-resilient reusability prediction model by using adaptive genetic algorithm based neural network for web-of-service applications\n", "abstract": " The exponential rise in software technologies and its significances has demanded academia-industries to ensure low cost software solution with assured service quality and reliability. A low cost and fault-resilient software design is must, where to achieve low cost design the developers or programmers prefer exploiting source or function reuse. However, excessive reusability makes software vulnerable to get faulty due to increased complexity and aging proneness. Non-deniably assessing reusability of a class of function in software can enable avoiding any unexpected fault or failure. To achieve it developing a robust and efficient reusability estimation or prediction model is of utmost significance. On the other hand, the aftermath consequences of excess reusability caused faults might lead significant losses. Hence assessing cost effectiveness and efficacy of a reusability prediction model is must for …", "num_citations": "31\n", "authors": ["1222"]}
{"title": "Multi relational data mining approaches: A data mining technique\n", "abstract": " The multi relational data mining approach has developed as an alternative way for handling the structured data such that RDBMS. This will provides the mining in multiple tables directly. In MRDM the patterns are available in multiple tables (relations) from a relational database. As the data are available over the many tables which will affect the many problems in the practice of the data mining. To deal with this problem, one either constructs a single table by Propositionalisation, or uses a Multi-Relational Data Mining algorithm. MRDM approaches have been successfully applied in the area of bioinformatics. Three popular pattern finding techniques classification, clustering and association are frequently used in MRDM. Multi relational approach has developed as an alternative for analyzing the structured data such as relational database. MRDM allowing applying directly in the data mining in multiple tables. To avoid the expensive joining operations and semantic losses we used the MRDM technique. This paper focuses some of the application areas of MRDM and feature directions as well as the comparison of ILP, GM, SSDM and MRDM", "num_citations": "28\n", "authors": ["1222"]}
{"title": "Utility of an object oriented reusability metrics and estimation complexity\n", "abstract": " Background/Objectives: In this 21st century, Reusability imparts powerful tools in the software industry. More and less 80% code is reused in the new project. Evaluation of metrics form the software code is now a challenging task as well as how much percentage of code is used from the existing one. This can be achieved by using CK (Chidambaram and Kemmerer Metrics). Methods/Statistical Analysis: There are numerous metrics are defined which distinguish the actual object. The proposed new metrics which is the combinations of one of the CK metrics suite and which calculates the reusable codes in the object oriented programme. Findings: In the inheritance if we take maximum depth of class in the hierarchy then found more chance for reusability of the inherited metrics. So DIT (Depth of Inheritance) has positive sign on the reusability of the class. If reasonable value for number of children then more scope of reuse in the class. If we have more number of methods in the class then more impact will be more on the children class and restrictive the possible of reuse. Conclusion: The OOS (Object Oriented System) using the parameterized constructor in C++ programs is more reusable up to some extent. When we will get the larger ethics (values) of proposed Metrics-2 and-3 then definitely it gives the negative collision on the reusability. So the constructor having parameters (parameterized Constructor) gives the negative impact on the reusability of the classes.", "num_citations": "25\n", "authors": ["1222"]}
{"title": "Enhanced evolutionary computing based artificial intelligence model for web-solutions software reusability estimation\n", "abstract": " Ensuring the aging resilient software design can be of paramount significance to enable faultless software system. Particularly assessing reusability extent of the software components can enable efficient software design. The probability of aging proneness can be characterized based on key OO-SM like cohesion, coupling and complexity of a software component. In this paper, aging resilient software reusability prediction model is proposed for object oriented design based Web of Service (WoS) software systems. This work introduces multilevel optimization to accomplish a novel reusability prediction model. Considering coupling, cohesion and complexity as the software characteristics to signify aging proneness, six CK metrics; WMC, CBO, DIT, LCOM, NOC, and RFC are obtained from 100 WoS software. The extracted CK metrics are processed for min–max normalization that alleviates data-unbalancing and …", "num_citations": "23\n", "authors": ["1222"]}
{"title": "State-of-the-art object-oriented metrics and its reusability: a decade review\n", "abstract": " In this article, the importance is given to the object-oriented metrics and its reusability factor. There has been much work already done, but some improvements are needed in the software industry. Object-oriented metrics is one of the most popular and ongoing studies in different engineering branches including mathematics. Software metrics will be helpful to estimate the reusable code. The objective of this paper was to identify the reusability factor and accessibility from the last decades. A comprehensive survey on metrics and its applications has been carried out for more than one decade, and the main aim of this survey is to point out the reusable factor rather than coding. This paper shows the competence and applicability in a mixture of domains.", "num_citations": "22\n", "authors": ["1222"]}
{"title": "Threshold estimation from software metrics by using evolutionary techniques and its proposed algorithms, models\n", "abstract": " The software metrics play the important role in the software industry. As the software industry growing in size and complexity enhanced support is mandatory for computing and managing the software quality. Quality measurement is one of the key features of the manager in the software industry; where threshold plays the crucial role. Software measurement is necessary by means for evaluating different quality attributes and characteristics, such as size, complexity, maintainability, and usability. Instead of that effective and efficient software system is straightforward dependent on the meaning of suitable thresholds. The objective of this paper is to estimate the threshold values from software metrics by using novel evolutionary intelligence techniques. The threshold and aging software design optimization algorithms and models to prevent software aging by using machine learning (evolutionary algorithms …", "num_citations": "18\n", "authors": ["1222"]}
{"title": "Identifying the reusable components from component-based system: proposed metrics and model\n", "abstract": " Reusability is the key component from the software development prospective. This job describes a measurement which is popularly called as reprocess measurement to discover and investigate the static activities of the module. This paper proposed a set of reusability metrics especially partly adaptable, completely changeable and moderately capable modules. The process of reusability can be measured to degree of module in component-based system. This paper provides the novel model as well as the proposed metrics. We propose reusability-metric for all categories of components including partially modifiable, fully modifiable as well as for off-the-shelf components. Using reusability-metric, we draw a reusability-matrix containing the reusability ratios of all the different classes of components. This paper introduces selection criteria for components by using the reusability features of component-based …", "num_citations": "18\n", "authors": ["1222"]}
{"title": "Utility of an object-oriented metrics component: examining the feasibility of. Net and C# object-oriented program from the perspective of mobile learning\n", "abstract": " In the 21st century, mobile applications could be built using different object-oriented languages like C#, Java and object-oriented framework. Increasing and maintaining the software product for multiple applications remains to be a challenging task. Object-oriented metrics play a crucial role in development of a software product. The estimation of object-oriented metrics is essential in the software engineering domain, including measuring the software code complexity, and estimating the size and quality of the products. Developers generally implements applications on different platforms, such as the Android in Java and Windows in C#, by having the metrics estimation conducted automatically since manual calculation is difficult. The metrics are generated in different ways owing to the change of mobile technologies and other marketing factors. This research not only reviews both manual and automated design tools …", "num_citations": "14\n", "authors": ["1222"]}
{"title": "Software reusability metrics prediction by using evolutionary algorithms: The interactive mobile learning application RozGaar\n", "abstract": " Considering object oriented program based software metrics (cohesion, coupling and complexity) and their significance to characterize software quality, particularly software component reusability, we have considered six important CK matrices. The predominant reason behind using the measurement technique is the individual relationship with the design aspect and fault-proneness or aging-proneness. The key objective of this paper is to generate employment opening to thousands of people who have different skillsets and furthermore to provide hassle-free services by RozGaar service providers to customers with the help of machine learning techniques. In the current century’s rapid growth of modernization and automation, manual labor is reduced which gives rise to unemployment at mass. If we need technicians, workers, plumbers or drivers who work on daily wages, it is quite difficult to find one in our locality …", "num_citations": "12\n", "authors": ["1222"]}
{"title": "A systematic literature review of an object oriented metric: reusability\n", "abstract": " In 21st century software engineering domain, reusability plays a vital role. Reusability is an important attribute in object oriented metrics. The objective of reusability is to enhance the quality of the software product, improve productivity and to reduce the cost effort. Object-oriented programming languages like C++ have an exciting features i.e. Templates which provide the reusability component through which we can develop reusable functions and classes. In this paper we have analyzed object oriented metrics as well as the CK metrics suite. Several researchers have studied software reuse but still there remain lacuna in the study of re-usability in software development. This paper clearly points out the necessity of re-usability in software projects and the need for research in this area.", "num_citations": "12\n", "authors": ["1222"]}
{"title": "Fundamentals, present and future perspectives of speech enhancement\n", "abstract": " Speech enhancement has substantial interest in the utilization of speaker identification, video-conference, speech transmission through communication channels, speech-based biometric system, mobile phones, hearing aids, microphones, voice conversion etc. Pattern mining methods have a vital step in the growth of speech enhancement schemes. To design a successful speech enhancement system consideration to the background noise processing is needed. A substantial number of methods from traditional techniques and machine learning have been utilized to process and remove the additive noise from a speech signal. With the advancement of machine learning and deep learning, classification of speech has become more significant. Methods of speech enhancement consist of different stages, such as feature extraction of the input speech signal, feature selection, feature selection followed by …", "num_citations": "11\n", "authors": ["1222"]}
{"title": "Data Mining: A prediction Technique for the workers in the PR Department of Orissa (Block and Panchayat)\n", "abstract": " This paper presents the method of mining the data and which contains the information about the large information about the PR (Panchayat Raj Department)of Orissa.We have focused some of the techniques,approaches and different methodologies of the demand forecasting. Every organizations are operated in different places of the country. Each place of operation may generate a huge amount of data. In an organization, worker prediction is the difficult task of the manager. It is the complex process not only because its nature of feature prediction but also various approaches methodologies always makes user confused. This paper aims to deal with the problem selection process. In this paper we have used some of the approaches from literature are been introduced and analyzed to find its suitable organization and situation. Based on this we have designed with automatic selection function to help users make a prejudgment. This information about each approach will be showed to users with examples to help understanding. This system also provides calculation function to help users work out a predication result. Generally the new developed system has a more comprehensive functions compared with existing ones. It aims to improve the accuracy of demand forecasting by implementing the forecasting algorithm. While it is still a decision support system with no ability of make the final judgment.This type of huge amount of data are are available in the form of different ways which has drastically changed in the areas of science and engineering.To analyze, manage and make a decision of such type of huge amount of data we need techniques …", "num_citations": "10\n", "authors": ["1222"]}
{"title": "Security issues over E-commerce and their solutions\n", "abstract": " E-commerce (electronic commerce) or EC is the buying and selling of goods and services, or the transmitting of funds or data, over an electronic network, primarily the internet. These business transactions occur either as b to b (business-to-business), b to c (business-to-consumer), c to c (consumer-to-consumer) or c to b (consumer-to-business). It is the trading or in products or services using computer networks like Internet or online social networks. Here the Business conducted through the use of computers, telephones, fax machines, barcode readers, credit cards, automated teller machines (ATM) or other electronic appliances without the exchange of paper-based documents or physically moving to a shopping mall. It includes activities such as procurement, order entry, transaction processing, online payment, authentication, inventory control, order fulfillment, shipment, and customer support. When a buyer pays with a bank card swiped through a magnetic-stripe-reader, he or she is participating in e-commerce. E-commerce Security is a part of the Information Security framework and is specifically applied to the components that affect ecommerce including of Data security and other wider realms of the Information Security framework. E-commerce security is the protection of e-commerce assets from unauthorized access, use, alteration, or destruction. Dimensions of e-commerce security-Integrity, Non-repudiation, Authenticity, Confidentiality, Privacy, Availability. Ecommerce offers the banking industry great opportunity, but also creates a set of new risks and vulnerability such as security threats, hackings. Therefore it is an essential management …", "num_citations": "9\n", "authors": ["1222"]}
{"title": "A systematic survey on IoT security issues, vulnerability and open challenges\n", "abstract": " The Internet of things has changed the technology to a new era, which enhanced our lifestyle. Because of the popularity of IoT in real world, the implementation of IoT in different areas created mislead of malicious access and security issue. Many researchers have studied, explored and opened the problems in security. The IoT is a concept which is an interconnection of our day-to-day devices. Devices are now elegantly communicating to human or each other. Each connected devices are attached to sensors and actuator senses and understands what is going on and performs the task accordingly. This paper discusses the different levels of IoT architecture and vulnerabilities in each level. The IoT devices are securely hackable and negotiable to use as per the requirement of malicious users. In this paper, we discuss the significant issues and challenges in the IoT environment and its communication, security, open …", "num_citations": "8\n", "authors": ["1222"]}
{"title": "Software reusability metrics estimation from the social media by using evolutionary algorithms: refactoring prospective\n", "abstract": " Software expansion is rising with the help of the standard paradigm in the 21st century. The maximum contribution of software growth focuses mainly on object-oriented development methodologies. This paradigm helps the developer to develop code quickly and makes sure that the platform assists in producing a quality product. The software reusability metrics play a crucial role for software development. To overcome the scalability issues, researchers and developers both adopt a CK metrics suite to extract the software metrics to extract the features from the repositories. The main objective of this article is to extract the set of metrics from social media by using novel evolutionary techniques. Dissimilar features within this area are examined with a suitable research query that discovers the potential and extent.", "num_citations": "7\n", "authors": ["1222"]}
{"title": "Shadow Image Based Reversible Data Hiding Using Addition and Subtraction Logic on the LSB Planes\n", "abstract": " Image steganographic communication demands a fair trade-off among the three diametrically opposed metrics such as higher capacity, larger visual quality, and attack survival ability (ASA). Recently, some reversible data hiding (RDH) techniques using dual images have shown promising results to achieve the aforementioned needs. However, maintaining a balance among these metrics is still an open challenge. In this paper, using the concept of shadow image, which is basically the replica of the cover image (CI) and performing some simple addition and subtraction logic on the shadow image pixels, we propose an improved RDH technique that offers larger capacity, better stego-image (SI) quality and higher ASA. At first, during embedding, three shadow images of the CI are produced. Then, the shadow image pixels are adjusted based on their XOR features of the least significant bit planes. After embedding the …", "num_citations": "4\n", "authors": ["1222"]}
{"title": "Ambient assisted living predictive model for cardiovascular disease prediction using supervised learning\n", "abstract": " The rapid increase of the aged population and challenges towards taking health care and social care become the key point for the industry and researchers nowadays. Heart diseases are typical chronic illnesses with a high recurrence rate. In some of the cases, a heart attack occurs suddenly without any omens. Patients typically live in their homes rather than in hospitals and are often unable to access medical care in an emergency. Cardiovascular disease leads to a significant difficulty for the doctors to know the patient’s status in time, and it becomes one of the significant reasons for death. To overcome these problems, a solution needs to design, implement, and validate adequately through an appropriate base knowledge. To overcome these challenges, remotely real-time patient’s health data can be identified. Today Internet of Things is playing a key role in solving the problem of heart disease. The …", "num_citations": "4\n", "authors": ["1222"]}
{"title": "Drowsiness alert, alcohol detect and collision control for vehicle acceleration\n", "abstract": " This system aims to make the driving vehicle safer and protect from drowsiness, alcohol detection avoids accidents and collision between the vehicles while driving and minimizes the road accidents. This product will come to prepare a combination of face detection and face contours along with an additional feature of alcohol consumption of driver and as an accordance, the vehicle acceleration is kept. This product consists of deep learning algorithms applied with microcontroller and interface with the microprocessor. The face will detect using computer vision and forms contours around the face. The person is checked with drowsiness detection then alcohol detection through a set of the device. The set of device checks for alcohol parameters taken by the person. The device used in this paper uses a display interface to show and notify alertness. It messages the concerned person to pick up the person who is being …", "num_citations": "4\n", "authors": ["1222"]}
{"title": "Scrambling and descrambling of document image for data security in cloud computing\n", "abstract": " This paper presents the issue of security for the document image, which may store in the cloud environment. To provide the protect to the document image is gained by using the Arnold Transform scrambling and descrambling method. In today’s scenario, we are witnesses of the rapid development of the technology. The security of data is becoming the most critical factor. The Document image is treats as the digital property of any individual person, organization or any Government sector. The digitized documents are stored from any place and allow the access also from any place on the globe, by using Cloud computing technologies. Hence, there has been an issue of security, which plays the important role. The security issue still exists in cloud computing. This security issue is motivated to address in this paper. We have considered the Arnold Transformation method for scrambling the document image. The image …", "num_citations": "4\n", "authors": ["1222"]}
{"title": "Complexity estimation by using multiparadigm approach: a proposed metrics and algorithms\n", "abstract": " The factors upsetting directness of a software code were calculated manually using traditional approach which is not suitable in these days. There are numerous software tools are available in the market but they are not reliable due to vast number of metrics are available and each and every metrics are not specific definitions. This paper investigated factors which are affecting for understanding the procedural and object oriented code and found that software metrics can be calculated by using the web-engineering technology especially multiparadigm language. The most important parts of this paper are propped algorithms for estimating an object-oriented metrics. The planned metrics were empirically authenticated in diverse paradigms. The exigent task of this paper is all about the evaluation strategy of an object-oriented metrics by using multiparadigm language (JavaScript). The proposed model is developed to …", "num_citations": "4\n", "authors": ["1222"]}
{"title": "Estimation of complexity by using an object oriented metrics approach and its proposed algorithm and models\n", "abstract": " The high pace emergence of software applications and associated technologies have enabled us an efficient and luxurious. This research paper focus the procedure of investigating the different object oriented metrics by taking an example and finally evaluate complexities, statistical measurements. A proposed model, flowchart and algorithm are used for measuring the metrics in the software project. Comparison done between the programming languages like C++ and Python and conclude that Python is better than C++.", "num_citations": "4\n", "authors": ["1222"]}
{"title": "The Utilization of Information and Communication Technology (ICT) In the MSME’s of the J&K, with its Impacts\n", "abstract": " The research, investigates the utilization of \"ICT\", in the MSME’s of the J&K, with its impacts and proved that 70% of the MSME’s with ICT is more developed than the MSME’s not installed with \"ICT\", on the basis on my research, conducted with the help of surveys, questionnaires, and personal interviews with different respondents of the randomly selected 100 MSME’s and the findings are most of the MSME’s 70% used ICT system and take the advantages of the technology and provide better solutions to its consumers, so as to face competition and survives in the markets. The use of ICT in MSME’S’s really impacts a significant change in profits. 64% of the respondents agreed that they really increase their profit; after installing the ICT system, 12% MSME’s agreeing that they have a tremendous change in their profits. And 8% of industries show an increasing trend toward Profits. This shows that the ICT really performs …", "num_citations": "3\n", "authors": ["1222"]}
{"title": "IoT based Smart Parking System: A Proposed Algorithm and Model\n", "abstract": " Today, due to the growth of IoT(Internet of Things) the concept of smart cities has gained considerable popularity. To maximize the productivity and reliability of urban infrastructure consistent efforts are being made in the field of IoT. Many problems such as traffic congestion and road safety are being solved by the use of IoT. Today peoples face a common problem in the parking area to find a free parking slot in cities. In this study, we are designing a Smart Parking System, which will enable the user to find Parking slots in a given parking area. It also avoids unnecessary traveling through filled parking lots. In this paper, the author presents a smart parking system with the help of IoT over Wi-Fi. This intelligent parking system consists of an IoT module that helps to track the availability of each single vacant parking space. The author used an Arduino Uno, which can be embedded over the Wi-Fi module to establish a …", "num_citations": "3\n", "authors": ["1222"]}
{"title": "Rasmita Panigrahi\n", "abstract": " The exponential rise in software systems and allied applications has alarmed industries and professionals to ensure high quality with optimal reliability, maintainability etc. On contrary software companies focus on developing software solutions at the reduced cost corresponding to the customer demands. Thus, maintaining optimal software quality at reduced cost has always been the challenge for developers. On the other hand, inappropriate code design often leads aging, smells or bugs which can harm eventual intend of the software systems. However, identifying a smell signifier or structural attribute characterizing refactoring probability in software has been the challenge. To alleviate such problems, in this research code-metrics structural feature identification and Neural Network based refactoring prediction model is developed. Our proposed refactoring prediction system at first extracts a set of software code metrics from object-oriented software systems, which are then processed for feature selection method to choose an appropriate sample set of features using Wilcoxon rank test. Once obtaining the optimal set of code-metrics, a novel ANN classifier using 5 different hidden layers is implemented on 5 open source java projects with 3 data sampling techniques SMOTE, BLSMOTE, SVSMOTE to handle class imbalance problem. The performance of our proposed model achieves optimal classification accuracy, F-measure and then it has been shown through AUC graph as well as box-plot diagram.", "num_citations": "3\n", "authors": ["1222"]}
{"title": "Prediction Of Accuracy On Open Source Java Projects Using Class Level Refactoring\n", "abstract": " The refactoring approach is used to restructure the software system without altering its external functionalities. Our research objective is to analyze the accuracy of the software metrics using machine learning classifiers. After predicting the accuracy we can refactor the inaccurate source metrics by using different refactoring tools and machine learning algorithms. We have considered 30 code metrics from 3 open source java projects by using different framework like antlr4,junit and oryx at the class level and predict its accuracy using different machine learning classifiers. We have used Gaussian, Bernoulli and Multinomial classifiers to predict the accuracy of the software metrics. Statistical significant test reveals the mean accuracy for the above sources are 33.33%,39%,48.33% respectively. As per the prediction analysis we can correct the fault and improve the performance of our source metrics by conducting unit …", "num_citations": "2\n", "authors": ["1222"]}
{"title": "Digital Advancement in AgriTech by Using Evolutionary Techniques\n", "abstract": " The Strategic decision to take machine learning and AI as a tool to enhance agriculture production is to enrich a farmer’s valuable time. It has an immense opportunity to make secured crops and healthy environment in due time. In extreme weather condition and drastic change in a situation many predictive and recognition techniques will improve not only the quality of crops but also their ability to producible. In this context, we have dedicated a proposed model which will predict for a real-time environment which crop will be benefitted on producing and for any particular area what should be the environmental condition for healthy productivity. This is done by using  a machine learning algorithm in seasonal trend scenario with predictive analysis and applying a pattern recognition technique for discovering cropping pattern and their evaluation.", "num_citations": "2\n", "authors": ["1222"]}
{"title": "The Statistical Measurement of an Object-Oriented Programme Using an Object Oriented Metrics\n", "abstract": " Object oriented design is more powerful than function oriented design. Previously the software was developed by using functional or structural approach but due to high quality demand, traditional metrics (i.e. Cyclomatic complexity, lines of code, comment percentage) cannot be applied. Object oriented metric assures to reduce cost and maintenance effort by serving earlier predictors to estimate software faults. The Object Oriented Analysis and Design of software gives the many benefits like reusability, decomposition of problems in to easily understandable objects. This paper presents the different object oriented metrics qualities in different dimensions (i.e. size, complexity, quality, reliability, etc). Object oriented metrics are used to analyze the complexity of any object oriented language (i.e. java, c++, C Sharp).In this paper we have taken the different sets of programs using C++ and Java. It concludes that …", "num_citations": "2\n", "authors": ["1222"]}
{"title": "Sensorless Vector Control of Induction Motor Using Direct Adaptive RNN Speed Estimator.\n", "abstract": " This paper describes a Model Reference Adaptive System (MRAS) based scheme using a multilayer Recurrent Neural Network (RNN) for online speed estimation of sensorless vector controlled induction motor drive. The speed value is obtained at the multilayer Artificial Neural Network (ANN) output and the feedback is connected between the output and the input node so as to extract the dynamic recurrent neural network features. This makes the estimator robust to parameter variations and system noises. The weights of the neurons are continuously updated online using backpropagation training algorithm and the estimated speed is then fed back in the speed control loop to realize the speed sensorless indirect vector control operation using MATLAB/SIMULINK. The simulated performance of the proposed speed estimator is investigated for both speed and load torque variations which showed good dynamic …", "num_citations": "2\n", "authors": ["1222"]}
{"title": "Prognosticate of the financial market utilizing ensemble-based conglomerate model with technical indicators\n", "abstract": " The financial exchange is known for its outrageous multifaceted nature and instability, and individuals are continually searching for a precise and successful approach to control stock trading. The exact expectation of stock cost could assume a significant job in helping speculators improve stock returns. The motivation behind this paper is to precisely foresee the pattern of stock costs, giving a reference model to the pattern of financial exchange and the following technique for stock value expectation, and offer some incentive reference for a look into the estimating model of securities exchange and speculators investment choice. Research using a hybrid model to anticipate the stock market will have a fundamental improvement that stood out from using a single model to forecast the same.             The proposed model is a regression-based ensemble model where specialized technical indicators are used as …", "num_citations": "1\n", "authors": ["1222"]}
{"title": "A Hybrid Approach to Identify Code Smell Using Machine Learning Algorithms\n", "abstract": " Code smell aims to identify bugs that occurred during software development. It is the task of identifying design problems. The significant causes of code smell are complexity in code, violation of programming rules, low modelling, and lack of unit-level testing by the developer. Different open source systems like JEdit, Eclipse, and ArgoUML are evaluated in this work. After collecting the data, the best features are selected using recursive feature elimination (RFE). In this paper, the authors have used different anomaly detection algorithms for efficient recognition of dirty code. The average accuracy value of k-means, GMM, autoencoder, PCA, and Bayesian networks is 98%, 94%, 96%, 89%, and 93%. The k-means clustering algorithm is the most suitable algorithm for code detection. Experimentally, the authors proved that ArgoUML project is having better performance as compared to Eclipse and JEdit projects.", "num_citations": "1\n", "authors": ["1222"]}
{"title": "Heart disease prediction by using novel optimization algorithm: A supervised learning prospective\n", "abstract": " Data analysis in medicine is becoming more and more frequent to clarify diagnoses, refine research methods, and plan appropriate equipment supplies according to the importance of the pathologies that appear. Artificial intelligence offers software solutions that are required to analyze the present data for optimal prediction of results. A system model is capable of several data processing algorithms for the classification of heart disease. This research work is particularly interested in the category of data. The classification allows us to obtain a prediction model from training data and test data. These data are screened by a classification algorithm that produces a new model capable of detailed data, possibly having the same classes of data through the combination of mathematical tools and computer methods. To analyze the present data to predict optimal results, we need to use the optimization technique. This …", "num_citations": "1\n", "authors": ["1222"]}
{"title": "Predict the Performance of Students and School on Educational Database (U-DISE)\n", "abstract": " In India, advancement in technology is imperative for the betterment of the education system. For improving the nature of education given to the understudies, the School must make a collective climate for Technological Changes. The Education System generates a large amount of data related to different indicators involved in the U-DISE+ and SDMIS database of the Education System. However, these indicators are considered as very important for quality Education. The goal of this paper is to anticipate the execution of School and understudies based on UDISE Plus information by utilizing different classification Algorithms.", "num_citations": "1\n", "authors": ["1222"]}
{"title": "An automation API for authentication and security for file uploads in the cloud storage environment\n", "abstract": " Cloud Computing is widespread to support industrial and academy related applications worldwide. The archival data process in the cloud is one of the challenging tasks. To handle this issue, the authors addressed the model, which allows authenticating the cloud storage using the JOSS (Java Library for Open stack storage) through the authentication URL. To achieve the authentication of the heterogeneous data while uploading into the cloud storage, a proposed model developed using the JOSS. To address this research question and demonstrate our approach, we have created the API for the archival solution in order to authenticate the cloud storage using the JOSS authentication model, providing the authentication URL. It consists of the user id and password for the verification of the user while transmitting the data into the cloud storage. The API is becoming dynamic and complex, and one of the major …", "num_citations": "1\n", "authors": ["1222"]}
{"title": "Machine Learning Models for Bird Species Recognition Based on Vocalization: A Succinct Review\n", "abstract": " Bird sound classification based on their vocalization has become a significant research field nowadays. Acoustic sound produced by the birds is very rich and used to detect their species. In earlier days ornithologist used to detect the bird species, but this manual recognition is costly and requires huge amount of time. With the advancement of machine learning and deep learning, classification of syllables has become more significant. Methods of automatic sound recognition consist of different stages, such as preprocessing of the input audio file, segmentation of syllables, feature extraction followed by classification. In this study the models used for audio classification are concisely reviewed. Identification becomes more challenging due to a huge similarity between different species. However, noise reduction from the audio files is possible using several machine learning models. Deep learning techniques are also an emerging field in the classification domain, which is discussed in this review. Using these models, it is possible for researchers to detect species or even individual bird from their vocalization which is more time efficient. This paper aims to deliver a review summary, and present guidelines for utilizing the broadly used machine learning techniques in order to identify the challenges as well as future research directions of bird song recognition systems.", "num_citations": "1\n", "authors": ["1222"]}
{"title": "A Cyclic Scheduling for Load Balancing on Linux in Multi-core Architecture\n", "abstract": " Nowadays, the industry of computer hardware is moving rapidly toward large-scale multi-core processors. At the same time, the number of cores on a chip increases dramatically. With the advent of multicore processors, parallel execution of multiple tasks has become a common practice. The load balancing technique is one of the important factors for the utilization of these processing cores. Load balancing will really improve the performance of multi-cores. Various scheduling algorithms have addressed this issue considering multi-core systems. Researchers found system performs better when the load on cores is balanced. This thesis is an attempt to discuss a new load balancing scheduler in multi-core platform, we have focused Linux kernel as open source O.S. because of its popularity and large-scale use. Researchers have proposed some improvement areas in Linux load balancing for multi-core platform. We …", "num_citations": "1\n", "authors": ["1222"]}
{"title": "A Literature Review on Image and Emotion Recognition: Proposed Model\n", "abstract": " This primary focus of this literature review is to build an image detection and emotion detection and recognition. It will analyze image content as well as the facial expression of the input image. Actions, behaviours, facial expressions, poses are considered as channels, and this channel helps to convey human’s emotion. This paper has a prototype system which will automatically detect emotion represented on the face. For classifying the universal emotions, like sadness, anger, happiness, disgust, fear and surprise, an image processing combined with a neural network-based solution will be used. A coloured image containing face of human is given as an input and after the face is detected, image processing based on feature extraction method is used and the set of different values are obtained, after processing and the values which are extracted are given as an input to the neural network for image and emotion …", "num_citations": "1\n", "authors": ["1222"]}
{"title": "THE SURVEY OF DATA MINING APPLICATIONS AND FEATURE SCOPE Pragnyaban Mishra, Neelamadhab Padhy\n", "abstract": " The advent of information technology in various fields of human life has lead to the large volumes of data storage in various formats like records, documents, images, sound recordings, videos, scientific data, and many new data formats. The data collected from different applications require proper mechanism of extracting knowledge/information from large repositories for better decision making. Knowledge discovery in databases (KDD), often called data mining, aims at the discovery of useful information from large collections of data. The important reason that attracted a great deal of attention in information technology the discovery of useful information from large collections of data industry towards field of “Data mining” is due to the perception of “we are data rich but information poor”. There is huge volume of data but we hardly able to turn them in to useful information and knowledge for managerial decision making in businessTo generate information it requires massive collection of data. The data can be simple numerical figures and text documents, to more complex information such as spatial data, multimedia data, and hypertext documents. To take complete advantage of data; the data retrieval is simply not enough, it requires a tool for automatic summarization of data, extraction of the essence of information stored, and the discovery of patterns in raw data. With the enormous amount of data stored in files, databases, and other repositories, it is increasingly important, to", "num_citations": "1\n", "authors": ["1222"]}