{"title": "Design of a Smart Mobile Case Framework Based on the Internet of Things\n", "abstract": " The present research portray the design of building a smart case ready to follow its client making its way when cleared out. After a survey of the present way adherent gadgets accessible for performing distinctive assignments, we stretched out our approach that expects to build up a case that performs errands on its manmade brainpower when guided. Specifically, the approach depends on a control framework ready to execute hindrance shirking and focus on its Following conduct. Additionally, a relative area gadget in view of a flag producer (Set on the target single person) and an directional sensor. The folder case is created to be moderate for another innovation that can prompt new applications to help people further. Displayed a proposed Method to accomplish human after conduct as an initial move toward the advancement of a wise folder the smart case moving along with man. The system for …", "num_citations": "8\n", "authors": ["439"]}
{"title": "Comparison of manual and automatic testing using genetic algorithm for information handling system\n", "abstract": " Testing is one of the vital activities which must be performed during the software development mainly intent to find the errors according to customer requirement. The purpose of Information Handling for improving software reliability is to provide better service to the administrator or useful for applications developed in an organization. Manual testing process an inter-office communication has been provided for all the developers, managers, tester to communicate. As developer develops the application where the tester can generate the test case required for an application and compare the actual value and expected value the required bug reports as been generated manually. Automation testing process uses a VBScript scripting language to specify the test procedure and to manipulate the objects and controls of the application under test. Where the test cases are been as scripts. In this process it involves the functional …", "num_citations": "5\n", "authors": ["439"]}
{"title": "Surface EMG Based Intelligent Signal Processing for Exoskeleton\n", "abstract": " The goal of this paper is to develop an intelligent human-machine interface based on the Electromyographic (EMG) signals from limbs and other locations on the human body. The EMG based system is concerned with detection, processing, classification and control application to drive the exoskeleton system. Drawbacks with existing human robotic interface technology is that humans have to make many decisions which requires training. The key idea proposed is that the decisions and control information required for operating the robotic arms can be made by an intelligent signal processing system by sensing EMG activity via electrodes and estimate the parameters of the natural motion of the limbs.", "num_citations": "2\n", "authors": ["439"]}
{"title": "Software Bug Prediction\n", "abstract": " Overall software success of a product relies on its development and maintenance. Software Bug Prediction is an important concern which should be concentrated in developing a product. Softwarequality, reliability, and efficiency lies in detecting a bug at the earlier phase. Earlier many techniques have been proposed in developing a robust bug prediction model. This paper presents a software bug prediction model based on Machine Learning Algorithm. In Machine Learning Algorithms based on historical data any model can predict the faults which may encounter in future. Random Forest is an effective classification method for predicting faults. Overall goal in any process is to have high accuracy rate, machine learning algorithms made its mark in obtaining high accuracy rate.", "num_citations": "1\n", "authors": ["439"]}
{"title": "Finding reliable software using SPRT based on Inflection S-Shaped Model: An order statistics approach\n", "abstract": " To assess the software reliability by statistical means yields efficient results. In this paper, for an effective monitoring of failure process we have opted Sequential Probability Ratio Test (SPRT) over the time between every r th  failure (r is a natural number >=2) instead of inter-failure times. This paper projects a controlling framework based on order statistics of the cumulative quantity between observations of time domain failure data using mean value function of Inflection S-Shaped Model. The two unknown parameters can be estimated using the Maximum Likelihood Estimation (MLE).", "num_citations": "1\n", "authors": ["439"]}