{"title": "Value-cognitive boosting with a support vector machine for cross-project defect prediction\n", "abstract": " It is well-known that software defect prediction is one of the most important tasks for software quality improvement. The use of defect predictors allows test engineers to focus on defective modules. Thereby testing resources can be allocated effectively and the quality assurance costs can be reduced. For within-project defect prediction (WPDP), there should be sufficient data within a company to train any prediction model. Without such local data, cross-project defect prediction (CPDP) is feasible since it uses data collected from similar projects in other companies. Software defect datasets have the class imbalance problem increasing the difficulty for the learner to predict defects. In addition, the impact of imbalanced data on the real performance of models can be hidden by the performance measures chosen. We investigate if the class imbalance learning can be beneficial for CPDP. In our approach, the …", "num_citations": "128\n", "authors": ["250"]}
{"title": "A transfer cost-sensitive boosting approach for cross-project defect prediction\n", "abstract": " Software defect prediction has been regarded as one of the crucial tasks to improve software quality by effectively allocating valuable resources to fault-prone modules. It is necessary to have a sufficient set of historical data for building a predictor. Without a set of sufficient historical data within a company, cross-project defect prediction (CPDP) can be employed where data from other companies are used to build predictors. In such cases, a transfer learning technique, which extracts common knowledge from source projects and transfers it to a target project, can be used to enhance the prediction performance. There exists the class imbalance problem, which causes difficulties for the learner to predict defects. The main impacts of imbalanced data under cross-project settings have not been investigated in depth. We propose a transfer cost-sensitive boosting method that considers both knowledge transfer and …", "num_citations": "93\n", "authors": ["250"]}
{"title": "A hybrid instance selection using nearest-neighbor for cross-project defect prediction\n", "abstract": " Software defect prediction (SDP) is an active research field in software engineering to identify defect-prone modules. Thanks to SDP, limited testing resources can be effectively allocated to defect-prone modules. Although SDP requires sufficient local data within a company, there are cases where local data are not available, e.g., pilot projects. Companies without local data can employ cross-project defect prediction (CPDP) using external data to build classifiers. The major challenge of CPDP is different distributions between training and test data. To tackle this, instances of source data similar to target data are selected to build classifiers. Software datasets have a class imbalance problem meaning the ratio of defective class to clean class is far low. It usually lowers the performance of classifiers. We propose a Hybrid Instance Selection Using Nearest-Neighbor (HISNN) method that performs a hybrid …", "num_citations": "85\n", "authors": ["250"]}
{"title": "Effective multi-objective naïve Bayes learning for cross-project defect prediction\n", "abstract": " Software defect prediction predicts fault-prone modules which will be tested thoroughly. Thereby, limited quality control resources can be allocated effectively on them. Without sufficient local data, defects can be predicted via cross-project defect prediction (CPDP) utilizing data from other projects to build a classifier. Software defect datasets have the class imbalance problem, indicating the defect class has much fewer instances than the non-defect class does. Unless defect instances are predicted correctly, software quality could be degraded. In this context, a classifier requires to provide high accuracy of the defect class without severely worsening the accuracy of the non-defect class. This class imbalance principle seamlessly connects to the purpose of the multi-objective (MO) optimization in that MO predictive models aim at balancing many of the competing objectives. In this paper, we target to identify effective …", "num_citations": "64\n", "authors": ["250"]}
{"title": "Improving vulnerability prediction accuracy with secure coding standard violation measures\n", "abstract": " As the need of software has been increasing, the danger of malicious attacks against software has been worse. In order to fortify software systems against adversaries, researchers have devoted significant efforts on mitigating software vulnerabilities. To eliminate security vulnerabilities from software with lower inspection effort, vulnerability prediction approaches have been emerged. By allocating human and time resource on the potentially vulnerable subset, development organization could eliminate vulnerabilities in a cost effective manner. In the vulnerability prediction approaches, a vulnerability prediction model is constructed based on various software attributes. However, vulnerability prediction models based on the traditional software attributes have provided poor prediction accuracy or low cost effectiveness since the traditional software attributes are unable to reflect vulnerability characteristics sufficiently. In …", "num_citations": "31\n", "authors": ["250"]}
{"title": "Location-based web service QoS prediction via preference propagation to address cold start problem\n", "abstract": " Many web-based software systems have been developed in the form of composite services. It is important to accurately predict the Quality of Service (QoS) value of atomic web services because the performance of such composite services depends greatly on the performance of the atomic web service adopted. In recent years, collaborative filtering based methods for predicting the web service QoS values have been proposed. However, they are mainly faced with a cold start problem that is difficult to make reliable prediction due to highly sparse historical data, newly introduced users and web services, and the existing work only deals with the case of newly introduced users. In this article, we propose a Location-based Matrix Factorization using a Preference Propagation method (LMF-PP) to address the cold start problem. LMF-PP fuses invocation and neighborhood similarity, and then the fused similarity is utilized …", "num_citations": "22\n", "authors": ["250"]}
{"title": "An integrated software management tool for adopting software product lines\n", "abstract": " Software product line engineering has become widely known that it provides software organization with tremendous profits through systematical reuse to a number of organizations that require producing various and similar kinds of software products. However, when adopting software product lines, it has been reported that there are several challenges, e.g., the shortage of procedural support for application engineering, and original reasons of complexity and implicit properties for variability management. In order to address these major problems, an integrated tool support is required to guide software product line engineering process. The integrated software management tool for adopting software product lines, called \"ISMT4SPL\" can offer beneficial traceability among the artifacts created from domain engineering and application engineering. Furthermore, all the artifacts could consistently be managed by explicit …", "num_citations": "9\n", "authors": ["250"]}
{"title": "Improving prediction robustness of VAB-SVM for cross-project defect prediction\n", "abstract": " Software defect prediction is important for improving software quality. Defect predictors allow software test engineers to focus on defective modules. Cross-Project Defect Prediction (CPDP) uses data from other companies to build defect predictors. However, outliers may lower prediction accuracy. In this study, we propose a transfer learning based model called VAB-SVM for CPDP robust in handling outliers. Notably, this method deals with the class imbalance problem which may decrease the prediction accuracy. Our proposed method computes similarity weights of the training data based on the test data. Such weights are applied to Boosting algorithm considering the class imbalance. VAB-SVM outperformed the previous research more than 10% and showed a sufficient robustness regardless of the ratio of outliers.", "num_citations": "8\n", "authors": ["250"]}
{"title": "Designing an architecture of SNS platform by applying a product line engineering approach\n", "abstract": " The demand of new Social Networking Service (SNS) is high because the SNSs have been popular these days. In order to deliver various SNSs as early as possible, software product line (SPL) approach can be useful. By using the state of the practices of SPL, this paper shows how to manage commonalities and variabilities of SNS. Specifically, to make an architecture design, presented practices include: understanding relevant domains, requirements engineering, architecture definition. The strengths and weaknesses of Face book architecture are evaluated with the Architecture Tradeoff Analysis Method (ATAM). As a result of applying a framework for SPL practice, layered view and component-based view are illustrated along with variabilities represented by Product Line UML-based Software Engineering (PLUS) and Orthogonal Variability Model (OVM). Based on the analysis of requirements of SNS, additional …", "num_citations": "4\n", "authors": ["250"]}
{"title": "Effective harmony search-based optimization of cost-sensitive boosting for improving the performance of cross-project defect prediction\n", "abstract": " Software Defect Prediction (SDP) is a field of study that identifies defective modules. With insufficient local data, a company can exploit Cross-Project Defect Prediction (CPDP), a way to build a classifier using dataset collected from other companies. Most machine learning algorithms for SDP have used more than one parameter that significantly affects prediction performance depending on different values. The objective of this study is to propose a parameter selection technique to enhance the performance of CPDP. Using a Harmony Search algorithm (HS), our approach tunes parameters of cost-sensitive boosting, a method to tackle class imbalance causing the difficulty of prediction. According to distributional characteristics, parameter ranges and constraint rules between parameters are defined and applied to HS. The proposed approach is compared with three CPDP methods and a Within-Project Defect Prediction (WPDP) method over fifteen target projects. The experimental results indicate that the proposed model outperforms the other CPDP methods in the context of class imbalance. Unlike the previous researches showing high probability of false alarm or low probability of detection, our approach provides acceptable high PD and low PF while providing high overall performance. It also provides similar performance compared with WPDP.", "num_citations": "3\n", "authors": ["250"]}
{"title": "Predicting just‐in‐time software defects to reduce post‐release quality costs in the maritime industry\n", "abstract": " Background The importance of software in maritime transportation is rapidly increasing as the industry seeks to develop and utilize innovative future ships, which can be realized using software technology. Due to the safety‐critical nature of ships, software quality assurance (SQA) has become an essential prerequisite for such development.  Objective Based on the unique characteristics of the maritime domain, the purpose of this study was to achieve effective SQA resource allocation to reduce post‐release quality costs.  Method Software defect prediction (SDP) is employed to predict defects in newly developed software based on models trained with past software defects and to update information using machine learning. This study demonstrated that just‐in‐time SDP is applicable to maritime domain practice and can reduce post‐release quality costs via combination with an estimation model, qCOPLIMO …", "num_citations": "2\n", "authors": ["250"]}