{"title": "Ticketing chatbot service using serverless NLP technology\n", "abstract": " Personal assistant using a human operator need some time to process single request such as ticket booking, ordering something, and get services. One request can contain many queries for some information provided on the internet. Business performance values time efficiency so must be considered an alternative way to take request. Chatbot can give 24 hours service which can become an advantage besides using a human personal assistant. Chatbot acts like routing agent that can classify user context in conversation. Chatbot helped with natural language processing (NLP) to analyze the request and extract some keyword information. One important process in NLP is morphological analysis and part of speech (POS) tagging. POS help to parse the meaning of chat text based on a set of rules. The rule base is specific to some language and designed to capture all the keyword relies on chat text. Keyword in …", "num_citations": "25\n", "authors": ["767"]}
{"title": "Aplikasi Sistem Informasi Rumah Sakit Berbasis Web Pada Sub-Sistem Farmasi Menggunakan Framework Prado\n", "abstract": " Teknologi informasi merupakan salah satu teknologi yang sedang berkembang dengan pesat pada saat ini. Dengan kemajuan teknologi informasi, pengaksesan terhadap data atau informasi yang tersedia dapat berlangsung dengan cepat, efisien serta akurat. Penelitian ini bertujuan untuk memberikan gambaran sebuah model sistem informasi rumah sakit menggunakan Layanan Web, melalui pembangunan sebuah aplikasi sistem informasi rumah sakit untuk subsistem farmasi. Dengan aplikasi ini, pengguna dapat dengan mudah memperoleh pelayanan dan informasi seluruh kegiatan yang ada khususnya dalam hal manajemen farmasi pada rumah sakit dimanapun dan kapanpun mereka berada secara on-line.Aplikasi ini dibuat berbasiskan web dengan menggunakan framework Prado berbasiskan bahasa pemrograman PHP dan MySQL sebagai basis datanya. Dalam pembuatannya, aplikasi ini disesuaikan dengan kebutuhan rumah sakit secara umum. Tentu saja pada awalnya dilakukan analisa kebutuhan untuk suatu sistem informasi rumah sakit agar penyediaan informasi dapat dilakukan dengan berbasiskan web. Aplikasi Sistem Informasi Rumah Sakit ini dapat digunakan sebagai sarana penyedia layanan dan informasi bagi penggunanya baik untuk dokter, staf dan karyawan, maupun pasien suatu rumah sakit dimanapun dan kapanpun mereka berada. Pengguna mendapatkan semua informasi yang akurat karena informasi yang tersedia senantiasa diperbaharui. Aplikasi ini akan lebih baik jika memiliki keamanan data yang lebih tinggi dan penambahan modul", "num_citations": "13\n", "authors": ["767"]}
{"title": "Software ecosystem modeling\n", "abstract": " Increasingly, software producing organizations and their partners are organizing around extendable platforms, forming software ecosystems, a topic that is receiving increasing attention at the moment. Unfortunately, inadequate modeling guidelines exist currently for creating theoretical and visual models of software ecosystems, hampering advancements in this area. Even though, many different tools are available, these do not provide pointers and guidelines for performing correct and insightful modeling of software ecosystems. The aim of this PhD project is to create a modeling framework, consisting of tools, guidelines, and foundations for modeling software ecosystems. With such a framework, software ecosystem researchers, policy makers, and strategic managers of software producing organizations will gain insight into their ecosystems quicker and with higher fidelity.", "num_citations": "10\n", "authors": ["767"]}
{"title": "Pembangunan Aplikasi Penyusunan Jadwal Kuliah Menggunakan Algoritma Semut\n", "abstract": " Kegiatan perkuliahan umumnya dilakukan dengan tatap muka antara pengajar(dosen) dengan mahasiswa dalam waktu yang terbatas. Untuk mengatasi permasalahan itu, maka diperlukan efektifitas dalam penyusunan jadwal kuliah agar permasalahan kasus bentrok dapat diselesaikan. Kasus yang bisa dilihat sekarang ini adalah tentang bagaimana metode dalam pembuatan sebuah jadwal, metode masih berupa metode tradisional, yaitu penyusunan secara manual. Hal ini dapat menjadi permasalahan besar karena masih dimungkinkan adanya resiko permasalahan bentrok. Jadwal yang bentrok membuat mahasiswa kesulitan untuk memilih mata kuliah yang ingin mereka ambil dan permasalahan lain yang mungkin terjadi, hal ini dapat membuat berkurangnya waktu perkuliahan dalam satu semester. Semua permasalahan ini dapat diselesaikan dengan sebuah sistem yang dapat membuat jadwal secara otomatis. Tugas akhir ini akan membicarakan bagaimana membangun sebuah aplikasi penjadwalan otomatis mulai dari analisa kebutuhan hingga bagaimana sebuah permasalah penjadwalan dapat diselesaikan dengan menggunakan sebuah algoritma yang dinamakan algoritma semut. Algoritma ini adalah salah satu jenis meta-heuristic yang sudah terbukti dapat menyelesaikan banyak sekali permasalahan kombinatorial yang sulit. Algoritma ini meniru tingkah laku semut ketika mereka berada dalam sebuah koloni untuk mencari sebuah sumber makanan. Sistem yang ingin dibangun adalah sebuah aplikasi desktop dengan hasil akhir sebuah jadwal tanpa permasalahan bentrok lagi. Kata kunci: Masalah penjadwalan, meta …", "num_citations": "8\n", "authors": ["767"]}
{"title": "SRS Document Proposal Analysis on the Design of Management Information Systems According to IEEE STD 830-1998\n", "abstract": " A software development process generally consists of several stages ranging from analysis to implementation, which will result in need (requirement) of software. Results of analysis for different applications in a similar problem domain will usually produce similar definition needs. In the field of software engineering, especially in object- oriented software development, requirements for different problem domain have been developed. This research is to obtain a similarity (commonality) of the software requirements specifications, here in after in short-SRS. Management Information System (MIS) has been chosen due to several years has developed into concepts that are essential both in the scope of major agencies as well as small and medium scale. SRS is the identification of commonality for the MIS application which is focused on the function of customer service standards, particularly for the Management …", "num_citations": "7\n", "authors": ["767"]}
{"title": "Vehicle Distance Measurement Tuning using Haversine and Micro-Segmentation\n", "abstract": " In the globalization era, the vehicle tracking system is important and it is needed in the fleet asset management system. This management system has a significant role in good logistics distribution in order to measure mileage of truck traveling. Therefore, the existence of the global positioning system (GPS), information system, and network technology can help to monitor the fleet system. GPS devices, from anywhere and anytime, send JSON information by POST method in HTTP to the information system server through internet connection. Furthermore, the stakeholders, the customer and the company of fleet service, can measure the real distance which is gathered from GPS. Contribution of this research is to find the best distance measurement gathered by micro-segmentation technique and summarization of each segment by Haversine formula. Micro-segmentation in this research is performed by modification of …", "num_citations": "6\n", "authors": ["767"]}
{"title": "Implementation of Vehicle Traffic Analysis Using Background Subtraction in The Internet of Things (IoT) Architecture\n", "abstract": " Vehicle traffic analysis is one of the features that are provided in a smart city application. A camera is used to capture vehicles that are moving through on the road. Background subtraction is applied in order to detect the moving object, i.e., Gaussian Mixture Model. The system is developed under the Internet of Things (IoT) architecture, which all devices are associated using Internet connection. The calculated value is transmitted into cloud and received at the virtual server. Data are saved to a database and are able to be accessed through a web interface. We observe the applied system provides a good performance in terms of average accuracy exceeds 95.64%.", "num_citations": "5\n", "authors": ["767"]}
{"title": "Algoritma Genetika Dalam Pemilihan Spesifikasi Komputer\n", "abstract": " Algoritma genetika merupakan evolusi atau perkembangan dunia komputerÂ dalam bidang kecerdasan buatan (artificial intelligence). Algoritma ini memanfaatkan proses seleksi alamiah yang dikenal dengan proses evolusi. Dalam proses evolusi, individu secara terus-menerus mengalami perubahan gen untuk menyesuaikan dengan lingkungan hidupnya. Proses seleksi alamiah ini melibatkan perubahan gen yang terjadi pada individu melalui proses perkembangbiakan. Â", "num_citations": "5\n", "authors": ["767"]}
{"title": "Berpikir Kreatif dalam Pengambilan Keputusan\n", "abstract": " Everyone is always faced with the choice to take a decision. To be able to take the right decisions, every person should know the steps. This paper presents what the decision-making steps and what is the importance of creative thinking in decision making. Creative thinking will help decision makers to improve the quality and effectiveness of problem solving and decision making results were made. In relation to the process of decision making, creative thinking is needed, especially in identifying problems and develop alternative solutions.", "num_citations": "4\n", "authors": ["767"]}
{"title": "Analisis kebutuhan perangkat lunak menggunakan analisis faktor pada program studi ilmu keperawatan undip\n", "abstract": " The need to obtain the speed and information accuracy provided in an organization conducting dataprocessing in gross, complex and finite during make the organization require the information system tosupport their business. Systems analysis represent the early stage in determining quality of system development in informationsystem to be developed. Analysis of Requirement of sistem, one of the phase of systems analysis, haveplaying important role to formulate what must be owned and done by an information system. This report using quistioner of the measuring instrument by using modification of Likert scale for onehundred responder to get the data. Processing data is conducting bytest of validity and reability, thenfactor analysis is done for formulation of system requirement.", "num_citations": "4\n", "authors": ["767"]}
{"title": "Perancangan Aplikasi Auto Reply SMS Untuk Informasi, Pemesanan Dan Pembayaran Tiket Bioskop\n", "abstract": " Semakin berkembangnya zaman, manusia semakin menginginkan komunikasi yang praktis, ekonomis dan realtime untuk memperoleh suatu layanan informasi. Short Message Service (SMS) saat ini di Indonesia menjadi sebuah cara termurah untuk berkomunikasi. Dengan pemanfaatan SMS sebagai sarana layanan informasi, maka dapat dibuat sebuah sistem informasi yang bisa memberikan layanan informasi kepada seseorang atau sekelompok orang yang membutuhkannya. Salah satu layanan informasi tersebut adalah layanan informasi bioskop beserta sistem pembayarannya Layanan informasi, pemesanan serta pembayaran tiket bioskop ini dapat dijadikan cara untuk memberikan kelancaran proses pelayanan terhadap calon pengguna jasa bioskop. Sehingga sebuah sistem yang mampu menyimpan dan memproses semua data informasi pemesanan dan pembayaran diperlukan untuk proses selanjutnya. Berdasarkan kemudahan dan semakin berkembangnya pemakaian teknologi SMS, maka melalui tugas akhir ini penulis membuat aplikasi auto reply SMS untuk memperoleh informasi, pemesanan dan pembayaran tiket bioskop dengan memanfaatkan teknologi SMS banking. Perancangan aplikasi auto reply SMS ini menggunakan Borland Delphi sebagai bahasa pemrogramannya, MySQL sebagai basisdatanya, dan pemanfaatan tehnologi SMS banking yang diterapkan pada sistem untuk menerima notifikasi deposit dari para pelanggan. Dalam perancangan sistem penulis menggunakan metode pemodelan UML (Unified Modeling Language) yang terdiri dari usecase diagram, squence diagram, activity diagram, dan class …", "num_citations": "3\n", "authors": ["767"]}
{"title": "Design of Smart Open Parking Using Background Subtraction in the IoT Architecture\n", "abstract": " The Internet of Things (IoT) has evolved and penetrated to our live since the end of the last century. Nowadays, many devices for any purpose are connected through the Internet. A smart node, in smart campus environment, can detect an availability of an open parking space by calculating the vehicle that enters or outs from the space. The node applies a background subtraction method, which is deployed in IoT architecture. The Gaussian Mixture Model (GMM) is utilized to determine foreground and background image, in order to detect a moving object at an open area. Furthermore, the node can discriminate the type of vehicle with a high accuracy. The result of vehicle type classification is transmitted by the node through the Internet, and then it is saved to the data server. We observe the designed system succeeds delivering a good performance in terms of average accuracy determining car and motorcycle are 93 …", "num_citations": "2\n", "authors": ["767"]}
{"title": "Estimasi Biaya Pembuatan Perangkat Lunak Menggunakan Metode Cocomo II Pada Sistem Informasi Pelaporan Kegiatan Pembangunan\n", "abstract": " Nowadays, software is absolutely important for individual or company in many matters. Software design or development is done based on future or certain condition. So, it is important to understand these conditions to calculate cost and duration of a software project. This research discusses on cost estimation method of software project, this is COCOMO II (Constructive Cost Model). COCOMO II has three submodels i.e. Application Composition, Early Design, and Post Architecture, which has a possibility to estimate in less or complete condition of information. By using this COCOMO II estimation model, total efforts being needed to complete a software project in person month and total duration of processing or developing in month can be known. By adapting project standard value in the area with certain time, nominal value of a software project can be determined. Study case completed in Development Activity Report Information System, gives a conclusion that COCOMO II method is suitable to calculate cost (effort) and schedule (time) estimation. Size used as basic calculation is SLOC (Source Line Of Code). In this research, SLOC is determined by calculating UFP (Unadjusted Function Points), while SLOC is determined by calculating the number of source code line of the former project. Keywords : Software Cost Estimation, COCOMO II, Post Architectu", "num_citations": "1\n", "authors": ["767"]}
{"title": "Implementasi Sistem Informasi Rumah Sakit Untuk Subsistem Laboratorium\n", "abstract": " Teknologi informasi merupakan salah satu teknologi yang sedang berkembang dengan pesat pada saat ini. Dengan kemajuan teknologi informasi, pengaksesan terhadap data atau informasi yang tersedia dapat berlangsung dengan cepat, efisien serta akurat. Penelitian ini bertujuan untuk memberikan gambaran sebuah model sistem informasi rumah sakit menggunakan layanan web melalui pembangunan sebuah aplikasi sistem informasi rumah sakit untuk subsistem laboratorium. Sistem Informasi Rumah Sakit ini sebenarnya merupakan gabungan dari beberapa subsistem, diantaranya subsistem pasien dan dokter, subsistem laboratorium dan subsitem farmasi yang digabungkan menjadi satu. Dengan aplikasi ini, pengguna dapat dengan mudah memperoleh pelayanan dan informasi seluruh kegiatan yang ada khususnya dalam hal manajemen laboratorium pada rumah sakit dimanapun dan kapanpun mereka berada secara on-line. Aplikasi ini dibuat berbasiskan web dengan menggunakan framework Prado berbasiskan bahasa pemrograman PHP dan MySQL sebagai basis datanya. Dalam pembuatannya, aplikasi ini disesuaikan dengan kebutuhan rumah sakit secara umum. Sehingga fasilitas yang ada pada sistem ini benar-benar dapat mendukung semua kegiatan yang ada pada rumah sakit. Tentu saja pada awalnya dilakukan analisa kebutuhan untuk suatu sistem informasi rumah sakit agar penyediaan informasi dapat dilakukan dengan berbasiskan web. Analisis dan desain sistem dalam pembuatan sistem informasi rumah sakit ini menggunakan metode pendekatan berorientasi objek. Aplikasi Sistem Informasi Rumah Sakit ini …", "num_citations": "1\n", "authors": ["767"]}
{"title": "PERANCANGAN XML WEB SERVICES UNTUK PELAPORAN TRANSAKSI DATA DISTRIBUSI OBAT PADA INSTALASI FARMASI\n", "abstract": " Existence of Extensible Markup Language (XML) and Web Services technology allow the development of a solution that makes an organization can integrate, organize and automate business processes by exchanging business documents from different applications inside or outside organization area. One of application needed in Pharmacy’s Installation is medicine distribution data recorder, involves warehouse and pharmacy department. Therefore research about application design to handle process automation in the transaction is needed. Final Project data collecting and requirement analysis is carried out by field surveying at Pharmacy’s Installation in Ananda Hospital which is located in Salatiga. The field survey is undertaken by interviewing employees and learning transaction document samples. The design implementation of software was built on framework .net with Visual Basic. net as the programming language and MySQL as database engine. Web Services was running on the IIS Web Server and the database engine on Apache Web Server. Process automation application and medicine distribution data transaction reporting resulted from the Final Project is using Web Services functions to process, store, and present the data to be more effective and efficient at Pharmacy Installation in Ananda Hospital. It allows system development in many kinds of platform and any programming languages in the future. Keywords: Pharmacy’s Installation, medicine distribution, xml web services", "num_citations": "1\n", "authors": ["767"]}
{"title": "Implementasi Mms Untuk Peliputan Berita Berbasis Web\n", "abstract": " Informasi atau berita dewasa ini merupakan hal yang sangatlah penting, dimanapun dan kapanpun setiap orang pasti akan memerlukan suatu informasi baik itu informasi dalam bentuk berita ataupun informasi-informasi lainnya. Media untuk mendapatkan berita sekarang ini sangatlah banyak antara lain surat kabar, televisi, radio, internet dan masih banyak lagi. Berita yang aktual dan cepat sampai pada penerima informasi sangatlah penting. Oleh karena itu di perlukan pengembangan sistem penyampaian berita yang cepat serta aktual menggunakan MMS berbasis web. Pembuatan tugas akhir ini akan mengimplementasikan pengiriman berita menggunakan MMS, sehingga berita dapat terkirim secara cepat, aktual, dan dapat dilihat oleh siapapun melalui website. Aplikasi ini berbasis web pembuatannya menggunakan PHP sebagai kode programnya,MySQL sebagai basisdatanya, email account dan web hosting untuk menempatkan file-file web agar bisa berjalan secara online. Selain itu juga diperlukan ponsel yang memiliki kamera dan fitur MMS untuk melakukan pengiriman berita dimanapun oleh peliput berita. Serta menggunakan UML untuk pemodelan sistemnya. Langkah-langkah penelitiannya meliputi: analisis kebutuhan, perancangan dengan metode terstruktur, implementasi atau pembuatan kode program, dan pengujian sistem. Aplikasi sistem peliputan berita menggunakan MMS ini akan memberikan kecepatan dalam mendapatkan berita secara aktual. Dari hasil pengujian dapat diambil beberapa kesimpulan, di antaranya adalah: bahwa sistem peliputan berita ini menyampaikan infomrmasi berita secara cepat dan aktual …", "num_citations": "1\n", "authors": ["767"]}
{"title": "Aplikasi Buku Elektronik (E-Book) Berbasis Web Pendukung Konversi Format Dokumen*. Doc Menjadi*. Pdf\n", "abstract": " The book is one of physical learning tool that provides many kinds of knowledge to reader. With the growth of knowledge and technology, there are so many varieties of books. Practical aspect should be considered because not all the books have a normal size. Reading book with large size sometimes makes us lazy to read them. These are the reasons for which application of web-based electronic book (e-Book) supporting *.doc to *.pdf document format conversion is required to be developed, in order to give practical, efficient, and ease for readers. Beside that, *.doc document format is friendly with office user because of its simple way to process words. The research steps of this final project are requirement analysis, design, implementation, and testing on the system. System design uses Unified Modeling Language (UML) which includes functional modeling, structural modeling, and behavioral modeling. System implementation uses PHP as a web programming, MySQL as a database system, and Apache as a web server. From the results of the research, it can be concluded that the application can make the users of e-Book for many kinds of needs. There are some facilities available in the applications, i.e. e-Book easier searching, information about administrator’s email, member registration, electronic book files downloading with only right click to the files, and electronic book files uploading. Keywords : e-Book, PHP, MySQL, Apache, *.pdf, *.doc, UML.", "num_citations": "1\n", "authors": ["767"]}
{"title": "MODEL PELESTARIAN LINGKUNGAN BERBASIS MASYARAKAT SEBAGAI UPAYA MENGHADAPI DAMPAK PERUBAHAN IKLIM (STUDI KASUS PANTAI DEMAK) Subagyo\n", "abstract": " This research intends to make a basic society of the environment model in coastal area as an effort to face climate chane in the case study of Demak regency. The method which is used in this research is field survey method using instrument as a guideline in depth interviewing (in-depth-interviewing), direct observation, and documentation. The information source comes from the society, figure of society, and government agency. Triangulation technique was applied along the collection of these data. Focus group discussion (FGD) was used in order to collect the data of the society aspirations. Data analysis was applied by using quantitative and qualitative approach. Based on the result of analysis, it shows that the most serious Abrasion in Demak coastal area located in Sayung sub district. The society efforts was done to face this abrasion by planting Mangrove, raising the floor’s house, building the house on stilts …", "num_citations": "1\n", "authors": ["767"]}