{"title": "Identifying developers' expertise in social coding platforms\n", "abstract": " Social coding platforms provide a means for software developers to acquire hands-on development experience. Their source code contributions can be used to showcase their expertise and skills in specific areas of software development to the community and potential employers. Therefore, quantifying developers' expertise based on their overall development activity can be used to provide a clear view of their experience and competencies, that is otherwise scattered across different software projects. In this paper we propose an approach that extracts developers' expertise in different programming languages. Our approach measures developers' commit activity on GitHub by considering both the quantity and the continuity of their contributions in isolated projects through time. We evaluate the generated developers' expertise profiles against recognized answering activity in Stack Overflow via a dataset of users that …", "num_citations": "23\n", "authors": ["246"]}
{"title": "Landmark selection for spectral clustering based on Weighted PageRank\n", "abstract": " Spectral clustering methods have various real-world applications, such as face recognition, community detection, protein sequences clustering etc. Although spectral clustering methods can detect arbitrary shaped clusters, resulting thus in high clustering accuracy, the heavy computational cost limits their scalability. In this paper, we propose an accelerated spectral clustering method based on landmark selection. According to the Weighted PageRank algorithm, the most important nodes of the data affinity graph are selected as landmarks. Furthermore, the selected landmarks are provided to a landmark spectral clustering technique to achieve scalable and accurate clustering. In our experiments, by using two benchmark face and shape image data sets, we examine several landmark selection strategies for scalable spectral clustering that either ignore or consider the topological properties of the data in the affinity …", "num_citations": "16\n", "authors": ["246"]}
{"title": "“With a little help from new friends”: Boosting information cascades in social networks based on link injection\n", "abstract": " We investigate information cascades in the context of viral marketing applications. Recent research has identified that communities in social networks may hinder cascades. To overcome this problem, we propose a novel method for injecting social links in a social network, aiming at boosting the spread of information cascades. Unlike the proposed approach, existing link prediction methods do not consider the optimization of information cascades as an explicit objective. In our proposed method, the injected links are being predicted in a collaborative-filtering fashion, based on factorizing the adjacency matrix that represents the structure of the social network. Our method controls the number of injected links to avoid an “aggressive” injection scheme that may compromise the experience of users. We evaluate the performance of the proposed method by examining real data sets from social networks and several …", "num_citations": "15\n", "authors": ["246"]}
{"title": "Developers Expertise and Roles on Software Technologies\n", "abstract": " Contributions to open source software provide evidence about developers' expertise and roles. Moreover, information about developers' activity can assist in identifying their competencies in software technologies. Existing project-centric approaches benefit the needs of expert identification within a project, but provide a limited view of developers' expertise. In this paper, we identify contributors' expertise and roles by considering their contribution history across multiple projects according to different technologies. Firstly, we identify terms related to software technologies and employ information from GitHub to extract contributors' activity on specific technologies. Secondly, we present four contributor roles: developer, technical leader, bug fixer and bug contributor. We study the contribution history of 2,973 users of GitHub and reveal trends in contributions in open source software that can be exploited by employers for …", "num_citations": "9\n", "authors": ["246"]}
{"title": "Business-oriented evaluation of the paasage platform\n", "abstract": " Cloud computing is an efficient and cost effective realization of the utility function principle. Over the last years, a vast pool of choices for businesses has been created. This diversity of cloud infrastructures, platforms, and tools creates several challenges. In particular, it hinders interoperability, promotes vendor lock-in, but more importantly prevents businesses from making informed and optimal decisions when transitioning to the cloud. This paper presents the results of a business-oriented evaluation for cloud computing in the industry in Cyprus. The evaluation confirms that a set of key features is important for overcoming the above challenges and enables businesses to exploit the full potential of the cloud. Finally, PaaSage, a platform for autonomic multi-cloud deployment addressing these key features, is shortly presented.", "num_citations": "5\n", "authors": ["246"]}
{"title": "Scalable spectral clustering with weighted pagerank\n", "abstract": " In this paper, we propose an accelerated spectral clustering method, using a landmark selection strategy. According to the weighted PageRank algorithm, the most important nodes of the data affinity graph are selected as landmarks. The selected landmarks are provided to a landmark spectral clustering technique to achieve scalable and accurate clustering. In our experiments with two benchmark face and shape image data sets, we examine several landmark selection strategies for scalable spectral clustering that either ignore or consider the topological properties of the data in the affinity graph. Finally, we show that the proposed method outperforms baseline and accelerated spectral clustering methods, in terms of computational cost and clustering accuracy, respectively.", "num_citations": "2\n", "authors": ["246"]}