{"title": "Crowdfunding: Why people are motivated to post and fund projects on crowdfunding platforms\n", "abstract": " Computer-mediated crowdfunding is an emerging paradigm used by individuals to solicit funds from other individuals to realize projects. We are interested in how and why these platforms work and the impact they can have on what projects are realized and how they are disseminated in the world. In this paper, we report preliminary findings from a qualitative exploratory study of creators and funders on three popular crowdfunding platforms. In addition to anticipated extrinsic motivators, such as securing funding (creators) and consuming products and experiences (funders), our initial findings suggest that people are also motivated to participate because of social interactions realized through crowdfunding platforms, such as strengthening commitment to an idea through feedback (creators) and feelings of connectedness to a community with similar interests and ideals (funders). We present this research in the context of what we are calling motivational crowdwork, the investigation of motivation as it relates to online task outsourcing, and discuss ideas for ongoing work in this area.", "num_citations": "933\n", "authors": ["2102"]}
{"title": "Crowdfunding: Motivations and deterrents for participation\n", "abstract": " Crowdfunding is changing how, why, and which ideas are brought into existence. With the increasing number of crowdfunded projects, it is important to understand what drives people to either create or fund these projects. To shed light on this new social phenomenon, we present a grounded theory of motivation informed by the first cross-platform qualitative study of the crowdfunding community. By performing 83 semistructured interviews, we uncover creator motivations, which include the desire to raise funds, expand awareness of work, connect with others, gain approval, maintain control, and learn; and supporter motivations, which include the desire to collect rewards, help others, support causes, and be part of a community. We also explore deterrents to crowdfunding participation, including, among creators, fear of failure, and, for supporters, lack of trust. Based on these findings, we provide three emergent …", "num_citations": "896\n", "authors": ["2102"]}
{"title": "Understanding the role of community in crowdfunding work\n", "abstract": " Crowdfunding provides a new opportunity for entrepre-neurs to launch ventures without having to rely on traditional funding mechanisms, such as banks and angel investing. Despite its rapid growth, we understand little about how crowdfunding users build ad hoc online communities to undertake this new way of performing entrepreneurial work. To better understand this phenomenon, we performed a qualitative study of 47 entrepreneurs who use crowdfunding platforms to raise funds for their projects. We identify community efforts to support crowdfunding work, such as providing mentorship to novices, giving feedback on campaign presentation, and building a repository of example projects to serve as models. We also identify where community efforts and technologies succeed and fail at support-ing the work in order to inform the design of crowdfunding support tools and systems.", "num_citations": "263\n", "authors": ["2102"]}
{"title": "Crowdfunding support tools: predicting success & failure\n", "abstract": " Creative individuals increasingly rely on online crowdfunding platforms to crowdsource funding for new ventures. For novice crowdfunding project creators, however, there are few resources to turn to for assistance in the planning of crowdfunding projects. We are building a tool for novice project creators to get feedback on their project designs. One component of this tool is a comparison to existing projects. As such, we have applied a variety of machine learning classifiers to learn the concept of a successful online crowdfunding project at the time of project launch. Currently our classifier can predict with roughly 68% accuracy, whether a project will be successful or not. The classification results will eventually power a prediction segment of the proposed feedback tool. Future work involves turning the results of the machine learning algorithms into human-readable content and integrating this content into the feedback …", "num_citations": "238\n", "authors": ["2102"]}
{"title": "The psychological experience of prototyping\n", "abstract": " While scholars have studied what design practices accomplish, few have considered how people feel when enacting these practices. An eighteen-month ethnographic study of a high-tech firm examined the psychological experience of engaging in the practice of low-fidelity prototyping. The study finds that the production and rapid visualization of multiple ideas through low-fidelity prototyping allows practitioners to reframe failure as an opportunity for learning, supports a sense of forward progress, and strengthens beliefs about creative ability. Results suggest how design work practices can be designed to help employees manage in uncertain conditions.", "num_citations": "192\n", "authors": ["2102"]}
{"title": "Design-based research process: Problems, phases, and applications\n", "abstract": " Since the first descriptions of design-based research (DBR), there have been continued calls to better define DBR and increase its rigor. Here we address four uncertainties about DBR: (a) the phases of the DBR process, (b) what distinguishes DBR from other forms of research, (c) what distinguishes DBR from design, and (d) the characteristics of DBR that make it effective for answering certain types of questions. We build on existing efforts by defining DBR as an iterative process of 6 phases: focus, understand, define, conceive, build, and test, in which other scientific processes are recursively nested. By better articulating the process of DBR, this definition helps us to better craft, improve, communicate, and teach design-based research.", "num_citations": "180\n", "authors": ["2102"]}
{"title": "Affective computational priming and creativity\n", "abstract": " While studies have shown that affect influences creativity, few investigate how affect influences creative performance with creativity support tools. Drawing from methods commonly used in psychology research, we present affective computational priming, a new method for manipulating affect using digitally embedded stimuli. We present two studies that explore computational techniques for inducing positive, neutral, and negative affect and examine their impact on idea generation with creativity support tools. Our results suggest that positive affective computational priming positively influences the quality of ideas generated. We discuss opportunities for future HCI research and offer practical applications of affective computational priming.", "num_citations": "99\n", "authors": ["2102"]}
{"title": "Easy money? The demands of crowdfunding work\n", "abstract": " Crowdfunding provides a new way for people to solicit support from the crowd to launch new ventures. With exceptional crowdfunded projects gaining national attention for raising millions of dollars in a day, people have jumped at the opportunity to try crowdfunding for themselves. However, despite the seemingly simple promise of quick and easy funding, little is known about the work required for most crowdfunding projects. Based on an ethnographic study of crowdfunding work through interviews with project creators and participant observation, we describe the work required of running a crowdfunding project, examining what they do, who is involved, and how they do it. We find that the work consumes more time and requires a greater skill variety than what novice crowdfunders expect. Crowdfunding work involves understanding the opportunities and responsibilities, preparing the campaign material, testing the campaign material and initial project prototypes, marketing the project, executing the project goals, and contributing knowledge back to the crowdfunding community. This study is the first qualitative study of crowdfunding work. Findings can inform the design of crowdfunding systems and support tools.", "num_citations": "94\n", "authors": ["2102"]}
{"title": "Combining crowdsourcing and learning to improve engagement and performance\n", "abstract": " Crowdsourcing complex creative tasks remains difficult, in part because these tasks require skilled workers. Most crowdsourcing platforms do not help workers acquire the skills necessary to accomplish complex creative tasks. In this paper, we describe a platform that combines learning and crowdsourcing to benefit both the workers and the requesters. Workers gain new skills through interactive step-by-step tutorials and test their knowledge by improving real-world images submitted by requesters. In a series of three deployments spanning two years, we varied the design of our platform to enhance the learning experience and improve the quality of the crowd work. We tested our approach in the context of LevelUp for Photoshop, which teaches people how to do basic photograph improvement tasks using Adobe Photoshop. We found that by using our system workers gained new skills and produced high-quality …", "num_citations": "89\n", "authors": ["2102"]}
{"title": "How managers use multiple media: Discrepant events, power, and timing in redundant communication\n", "abstract": " Several recent studies have found that managers engage in redundant communication; that is, they send the same message to the same recipient sequentially through two or more unique media. Given how busy most managers are, and how much information their subordinates receive on a daily basis, this practice seems, initially, quite puzzling. We conducted an ethnographic investigation to examine the nature of events that compelled managers to engage in redundant communication. Our study of the communication patterns of project managers in six companies across three industries indicates that redundant communication is a response to unexpected endogenous or exogenous threats to meeting work goals. Managers used two distinct forms of redundant communication to mobilize team members toward mitigating potentially threatening discrepant events—unforeseen disruptive occurrences during the …", "num_citations": "79\n", "authors": ["2102"]}
{"title": "Learning to fail: experiencing public failure online through crowdfunding\n", "abstract": " Online crowdfunding platforms like Kickstarter are gaining attention among novice creatives as an effective platform for funding their ventures and engaging in creative work with others. However, a focus on financial success of crowdfunding has obscured the fact that over 58% of crowdfunding projects fail to achieve their funding goals. This population of failed creatives however, gives us an audience to study public creative failure in an online environment. We draw inspiration from work in organizational behavior on failure, and work in Human Computer Interaction (HCI) on online behavior, to study online public failure. Using a mixed-methods approach with data scraped from Kickstarter and interview data with failed crowdfunding project creators, we answer the following question: What do project creators on crowdfunding platforms learn and change through the process of failing? We find that creators who …", "num_citations": "78\n", "authors": ["2102"]}
{"title": "A pilot study of using crowds in the classroom\n", "abstract": " Industry relies on higher education to prepare students for careers in innovation. Fulfilling this obligation is especially difficult in classroom settings, which often lack authentic interaction with the outside world. Online crowdsourcing has the potential to change this. Our research explores if and how online crowds can support student learning in the classroom. We explore how scalable, diverse, immediate (and often ambiguous and conflicting) input from online crowds affects student learning and motivation for project-based innovation work. In a pilot study with three classrooms, we explore interactions with the crowd at four key stages of the innovation process: needfinding, ideating, testing, and pitching. Students reported that online crowds helped them quickly and inexpensively identify needs and uncover issues with early-stage prototypes, although they favored face-to-face interactions for more contextual feed …", "num_citations": "77\n", "authors": ["2102"]}
{"title": "Crowdfunding: Why people are motivated to participate\n", "abstract": " Crowdfunding is changing the way creative individuals and novice entrepreneurs solicit resources to realize new ideas. With the advent of online platforms, crowdfunding provides a new way to harness resources from the crowd for people with limited access to capital. With the increasing number of crowdfunded projects, it is becoming more imperative to understand what drives people to create and support these projects because they influence how, why, and which ideas are brought into existence. To address this issue, we present a grounded theory of motivation informed by the first cross-platform qualitative study of the crowdfunding community. By performing semistructured interviews, we uncover six creator and four supporter motivations. Creator motivations include the desire to expand awareness of work and to maintain control, and funder motivations include the desire to support like-minded individuals and …", "num_citations": "73\n", "authors": ["2102"]}
{"title": "Understanding and leveraging social networks for crowdfunding: opportunities and challenges\n", "abstract": " Crowdfunding provides a new way for creatives to share their work and acquire resources from their social network to influence what new ideas are realized. Yet, we understand very little about this growing phenomenon. Grounded in existing work on social network analysis, we interview 58 crowdfunding project creators to investigate how crowdfunders use their social network to reach their campaign goals. We identified three main challenges, which include understanding network capabilities, activating network connections, and expanding network reach. From our findings, we develop initial design implications for support tools to help crowdfunding project creators better understand and leverage their social network.", "num_citations": "72\n", "authors": ["2102"]}
{"title": "Priming for better performance in microtask crowdsourcing environments\n", "abstract": " Although microtask platforms are desirable for their speed, scalability, and low cost, task performance varies greatly. Many researchers have focused on improving the quality of the work performed on such platforms. Priming uses implicit mechanisms to induce observable changes in behavior. Although priming has been effective in the laboratory, its use hasn't been explored extensively in software design, perhaps because the effects are often short-lived. In the context of microtask crowdsourcing environments, however, where tasks are short and circumscribed, temporary priming effects can lead to significant performance gains.", "num_citations": "72\n", "authors": ["2102"]}
{"title": "The logic of design research\n", "abstract": " Since the first descriptions of design research (DR), there have been calls to better define it to increase its rigour. Yet five uncertainties remain: (1) the processes for conducting DR, (2) how DR differs from other forms of research, (3) how DR differs from design, (4) the products of DR, and (5) why DR can answer certain research questions more effectively than other methodologies. To resolve these uncertainties, we define educational design research as a meta-methodology conducted by education researchers to create practical interventions and theoretical design models through a design process of focusing, understanding, defining, conceiving, building, testing, and presenting, that recursively nests other research processes to iteratively search for empirical solutions to practical problems of human learning. By better articulating the logic of DR, researchers can more effectively craft, communicate, replicate, and …", "num_citations": "69\n", "authors": ["2102"]}
{"title": "Improvisation principles and techniques for design\n", "abstract": " Existing research addresses how designers create tools to support improvisation, yet little research explores how improvisation offers tools to support design work. This paper explores the potential relationship between improvisation and design, examining how design can benefit from improvisation. The paper argues that improvisation can build perspectives and skills that are critical for designers, such as creative collaboration, fostering innovation, supporting spontaneity, learning through error, and presenting ideas. The paper reviews the use of improvisation activities by designers in a multi-case study. The applications are analyzed to demonstrate individual and group level outcomes in design work.", "num_citations": "68\n", "authors": ["2102"]}
{"title": "Using improvisation to enhance the effectiveness of brainstorming\n", "abstract": " Group brainstorming is a popular ideation method for design teams, yet brainstorming outcomes vary greatly. The method depends on individuals working collectively to generate ideas, and so group dynamics determine whether the method succeeds or fails. This paper explores how interaction designers used techniques from theatrical improvisation, or improv, to adhere to the rules of brainstorming thereby enhancing group interactions while collaborating. The usefulness of improvisation for brainstorming stems from the similarity of the goals of improvisation and brainstorming, the similarity of the recurrent problems that actors and designers encounter when collaborating, and the distinctness of the ways each have devised to resolve the problems that block the group's performance. This paper reflects on the individual-and group-level outcomes for design students and practitioners while brainstorming.", "num_citations": "64\n", "authors": ["2102"]}
{"title": "Developing makerspaces as sites of entrepreneurship\n", "abstract": " Makerspaces are providing new opportunities for entrepre-neurial development. Based on participant observation and a series of in-depth interviews in an entrepreneurial mak-erspace, we found that the socio-technical environment of a makerspace promotes entrepreneurship by leveraging community-based values of social support, transparency, exploration, and empowerment. The openness of a shared space, access to social technologies, and community of social support helped members develop entrepreneurial skills and self-efficacy. We add to CSCW literature on expanding the role of makerspaces as places of career development through entrepreneurship", "num_citations": "63\n", "authors": ["2102"]}