{"title": "How to Generate the Network you Want with the PC Learning Algorithm\n", "abstract": " Data integrity is a key component of effective Bayesian network structure learning algorithms, namely PC algorithm, design and use. Given the role that integrity of data plays in these outcomes, this research demonstrates the importance of data integrity as a key component in machine learning tools in order to emphasize the need for carefully considering data integrity during tool development and utilization. To meet this purpose, we study how an adversary could generate a desired network with the PC algorithm. Given a Bayesian network B1 and a database DB1 generated by B1 and a second Bayesian network, B2, which is equal to B1, except for a minor change like a missing link, a reversed link, or an additional link, we explore and analyze what is the minimal number of changes such as additions, deletions, substitutions to DB1 that lead to a database DB2 that, when given as input to PC algorithm, results in B2.", "num_citations": "6\n", "authors": ["1105"]}
{"title": "A STUDY ON SOCIAL ENGINEERING ATTACKS: PHISHING ATTACK\n", "abstract": " Recently, with the development of digital technology and the spread of the social media network and made the communication of human beings between each other more easily, but with the put the personal information and private evidence and the participation of others via the Internet, it causes a great danger that this information can be exploited and collected, and from this a new concept called social engineering has spread that is the attackers or whoever wants Damage to people searches and collects personal and confidential information to penetrate and cause harm to the victim. One of the most common threats facing people is phishing through social engineering. In this paper, Survey summarizes the concept of social engineering and how the attacker seeks For that, it starts with attack, phishing, It is a mixture of social engineering and technical methods to persuade the user to disclose his sensitive and personal data, in addition to phishing classifications via social engineering. Moreover, this paper will discuss Survey Techniques to reduce this attack and try to raise the awareness of defense and raise human culture from Being caught in a phishing scam. These attacks aim to trick individuals or companies into carrying out actions that benefit the attackers or provide them with sensitive data via e-mail messages or malicious and counterfeit software that represents a real site and asks them to do so. such as credit card and passwords. Social engineering is one of the biggest challenges to network security because it takes advantage of the natural human tendency to trust. In conclusion, Recommend Some Preventive Measures and Possible …", "num_citations": "4\n", "authors": ["1105"]}
{"title": "Modeling Concept Drift in the Context of Discrete Bayesian Networks.\n", "abstract": " Concept drift is a significant challenge that greatly influences the accuracy and reliability of machine learning models. There is, therefore, a need to detect concept drift in order to ensure the validity of learned models. In this research, we study the issue of concept drift in the context of discrete Bayesian networks. We propose a probabilistic graphical model framework to explicitly detect the presence of concept drift using latent variables. We employ latent variables to model real concept drift and uncertainty drift over time. For modeling real concept drift, we propose to monitor the mean of the distribution of the latent variable over time. For modeling uncertainty drift, we suggest to monitor the change in beliefs of the latent variable over time, ie, we monitor the maximum value that the probability density function of the distribution takes over time. We implement our proposed framework and present our empirical results using two of the most commonly used Bayesian networks in Bayesian experiments, namely the Burglary-Earthquake Network and the Chest Clinic network.", "num_citations": "1\n", "authors": ["1105"]}