{"title": "Scrum practice mitigation of global software development coordination challenges: A distinctive advantage?\n", "abstract": " Global software development is a major trend in software engineering. Practitioners are increasingly trying Agile methods in distributed projects to tap into the benefits experienced by co-located teams. This paper considers the issue by examining whether Scrum practices, used in four global software development projects to leverage the benefits of Agile methods over traditional software engineering methods, provided any distinctive advantage in mitigating coordination challenges. Four temporal, geographical and socio-cultural distance-based coordination challenges and seven scrum practices are identified from the literature. The cases are analyzed for evidence of use of the Scrum practices to mitigate each challenge and whether the mitigation mechanisms employed relate to any distinctive characteristics of the Scrum method. While some mechanisms used were common to other/ traditional methods, it was …", "num_citations": "93\n", "authors": ["1374"]}
{"title": "Scrum practices in global software development: a research framework\n", "abstract": " Project stakeholder distribution in Global Software Development (GSD) is characterized by temporal, geographical and socio-cultural distance, which creates challenges for communication, coordination and control. Practitioners constantly seek strategies, practices and tools to counter the challenges of GSD. There is increasing interest in using Scrum in GSD even though it originally assumed collocation. However, empirically, little is known about how Scrum practices respond to the challenges of GSD. This paper develops a research framework from the literature as a basis for future research and practice. The framework maps current knowledge and views on how Scrum practices can be used to mitigate commonly recognized challenges in GSD. This research is useful as a reference guide for practitioners who are seeking to understand how Scrum practices can be used effectively in GSD, and for …", "num_citations": "68\n", "authors": ["1374"]}
{"title": "Towards an understanding of tailoring scrum in global software development: a multi-case study\n", "abstract": " There is growing interest in applying Scrum practices in Global Software Development to leverage the advantages of both. However, the effective use of Scrum practices largely depends on close interactions between project stakeholders. The distribution of project stakeholders in GSD provides significant challenges related to project collaboration processes that may limit the use of Scrum. However, project managers increasingly seek to use the Scrum model in their distributed projects. While there is an emerging body of industrial experience, there are limited empirical studies that discuss Scrum tailoring in GSD. The paper reports a multi-case study that investigates the impact of key project contextual factors on the use of Scrum practices in GSD. This study is relevant to researchers and practitioners who are seeking ways to use Scrum in GSD and improve project effectiveness.", "num_citations": "51\n", "authors": ["1374"]}
{"title": "Coordinating mechanisms for Agile global software development\n", "abstract": " Despite the apparent significant differences between the fundamental principles of agile and Global Software Development (GSD), there is a growing interest in assessing the viability of using agile practices in GSD. But there has been little research in identifying and understanding the challenges involved in integrating agile and GSD and potential strategies to deal with them. One of the key challenges is coordination of the development work. Study asserts that a good understanding of coordination difficulties can help devise strategies to overcome them. The aim of this PhD study is to explore and understand the use of different coordinating mechanisms to coordinate GSD projects while using agile software development practices.", "num_citations": "17\n", "authors": ["1374"]}