{"title": "Sequence and comparative analysis of the chicken genome provide unique perspectives on vertebrate evolution\n", "abstract": " We present here a draft genome sequence of the red jungle fowl, Gallus gallus. Because the chicken is a modern descendant of the dinosaurs and the first non-mammalian amniote to have its genome sequenced, the draft sequence of its genome--composed of approximately one billion base pairs of sequence and an estimated 20,000-23,000 genes--provides a new perspective on vertebrate genome evolution, while also improving the annotation of mammalian genomes. For example, the evolutionary distance between chicken and human provides high specificity in detecting functional elements, both non-coding and coding. Notably, many conserved non-coding sequences are far from genes and cannot be assigned to defined functional classes. In coding regions the evolutionary dynamics of protein domains and orthologous groups illustrate processes that distinguish the lineages leading to birds and mammals. The distinctive properties of avian microchromosomes, together with the inferred patterns of conserved synteny, provide additional insights into vertebrate chromosome architecture.", "num_citations": "2507\n", "authors": ["158"]}
{"title": "Initial sequence of the chimpanzee genome and comparison with the human genome\n", "abstract": " Here we present a draft genome sequence of the common chimpanzee (Pan troglodytes). Through comparison with the human genome, we have generated a largely complete catalogue of the genetic differences that have accumulated since the human and chimpanzee species diverged from our common ancestor, constituting approximately thirty-five million single-nucleotide changes, five million insertion/deletion events, and various chromosomal rearrangements. We use this catalogue to explore the magnitude and regional variation of mutational forces shaping these two genomes, and the strength of positive and negative selection acting on their genes. In particular, we find that the patterns of evolution in human and chimpanzee protein-coding genes are highly correlated and dominated by the fixation of neutral and slightly deleterious alleles. We also use the chimpanzee genome as an outgroup to investigate human population genetics and identify signatures of selective sweeps in recent human evolution.", "num_citations": "2063\n", "authors": ["158"]}
{"title": "Mapping and sequencing of structural variation from eight human genomes\n", "abstract": " Genetic variation among individual humans occurs on many different scales, ranging from gross alterations in the human karyotype to single nucleotide changes. Here we explore variation on an intermediate scale—particularly insertions, deletions and inversions affecting from a few thousand to a few million base pairs. We employed a clone-based method to interrogate this intermediate structural variation in eight individuals of diverse geographic ancestry. Our analysis provides a comprehensive overview of the normal pattern of structural variation present in these genomes, refining the location of 1,695 structural variants. We find that 50% were seen in more than one individual and that nearly half lay outside regions of the genome previously described as structurally variant. We discover 525 new insertion sequences that are not present in the human reference genome and show that many of these are variable in …", "num_citations": "1306\n", "authors": ["158"]}
{"title": "Fine-scale structural variation of the human genome\n", "abstract": " Inversions, deletions and insertions are important mediators of disease and disease susceptibility 1. We systematically compared the human genome reference sequence with a second genome (represented by fosmid paired-end sequences) to detect intermediate-sized structural variants> 8 kb in length. We identified 297 sites of structural variation: 139 insertions, 102 deletions and 56 inversion breakpoints. Using combined literature, sequence and experimental analyses, we validated 112 of the structural variants, including several that are of biomedical relevance. These data provide a fine-scale structural variation map of the human genome and the requisite sequence precision for subsequent genetic studies of human disease.", "num_citations": "1251\n", "authors": ["158"]}
{"title": "Shotgun sequence assembly and recent segmental duplications within the human genome\n", "abstract": " Complex eukaryotic genomes are now being sequenced at an accelerated pace primarily using whole-genome shotgun (WGS) sequence assembly approaches. WGS assembly was initially criticized because of its perceived inability to resolve repeat structures within genomes. Here, we quantify the effect of WGS sequence assembly on large, highly similar repeats by comparison of the segmental duplication content of two different human genome assemblies. Our analysis shows that large (> 15 kilobases) and highly identical (> 97%) duplications are not adequately resolved by WGS assembly. This leads to significant reduction in genome length and the loss of genes embedded within duplications. Comparable analyses of mouse genome assemblies confirm that strict WGS sequence assembly will oversimplify our understanding of mammalian genome structure and evolution; a hybrid strategy using a targeted …", "num_citations": "281\n", "authors": ["158"]}
{"title": "Population Stratification of a Common APOBEC Gene Deletion Polymorphism\n", "abstract": " The APOBEC3 gene family plays a role in innate cellular immunity inhibiting retroviral infection, hepatitis B virus propagation, and the retrotransposition of endogenous elements. We present a detailed sequence and population genetic analysis of a 29.5-kb common human deletion polymorphism that removes the APOBEC3B gene. We developed a PCR-based genotyping assay, characterized 1,277 human diversity samples, and found that the frequency of the deletion allele varies significantly among major continental groups (global FST = 0.2843). The deletion is rare in Africans and Europeans (frequency of 0.9% and 6%), more common in East Asians and Amerindians (36.9% and 57.7%), and almost fixed in Oceanic populations (92.9%). Despite a worldwide frequency of 22.5%, analysis of data from the International HapMap Project reveals that no single existing tag single nucleotide polymorphism may serve as a surrogate for the deletion variant, emphasizing that without careful analysis its phenotypic impact may be overlooked in association studies. Application of haplotype-based tests for selection revealed potential pitfalls in the direct application of existing methods to the analysis of genomic structural variation. These data emphasize the importance of directly genotyping structural variation in association studies and of accurately resolving variant breakpoints before proceeding with more detailed population-genetic analysis.", "num_citations": "243\n", "authors": ["158"]}
{"title": "A genome-wide survey of structural variation between human and chimpanzee\n", "abstract": " Structural changes (deletions, insertions, and inversions) between human and chimpanzee genomes have likely had a significant impact on lineage-specific evolution because of their potential for dramatic and irreversible mutation. The low-quality nature of the current chimpanzee genome assembly precludes the reliable identification of many of these differences. To circumvent this, we applied a method to optimally map chimpanzee fosmid paired-end sequences against the human genome to systematically identify sites of structural variation ≥12 kb between the two species. Our analysis yielded a total of 651 putative sites of chimpanzee deletion (n = 293), insertions (n = 184), and rearrangements consistent with local inversions between the two genomes (n = 174). We validated a subset (19/23) of insertion and deletions using PCR and Southern blot assays, confirming the accuracy of our method. The events are …", "num_citations": "214\n", "authors": ["158"]}
{"title": "Analysis of primate genomic variation reveals a repeat-driven expansion of the human genome\n", "abstract": " We performed a detailed analysis of both single-nucleotide and large insertion/deletion events based on large-scale comparison of 10.6 Mb of genomic sequence from lemur, baboon, and chimpanzee to human. Using a human genomic reference, optimal global alignments were constructed from large (>50-kb) genomic sequence clones. These alignments were examined for the pattern, frequency, and nature of mutational events. Whereas rates of single-nucleotide substitution remain relatively constant (1–2 × 10−9 substitutions/site/year), rates of retrotransposition vary radically among different primate lineages. These differences have lead to a 15%–20% expansion of human genome size over the last 50 million years of primate evolution, 90% of it due to new retroposon insertions. Orthologous comparisons with the chimpanzee suggest that the human genome continues to significantly expand due to shifts in …", "num_citations": "163\n", "authors": ["158"]}
{"title": "Recent segmental duplications in the working draft assembly of the brown Norway rat\n", "abstract": " We assessed the content, structure, and distribution of segmental duplications (≥90% sequence identity, ≥5 kb length) within the published version of the Rattus norvegicus genome assembly (v.3.1). The overall fraction of duplicated sequence within the rat assembly (2.92%) is greater than that of the mouse (1%–1.2%) but significantly less than that of human (∼5%). Duplications were nonuniformly distributed, occurring predominantly as tandem and tightly clustered intrachromosomal duplications. Regions containing extensive interchromosomal duplications were observed, particularly within subtelomeric and pericentromeric regions. We identified 41 discrete genomic regions greater than 1 Mb in size, termed “duplication blocks.” These appear to have been the target of extensive duplication over millions of years of evolution. Gene content within duplicated regions (∼1%) was lower than expected based on the …", "num_citations": "103\n", "authors": ["158"]}
{"title": "Molecular refinement of gibbon genome rearrangements\n", "abstract": " The gibbon karyotype is known to be extensively rearranged when compared to the human and to the ancestral primate karyotype. By combining a bioinformatics (paired-end sequence analysis) approach and a molecular cytogenetics approach, we have refined the synteny block arrangement of the white-cheeked gibbon (Nomascus leucogenys, NLE) with respect to the human genome. We provide the first detailed clone framework map of the gibbon genome and refine the location of 86 evolutionary breakpoints to <1 Mb resolution. An additional 12 breakpoints, mapping primarily to centromeric and telomeric regions, were mapped to ∼5 Mb resolution. Our combined FISH and BES analysis indicates that we have effectively subcloned 49 of these breakpoints within NLE gibbon BAC clones, mapped to a median resolution of 79.7 kb. Interestingly, many of the intervals associated with translocations were gene-rich …", "num_citations": "69\n", "authors": ["158"]}
{"title": "Closing gaps in the human genome with fosmid resources generated from multiple individuals\n", "abstract": " The human genome sequence has been finished to very high standards; however, more than 340 gaps remained when the finished genome was published by the International Human Genome Sequencing Consortium in 2004. Using fosmid resources generated from multiple individuals, we targeted gaps in the euchromatic part of the human genome. Here we report 2,488,842 bp of previously unknown euchromatic sequence, 363,114 bp of which close 26 of 250 euchromatic gaps, or 10%, including two remaining euchromatic gaps on chromosome 19. Eight (30.7%) of the closed gaps were found to be polymorphic. These sequences allow complete annotation of several human genes as well as the assignment of mRNAs. The gap sequences are 2.3-fold enriched in segmentally duplicated sequences compared to the whole genome. Our analysis confirms that not all gaps within'finished'genomes are recalcitrant to …", "num_citations": "67\n", "authors": ["158"]}
{"title": "Empirical evaluation of a decision support model for adopting software product line engineering\n", "abstract": " ContextThe software product line engineering (SPLE) community has provided several different approaches for assessing the feasibility of SPLE adoption and selecting transition strategies. These approaches usually include many rules and guidelines which are very often implicit or scattered over different publications. Hence, for the practitioners it is not always easy to select and use these rules to support the decision making process. Even in case the rules are known, the lack of automated support for storing and executing the rules seriously impedes the decision making process.ObjectiveWe aim to evaluate the impact of a decision support system (DSS) on decision-making in SPLE adoption. In alignment with this goal, we provide a decision support model (DSM) and the corresponding DSS.MethodFirst, we apply a systematic literature review (SLR) on the existing primary studies that discuss and present …", "num_citations": "37\n", "authors": ["158"]}
{"title": "Divergent origins and concerted expansion of two segmental duplications on chromosome 16\n", "abstract": " An unexpected finding of the human genome was the large fraction of the genome organized as blocks of interspersed duplicated sequence. We provide a comparative and phylogenetic analysis of a highly duplicated region of 16p12.2, which is composed of at least four different segmental duplications spanning in excess of 160 kb. We contrast the dispersal of two different segmental duplications (LCR16a and LCR16u). LCR16a, a 20 kb low-copy repeat sequence A from chromosome 16, was shown previously to contain a rapidly evolving novel hominoid gene family (morpheus) that had expanded within the last 10 million years of great ape/human evolution. We compare the dispersal of this genomic segment with a second adjacent duplication called LCR16u. The duplication contains a second putative gene family (KIAA0220/SMG1) that is represented approximately eight times within the human genome. A …", "num_citations": "33\n", "authors": ["158"]}
{"title": "Vive la difference!\n", "abstract": " Until very recently, it was widely touted that the complete DNA sequences of any two human beings were 99.9% identical. A new study refutes this notion through a comprehensive comparison of two individual genomes which detects hundreds of new structural genomic variants. morphisms (CNPs), which typically involve tens to hundreds of kilobases of DNA, in the human genome1, 2. These genome-wide studies used array-based comparative genomic hybridization (array CGH) methodologies with limited resolution. On page 727 of this issue, Eray Tuzun and colleagues3 report an investigation of how different the genomes of two individuals really are and a new in silico strategy to compare two genomes at the DNA sequence level.", "num_citations": "26\n", "authors": ["158"]}
{"title": "The role of unequal crossover in alpha-satellite DNA evolution: a computational analysis\n", "abstract": " Human DNA consists of a large number of tandem repeat sequences. Such sequences are usually called satellites, with the primary example being the centromeric alpha-satellite DNA. The basic repeat unit of the alpha-satellite DNA is a 171 bp monomer. Arbitrary monomer pairs usually have considerable sequence divergence (20–40%). However, with the exception of peripheral alpha-satellite DNA, monomers can be grouped into blocks of k-monomers (4 ≤ k ≤ 20) between which the divergence rate is much smaller (e.g., 5%). Perhaps the simplest and best understood mechanism for tandem repeat array evolution is unequal crossover. Although it is possible that alpha-satellite sequences developed as a result of subsequent unequal crossovers only, no formal computational framework seems to have been developed to verify this possibility. In this paper, we develop such a framework and report on …", "num_citations": "26\n", "authors": ["158"]}
{"title": "Using continuous integration and automated test techniques for a robust C4ISR system\n", "abstract": " We have used CI (continuous integration) and various software testing techniques to achieve a robust C4ISR (command, control, communications, computers, intelligence, surveillance, and reconnaissance) multi-platform system. Because of rapid changes in the C4ISR domain and in the software technology, frequent critical design adjustments and in turn vast code modifications or additions become inevitable. Defect fixes might also incur code changes. These unavoidable code modifications may put a big risk in the reliability of a mission critical system. Also, in order to stay competitive in the C4ISR market, a company must make recurring releases without sacrificing quality. We have designed and implemented an XML driven automated test framework that enabled us developing numerous high quality tests rapidly. While using CI with automated software test techniques, we have aimed at speeding up the …", "num_citations": "24\n", "authors": ["158"]}
{"title": "Adopting integrated application lifecycle management within a large-scale software company: An action research approach\n", "abstract": " ContextApplication Lifecycle Management (ALM) is a paradigm for integrating and managing the various activities related to the governance, development and maintenance of software products. In the last decade, several ALM tools have been proposed to support this process, and an increasing number of companies have started to adopt ALM.ObjectiveWe aim to investigate the impact of adopting ALM in a real industrial context to understand and justify both the benefits and obstacles of applying integrated ALM.MethodAs a research methodology, we apply action research that we have carried out within HAVELSAN, a large-scale IT company. The research was carried out over a period of seven years starting in 2010 when the ALM initiative has been started in the company to increase productivity and decrease maintenance costs.ResultsThe paper presents the results of the action research that includes the …", "num_citations": "18\n", "authors": ["158"]}
{"title": "Analyzing impact of experience curve on ROI in the software product line adoption process\n", "abstract": " ContextExperience curve is a well-known concept in management and education science, which explains the phenomenon of increased worker efficiency with repetitive production of a good or service.ObjectiveWe aim to analyze the impact of the experience curve effect on the Return on Investment (ROI) in the software product line engineering (SPLE) process.MethodWe first present the results of a systematic literature review (SLR) to explicitly depict the studies that have considered the impact of experience curve effect on software development in general. Subsequently, based on the results of the SLR, the experience curve effect models in the literature, and the SPLE cost models, we define an approach for extending the cost models with the experience curve effect. Finally, we discuss the application of the refined cost models in a real industrial context.ResultsThe SLR resulted in 15 primary studies which confirm …", "num_citations": "14\n", "authors": ["158"]}
{"title": "Systematic approach for mapping software development methods to the essence framework\n", "abstract": " The Essence framework has been recently defined as a basis for modeling various kinds of software development methods. The framework includes the necessary concepts to instantiate the software development methods. In this way a new method can be better understood, learned and compared with other methods. In practice, it is not straightforward to model a given software development method using the Essence framework. In this paper we provide a systematic approach for mapping methods to the elements of the Essence framework. To illustrate our approach, we use the mapping of the Nexus, a scaled agile approach, to the Essence framework. We report on the lessons learned and provide our conclusions.", "num_citations": "13\n", "authors": ["158"]}
{"title": "IoT System Development Methods\n", "abstract": " This chapter presents an overview of system development methods (SDMs) dedicated for Internet of Things (IoT) systems. It summarizes IoT SDMs along with their process flows represented using Business Process Model and Notation. The chapter presents the characterization of these methods using the evaluation criteria. The objective of an IoT SDM is to guide a project team in developing and combining these components in order to be able to fulfill user requirements. SDM is preferred over the\" software development method\" concept since an IoT system encompasses many software, hardware, and communication components. An important aspect in IoT is that changes in the properties of a thing and its corresponding virtual entity need to be synchronized. The IoT Methodology is a generic, lightweight method built on iterative prototyping and Lean start-up approaches. Ignite provides guidance for developing …", "num_citations": "11\n", "authors": ["158"]}
{"title": "Tarski: A platform for automated analysis of dynamically configurable traceability semantics\n", "abstract": " Traceability can be defined as the degree to which a relationship can be established among work products of the development process. Traceability is important to support the consistency and likewise to ensure that a system is understandable, maintainable and reliable. Several approaches have been proposed to model traceability elements and reason about them by extending a predetermined set of possible trace links with fixed semantics. Furthermore, they do not cope with the need for dynamic adaptation and configuration of traceability semantics. However, different project types usually require various ways of tracing the system to obtain richer and precise automated traceability analysis. In this paper, we introduce a novel approach with its supporting platform which enables the user to rigorously configure the system based on project-specific needs and interactively specify the semantics of traceability …", "num_citations": "9\n", "authors": ["158"]}
{"title": "Exploring the Business Case for Transitioning from a Framework-based Approach to a Software Product Line Engineering Approach.\n", "abstract": " In this paper we report on our experiences in transitioning from an application framework for Command and Control systems to a product line engineering approach. The application framework has been developed in the context of Havelsan, a large company in Turkish defense industry. Large investments have been undertaken in the framework development to support gross-level reuse of command control systems. We report on the obstacles of the application framework for supporting large scale reuse, explore the business case for transitioning the framework to a product line engineering approach, and provide the lessons learned in the overall process.", "num_citations": "9\n", "authors": ["158"]}
{"title": "An algorithmic analysis of the role of unequal crossover in alpha-satellite DNA evolution\n", "abstract": " Human DNA consists of a large number of tandem repeat sequences. Such sequences are usually called satellites, with the primary example being the centromeric alpha-satellite DNA. The basic repeat unit of the alpha-satellite DNA is a 171bp monomer. However, with the exception of peripheral alpha-satellite DNA, monomers can be grouped into blocks of k-monomers (4< k< 20) between which the divergence rate is much smaller (eg 5%). Perhaps the simplest and best understood mechanism for tandem repeat array evolution is the unequal crossover. Although it is possible that the alpha-satellite sequence developed as a result of subsequent unequal crossovers only, no formal computational framework seems to have been developed to verify this possibility. In this paper we develop such a framework and perform experiments which seem to indicate that pericentromeric alpha-satellite segments (which are devoid of higher-order structure) are evolutionarily distinct from the higher-order repeat segments. It is likely that the higher order repeats developed independently in distinct regions of the genome and were carried into their current locations through an unknown mechanism of transposition.", "num_citations": "9\n", "authors": ["158"]}
{"title": "Investigating the Validity of Ground Truth in Code Reviewer Recommendation Studies\n", "abstract": " Background: Selecting the ideal code reviewer in modern code review is a crucial first step to perform effective code reviews. There are several algorithms proposed in the literature for recommending the ideal code reviewer for a given pull request. The success of these code reviewer recommendation algorithms is measured by comparing the recommended reviewers with the ground truth that is the assigned reviewers selected in real life. However, in practice, the assigned reviewer may not be the ideal reviewer for a given pull request.Aims: In this study, we investigate the validity of ground truth data in code reviewer recommendation studies.Method: By conducting an informal literature review, we compared the reviewer selection heuristics in real life and the algorithms used in recommendation models. We further support our claims by using empirical data from code reviewer recommendation studies.Results: By …", "num_citations": "7\n", "authors": ["158"]}
{"title": "Büyük Ölçekli Bir Organizasyonda Uygulama Yaşam Döngüsü Yönetimi Uygulama Deneyimi.\n", "abstract": " Özetçe. Günümüz şirNetleri, faaliyet alanlarından bağımsız olaraN, bilişim sistemleri Nonusunda üçüncü Nişilerin sağladığı yazılımlarla yetinmemeNte, yeniliNçiliği ve hızı arttırmaN için Nendi bilgi sistemlerini yaratmayı hedeflemeNtedirler. Uygulama yazılımlarının fiNir aşamasından itibaren geliştirme, dağıtım ve baNım süreçlerinin tamamı Uygulama Yaşam Döngüsü Yönetimi (UYY) olaraN tanımlanmaNtadır. Bu çalışmada tümleşiN uygulama yaşam döngüsü yönetiminin tanımı, tarihçesi ve uygulama Nazanımları anlatılmıştır. Ayrıca UYY’ye geçiş sürecindeNi yöntemler ve tecrübeler paylaşılmıştır.", "num_citations": "7\n", "authors": ["158"]}
{"title": "Manipulating multiple sequence alignments via MaM and WebMaM\n", "abstract": " MaM is a software tool that processes and manipulates multiple alignments of genomic sequence. MaM computes the exact location of common repeat elements, exons and unique regions within aligned genomics sequences using a variety of user identified programs, databases and/or tables. The program can extract subalignments, corresponding to these various regions of DNA to be analyzed independently or in conjunction with other elements of genomic DNA. Graphical displays further allow an assessment of sequence variation throughout these different regions of the aligned sequence, providing separate displays for their repeat, non-repeat and coding portions of genomic DNA. The program should facilitate the phylogenetic analysis and processing of different portions of genomic sequence as part of large-scale sequencing efforts. MaM source code is freely available for non-commercial use at http …", "num_citations": "7\n", "authors": ["158"]}
{"title": "Reviewer recommendation using software artifact traceability graphs\n", "abstract": " Various types of artifacts (requirements, source code, test cases, documents, etc.) are produced throughout the lifecycle of a software. These artifacts are often related with each other via traceability links that are stored in modern application lifecycle management repositories. Throughout the lifecycle of a software, various types of changes can arise in any one of these artifacts. It is important to review such changes to minimize their potential negative impacts. To maximize benefits of the review process, the reviewer (s) should be chosen appropriately.", "num_citations": "6\n", "authors": ["158"]}
{"title": "A Systematic Mapping Study on the Current Status of Total Cost of Ownership for Information Systems\n", "abstract": " Context: More and more industries and businesses are being run on software, making information systems a pivotal component of our lives. Because of globalization and harsh competition, strategic cost management has become essential to keep or gain competitive advantage. These two trends make the investigation of Total Cost of Ownership (TCO) for information systems crucial. Objective: We aim to identify how and to what extent TCO concept is used for information systems. Method: We used systematic mapping study (SMS) to identify the use of TCO in information systems context. We defined 7 research questions (RQs). To answer these RQs, we selected 75 relevant publications by applying our inclusion and exclusion criteria. Results: An increased interest in TCO for information systems is observed over the years. We classified these publications per research type and main motivation of dealing with TCO. The results show that 76% of the selected publications (opinion and solution proposal) lack validation and evaluation. The main motivation behind the 72% of the publications is reduction of TCO.  According to the results, essential means of reducing TCO are cloud computing, SaaS model, and multi-tenancy. TCO calculations are also generally made to compare cloud-based infrastructures with in-house infrastructures and SaaS model with on-premise software. TCO is an important criterion in making investment decisions for information systems such as ERP, CRM. Conclusions: To the best of our knowledge, this study is the first SMS on TCO for information systems. We observed limited collaboration between academia and industry …", "num_citations": "6\n", "authors": ["158"]}
{"title": "Adopting the essence framework to derive a practice library for the development of IoT systems\n", "abstract": " The Internet of Things (IoT) is a global network of smart devices which enables these objects to collect and exchange data. Research in the IoT is still progressing, and it is now being applied in various domains. One of the key observations is that the development of IoT systems is not trivial and needs to be carefully managed to meet the required functional and quality concerns. Due to the heterogeneous aspects including software, hardware, and communication, developing the IoT systems implies various challenges that need to be explicitly considered in the development process and successfully resolved. Unfortunately, less focus has been provided so far on the development methods for the IoT systems. To address the particular IoT development concerns, we analyze and discuss the existing approaches that target the development of IoT systems. For this purpose, we use the Essence Framework …", "num_citations": "5\n", "authors": ["158"]}
{"title": "Decision support for adopting SPLE with Transit-PL\n", "abstract": " It is generally acknowledged that the decision to adopt a software product line engineering (SPLE) approach needs to be performed carefully due to the different risks involved in taking such an important decision. To mitigate the potential risks of the transition to SPLE, several studies have been proposed that include many different rules for analyzing the feasibility of the SPLE adoption and the selection of transition process. However, it is not easy to apply these manually and likewise provide a proper decision with the corresponding justification. In this paper, we propose the tool Transit-PL, a web based decision support system for analyzing the feasibility of SPLE for an organization and selecting the appropriate transition strategy. Transit-PL provides a framework to build particular decision support system for selected strategies using different types of questions and corresponding rules and set of answers.", "num_citations": "5\n", "authors": ["158"]}
{"title": "A case study on applying clone technology to an industrial application framework\n", "abstract": " Dealing with clones is a common problem in large-scale software projects. While most of the research in this area is focused on detecting, and investigating the reasons of clones, little research has been done on the use of clone technology in large-scale industrial software. In this paper we present an in-depth case study of cloning in Command and Control Software Framework (CCSF) developed by HAVELSAN, a large software company in the Turkish defense industry. We proposed a practical classification schema for clones based on their removal strategies. A detailed analysis on categorization of clones, and lessons learned in clone management of large-scale industrial software systems are presented.", "num_citations": "5\n", "authors": ["158"]}
{"title": "RSTrace+: Reviewer suggestion using software artifact traceability graphs\n", "abstract": " Context:Various types of artifacts (requirements, source code, test cases, documents, etc.) are produced throughout the lifecycle of a software. These artifacts are connected with each other via traceability links that are stored in modern application lifecycle management repositories. Throughout the lifecycle of a software, various types of changes can arise in any one of these artifacts. It is important to review such changes to minimize their potential negative impacts. To make sure the review is conducted properly, the reviewer(s) should be chosen appropriately.Objective:We previously introduced a novel approach, named RSTrace, to automatically recommend reviewers that are best suited based on their familiarity with a given artifact. In this study, we introduce an advanced version of RSTrace, named RSTrace+ that accounts for recency information of traceability links including practical tool support for GitHub …", "num_citations": "4\n", "authors": ["158"]}
{"title": "Uygulama Yaşam Döngüsü Yönetimi Sistematik Eşleme Çalışması.\n", "abstract": " Uygulama Yaşam Döngüsü Yönetimi (UYY) bir uygulama yazılımının fikir aşamasından başlayarak, geliştirme dağıtım ve bakım süreçlerinin tamamı olarak tanımlanmıştır. Bu çalışmada, UYY konusundaki yayınları sistematik olarak değerlendirebilmek üzere, Kanıta Dayalı Yazılım Mühendisliği alanında kullanılan bir yöntem olan Sistematik Eşleme Çalışması gerçekleştirilmiştir. Çalışmanın asıl hedefi; UYY konusunda yapılan araştırmaların hangi yıllarda yapıldığını incelemek, konu ile ilgili yayınların türlerini belirlemek, ortaya konulan araştırma sorularına yanıt bulmak ve gelecek çalışmalar ile ilgili öneriler sunmaktır. Belirlenmiş inceleme kuralları kullanılarak, elektronik veri tabanlarından (IEEE Explorer, ACM Digital Library vb.) ve arama motorlarının sonuçlarından elde edilen yayın, araştırma raporları ve endüstriyel raporlar yayın türü, çalışma türü ve ilgili UYY alanlarına göre sınıflandırılmıştır. Çalışmamız UYY faydalarının kavramsal anlatımlarının ve araç incelemelerin endüstride yoğun olarak araştırıldığını ancak akademik çalışmaların ve deneyimlerin daha az olduğunu göstermiştir.", "num_citations": "4\n", "authors": ["158"]}
{"title": "Multidimensional classification approach for defining product line engineering transition strategies\n", "abstract": " It is generally acknowledged that the transitioning process to a product line engineering approach is not trivial and as such requires a planned transition process. Different classifications of transition strategies have been proposed in the literature. It appears that these classification schemes are usually based on a single dimension. However, the adoption of a transition strategy is dependent on various criteria and very often it is not easy to characterize the required transition strategy. An appropriate characterization of the transition strategy is important for carrying out the right transition activities and steps to provide an operational product line engineering approach. In this paper, we first provide a conceptual model for defining the concepts related to transition strategies and then propose a multi-dimensional classification approach that aims to provide a more complete view on transition strategies.", "num_citations": "4\n", "authors": ["158"]}
{"title": "Towards unified software project monitoring for organizations using hybrid processes and tools\n", "abstract": " Large-scale software development organizations generally carry out multiple software development projects simultaneously. Teams use various software development processes and tools to implement these projects. In this context, the main challenges of the practitioners are (1) keeping track of the status of a single project where hybrid set of tools exist for different software life cycle activities (2) effectively monitoring a consolidated status of multiple projects that use hybrid processes and tools. To address these challenges, it is vital to have a unified view of these projects independent from these hybrid processes and tools. To this end, we report on our preliminary experiences on the development of a unified project monitoring solution and a corresponding tool support based on the Essence framework's language and kernel. Our solution provides an up-to-date and unified view of projects by collecting data from …", "num_citations": "2\n", "authors": ["158"]}
{"title": "Uygulama Yaşam Döngüsü Yönetimi Altyapısı için GelISlet (DevOps) Deneyimi\n", "abstract": " Özetçe. Günümüz şirketleri, müşterilerinin beklentilerini anlamak ve bu beklentilere hızlı ve doğru bir şekilde tepki vermek durumundadır. Artık, bilişim sistemleri karar destek sistemleri olmaktan çıkmış ve doğrudan yönetimin, üretimin, ticaretin ve sosyal hayatın yaşandığı sistemler haline gelmiştir. Hayatın kendisini beklemeye almak hayattan kopuş ile sonuçlanmaktadır. Uygulama yazılımları için hem ilk fikrin kullanıma verilmesi hem de var olan yazılım üzerinde değişiklik yapılması hızlı davranış yeteneği gerektirmektedir. Bu hız yeteneği, uygulamayı geliştirenler ile aynı uygulamayı işletenler arasındaki süreçsel ve organizasyonel mesafenin kısalması ile olanaklıdır. GelİŞlet (DevOps), geliştiriciler ve işleticilerin aynı çatı altında ve işbirliği içerisinde birlikte çalışarak kullanıcı ihtiyaçlarına hızlı tepki vermelerini sağlayan bir yaklaşım olarak tanımlanmaktadır. Bu çalışmada, sistem ve yazılım üreten ve kullanıcının bilişim profesyoneli olduğu büyük ölçekli bir organizasyonda Uygulama Yaşam Döngüsü Yönetimi altyapısının, GelİŞlet yaklaşımı ile işletilmesi, bakımı ve kazanımları anlatılmıştır.", "num_citations": "2\n", "authors": ["158"]}
{"title": "A review of code reviewer recommendation studies: Challenges and future directions\n", "abstract": " Code review is the process of inspecting code changes by a developer who is not involved in the development of the changeset. One of the initial and important steps of code review process is selecting code reviewer(s) for a given code change. To maximize the benefits of the code review process, the appropriate selection of the reviewer is essential. Code reviewer recommendation has been an active research area over the last few years, and many recommendation models have been proposed in the literature.In this study, we conduct a systematic literature review by inspecting 29 primary studies published from 2009 to 2020. Based on the outcomes of our review: (1) most preferred approaches are heuristic approaches closely followed by machine learning approaches, (2) the majority of the studies use open source projects to evaluate their models, (3) the majority of the studies prefer incremental training set …", "num_citations": "1\n", "authors": ["158"]}
{"title": "Characterizing Duplicate Bugs: An Empirical Analysis\n", "abstract": " Bug handling is an essential part of the software development process. Ideally, in a bug tracking system, bugs are reported, fixed, verified, and closed. In some cases, bugs have to be reopened mostly due to an incorrect fix. However, instead of reopening the existing bug report, users may submit a new report on a previously reported bug, which causes duplicate bug reports. Additionally, users might report duplicate bugs if they are unable to reopen the previously reported bugs due to the bug being unresolved (i.e., in progress) and when they miss previously reported bug reports. These duplicate bug reports may cost extra maintenance efforts in triaging and fixing bugs.There have been several studies on characterizing reopened bugs and duplicate bug reports, however, to the best of our knowledge, there has been no prior work on understanding the dynamics of their intersection, which is missed reopen bugs …", "num_citations": "1\n", "authors": ["158"]}
{"title": "ToolStackers: A boardgame for se education\n", "abstract": " We propose a complementary board game that aims to familiarize students with usage of tools in software engineering, their functionality and how they fit together in order to form a tool-stack for modern development paradigms like Agile and DevOps for an Application Lifecycle Management course.", "num_citations": "1\n", "authors": ["158"]}
{"title": "Creation of a Serious Game for Teaching Code Review: An Experience Report\n", "abstract": " Code review, a manual inspection of source code by developers other than the author, is a frequently used practice for improving code quality in the software development life-cycle. Employing a tool-based review of code changes has become the norm for a wide variety of open source and industrial systems. Despite its widespread usage and importance, software development practices such as code review are often not addressed in typical Software Engineering education. To address this knowledge gap, we propose to use a serious game approach for teaching code review practices. In this study, we define our learning objectives and design a code review serious game along with its companion quizzes. Then we conduct a small preliminary experiment in order to procure feedback. Using the results of the experiment and participant interviews, we improve our game prototype for integration into a software …", "num_citations": "1\n", "authors": ["158"]}
{"title": "CRSG: a serious game for teaching code review\n", "abstract": " The application of code review in a development environment is essential, but this skill is not taught very often in an educational context despite its wide usage. To streamline the teaching process of code review, we propose a browser based\" Code Review Serious Game\"(CRSG) with high accessibility, progressive level difficulty and an evolvable foundation for prospective improvements or changes. The application is built as a serious game to reinforce the learning experience of its users by immersing them in its story and theme, helping them learn while having fun. The effectiveness of the game components are measured with a case study of 132 students of 2 software engineering courses. The promising result of this case study suggests CRSG can indeed be used effectively to teach code review. The demo video for the game can be accessed at https://youtu. be/FLnr3p4bhOg, and CRSG itself at: https://github …", "num_citations": "1\n", "authors": ["158"]}
{"title": "Identifying Key Developers using Artifact Traceability Graphs\n", "abstract": " Developers are the most important resource to build and maintain software projects. Due to various reasons, some developers take more responsibility, and this type of developers are more valuable and indispensable for the project. Without them, the success of the project would be at risk. We use the term key developers for these essential and valuable developers, and identifying them is a crucial task for managerial decisions such as risk assessment for potential developer resignations. We study key developers under three categories: jacks, mavens and connectors. A typical jack (of all trades) has a broad knowledge of the project, they are familiar with different parts of the source code, whereas mavens represent the developers who are the sole experts in specific parts of the projects. Connectors are the developers who involve different groups of developers or teams. They are like bridges between teams.", "num_citations": "1\n", "authors": ["158"]}
{"title": "An industrial case study to improve the onboaring process in software management. Yazılım Yönetiminde İşe Alıştırma Süreçlerinin İyileştirilmesi İçin Düşünülmüş Bir Endüstriyel …\n", "abstract": " In this study, we investigate expert information about soft- ware process known to experienced software developers and study how this is to be transferred to the newly recruited software developers. By this means, the developers who are recruited to a software project should understand better the software development organization and especially its social structure more effectively. Through this work, along with structural and algorithmic improvements of the software product, problems related to adaptation to team culture, adaptation to company  culture, and adaptation to software development tools used are also investigated. This study aims to find the requirements in the market so that the recruitment processes can be explored using serious game mechanics. With the help of an industrial case study, we question the applicability a serious game for recruitment in the industry by improving the on-boarding process which has been identified as a problem for many software companies.  Özet. Bu çalışmada, tecrübeli yazılım geliştiricilerden, yeni katılan geliştiricilere aktarılmasını beklenen bilgileri, ve bu bilginin katılımcıya olan değerini anlatmak için neler yapıldığı araştırılacaktır. Bu sayede, işe veya projeye yeni başlayan geliştiricilerin organizasyonu ve sosyal yapıyı daha verimli bir şekilde tanıması ve anlaması öngörülmektedir. Bu çalışma yardımıyla, özellikle, yazılım ürününün yapısal ve algoritmik iyileştirmelerin yanı sıra ekip kültürüne alışma, şirket kültürüne alışma ve kullanılan yazılım geliştirme araçlarına alışma ile ilgili problemler araştırılacaktır. Bu çalışma, işe alıştırma süreçlerinin bir ciddi oyuna dönüştürülebilmesi için piyasadaki …", "num_citations": "1\n", "authors": ["158"]}
{"title": "Uygulama Yaşam Döngüsü Yönetimi Karşılaştırmalı Süreç İncelemesi.\n", "abstract": " Uygulama Yaşam Döngüsü Yönetimi (UYY), yaklaşık 40 yıldır süreç ve üretkenlik açısından araştırmalar yapılan bir alandır. Günümüzde, her şirketin faaliyet alanından bağımsız olarak bir şekilde yazılım üretim süreçlerine dâhil olması, UYY kavramını reel sektör konusu haline dönüştürmüştür. UYY, başlangıçta tüm kurumlar için sadece şelale (waterfall) süreç modeli anlamına gelmiş olsa da son dönemlerde özellikle proje başarımları açısından sorgulanmış ve çevik süreç modelleri gündeme gelmiştir. Çevik süreç modellerinin özel bir uygulaması olan Kenetlenme (Scrum) çerçevesi etkinlik kazanmıştır. Bu incelemede, geleneksel Şelale süreç modeli ile Kenetlenme süreç modelinin, proje yönetimi bakışı ile karşılaştırmaları yapılmıştır.", "num_citations": "1\n", "authors": ["158"]}
{"title": "Deriving Metrics to Support Software Product Line Feasibility Analysis\n", "abstract": " Transitioning to software product line engineering is, in general, not trivial and has several risks. To provide a quantitative analysis of the feasibility of an organization for Software Product Line Engineering (SPLE), it is important to derive the corresponding metrics. In this work-in-progress paper we derive metrics for the SPLE feasibility analysis based on a goal question metrics (GQM) approach. We provide the initial results of the metrics extraction and synthesis process and describe the initial set of metrics that can be used in the feasibility analysis process.", "num_citations": "1\n", "authors": ["158"]}
{"title": "Müşteri Odaklı Organizasyonlarda Yazılım Ürün Hattına Geçiş–Bir Öneri\n", "abstract": " Yazılımın yeniden kullanımında sistematik yaklaşımlar, özellikle de yazılım ürün hattı mühendisliği ve bileşen tabanlı yazılım geliştirme, verimi yükseltmek ve üretim maliyetlerini düşürmek için akademi ve endüstri tarafından artan bir ilgi görmektedir. Orta ve büyük ölçekli firmalarda yazılımın yeniden kullanımını sistematik biçimde örgütlemek zorlu bir çalışma gerektirmektedir. Bu durum müşteri odaklı işletme yaklaşımlarında ve organizasyon yapısı otonom proje ünitelerine sahip yapılarda daha da zor olabilir. Bu tür durumlarda organizasyonun birimleri arasındaki iletişim eksikleri ve düşük farkındalık en basit fırsatçı yeniden kullanımları bile engelleyebilir. Bu çalışmada, işletme literatüründeki farklı organizasyon tipleri ve organizasyon yapıları karşılaştırılmaktadır. Müşteri odaklı organizasyonlardaki yazılım yeniden kullanımı ile ilgili sorunlar incelenerek, bu tür organizasyonlarda yazılım ürün hattına geçiş için bir ilk …", "num_citations": "1\n", "authors": ["158"]}
{"title": "A Data-Centric Framework for Network Enabled C4ISR Software Systems\n", "abstract": " In this paper a data centric, platform and hardware communication protocol independent, standard compliant and net enabled C4ISR Software Framework which is envisioned to be used for all types of mission critic processing and display applications in distributed command and control projects is presented.", "num_citations": "1\n", "authors": ["158"]}
{"title": "MaM: Multiple alignment manipulator\n", "abstract": " MaM is a software tool that processes and manipulates multiple alignments of genomic sequence. MaM computes the exact location of common repeat elements, exons, and unique regions within aligned genomics sequences using a variety of user identified programs, databases, and/or tables. The program can extract subalignments, corresponding to these various regions of DNA to be analyzed independently or in conjunction with other elements of genomic DNA. Graphical displays further allow an assessment of sequence variation throughout these different regions of the aligned sequence, providing separate displays for their repeat, non-repeat and coding portions of genomic DNA. The program should facilitate the phylogenetic analysis and processing of different portions of genomic sequence as part of large-scale sequencing efforts.Availability: MaM is freely available for non-commercial use at http://genomics. cwru. edu/MAM. html", "num_citations": "1\n", "authors": ["158"]}