{"title": "Vader: A parsimonious rule-based model for sentiment analysis of social media text\n", "abstract": " The inherent nature of social media content poses serious challenges to practical applications of sentiment analysis. We present VADER, a simple rule-based model for general sentiment analysis, and compare its effectiveness to eleven typical state-of-practice benchmarks including LIWC, ANEW, the General Inquirer, SentiWordNet, and machine learning oriented techniques relying on Naive Bayes, Maximum Entropy, and Support Vector Machine (SVM) algorithms. Using a combination of qualitative and quantitative methods, we first construct and empirically validate a gold-standard list of lexical features (along with their associated sentiment intensity measures) which are specifically attuned to sentiment in microblog-like contexts. We then combine these lexical features with consideration for five general rules that embody grammatical and syntactical conventions for expressing and emphasizing sentiment intensity. Interestingly, using our parsimonious rule-based model to assess the sentiment of tweets, we find that VADER outperforms individual human raters (F1 Classification Accuracy= 0.96 and 0.84, respectively), and generalizes more favorably across contexts than any of our benchmarks.", "num_citations": "2835\n", "authors": ["1203"]}
{"title": "Predicting tie strength with social media\n", "abstract": " Social media treats all users the same: trusted friend or total stranger, with little or nothing in between. In reality, relationships fall everywhere along this spectrum, a topic social science has investigated for decades under the theme of tie strength. Our work bridges this gap between theory and practice. In this paper, we present a predictive model that maps social media data to tie strength. The model builds on a dataset of over 2,000 social media ties and performs quite well, distinguishing between strong and weak ties with over 85% accuracy. We complement these quantitative findings with interviews that unpack the relationships we could not predict. The paper concludes by illustrating how modeling tie strength can improve social media design elements, including privacy controls, message routing, friend introductions and information prioritization.", "num_citations": "1887\n", "authors": ["1203"]}
{"title": "Faces engage us: Photos with faces attract more likes and comments on instagram\n", "abstract": " Photos are becoming prominent means of communication online. Despite photos' pervasive presence in social media and online world, we know little about how people interact and engage with their content. Understanding how photo content might signify engagement, can impact both science and design, influencing production and distribution. One common type of photo content that is shared on social media, is the photos of people. From studies of offline behavior, we know that human faces are powerful channels of non-verbal communication. In this paper, we study this behavioral phenomena online. We ask how presence of a face, it's age and gender might impact social engagement on the photo. We use a corpus of 1 million Instagram images and organize our study around two social engagement feedback factors, likes and comments. Our results show that photos with faces are 38% more likely to receive …", "num_citations": "490\n", "authors": ["1203"]}
{"title": "The language that gets people to give: Phrases that predict success on kickstarter\n", "abstract": " Crowdfunding sites like Kickstarter--where entrepreneurs and artists look to the internet for funding--have quickly risen to prominence. However, we know very little about the factors driving the'crowd'to take projects to their funding goal. In this paper we explore the factors which lead to successfully funding a crowdfunding project. We study a corpus of 45K crowdfunded projects, analyzing 9M phrases and 59 other variables commonly present on crowdfunding sites. The language used in the project has surprising predictive power accounting for 58.56% of the variance around successful funding. A closer look at the phrases shows they exhibit general persuasion principles. For example, also receive two reflects the principle of Reciprocity and is one of the top predictors of successful funding. We conclude this paper by announcing the release of the predictive phrases along with the control variables as a public …", "num_citations": "387\n", "authors": ["1203"]}
{"title": "Widespread worry and the stock market\n", "abstract": " Our emotional state influences our choices. Research on how it happens usually comes from the lab. We know relatively little about how real world emotions affect real world settings, like financial markets. Here, we demonstrate that estimating emotions from weblogs provides novel information about future stock market prices. That is, it provides information not already apparent from market data. Specifically, we estimate anxiety, worry and fear from a dataset of over 20 million posts made on the site LiveJournal. Using a Granger-causal framework, we find that increases in expressions of anxiety, evidenced by computationally-identified linguistic features, predict downward pressure on the S&P 500 index. We also present a confirmation of this result via Monte Carlo simulation. The findings show how the mood of millions in a large online community, even one that primarily discusses daily life, can anticipate changes in a seemingly unrelated system. Beyond this, the results suggest new ways to gauge public opinion and predict its impact.", "num_citations": "378\n", "authors": ["1203"]}
{"title": "You can't stay here: The efficacy of reddit's 2015 ban examined through hate speech\n", "abstract": " In 2015, Reddit closed several subreddits-foremost among them r/fatpeoplehate and r/CoonTown-due to violations of Reddit's anti-harassment policy. However, the effectiveness of banning as a moderation approach remains unclear: banning might diminish hateful behavior, or it may relocate such behavior to different parts of the site. We study the ban of r/fatpeoplehate and r/CoonTown in terms of its effect on both participating users and affected subreddits. Working from over 100M Reddit posts and comments, we generate hate speech lexicons to examine variations in hate speech usage via causal inference methods. We find that the ban worked for Reddit. More accounts than expected discontinued using the site; those that stayed drastically decreased their hate speech usage-by at least 80%. Though many subreddits saw an influx of r/fatpeoplehate and r/CoonTown \"migrants,\" those subreddits saw no …", "num_citations": "252\n", "authors": ["1203"]}
{"title": "Credbank: A large-scale social media corpus with associated credibility annotations\n", "abstract": " Social media has quickly risen to prominence as a news source, yet lingering doubts remain about its ability to spread rumor and misinformation. Systematically studying this phenomenon, however, has been difficult due to the need to collect large-scale, unbiased data along with in-situ judgements of its accuracy. In this paper we present CREDBANK, a corpus designed to bridge this gap by systematically combining machine and human computation. Specifically, CREDBANK is a corpus of tweets, topics, events and associated human credibility judgements. It is based on the real-time tracking of more than 1 billion streaming tweets over a period of more than three months, computational summarizations of those tweets, and intelligent routings of the tweet streams to human annotators—within a few hours of those events unfolding on Twitter. In total CREDBANK comprises more than 60 million tweets grouped into 1049 real-world events, each annotated by 30 human annotators. As an example, with CREDBANK one can quickly calculate that roughly 24% of the events in the global tweet stream are not perceived as credible. We have made CREDBANK publicly available, and hope it will enable new research questions related to online information credibility in fields such as social science, data mining and health.", "num_citations": "211\n", "authors": ["1203"]}
{"title": "Widespread underprovision on reddit\n", "abstract": " Many online communities ask their members to do work for the good of everyone on the site. On social voting sites like Reddit, this means that users judge a stream of incoming links by voting them up or down. The links with the most up-votes bubble up to the main page, pointing everyone toward the best content. A threat to all sites designed this way, however, is underprovision: when too many people rely on others to contribute without doing so themselves. In this paper, we present findings suggesting that widespread underprovision of votes is happening on Reddit, arguably the internet's largest social voting community. Notably, Reddit overlooked 52% of the most popular links the first time they were submitted. This suggests that many potentially popular links get ignored, jeopardizing the site's core purpose. We conclude by discussing possible reasons behind it, and suggest future research on social voting sites.", "num_citations": "200\n", "authors": ["1203"]}
{"title": "Blogs are echo chambers: Blogs are echo chambers\n", "abstract": " In the last decade, blogs have exploded in number, popularity and scope. However, many commentators and researchers speculate that blogs isolate readers in echo chambers, cutting them off from dissenting opinions. Our empirical paper tests this hypothesis. Using a hand-coded sample of over 1,000 comments from 33 of the world's top blogs, we find that agreement outnumbers disagreement in blog comments by more than 3 to 1. However, this ratio depends heavily on a blog's genre, varying between 2 to 1 and 9 to 1. Using these hand-coded blog comments as input, we also show that natural language processing techniques can identify the linguistic markers of agreement. We conclude by applying our empirical and algorithmic findings to practical implications for blogs, and discuss the many questions raised by our work.", "num_citations": "182\n", "authors": ["1203"]}
{"title": "The network in the garden: an empirical analysis of social media in rural life\n", "abstract": " History repeatedly demonstrates that rural communities have unique technological needs. Yet, we know little about how rural communities use modern technologies, so we lack knowledge on how to design for them. To address this gap, our empirical paper investigates behavioral differences between more than 3,000 rural and urban social media users. Using a dataset collected from a broadly popular social network site, we analyze users' profiles, 340,000 online friendships and 200,000 interpersonal messages. Using social capital theory, we predict differences between rural and urban users and find strong evidence supporting our hypotheses. Namely, rural people articulate far fewer friends online, and those friends live much closer to home. Our results also indicate that the groups have substantially different gender distributions and use privacy features differently. We conclude by discussing design implications …", "num_citations": "176\n", "authors": ["1203"]}
{"title": "A longitudinal study of follow predictors on twitter\n", "abstract": " Follower count is important to Twitter users: it can indicate popularity and prestige. Yet, holistically, little is understood about what factors--like social behavior, message content, and network structure-lead to more followers. Such information could help technologists design and build tools that help users grow their audiences. In this paper, we study 507 Twitter users and a half-million of their tweets over 15 months. Marrying a longitudinal approach with a negative binomial auto-regression model, we find that variables for message content, social behavior, and network structure should be given equal consideration when predicting link formations on Twitter. To our knowledge, this is the first longitudinal study of follow predictors, and the first to show that the relative contributions of social behavior and mes-sage content are just as impactful as factors related to social network structure for predicting growth of online …", "num_citations": "159\n", "authors": ["1203"]}
{"title": "Virtual data Grid middleware services for data‐intensive science\n", "abstract": " The GriPhyN virtual data system provides a suite of components and services for data‐intensive sciences that enables scientists to systematically and efficiently describe, discover, and share large‐scale data and computational resources. We describe the design and implementation of such middleware services in terms of a virtual data system interface called Chiron, and present virtual data integration examples from the QuarkNet education project and from functional‐MRI‐based neuroscience research. The Chiron interface also serves as an online ‘educator’ for virtual data applications. Copyright © 2005 John Wiley & Sons, Ltd.", "num_citations": "137\n", "authors": ["1203"]}
{"title": "Predicting tie strength in a new medium\n", "abstract": " We have friends we consider very close and acquaintances we barely know. The social sciences use the term tie strength to denote this differential closeness with the people in our lives. In this paper, we explore how well a tie strength model developed for one social medium adapts to another. Specifically, we present a Twitter application called We Meddle which puts a Facebook tie strength model at the core of its design. We Meddle estimated tie strengths for more than 200,000 online relationships from people in 52 countries. We focus on the mapping of Facebook relational features to relational features in Twitter. By examining We Meddle's mistakes, we find that the Facebook tie strength model largely generalizes to Twitter. This is early evidence that important relational properties may manifest similarly across different social media, a finding that would allow new social media sites to build around relational …", "num_citations": "133\n", "authors": ["1203"]}
{"title": "The network in the garden: Designing social media for rural life\n", "abstract": " History repeatedly demonstrates that rural communities have unique technological needs. Yet little is known about how rural communities use modern technologies, which therefore results in a collective lack knowledge about how to design for rural life. To address this gap, the present empirical article investigates behavioral differences between more than 3,000 rural and urban social media users. With a data set collected from a broadly popular social network site, the current work analyzes users’ profiles, 340,000 online friendships, and 200,000 interpersonal messages. Based on social capital theory, differences are predicted between rural and urban users, and strong evidence supports the present hypotheses—namely, rural people articulate far fewer friends online, and those friends live much closer to home. Results indicate that the groups have substantially different gender distributions and use privacy …", "num_citations": "114\n", "authors": ["1203"]}
{"title": "Why we filter our photos and how it impacts engagement\n", "abstract": " A variety of simple graphical filters are available to camera phone users to enhance their photos on the fly; these filters often stylize, saturate or age a photo. In this paper, we present a combination of large-scale data analysis and small scale in-depth interviews to understand filter-work. We look at producers’ practices of photo filtering and gain insights in the roles filters play in engaging photo consumers’ by driving their social interactions. We first interviewed 15 Flickr mobile app users (photo producers) to understand their use and perception of filters. Next, we analyzed how filters affect a photo’s engagement (consumers’ perspective) using a corpus of 7.6 million Flickr photos. We find two groups of serious and casual photographers among filter users. The serious see filters as correction tools and prefer milder effects. Casual photographers, by contrast, use filters to significantly transform their photos with bolder effects. We also find that filtered photos are 21% more likely to be viewed and 45% more likely to be commented on by consumers of photographs. Specifically, filters that increase warmth, exposure and contrast boost engagement the most. Towards the ongoing research in social engagement and photo-work, these findings suggest several practical implications such as designing filters for both serious and casual photographers or designing methods to prioritize and rank content in order to maximize engagement.", "num_citations": "113\n", "authors": ["1203"]}
{"title": "Phrases that signal workplace hierarchy\n", "abstract": " Hierarchy fundamentally shapes how we act at work. In this paper, we explore the relationship between the words people write in workplace email and the rank of the email's recipient. Using the Enron corpus as a dataset, we perform a close study of the words and phrases people send to those above them in the corporate hierarchy versus those at the same level or lower. We find that certain words and phrases are strong predictors. For example,\" thought you would\" strongly suggests that the recipient outranks the sender, while\" let's discuss\" implies the opposite. We also find that the phrases people write to their bosses do not demonstrate cognitive processes as often as the ones they write to others. We conclude this paper by interpreting our results and announcing the release of the predictive phrases as a public dataset, perhaps enabling a new class of status-aware applications.", "num_citations": "105\n", "authors": ["1203"]}
{"title": "The bag of communities: Identifying abusive behavior online with preexisting internet data\n", "abstract": " Since its earliest days, harassment and abuse have plagued the Internet. Recent research has focused on in-domain methods to detect abusive content and faces several challenges, most notably the need to obtain large training corpora. In this paper, we introduce a novel computational approach to address this problem called Bag of Communities (BoC)---a technique that leverages large-scale, preexisting data from other Internet communities. We then apply BoC toward identifying abusive behavior within a major Internet community. Specifically, we compute a post's similarity to 9 other communities from 4chan, Reddit, Voat and MetaFilter. We show that a BoC model can be used on communities\" off the shelf\" with roughly 75% accuracy---no training examples are needed from the target community. A dynamic BoC model achieves 91.18% accuracy after seeing 100,000 human-moderated posts, and uniformly …", "num_citations": "101\n", "authors": ["1203"]}
{"title": "Comparing person-and process-centric strategies for obtaining quality data on amazon mechanical turk\n", "abstract": " In the past half-decade, Amazon Mechanical Turk has radically changed the way many scholars do research. The availability of a massive, distributed, anonymous crowd of individuals willing to perform general human-intelligence micro-tasks for micro-payments is a valuable resource for researchers and practitioners. This paper addresses the challenges of obtaining quality annotations for subjective judgment oriented tasks of varying difficulty. We design and conduct a large, controlled experiment (N= 68,000) to measure the efficacy of selected strategies for obtaining high quality data annotations from non-experts. Our results point to the advantages of person-oriented strategies over process-oriented strategies. Specifically, we find that screening workers for requisite cognitive aptitudes and providing training in qualitative coding techniques is quite effective, significantly outperforming control and baseline …", "num_citations": "101\n", "authors": ["1203"]}
{"title": "Overload is overloaded: email in the age of Gmail\n", "abstract": " The term email overload has two definitions: receiving a large volume of incoming email, and having emails of different status types (to do, to read, etc). Whittaker and Sidner proposed the latter definition in 1996, noticing that email inboxes were far more complex than simply containing incoming messages. Sixteen years after Whittaker and Sidner, we replicate and extend their work with a qualitative analysis of Google's Gmail. We find that email overload, both in terms of volume and of status, is still a problem today. Our contributions are 1) updating the state of email overload, 2) extending our understanding of overload in the context of Gmail and 3) comparing personal with work email accounts: while work email tends to be status overloaded, personal email is also type overloaded. These comparisons between work and personal email suggest new avenues for email research.", "num_citations": "91\n", "authors": ["1203"]}
{"title": "Understanding deja reviewers\n", "abstract": " People who review products on the web invest considerable time and energy in what they write. So why would someone write a review that restates earlier reviews? Our work looks to answer this question. In this paper, we present a mixed-method study of deja reviewers, latecomers who echo what other people said. We analyze nearly 100,000 Amazon. com reviews for signs of repetition and find that roughly 10-15% of reviews substantially resemble previous ones. Using these algorithmically-identified reviews as centerpieces for discussion, we interviewed reviewers to understand their motives. An overwhelming number of reviews partially explains deja reviews, but deeper factors revolving around an individual's status in the community are also at work. The paper concludes by introducing a new idea inspired by our findings: a self-aware community that nudges members toward community-wide goals.", "num_citations": "88\n", "authors": ["1203"]}
{"title": "Tensions in scaling-up community social media: a multi-neighborhood study of nextdoor\n", "abstract": " This paper presents a study of Nextdoor, a social media system designed to support local neighborhoods. While not the first system designed to support community engagement, Nextdoor has a number of attributes that make it distinct. Our study, across three communities in a major US city, illustrates that Nextdoor inhabits an already-rich ecosystem of community-oriented social media, but is being appropriated by its users for use in different ways than these existing media. Nextdoor also raises tensions in how it defines the boundaries of neighborhoods, and in the privacy issues it raises among its users.", "num_citations": "72\n", "authors": ["1203"]}
{"title": "Demographics, weather and online reviews: A study of restaurant recommendations\n", "abstract": " Online recommendation sites are valuable information sources that people contribute to, and often use to choose restaurants. However, little is known about the dynamics behind participation in these online communities and how the recommendations in these communities are formed. In this work, we take a first look at online restaurant recommendation communities to study what endogenous (ie, related to entities being reviewed) and exogenous factors influence people's participation in the communities, and to what extent. We analyze an online community corpus of 840K restaurants and their 1.1 M associated reviews from 2002 to 2011, spread across every US state. We construct models for number of reviews and ratings by community members, based on several dimensions of endogenous and exogenous factors. We find that while endogenous factors such as restaurant attributes (eg, meal, price, service …", "num_citations": "72\n", "authors": ["1203"]}
{"title": "Still out there: Modeling and identifying russian troll accounts on twitter\n", "abstract": " There is evidence that Russia’s Internet Research Agency attempted to interfere with the 2016 US election by running fake accounts on Twitter—often referred to as “Russian trolls”. In this work, we: 1) develop machine learning models that predict whether a Twitter account is a Russian troll within a set of 170K control accounts; and, 2) demonstrate that it is possible to use this model to find active accounts on Twitter still likely acting on behalf of the Russian state. Using both behavioral and linguistic features, we show that it is possible to distinguish between a troll and a non-troll with a precision of 78.5% and an AUC of 98.9%, under cross-validation. Applying the model to out-of-sample accounts still active today, we find that up to 2.6% of top journalists’ mentions are occupied by Russian trolls. These findings imply that the Russian trolls are very likely still active today. Additional analysis shows that they are not …", "num_citations": "68\n", "authors": ["1203"]}
{"title": "A parsimonious language model of social media credibility across disparate events\n", "abstract": " Social media has increasingly become central to the way billions of people experience news and events, often bypassing journalists---the traditional gatekeepers of breaking news. Naturally, this casts doubt on the credibility of information found on social media. Here we ask: Can the language captured in unfolding Twitter events provide information about the event's credibility? By examining the first large-scale, systematically-tracked credibility corpus of public Twitter messages (66M messages corresponding to 1,377 real-world events over a span of three months), and identifying 15 theoretically grounded linguistic dimensions, we present a parsimonious model that maps language cues to perceived levels of credibility. While not deployable as a standalone model for credibility assessment at present, our results show that certain linguistic categories and their associated phrases are strong predictors surrounding …", "num_citations": "68\n", "authors": ["1203"]}
{"title": "Modeling factuality judgments in social media text\n", "abstract": " How do journalists mark quoted content as certain or uncertain, and how do readers interpret these signals? Predicates such as thinks, claims, and admits offer a range of options for framing quoted content according to the author’s own perceptions of its credibility. We gather a new dataset of direct and indirect quotes from Twitter, and obtain annotations of the perceived certainty of the quoted statements. We then compare the ability of linguistic and extra-linguistic features to predict readers’ assessment of the certainty of quoted content. We see that readers are indeed influenced by such framing devices—and we find no evidence that they consider other factors, such as the source, journalist, or the content itself. In addition, we examine the impact of specific framing devices on perceptions of credibility. 1 IntroductionContemporary journalism is increasingly conducted through social media services like Twitter (Lotan et al., 2011; Hermida et al., 2012). As events unfold, journalists and political commentators use quotes—often indirect—to convey potentially uncertain information and claims from their sources and informants, eg,", "num_citations": "59\n", "authors": ["1203"]}
{"title": "CodeSaw: A social visualization of distributed software development\n", "abstract": " We present CodeSaw, a social visualization of distributed software development. CodeSaw visualizes a distributed software community from two important and independent perspectives: code repositories and project communication. By bringing together both shared artifacts (code) and the talk surrounding those artifacts (project mail), CodeSaw reveals group dynamics that lie buried in existing technologies. This paper describes the visualization and its design process. We apply CodeSaw to a popular open source project, showing how the visualization reveals group dynamics and individual roles. The paper ends with a discussion of the results of an online field study with prominent open source developers. The field study suggests that CodeSaw positively affects communities and provides incentives to distributed developers. Furthermore, an important design lesson from the field study leads us to …", "num_citations": "55\n", "authors": ["1203"]}
{"title": "Crossmod: A cross-community learning-based system to assist reddit moderators\n", "abstract": " In this paper, we introduce a novel sociotechnical moderation system for Reddit called Crossmod. Through formative interviews with 11 active moderators from 10 different subreddits, we learned about the limitations of currently available automated tools, and how a new system could extend their capabilities. Developed out of these interviews, Crossmod makes its decisions based on cross-community learning---an approach that leverages a large corpus of previous moderator decisions via an ensemble of classifiers. Finally, we deployed Crossmod in a controlled environment, simulating real-time conversations from two large subreddits with over 10M subscribers each. To evaluate Crossmod's moderation recommendations, 4 moderators reviewed comments scored by Crossmod that had been drawn randomly from existing threads. Crossmod achieved an overall accuracy of 86% when detecting comments that …", "num_citations": "54\n", "authors": ["1203"]}
{"title": "User attitudes towards algorithmic opacity and transparency in online reviewing platforms\n", "abstract": " Algorithms exert great power in curating online information, yet are often opaque in their operation, and even existence. Since opaque algorithms sometimes make biased or deceptive decisions, many have called for increased transparency. However, little is known about how users perceive and interact with potentially biased and deceptive opaque algorithms. What factors are associated with these perceptions, and how does adding transparency into algorithmic systems change user attitudes? To address these questions, we conducted two studies: 1) an analysis of 242 users' online discussions about the Yelp review filtering algorithm and 2) an interview study with 15 Yelp users disclosing the algorithm's existence via a tool. We found that users question or defend this algorithm and its opacity depending on their engagement with and personal gain from the algorithm. We also found adding transparency into the …", "num_citations": "47\n", "authors": ["1203"]}
{"title": "Pas: A wireless-enabled, sensor-integrated personal assistance system for independent and assisted living\n", "abstract": " Advances in networking, sensors, and embedded devices have made it feasible to monitor and provide medical and other assistance to people in their homes. Aging populations will benefit from reduced costs and improved healthcare through assisted living based on these technologies. However, these systems challenge current state-of-the-art techniques for usability, reliability, and security. In this paper we present the PAS open architecture for assisted living, which allows independently developed third party components to collaborate. We discuss key technological issues in assisted living systems, such as tracking, fall detection, security and privacy; and results from our pilot study in a real assisted living facility are presented.", "num_citations": "45\n", "authors": ["1203"]}
{"title": "Designing social translucence over social networks\n", "abstract": " Social translucence is a landmark theory in social computing. Modeled on physical life, it guides designers toward elegant social technologies. However, we argue that it breaks down over modern social network sites because social networks resist its physical metaphors. In this paper, we build theory relating social translucence to social network structure. To explore this idea, we built a tool called Link Different. Link Different addresses a structural awareness problem by letting users know how many of their Twitter followers already a saw link via someone else they follow. During two months on the web, nearly 150K people used the site a total of 1.3 M times. Its widespread, viral use suggests that people want social translucence, but network structure gets in the way. We conclude the paper by illustrating new design problems that lie at the intersection of social translucence and other unexplored network structures.", "num_citations": "44\n", "authors": ["1203"]}
{"title": "Selfie-presentation in everyday life: A large-scale characterization of selfie contexts on instagram\n", "abstract": " Carefully managing the presentation of self via technology is a core practice on all modern social media platforms. Recently, selfies have emerged as a new, pervasive genre of identity performance. In many ways unique, selfies bring us full-circle to Goffman—blending the online and offline selves together. In this paper, we take an empirical, Goffman-inspired look at the phenomenon of selfies. We report a large-scale, mixed-method analysis of the categories in which selfies appear on Instagram—an online community comprising over 400M people. Applying computer vision and network analysis techniques to 2.5 M selfies, we present a typology of emergent selfie categories which represent emphasized identity statements. To the best of our knowledge, this is the first large-scale, empirical research on selfies. We conclude, contrary to common portrayals in the press, that selfies are really quite ordinary: they project identity signals such as wealth, health and physical attractiveness common to many online media, and to offline life.", "num_citations": "41\n", "authors": ["1203"]}
{"title": "Using social visualization to motivate social production\n", "abstract": " In this paper we argue that social visualization can motivate contributors to social production projects, such as Wikipedia and open source development. As evidence, we present CodeSaw, a social visualization of open source software development that we studied with real open source communities. CodeSaw mines open source archives to visualize group dynamics that currently lie buried in textual databases. Furthermore, CodeSaw becomes an active social space itself by supporting comments directly inside the visualization. To demonstrate CodeSaw, we apply it to a popular open source project, showing how the visualization reveals group dynamics and individual roles. The paper concludes by presenting evidence that CodeSaw, and social visualization more generally, can motivate contributors to social production projects if the visualization leaves the laboratory and makes it to the community visualized.", "num_citations": "39\n", "authors": ["1203"]}
{"title": "Tie strength prediction and social media filtration\n", "abstract": " A computer-implemented method of predicting tie strength between persons within a social media network includes: modeling tie strengths between a user of the social media network and connected persons in the network as a combination of: a plurality of predictive variables, interactions between dimensions of the predictive variables, and network structure of the social media network; altering or filtering a stream of social media content from the connected persons using the tie strength as associated with the respective connected persons according to the modeling; and delivering the altered or filtered stream of social media content to a communications device of the user.", "num_citations": "38\n", "authors": ["1203"]}
{"title": "The QuarkNet/grid collaborative learning e-Lab\n", "abstract": " This paper describes a case study that uses grid computing techniques to support the collaborative learning of high school students investigating cosmic rays. Students gather and upload science data to an e-Lab website. They explore those data using techniques from the GriPhyN collaboration. These techniques include virtual data transformations, workflows, metadata cataloging and indexing, data product provenance and persistence, as well as job planners for execution locally and on the grid. Students use web browsers and a custom interface that extends the GriPhyN Chiron portal to perform all of these tasks. They share results in the form of online posters and ask each other questions in this asynchronous environment. Students can discover and extend the research of other students, modeling the processes of modern large-scale scientific collaborations. Also, the e-Lab provides tools for teachers to guide …", "num_citations": "38\n", "authors": ["1203"]}
{"title": "Algorithmically bypassing censorship on sina weibo with nondeterministic homophone substitutions\n", "abstract": " Like traditional media, social media in China is subject to censorship. However, in limited cases, activists have employed homophones of censored keywords to avoid detection by keyword matching algorithms. In this paper, we show that it is possible to scale this idea up in ways that make it difficult to defend against. Specifically, we present a non-deterministic algorithm for generating homophones that create large numbers of false positives for censors, making it difficult to locate banned conversations. In two experiments, we show that 1) homophone-transformed weibos posted to Sina Weibo remain on-site three times longer than their previously censored counterparts, and 2) native Chinese speakers can recover the original intent behind the homophone-transformed messages, with 99% of our posts understood by the majority of our participants. Finally, we find that coping with homophone transformations is likely to cost the Sina Weibo censorship apparatus an additional 15 hours of human labor per day, per censored keyword. To conclude, we reflect briefly on the opportunities presented by this algorithm to build interactive, client-side tools that promote free speech.", "num_citations": "34\n", "authors": ["1203"]}
{"title": "In-group questions and out-group answers: crowdsourcing daily living advice for individuals with autism\n", "abstract": " Difficulty in navigating daily life can lead to frustration and decrease independence for people with autism. While they turn to online autism communities for information and advice for coping with everyday challenges, these communities may present only a limited perspective because of their in-group nature. Obtaining support from out-group sources beyond the in-group community may prove valuable in dealing with challenging situations such as public anxiety and workplace conflicts. In this paper, we explore the value of supplementary out-group support from crowdsourced responders added to in-group support from a community of members. We find that out-group sources provide relatively rapid, concise responses with direct and structured information, socially appropriate coping strategies without compromising emotional value. Using an autism community as a motivating example, we conclude by providing …", "num_citations": "32\n", "authors": ["1203"]}
{"title": "Red, purple and pink: The colors of diffusion on Pinterest\n", "abstract": " Many lab studies have shown that colors can evoke powerful emotions and impact human behavior. Might these phenomena drive how we act online? A key research challenge for image-sharing communities is uncovering the mechanisms by which content spreads through the community. In this paper, we investigate whether there is link between color and diffusion. Drawing on a corpus of one million images crawled from Pinterest, we find that color significantly impacts the diffusion of images and adoption of content on image sharing communities such as Pinterest, even after partially controlling for network structure and activity. Specifically, Red, Purple and pink seem to promote diffusion, while Green, Blue, Black and Yellow suppress it. To our knowledge, our study is the first to investigate how colors relate to online user behavior. In addition to contributing to the research conversation surrounding diffusion, these findings suggest future work using sophisticated computer vision techniques. We conclude with a discussion on the theoretical, practical and design implications suggested by this work—e.g. design of engaging image filters.", "num_citations": "31\n", "authors": ["1203"]}
{"title": "Have you heard?: How gossip flows through workplace email\n", "abstract": " We spend a significant part of our lives chatting about other people. In other words, we all gossip. Although sometimes a contentious topic, various researchers have shown gossip to be fundamental to social life—from small groups to large, formal organizations. In this paper, we present the first study of gossip in a large CMC corpus. Adopting the Enron email dataset and natural language techniques, we arrive at four main findings. First, workplace gossip is common at all levels of the organizational hierarchy, with people most likely to gossip with their peers. Moreover, employees at the lowest level play a major role in circulating it. Second, gossip appears as often in personal exchanges as it does in formal business communication. Third, by deriving a power-law relation, we show that it is more likely for an email to contain gossip if targeted to a smaller audience. Finally, we explore the sentiment associated with gossip email, finding that gossip is in fact quite often negative: 2.7 times more frequent than positive gossip.", "num_citations": "27\n", "authors": ["1203"]}
{"title": "Piggyback prototyping: Using existing, large-scale social computing systems to prototype new ones\n", "abstract": " We propose a technique we call piggyback prototyping, a prototyping mechanism for designing new social computing systems on top of existing ones. Traditional HCI prototyping techniques do not translate well to large social computing systems. To address this gap, we describe a 6-stage process for prototyping new social computing systems using existing online systems, such as Twitter or Facebook. This allows researchers to focus on what people do on their system rather than how to attract people to it. We illustrate this technique with an instantiation on Twitter to pair people who are different from each other in airports. Even though there were many missed meetings, 53% of survey respondents would be interested in being matched again, and eight people even met in person. Through piggyback prototyping, we gained insight into the future design of this system. We conclude the paper with considerations for …", "num_citations": "24\n", "authors": ["1203"]}
{"title": "Political blend: an application designed to bring people together based on political differences\n", "abstract": " Modern social media have increasingly helped people separate themselves by worldview. We watch television shows and follow blogs that agree with our views, and read Twitter streams of people we like. The result is often called the echo chamber. Scholars cite political echo chambers as partly to blame for the divisive and destructive US political climate. In this paper, we introduce a mobile application called Political Blend designed to combat echo chambers: it brings people with different political beliefs together for a cup of coffee. Based on interviews, we discovered that people are open to this kind of application and feel it may help the broader political environment. The primary contribution of this work is evidence that people are open to meeting those different from them, even those who ideologically oppose them. In an environment dominated by applications matching based on similarities, we see that this is …", "num_citations": "22\n", "authors": ["1203"]}
{"title": "Leveraging mobile technology to increase the permanent adoption of shelter dogs\n", "abstract": " We present the results of an 8-week pilot study with 55 dogs investigating whether using quantimetric monitors and a companion smartphone application can reduce returns and increase the perceived strength of bonds between newly adopted dogs from the Humane Society of Silicon Valley and their adopters. Through this pilot study, we developed guidelines for future research and discovered promising results indicating that providing dog quantimetric data to adopters through the use of a smartphone application could yield reduced rates of re-relinquishment. Additionally, respondents indicated that they felt using the smartphone application helped them to better meet the activity needs of their dog and increased the bond between themselves and their newly adopted dog.", "num_citations": "21\n", "authors": ["1203"]}
{"title": "Credibility and the dynamics of collective attention\n", "abstract": " Today, social media provide the means by which billions of people experience news and events happening around the world. However, the absence of traditional journalistic gatekeeping allows information to flow unencumbered through these platforms, often raising questions of veracity and credibility of the reported information. Here we ask: How do the dynamics of collective attention directed toward an event reported on social media vary with its perceived credibility? By examining the first large-scale, systematically tracked credibility database of public Twitter messages (47M messages corresponding to 1,138 real-world events over a period of three months), we established a relationship between the temporal dynamics of events reported on social media and their associated level of credibility judgments. Representing collective attention by the aggregate temporal signatures of an event's reportage, we found …", "num_citations": "14\n", "authors": ["1203"]}
{"title": "Computing tie strength\n", "abstract": " Relationships make social media social. But, not all relationships are created equal. We have colleagues with whom we correspond intensely, but not deeply; we have childhood friends we consider close, even if we fell out of touch. Social media, however, treats everybody the same: someone is either a completely trusted friend or a total stranger, with little or nothing in between. In reality, relationships fall everywhere along this spectrum, a topic social science has investigated for decades under the name tie strength, a term for the strength of a relationship between two people. Despite many compelling findings along this line of research, social media does not incorporate tie strength or its lessons. Neither does most research on large-scale social phenomena. In social network analyses, a link either exists or not. Relationships have few properties of their own.", "num_citations": "14\n", "authors": ["1203"]}
{"title": "Lifesource: two cvs visualizations\n", "abstract": " We present LifeSource, two visualizations of CVS code repositories, one file-centric and one author-centric. CodeConnections, the file-centric visualization, pulls out the overall structure of a large body of interacting code and authors. CodeConnections scales well and reveals large trends in the code base at a glance. CodeSaw, the author-centric visualization, compares authors' code and project mail contributions over the course of one year. CodeSaw reveals trends in authors' lives, exposing peaks and valleys of productivity. Both visualizations uncover deep details about the life of a code project to developers and onlookers.", "num_citations": "14\n", "authors": ["1203"]}
{"title": "A statistical framework for streaming graph analysis\n", "abstract": " In this paper we propose a new methodology for gaining insight into the temporal aspects of social networks. In order to develop higher-level, large-scale data analysis methods for classification, prediction, and anomaly detection, a solid foundation of analytical techniques is required. We present a novel approach to the analysis of these networks that leverages time series and statistical techniques to quantitatively describe the temporal nature of a social network. We report on the application of our approach toward a real data set and successfully visualize high-level changes to the network as well as discover outlying vertices. The real-time prediction of new connections given the previous connections in a graph is a notoriously difficult task. The proposed technique avoids this difficulty by modeling statistics computed from the graph over time. Vertex statistics summarize topological information as real numbers …", "num_citations": "13\n", "authors": ["1203"]}
{"title": "Synthesized social signals: Computationally-derived social signals from account histories\n", "abstract": " Social signals are crucial when we decide if we want to interact with someone online. However, social signals are typically limited to the few that platform designers provide, and most can be easily manipulated. In this paper, we propose a new idea called synthesized social signals (S3s): social signals computationally derived from an account's history, and then rendered into the profile. Unlike conventional social signals such as profile bios, S3s use computational summarization to reduce receiver costs and raise the cost of faking signals. To demonstrate and explore the concept, we built Sig, an extensible Chrome extension that computes and visualizes S3s. After a formative study, we conducted a field deployment of Sig on Twitter, targeting two well-known problems on social media: toxic accounts and misinformation. Results show that Sig reduced receiver costs, added important signals beyond conventionally …", "num_citations": "10\n", "authors": ["1203"]}
{"title": "Hybrid approaches to detect comments violating macro norms on reddit\n", "abstract": " In this dataset paper, we present a three-stage process to collect Reddit comments that are removed comments by moderators of several subreddits, for violating subreddit rules and guidelines. Other than the fact that these comments were flagged by moderators for violating community norms, we do not have any other information regarding the nature of the violations. Through this procedure, we collect over 2M comments removed by moderators of 100 different Reddit communities, and publicly release the data. Working with this dataset of removed comments, we identify 8 macro norms---norms that are widely enforced on most parts of Reddit. We extract these macro norms by employing a hybrid approach---classification, topic modeling, and open-coding---on comments identified to be norm violations within at least 85 out of the 100 study subreddits. Finally, we label over 40K Reddit comments removed by moderators according to the specific type of macro norm being violated, and make this dataset publicly available. By breaking down a collection of removed comments into more granular types of macro norm violation, our dataset can be used to train more nuanced machine learning classifiers for online moderation.", "num_citations": "9\n", "authors": ["1203"]}
{"title": "Comparison of limited-contact dynamic compression plate and locking compression plate constructs for proximal interphalangeal joint arthrodesis in the horse\n", "abstract": " This study compared in vitro monotonic and cyclic mechanical properties of equine proximal interphalangeal joint arthrodeses stabilized using an open or closed technique combined with axial 4.5 mm narrow limited-contact dynamic compression plate (LC-DCP) or 4.5 mm narrow locking compression plate (LCP). Ten forelimb pairs were randomly assigned to LCP or LC-DCP groups. One limb in each pair was assigned to either open or closed technique. Limbs were tested for cyclic fatigue at 20 000 cycles and then single-cycle to failure under 3-point dorsopalmar bending. There was no significant difference in stiffness of constructs during cyclic fatigue testing or on force or stiffness at failure in single cycle to failure testing between open and closed techniques or between plate types. Both implants, surgical technique, or combinations thereof are suitable for clinical use. More work is necessary to define the …", "num_citations": "8\n", "authors": ["1203"]}
{"title": "A novel through-thickness perfusion bioreactor for the generation of scaffold-free tissue engineered cartilage\n", "abstract": " The objective of this study was to characterize our designed through-thickness perfusion bioreactor which could generate large scaffold-free tissue engineered cartilage constructs. The hypothesis being that through-thickness perfusion could accelerate maturation of scaffold-free tissue engineered cartilage, grown in transwell culture inserts large enough to repair typical size chondral lesions in the human knee. Internal cell culture media temperature and pH were examined over time, upon implementation of the bioreactor perfusion system inside a CO 2 incubator, to ensure adequate regulation conducive to cell viability. Results indicate that temperature and pH both equilibrate within approximately 3 h. The bioreactor was tested for its efficacy to support formation of 4.5 cm 2 constructs by porcine neonatal chondrocytes. Tests were conducted under three conditions: immediate perfusion with flow from bottom to top, immediate perfusion with media flow from top to bottom, and bottom to top perfusion after four weeks of static culture, giving the cells time to self-aggregate into a consolidated construct prior to perfusion. The best cell culture results were obtained when perfusion was delayed for four weeks relative to the immediate perfusion of the other methods, and this should be further investigated. View Full-Text", "num_citations": "8\n", "authors": ["1203"]}
{"title": "What if we ask a different question? Social inferences create product ratings faster\n", "abstract": " Consumer product reviews are the backbone of commerce online. Most commonly, sites ask users for their personal opinions on a product or service. I conjecture, however, that this traditional method of eliciting reviews often invites idiosyncratic viewpoints. In this paper, I present a statistical study examining the differences between traditionally elicited product ratings (ie,\" How do you rate this product'\") and social inference ratings (ie,\" How do you think other people will rate this product'\"). In 5 of 6 trials, I find that social inference ratings produce the same aggregate product rating as the one produced via traditionally elicited ratings. In all cases, however, social inferences yield less variance. This is significant because using social inference ratings 1) therefore converges on the true aggregate product rating faster, and 2) is a cheap design intervention on the part of existing sites.", "num_citations": "8\n", "authors": ["1203"]}
{"title": "Computing and building around tie strength in social media\n", "abstract": " Relationships make social media social. But, not all relationships are created equal. We have colleagues with whom we correspond intensely, but not deeply; we have childhood friends we consider close, even if we fell out of touch. Social media, however, treats everybody the same: someone is either a completely trusted friend or a total stranger, with little or nothing in between. In reality, relationships fall everywhere along this spectrum, a topic social science has investigated for decades under the name tie strength, a term for the strength of a relationship between two people. Despite many compelling findings along this line of research, social media does not incorporate tie strength or its lessons. Neither does most research on large-scale social phenomena.Simply put, we do not understand a basic property of relationships expressed online. This monograph takes a wide view of the problem, merging the theories …", "num_citations": "7\n", "authors": ["1203"]}
{"title": "Conceptualizing, Creating, & Controlling Constructive and Controversial Comments: A CSCW Research-athon\n", "abstract": " Many social media platforms provide features for commenting, which often provide affordances for people to give feedback to others. Around the theme of advancing research about online comments, this workshop aims to bring together a diverse range of researchers for cross-discipline community building and especially dedicated time for productive, early mixed-methods research. The workshop is structured around a research\" hackathon,\" where participants actively work on producing initial stages of research, theory, and design related to a central dataset (in the case of this workshop, public comments from a historical reddit. com corpus). Participants will form collaborative teams to tackle questions of interest that move forward current thinking around online comment behaviors, participants, quality, and design. The one-day workshop is led by 5 researchers, and it will accommodate up to 32 participants.", "num_citations": "6\n", "authors": ["1203"]}
{"title": "Analyzing gossip in workplace email\n", "abstract": " We spend a significant part of our lives chatting about other people. In other words, we all gossip. Although sometimes a contentious topic, various researchers have shown gossip to be fundamental to social life—from small groups to large, formal organizations. Adopting the Enron email dataset and natural language techniques, we present the first study of gossip in a large CMC corpus. We find that workplace gossip is common at all levels of the organizational hierarchy, with people most likely to gossip with their peers and that it is more likely for an email to contain gossip if targeted to a smaller audience.. Also, gossip appears as often in personal exchanges as it does in formal business communication. Exploring the sentiment of gossip, we observe that gossip is in fact quite often negative. Our study provides empirical evidence of an under-researched yet important societal phenomenon and provides empirical insights by testing existing gossip theories originating from anthropology, on a real world large email dataset.", "num_citations": "6\n", "authors": ["1203"]}
{"title": "Open Book: A Socially-inspired Cloaking Technique that Uses Lexical Abstraction to Transform Messages\n", "abstract": " Both governments and corporations routinely surveil computer-mediated communication (CMC). Technologists often suggest widespread encryption as a defense mechanism, but CMC encryption schemes have historically faced significant usability and adoption problems. Here, we introduce a novel technique called Open Book designed to address these two problems. Inspired by how people deal with eavesdroppers offline, Open Book uses data mining and natural language processing to transform CMC messages into ones that are vaguer than the original. Specifically, we present: 1) a greedy Open Book algorithm that cloaks messages by transforming them to resemble the average Internet message; 2) an open-source, browser-based instantiation of it called Read Me, designed for Gmail; and, 3) a set of experiments showing that intended recipients can decode Open Book messages, but that unintended human …", "num_citations": "5\n", "authors": ["1203"]}
{"title": "Tweety holmes: A browser extension for abusive twitter profile detection\n", "abstract": " Online harassment on social media platforms is a pressing matter for which users are not well equipped to handle or avoid. Twitter users can take advantage of third-party websites to get more detailed metrics about the health of another users account, or they can make reports to Twitter after experiencing abuse, but neither option easily allows them to avoid abusive users. We present Tweety Holmes, which analyzes the word usage of Twitter profiles, detects potentially abusive behavior and then warns users visually. It follows principles of algorithmic transparency by visually indicating which words or tweets flagged the profile as abusive so users can better understand the context and also alerts users when they are mentioned or messages by a potentially abusive user with the hopes that this early warning can prevent unhealthy interactions from taking place in the future.", "num_citations": "4\n", "authors": ["1203"]}
{"title": "Filtered food and nofilter landscapes in online photography: the role of content and visual effects in photo engagement\n", "abstract": " Millions of images are shared through social media every day. Yet, we know little about how the activities and preferences of users are dependent on the content of these images. In this paper, we seek to understand viewers engagement with photos. We design a quantitative study to expand previous research on in-app visual effects (also known as filters) through the examination of visual content identified through computer vision. This study is based on analysis of 4.9 M Flickr images and is organized around three important engagement factors: likes, comments and favorites. We find that filtered photos are not equally engaging across different categories of content. Photos of food and people attract more engagement when filters are used, while photos of natural scenes and photos taken at night are more engaging when left unfiltered. In addition to contributing to the research around social media engagement and photography practices, our findings offer several design implications for mobile photo sharing platforms.", "num_citations": "3\n", "authors": ["1203"]}
{"title": "The social implications of an assisted living reminder system\n", "abstract": " We present the findings of an in situ field study conducted using our assisted living system, I-Living, that aims to enable seniors to live in a cost-effective manner independently. Basing the study on both interviews and diaries provided valuable and well-rounded data. Some of the main findings revealed that seniors will wear small health sensors if designed carefully. The study further reveals that delicate and complicated social structures influence the design space in such communities. The primary contribution of this paper is the pilot study conducted at an assisted living facility. It paints a compelling picture of day-to-day life in a healthcare institution and uncovers broad design implications that apply to a wide range of technologies.", "num_citations": "3\n", "authors": ["1203"]}
{"title": "Pop: Bursting News Filter Bubbles on Twitter Through Diverse Exposure\n", "abstract": " An increasing number of American adults are consuming news on social media platforms. However, these digital platforms employ personalized recommendation algorithms to increase user engagement. This selective exposure to information leads to the formation of filter bubbles where the users are constantly fed information in line with their ideological views. In this paper, we aim at bursting these filter bubbles through diverse exposure. We discuss the design of a Google Chrome extension, Pop, which augments user's Twitter feeds with news tweets from agencies of different ideological standings.", "num_citations": "2\n", "authors": ["1203"]}
{"title": "A comparison of decellularization methods applied to porcine osteochondral xenografts for articular cartilage repair\n", "abstract": " The objective of this research was to compare decellularization methods for porcine osteochondral xenografts, which may have potential application in articular cartilage repair.[empty set] 5.0 mm porcine osteochondral dowels were obtained from adult pig knee joints. Method 1 was a technique that had been developed for osteochondral xenografts. Method 2 had been used to decellularize xenogenic myocardium for cardiac tissue engineering. Method 3 was designed to partially demineralize and deproteinize xenogenic bone for bone defect filling. Evaluations of the osteochondral xenografts biochemistry, biomechanics, and histology were performed. In addition, they were assessed for their ability to resurface the trochlear groove of adult New Zealand white rabbits in vivo for up to 8 weeks. Method 1 removed almost all of the glycosaminoglycans and DNA, but this severely compromised the compressive stiffness …", "num_citations": "1\n", "authors": ["1203"]}
{"title": "\" Analyzing gossip in workplace email\" by Tanushree Mitra and Eric Gilbert, with Ching-man Au Yeung as coordinator\n", "abstract": " We spend a significant part of our lives chatting about other people. In other words, we all gossip. Although sometimes a contentious topic, various researchers have shown gossip to be fundamental to social life---from small groups to large, formal organizations. Adopting the Enron email dataset and natural language techniques, we present the first study of gossip in a large CMC corpus. We find that workplace gossip is common at all levels of the organizational hierarchy, with people most likely to gossip with their peers and that it is more likely for an email to contain gossip if targeted to a smaller audience. Also, gossip appears as often in personal exchanges as it does in formal business communication. Exploring the sentiment of gossip, we observe that gossip is in fact quite often negative. Our study provides empirical evidence of an under-researched yet important societal phenomenon and provides empirical …", "num_citations": "1\n", "authors": ["1203"]}