{"title": "Implemantasi Apps Teacher Kit untuk Proses Administrasi Dosen Mandiri yang Efektif, Efisien, dan Paperless\n", "abstract": " Teknologi smartphone tidak bisa diremehkan keberadaan dan kemajuannya. Kemajuan yang ada banyak yang mendukung kelancaran dalam pendidikan. Tenaga dosen sebagai panutan para mahasiswa hendaknya mampu menggunakan segala aplikasi smartphone terutama aplikasi yang fiturnjang pelaksanaan pendidikan. Tujuan dari penggunaan aplikasi-aplikasi dalam pendidikan itu bertujuan agar pelaksanaan administrasi penilaian dan segala hal yang berhubungan dengan absensi mahasiswa dapat disimpan secara online atau paperless. Hal ini sangat berguna dan secara langsung mengurangi penggunaan kertas.", "num_citations": "6\n", "authors": ["1287"]}
{"title": "The Evaluation of Information System Performance in Higher Education Case Study with EUCS Model at Bandar Lampung University\n", "abstract": " Simperti has been used for about more than 10 years at the bandar lampung university, but the system has’ nt been done with the developing which it must be followed the bussiness need in UBL. Sometimes it arises the problem that give obstacles which will give impact to UBL’s academy performance, the management has not been taking any actions to improve the simperti’s performance, especially in terms of user satisfaction that indicate which parts need to be improved to meet the needs of the user, because it has not been done an analysis of the feasibility of the system in terms of the end user.", "num_citations": "6\n", "authors": ["1287"]}
{"title": "Document Management System Based on Paperless\n", "abstract": " Loss documents and the high cost of document storage space are a major problem often faced by many organizations at this company, especially for those who have large amounts of paper documents. Therefore, we need a proper solution with the help of information technology known as the Document Management System. With this system, the paper documents are converted in digital form and stored in a disk or other digital storage facility (paperless). Furthermore to the search, discovery, display, printing, distribution and even documents can be done virtually through computer networks. Security policy can also be applied strictly in the management of these documents, so the only party entitled to can access the document according to its designation. Protection against the document is done digitally, so that relatively more secure and easier to use. Document Management System based on Paperless are effective and useful in an office to streamline in the process of documentation. The main benefit is that users can find needed information quickly, so it can help the process become faster, better, cheaper, and reduce environmental impacts (Green Computing). In this system of administration are routine operations performed by each individual in an organization or office activities. Technology and administration without paper is the efficiency in the use of paper, especially in terms of paperwork and correspondence in order to achieve certain objectives in managing the administrative management system or the idea of a paperless office. This paper present a paperless model for the university management system. A survey has been conducted …", "num_citations": "6\n", "authors": ["1287"]}
{"title": "Aplikasi E-Marketing Panglong Kayu Menggunakan Metode Colaborative Filtering\n", "abstract": " Usaha pengolahan kayu semakin makin berkembang, dan menjadi salah satu peluang bisnis yang berpotensial di zaman sekarang. Industri pengolahan kayu seperti pengolahan kayu jati, kayu konstruksi bangunan, industri kreatif juga banyak yang menggunakan bahan kayu. Namun, Banyak usaha-usaha yang terpaksa terhenti karena tertinggal dengan kemajuan teknologi termasuk usaha pengolahan kayu. Permasalahan yang dihadapi, kebanyakan pengusaha panglong masih sepenuhnya berharap pada pemasaran yang dikelola secara tradisional saja. Proses pemasaran produk tersebut dilakukan secara manual hanya melalui interaksi langsung dengan konsumen. Selain itu, pemasaran produk hanya terfokus pada tempat-tempat tertentu seperti datang langsung ke tempat pengrajin atau ketika ada pameran. Untuk alasan ini, desain dan pengembangan aplikasi e-marketing panglong kayu diperlukan untuk menemukan informasi yang dibutuhkan dalam waktu yang cepat dan akurat. Aplikasi dibangun menggunakan pendekatan Collaborative Filtering. Berdasarkan hasil penelitian dengan menerapkan aplikasi e-marketing panglong kayu di Kota Bandar Lampung dapat memperluas pangsa pasar, memberikan kemudahan dalam pemberian informasi kepada konsumen, dan memudahkan pengguna dalam memberikan rekomendasi panglong kayu berdasarkan rating yang telah diberikan oleh para pengguna lainya", "num_citations": "4\n", "authors": ["1287"]}
{"title": "Portal e-Brosur Berbasis Modern Advertising Methods untuk Efektifitas Periklanan\n", "abstract": " Brochure printing is one of the marketing strategy for the company for marketing its products. Emarketing, advertising services are now getting the attention of the public since the aspects of information becomes important in business. Effective advertising activities deemed capable of affecting the Internet user community. By using modern advertising methods or modern advertising methods are expected E-brochures can be a new innovation to the world of e-marketing. Using this method there is Profit and loss of both marketers and consumers in particular. Advantages era could now access modern advertising we find easily on the internet so marketers can easily advertise their products but some rogue marketers who make fraudulent internet as a place to advertise that do not conform to the norms of moral, cultural and religious, and it can annoy even harm consumers or internet users. Based on the above background, the authors are interested in conducting research on building systems based Portal E-brochure Modern Advertising Methods For advertising effectiveness of e-marketing and pour in the form of a research proposal titled\" Portal-Based E-Brochure Modern Advertising Methods For Effectiveness Advertising\".", "num_citations": "4\n", "authors": ["1287"]}
{"title": "Sistem Pakar Diagnosa Penyakit Pada Ayam Broiler Dengan Metode Forward Chaining\n", "abstract": " Bertenak bibit ayam broiler bukanlah hal yang mudah, banyak faktor yang harus di perhatikan. Sedari awal memulai beternak segala sesuatunya harus diatur sedemikian rupa agar berjalan maksimal dan produktif. Mulai dari perkandangan, mengurus pakan, juga memperhatikan kesehatan hewan ternak. Apalagi banyak wabah penyakit yang dapat mucul dari berbagai aspek, seperti cuaca yang tidak stabil, lingkungan yang kotor, atau pakan yang kurang sesuai takarannya. Penyakit dapat dengan mudah menyerang hewan ternak melalui berbagai bakteri yang terkandung pada udara maupun makanan. Melihat dari faktor-faktor diatas, penulis ingin menciptakan suatu alat pengukur suhu tubuh ayam yang di lengkapi dengan sistem pendeteksi penyakit berdasarkan gejala-gejala yang ditunjukan oleh ayam. Penyakit akan lebih mudah di basmi jika kita dapat mengetahui diagnosa diawal-awal terjangkit. Seperti pada masa awal masuknya bibit ayam broiler kedalam kandang akan sangat rentan bagi bibit ayam terserang penyakit jika tidak diperhatikan secara benar. Pada penelitian ini, peneliti akan membuat alat pengkur suhu tubuh untuk mengukur suhu tubuh ayam broiler. Menggunakan sensor dan mikrokontroler dan membangun sistem aplikasi android untuk melengkapi proses diagnosa penyakit.", "num_citations": "3\n", "authors": ["1287"]}
{"title": "Student Satisfaction Analysis of Siater Using End User Computing Statisfaction (EUCS)\n", "abstract": " The purpose of this research is to know the extent to which students levels of satisfaction level of Strata-1 University of Bandar Lampung on the Sistem Informasi Akademik dan Administrasi Terpadu (SIATer) and any indicators that need to be improved in order to increase student satisfaction against SIATer. This type of research using a quantitative approach. The respondents determined using techniques research of Stratified Random Sampling with certain criteria. As for sample determination technique using tables Stephen Isaac & Willian B. Michael. From the results of the study showed that university students Bandar Lampung has yet fully satisfied against SIATer. Based on the method of End User Computing Statisfaction (EUCS), note that the indicators should be improved in order to increase student satisfaction is an indicator of formats, ease of use, and from the side of timeliness.", "num_citations": "3\n", "authors": ["1287"]}
{"title": "Digitalisasi Sistem Marketing Minyak Nilam dengan Model Perancangan Berbasis Unified Approach Method\n", "abstract": " Penelitian ini dilakukan untuk merancang sebuah sistem pemasaran Minyak Nilam berbasis Unified Approach Method (UAM) karena selama ini sistem pemasaran yang masih manual membuat usaha Minyak Nilam yang sedang marak dikembangkan oleh masyarakat Pasaman Barat berjalan lambat dan selalu mengalami kendala dalam pelaporan setiap transaksi yang terjadi baik harian maupun bulanan. Penggunaan metode Research and Development (RnD) dalam menghasilkan produk berupa aplikasi untuk Marketing Minyak Nilam serta melakukan pengujian efektifitas aplikasi yang dihasilkan serta Unified Approach Methode (UAM) membuat perancangan lebih memiliki korelasi dengan teknik pemrograman yang berbasis object oriented. Metode ini menggunakan Unified Modelling Language (UML) sebagai standar pemodelannya. UAM adalah suatu usaha untuk mengkombinasikan praktek, proses dan cara kerja yang terbaik dengan notasi dan diagram-diagram UML untuk memahami lebih baik konsep objek oriented dan pengembangan sistem objek oriented. Hasil dari penelitian ini adalah tersedianya sebuah rancangan sistem pemasaran berbasis digital sehingga dapat mempermudah setiap pencatatan transaksi yang terjadi dan membuat kegiatan pendokumentasian lebih rapi dan terstruktur.", "num_citations": "2\n", "authors": ["1287"]}
{"title": "Penentuan Penerima Kinerja Dosen Award Melalui Metode Tsukamoto Dengan Konsep Logika Fuzzy\n", "abstract": " Pengelolaan terhadap kinerja dosen merupakan suatu upaya penting yang perlu dilakukan. Kompensasi merupakan satu dari sekian banyak cara dalam meningkatkan prestasi kerja, motivasi, dan kepuasan kerja di lingkungan perguruan tinggi. Salah satu sistem kompensasi tersebut dapat berupa pemberian penghargaan secara langsung. Namun pada prakteknya dalam penentuan penerima penghargaan ini sering kali tidak objektif salah satunya karena adanya kedekatan fisik maupun kedekatan emosi. Selain dirasa memang cukup sulit, penentuan penerima penghargaan ini terkadang terkendala karena tidak adanya approach yang terukur dan metode untuk membantu menentukan penerima penghargaan tersebut.", "num_citations": "2\n", "authors": ["1287"]}
{"title": "Sistem Rekomendasi Beauty Shop Berbasis Collaborative Filtering\n", "abstract": " The increasing number of beauty places makes it difficult for consumers to determine a beauty shop that fits the required criteria, for example a beauty shop that has facial care, body and hair care services, good quality, and affordable prices. Preferences create a different sense of satisfaction for each person. Satisfaction in this case is the extent to which the perception of the beauty shop is in accordance with user expectations. The purpose of this study is to build an online beauty shop application that can provide recommendations for beauty shops in Bandar Lampung based on the beauty shop rating. The application is built with a recommendation system using the Collaborative Filtering method. This research can make it easier to provide recommendations about beauty stores based on ratings given by other users. The feasibility test of the software shows that the online beauty shop application with a recommendation system based on Collaborative Filtering was successfully tested using the Gutman scale questionnaire technique with good results.", "num_citations": "1\n", "authors": ["1287"]}
{"title": "Decision Support System Analysis Method Technique For Preference By Order To Ideal Solution Similarity (TOPSIS)\n", "abstract": " In some circumstances, sometimes people are faced with several options. Such as selecting school, choose a subject, choose a place of residence, employment and others. Determining the choice was not easy, making indecisive and difficult to take decisions. And sometimes people pay less attention to the positive and negative impacts in making a decision, as well as the lack of attention to aspects or essential criteria required. Moreover, if the wrong decision, can be bad for the man himself. Therefore, it is necessary Decision Support Systems. Decision Support System (DSS) or Decision Support System (DSS) is a system that can provide problem-solving ability and the ability of communicating to a problem with the condition of semi-structured and unstructured. This system is used to assist decision-making in situations of semi-structured and unstructured situations, where no one knows for sure how the decision should be made (Turban, 2001). The method used by the author in the Decision Support System is a method Technique for Order Preference by Similarity to Ideal Solution (TOPSIS)", "num_citations": "1\n", "authors": ["1287"]}
{"title": "Aplikasi Internal Audit Berbasis ISO 9001:2008 dan ISO 19011:2002 untuk Menunjang Efektifitas Pengendalian Mutu Akademik\n", "abstract": " Penelitian ini dilakukan untuk memberikan solusi terhadap sulitnya pemonitoringan terhadap hasil temuan dan koreksi audit serta belum adanya aplikasi interface yang memudahkan proses pengauditan internal di FIK UBL. Sudah suatu keharusan sebuah institusi melaksanakan internal audit sebagaimana yang telah tertuang dalam Standar Sistem Manajemen Mutu ISO 9001: 2008 klausul 8.2. 2 tentang Internal audit yang diperjelas dalam ISO 19011: 2002. Penelitian ini akan membangun sebuah aplikasi web internal audit Berbasis ISO 9001: 2008 dan ISO 19011: 2002. Dalam pelaksanaannya aplikasi ini akan dibangun dengan bahasa pemprograman PHP dan dimodelkan dengan diagram UML. Dengan adanya web internal audit Berbasis ISO 9001: 2008 dan ISO 19011: 2002 diharapkan akan lebih mempermudah proses pelaksanaan internal audit dan pemonitoringan hasil temuan dan koreksi auidit itu sendiri.", "num_citations": "1\n", "authors": ["1287"]}