{"title": "Herramientas para la gestión de procesos de negocio y su relación con el ciclo de vida de los procesos de negocio: una revisión de literatura\n", "abstract": " Este artículo presenta una revisión sobre la oferta de herramientas de tecnología de información, TI, para la gestión de procesos de negocio (Business Process Management-BPM). Para esto, se desarrolla una conceptualización de las etapas del ciclo de vida de los procesos de negocio y se realiza una descripción de las herramientas de TI desde una perspectiva funcional. Luego, se realiza un mapeo para ubicar las herramientas de TI en cada una de las fases del ciclo de vida. Este trabajo se constituye en una referencia para los profesionales que desarrollan iniciativas de BPM, así como para investigadores, profesores y estudiantes interesados en el tema. La principal contribución del trabajo es la conceptualización de las etapas del ciclo de vida de BPM y la identificación de herramientas de TI que soportan cada una de estas.", "num_citations": "70\n", "authors": ["1392"]}
{"title": "A critical review of knowledge management in software process reference models\n", "abstract": " Knowledge Management (KM) is a critical subject for software development organizations. For this reason, the purpose of this article is to provide a critical review on the way that KM is included in several models of reference of software process (SPRM). For this, five SPRM used in the Latin American countries were selected. Then, an analysis of each process of the SPRM was performed in order to identify features related to the KM. Finally, the KM aspects were mapped in relation to the KM schools (Earl) and the KM capacities (Gold et al). The main contribution of the paper is to show some breaches in SPRM content in relation to KM schools and capabilities.", "num_citations": "40\n", "authors": ["1392"]}
{"title": "Identificación de factores que afectan el desarrollo de la inclusión digital\n", "abstract": " La inclusión digital se enfoca en el aprovechamiento de los beneficios que ofrece la sociedad de la información a todos los ciudadanos, independientemente de su condición de salud, económica, edad, género o ubicación geográfica. Para identificar los factores que afectan su desarrollo se analizaron diferentes teorías, específicamente: análisis de brecha digital, sociales y de investigación, y de inequidades digitales y la e-inclusión. Lo anterior permitió establecer factores esenciales para la e-inclusión: las características individuales de la población, el acceso a la infraestructura de tecnología de información y comunicación, las habilidades digitales, la motivación y el uso de productos de servicios digitales.", "num_citations": "33\n", "authors": ["1392"]}
{"title": "Técnicas de modelado de procesos de ETL: una revisión de alternativas y su aplicación en un proyecto de desarrollo de una solución de BI\n", "abstract": " La tarea de un diseñador de procesos de ETL involucra:(1) analizar las fuentes de datos existentes para encontrar la semántica oculta en ellas y (2) diseñar el flujo de trabajo que extraiga los datos desde las fuentes, repare sus inconsistencias, los transforme en un formato deseado, y, finalmente, los inserte en la bodega de datos. Con el propósito de facilitar esta tarea, se han desarrollado diferentes técnicas, dos categorías que sobresalen son:(a) Las inspiradas en los diagramas de flujo y de procesos y (b) las inspiradas en el paradigma de programación orientada a objetos (POO) y los diagramas de UML. En el presente artículo se expone un par de alternativas halladas en la literatura y se ilustra la técnica utilizada en el proyecto “Desarrollo de una solución de inteligencia de negocios para apoyar a la toma de decisiones en el Proyecto Círculos de Aprendizaje”, explicando el porqué de su elección y cómo se usó.", "num_citations": "19\n", "authors": ["1392"]}
{"title": "Hacia un modelo de referencia de procesos de gestión del conocimiento para organizaciones desarrolladoras de software: validación por expertos\n", "abstract": " El propósito de este artículo es presentar el resultado de la validación del contenido y la estructura de una propuesta de modelo de referencia de procesos de Gestión del Conocimiento (GC) para organizaciones desarrolladoras de software. Específicamente se realizó una consulta a expertos en GC afiliados a instituciones ubicadas en América Latina por medio de un cuestionario en línea, en el que se indagó sobre los elementos descriptivos de los procesos del modelo, la importancia y la viabilidad que tendría la implementación de los procesos del modelo en las organizaciones de América Latina, y el nivel de influencia que puede ejercer un grupo de factores sobre el éxito de la implementación de los procesos del modelo. Los resultados obtenidos mostraron altos niveles de consenso entre los expertos sobre el cumplimiento de los criterios establecidos para la validación. Además, se detectaron aspectos a mejorar en la descripción de los procesos del modelo los cuales sirven de punto de partida para el ajuste y la elaboración de una nueva versión del modelo.", "num_citations": "17\n", "authors": ["1392"]}
{"title": "Evaluación de la Gestión del Conocimiento: Una Revisión Sistemática de Literatura\n", "abstract": " La evaluación de la gestión del conocimiento (GC) es un tema importante para aquellas organizaciones que quieran saber “qué está pasando” con sus estrategias de GC. No obstante, no existe un consenso sobre qué evaluar y cómo evaluarlo. Por esta razón, el propósito del artículo es presentar una revisión sistemática de literatura de 43 artículos publicados en la última década. La revisión comprende un análisis cienciométrico básico y un análisis de contenido relacionado con varios aspectos de los modelos como su estructura, la función y objetivo de la evaluación, lo métodos de investigación utilizados, los sectores económicos de aplicación, y la ubicación de los aspectos evaluados respecto de una taxonomía de escuelas de pensamiento de la GC y una clasificación de las capacidades organizacionales de GC. Como principal hallazgo se muestra la predominancia del enfoque de GC como codificación de conocimiento. Además, se presentan varias brechas susceptibles de investigación futura.", "num_citations": "17\n", "authors": ["1392"]}
{"title": "Soluciones de inteligencia de negocios en la práctica: apoyo a la toma de decisiones en proyectos educativos para población infantil vulnerable en el caribe Colombiano\n", "abstract": " La inteligencia de negocios se utiliza para dar respuesta a problemas relativos al acceso, la disponibilidad y la utilidad de la información. Este artículo presenta el proceso y los resultados obtenidos en la construcción de una solución de inteligencia de negocios de apoyo a la toma de decisiones en proyectos educativos para población infantil vulnerable en el Caribe colombiano. El contexto de la aplicación es la ejecución del proyecto Círculos de Aprendizaje, modelo educativo operado por la Universidad del Magdalena desde el año 2006, cuyo objetivo fundamental es vincular al sistema escolar a niños desplazados por la violencia y/o en condiciones de vulnerabilidad. Para construir la solución se utilizaron como guías metodológicas el modelo de Moss y Atre y el método ágil Programación Extrema. La principal implicación práctica de este trabajo es la de mostrar la utilidad de estas tecnologías en contexto diferentes al de los negocios.", "num_citations": "12\n", "authors": ["1392"]}
{"title": "Tecnologías de información para acercar al ciudadano a los servicios de justicia en Colombia: El caso del mapa de oferta de justicia\n", "abstract": " El propósito de este artículo es presentar los resultados de un proyecto de desarrollo tecnológico que consistió en construir una plataforma web para administrar y divulgar de la información sobre la oferta de servicios de justicia en Colombia, denominada Mapa de Oferta de Justicia. Para lograr los resultados, se utilizó un enfoque ágil en el desarrollo del software, específicamente, el método denominado programación extrema (extreme programming-XP). Los principales resultados fueron: la construcción de tres productos software:(1) tesauro de oferta de justicia,(2) directorio de instituciones, y (3) plataforma de reportes e indicadores sobre oferta de justicia; y la recopilación de la información de contacto y caracterización de cada institución que ofrece servicios de justicia en Colombia. Por último, este trabajo muestra la forma como la tecnología de información puede apoyar áreas tan importantes como la justicia en Colombia, lo cual está en consonancia con lo propuesto en el Plan Nacional de Tecnologías de la Información y las Comunicaciones (Colombia Plan TIC).", "num_citations": "10\n", "authors": ["1392"]}
{"title": "Systematic Literature Review of the Implementation of Knowledge Codification Process\n", "abstract": " The purpose of this paper is to present the result of a Systematic Literature Review SLR of models, methodologies, guidelines, analysis, strategies, practices and frameworks related to the implementation of Knowledge Codification Process. The study was conducted following the SLR approach, taking into account only scientific documents published between 2004 and 2013. The revision consisted of four phases: search process, inclusion and exclusion filter, quality assessment, and data extraction, each of which was intended to select the most suitable information to help answer the research questions; case studies were mainly considered for future applications in organizations. The results of each document were identified as well as its activities, roles, tools, variables and indicators. The findings did not explicitly show documents where the implementation of Knowledge Codification Process was specified. As a …", "num_citations": "8\n", "authors": ["1392"]}
{"title": "Concretando la tercera misión (3m) de la Universidad Pública Regional. Impactos y percepciones de un proyecto de extensión. Caso Universidad del Magdalena\n", "abstract": " El propósito de este artículo es presentar un análisis de la orientación asumida por una universidad de la región Caribe colombiana para desarrollar acciones ubicadas en lo que se ha denominado “la tercera misión de la universidad”. Adicionalmente, se hace análisis del efecto generado en la universidad por la ejecución de proyectos de extensión. El enfoque metodológico utilizado fue el de estudio de caso tomando un proyecto de intervención de alcance regional como unidad de análisis. En este contexto, las fuentes de información utilizadas fueron: información documental de la ejecución del proyecto, entrevistas semiestructuradas a los coordinadores del proyecto y una encuesta de percepción sobre la tercera misión dirigida a una muestra de profesores de la universidad. El principal hallazgo de este estudio fue la identificación y caracterización de la orientación asumida por la universidad objeto de estudio para desarrollar la tercera misión con énfasis en el desarrollo social del entorno. Aunque este estudio se limitó a un único caso en un contexto particular, los hallazgos obtenidos permitieron evidenciar algunos rasgos de la materialización de la tercera misión de la universidad, los cuales pueden servir de referencia para desarrollar estudios similares en otros contextos institucionales de la región y del país.", "num_citations": "8\n", "authors": ["1392"]}
{"title": "Estudio exploratorio sobre conocimiento y acceso al teletrabajo con líderes comunales de Santa Marta, Colombia\n", "abstract": " Este artículo de investigación 8 se orienta a establecer si 68 líderes comunales del Distrito de Santa Marta (Magdalena), conoce y accede a servicios de teletrabajo. El objetivo era identificar aspectos que deberían fortalecerse en su proceso de alfabetización digital. Para realizar el estudio se utilizó una metodología de tres etapas. Los principales resultados fueron identificar que el 95% de la población accede a infraestructura de Tecnología de Información, el 67, 6% conoce acerca del teletrabajo pero el 45, 6% solo utiliza servicios de búsqueda y el 1, 5% ha generado algún tipo de ingresos asociado al teletrabajo. Los principales motivos para no hacer uso del teletrabajo son el desconocimiento y el desinterés, aunque reconocen las facilidades que ofrece el Internet.", "num_citations": "7\n", "authors": ["1392"]}
{"title": "Understanding the Process of Knowledge Transfer in Software Engineering: a Systematic Literature Review\n", "abstract": " Purpose-There has been an increasing interest about knowledge management in software engineering last years, most of the attention has been focused on knowledge codification and sharing, but less in knowledge transfer. The purpose of this paper is to make a general review of the work done about knowledge transfer in software engineering. Design/methodology/approach–An opportunistic systematic literature review protocol was made, looking for answer the question about what the topics are studied knowledge transfer in software engineering as a whole, which parts of software engineering needs deeper study and how knowledge transfer could be measured. Findings–Knowledge transfer in software engineering studies could be classified in two parts: firstly the companies size (multinationals, big, medium and small) and their social capital, and secondly the software process, where were found out that software requirements have not been deeply studied since the knowledge transfer perspective. Referring measurement, it was found out that is a topic still in his infancy. Originality/value–This paper use a systematic revision protocol to better understand what work has been done concerning knowledge transfer in software engineering, and argues why more attention is needed for the knowledge transfer in software requirements.", "num_citations": "7\n", "authors": ["1392"]}
{"title": "Analysis of variables and indicators for measuring e-government published in scientific literature\n", "abstract": " PACHECO REDONDO, Dayanis Esther; GALVIS-LISTA, Ernesto Amaru and GONZALEZ-ZABALA, Mayda patricia. Analysis of variables and indicators for measuring e-government published in scientific literature. Cienc. Ing. Neogranad.[online]. 2017, vol. 27, n. 2, pp. 83-107. ISSN 0124-8170. http://dx. doi. org/10.18359/rcin. 2226.", "num_citations": "6\n", "authors": ["1392"]}
{"title": "Análisis de indicadores de Ciencia, Tecnología e Innovación (CTI) propuestos por Instituciones de Educación Superior Latinoamericanas\n", "abstract": " Con el objetivo de entender los aspectos que son considerados relevantes en los procesos de medición y seguimiento de la Ciencia, Tecnología e Innovación (CTI) realizados por Instituciones de Educación Superior en Latinoamérica, se realizó una investigación cuyo propósito fue analizar los indicadores que utilizan en sus procesos de evaluación. Los resultados permitieron evidenciar que estos se enfocan a la medición de insumos, procesos y productos, y se centran mayoritariamente a la medición de actividades de Investigación y Desarrollo.", "num_citations": "6\n", "authors": ["1392"]}
{"title": "Modelo de referencia de procesos de gestión de conocimiento aplicable a organizaciones desarrolladoras de software del contexto colombiano\n", "abstract": " En esta disertación doctoral se construyó un modelo de referencia de procesos de Gestión de Conocimiento (GC) aplicable a organizaciones desarrolladoras de software (ODS) del contexto colombiano (MRPGC). Para lograr este objetivo se definió un diseño metodológico compuesto de cinco fases que se ejecutaron de forma secuencial y dentro de algunas fases se utilizaron varios métodos de forma concurrente. Este diseño metodológico permitió que al finalizar cada una de las primeras cuatro fases se obtuviera una versión del MRPGC, la cual fue el punto de partida para la ejecución de la siguiente fase. Específicamente, en la primera fase se construyó la primera versión del MRPGC con base en los resultados obtenidos de una revisión sistemática de literatura sobre procesos de GC. En la segunda fase se construyó la segunda versión del MRPGC a partir de la ejecución de estudios exploratorios desarrollados con actores de la Industria de Software de Colombia, en los cuales se utilizó como fundamento la primera versión del modelo. En la tercera fase se construyó la tercera versión del MRPGC a partir de la comparación de la segunda versión con otro modelo de procesos de GC creado en América Latina ya partir de un ejercicio de consulta a expertos en GC de América Latina. En la cuarta fase se construyó la versión final del MRPGC a partir de la verificación de la conformidad de la tercera versión en relación con los requisitos establecidos en el estándar ISO/IEC 15504 para modelos de referencia de procesos. Por último, en la quinta fase se desarrolló un diagnóstico inicial en organizaciones de la Industria de Software de …", "num_citations": "6\n", "authors": ["1392"]}
{"title": "Propuesta de un sistema de información para apoyar la operación de modelos de educación en situación de emergencia: caso círculos de aprendizaje\n", "abstract": " Este artículo presenta los resultados de una investigación que consistió en apoyar con sistemas de información–SI la operación del modelo educativo Círculos de Aprendizaje por parte de la Universidad del Magdalena, en el marco del Proyecto Círculos de Aprendizaje-PCA. Como metodología de investigación se seleccionó el Desarrollo de Sistemas de Información desde el Pensamiento de Sistemas Blandos–DSI, así mismo, se hizo uso de los Sistemas de Actividad Humana-HAS de la Metodología de Sistemas Blandos–MSB. Los principales resultados fueron el defnir el sistema de actividades principal del PCA, así como los subsistemas para los componentes pedagógico, comunitario y de gestión del proyecto. Así mismo, la conceptualización y el desarrollo de herramientas de tecnología de información–TI que apoya la ejecución de las actividades de dichos componentes. Finalmente, esta investigación muestra la forma en que los SI y la TI pueden apoyar áreas tan importantes como la educación en condiciones de emergencia, especialmente, desplazamiento forzado y pobreza extrema; y de realizar investigación aplicada a los problemas del contexto.", "num_citations": "6\n", "authors": ["1392"]}
{"title": "Estudio exploratorio sobre competencias digitales y uso de e-servicios. Caso estudiantes de una Facultad de Salud de Norte de Santander-Colombia\n", "abstract": " Este artículo presenta un estudio exploratorio sobre competencias digitales y uso de servicios digitales (e-servicios). Además, la motivación para acceder a estos, a un grupo de estudiantes de la Facultad de Salud de la Universidad de Pamplona. El objetivo de la investigación es analizar el uso de las Tecnología de la Información y la Comunicación por parte de los estudiantes. Para lograr los objetivos se propuso utilizar una metodología compuesta por tres etapas: i) determinar el contexto, ii) recolección de datos, y iii) generación de reportes y análisis de resultados. Los resultados logrados fueron: la caracterización de los estudiantes que participaron en el estudio, la identificación de las condiciones de acceso a infraestructura de TIC. Así mismo, se identificó que la población en estudio tenía dificultades para usar formularios en línea y en identificar entornos seguros para las transacciones. Esta falta de competencias digitales, sumado a aspectos técnicos y económicos, hacen que se limite el uso que los estudiantes hacen de los e-servicios. En relación con el uso de servicios, se identificó que la totalidad de la población accede a servicios de comunicación y entretenimiento. El uso que hacen de los e-servicios en educación, salud y trabajo se enfoca, principalmente, a servicios informacionales. Finalmente, los resultados se constituyen en una base que permite identificar aspectos a ser reforzados en los procesos de formación que brinda la universidad.", "num_citations": "5\n", "authors": ["1392"]}
{"title": "Propuesta de un sistema para la formación en la operación de subestaciones de transmisión de energía eléctrica.\n", "abstract": " Este artículo presenta la propuesta de un sistema para el entrenamiento del alento humano que desarrolla la actividad de operación de subestaciones de transmisión de energía eléctrica. En el desarrollo del proyecto se utiliza como guía un enfoque de investigación acción orientado por la Metodología de los Sistemas Blandos (MSB) propuesta por Checkland, y los principios para la organización que aprende planteados por Morgan, Argyris y Schön, y Nonaka, a partir de lo cual se asume la idea del mejoramiento a partir del aprendizaje para proponer la conceptuación de la situación de interés, el modelado conceptual del sistema, y la especificación funcional de tecnología software de apoyo.", "num_citations": "5\n", "authors": ["1392"]}
{"title": "Perfil de la investigación sobre inteligencia de negocios en América Latina\n", "abstract": " Este estudio presenta un análisis detallado de la investigación en el área de la Inteligencia de Negocios en América Latina, durante el periodo 2000-2012. Los datos de este estudio fueron extraídos de la base de datos de resumes y citaciones bibliográficas SCOPUS y analizados siguiendo la metodología propuesta por Alan Porter. El software utilizado para soportar las técnicas de análisis cienciométrico fue The Vantage Point. Los resultados muestran un crecimiento en la producción de la literatura científica sobre Inteligencia de Negocios, que ha aumentado de 22 artículos en el 2000 a 261 en el 2012. Adicionalmente, se evidencia que los temas más investigados están relacionados con la minería de datos y que las instituciones de Brasil producen la mayor cantidad de la literatura en la región, pues el 56% de las publicaciones provienen de ese país.", "num_citations": "4\n", "authors": ["1392"]}
{"title": "Solución de inteligencia de negocios para la gestión de recursos educativos y espacios físicos en la Universidad del Magdalena\n", "abstract": " El presente artículo describe una solución de inteligenciade negocios para la gestión de recursos educativosy espacios físicos en la Universidad del Magdalena. Con esta solución se pueden obtener informeshistóricos y actuales de los procesos, gestionar elrendimiento, tomar decisiones de compra de nuevosrecursos, prever la ocupación o uso de los recursos, mejorar la disponibilidad de los recursos, entre otras. Para el desarrollo e implementación de la solución, seusó la plataforma Business Intelligence, de MicrosoftSQL Server 2008 R2 El modelado de los procesos serealizó mediante la notación BPMN y para el modeladode los procesos de ETL y de la Bodega de Datos, se usó UML. El método guía fue una adaptación deProgramación Extrema al contexto del desarrollo desoluciones de Inteligencia de Negocios.", "num_citations": "4\n", "authors": ["1392"]}
{"title": "Análisis de indicadores de Ciencia, Tecnología e Innovación (CTI) propuestos por Organizaciones Nacionales de CTI en América Latina\n", "abstract": " Los procesos de ciencia, tecnología e innovación (CTI) son considerados esenciales para el desarrollo y apalancamiento de la productividad y el crecimiento de los países; por esto, resulta esencial hacer seguimiento a los avances obtenidos. Con el fin de entender dichos procesos de evaluación, se realizó una investigación orientada a analizar los indicadores propuestos para medir CTI por parte de organismos nacionales de CTI. Para obtener los resultados se utilizó una metodología de cuatro fases. Los principales resultados obtenidos correspondieron a identificar que la actividad de CTI más evaluada es la investigación y desarrollo tecnológico (I+ D), con el 43, 1% de los indicadores. En relación con las diferentes etapas del desarrollo de la CTI, se encontró que la evaluación de insumos agrupaba el 49, 7% de los indicadores, seguido de la evaluación de resultados (26, 0%) y de procesos de CTI (14, 2%). Los resultados pueden ser la base para futuros modelos de evaluación.", "num_citations": "3\n", "authors": ["1392"]}
{"title": "Estudio exploratorio sobre factores de éxito y barreras para la gestión de conocimiento en organizaciones desarrolladoras de software en Colombia\n", "abstract": " La Gestión del Conocimiento (GC) es una disciplina clave para las Organizaciones Desarrolladoras de Software (ODS), dado que el conocimiento en sus diversas formas es el activo y el producto principal de estas organizaciones. Este artículo identifica los factores de éxito en la implementación de la GC y las barreras que dificultan su aplicación en ODS. Para alcanzar el objetivo se realizó una encuesta entre los representantes de 129 ODS en Colombia. Entre las conclusiones se destacan la identificación de los factores humanos como los más relevantes para el éxito en la GC, y el alto costo y baja disponibilidad de recursos financieros y humanos, y el desconocimiento y la inexperiencia en GC como los principales obstáculos para la aplicación de la GC. Este estudio podría ser utilizado como una referencia para la identificación y el establecimiento de las condiciones que podrían influir en presentes o futuras implementaciones de GC.", "num_citations": "3\n", "authors": ["1392"]}
{"title": "Estudio Sobre Conocimiento y Uso de Servicios Digitales. Caso Estudiantes de Ingeniería en una Universidad en Bucaramanga - Santander\n", "abstract": " Este artículo presenta un estudio sobre conocimiento y uso de servicios digitales, así como la motivación para acceder a estos, a un grupo de estudiantes de ingeniería de la Universidad Industrial de Santander. El objetivo de la investigación es construir una imagen de su relación con las Tecnología de la Información y la Comunicación. Para lograr los objetivos se propuso utilizar una metodología compuesta por tres etapas: i) determinar el contexto, ii) recolección de datos, y iii) generación de reportes y análisis de resultados. Los principales resultados obtenidos fueron: la caracterización de la población en estudio, el identificar sus condiciones de acceso a infraestructura de TIC. Además se identificó que el 99% de la población accede a los servicios digitales por las facilidades que ofrecen, en cuanto que la desconfianza, el desinterés y el desconocimiento de la oferta son los motivos que más limita el acceso. En cuanto al uso de servicios, el 100% de la población utiliza servicios de comunicación, entretenimiento y educación. Los servicios menos utilizados son los relacionados con el trabajo por Internet. Finalmente, los resultados se constituyen en una herramienta que permiten complementar los procesos de formación que brinda la universidad.", "num_citations": "3\n", "authors": ["1392"]}
{"title": "Estudio sobre el uso de computador y el reconocimiento de la existencia de internet en una población vulnerable del caribe Colombiano\n", "abstract": " Este artículo presenta los resultados de una investigación sobre Tecnología de Información y Comunicación–TIC, específicamente centrado en el uso del computador y el reconocimiento de la existencia de la Internet por parte de población vulnerable. El Proyecto la Escuela Busca al Niño (EBN–Santa Marta) fue seleccionado como el contexto de investigación. Este proyecto es operado por la Universidad del Magdalena y cuenta con el apoyo del Ministerio de Educación, UNICEF, ECOPETROL y la Alcaldía de Santa Marta. Este proyecto tiene como objetivo vincular a los niños, niñas y adolescentes de las comunas 5 y 8 de Santa Marta, en condiciones de vulnerabilidad al sistema educativo, así como brindar atención a sus familias. En desarrollo del estudio se realizó una caracterización a 2481 personas de los núcleos familiares beneficiaros del proyecto. Los resultados obtenidos muestran que los niveles de acceso de este tipo de población a los computadores y el reconocimiento de la existencia de Internet son muy bajos, evidenciando que el 94% de la población en estudio no tiene acceso a un computador y desconoce de la existencia de la Internet.", "num_citations": "3\n", "authors": ["1392"]}
{"title": "Modelamiento conceptual e implementación de una plataforma teamware para el soporte de las actividades del consultorio jurídico UIS\n", "abstract": " Este articulo presenta la experiencia del Grupo de investigación en sistemas y tecnologia de información STL enel desarrollo de una platafonna de TeamWare para apoyar las actividades del Consultorio Jurídico de la UIS, realizada en el marco de la investigación de maestria titulada\" Propuesta de un Modelo Conceptual de Sistemade Información para el Consultorio Juridico de la VIS\". El documento inicia presentando el contexto que motivoel planteamiento del proyecto y la estructuración de las deficiencias detectadas en la organización en estudio. Acontinuación, se presenta el marco metodológico de la Metodologia de Sistemas Blandos MSB, la cual sirvió deguia para la realización del modelado conceptual. De igual manera, se presenta el modelo propuesto para el controly seguimiento de las actividades en el CJ VIS. Posteriormente, se presenta la implementación de la plataformarealizada mediante el seguimiento de la metodologia de desarrollo software de prototipado evolutivo. Finalmente sepresenta las conclusiones y recomendaciones para trabajos posteriores.", "num_citations": "3\n", "authors": ["1392"]}
{"title": "Proceso para la identificación de requisitos de software de aplicaciones móviles que apoyen la gestión de servicios ofrecidos al ciudadano\n", "abstract": " Este artículo presenta un proceso software para la identificación de oportunidades de desarrollo de aplicaciones móviles y sus requisitos funcionales que promuevan la gestión de los trámites y servicios ofrecidos al ciudadano en las organizaciones gubernamentales. Este proceso se diseñó a partir de una revisión sistemática de la literatura científica sobre técnicas de identificación de requisitos software empleando la metodología Kitchenham y de la caracterización del proceso ejecutado para identificar y desarrollar dos aplicaciones móviles en una organización gubernamental.", "num_citations": "2\n", "authors": ["1392"]}
{"title": "Análisis bibliométrico: Salud y calidad de vida\n", "abstract": " El presente análisis bibliométrico que desarrolla el libro está dirigido a los actores de la ciencia, la tecnología y la innovación, y tiene como propósito brindar información de la actividad científica para apoyar el diseño, seguimiento y evaluación de estrategias, programas, instrumentos y acciones específicas en la formulación y ejecución de proyectos relacionados con salud y calidad de vida", "num_citations": "2\n", "authors": ["1392"]}
{"title": "Analysis of variables and indicators to measure development phases of e-government\n", "abstract": " The development of online government (e-government) is one of the strategies used from different governments to improve their services and closer to citizens. To guide the implementation process, the governments use different e-government development model. In Colombia the government uses a five-stage model. In that sense, the purpose of this article is to present the analysis of variables and indicators published in the scientific literature in the period of 2004-2014 to measure the phases of development of e-government. To identify the documents to analyze a systematic literature review was conducted. Subsequently the variables and indicators were classified and analyzed by phase. The results show that most indicators are aimed at evaluation of phase transformation online. These can become a starting point for building measurement systems of e-government.", "num_citations": "2\n", "authors": ["1392"]}
{"title": "Análisis de brecha digital en seis grupos poblacionales vulnerables de la región caribe colombiana\n", "abstract": " Este artículo presenta un estudio sobre brecha digital; específicamente se enfoca en el uso de computadores personales–CP y el conocimiento de la existencia de la Internet por parte de población vulnerable de siete departamentos de la región Caribe colombiana. Para obtener los resultados se propuso una metodología compuesta por las siguientes tres etapas: i) diseño de los instrumentos de recolección de datos, ii) recolección de datos y iii) análisis de resultados. Los principales resultados obtenidos apuntan a que el uso del computador y el conocimiento de la existencia de la Internet es muy bajo. Se destaca que el 94% de la población bajo estudio no tiene acceso a usar computador y no conoce la existencia de la Internet. Este trabajo permitió la caracterización de 2972 personas y el análisis con respecto a la edad, sexo, religión y nivel educativo. Los resultados obtenidos pueden servir como base para realizar acciones futuras orientadas a alcanzar la inclusión digital de las personas en condición de vulnerabilidad en Colombia.", "num_citations": "2\n", "authors": ["1392"]}
{"title": "Modeling techniques for extraction transformation and load processes: a critical review\n", "abstract": " The use of Business Intelligence systems has been increased over the last fifteen years. Small and medium enterprises have seen the importance of this type of systems in supporting decision-making process. However, there is no consensus about standards that supports activities associated to the development process of this type of systems, namely, ETL design, Datawarehouse design, OLAP cubes design, and others. Hence, this paper focuses on presenting a literature review about the proposed techniques for modeling the ETL process, in order to identify trends, to provide to the practitioners an overview of the field enabling them to make decisions to choose an alternative, and finally, to show to the researchers in the field of business intelligence in particular, and software engineering researchers in general, the need to work on the construction of standards to help reduce the blur found in the design activities.", "num_citations": "2\n", "authors": ["1392"]}
{"title": "Exploratory study of knowledge and access to telework with Communal leaders of Santa Marta, Colombia\n", "abstract": " GONZALEZ-ZABALA, Mayda Patricia; VERA SALAZAR, Pablo Hernán and GALVIS LISTA, Ernesto A.. Exploratory study of knowledge and access to telework with Communal leaders of Santa Marta, Colombia. Encuentros [online]. 2016, vol. 14, n. 1, pp. 73-87. ISSN 1692-5858. http://dx. doi. org/10.15665/re. v14i1. 670.", "num_citations": "1\n", "authors": ["1392"]}
{"title": "Identifying Future Research Directions in Knowledge Management from a Latin American and the Caribbean Perspective: An Exploratory Study\n", "abstract": " Knowledge Management (KM) is a young discipline with various research streams. In this sense, members of the Global Knowledge Research Network, which consists of researchers from 19 countries and is coordinated by the Socio Technical Centre of the Leeds University Business School, have identified the need of clarifying future research needs in KM and related fields. In this context, the purpose of this paper is to describe the results of a first effort of identifying future research directions in KM from a Latin American and the Caribbean (LAC) perspective. This study used a dataset of semi-structured interviews of KM experts in academy and industry. This study could be a reference to LAC KM researchers when deciding their research agendas in order to be aligned with present and future trends. In addition, LAC KM practitioners could use this study as a guide to planning which KM strategy should be …", "num_citations": "1\n", "authors": ["1392"]}
{"title": "Toward an Agile and Soft Method to Develop Business Intelligence Solutions\n", "abstract": " this paper presents the first version of an agile and soft method to develop business intelligence solutions. It is based upon three agile methods for software development, namely, SCRUM, XP and KANBAN, and also is based on the Soft System Methodology. The model is a partial result of an ongoing research project in small and low maturity teams with no experience in the business intelligence development process.", "num_citations": "1\n", "authors": ["1392"]}
{"title": "Map of justice offer in Colombia: a practical case of web information systems for citizen\n", "abstract": " The purpose of this paper is to present a practical case of application of web information systems for citizens. In particular, it presents the results of building a web platform to support management and divulgation of information about the offer of justice services in Colombia, denominated “Map of Justice Offer” and composed of three software products: (1) Thesaurus of Justice Offer, (2) Directory of Institutions, and (3) a platform of indicators and reports about justice offer. The main contribution of this work is to show a way in that information technology could bring support to very important public sectors like justice in Colombia, which is aligned to the National Plan of Information and Communication Technologies - \"Colombia Plan TIC\".", "num_citations": "1\n", "authors": ["1392"]}
{"title": "Aprendizaje organizacional y sistemas de información en la práctica: una experiencia en el consultorio jurídico de la universidad industrial de santander  cj-uis .\n", "abstract": " Este artículo presenta el resultado de un trabajo de investigación en donde se exploran alternativas conceptuales y metodológicas que contribuyan a definir procesos de desarrollo de sistemas de información, como habilitadores de organizaciones que aprenden. En particular, se presenta una experiencia de intervención organizacional en el Consultorio Jurídico de la UIS, en donde se aplicó el enfoque metodológico propuesto, el cual incluye el estudio de la situación actual de la organización, el modelado de Sistemas de Actividad Humana integrando ideas de aprendizaje organizacional, la especificación de características para la tecnología de información requerida, y el desarrollo de un prototipo software.", "num_citations": "1\n", "authors": ["1392"]}