{"title": "Automated breast cancer diagnosis based on machine learning algorithms\n", "abstract": " There have been several empirical studies addressing breast cancer using machine learning and soft computing techniques. Many claim that their algorithms are faster, easier, or more accurate than others are. This study is based on genetic programming and machine learning algorithms that aim to construct a system to accurately differentiate between benign and malignant breast tumors. The aim of this study was to optimize the learning algorithm. In this context, we applied the genetic programming technique to select the best features and perfect parameter values of the machine learning classifiers. The performance of the proposed method was based on sensitivity, specificity, precision, accuracy, and the roc curves. The present study proves that genetic programming can automatically find the best model by combining feature preprocessing methods and classifier algorithms.", "num_citations": "52\n", "authors": ["1661"]}
{"title": "Hybridizing harmony search algorithm with different mutation operators for continuous problems\n", "abstract": " Harmony Search (HS) is a recent EA inspired by musical improvisation process to seek a pleasing harmony. Mutation is a vital component used in Evolutionary Algorithms (EA) where a value in the population is randomly selected to be altered to improve the evolution process. The original HS algorithm applies an operation similar to mutation during the random consideration operator. During random selection operator a value within the range of the decision variable is selected randomly to explore different areas in the search space. This paper aims at experimentally evaluating the performance of HS algorithm after replacing the random consideration operator in the original HS with five different mutation methods. The different variations of HS are experimented on standard benchmark functions in terms of final obtained solution and convergence speed. The results show that using polynomial mutation improves the …", "num_citations": "40\n", "authors": ["1661"]}
{"title": "The design of RIA accessibility evaluation tool\n", "abstract": " Most of the accessibility evaluation tools available check the accessibility of static traditional web pages (e.g., web pages encoded with only HTML) according to the accessibility guidelines (e.g., WCAG). There is an increased need to check the accessibility of Rich Internet Applications (RIAs) using automatic tools. In this paper, we present a conceptual framework for automatic evaluation of accessibility of rich Internet contents. The framework includes: web robot, RIA events controller, WAI-ARIA accessibility specifications, evaluator, and results handler. An example to demonstrate how the framework can be applied has been presented in detail.", "num_citations": "40\n", "authors": ["1661"]}
{"title": "A semantic data validation service for web applications\n", "abstract": " An Input validation can be a critical issue. Typically, a little attention is paid to it in a web development project, because overenthusiastic validation can tend to cause failures in the software, and can also break the security upon web applications such as an unauthorized access to data. Now, it is estimated the web application vulnerabilities (such as XSS or SQL injection) for more than two thirds of the reported web security vulnerabilities. In this paper, we start with a case study of the bypassing data validation and security vulnerabilities such as SQL injection and then go on to discuss the merits of a number of common data validation techniques. We also review the different solutions to date to provide data validation techniques in ecommerce applications. From this analysis, a new data validation service which is based upon semantic web Technologies, has been designed and implemented to prevent the web security vulnerabilities at the application level and to secure the web system even if the input validation modules are bypassed. Our semantic architecture consists of the following components: RDFa annotation for elements of web pages, interceptor, RDF extractor, RDF parser, and data validator. The experimental results of the pilot study indicate that the proposed data validation service might provide a detection, and prevention of some web application attacks.", "num_citations": "25\n", "authors": ["1661"]}
{"title": "Multi-agent systems-Modeling, control, programming, simulations and applications\n", "abstract": " A multi-agent system (MAS) is a system composed of multiple interacting intelligent agents. Multi-agent systems can be used to solve problems which are difficult or impossible for an individual agent or monolithic system to solve. Agent systems are open and extensible systems that allow for the deployment of autonomous and proactive software components. Multi-agent systems have been brought up and used in several application domains.", "num_citations": "24\n", "authors": ["1661"]}
{"title": "E-learning tools and technologies in education: A perspective\n", "abstract": " Many e-learning tools are currently available for using in education. E-learning tools can provide training and education to large number of students with diverse cultural backgrounds and educational levels. However, e-learning could be failed in education when overestimating what e-learning can accomplish. Some people normally do not understand the weaknesses and limitations of e-learning and some of them may expect too much. In this paper, we review the different e-learning tools such as MOODLE, and Blackboard. We also comment on the most important aims of each tool and analyze the advantages and disadvantages. From this analysis we obtain a global view of the current and future tendencies of e-learning tools and therefore we provide possible important comments for using elearning tools such as MOODLE in the classroom. Upon to our teaching experience, MOODLE is effective in the e-learning development. Authors and practitioners showed a greater preference for MOODLE over Blackboard. However, MOODLE is not fully pure social software because MOODLE does not provide social networks.", "num_citations": "24\n", "authors": ["1661"]}
{"title": "Annotations, collaborative tagging, and searching mathematics in e-learning\n", "abstract": " This paper presents a new framework for adding semantics into e-learning system. The proposed approach relies on two principles. The first principle is the automatic addition of semantic information when creating the mathematical contents. The second principle is the collaborative tagging and annotation of the e-learning contents and the use of an ontology to categorize the e-learning contents. The proposed system encodes the mathematical contents using presentation MathML with RDFa annotations. The system allows students to highlight and annotate specific parts of the e-learning contents. The objective is to add meaning into the e-learning contents, to add relationships between contents, and to create a framework to facilitate searching the contents. This semantic information can be used to answer semantic queries (e.g., SPARQL) to retrieve information request of a user. This work is implemented as an embedded code into Moodle e-learning system.", "num_citations": "18\n", "authors": ["1661"]}
{"title": "An adaptive image contrast enhancement technique for low-contrast images\n", "abstract": " Contrast enhancement is important and plays vital role in many applications. Histogram equalization-based techniques are widely used techniques for contrast enhancement. However, it faces the contrast over-stretching, which in return causes the loss of details and unnatural look to the target image. To address this issue, this work presents a novel scheme for image contrast enhancement. The contribution of the proposed scheme is twofold. First, the image can lose many important information when an image size is decreased. For that, the image is transformed from spatial to wavelet domain so that the multi-resolution can be achieved. Second, Gamma correction is a proven technique that produces natural look and preserves mean brightness of an image with the choice of optimal gamma values. Here, Particle Swarm Optimization (PSO) is utilized to select the optimal gamma values. In this study, an effective …", "num_citations": "17\n", "authors": ["1661"]}
{"title": "Utilizing mobile devices' tactile feedback for presenting braille characters: an optimized approach for fast reading and long battery life\n", "abstract": " This paper develops a method for presenting the standard six-point Braille characters on mobile devices that feature tactile feedback. The proposed method views each Braille character as a two-column code, each column consisting of three points. The eight various combination of raised and lowered points of the three-point column are encoded with a single pattern of vibration, with the two columns of a Braille character are separated by a period of silence. The encoding scheme for the different point-combinations in a column is inspired by Morse code (a series of dots and dashes). Dots are represented by a small-duration vibration whereas dashes are represented by a longer-duration vibration. The encoding scheme is optimized to reduce the average reading time per character and to reduce the average power consumption per character. These optimizations target increasing the speed of reading and the …", "num_citations": "16\n", "authors": ["1661"]}
{"title": "A multi agent-based system for securing university campus: Design and architecture\n", "abstract": " A multi-agent system (MAS) is a system composed of multiple interacting intelligent agents. Multi-agent systems can be used to solve problems which are difficult or impossible for an individual agent or monolithic system to solve. In this paper, we propose a security system based on multi agents and wireless sensors to secure the buildings and faculties of a University campus.", "num_citations": "16\n", "authors": ["1661"]}
{"title": "Reading Braille on mobile phones: A fast method with low battery power consumption\n", "abstract": " This paper develops a method for presenting the standard six-point Braille characters on mobile devices that feature a tactile feedback. The proposed method views each Braille character as a two-column code, each column consisting of three points. The eight different combinations of raised and lowered points of the three-point column are encoded with a single pattern of vibration, with the two columns of a Braille character are separated by a period of silence. The encoding scheme for the different point-combinations in a column is inspired by Morse code (a series of dots and dashes). The encoding scheme is optimized to reduce the average reading time per character and to reduce the average vibration time per character. These optimizations target increasing the speed of reading and increase the mobile device's battery life.", "num_citations": "15\n", "authors": ["1661"]}
{"title": "Effective generation of test cases using genetic algorithms and optimization theory\n", "abstract": " In software projects, one of the main challenges and sources of success or failure is the effective use of available resources. Using effective techniques in regression testing is important to reduce the amount of required resources. This is accomplished through reducing the number of executed test cases without affecting coverage. In this research, genetic algorithms and optimization theory concepts are applied on test case generation and reduction optimization. The methods start by generating an initial pool of test cases through selecting valid paths in the GUI graph that is generated from the tested software dynamically using an in-house developed tool. The selected test cases are then improved through measuring and evaluating fitness functions. The two fitness functions used in this research were the test set generation speed and the test set coverage. Optimization theory is also used to find the best set, measured according to a particular fitness function that can best represent the whole testing database while preserving all other constraints.", "num_citations": "14\n", "authors": ["1661"]}
{"title": "Multi-Agent Systems: Modeling, Interactions, Simulations and Case Studies\n", "abstract": " A multi-agent system (MAS) is a system composed of multiple interacting intelligent agents. Multi-agent systems can be used to solve problems which are difficult or impossible for an individual agent or monolithic system to solve. Agent systems are open and extensible systems that allow for the deployment of autonomous and proactive software components. Multi-agent systems have been brought up and used in several application domains.", "num_citations": "13\n", "authors": ["1661"]}
{"title": "Bees_ Ants Based Routing Algorithm\n", "abstract": " In this paper we propose a novel routing algorithm called Bees_Ants algorithm. This algorithm is a combination of ant colony based routing algorithm (ARA) and BeeHive based routing algorithm. The proposed routing algorithm depends on splitting the network into two parts; one is a fixed network and the other is a mobile ad hoc network (MANET), then applying the ant colony based routing algorithm on the mobile part and the BeeHive based routing algorithm on the fixed one. After comparing the proposed algorithm with the ARA algorithm, it shows promising results in terms of propagation delay, queue delay, and number of hops.", "num_citations": "13\n", "authors": ["1661"]}
{"title": "Tabu search and machine-learning classification of benign and malignant proliferative breast lesions\n", "abstract": " Breast cancer is the most diagnosed cancer among women around the world. The development of computer-aided diagnosis tools is essential to help pathologists to accurately interpret and discriminate between malignant and benign tumors. This paper proposes the development of an automated proliferative breast lesion diagnosis based on machine-learning algorithms. We used Tabu search to select the most significant features. The evaluation of the feature is based on the dependency degree of each attribute in the rough set. The categorization of reduced features was built using five machine-learning algorithms. The proposed models were applied to the BIDMC-MGH and Wisconsin Diagnostic Breast Cancer datasets. The performance measures of the used models were evaluated owing to five criteria. The top performing models were AdaBoost and logistic regression. Comparisons with others works prove the efficiency of the proposed method for superior diagnosis of breast cancer against the reviewed classification techniques.", "num_citations": "10\n", "authors": ["1661"]}
{"title": "The Use of Location Based Services for Very Fast and Precise Accidents' Reporting and Locating\n", "abstract": " Most people are stressed out and overstrained after accidents even if no one is hurt. Consequently, they may face some difficulty in reporting the accident to the police and civil defense, or they may provide them with inaccurate information about the location of the accident. Moreover, even if they were able to provide the necessary information it may take them some time to deliver it to a human counterpart and hence it will take the police and civil defense more time to reach the accident location in the appropriate time to rescue people. This paper proposes the use of location based services to develop a system that can be used easily to report and locate an accident more quickly and precisely.", "num_citations": "10\n", "authors": ["1661"]}