{"title": "The Internet of Things meets business process management: a manifesto\n", "abstract": " The Internet of Things (IoT) refers to a network of connected devices that collects and exchanges data through the Internet. These things can be artificial or natural and interact as autonomous agents that form a complex system. In turn, business process management (BPM) was established to analyze, discover, design, implement, execute, monitor, and evolve collaborative business processes within and across organizations. While the IoT and BPM have been regarded as separate topics in research and in practice, we strongly believe that, on the one hand, the management of IoT applications will greatly benefit from BPM concepts, methods, and technologies. On the other hand, the IoT poses challenges that will require enhancements and extensions of the current state of the art in the BPM field. In this article, we question the extent to which these two paradigms can be combined, and we discuss emerging …", "num_citations": "86\n", "authors": ["601"]}
{"title": "Citizen participation in smart cities: Evaluation framework proposal\n", "abstract": " During the last years, smart cities have attracted considerable attention because they are considered a response to the complex challenges that modern cities face. Smart cities provide new solutions in the domains of mobility, environment, economy, governance, quality of life, and education thanks to the innovative use of Information and Communication Technologies (ICT). However, smart cities often do not optimally reach their objectives if the citizens, the end-users, are not involved in their design. This article investigates how the citizens can transform a city into a smart city by being involved in the democratic process, by cocreating the smart city projects, and by proactively using the city's ICT infrastructure. This article contributes to the smart city domain in several ways. Firstly, a literature review from different research fields is performed in order to identify the different means to enable citizen participation in a …", "num_citations": "67\n", "authors": ["601"]}
{"title": "Hearing the voice of citizens in smart city design: the citivoice framework\n", "abstract": " In the last few years, smart cities have attracted considerable attention because they are considered a response to the complex challenges that modern cities face. However, smart cities often do not optimally reach their objectives if the citizens, the end-users, are not involved in their design. The aim of this paper is to provide a framework to structure and evaluate citizen participation in smart cities. By means of a literature review from different research areas, the relevant enablers of citizen participation are summarized and bundled in the proposed CitiVoice framework. Then, following the design science methodology, the content and the utility of CitiVoice are validated through the application to different smart cities and through in-depth interviews with key Belgian smart city stakeholders. CitiVoice is used as an evaluation tool for several Belgian smart cities allowing drawbacks and flaws in citizens’ participation to be …", "num_citations": "48\n", "authors": ["601"]}
{"title": "Ontology-based data integration in multi-disciplinary engineering environments: A review\n", "abstract": " Today’s industrial production plants are complex mechatronic systems. In the course of the production plant lifecycle, engineers from a variety of disciplines (eg, mechanics, electronics, automation) need to collaborate in multi-disciplinary settings that are characterized by heterogeneity in terminology, methods, and tools. This collaboration yields a variety of engineering artifacts that need to be linked and integrated, which on the technical level is reflected in the need to integrate heterogeneous data. Semantic Web technologies, in particular ontology-based data integration (OBDI), are promising to tackle this challenge that has attracted strong interest from the engineering research community. This interest has resulted in a growing body of literature that is dispersed across the Semantic Web and Automation System Engineering research communities and has not been systematically reviewed so far. We address this gap with a survey reflecting on OBDI applications in the context of Multi-Disciplinary Engineering Environment (MDEE). To this end, we analyze and compare 23 OBDI applications from both the Semantic Web and the Automation System Engineering research communities. Based on this analysis, we (i) categorize OBDI variants used in MDEE,(ii) identify key problem context characteristics,(iii) compare strengths and limitations of OBDI variants as a function of problem context, and (iv) provide recommendation guidelines for the selection of OBDI variants and technologies for OBDI in MDEE.", "num_citations": "39\n", "authors": ["601"]}
{"title": "Context-adaptive Petri nets: Supporting adaptation for the execution context\n", "abstract": " Petri nets (PNs) are a mathematical and graphical modeling language with powerful analysis techniques. They have been successfully used in several areas, such as business process management, human computer interaction, and pervasive computing. Within these areas, context adaptivity has recently emerged as a new challenge to explicitly address fitness between system behavior and its execution context. However, the existing PN formalisms do not provide reliable modeling, simulation, and verification techniques that can accurately consider the system’s execution context and adapt to it in order to reflect the system execution reality. This paper addresses this problem by presenting context-adaptive Petri nets (CAPNs), a formalism that allows the modeling of context-adaptive behavior by integrating the powerful modeling and analysis techniques of PNs with very expressive context data management …", "num_citations": "31\n", "authors": ["601"]}
{"title": "Ambient media today and tomorrow\n", "abstract": " Ambient media are novel, and this new media form alters our daily-living experience in many ways. Ambient media refer to media environments that are embedded throughout the natural space where people are following their daily activities. These digital media environments become part of the living space and altering our daily-living experience in many ways. The goal of this article is to elaborate the status of ambient media today and to forecast how ambient media will develop in the next decade. It clearly identifies megatrends and develops scenarios (e. g., ambient-assisted living) for the future. These scenarios shall shed light on the potentials and give a glimpse on the potential future development of embedding digital objects into the daily living space. This paper is based on a future wheel approach and on an analysis of the results of an expert workshop. The article concludes with a discussion of the …", "num_citations": "29\n", "authors": ["601"]}
{"title": "Automating Immediate and Personalized Feedback. Taking Conceptual Modelling Education to a Next Level\n", "abstract": " Providing individual and immediate feedback to students is a critical factor for improving knowledge and skills acquisition in higher education. However, a growing number of students with very different heterogeneous profiles and unequal problem solving skills, as well as the lack of teaching resources, make it very challenging and sometimes even impossible to give immediate feedback at individual level. This paper presents a synthesis and progress of a long-term project that addresses this challenge in the context of conceptual modelling by developing SAiLE@CoMo, a smart and adaptive learning environment. By crafting innovative process analytics techniques and expert knowledge on feedback automation, SAiLE@CoMo can automatically provide personalized and immediate feedback to leaners.", "num_citations": "26\n", "authors": ["601"]}
{"title": "Automating cross-disciplinary defect detection in multi-disciplinary engineering environments\n", "abstract": " Multi-disciplinary engineering (ME) projects are conducted in complex heterogeneous environments, where participants, originating from different disciplines, e.g., mechanical, electrical, and software engineering, collaborate to satisfy project and product quality as well as time constraints. Detecting defects across discipline boundaries early and efficiently in the engineering process is a challenging task due to heterogeneous data sources. In this paper we explore how Semantic Web technologies can address this challenge and present the Ontology-based Cross-Disciplinary Defect Detection (OCDD) approach that supports automated cross-disciplinary defect detection in ME environments, while allowing engineers to keep their well-known tools, data models, and their customary engineering workflows. We evaluate the approach in a case study at an industry partner, a large-scale industrial automation …", "num_citations": "24\n", "authors": ["601"]}
{"title": "Discovering hidden dependencies in constraint-based declarative process models for improving understandability\n", "abstract": " Flexible systems and services require a solid approach for modeling and enacting dynamic behavior. Declarative process models gained plenty of traction lately as they have proven to provide a good fit for the problem at hand, i.e. visualizing and executing flexible business processes. These models are based on constraints that impose behavioral restrictions on process behavior. Essentially, a declarative model is a set of constraints defined over the set of activities in a process. While allowing for very flexible process specifications, a major downside is that the combination of constraints can lead to behavioral restrictions not explicitly visible when reading a model. These restrictions, so-called hidden dependencies, make the models much more difficult to understand. This paper presents a technique for discovering hidden dependencies and making them explicit by means of dependency structures. Experiments …", "num_citations": "20\n", "authors": ["601"]}
{"title": "Improving understandability of declarative process models by revealing hidden dependencies\n", "abstract": " Declarative process models have become a mature alternative to procedural ones. Instead of focusing on what has to happen, they rather follow an outside-in approach based on a rule base containing different types of constraints. The models are well-capable of representing flexible behavior, as everything that is not forbidden by the constraints in the model is possible during execution. These models, however, are more difficult to comprehend and require a higher mental effort of both the modeler and the reader. Since constraints can be added freely to the model, it is often overseen what impact the combination of them has. This is often referred to as hidden dependencies. This paper proposes a methodology to make these dependencies explicit for the declarative process modeling language Declare by considering a Declare model as a graph and relying on the constraints’ characteristics. Moreover …", "num_citations": "20\n", "authors": ["601"]}
{"title": "Integrating heterogeneous engineering knowledge and tools for efficient industrial simulation model support\n", "abstract": " Design of simulation models and their integration into industrial automation systems require knowledge from several heterogeneous data sources and tools. Due to the heterogeneity of engineering data, the integration of the tools and data are time-consuming and error-prone tasks nowadays. The key goal of this article is to provide an effective and efficient integration of heterogeneous data sources and tools as a knowledge basis to support dynamic simulation for industrial plants. The integrated knowledge is utilized both (i) in the design phase of simulation models for defining structure and interfaces of the models and (ii) in the runtime phase of industrial systems for model-driven configuration of the integrated environment. Reaching such goals with a manual approach or point-to-point integration is not beneficial as it may be possible for a few tools and data sources, but quickly gets very complex. A growing …", "num_citations": "20\n", "authors": ["601"]}
{"title": "Engineering process improvement in heterogeneous multi-disciplinary environments with defect causal analysis\n", "abstract": " Multi-disciplinary engineering environments, e.g., in automation systems engineering, typically involve different stakeholder groups and engineering disciplines using a variety of specific tools and data models. Defects in individual disciplines can have a major impact on product and process quality in terms of additional cost and effort for defect repair and can lead to project delays. Early defects detection and avoidance in future projects are key challenges for project and quality managers to improve the product and process quality. In this paper we present an adaptation of the defect causal analysis (DCA) approach, which has been found effective and efficient to improve product quality in software engineering contexts. Applying DCA in multi-disciplinary engineering environments enables a systematic analysis of defects and candidate root causes, and can help providing countermeasures for product and …", "num_citations": "16\n", "authors": ["601"]}
{"title": "Modeling iot-aware business processes-a state of the art report\n", "abstract": " This research report presents an analysis of the state of the art of modeling Internet of Things (IoT)-aware business processes. IOT links the physical world to the digital world. Traditionally, we would find information about events and processes in the physical world in the digital world entered by humans and humans using this information to control the physical world. In the IoT paradigm, the physical world is equipped with sensors and actuators to create a direct link with the digital world. Business processes are used to coordinate a complex environment including multiple actors for a common goal, typically in the context of administrative work. In the past few years, we have seen research efforts on the possibilities to model IoT- aware business processes, extending process coordination to real world entities directly. This set of research efforts is relatively small when compared to the overall research effort into the IoT and much of the work is still in the early research stage. To create a basis for a bridge between IoT and BPM, the goal of this report is to collect and analyze the state of the art of existing frameworks for modeling IoT-aware business processes.", "num_citations": "15\n", "authors": ["601"]}
{"title": "Contextual requirements prioritization and its application to smart homes\n", "abstract": " When many requirements co-exist for a given system, prioritization is essential to determine which ones have higher priority. While the basic prioritization algorithms result in a total or partial order of the requirements, it is often the case that the priority of the requirements depends on the context at hand. This is especially true in ambient intelligence systems such as smart homes, which operate in an inherently dynamic environment that may affect the priority of the requirements at runtime. For example, depending on the health status of a smart home inhabitant, safety may become more important than comfort or cost-saving. In this paper, we make three contributions: (i) we introduce a novel method for the contextual prioritization of requirements, (ii) we propose an online platform for prioritizing the requirements for a smart home based on our method, and (iii) we report on results from an initial evaluation of the …", "num_citations": "14\n", "authors": ["601"]}
{"title": "Evaluation of Semantic Data Storages for Integrating Heterogenous Disciplines in Automation Systems Engineering\n", "abstract": " Automation systems development projects typically require the integration of heterogeneous local tool data models that come from various disciplines and sources. Semantic data integration provides solutions for bridging semantic gaps between common project-level concepts and the local tool concepts used by each discipline. The following use cases represent the foundation for efficient data integration: (a) data insertion in the local tool models, (b) transformation of data between the local models and a common model, and (c) querying across concepts from different local models by using the common model. The selection of a proper semantic data storage for storing the data has a strong impact on efficiently executing these use cases. Three different important types of semantic storages have been identified: ontology file storages, triple storages, and relational databases storages. In this paper, we evaluate them …", "num_citations": "14\n", "authors": ["601"]}
{"title": "Citizen participation in the design of smart cities: methods and management framework\n", "abstract": " In the last few years, smart cities have attracted considerable attention because they are considered a response to the complex challenges that modern cities face. Smart cities can provide innovative solutions in various domains such as environment, economy, mobility, and safety with technology as enabler. However, this is only possible if the citizens, the end users, are involved in the design of the smart city. The aim of this chapter is to provide a repository of methods and useful guidelines to manage citizen participation in the design of smart cities.By means of a literature review from different research areas and an analysis of concrete and well-established smart cities, the relevant methods of citizen participation are identified and described. These methods are bundled into three categories: citizens as democratic participants, citizens as cocreators, and citizens as information and communication technology users …", "num_citations": "13\n", "authors": ["601"]}
{"title": "Building Empirical Software Engineering Bodies of Knowledge with Systematic Knowledge Engineering\n", "abstract": " ABSTRACT [Context] Empirical software engineering (EMSE) researchers conduct systematic literature reviews (SLRs) to build bodies of knowledge (BoKs). Unfortunately, valuable knowledge collected in the SLR process is publicly available in research syntheses reports only to a limited extent, which considerably slows down building BoKs incrementally.[Objective] In this paper, we introduce the Systematic Knowledge Engineering (SKE) approach to support building up EMSE BoKs from empirical studies efficiently.[Method] SKE extends the SLR process and provides a Knowledge Base (KB) to reuse intermediate data extraction results in future research analyses. We evaluated the SKE approach by building a software inspection EMSE BoK KB from knowledge acquired by controlled experiments. We elicited relevant queries from EMSE researchers and systematically integrated information from 30 representative research papers into the KB.[Results] The resulting KB was effective and efficient in answering the relevant queries, enabling knowledge reuse for analyses beyond the results from the SLR process.[Conclusion] The SKE approach showed promising results in the software inspection context and should be also evaluated in other contexts for building EMSE BoKs faster.", "num_citations": "13\n", "authors": ["601"]}
{"title": "An evaluation framework for design-time context-adaptation of process modelling languages\n", "abstract": " To enhance the performance and efficiency of business processes, it is essential to take the dynamics of their execution context into account during process modelling. This paper first proposes an evaluation framework that identifies the main requirements for supporting the modelling of context-adaptive processes. Using this framework, we analyse four popular business process modelling languages: Coloured Petri Nets (CPN), Business Process Modelling and Notation 2.0 (BPMN), Yet Another Workflow Language (YAWL), and Unified Modelling Language Activity Diagrams (UML AD). The analysis is carried out by evaluating how the respective language notations fulfil the identified requirements in several real-life scenarios. Lastly, a comparative analysis of the languages focussed on their support for modelling context-adaptive business processes is provided.", "num_citations": "12\n", "authors": ["601"]}
{"title": "An analysis framework for ontology querying tools\n", "abstract": " While knowledge querying is a key capability of ontologies, the query language recommended by W3C, SPARQL, is not easy to use for some user types, eg, casual users and domain experts. To improve this drawback, user-friendly Ontology Query Tools (OQTs) have been introduced. However, there is, to our knowledge, no comprehensive framework for researchers and practitioners to compare the capabilities of the wide range of available OQTs. In this paper we introduce, based on a systematic literature review, a framework that allows researchers and practitioners to classify and compare OQTs regarding their capabilities and their support for relevant user types and scenarios. We evaluate the framework based on a real-world use case. Major result of the evaluation was that the framework was found useful and usable by users from the target audience to identify the most suitable OQTs for their context.", "num_citations": "11\n", "authors": ["601"]}
{"title": "Evaluation of technologies for mapping representation in ontologies\n", "abstract": " Ontology mapping is needed to explicitly represent the relations between several ontologies, which is an essential task for applications such as semantic integration and data transformation. Currently, there is no standard for representing mappings. Instead, there are a number of technologies that support the representation of mappings between the ontologies. In this paper we introduce a set of mapping categories that were identified based on requirements for the data integration projects of an industry partner. An evaluation of available technologies for mapping representation regarding the support for introduced mapping categories has been performed. The results of the evaluation show that the SPARQL Inference Notation would fit the best in the described use case scenario.", "num_citations": "10\n", "authors": ["601"]}
{"title": "Evaluating user interface generation approaches: model-based versus model-driven development\n", "abstract": " Advances in software design possibilities have led to a growing interest in the study of user interfaces (UIs). Many Model-Based User Interface Development Environments (MB-UIDEs) have been proposed to deal with the generation of the UIs (semi-) automatically by using models with different levels of abstraction. Often, this generation is limited to the UI part of an application. However, achieving true model-driven development (MDD) requires the co-development of application and UI and, hence, needs to go a step further. This paper analyzes a large set of existing MB-UIDEs, evaluates, from a critical perspective, to what extent they can be considered full MDD environments, and adequately addresses the co-design of UI and application. Following the guidelines proposed by Kitchenham and Charters (Engineering 2, 2007), we performed a systematic literature review. A total of 96 papers were examined …", "num_citations": "9\n", "authors": ["601"]}
{"title": "A review of automated feedback systems for learners: Classification framework, challenges and opportunities\n", "abstract": " Teacher feedback provided to learners in real-time is a crucial factor for their knowledge and skills acquisition. However, providing real-time feedback at an individual level is often infeasible, considering limited teaching resources. Fortunately, recent technological advancements have allowed for developing of various computer tutoring systems, which can support learners at any place and time by generating personalized feedback automatically. Such systems have emerged in various domains, tackle different educational tasks, and often are designed in very distinctive ways. Consequently, the knowledge in the field of automated feedback systems is rather scattered across different domains and applications, as we illustrate in this study. This paper aims to outline the state-of-the-art of recently developed systems for delivering automated feedback, and thus serves as a source of systematic information for educators …", "num_citations": "8\n", "authors": ["601"]}
{"title": "Gamification of declarative process models for learning and model verification\n", "abstract": " Recently, a surge in the use of declarative process models has been witnessed. These constraint-driven models excel at representing and enacting flexible and adaptable decision processes in application areas such as scheduling and workflow management. This work examines the intricacies of the most widespread declarative process language, Declare, which are commonly referred to as hidden dependencies. These dependencies typically increase the steepness of the learning curve of Declare models and making them explicit can lower the threshold for modelers to use Declare in a sense-making and intuitive way. This work proposes a way to gamify Declare models for novice users by annotating such models with extra constraint and dependency information, and feedback. Hence, it offers the ability of discovering Declare and its intricacies in a game-like fashion which lowers the threshold for …", "num_citations": "8\n", "authors": ["601"]}
{"title": "Ambient bloom: new business, content, design and models to increase the semantic ambient media experience\n", "abstract": " Semantic ambient media are the novel trend in the world of media reaching from the pioneering subareas such as ambient advertising to the new and emerging subareas such as ambient assisted living. They will likely shape the upcoming years in terms of modeling smart environments and also media consumption and interaction. This work analyzes semantic ambient media by considering business models, content and media, interaction design and consumer experience, and methods and techniques that are important to create this new form of media. Discussion is led using the state-of-the-art event of the semantic ambient media, which is the annual international workshop on Semantic Ambient Media Experience (SAME). The study also creates a vision for how ambient media will evolve and how they will look like in the future decade.", "num_citations": "8\n", "authors": ["601"]}
{"title": "Executing IoT Processes in BPMN 2.0: Current Support and Remaining Challenges\n", "abstract": " The Internet of Things (IoT) has seen a vast surge in recent years, both in academia and in industry. Business processes are starting to take advantage of IoT to interact with the increasingly connected and dynamic physical environment. Recent literature has focused on analysing how this interaction between processes and IoT devices can be modelled, i.e. how the process can be described for discussion purposes. However, little attention is given to configuring the execution of these IoT-based processes. IoT-enhanced processes should indeed be able to incorporate IoT devices in the endeavour of process execution. This paper discusses research challenges in IoT process configuration and execution using the executable Business Process Model and Notation 2.0 (BPMN 2.0) standard. As such, we constitute an agenda for future research.", "num_citations": "7\n", "authors": ["601"]}
{"title": "Personalized adaptation in pervasive systems via non-functional requirements\n", "abstract": " Pervasive environments are socio-technical systems that support the daily routines of their users in an invisible and unobtrusive manner. These systems are aware of and adapt to both the operational context and the characteristics and preferences of their users. Designing adaptation mechanisms that guarantee maximal user satisfaction is challenging, due to the inherent differences between users and the changing context where the system operates. In order to tackle this problem, we propose an approach that compares alternative system behaviors in terms of how well they satisfy the preferences of the current user concerning Non-Functional Requirements (NFRs) such as efficiency, comfort, energy saving, etc. Specifically, we propose a model-driven framework in which the models represent the user routines that the pervasive system helps to achieve. These routines include variability points, thereby …", "num_citations": "7\n", "authors": ["601"]}
{"title": "Testing of model-driven development applications.\n", "abstract": " Human resource management practices are key for the success of software development projects. Practices that promote knowledge sharing and organizational learning are positively related to development-effort curves, and thus software companies are looking for different alternatives oriented to promoting these practices. The model-driven development (MDD) paradigm is positioned as one of the best alternatives for reutilization of development knowledge. In particular, this paradigm considers the specification of conceptual models that can be used as input for automatic code generation to different target platforms. However, testing of applications developed through MDD solutions is still performed by the manual definition and execution of test cases by testers, which negatively impacts in the time reduction obtained from automatic code generation and the reutilization of knowledge generated during the MDD …", "num_citations": "7\n", "authors": ["601"]}
{"title": "Conceptual framework for feedback automation in SLEs\n", "abstract": " Although feedback is a very time-consuming task, it is crucial to improve learning and foster students’ development. For this reason, automating feedback has become one of the most pursued challenges within the field of smart learning environments -SLEs-. After performing a literature study about which dimensions of feedback are relevant to properly automate it, we present a novel conceptual framework that structures, explains, and analyses these dimensions. The framework can be key to appropriately contextualize future research about feedback, and can also be a guide for educators and developers in order to design and implement quality feedback in a more methodical way in SLEs.", "num_citations": "7\n", "authors": ["601"]}
{"title": "Towards evaluation and comparison of tools for ontology population from spreadsheet data\n", "abstract": " Semantic Web technologies and ontologies increasingly provide mission-critical capabilities for a variety of applications, not only in the Web, but also in industry projects to facilitate semantic integration and interoperability between heterogeneous systems. Due to this proliferation in the use of ontologies, technologies and tools have been developed to facilitate the ontology engineering process and ontology population, as a part of this process. As spreadsheets are widely used to store and exchange data, academia and industry have developed a range of tools and mapping techniques to support the (semi-) automated translation of spreadsheet data into OWL/RDF. Existing tools vary in many aspects, therefore it can be difficult to select tool that fits best for a specific usage context. In this paper we analyzed several types of end users, which could be interested to apply such tools in their workflow, and their specific …", "num_citations": "7\n", "authors": ["601"]}
{"title": "Unifying Functional User Interface Design Principles\n", "abstract": " Many designers and User Interface (UI) educators discuss principles to be followed when designing the functional aspects of a UI. However, many UI principles have been proposed, scattered in scientific papers and teaching books. Some principles are different, and many are somehow similar or overlapping with others. This makes it very difficult to comprehend where to pay attention to when designing a UI. In this paper, we perform a systematic literature review to first identify the most relevant authors in the domain of functional UI design principles. Focusing on the three most cited works of these authors, we extracted 257 principles. We next analyzed all these principles, unified their variants, and, considering their scientific influence, finally derived a shorter and core selection of 36 principles. This core selection provides educators and UI designers with a clear path to teach, evaluate, learn and improve the UI …", "num_citations": "6\n", "authors": ["601"]}
{"title": "Decision model change patterns for dynamic system evolution\n", "abstract": " In the modern digital era, information systems must operate in increasingly interconnected and dynamic environments, which force them to be changeable yet consistent. Such modern information systems are usually decision- and knowledge-intensive. A recently introduced standard, the decision model and notation (DMN), has been adopted in both industry and academia as a suitable method for modelling decisions and decision rules. Noteworthy is that, despite the dynamic nature of modern knowledge-intensive systems, DMN was only studied and implemented in a static fashion, as decision schema change patterns have not received any attention so far. This paper identifies and analyses the change patterns that can occur in a DMN decision model. A change in the decision model can require the triggering of other changes in order to safeguard consistency. As such, this paper will also investigate for each …", "num_citations": "6\n", "authors": ["601"]}
{"title": "Decision as a service (DAAS): a service-oriented architecture approach for decisions in processes\n", "abstract": " Separating decision modelling from the processes modelling concern recently gained significant support in literature, as incorporating both concerns into a single model impairs the scalability, maintainability, flexibility and understandability of both processes and decisions. Most notably the introduction of the Decision Model and Notation (DMN) standard by the Object Management Group provides a suitable solution for externalising decisions from processes and automating decision enactments for processes. This paper introduces a systematic way of tackling the separation of the decision modelling concern from process modelling by providing a Decision as a Service (DaaS) layered Service-Oriented Architecture (SOA) which approaches decisions as automated and externalised services that processes need to invoke on demand to obtain the decision outcome. The DaaS mechanism is elucidated by a …", "num_citations": "6\n", "authors": ["601"]}
{"title": "Co-location specification for IoT-aware collaborative business processes\n", "abstract": " Technologies from the Internet of Things (IoT) create new possibilities to directly connect physical processes in the ‘real’ world to digital business processes in the administrative world. Objects manipulated in the real world (the ‘things’ of IoT) can directly provide data to digital processes, and these processes can directly influence the behavior of the objects. An increasing body of work exists on specifying and executing the interface between the physical and the digital worlds for individual objects. But many real-life business scenarios require that the handling of multiple physical objects is synchronized by digital processes. An example is the cross-docking of sea containers at ports: here we have containers, ships, cranes and trucks that are all ‘things’ in the IoT sense. Cross-docking processes only work when these ‘things’ are properly co-located in time and space. Therefore, we propose an approach to …", "num_citations": "6\n", "authors": ["601"]}
{"title": "A fully implemented didactic tool for the teaching of interactive software systems\n", "abstract": " User Interface (UI) design and software engineering complement each other to develop useful and usable interactive software systems. However, the body of knowledge for the development of an application and for the design of its UI are not always well integrated. The problem starts in the education of both subjects, which are normally taught independently of each other. Although an integrative teaching approach can significantly contribute to the development of better interactive software systems, there is a lack of concrete and proven approaches for such way of teaching. This paper presents a fully functional didactic tool for filling this gap. This tool provides the learner with feedback about how to develop an application and how to design a proper UI for it. Applying Model Driven Engineering principles, the tool automatically generates a working prototype of the interactive software system from its specification models, allowing the learner to try out the final application and validate the requirements. An experiment with novice developers demonstrates the advantages of this didactic tool.", "num_citations": "6\n", "authors": ["601"]}
{"title": "Evaluating software architectures using ontologies for storing and versioning of engineering data in heterogeneous systems engineering environments\n", "abstract": " Large systems engineering projects involve the cooperation of various stakeholders from different engineering disciplines. Individual stakeholders apply various tools and related data storage approaches that (a) might hinder seamless interoperability and (b) include limited capability to support data versioning. Project-level concepts enable the mapping of engineering data coming from different disciplines. However, it remains open how to store data on project level that enable flexible and efficient data access from different disciplines in different environments and enable backtracking to previous versions in case of defects and/or human errors. While semantic data integration provides fundamental solutions for bridging semantic gaps between common project-level concepts and the local tool concepts used by each discipline, semantic storages have been developed to query and reason over gathered data rather …", "num_citations": "6\n", "authors": ["601"]}
{"title": "Building an empirical software engineering research knowledge base from heterogeneous data sources\n", "abstract": " Recently, the Systematic Knowledge Engineering (SKE) process has been introduced to help researchers build up an empirical software engineering (EMSE) Body of Knowledge (BoK) based on a systematic literature review process. However, the SKE process does not explain how to effectively capture and represent the EMSE knowledge to enable efficient data analysis. In this paper, we introduce the EMSE Research Knowledge Base Building (RKB) process, which guides knowledge engineers in developing and using a knowledge base (KB) for the SKE process based on contributions from heterogeneous data sources. We evaluate the RKB process in the context of three research topics from the EMSE domain: software inspection experiments, theory construct identification, and threats to validity. Major results are that the RKB process is effective in guiding the knowledge engineer to build a KB that allows …", "num_citations": "6\n", "authors": ["601"]}
{"title": "Conceptualizing the domain of automated feedback for learners\n", "abstract": " Achieving high-quality automated feedback that helps and guides students in their learning process is one of the most pursued challenges within the field of technology-enhanced learning (TEL). However, there is no theoretical foundation that conceptualizes what automated feedback consists of in order to understand what must be considered to automatically design and deliver feedback. Based on a critical review of the literature, this paper presents a framework that identifies and defines the most important factors to characterise automated feedback. The framework can 1) help to better frame scientific contributions on automated feedback, which will facilitate their application and validation; and 2) serve researchers and developers as guidance in the design and implementation of quality automated feedback within TEL environments.", "num_citations": "5\n", "authors": ["601"]}
{"title": "UI-GEAR: User Interface Generation prEview capable to Adapt in Real-time.\n", "abstract": " User Interface (UI) preview enables UI developers to preview and see the current User Interface before being generated. Despite the many advantages that UI preview could offer, it is not provided by current UI development environments. This paper presents UI-GEAR, a UI generation preview capable to adapt in real-time. UI-GEAR is developed within the MERODE method, a model-driven engineering approach capable to generate a fully functional system prototype from its specification in models. UI-GEAR extends MERODE with a UI development environment that enables developers to play with generation options and to straightforwardly and in real-time visualize the consequences of their choices on the UI to be generated, thus providing them with immediate guidance and design flexibility. We have carried out an experiment with developers with novel experience on designing UIs that demonstrates the advantages of this approach.", "num_citations": "5\n", "authors": ["601"]}
{"title": "Determining qualified production processes for new product ramp-up using semantic web technologies\n", "abstract": " The manufacturing industry aims at reducing the time-to-volume for new products with new production sites. A ramp-up team needs to find a capable production process for a new production site to produce the product in sufficient quality and volume efficiently and with reasonable investment costs. Capable production processes have to be qualified first regarding the specification criteria of the created product. However, currently the ramp-up team does not have a well-structured process to follow or a measurement system for guidance. In this paper we propose the\" knowledge-based production ramp-up process\"(K-RAMP) for the ramp-up of a new product with specified requirements in a target production system. Based on these knowledge assets, we introduce the\" ramp-up recommender system\" that systematically helps determine reusable processes in the target production system. We use semantic web …", "num_citations": "5\n", "authors": ["601"]}
{"title": "Extending cpn tools with ontologies to support the management of context-adaptive business processes\n", "abstract": " Colored Petri Nets (CPN) are a widely used graphical modeling language to manage business processes. Business processes often appear in dynamic environments; therefore, context adaptation has recently emerged as a new challenge to explicitly address fitness between business process modeling and its execution environment. Although CPN can introduce data by defining internal data records, this is not enough to capture the complexity and dynamics of the execution context data. This paper extends CPN tools to support the management of context-adaptive business processes. To achieve this challenge, CPN tools are integrated with ontology-based context models that properly represent and manage the business process context. This allows context to be appropriately modeled at design time, and queried and updated at runtime. The combination of ontologies with CPN tools presents a way to …", "num_citations": "5\n", "authors": ["601"]}
{"title": "A General Framework for the Development of MDD projects\n", "abstract": " The main characteristic of the Model-Driven Development paradigm is that it allows the automatic (or semiautomatic) generation of software systems from the conceptual models that specify these systems. The successful application of MDD relies in the selection of appropriate diagrams and tools. However, software engineers do not have frameworks that help them to select the MDD tools that better fit to specific projects needs. To face this issue, in this paper we have analysed a set of models and tools that can be used to support MDD projects. From this analysis, a general framework is presented.", "num_citations": "5\n", "authors": ["601"]}
{"title": "A Tool for the Verification of Decision Model and Notation (DMN) Models\n", "abstract": " The Decision Model and Notation (DMN) is a decision modelling standard consisting of two levels: the decision requirement diagram (DRD) level which depicts the dependencies between elements involved in the decision model, and the decision logic level, which specifies the underlying decision logic, usually in the form of decision tables. As the decision tables and DRD are modelled in conjunction, the need to verify the consistency of both levels arises. While there have been some works geared towards the verification of decision tables, the DRD-level has been strongly neglected. In this work, we therefore present a tool for the model verification of DMN models at both the logic and the DRD level, along with the performance assessment of the tool.", "num_citations": "4\n", "authors": ["601"]}
{"title": "Learning UI Functional Design Principles Through Simulation With Feedback\n", "abstract": " The user interface (UI) is a key component of an interactive software application; therefore, it is important to provide software developers with basic UI design skills. However, teaching UI design is challenging, even at a basic level, and there is little teaching support. In this article, we investigate the benefits of the feedback-enriched simulation environment (FENIkS) for learning fundamental UI design principles toward designing the functional aspects of a UI. FENIkS is a model-driven educational environment making use of simulation as learning support by generating a UI and the underlying application starting from conceptual domain and presentation models. The generated application and UI contain feedback elements for the learners. This feedback shows if the generated prototype is compliant with certain key design principles and why the principles are considered to be well applied or not. We conducted an …", "num_citations": "3\n", "authors": ["601"]}
{"title": "Leveraging IoT in Retail Industry: A Maturity Model\n", "abstract": " The Internet of Things (IoT) is acknowledged as one of the most important emerging technologies that can quickly disrupt the retail industry. However, the path towards reaching full potential from IoT is uncertain. In this paper, a maturity model (MM) is developed to assess the as-is situation and give advice on future actions for a successful IoT adoption. The MM is developed through a 4-round Delphi study with nine experts resulting in a 5-level MM with 5 dimensions and 11 subdimensions. The MM validation shows that it is easy-to-use and appropriate to provide guidance towards higher maturity levels.", "num_citations": "3\n", "authors": ["601"]}
{"title": "Comparing BPMN to BPMN+ DMN for IoT process modelling: a case-based inquiry\n", "abstract": " The network of interconnected devices that compose the Internet of Things (IoT) continues to expand. Business processes are starting to take advantage of IoT by adapting to the physical environment or by automating process tasks. The Business Process Model and Notation (BPMN) specification has been employed in numerous studies to include IoT devices and resources. While aggregating low-level IoT data into process-relevant data is of paramount importance for IoT processes, BPMN may not be the best approach to model this data aggregation. Decision Model and Notation (DMN), however, is a recently introduced standard which is inherently used to aggregate low-level information into high-level information. This makes DMN a promising match for modelling context data aggregation in IoT processes. Therefore, this paper examines the modelling of IoT processes by comparing the standard BPMN …", "num_citations": "3\n", "authors": ["601"]}
{"title": "Technology Enhanced Support for Learning Interactive Software Systems\n", "abstract": " The development of useful and usable interactive software systems depends on both User Interface (UI) design and software engineering in a complementary way. However, today, application development and UI design are largely separated activities and fields of knowledge. This separation is also present in education as can be witnessed from the common independent way of teaching of both subjects. Although the development of better interactive software systems could benefit significantly from an integrative teaching approach, there is a lack of concrete and proven approaches for such way of teaching. This paper presents technology enhanced support for filling this gap. The proposed tool supports and improves learning achievements for the development of interactive software systems. The learning support includes feedback for conceptual modeling integrated with UI design. The tool applies Model …", "num_citations": "3\n", "authors": ["601"]}
{"title": "Modeling IoT-aware business processes\n", "abstract": " This report presents an analysis of the state of the art of modeling IoT-aware business processes. In this introductory section, we first explain why it is relevant to combine the Internet of Things (IoT) and business process management (BPM). This sets the stage for the rest of this report. Next, we explain the goals and the structure of this report.", "num_citations": "3\n", "authors": ["601"]}
{"title": "Knowledge Change Management and Analysis during the Engineering of Cyber Physical Production Systems:  A Use Case of Hydro Power Plants\n", "abstract": " The process of designing Cyber Physical Production Systems (CPPS), eg, modern power plants or steel mills, typically takes place in a multi-disciplinary engineering environment, in which experts from various engineering domains and organizations work together towards creating complex engineering artifacts. The process of designing such complex engineering artifacts requires iterations and redesign phases, which lead to continuous changes of the data and knowledge. To manage changes in such environment, we have previously proposed a generic reference process for conducting Knowledge Change Management and Analysis (KCMA). This paper implements this process for the case study of a modern Hydro Power Plant by adapting the proposed generic reference process into a scientific prototype developed using Semantic Web Technologies. Finally, we conduct an evaluation to evaluate the feasibility …", "num_citations": "3\n", "authors": ["601"]}
{"title": "Automating unobtrusive personalized services in ambient media environments\n", "abstract": " In the age of ambient media, people are surrounded by lots of physical objects (media objects) for rendering the digital world in the natural environment. These media objects should interact with users in a way that is not disturbing for them. To address this issue, this work presents a design and automation strategy for augmenting the world around us with personalized ambient media services that behave in a considerate manner. That is, ambient services are capable of adjusting its obtrusiveness level (i.e., the extent to which each service intrudes the user’s mind) by using the appropriate media objects for each user’s situation.", "num_citations": "3\n", "authors": ["601"]}
{"title": "Supporting Information Sharing for Re-Use and Analysis of Scientific Research Publication Data\n", "abstract": " Effective and efficient information sharing for reuse and analysis of scientific data from published research papers is an important challenge for researchers in many areas, especially for researchers working within the empirical software engineering (EMSE) domain. Currently, there is only limited support for storing empirical research data and results in a way that is easy to access and reuse for other researchers. In this paper, we propose the Systematic Knowledge Engineering Tool (SKET), an ontology-based tool to provide researchers in the EMSE domain with capabilities for storing, sharing, and verifying results within their research community. The initial evaluation results show that SKET can address relevant needs in the EMSE community and can be considered as a foundation for advanced tool capabilities.", "num_citations": "3\n", "authors": ["601"]}
{"title": "Shortening of product ramp-up by using a centralized knowledge base\n", "abstract": " The manufacturing industry is still struggling with predictability of quality, duration and costs for the ramp-up of new products. However, new product ramp-up becomes increasingly crucial due to further shortening of product life-cycles and the pressure on more sustainable and efficient manufacturing. In this paper, we introduce an approach based on a centralized knowledge base that comprises product and process master data, equipment structure, historical measurement results and means to apply quality management methods. The approach uses a knowledge base driven workflow that ensures knowledge exchange and reuse of existing knowledge within the production line. Based on a real-world use case from semiconductor manufacturing we evaluate how well this workflow enables knowledge reuse to guide product and process engineers to support a shift from a risky ramp-up project to a predictable ramp …", "num_citations": "3\n", "authors": ["601"]}
{"title": "Change Patterns for Decision Model and Notation (DMN) Model Evolution.\n", "abstract": " Information systems rely on decision knowledge during their execution. A recently introduced standard, the Decision Model and Notation (DMN), has been adopted in both industry and academia as a suitable method for modelling decision knowledge. However, this decision knowledge is not static and may undergo changes after system deployment. DMN change patterns have not yet been studied in the literature. This paper fills this gap by presenting an initial set of DMN change patterns. The patterns presented in this paper will not only facilitate the understanding of decision change management, but can also be capitalised on for, among other things, adapting decision management systems to be more flexible, consistency checking of decision models, and developing modelling tools that facilitate those changes.", "num_citations": "2\n", "authors": ["601"]}
{"title": "Semantic data integration: Tools and architectures\n", "abstract": " This chapter is focused on the technical aspects of semantic data integration that provides solutions for bridging semantic gaps between common project-level concepts and the local tool concepts as identified in the Engineering Knowledge Base (EKB). Based on the elicitation of use case requirements from automation systems engineering, the chapter identifies required capabilities an EKB software architecture has to consider. The chapter describes four EKB software architecture variants and their components, and discusses identified drawbacks and advantages regarding the utilization of ontologies. A benchmark is defined to evaluate the efficiency of the EKB software architecture variants in the context of selected quality attributes, like performance and scalability. Main results suggest that architectures relying on a relational database still outperform traditional ontology storages while NoSQL databases …", "num_citations": "2\n", "authors": ["601"]}
{"title": "Correctness checking of pervasive behaviour by mapping task models to petri nets\n", "abstract": " Context-Adaptive Task models are a state-of-the-art executable modelling language to develop pervasive computing systems. Although these models have proven to be successful in the automation and support of user daily tasks, they do not provide a proper checking for ensuring the correctness of the designed systems. In this paper, we investigate and define mappings to translate the task models into Coloured Petri Nets (CPN), a formalism that provides powerful techniques for simulation and verification. By using these mappings, task models can be translated to their equivalent CP nets, enabling that the system’s behaviour described in the task models can be exhaustively checked at design time to ensure a proper system execution at runtime.", "num_citations": "2\n", "authors": ["601"]}
{"title": "Knowledge Change Management and Analysis for Multi-Disciplinary Engineering Environments.\n", "abstract": " Multi-Disciplinary Engineering (MDEng) environments involve a wide range of models, processes and tools that were not designed to cooperate together. The Ontology-Based Information Integration (OBII) approach has been proposed to address the integration issue within such environments. However, knowledge changes management and analysis (KCMA) process within the environment are not covered within the OBII approach. While the traditional ontology change management approach has been investigated to the general problem, it remains unclear how to use the available solutions within MDEng context. In this paper, we extend the OBII approach to enable the KCMA process. We have identified the main KCMA requirements within MDEng projects and studied the related work of Ontology Change Management to propose a suitable solution, as well as suggesting further works.", "num_citations": "2\n", "authors": ["601"]}
{"title": "Efficient data integration and communication issues in distributed engineering projects and project consortia\n", "abstract": " An engineering project consortium represents the collaboration of different groups of partners to achieve a common goal, eg, developing innovative products. This collaboration may be challenging because of different terminologies and different tools and data models used by the project partners. In this work, we present the concept of a Project Consortia Knowledge Base (PC-KB), an integration framework based on semantic knowledge that facilitates project-level communication as well as access to and querying of project data across tool and partner boundaries. The PC-KB allows establishing common data models on different abstraction layers within the consortium organization. Using these common models, the PC-KB integrates partner data to provide (a) a common terminology for facilitating communication among project partners and (b) a common consistent view for efficient data integration. The PC-KB has …", "num_citations": "2\n", "authors": ["601"]}
{"title": "A semantic framework for data integration and communication in project consortia\n", "abstract": " Engineering project consortia represents the collaboration of different groups of partners to achieve a common goal, e.g., developing innovative products. This collaboration may be challenging because of different terminologies and different tools and data models used by the project partners. In this work, we present the concept of a Project Consortia Knowledge Base (PC-KB), an integration framework based on semantic knowledge that facilitates project-level communication as well as access to and querying of project data across tool and partner boundaries. The PC-KB allows establishing common data models on different abstraction layers within the consortia organization. Using these common models, the PC-KB integrates partner data to provide (a) a common terminology for facilitating communication among project partners and (b) a common consistent view for efficient data integration. The PC-KB has been …", "num_citations": "2\n", "authors": ["601"]}
{"title": "A Novel Context Ontology to Facilitate Interoperation of Semantic Services in Environments with Wearable Devices\n", "abstract": " The LifeWear-Mobilized Lifestyle with Wearables (Lifewear) project attempts to create Ambient Intelligence (AmI) ecosystems by composing personalized services based on the user information, environmental conditions and reasoning outputs. Two of the most important benefits over traditional environments are 1) take advantage of wearable devices to get user information in a non-intrusive way and 2) integrate this information with other intelligent services and environmental sensors. This paper proposes a new ontology composed by the integration of users and services information, for semantically representing this information. Using an Enterprise Service Bus, this ontology is integrated in a semantic middleware to provide context-aware personalized and semantically annotated services, with discovery, composition and orchestration tasks. We show how these services support a real scenario proposed …", "num_citations": "2\n", "authors": ["601"]}
{"title": "Kind mobile notifications for healthcare professionals\n", "abstract": " The inclusion of the Internet of Things in healthcare is producing numerous automatic notifications for health professionals. These notifications must be delivered in the right moment and in the right way to be appropriately attended, and at the same time, ensuring no important task is interrupted. In this work, we have applied a human-centred design method to deal with this issue. By collaborating with health professionals in Belgium, we have designed and validated DELICATE, a conceptual framework that categorizes the different attention needs for each notification, and links them with the delivery mechanisms that are more appropriate for each particular context. As an aid for designers, we also define methodological guidelines to clearly determine how DELICATE can be used to develop a notification system. Finally, as a proof-of-concept validation of the framework, we have implemented it in an Android …", "num_citations": "1\n", "authors": ["601"]}
{"title": "The Internet-of-Things Meets Business Process Management. A Manifesto.\n", "abstract": " The Internet of Things (IoT) refers to a network of connected devices collecting and exchanging data over the Internet. These things can be artificial or natural and interact as autonomous agents forming a complex system. In turn, Business Process Management (BPM) was established to analyze, discover, design, implement, execute, monitor and evolve collaborative business processes within and across organizations. While the IoT and BPM have been regarded as separate topics in research and practice, we strongly believe that the management of IoT applications will strongly benefit from BPM concepts, methods and technologies on the one hand; on the other one, the IoT poses challenges that will require enhancements and extensions of the current state-of-the-art in the BPM field. In this paper, we question to what extent these two paradigms can be combined and we discuss the emerging challenges and …", "num_citations": "1\n", "authors": ["601"]}
{"title": "The Simple Enterprise Architecture Framework: Giving Alignment to IT Decisions\n", "abstract": " Context: Enterprise Architecture seeks to align organizational objectives with decisions associated to people, processes, information and technology. Different frameworks have been proposed for designing an enterprise architecture, such as TOGAF or Zachman. However, defining an enterprise architecture following these frameworks is not an easy task since it requires the alignment of organizational needs with technological decisions. Goal: This paper presents a methodological framework, called Simple Enterprise Architecture (SEA), that eases the definition of an enterprise architecture and provides concrete proof of the alignment between IT decisions and organizational needs. Method: The SEA framework has been developed by integrating components from existing ones in order to generate a concrete process that guides analysts in the correct definition of an enterprise architecture. Results: This …", "num_citations": "1\n", "authors": ["601"]}
{"title": "Teaching conceptual modelling: How can i improve?\n", "abstract": " © Springer International Publishing AG, part of Springer Nature 2018. CM fosters a good understanding of the problem domain, which is a key factor of IS development success. Conceptual modelers require a wide variety of skills involving “simple” skills, such as the ability to remember a modelling notation, and “complex” skills, such as the ability to translate a text description into a representative conceptual model. In order to build the “complex” skills, the educator must ensure the proper acquisition and integration of simpler skills by means of continuous support and timely feedback [1].", "num_citations": "1\n", "authors": ["601"]}
{"title": "Making business environments smarter: a context-adaptive petri net approach\n", "abstract": " Business Environments, such as shops, offices, automation plants, etc., are usually handled by the modeling and execution of business processes using languages such as Colored Petri Nets (CPN). CPN are a mathematical and graphical modeling language with powerful analysis techniques. However, current Petri nets formalisms are not aware of their execution context (i.e., Users and equipment location, temporal and environmental properties, etc.) and therefore it is not possible to manage business processes whose execution adapts to its context. To support this adaptation and make business processes smarter, this paper extends CPN with ontologies. Ontologies are powerful and very expressive techniques for modeling context and storing its data at execution time. To be aware of the current context, a context manager is used to sense the execution context using ubicomp technologies and represent it in the …", "num_citations": "1\n", "authors": ["601"]}
{"title": "ambient media as metaphor for creating new experiences and user interfaces\n", "abstract": " “Ambient Media” are a fundamentally new way how to define media in the ubiquitous era, and are contribute to the field of human-computer-interaction (HCI), computer science, experience design, media management, and media studies. Ambient Media have been defined, explored, and conceptualized in [2–5, 10]. This special issue devotes to the exploration of phenomena of ambient media, in particular on aspects of search and retrieval, interactive interfaces, designing experiences, applying new interaction concepts, the design of experiences, educational issues, and the future prospective of this novel media form. For this special issue, we accepted six papers exploring these issues.A very special feature of this special issue is, that the contributing authors collaboratively worked on the analysis of the containing articles. This article shall give a holistic overview of the current status of Ambient Media, and outlines …", "num_citations": "1\n", "authors": ["601"]}
{"title": "Semantic technologies for more-efficient model-driven development\n", "abstract": " Semantic technologies aim at supporting engineers in several phases of software and systems development projects, ie, modeling, code generation, verification and validation, and can address important challenges in software management, eg, managing engineering artefacts. In practice, engineers still prefer using well-known UML diagrams for graphically representing their systems and as foundation for high-quality software code derivation. To bridge the gap between traditional and semanticbased data model design, we presented the umlTUowl tool that supports transforming UML class diagram data formats (XMI) into semantic data (ie, OWL ontologies). However, it is essential that the generated data can be efficiently managed by non-experts in semantic technologies and that the models are preserved consistently. In this paper, we address these important issues by extending the umlTUowl tool towards a fully-fledged model-driven development (MDD) process, umlTUmany, that (a) supports the generation of Java code and (b) provides Java and semantic mechanisms for testing and consistency checking. We evaluated umlTUmany in a pilot application based on a real-world project management use case in a heterogeneous and distributed engineering environment. Main results are that umlTUmany was found useful to (a) support the efficient design and implementation of semantic technologies and (b) facilitate effective and efficient MDD code and test case generation.", "num_citations": "1\n", "authors": ["601"]}
{"title": "Improving Understandability of Declare Models by Revealing Hidden Dependencies\n", "abstract": " Declarative process models have become a mature alternative to procedural ones. Instead of focusing on what has to happen, they rather follow an outside-in approach based on a rule base containing different types of constraints. The models are well-capable of representing flexible behavior, as everything that is not allowed by the constraints in the model is possible during execution. These models, however, are more difficult to comprehend and require a higher mental effort of both the modeler and the reader. Since constraints can be added freely to the model, it is often overseen what impact the combination of them has. This is often referred to as hidden dependencies. This paper proposes a methodology to make these dependencies explicit for the declarative process modeling language Declare by considering a Declare model as a graph and relying on the constraints’ characteristics. Moreover, this paper also contributes by empirically confirming that a tool that can visualize hidden dependency information on top of a Declare model has a significant positive impact on the understandability of Declare models.", "num_citations": "1\n", "authors": ["601"]}