{"title": "Usability requirements for interaction-oriented development tools\n", "abstract": " Building interactive software is a notoriously complex task, for which many programming tools have been proposed over the years. Although the research community has sporadically identified usability requirements for such tools, tool proponents rarely document their design processes and there is no established reference for comparing tools with requirements. Furthermore, the design of most tools is strongly influenced by the design of their underlying general purpose programming languages. These in turn were designed from their own set of little-documented requirements, which adds to the confusion. In this paper, we provide a review and classification of the requirements and properties expected of interactive development tools. We review how designers of APIs and toolkits for interaction-oriented systems set the usability requirements for the programming interface of their systems. We relate our analysis to other studies in related domains such as end-user programming, natural programming, and teaching.", "num_citations": "17\n", "authors": ["965"]}
{"title": "Simulating Air Traffic Control Ground Operations: Preliminary Results from Project Modern Taxiing\n", "abstract": " Automated technology is one of many solution that can help meet the growing air traffic demand at busy airports by assisting air traffic controller officers maintain efficient and safe operations. In particular, ground air traffic controllers can benefit from the services of an automated decision support system that can provide taxiing path suggestion and conflict detection. Fuel consumption can be minimized with the use of automated aids such as path suggestion for the most fuel-optimal trajectory, robotic taxiing tractors, or electric taxiing systems. Project MoTa - Modern Taxiing promises these capabilities and assists in the transition from current technology by developing a human-centered user platform. Nevertheless, developing such a system requires a simulated air traffic control environment, both for testing new concepts and for validation. To this end, we have built an environment and begun evaluating taxiing performance for the ground operations in the south end of Paris Charles de Gaulle airport. Results from the initial sessions indicate the modeled scenarios are representative and solutions have been found to account for the experience gap with ATCO participants not from Charles de Gaulle. This paper presents these results and discusses the solutions for the modeling and simulation challenges encountered during the development process.", "num_citations": "8\n", "authors": ["965"]}
{"title": "Modulating Workload for Air Traffic Controllers during Airport Ground Operations\n", "abstract": " Evaluating future technology concepts for air traffic control ground operations requires exploration of work scenarios of differing complexities, i.e. scenarios that create more or less taskload for air traffic controllers. While the link between traffic load and workload has been well-characterized in the literature and is often the only complexity variable applied to validation studies, there are other operational events that can augment controller workload. Through a series of interviews and on-site observations of professional and student air traffic controllers, we defined seven general operational events that can be applied to all airport ground operations. We discuss the development of two scenarios of different workloads (average and hard) and their validation with air traffic controllers.", "num_citations": "4\n", "authors": ["965"]}
{"title": "Development of an ATC Tower Simulator to Simulate Ground Operations\n", "abstract": " The expected growth in air traffic has resulted in many projects attempting to mitigate the problem of air traffic control, particularly at airports. These projects have focused on characterizing the workload of the air traffic control officer and/or introducing automated technology to assist in his or her responsibilities. Many of these projects have used existing simulation facilities and technology or developed analogous environments to simulate the air traffic control tower. However, such high-fidelity simulation facilities are in limited locations or not easily accessible. Results gathered in simplified environments, while accurate in a controlled setting, may be limited in their extrapolation to real-world applications. Furthermore, little guidance is provided in the literature for developing an ATC tower micro-world, particularly in terms of knowing which elements are most necessary to simulate and the most effective way to actualize …", "num_citations": "1\n", "authors": ["965"]}
{"title": "Exploration et gestion des connaissances des ressources en IHM\n", "abstract": " Nous présentons dans l' article le résultat d'un travail réalisé à l'école de Printemps 2010 de l'AFIHM. L'analyse des activités liées à la réalisation d' un état de l'art nous montre qu'une des tâches les plus compliquées est la familiarisation avec un nouveau domaine. Pour outiller cette activité, nous présentons des pistes de réflexion basées sur une analogie avec la mémoire humaine.", "num_citations": "1\n", "authors": ["965"]}