{"title": "A Blockchain-Based Solution for Enhancing Security and Privacy in Smart Factory\n", "abstract": " Through the Industrial Internet of Things (IIoT), a smart factory has entered the booming period. However, as the number of nodes and network size become larger, the traditional IIoT architecture can no longer provide effective support for such enormous system. Therefore, we introduce the Blockchain architecture, which is an emerging scheme for constructing the distributed networks, to reshape the traditional IIoT architecture. First, the major problems of the traditional IIoT architecture are analyzed, and the existing improvements are summarized. Second, we introduce a security and privacy model to help design the Blockchain-based architecture. On this basis, we decompose and reorganize the original IIoT architecture to form a new multicenter partially decentralized architecture. Then, we introduce some relative security technologies to improve and optimize the new architecture. After that we design the data …", "num_citations": "161\n", "authors": ["2194"]}
{"title": "Improving the quality of software development process by introducing a new methodology—AZ–Model\n", "abstract": " Quality is the most important factor for software development as it mainly defines customer satisfaction that is directly related to the success of a software project. The software process model is used to ensure software quality, represent a variety of task settings, manage project duration, improve the process and range to execute the process understanding, and to appropriate implicit conjecture for all task settings. Several software processes models exist in software albeit with limited scope. Given this viewpoint, this paper presents a new software development life cycle model, “AZ-Model”, for software development by introducing new activities during software development life cycle. It overcomes the limitations of traditional models and significantly impacts the production of a quality product in a time-box. This paper also presents a comprehensive comparative study and statistical analyses to examine the significance …", "num_citations": "72\n", "authors": ["2194"]}
{"title": "A Review on Data Security in Cloud Computing\n", "abstract": " Cloud computing is an Internet-based computing and next stage in evolution of the internet. It has received significant attention in recent years but security issue is one of the major inhibitor in decreasing the growth of cloud computing. It essentially shifts the user data and application software to large datacenters ie, cloud, which is remotely located, at which user does not have any control and the management of data may not be completely secure. However, this sole feature of the cloud computing introduce many security challenges which need to be resolved and understood clearly. One of the most important and leading is security issue that needs to be addressed. Data Security concerns arising because both user data and program are located in provider premises. In this study, an attempt is made to review the research in this field. The results of review are categorized on the basis of type of approach and the type of validation used to validate the approach.", "num_citations": "47\n", "authors": ["2194"]}
{"title": "Co-EEORS: Cooperative Energy Efficient Optimal Relay Selection Protocol for Underwater Wireless Sensor Networks\n", "abstract": " Cooperative routing mitigates the adverse channel effects in the harsh underwater environment and ensures reliable delivery of packets from the bottom to the surface of water. Cooperative routing is analogous to sparse recovery in that faded copies of data packets are processed by the destination node to extract the desired information. However, it usually requires information about the two or three position coordinates of the nodes. It also requires the synchronization of the source, relay, and destination nodes. These features make the cooperative routing a challenging task as sensor nodes move with water currents. Moreover, the data packets are simply discarded if the acceptable threshold is not met at the destination. This threatens the reliable delivery of data to the final destination. To cope with these challenges, this paper proposes a cooperative energy-efficient optimal relay selection protocol for underwater …", "num_citations": "46\n", "authors": ["2194"]}
{"title": "A review of software component reusability assessment approaches\n", "abstract": " Software reuse yields benefits such as a reduction in the development time, cost and effort required and an increase in the productivity and quality. One of the ways to attain these reuse benefits is the use of components to develop software and is termed component-based software development. Reuse is facilitated by employing a systematic reuse methodology, such as is used with software product lines. Reusability is the degree to which software can be reused. Several approaches to assessing the reusability of software components have been proposed. Each is applicable to a specific programming language or paradigm. This study discusses the current state of the art of the reusability assessment of software components. The results of the review are categorized on the basis of the type of approach, the applicability and type of validation used to validate the approach. Moreover, the work attempts to highlight the …", "num_citations": "23\n", "authors": ["2194"]}
{"title": "Reusability Assessment of Open Source Components for Software Product Lines\n", "abstract": " Software product lines and open source software are two emerging paradigms in software engineering. A common theme in both of these paradigms is „reuse‟. Software product lines are a reuse centered approach that makes use of existing assets to develop new products. At the moment, a motivation for using open source software is so as to gain access to source code, which can then be reused. The product line community is being attracted to open source components. The use of open source software in software product lines is not for one time reuse but, being a core asset, the component is intended to be used repeatedly for the development of other products in the family. In this paper the results of an exploratory study is presented; it was conducted to explore the factors affecting the reusability of open source components. On the basis of the results of the exploratory study a reusability attribute model is presented which makes use of established object oriented metrics accompanied with newly defined metrics. The assessment using the proposed metrics is compared with the rankings assigned by human evaluators.", "num_citations": "22\n", "authors": ["2194"]}
{"title": "A weighted linear combining scheme for cooperative spectrum sensing\n", "abstract": " Cooperative spectrum sensing exploits spatial diversity of secondary-users (SUs), to reliably detect the availability of a spectrum. Soft energy combining schemes have optimal detection performance at the cost of high cooperation overhead, since actual sensed data is required at the fusion center. To reduce cooperation overhead, in hard combining only local decisions are shared; however the detection performance is suboptimal due to the loss of information. In this paper, a weighted linear combining scheme is proposed in which a SU performs a local sensing test based on two threshold levels. If local test result lies between the two thresholds then the SU report neither its local decision nor sequentially estimated unknown SNR parameter values, to the fusion center. Thereby, uncertain decisions about the presence/absence of the primary-user signal are suppressed. Simulation results suggest that the detection …", "num_citations": "21\n", "authors": ["2194"]}
{"title": "Encryption Techniques for Cloud Data Confidentiality\n", "abstract": " Cloud computing is one of the fastest growing internet based technology that facilitates users to utilize services by making use of large poll of resources without installation of any software. Adoption of this technology is increasing rapidly because of many advantages including reduction of cost and IT load. Despite the popularity of cloud computing, it faces many difficulties such as security that is one of the major inhibitors in the growth of cloud computing. Data confidentiality is at the top of the list of security concern for this technology. Many methods have been introduced to overcome this issue; encryption is one of them and widely used method to ensure the data confidentiality in cloud environment. In this study, an attempt is made to review the encryption techniques used for the data confidentiality. The results of review are classified on the basis of type of approach and the type of validation used to validate the …", "num_citations": "20\n", "authors": ["2194"]}
{"title": "A near-optimal LLR based cooperative spectrum sensing scheme for CRAHNs\n", "abstract": " In Cognitive Radio Ad Hoc Networks (CRAHNs), cooperative spectrum sensing schemes exploit spatial diversity of the Secondary Users (SUs), to reliably detect an unoccupied licensed spectrum. Soft energy combining schemes provide optimal detection performance by combining the actual sensed information from SUs. For reliable data fusion, these techniques mandate weight estimation for individual SUs in each sensing interval, resulting in high cooperation overhead in terms of time, processing and bandwidth. Alternately, a hard energy combining scheme offers lower cooperation overhead in which only local SU decisions are reported to the fusion center. However, it provides sub-optimal detection performance due to the information loss. In this paper, a Log-Likelihood Ratio (LLR) based cooperative spectrum sensing scheme is proposed in which each SU performs a local LLR based sensing test employing …", "num_citations": "17\n", "authors": ["2194"]}
{"title": "Towards feature subset selection in intrusion detection\n", "abstract": " Intrusion is a serious issue in computer and network systems because a single intrusion can cause a heavy loss in few seconds. To prevent an intrusion, a robust intrusion detection system is highly needed. Existing intrusion detection techniques are not robust; the number of false alarms is high. One of the reasons of false alarms is due to the use of a raw dataset that includes redundancy. To overcome this issue, the recent approaches used (PCA) for feature subset selection where features are first transformed into an eigen space and then features are selected based on their variances (i.e. eigenvalues), but the features corresponding to the highest eigenvalues may not have the optimal sensitivity for the classifier. Instead of using traditional approach of selecting features with the highest eigenvalues, an optimization approach is needed because the selection of most discriminative subset of transformed features is …", "num_citations": "17\n", "authors": ["2194"]}
{"title": "A review on aspect oriented implementation of software product lines components\n", "abstract": " Aspect orientation is an emerging technique which provides a solution to the implementation of concerns that span more than one module, thus enhancing modularity. Modularity is directly related to reusability. The whole point of having a software product line is so that software assets can be reused to develop multiple individual products. This co-relation between aspect-oriented techniques and software product lines motivates the development of aspect-oriented product line components. Several researchers have presented their work on the development of core assets using aspect-oriented techniques. These studies used aspect-oriented techniques for an improved separation of a concern, the treatment of crosscutting concerns, the inclusion of optional'alternative features and for variability management. In this study, an attempt is made to review the research in this field, highlighting the application domains …", "num_citations": "11\n", "authors": ["2194"]}
{"title": "A log-likelihood based cooperative spectrum sensing scheme for cognitive radio networks\n", "abstract": " In cognitive radio networks, cooperative spectrum sensing is used to exploit spatial diversity of secondary users, in order to reliably detect an unoccupied licensed spectrum. Since each secondary user experience different channel conditions, therefore observations of secondary users are weighted according to the reliability factor (weight) of individual secondary user. However, the weight estimation is done in each sensing interval resulting in high cooperation overhead in terms of time, processing and reporting channel bandwidth. In this paper, we propose a novel cooperative spectrum sensing scheme which is based on the Log-Likelihood ratio (LLR). The secondary users employ two threshold level to minimize false-alarms and miss-detection of the primary user's signal. In addition, unknown parameters for weight computation are estimated/updated after certain number of sensing intervals instead of estimating …", "num_citations": "9\n", "authors": ["2194"]}
{"title": "An analysis of object oriented variability implementation mechanisms\n", "abstract": " Software variability is the capacity of software to satisfy variant requirements. Component based software engineering and reuseintense software development, such as software product line engineering, demand software components with high variability. Increased variability influences a component's utility as it can be reused in multiple applications. In this paper a review and analysis of variability implementation mechanisms is presented. It builds on earlier work on software variability by providing an analysis and a synthesis. The purpose of this work is to classify the available variability mechanisms in terms of type, scope, and the artefact to be targeted. Examples to illustrate the points under discussion are given in the form of Java code.", "num_citations": "9\n", "authors": ["2194"]}
{"title": "Improving the Security in Healthcare Information System through Elman Neural Network based Classifier\n", "abstract": " Intrusions are critical issues in information system of healthcare sector because a sole intrusion can cause health issue due to any manipulation in the medical record of the patients. Several intrusion detection (ID) techniques have been used but their performance is the dilemma. The efficiency of intrusion detection systems (IDSs) depends on optimal classifier architecture to categorize the data into intrusive or normal, which required increasing detection rates (DR) and decreasing false alarm rates (FAR). Therefore, to find an optimal classifier architecture to enhance performance in IDSs is an important subject. This study proposed Elman Neural Network-based IDS as classification technique in order to enhance performance. NSL-KDD Dataset is used for evaluation and assessment. Moreover, Principle Component Analysis (PCA) is applied in this work in order to convert raw features to principal space and choose …", "num_citations": "7\n", "authors": ["2194"]}
{"title": "Disease–Disease Association Using Network Modeling: Challenges and Opportunities\n", "abstract": " Over the years, the research community has conducted a number of studies in order to identify the comorbidity patterns on the basis of numerous factors such as genetics, metabolites, microbes, Protein–Protein Interactions (PPIs), and microRNAs (miRNAs). However, to the best of our knowledge, no study has been conducted to review and summarize the literature on the basis of different network analysis levels, namely, micro, meso, macro, and hybrid to identify disease comorbidity patterns. In this study, we have conducted a systematic literature review to select, extract, and critically analyze previous related studies. We also elaborate different methods of social network analysis which have been employed for finding disease associations. This study has also identified least, average, and most used methods at micro, meso, and macro-levels. The analysis suggests that the full potential of the network analysis has …", "num_citations": "4\n", "authors": ["2194"]}
{"title": "Towards Intrusion Detection to Secure VANET-Assisted Healthcare Monitoring System\n", "abstract": " Remote healthcare monitoring (RHM) has been used in contemporary disease management to improve the quality of life. A Secure VANET-Assisted Remote Healthcare Monitoring System is very importance due to privacy and sensitivity of the health data. In wireless network different kind of attacks produce and involve the core functionality of VANET-Assisted Remote Healthcare Monitoring System. DoS and DDoS are two important attacks and both are related to the network availability. This study provides the detail description and working mechanism of DoS and DDoS attack in VANET-Assisted Remote Healthcare Monitoring System. Further, it proposes the possible solutions to detect and prevent such attacks in network and make sure for end users to continuous access the network. Moreover, the random forest algorithm is proposed and applied to the benchmarked dataset for the detection of the attacks that …", "num_citations": "4\n", "authors": ["2194"]}
{"title": "Evaluating Defense Simulation Packages Using AnalyticHierarchy Process\n", "abstract": " With the advent of increasing availability and usage of defense simulation packages it has become cumbersome to decide which package will suit a given application? Therefore, the need of a mechanism to facilitate the selection of an appropriate package is inevitable. This paper provides an evaluation for defense simulation tools based on Analytical Hierarchy Process (AHP). In this study, AHP is employed to evaluate four different defense simulation packages. The evaluation process is implemented using decision support software based on AHP. The results of the experiment are addressed, analyzed and compared in the context of frameworks' criteria and sub-criteria.", "num_citations": "2\n", "authors": ["2194"]}
{"title": "Treating Class Imbalance in Non-Technical Loss Detection: An Exploratory Analysis of a Real Dataset\n", "abstract": " Non-Technical Loss (NTL) is a significant concern for many electric supply companies due to the financial impact caused as a result of suspect consumption activities. A range of machine learning classifiers have been tested across multiple synthesized and real datasets to combat NTL. An important characteristic that exists in these datasets is the imbalance distribution of the classes. When the focus is on predicting the minority class of suspect activities, the classifiers’ sensitivity to the class imbalance becomes more important. In this paper, we evaluate the performance of a range of classifiers with under-sampling and over-sampling techniques. The results are compared with the untreated imbalanced dataset. In addition, we compare the performance of the classifiers using penalized classification model. Lastly, the paper presents an exploratory analysis of using different sampling techniques on NTL detection in a …", "num_citations": "1\n", "authors": ["2194"]}
{"title": "A Methodology to Rank the Patients Prone to Chronic Diseases in Telehealth\n", "abstract": " Context: From last decade, telehealth research community have started to use machine learning techniques to automate the certain aspects of healthcare systems for prediction of patients prone to chronic diseases such as checking of insulin level, cancer, and monitoring blood-glucose levels. Though existing automated systems aid the telehealth practitioner, however high computing effort, time, and cost is required in terms of several classifiers, multi class problem, or large sample size to obtained results on the basis of ground reality. Goal: We work on this concern and propose a methodology which is employed via", "num_citations": "1\n", "authors": ["2194"]}
{"title": "Virtual Reality-Based Surgical Simulation Training Usability Heuristics\n", "abstract": " In recent years, a trend to develop and validate more specialized heuristics for specific technologies or applied computing domains has been observed. Usability heuristics are lightweight inspection methods that can be applied to identify usability problems, requiring less time and human resources. Many usability heuristics have been proposed for evaluating traditional user interfaces. However, due to the virtual reality environment's distinctive characteristics, traditional heuristics do not effectively fit such systems' nature. Virtual reality is beneficial to many applications, especially in surgical training with safety-critical procedures that pose a relatively high risk for patients. Thus, there is a need for a specific set of surgical simulation heuristics based on virtual reality, since the interaction style is markedly different from direct manipulation of graphical user interface. In this paper, we followed a six-stage methodology in …", "num_citations": "1\n", "authors": ["2194"]}
{"title": "Mechanisms for managing variability when implementing object oriented components\n", "abstract": " Disclaimer-Universiti Teknologi PETRONAS shall not be liable for any loss or damage caused by the usage of any information obtained from this web site. Best viewed using Mozilla Firefox 3 or IE 7 with resolution 1024 x 768.", "num_citations": "1\n", "authors": ["2194"]}
{"title": "Proposal for evaluation of software reusability assessment approach employing a mixed method\n", "abstract": " Software engineering, as an engineering discipline, is still quite young as compared to other engineering disciplines. The software engineering research community has made enormous contributions in past decades to lay down its foundations. However, the research methodologies in software engineering are still not mature. One of the reasons in this regard is the inherent complexity of this field. In this paper, we focus on one aspect of this field -- the evaluation of reusability assessment approaches. We begin by reviewing existing ways of comparing reusability assessment approaches. Following this we propose a different approach. This includes a mixture of both subjective and objective evaluation of a reusability assessment approach. This is novel in that we feel that subjective evaluation has been neglected by other approaches.", "num_citations": "1\n", "authors": ["2194"]}