{"title": "A systematic mapping study of software reliability modeling\n", "abstract": " ContextSoftware Reliability (SR) is a highly active and dynamic research area. Published papers have approached this topic from various and heterogeneous points of view, resulting in a rich body of literature on this topic. The counterpart to this is the considerable complexity of this body of knowledge.ObjectiveThe objective of this study is to obtain a panorama and a taxonomy of Software Reliability Modeling (SRM).MethodIn order to do this, a Systematic Mapping Study (SMS) which analyzes and structures the literature on Software Reliability Modeling has been carried out.ResultsA total of 972 works were obtained as a result of the Systematic Mapping Study. On the basis of the more than 500 selected primary studies found, the results obtained show an increasing diversity of work.ConclusionAlthough it was discovered that Software Reliability Growth Models (SRGM) are still the most common modeling …", "num_citations": "54\n", "authors": ["1543"]}
{"title": "Software reliability modeling based on ISO/IEC SQuaRE\n", "abstract": " ContextThe increasing dependence of our society on software driven systems has led Software Reliability to become a key factor as well as making it a highly active research area with hundreds of works being published every year. It would, however, appear that this activity is much more reduced as regards how to apply representative international standards on Product Quality to industrial environments, with just a few works on Standard Based software reliability modeling (SB-SRM). This is surprising given the relevance of such International Standards in industry.ObjectiveTo identify and analyze the existing works on the modeling of Software Reliability based on International Standards as the starting point for a reliability assessment proposal based on ISO/IEC-25000 “Software Product Quality Requirements and Evaluation” (SQuaRE) series.MethodThe work methodology is based on the guidelines provided in …", "num_citations": "46\n", "authors": ["1543"]}
{"title": "Software Reliability as User Perception: Application of the Fuzzy Analytic Hierarchy Process to Software Reliability Analysis\n", "abstract": " Software Quality is a multidimensional concept for which Reliability is considered as a key attribute. Notwithstanding, due to its conceptual complexity, there is no common agreement on what Software Reliability is, thus different stakeholders use a variety of Software Reliability views. With the aim to improve our understanding of what Software Reliability means for industrial stakeholders as well as that of contributing to enhance the industrial applicability of Software Quality Models we propose approaching Software Reliability analysis by using structural model based on representative International Standards, which are industry-oriented. As analysis method, since interested on stakeholders' vision of Reliability we will apply the Fuzzy Analytic Hierarchical Process (FAHP) which is designed to manage human assessment, always characterized by a certain degree of vagueness and subjectivity. The rationality of the …", "num_citations": "5\n", "authors": ["1543"]}