{"title": "Simulated surface tensions of common water models\n", "abstract": " Initial simulated values of the surface tension for the SPC/E water model have indicated excellent agreement with experiment. More recently, differing values have been obtained which are significantly lower than previous estimates. Here, we attempt to explain the differences between the previous studies and show that a variety of simulation conditions can affect the final surface tension values. Consistent values for the surface tensions of six common fixed charge water models (TIP3P, SPC, SPC/E, TIP4P, TIP5P, and TIP6P) are then determined for four temperatures between 275 and 350K. The SPC/E and TIP6P models provide the best agreement with experiment.", "num_citations": "189\n", "authors": ["1966"]}
{"title": "5-Arylidenethioxothiazolidinones as Inhibitors of Tyrosyl–DNA Phosphodiesterase I\n", "abstract": " Tyrosyl–DNA phosphodiesterase I (Tdp1) is a cellular enzyme that repairs the irreversible topoisomerase I (Top1)–DNA complexes and confers chemotherapeutic resistance to Top1 inhibitors. Inhibiting Tdp1 provides an attractive approach to potentiating clinically used Top1 inhibitors. However, despite recent efforts in studying Tdp1 as a therapeutic target, its inhibition remains poorly understood and largely underexplored. We describe herein the discovery of arylidene thioxothiazolidinone as a scaffold for potent Tdp1 inhibitors based on an initial tyrphostin lead compound 8. Through structure–activity relationship (SAR) studies we demonstrated that arylidene thioxothiazolidinones inhibit Tdp1 and identified compound 50 as a submicromolar inhibitor of Tdp1 (IC50 = 0.87 μM). Molecular modeling provided insight into key interactions essential for observed activities. Some derivatives were also active against …", "num_citations": "66\n", "authors": ["1966"]}
{"title": "Application of molecular dynamics simulation in food carbohydrate research—a review\n", "abstract": " Molecular dynamics (MD) simulation is an emerging technique in studying the interactions between macromolecules with small ligands in different media. In this review, the application of MD simulation in food carbohydrate research, including carbohydrate hydration, carbohydrate interaction with other components and carbohydrate inclusion complexation, will be discussed. The advantages and disadvantages of MD simulation in food carbohydrate research and trends will be proposed. The frequently used software to run the MD simulation and a standard protocol for MD simulation procedures have been discussed. This review offers a general idea about how to use MD simulation in food carbohydrate research, and what could be expected from such research.Industrial relevanceThis review offers a general idea about how to use MD simulation in food carbohydrate research, and what could be expected from …", "num_citations": "32\n", "authors": ["1966"]}
{"title": "Theory and computer simulation of solute effects on the surface tension of liquids\n", "abstract": " A complete description of the thermodynamics of planar mixed solute−solvent interfaces suitable for the analysis of computer simulation data is provided. The approach uses surface probability distributions to characterize the interface regions, coupled with radial distribution functions and the Kirkwood−Buff theory of solutions to characterize the bulk solution properties. The approach is then used to understand the relationship between changes in the surface tension, the degree of surface adsorption or depletion, and the bulk solution properties of two aqueous solute systems. The first, aqueous NaCl solutions, provides an example of a surface excluded solute. The second, aqueous methanol solutions, provides an example of a surface adsorbed solute. The numerical results support the theoretical relationships described here and provide a consistent picture of the thermodynamics of solution interfaces involving any …", "num_citations": "32\n", "authors": ["1966"]}
{"title": "Self-assembled nanoparticle of common food constituents that carries a sparingly soluble small molecule\n", "abstract": " A previously reported nanoparticle formed through the self-assembly of common food constituents (amylose, protein, and fatty acids) was shown to have the capacity to carry a sparingly soluble small molecule (1-naphthol) in a dispersed system. Potentiometric titration showed that 1-naphthol locates in the lumen of the amylose helix of the nanoparticle. This finding was further supported by calorimetric measurements, showing higher enthalpies of dissociation and reassociation in the presence of 1-naphthol. Visually, the 1-naphthol-loaded nanoparticle appeared to be well-dispersed in aqueous solution. Molecular dynamics simulation showed that the self-assembly was favorable, and at 500 ns, the 1-naphthol molecule resided in the helix of the amylose lumen in proximity to the hydrophobic tail of the fatty acid. Thus, sparingly soluble small molecules, such as some nutraceuticals or drugs, could be incorporated …", "num_citations": "24\n", "authors": ["1966"]}
{"title": "ST‐analyzer: A web‐based user interface for simulation trajectory analysis\n", "abstract": " Molecular dynamics (MD) simulation has become one of the key tools to obtain deeper insights into biological systems using various levels of descriptions such as all‐atom, united‐atom, and coarse‐grained models. Recent advances in computing resources and MD programs have significantly accelerated the simulation time and thus increased the amount of trajectory data. Although many laboratories routinely perform MD simulations, analyzing MD trajectories is still time consuming and often a difficult task. ST‐analyzer, http://im.bioinformatics.ku.edu/st‐analyzer, is a standalone graphical user interface (GUI) toolset to perform various trajectory analyses. ST‐analyzer has several outstanding features compared to other existing analysis tools: (i) handling various formats of trajectory files from MD programs, such as CHARMM, NAMD, GROMACS, and Amber, (ii) intuitive web‐based GUI environment—minimizing …", "num_citations": "13\n", "authors": ["1966"]}
{"title": "Energy levels, Auger branching ratios, and radiative rates of the core-excited states of B-like carbon\n", "abstract": " Energy levels, Auger branching ratios, and radiative rates of the core-excited states of B-like carbon are calculated by the saddle-point variation and saddle-point complex-rotation methods. Relativistic and mass polarization corrections are included using first-order perturbation theory. Calculated Auger channel energies and branching ratios are used to identify high-resolution Auger spectrum in the 300-keV C+ → CH4 collision experiment. It is found that Auger decay of these five-electron core-excited states gives significant contributions to Auger spectrum in the range of 238–280 eV.", "num_citations": "11\n", "authors": ["1966"]}
{"title": "Corn zein undergoes conformational changes to higher β-sheet content during its self-assembly in an increasingly hydrophilic solvent\n", "abstract": " Viscoelasticity of corn zein is associated with the formation of β-sheet secondary structures; however, studies of the fundamentals of this conformational change are limited due to zein insolubility and poor analytical resolution. Here, changes in soluble zein conformation were evaluated as the protein self-assembles in increasingly hydrophilic solvents to the concentration just before aggregation and precipitation. Circular dichroism spectra of zein showed that α-helix structures decrease in favor of random coil and β-sheets with increases in water content in an ethanol-water system, similar to observations of zein when it becomes viscoelastic in dough systems. This was further supported by changes in Thioflavin T fluorescence emission spectra and intrinsic viscosity measurements. Two widely recognized molecular models for α-zein (hairpin and superhelical conformations) were tested at 75 and 45% ethanol …", "num_citations": "9\n", "authors": ["1966"]}
{"title": "Comparison of aroma-active volatiles and their sensory characteristics of mangosteen wines prepared by Saccharomyces cerevisiae with GC-olfactometry and principal component …\n", "abstract": " Mangosteen fruit is fermented with five different strains (i.e. GRE (Y1), Lalvin RC212 (Y2), Lalvin D254 (Y3), CGMCC2.23 (Y4) and CGMCC2.4 (Y5)) of the yeast Saccharomyces cerevisiae to make mangosteen wines. A total of 36 volatile compounds of the mangosteen wines were identified by gas chromatography-mass spectrometry and gas chromatography-pulsed flame photometric detection. A total of 35 odour-active compounds were identified by gas chromatography-olfactometry analysis and by the detection frequency (DF) method. The compounds with high DF values included ethyl octanoate, ethyl hexanoate and 3-methyl-2-butene-1-thiol. Principal component analysis was used to characterise the differences of the flavour profiles of those mangosteen wines. The result demonstrated that the samples could be divided into three groups that were associated closely with aroma-active compounds.", "num_citations": "9\n", "authors": ["1966"]}
{"title": "Radiative and Auger transitions of core-excited states for the boron isoelectronic sequence\n", "abstract": " Energy levels, radiative rates, Auger branching ratios of the 1s vacancy resonances 1s2s                 22p                 2 and 1s2s2p                 3   2,4L (L  =  S, P, D) of the boron isoelectronic sequence including O3+, Ne5+, Mg7+, Si9+ ions are calculated by the saddle-point variation and saddle-point complex-rotation methods. Large-scale wavefunctions are used to obtain reliable results. Relativistic corrections and mass polarisation effects are taken into account to get precise energy levels. Calculated X-ray wavelengths, radiative rates, Auger electron energies, and Auger rates for these core-excited states are compared with available theoretical and experimental results. Furthermore, calculated reliable X-ray wavelengths are used to give possible identifications for satellite lines in the X-ray spectrum of foil-excited magnesium and silicon ions. Calculated Auger electron energies and Auger branching ratios are …", "num_citations": "7\n", "authors": ["1966"]}
{"title": "Starch-Lipid and Starch-Protein Complexes and Their Application\n", "abstract": " Amylose is a linear polysaccharide derived from D-glucopyranose units from α-1,4-glycosidic linkages, which can form complexes with some inorganic or organic groups to form helical introns. In this chapter, starch copolymers and the creation, properties, and applications of starch-protein and starch-lipid complexes were introduced. Because of the low toxicity, excellent biocompatibility, and solubility, amylose/α-linoleic acid/β-lactoglobulin triplex has attracted significant interest in food nutraceuticals or functional compounds in food delivery systems. Cornstarch was washed with n-butanol and isoamyl alcohol to remove impurities, followed by vacuum drying to obtain highly pure amylose. The amylose was dissolved by heating and stirring. α-Linoleic acid dissolved in absolute ethanol was added first and stirred prior to the addition of β-lactoglobulin aqueous solution. After stirring, the mixture was cooled to …", "num_citations": "6\n", "authors": ["1966"]}
{"title": "Energies, fine structures, and radiative lifetimes for the multiexcited quartet states of B‐like oxygen\n", "abstract": " Energies for the multiexcited states 1s22s2pnl and 1s22p2nl 4Pe,o (n ≥ 2) of B‐like oxygen are calculated using Rayleigh–Ritz variation method with configuration interaction. The mass polarization and relativistic corrections are obtained with first‐order perturbation theory. Configuration structures of the high‐lying multiexcited series are identified by energies and contribution to normalization of angular‐spin components. These structures are further checked by calculations of relativistic corrections and fine structure splittings. Hyperfine parameters and hyperfine coupling constants are calculated for the first time. Wavelengths including quantum electrodynamic effect and higher‐order relativistic corrections and lifetimes are also calculated. These results are compared with available results in the literature. © 2011 Wiley Periodicals, Inc. Int J Quantum Chem, 2012", "num_citations": "6\n", "authors": ["1966"]}
{"title": "A quasiclassical trajectory study for the N (S 4)+ O 2 (X Σ g− 3)→ NO (X Π 2)+ O (P 3) reaction on the new A′ 2 and A′ 4 potential-energy surfaces\n", "abstract": " A quasiclassical trajectory study with the sixth-order explicit symplectic algorithm of the N(S4)+O2(XΣg−3)→NO(XΠ2)+O(P3) atmospheric reaction has been performed by employing the new A′2 and A′4 potential-energy surfaces reported by Sayós et al. [J. Chem. Phys. 117, 670 (2002)]. For the translational temperature considered up to 10000K, the larger relative translational energy and the higher rovibrational levels of O2 molecule with respect to the previous works have been taken into account, and a clearer database about the character of the total reaction cross section has been presented in this work. The dependence of microscopic rate constants on the vibrational level of O2 molecule at T=3000, 5000, and 10000K has been exhibited, and we can see that the values of log10k(T,v,J) vary almost linearly with the vibrational level of O2 molecule. The thermal rate constants at the translational temperature …", "num_citations": "6\n", "authors": ["1966"]}
{"title": "Performance prediction of hpc applications on intel processors\n", "abstract": " It is commonly the case that a small number of widely used applications make up a large fraction of the workload of HPC centers. Predicting the performance of important applications running on specific processors enables HPC centers to design best performing system configurations and to insure good performance for the most popular applications on new systems. In the analyses presented in this paper we use applications that are widely used on current open science HPC systems. We characterize the performance of these applications across a spectrum of modern processors and then create a mathematical model to predict their behavior on possible future processors. The hardware sensitivity studies required to build the predictive model are carried out in an HPC cloud resource with bare metal access, and we describe the process and advantages of this approach in detail. We define and discuss the …", "num_citations": "5\n", "authors": ["1966"]}
{"title": "Benchmarking the Intel® Xeon® Platinum 8160 Processor\n", "abstract": " This report presents a set of results for different microbenchmarks and applications on the Intel Xeon Platinum 8160 Processor, formerly known as Skylake. For simplicity, we will use both Skylake and SKX to refer to this processor. We use the Skylake nodes that will be available in Stampede2. This system will provide Intel Knights Landing and Skylake chips interconnected by a 100 Gb/sec Intel Omni-Path (OPA) network with a fat tree topology. The peak performance of the system will be 18 PF.", "num_citations": "4\n", "authors": ["1966"]}
{"title": "Mutations In The Amino Terminus of Herpes Simplex Virus Type 1 gL Can Reduce Cell-Cell Fusion Without Affecting gH/gLTrafficking\n", "abstract": " The gH/gL heterodimer represents two of the four herpes simplex virus glycoproteins necessary and sufficient for membrane fusion. We generated deletions and point mutations covering gL residues 24 to 43 to investigate that region's role in gH/gL intracellular trafficking and in membrane fusion. Multiple mutants displayed a 40 to 60% reduction in cell fusion with no effect on gH/gL trafficking. The amino terminus of gL plays an important role in the gH/gL contribution to membrane fusion.", "num_citations": "3\n", "authors": ["1966"]}
{"title": "Energy, fine structure, and hyperfine structure of the core-excited states 1s2s2pnp 5P (n= 2–5) and 1s2p2mp 5S (m= 2–5) for Li-ion\n", "abstract": " The relativistic energies, the oscillator strength, and  the lifetimes of high-lying core-excited states 1s2s2pnp 5P (n=2–5) and  1s2p2mp 5So (m=2–5) of Li- ion are calculated with the  saddle-point variational method and restricted variation method. The fine  structure and the hyperfine structure of the core-excited states for this  system are also explored. The results are compared with other theoretical  and experimental data in the literature.", "num_citations": "3\n", "authors": ["1966"]}
{"title": "Kirkwood–Buff-Derived Force Field for Peptides and Proteins: Philosophy and Development of KBFF20\n", "abstract": " A new classical nonpolarizable force field, KBFF20, for the simulation of peptides and proteins is presented. The force field relies heavily on the use of Kirkwood–Buff theory to provide a comparison of simulated and experimental Kirkwood–Buff integrals for solutes containing the functional groups common in proteins, thus ensuring intermolecular interactions that provide a good balance between the peptide–peptide, peptide–solvent, and solvent–solvent distributions observed in solution mixtures. In this way, it differs significantly from other biomolecular force fields. Further development and testing of the intermolecular potentials are presented here. Subsequently, rotational potentials for the ϕ/ψ and χ dihedral degrees of freedom are obtained by analysis of the Protein Data Bank, followed by small modifications to provide a reasonable balance between simulated and observed α and β percentages for small …", "num_citations": "1\n", "authors": ["1966"]}
{"title": "Leveraging DiaGrid hub for interactively generating and running parallel programs\n", "abstract": " Interactive Parallelization Tool (IPT) is a semi-automatic tool that can be used by domain experts and students for transforming certain classes of existing applications into multiple parallel variants. An end-user of IPT provides existing application and high-level specifications for parallelization as input. On the basis of the specifications provided by the end-user, IPT carries out the code changes in the given existing application to generate parallel variants that can be run on different High Performance Computing (HPC) platforms. The parallel programming paradigms that are currently supported by IPT are MPI, OpenMP, and CUDA. The supported base languages are C and C++. Though IPT is still under active development, it has been recently made available on a web-enabled platform, named DiaGrid Hub, with the support from the XSEDE Extended Collaborative Support Service (ECSS). While the main goal of IPT …", "num_citations": "1\n", "authors": ["1966"]}