{"title": "HERMES: an infrastructure for low area overhead packet-switching networks on chip\n", "abstract": " The increasing complexity of integrated circuits drives the research of new on-chip interconnection architectures. A network on chip draws on concepts inherited from distributed systems and computer networks subject areas to interconnect IP cores in a structured and scalable way. The main goal pursued is to achieve superior bandwidth when compared to conventional on-chip bus architectures. This paper reviews the state of the art in networks on chip. Then, it describes an infrastructure called Hermes, targeted to implement packet-switching mesh and related interconnection architectures and topologies. The basic element of Hermes is a switch with five bi-directional ports, connecting to four other switches and to a local IP core. The switch employs an XY routing algorithm, and uses input queuing. The main design objective was to develop a small size switch, enabling its immediate practical use. The paper also …", "num_citations": "779\n", "authors": ["519"]}
{"title": "Heuristics for dynamic task mapping in NoC-based heterogeneous MPSoCs\n", "abstract": " Multiprocessor Systems-on-Chip (MPSoCs) is a trend in VLSI design, since they minimize the \"design crisis \" (gap between silicon technology and actual SoC design capacity) and reduce the time to market. Important issues in MPSoC design are the communication infrastructure and task mapping. MPSoCs may employ NoCs to integrate multiple programmable processor cores, specialized memories, and other IPs in a scalable way. Applications running in MPSoCs execute a varying number of tasks simultaneously, and their number may exceed the available resources, requiring task mapping to be executed at runtime to meet real-time constraints. Most works in the literature present static MPSoC mapping solutions. Static mapping defines a fixed placement and scheduling, not appropriate for dynamic workloads. Task migration has also been proposed for use in MPSoCs, with the goal to relocate tasks when …", "num_citations": "201\n", "authors": ["519"]}
{"title": "Dynamic task mapping for MPSoCs\n", "abstract": " Multiprocessor-system-on-a-chip (MPSoC) applications can consist of a varying number of simultaneous tasks and can change even after system design, enforcing a scenario that requires the use of dynamic task mapping. This article investigates dynamic task-mapping heuristics targeting reduction of network congestion in network-on-chip (NoC)-based MPSoCs. The proposed heuristics achieve up to 31% smaller channel load and up to 22% smaller packet latency than other heuristics.", "num_citations": "179\n", "authors": ["519"]}
{"title": "Virtual channels in networks on chip: implementation and evaluation on hermes NoC\n", "abstract": " Networks on chip (NoCs) draw on concepts inherited from distributed systems and computer networks subject areas to interconnect IP cores in a structured and scalable way. Congestion in NoCs reduces the overall system performance. This effect is particularly strong in networks where a single buffer is associated with each input channel, which simplifies router design, but prevents packets from sharing a physical channel at any given instant of time. The goal of this work is to describe the implementation of a mechanism to reduce performance penalization due to packet concurrence for network resources in NoCs. One way to reduce congestion is to multiplex a physical channel using virtual channels (VCs). VCs reduce latency and increase network throughput. The insertion of VCs also enables to implement policies for allocating the physical channel bandwidth, which enables to support quality of service (QoS) in …", "num_citations": "168\n", "authors": ["519"]}
{"title": "A scalable test strategy for network-on-chip routers\n", "abstract": " Network-on-chip has recently emerged as alternative communication architecture for complex system chip and different aspects regarding NoC design have been studied in the literature. However, the test of the NoC itself for manufacturing faults has been marginally tackled. This paper proposes a scalable test strategy for the routers in a NoC, based on partial scan and on an IEEE 1500-compliant test wrapper. The proposed test strategy takes advantage of the regular design of the NoC to reduce both test area overhead and test time. Experimental results show that a good tradeoff of area overhead, fault coverage, test data volume, and test time is achieved by the proposed technique. Furthermore, the method can be applied for large NoC sizes and it does not depend on the network routing and control algorithms, which makes the method suitable to test a large class of network models", "num_citations": "153\n", "authors": ["519"]}
{"title": "HeMPS-a framework for NoC-based MPSoC generation\n", "abstract": " Multi-processor systems-on-chip (MPSoCs) are increasingly popular in embedded systems. Due to their complexity and huge design space to explore for such systems, CAD tools and frameworks to customize MPSoCs are mandatory. Some academic and industrial frameworks are available to support bus-based MPSoCs, but few works target NoCs as underlying communication architecture. A framework targeting MPSoC customization must provide abstract models to enable fast design space exploration, flexible application mapping strategies, all coupled to features to evaluate the performance of running applications. This paper proposes a framework to customize NoC-based MPSoCs with support to static and dynamic task mapping and C/SystemC simulation models for processors and memories. A simple, specifically designed microkernel executes in each processor, enabling multitasking at the processor …", "num_citations": "148\n", "authors": ["519"]}
{"title": "Exploring NoC mapping strategies: an energy and timing aware technique\n", "abstract": " Complex applications implemented as systems on chip (SoC) demand extensive use of system level modeling and validation. Their implementation gathers a large number of complex IP cores and advanced interconnection schemes, such as hierarchical bus architectures or networks on chip (NoC). Modeling applications involves capturing its computation and communication characteristics. Previously proposed communication weighted models (CWM) consider only the application communication aspects. This work proposes a communication dependence and computation model (CDCM) that can simultaneously consider both aspects of an application. It presents a solution to the problem of mapping applications on regular NoC while considering execution time and energy consumption. The use of CDCM is shown to provide estimated average reductions of 40% in execution time, and 20% in energy consumption …", "num_citations": "121\n", "authors": ["519"]}
{"title": "MAIA: a framework for networks on chip generation and verification\n", "abstract": " The increasing complexity of SoCs makes networks on chip (NoC) a promising substitute for busses and dedicated wires interconnection schemes. However, new tools need to be developed to integrate NoC interconnection architectures and IP cores into SoCs. Such tools have to fulfill three main requirements:(i) automated NoC generation;(ii) automated production of NoC-IP core interfaces;(iii) seamless analysis of NoC traffic parameters. The objective of this paper is to present the MAIA framework, which includes functions to address all these requirements. NoCs generated by the MAIA framework have been used to successfully prototype SoCs in FPGAs.", "num_citations": "100\n", "authors": ["519"]}
{"title": "Congestion-aware task mapping in heterogeneous MPSoCs\n", "abstract": " Multiprocessors systems-on-chip (MPSoCs) are a trend in VLSI design, since they minimize the design crisis represented by the gap between the silicon technology and the actual SoC design capacity. MPSoCs may employ NoCs to integrate several programmable processors, specialized memories, and other specific IPs in a scalable way. Besides communication infrastructure, another important issue in MPSoCs is task mapping. Dynamic task mapping is needed, since the number of tasks running in the MPSoC may exceed the available resources. Most works in literature present static mapping solutions, not appropriate for this scenario. This paper investigates the performance of mapping algorithms in NoC-based heterogeneous MPSoCs, targeting NoC congestion minimization. The use of the proposed congestion-aware heuristics reduces the NoC channel load, congestion, and packet latency.", "num_citations": "92\n", "authors": ["519"]}
{"title": "Integrating the teaching of computer organization and architecture with digital hardware design early in undergraduate courses\n", "abstract": " This paper describes a new way to teach computer organization and architecture concepts with extensive hands-on hardware design experience very early in computer science curricula. While describing the approach, it addresses relevant questions about teaching computer organization, computer architecture and hardware design to students in computer science and related fields. The justification to concomitantly teach two often separately addressed subjects is twofold. First, to provide a better insight into the practical aspects of computer organization and architecture. Second, to allow addressing only highly abstract design levels yet achieving reasonably performing implementations, to make the integrated teaching approach feasible. The approach exposes students to many of the essential issues incurred in the analysis, simulation, design and effective implementation of processors. Although the former …", "num_citations": "87\n", "authors": ["519"]}
{"title": "Remote and Partial Reconfiguration of FPGAs: tools and trends\n", "abstract": " This work describes the implementation of digital reconfigurable systems (DRS) using commercial FPGA devices. This paper has three main goals. The first one is to present the trend of DRS, highlighting the problems and solutions of each DRS generation. The second goal is to present in detail the configuration architecture of a commercial FPGA family allowing DRS implementation. The last goal is to present a set of tools for remote and partial reconfiguration developed for this FPGA family. Even though the tools are targeted to a specific device, their building principles may easily be adapted to other FPGA families, if they have an internal architecture enabling partial reconfiguration. The main contribution of the paper is the tool-set proposed to manipulate cores using partial reconfiguration in existing FPGA.", "num_citations": "86\n", "authors": ["519"]}
{"title": "Evaluation of routing algorithms on mesh based nocs\n", "abstract": " The increasing complexity of integrated circuits drives the research of new on-chip interconnection architectures. Networks-on-chip (NoCs) are a candidate architecture to be used in future systems, due to its increased performance, reusability and scalability. A NoC is a set of interconnected switches, with IP cores connected to these switches. Four main components compose a switch: a router, to define a path between input and output switch ports; an arbiter, to grant access to a given port when multiple input requests arrive in parallel; buffers, to store intermediate data, and a flow control module to regulate the data transfer to the next switch. The goal of this work is to compare the performance of four routing algorithms for mesh based packet switching NoCs. Differently from the literature for generic networks, it is shown that deterministic algorithms can be superior to adaptive ones in NoCs.", "num_citations": "82\n", "authors": ["519"]}
{"title": "Comparison of network-on-chip mapping algorithms targeting low energy consumption\n", "abstract": " One relevant problem in current SoC design is the mapping of modules on a network-on-chip (NoC) targeting low energy consumption. In order to solve this mapping problem, several models are available to capture computation and communication characteristics of applications. The main goal of this article is to propose and compare algorithms for obtaining low energy mappings onto NoCs using a communication-weighted model (CWM). These include from exhaustive search to stochastic search methods and heuristic approaches, plus pertinent combinations. Two new heuristics are proposed, called largest communication first (LCF) and greedy incremental (GI). In addition, it describes algorithms that provide specially designed combinations of LCF with simulated annealing and tabu search. The use of LCF and combined approaches compared with pure stochastic algorithms provides average reductions above …", "num_citations": "76\n", "authors": ["519"]}
{"title": "Traffic generation and performance evaluation for mesh-based NoCs\n", "abstract": " The designer of a system on a chip (SoC) that connects IP cores through a network on chip (NoC) needs methods to support application performance evaluation. Two key aspects these methods have to address are the generation and evaluation of network traffic. Traffic generation allows injecting packets in the network according to application constraint specifications such as transmission rate and end-to-end latency. Performance evaluation helps in computing latency and throughput at network channels/interfaces, as well as to identify congestion and hot-spots. This paper reviews related works in traffic generation and performance evaluation for mesh topology NoCs, and proposes general methods for both aspects. Three parameters are used here to define traffic generation: packet spatial distribution, packet injection rate and packet size. Two types of methods to evaluate performance in NoCs are discussed:(i …", "num_citations": "64\n", "authors": ["519"]}
{"title": "A Low Area Overhead Packet-switched Network on Chip: Architecture and Prototyping\n", "abstract": " The increasing complexity of integrated circuits drives the research of new intra-chip interconnection architectures. A network-on-chip adapts concepts originated in the distributed systems and computer networks subject areas to connect IP cores in a structured and scalable way, pursuing the goal of achieving superior bandwidth to conventional intra-chip bus architectures. This paper presents the design of a switch targeted to a mesh interconnection topology. Each switch has 5 bi-directional ports, connecting 4 neighbor switches and a local IP core. They employ a XY routing algorithm, with input queue buffers. The main objective is to develop a switch with a small area, enabling its immediate practical use. The switch and a 2x2 mesh network were validated through functional simulation. Also the network has been successfully prototyped in hardware, using a million-gate FPGA.", "num_citations": "63\n", "authors": ["519"]}
{"title": "Distributed Resource Management in NoC-Based MPSoCs with Dynamic Cluster Sizes\n", "abstract": " Scalability is an important issue in large MPSoCs. MPSoCs may execute several applications in parallel, with dynamic workload, and tight QoS constraints. Thus, the MPSoC management must be distributed to cope with such constraints. This paper presents a distributed resource management in NoC-Based MPSoC, using a clustering method, enabling the modification of the cluster size at runtime. This work addresses the following distributed techniques: task mapping, monitoring and task migration. Results show an important reduction in the total execution time of applications, reduced number of hops between tasks (smaller communication energy), and a reclustering method through monitoring and task migration.", "num_citations": "62\n", "authors": ["519"]}
{"title": "From VHDL register transfer level to SystemC transaction level modeling: a comparative case study\n", "abstract": " Transaction level (TL) modeling is regarded today as the next step in the direction of complex integrated circuits and systems design entry. This means that as this modeling level definition evolves, automated synthesis tools will increasingly support it, allowing design capture to start at a higher abstraction level than today. This work presents a comparison of traditional register transfer level (RTL) modeling and transaction level modeling through the implementation of a simple processor case study. SystemC is a language that naturally supports hardware transaction level descriptions. The R8 processor was described in SystemC TL and RTL versions and these were compared to an equivalent hand-coded VHDL RTL description in some key points, such as simulation efficiency and implementation results. The experiments indicate that TL descriptions present a faster path to system validation and that it is possible to …", "num_citations": "61\n", "authors": ["519"]}
{"title": "NoC power estimation at the RTL abstraction level\n", "abstract": " The increasing use of mobile electronic devices forces the design of integrated circuits to consider low power techniques. Current power estimation models for NoCs capitalize mostly in the volume of information transmitted through the network. This work presents a more precise NoC power estimation model, based in buffer reception rates, according to the traffic scenario applied to the network. Results show the accuracy of the model compared to industrial power estimation tools, with reduced execution time. The proposed method allows exploring the NoC design space, being employed to evaluate the benefit on using the multicast service.", "num_citations": "58\n", "authors": ["519"]}
{"title": "Topology-Agnostic Fault-Tolerant NoC Routing Method\n", "abstract": " Routing algorithms for NoCs were extensively studied in the last 12 years, and proposals for algorithms targeting some cost function, as latency reduction or congestion avoidance, abound in the literature. Fault-tolerant routing algorithms were also proposed, being the table-based approach the most adopted method. Considering SoCs with hundred of cores in a near future, features as scalability, reachability, and fault assumptions should be considered in the fault-tolerant routing methods. However, the current proposals some have some limitations: (1) increasing cost related to the NoC size, compromising scalability; (2) some healthy routers may not be reached even if there is a source-target path; (3) some algorithms restricts the number of faults and their location to operate correctly. The present work presents a method, inspired in VLSI routing algorithms, to search the path between source-target pairs where the …", "num_citations": "55\n", "authors": ["519"]}
{"title": "Core Communication Interface for FPGAs\n", "abstract": " The use of pre-designed and pre-verified hardware modules, also called IP cores, is an important part of the effort to design and implement complex systems. However, many aspects of IP core manipulation are still to be developed. This paper presents an approach to solve problems related to the dynamic interconnection of hard IP cores. The approach targets system-on-a-chip designs build in a single FPGA device. The paper proposes a communication interface that allows IP core replacement during FPGA normal operation. The same interface also allows communication among distinct IP cores to take place.", "num_citations": "54\n", "authors": ["519"]}
{"title": "PADREH-a framework for the design and implementation of dynamically and partially reconfigurable systems\n", "abstract": " Dynamically and Partially Reconfigurable Systems (DRSs) are those where any portion of the hardware behavior can be altered at application execution time. These systems have the potential to provide hardware with flexibility similar to that of software, while leading to better performance and smaller system size. However, the widespread acceptance of DRSs depends on adequate support to design and implement them. This work proposes a framework for DRS design and implementation named PADReH. The approach is compared to other propositions available in the literature. The first steps of the framework implementation are described, involving methods and tools to control the hardware reconfiguration process and the generation of partial bitstreams. The main contribution of the work is to provide means to systematically reduce the lack of support currently hampering the adoption of DRSs as a …", "num_citations": "53\n", "authors": ["519"]}
{"title": "Energy-aware dynamic task mapping for NoC-based MPSoCs\n", "abstract": " To cope with the dynamic workload of actual NoC-based MPSoCs, dynamic mechanisms are required to guarantee the application requirements. Application mapping may drastically influence the system performance and the energy consumption, which can be crucial to the success (or failure) of a product, even more for battery-powered embedded systems. In this context, the current work presents an energy-aware dynamic task mapping heuristic, which was evaluated in a real NoC-based MPSoC platform. Results show that the proposed heuristic may reduces up to 22.8% of the communication energy consumption compared to other dynamic mapping heuristics.", "num_citations": "51\n", "authors": ["519"]}
{"title": "A physical synthesis design flow based on virtual components\n", "abstract": " This paper presents a virtual library design flow for automatic layout synthesis tools. The motivation to develop such design flow is to enable the use of static CMOS complex gates (SCCGs), to optimize area and delay at the logic and physical abstraction levels. The use of SCCGs increases the design space (number of different primitive cells) when compared to the state-of-the-art cell based approaches. Therefore, a new design flow is defined, which replaces cell libraries by virtual components, creating in this way a virtual library. We present the procedure to create such virtual library in the Synopsys environment, and to integrate logic synthesis tools in automatic layout synthesis.", "num_citations": "51\n", "authors": ["519"]}
{"title": "Impact of C-elements in asynchronous circuits\n", "abstract": " Asynchronous circuits are a potential solution to address some of the obstacles in deep submicron (DSM) design. One of the most frequently used devices to build asynchronous circuits is the C-element, a device present as a basic building block in several asynchronous design styles. This work measures the impact of three different C-element types. The paper compares the use of each implementation to build a real case asynchronous circuit, an RSA cryptographic core, and reports results of precise electrical simulations of each C-element. Findings in this work show that previous results in the literature about C-element implementation types must be re-evaluated when using C-elements in DSM technologies.", "num_citations": "48\n", "authors": ["519"]}
{"title": "Power-aware dynamic mapping heuristics for NoC-based MPSoCs using a unified model-based approach\n", "abstract": " The mapping of tasks to processing elements of an MPSoC has critical impact on system performance and energy consumption. To cope with complex dynamic behavior of applications, it is common to perform task mapping during runtime so that the utilization of processors and interconnect can be taken into account when deciding the allocation of each task. This paper has two major contributions, one of them targeting the general problem of evaluating dynamic mapping heuristics in NoC-based MPSoCs, and another focusing on the specific problem of finding a task mapping that optimizes energy consumption in those architectures.", "num_citations": "47\n", "authors": ["519"]}
{"title": "Router architecture for high-performance NoCs\n", "abstract": " A considerable number of NoC designs are available, focusing on different aspects of this type of communication infrastructure. Example of relevant aspects considered during NoC design are quality-of-service achievement, the choice of synchronization method to employ between routers, power consumption reduction and application modules mapping. However, some design choices are common to many if not most NoC proposals: wormhole packet switching and the use of virtual channels. This work dis-cusses trade-offs on using circuit and packet switching, arguing in favor of the former with fixed packet size. Next, it proposes and justifies the replacement of virtual channels by replicated channels, based on the abundance of wires expected in current and future deep sub-micron technologies. Finally, the work proposes the use of a session layer coupled to circuit switching. Results point out to reduced latency …", "num_citations": "47\n", "authors": ["519"]}
{"title": "Wrapper design for the reuse of a bus, network-on-chip, or other functional interconnect as test access mechanism\n", "abstract": " A new core test wrapper design approach is proposed which transports streaming test data, for example scan test patterns, into and out of an embedded core exclusively via (some of) its functional data ports. The latter are typically based on standardised protocols such as AXI, DTL, and OCP. The new wrapper design allows a functional interconnect, such as an on-chip bus or network-on-chip (NOC) to transport test data to embedded cores, and hence eliminates the need for a conventional dedicated test access mechanism (TAM), such as a TestRail or test bus. The approach leaves both the tester, as well as the embedded core and its test unchanged, while the functional interconnect can handle the test data transport as a regular data application. The functional interconnect is required to offer guaranteed throughput and zero latency variation, a service that is available in many buses and networks. For 672 example …", "num_citations": "47\n", "authors": ["519"]}
{"title": "Application driven traffic modeling for NoCs\n", "abstract": " The network on chip (NoC) design process requires an adequate characterization of the application running on it to optimize communication resources utilization and dimensioning. The traffic modeling process is the most essential step for characterizing complex applications. It is possible to identify three methods to model traffic in NoC literature. The first one assumes sources continually send data at a constant rate to the network and it is the most commonly used. The second method employs probabilistic functions to model the traffic behavior for typical applications, as audio and video streams. The accuracy of this method is better, at the extra cost of modeling complexity and simulation time. The third method employs traffic traces to evaluate network performance. Even with small traces, simulation time can be prohibitive. The advantage is accuracy, superior to the previous models. Even if a given application is …", "num_citations": "47\n", "authors": ["519"]}
{"title": "Multi-task dynamic mapping onto NoC-based MPSoCs\n", "abstract": " Task mapping defines the best placement of a given task in the MPSoC, according to some criteria, as energy or Manhattan distance minimization. The ITRS roadmap forecast in a near future MPSoCs with hundreds of processing elements (PEs). Therefore, dynamic mapping heuristics are required. An important gap is observed in the mapping literature: the lack of proposals targeting multi-task dynamic mapping. In this context, the present work proposes an energy-aware dynamic task mapping heuristic, allowing multiple tasks allocation per PE. Experimental results are executed in an actual MPSoC running distributed applications. Comparing a single-task to the multi-task mapping, the energy spent in the NoC is reduced in average by 51%(best case: 72%), with an average execution time overhead of 18%. Besides the communication energy reduction, the multi-task mapping enables a greater number of …", "num_citations": "46\n", "authors": ["519"]}
{"title": "Wrapper design for the reuse of networks-on-chip as test access mechanism\n", "abstract": " This paper proposes a wrapper design for interconnects with guaranteed bandwidth and latency services and on-chip protocol. We demonstrate that these interconnects abstract the interconnect details and provide predictability in the data transfer, which are desirable not only for the functional domain but also for the test application. The proposed wrapper is implemented in VHDL and integrated to the Ethereal NoC. The results show the impact of bandwidth in the core test time. The wrapper area and core test time are compared with a wrapper design for dedicated TAM", "num_citations": "46\n", "authors": ["519"]}
{"title": "Evaluating the impact of task migration in multi-processor systems-on-chip\n", "abstract": " This paper presents a Multi-Processor System-on-Chip platform which is capable of load balancing at run-time. The system is purely distributed in the sense that each processor is capable of making decisions on its own, without having relying by any central unit. All the management is ensured by a very tiny preemptive RTOS (run-time operating system) running on every processor which is mainly responsible for running and distributing tasks among the processing elements (PEs). The goal of such strategy is to improve the performance of the system while ensuring scalability of the design. In order to validate the concepts, we have conducted some experiments with a widely used multimedia application: the MJPEG (Motion JPEG) decoder. Obtained results show that the overhead caused by the task migration mechanism is amortized by the gain in term of performance.", "num_citations": "45\n", "authors": ["519"]}
{"title": "Communication models in networks-on-chip\n", "abstract": " Networks-on-chip, or NoCs, are one communication architecture candidate to be used in present and future SoCs, due to its scalability, reusability and performance. The focus of this paper is the analysis of IP communication models in NoCs. Employing standard external interfaces, as OCP, is recommended to enable the use of NoCs by different IP core providers. The second point related to reusability is the IP cores communication model. Two basic communication models are considered in this work: NUMA and NORMA. The goal of this work is to evaluate the pros and cons of each communication model, in terms of network interface complexity, area and performance.", "num_citations": "45\n", "authors": ["519"]}
{"title": "SCAFFI: An intrachip FPGA asynchronous interface based on hard macros\n", "abstract": " Building fully synchronous VLSI circuits is becoming less viable as circuit geometries evolve. However, before the adoption of purely asynchronous strategies in VLSI design, globally asynchronous, locally synchronous (GALS) design approaches should take over. The design of circuits using complex field programmable components like state of the art FPGAs follows this same trend. In GALS design, a critical step is the definition of asynchronous interfaces between synchronous regions. This paper proposes SCAFFI, a new asynchronous interface to interconnect modules inside FPGAs. The interface is based on clock stretching techniques to avoid metastability. Differently from other interfaces, it can use both logic levels for stretching and do not require the use of arbiters. Also, compactness of the implementation is enhanced by the use of dedicated FPGA hard macros. A GALS version implementation of an RSA …", "num_citations": "44\n", "authors": ["519"]}
{"title": "Evaluation of static and dynamic task mapping algorithms in NoC-based MPSoCs\n", "abstract": " Task mapping is an important issue in MPSoC design. Most recent mapping algorithms perform them at design time, an approach known as static mapping. Nonetheless, applications running in MPSoCs may execute a varying number of simultaneous tasks. In some cases, applications may be defined only after system design, enforcing a scenario that requires the use of dynamic task mapping. Static mappings have as main advantage the global view of the system, while dynamic mappings normally provide a local view, which considers only the neighborhood of the mapping task. This work aims to evaluate the pros and cons of static and dynamic mapping solutions. Due to the global system view, it is expected that static mapping algorithms achieve superior performance (w.r.t. latency, congestion, energy consumption). As dynamic scenarios are a trend in present MPSoC designs, the cost of dynamic mapping …", "num_citations": "42\n", "authors": ["519"]}
{"title": "Deadlock-free multicast routing algorithm for wormhole-switched mesh networks-on-chip\n", "abstract": " An important service in distributed systems, as multi-processors, is the ability to transmit multicast messages. Cache coherence protocols and parallel algorithms are examples of applications requiring multicast messages. To transmit a multicast message to n targets, in networks-on-chip without multicast service, the source router must transmit n identical messages. Few works in the literature describe multicasting in NoCs. The goal of this work is to implement a deadlock free routing algorithm for wormhole-switched mesh NoCs, enabling to transmit simultaneous multicast messages. The dual-path multicast algorithm, used in multicomputers, is adapted to NoCs in this work. The dual-path multicast algorithm is implemented for circuit and packet switching. The evaluation comprises: (i) comparison between the algorithms; (ii) NoC performance as a function of the percentage of injected multicast messages; (iii …", "num_citations": "42\n", "authors": ["519"]}
{"title": "Exploring NoC-based MPSoC design space with power estimation models\n", "abstract": " This model-based methodology and supporting toolset lets designers estimate application-specific network-on-chip (NoC) power dissipation at early stages of the design flow. An actor-oriented simulation framework captures the NoC's dynamic behavior and feeds its parameters to a rate-based power estimation model. Integrating this model into the proposed design flow enables the analysis of different design parameters and the identification of the most power-efficient application platform mappings.", "num_citations": "40\n", "authors": ["519"]}
{"title": "Evaluation of current QoS mechanisms in networks on chip\n", "abstract": " Several propositions of NoC architectures claim to provide quality of service (QoS) guarantees, which is essential for e.g. real time and multimedia applications. The most widespread approach to attain some degree of QoS guarantee relies on a two-step process. The first step is to characterize application performance through traffic modeling and simulation. The second step consists in tuning a given network template to achieve some degree of QoS guarantee. These QoS targeted NoC templates usually provide specialized structures to allow either the creation of connections (circuit switching) or the assignment of priorities to connectionless flows. It is possible to identify three drawbacks in this approach. First, it is not possible to guarantee QoS for new applications expected to run on the system, if those are defined after the network design phase. Second, even with end-to-end delay guarantees, connectionless …", "num_citations": "33\n", "authors": ["519"]}
{"title": "A heterogeneous and distributed co-simulation environment [hardware/software]\n", "abstract": " This paper presents the implementation and evaluation of a hardware and software co-simulation tool. Different simulators, which can be geographically distributed, compose this environment. The communication between simulators is done using a co-simulation backplane. The co-simulation backplane reads a file describing how the modules are connected, automatically launches the simulators and controls the simulation process. A case study is used as a benchmark to validate the implementation and to evaluate the system performance using different hardware-software partitions.", "num_citations": "33\n", "authors": ["519"]}
{"title": "Current mask generation: a transistor level security against DPA attacks\n", "abstract": " The physical implementation of cryptographic algorithms may leak to some attacker security information by the side channel data, as power consumption, timing, temperature or electromagnetic emanation. The differential power analysis (DPA) is a powerful side channel attack, based only on the power consumption information. There are some countermeasures proposed at algorithmic or architectural level that are expensive and/or complexes. This paper addresses the DPA attack problem by a novel and efficient transistor-level method based on a power consumption control, without any modification on the cryptographic algorithms, messages or keys", "num_citations": "31\n", "authors": ["519"]}
{"title": "Mapping embedded systems onto NoCs: the traffic effect on dynamic energy estimation\n", "abstract": " This work addresses the problem of application mapping in networks-on-chip (NoCs). It explores the importance of characterizing network traffic to effectively predict NoC energy consumption. Traffic is seen as an important factor affecting the problem of mapping applications into NoCs having as goal to minimize the total dynamic energy consumption of a complex system-on-a-chip (SoC). Experiments showed that failing to consider the bit transitions influence on traffic inevitably leads to an energy estimation error. This error is proportional to the amount of bit transitions in transmitted packets. In applications that present a large number of packets exchange, the error is propagated, significantly affecting the mapping results. This paper proposes a high-level application model that captures the traffic effect and uses it to describe the behavior of applications. In order to evaluate the quality of the proposed model, a set of …", "num_citations": "31\n", "authors": ["519"]}
{"title": "Using the CAN protocol and reconfigurable computing technology for Web-based smart house automation\n", "abstract": " This paper presents the hardware implementation of a multiplatform control system for house automation using FPGAs. Such a system belongs to a domain usually named domotics or smart house systems. The approach combines hardware and software technologies. The system is controlled through the Internet and the home devices being connected use the CAN control protocol. Users can remotely control their houses using a Web browser (client). Locally, instructions received from the client are translated by the server, which distributes the commands to the domestic appliances. The implemented system has the following characteristics, which distinguish it from existing approaches: (i) the client interface is automatically updated; (ii) a standard communication protocol (CAN) is used in the hardware implementation, providing reliability and error control; (iii) new appliances are easily inserted in the system; (iv …", "num_citations": "31\n", "authors": ["519"]}
{"title": "Differentiated Communication Services for NoC-Based MPSoCs\n", "abstract": " The adoption of Networks-on-Chip (NoCs) as the communication infrastructure for complex integrated systems is a fact, and has been promoted by the growing number of processing elements integrated in current MPSoCs. These are designed to execute several applications in parallel, with different communication requirements and distinct levels of required quality of service. To meet these restrictions, most designs customize the MPSoC at design time, using specific NoC communication services as adaptive routing algorithms, priorities, and connections. However, MPSoCs are increasingly used in embedded systems, where new applications may be added at runtime, characterizing dynamic workload scenarios. Such scenarios require adaptability at runtime, with applications having the possibility to select the most appropriate communication service according to their respective requirements. The goal of the …", "num_citations": "30\n", "authors": ["519"]}
{"title": "Adapting a C-element design flow for low power\n", "abstract": " The interest in non-synchronous design of digital circuits is growing due to technology scaling into deep submicron transistor geometries and to the problems this scaling causes to keep synchronous design advantageous. To enable most non-synchronous styles, the C-element is a fundamental device that has to be available as logic primitive. A recently proposed design flow improved a standard cell library, adding to it a set of typical asynchronous cells. However, the original flow did not address low power cells explicitly, which is a requirement in many modern applications. This paper proposes the extension of the flow so that it can expand the cell set with low power components. To achieve this, the paper adds a new degree of freedom to cell design. The new standard cell set encompasses over 500 different C-element implementations. The cell set employs a 65nm commercial CMOS process and is fully …", "num_citations": "30\n", "authors": ["519"]}
{"title": "Reducing test time with processor reuse in network-on-chip based systems\n", "abstract": " This paper proposes a test planning method capable of reusing available processors as test sources and sinks, and the on-chip network as the access mechanism for the test of cores embedded into a system on chip. The resulting test time of the system is evaluated considering the number of reused processors, the number of external interfaces, and power dissipation. Experimental results for a set of industrial examples based on the ITC'02 benchmarks show that the cooperative use of both the on-chip network and the embedded processors can increase the test parallelism and reduce the test time.", "num_citations": "30\n", "authors": ["519"]}
{"title": "Power consumption reduction in MPSoCs through DFS\n", "abstract": " The use of power management techniques is mandatory in embedded devices, which must provide high performance with low energy consumption. Due to the high variability present in the applications workload executed by these devices, this management should be executed dynamically. The use of traditional dynamic voltage and frequency scaling (DVFS) techniques proved to be useful in several scenarios to save energy. Nonetheless, due to technology scaling that limits the voltage variation and slow response of the DVFS schemes, the use of such technique may become inadequate. As alternative, the use of dynamic frequency scaling (DFS) may provide a good trade-off between power savings and power overhead. This paper proposes a distributed DFS scheme for NoC-based MPSoCs. Both NoC and PEs have an individual controlling scheme. The DFS scheme for PEs takes into account its computation …", "num_citations": "29\n", "authors": ["519"]}
{"title": "Hermes-AA: A 65nm asynchronous NoC router with adaptive routing\n", "abstract": " This work presents the architecture and ASIC implementation of Hermes-AA, a flexible fully asynchronous network on chip router employing an adaptive routing algorithm. Hermes-AA enables communication between router and synchronous processing elements. The ASIC implementation of the router employed standard CAD tools and a specifically developed library of standard cell components. Area and timing characteristics for 65nm technology attest the quality of the design, which displays a maximum aggregated throughput of 7.75 Gbits/s.", "num_citations": "29\n", "authors": ["519"]}
{"title": "Hermes-A–an asynchronous NoC router with distributed routing\n", "abstract": " This work presents the architecture and ASIC implementation of Hermes-A, an asynchronous network on chip router. Hermes-A is coupled to a network interface that enables communication between router and synchronous processing elements. The ASIC implementation of the router employed standard CAD tools and a specific library of components. Area and timing characteristics for 180nm technology attest the quality of the design, which displays a maximum throughput of 3.6 Gbits/s.", "num_citations": "29\n", "authors": ["519"]}
{"title": "DMNI: A specialized network interface for NoC-based MPSoCs\n", "abstract": " Current proposals of NoC-based MPSoC adopt an NI (Network Interface) interconnected to a DMA (Direct Memory Access) module to enable the communication between processors through the NoC. The adoption of both modules decouples computation from communication, and a standard interface at the NI provides an abstract way for designers to connect new cores. However, this architecture is inherited from bus-based architectures and can be optimized, by removing unnecessary interfaces, signals, and registers. This paper presents a specialized communication interface for NoC-based MPSoCs, called DMNI (Direct Memory Network Interface). The DMNI merges the functionalities of the DMA and the NI into a single component, directly connecting the NoC router with the processor memory. To avoid stalls in the communication, the design of the DMNI supports simultaneous packet reception and transmission …", "num_citations": "28\n", "authors": ["519"]}
{"title": "Fast Energy Evaluation of Embedded Applications for Many-core Systems\n", "abstract": " The growing concerns of energy efficiency and performance scalability motivate research in the area of many-core embedded systems. The software development of such systems plays an important role on the system performance, while accounting for a significant part of the total energy consumption. Thus, it becomes imperative to consider the software energy consumption at early stages of the software development. This paper proposes an instruction-driven energy analysis approach that provides an accurate and practical way of evaluating software energy cost at the speed of up to 1.8 MIPS. Results show that the accuracy of our approach varies from 0.06% to 8.05% when compared to a gate-level implementation.", "num_citations": "28\n", "authors": ["519"]}
{"title": "DfT for the reuse of networks-on-chip as test access mechanism\n", "abstract": " This paper presents new DfT modules required to use networks-on-chip as test access mechanism. The paper demonstrates that the proposed DfT modules can be also implemented on top of low cost networks-on-chip, i.e. networks without complex services. The DfT modules, which consist of test wrappers and test pin interfaces, are designed such that both the tester and CUTs transport test data unaware of the network. The DfT modules was analysed in terms of silicon area and test time, considering different network and test configurations.", "num_citations": "28\n", "authors": ["519"]}
{"title": "Inserting data encoding techniques into NoC-based systems\n", "abstract": " This work investigates the reduction of power consumption in networks-on-chip through the reduction of transition activity using data coding schemes. Power macromodels for NoC and encoding modules were built, allowing the estimation of the power consumption as a function of the transition activity at each module input. Power macromodels are embedded in a system model and a set of simulations are performed, analyzing the trade-off between the power savings due to coding schemes versus the power consumption overhead due to the encoding and decoding modules", "num_citations": "28\n", "authors": ["519"]}
{"title": "A virtual CMOS library approach for fast layout synthesis\n", "abstract": " We present a layout synthesis methodology based on the use of virtual CMOS libraries, i.e. using no pre-characterized cells. The proposed methodology is organized around an automatic layout generator, allowing fast on-the-fly implementation of macro-cells. The generator eliminates the need for post-layout compaction procedures and in addition produces parasitic capacitances estimations. Results show that it is possible to quickly generate dense layouts, allowing fast prototyping of logic functions. The proposed method can change the way layout synthesis is seen today, since accurate parasitic evaluation is an important prerequisite for optimized submicronic designs.", "num_citations": "28\n", "authors": ["519"]}
{"title": "Evaluation of algorithms for low energy mapping onto NoCs\n", "abstract": " Systems on chip (SoCs) congregate multiple modules and advanced interconnection schemes, such as networks on chip (NoCs). One relevant problem in SoC design is module mapping onto a NoC targeting low energy. To date, few works are available on design and evaluation of mapping algorithms. The main goal of this work is to propose some algorithms and evaluate its results and performance with regard to low energy NoC mappings. These include exhaustive and stochastic search methods and heuristic approaches, and some combinations. The use of combined approaches compared to pure stochastic algorithms provides average reductions above 98% in execution time, while keeping energy saving within at most 5% of the best results. In addition, one heuristic provided average reductions in execution time above 90% when compared to pure stochastic algorithms, and obtained better energy saving …", "num_citations": "27\n", "authors": ["519"]}
{"title": "Design and prototyping of direct torque control of induction motors in FPGAs\n", "abstract": " This work presents an implementation of a direct torque control (DTC) strategy, which is used to control induction motors. Following a tendency in this research area, the algorithm proposed is implemented in a unique FPGA substrate, which allows for a faster validation and simplifies the control structure. A binary format is used with a variable word-size approach, which permits a reduction in truncation through the calculation processes, resulting in smaller errors without increasing excessively the hardware area in the prototyping step. Matlab is used to validate the algorithm. The calculation error between Matlab's double precision representation and the proposed alternative is small and can be neglected in DTC control.", "num_citations": "27\n", "authors": ["519"]}
{"title": "Congestion-aware task mapping in NoC-based MPSoCs with dynamic workload\n", "abstract": " This work investigates the performance of different mapping algorithms in NoC-based MPSoCs with dynamic workload. The main cost function in mapping algorithms is to optimize the occupation of the NoC links. It is possible to achieve performance gains if the mapping algorithm is able to minimize NoC congestion.", "num_citations": "25\n", "authors": ["519"]}
{"title": "Flexible macrocell layout generator\n", "abstract": " LIRMM - Laboratoire d’Informatique, de Robotique et de Microélectronique de Montpellier - Flexible Macrocell layout Generator Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support Portail Hal-Lirmm Hal-Lirmm - Archives Ouvertes HAL Accueil Consulter Consultation par période Consultation par auteur Consultation par type de publication Consultation par revue Consultation par conférence Consultation par ANR Consultation par discipline Consultation par collections Consultation des derniers dépôts Rechercher Déposer Outils Idées reçues... Rapport HCÉRES lirmm-00241344, version 1 Communication dans un congrès Flexible Macrocell layout Generator Fernando Moraes 1, 2 Nadine Azemard 3 …", "num_citations": "25\n", "authors": ["519"]}
{"title": "Predictive dynamic frequency scaling for multi-processor systems-on-chip\n", "abstract": " This paper proposes a novel strategy for optimizing resources in Multi-Processor Systems-on-Chip (MPSoC). The approach is based on using control-loop feedback mechanism to maximize the efficiency on exploiting available resources such as CPU time, operating frequency, etc. Each Processing Element (PE) in the architecture is equipped with a frequency scaling module responsible for tuning the frequency of processors at run-time according to the application requirements. Results show the system's capability of adapting to disturbing conditions. For validation purposes we have implemented a multi-threaded MJPEG decoder together with an ADPCM audio decoder and a FIR.", "num_citations": "24\n", "authors": ["519"]}
{"title": "A new router architecture for High-Performance intrachip networks\n", "abstract": " For almost a decade now, Network on Chip (NoC) concepts have evolved to provide an interesting alternative to more traditional intrachip communication architectures (eg shared busses) for the design of complex Systems on Chip (SoCs). A considerable number of NoC proposals are available, focusing on different sets of optimization aspects, related to specific classes of applications. Each such application employs a NoC as part of its underlying implementation infrastructure. Many of the mentioned optimization aspects target results such as Quality of Service (QoS) achievement and/or power consumption reduction. On the other hand, the use of NoCs brings about the solution of new design problems, such to the choice of synchronization method to employ between NoC routers and application modules mapping. Although the availability of NoC structures is already rather ample, some design choices are at base of many, if not most, NoC proposals. These include the use of wormhole packet switching and virtual channels. This work pledges against this practice. It discusses trade-offs of using circuit or packet switching, arguing in favor the use of the former with fixed size packets (cells). Quantitative data supports the argumentation. Also, the work proposes and justifies replacing the use of virtual channels by replicated channels, based on the abundance of wires in current and expected deep sub-micron technologies. Finally, the work proposes a transmission method coupling the use of session layer structures to circuit switching to better support application implementation. The main reported result is the availability of a router with reduced …", "num_citations": "24\n", "authors": ["519"]}
{"title": "Modeling the traffic effect for the application cores mapping problem onto nocs\n", "abstract": " This work addresses the problem of application mapping in networks-on-chip (NoCs), having as goal to minimize the total dynamic energy consumption of complex system-on-a-chips (SoCs). It explores the importance of characterizing network traffic to predict NoC energy consumption and of evaluating the error generated when the bit transitions influence on traffic is neglected. In applications that present a large amount of packet exchanges the error is propagated, significantly affecting the mapping results. The paper proposes a high-level application model that captures the traffic effect, enabling to estimate the dynamic energy consumption. In order to evaluate the quality of the proposed model, a set of real and synthetic applications were described using both, a previously proposed model that does not capture the bit transition effect, and the model proposed here. Each highlevel application model was …", "num_citations": "23\n", "authors": ["519"]}
{"title": "Reconfiguration control for dynamically reconfigurable systems\n", "abstract": " Dynamically Reconfigurable Systems (DRS), those where the hardware can be changed at runtime, have the potential to enhance hardware flexibility to a degree similar to that of software. At the same time, they may lead to better performance and a smaller system size. However, the widespread acceptance of DRS depends on adequate support to design and implement them. A framework for the design, verification and implementation of DRS named PaDReH has been proposed by the authors as one step forward to reduce this lack of support. One of the main problems for enabling reconfigurable systems is the unavailability of efficient methods to control the hardware reconfiguration process. The main contribution of this paper is the proposition of a configuration controller totally built in hardware. This is different from previous approaches, where software implementations dominate. The proposed controller has been implemented and validated in VirtexII Xilinx FPGAs. The controller has been designed, validated and prototyped successfully.", "num_citations": "23\n", "authors": ["519"]}
{"title": "Implementation and evaluation of a congestion aware routing algorithm for networks-on-chip\n", "abstract": " The major part of the state of art routing proposals have a limited view of the NoC congestion, since each router takes decisions based on few neighbors' status. Such local decision may lead packets to other congested regions, therefore being inefficient. The goal of this work is to propose and evaluate an adaptive source routing algorithm, where the path between source and target PEs may be modified due to congestion events. The proposed method requires QoS session establishment and traffic monitoring. A QoS session establishes a connection between two IPs, applying application constraints. Traffic monitoring carries congestion information to the target, leading to a global view of the routing path. Evaluated performance figures include latency, traffic distribution and the delay to switch to a new path. For hot-spot traffic scenarios, the average latency is reduced by 10%. The proposed routing method also …", "num_citations": "22\n", "authors": ["519"]}
{"title": "Trading-off system load and communication in mapping heuristics for improving NoC-based MPSoCs reliability\n", "abstract": " Improving embedded systems lifetime and reliability become a major concern for the semiconductor industry. Imbalanced mapping of applications may considerably impact on system lifetime since processors and NoC links located in hotspot zones may age faster than others, compromising the overall system performance. This work proposes a dynamic mapping heuristic that makes a trade-off between processors' load and NoC communication volume, aiming to increase system reliability. Results show the proposed heuristic provides a well-balanced workload distribution while reducing communication volume. Results showed that proposed mapping reduces application execution time (average 10%) and hotspots zones when compared to conventional mapping approaches.", "num_citations": "21\n", "authors": ["519"]}
{"title": "A NoC-based infrastructure to enable dynamic self reconfigurable systems\n", "abstract": " Platform-based designed SoC includes one or more processors, RTOS, intellectual property blocks, memories and an interconnection infrastructure. An associated advantage of processor is flexibility at the software level. Hardware is not flexible. Thus, dedicated IP blocks must be inserted at design time. An alternative is to provide the platform with reconfigurable hardware blocks with sufficient capacity to implement any envisaged dedicated IP block. Dynamic self-reconfigurable systems (DSRSs) introduce flexibility to hardware. In DSRSs, IP blocks are loaded according to application demand, an approach that potentially reduces area, power consumption and total system cost. Platform-based design associated to dynamic reconfiguration techniques provide both hardware and software flexibility. The contributions of this work are:(i) DSRS architecture proposal;(ii) straightforward DSRS design flow for this …", "num_citations": "21\n", "authors": ["519"]}
{"title": "A simplified executable model to evaluate latency and throughput of networks-on-chip\n", "abstract": " This paper proposes a technique that mixes simulation and an analytical method to evaluate the characteristics of Networks-on-Chips (NoCs). The advantage of this technique is to reduce the simulation time by reducing the complexity of the NoC model while still obtaining accurate results for latency and throughput. The basis of this technique is:(i) to send the whole payload data at once in the packet header;(ii) to reduce the NoC simulation complexity by omitting the flit by flit payload forwarding;(iii) to use an algorithm for controlling the release of the packet trailer in order to close the connection at the right time. For the evaluation of this technique, an actor-oriented model of a NoC, JOSELITO, was created. Simulation results show that JOSELITO is in average 2.3 times faster in 88% of the executed case studies than the implementation without using the proposed technique. The worst case simulation results for …", "num_citations": "21\n", "authors": ["519"]}
{"title": "Infrastructure for dynamic reconfigurable systems: choices and trade-offs\n", "abstract": " Platform-based design is a method to implement complex SoCs, avoiding chip design from scratch. A promising evolution of platform-based design are MPSoC. Such generic architectures might furnish enough performance for several classes of embedded systems. An associated advantage of these architectures is flexibility at the software level. In principle, hardware is not flexible. Thus, dedicated IP blocks must be inserted before chip design, or enough area can be reserved for them when using reconfigurable blocks. Dynamic self-reconfigurable systems (DSRSs) introduce flexibility to hardware. In DSRSs, IP blocks are loaded according to application demand, reducing area, power consumption and system cost. An MPSoC based platform, associated with dynamic reconfiguration, provides both hardware and software flexibility. This paper has two main goals. First, to present the necessary infrastructure for …", "num_citations": "21\n", "authors": ["519"]}
{"title": "A new test scheduling algorithm based on Networks-on-Chip as Test Access Mechanisms\n", "abstract": " Networks-on-Chip (NoCs) can be used for test data transportation during manufacturing tests. On one hand, NoC can avoid dedicated Test Access Mechanisms (TAMs), reducing long global wires, and potentially simplifying the layout. On the other hand, (a) it is not known how much wiring is saved by reusing NoCs as TAMs, (b) the impact of reuse-based approaches on test time is not clear, and (c) a computer aided test tool must be able to support different types of NoC designs. This paper presents a test environment where the designer can quickly evaluate wiring and test time for different test architectures. Moreover, this paper presents a new test scheduling algorithm for NoC TAMs which does not require any NoC timing detail and it can easily model NoCs of different topologies. The experimental results evaluate the proposed algorithm for NoC TAMs with an exiting algorithm for dedicated TAMs. The results …", "num_citations": "20\n", "authors": ["519"]}
{"title": "Achieving composability in NoC-based MPSoCs through QoS management at software level\n", "abstract": " Multiprocessors systems on chip (MPSoCs) have become the de-facto standard in embedded systems. The use of Networks-on-chip (NoCs) provides to these platforms scalability and support for parallel transactions. The computational power of these architectures enables the simultaneous execution of several applications, with different time constraints. However, as the number of applications executing simultaneously increases, the performance of such applications may be affected due to resources sharing. To ensure applications requirements are met, mechanisms are necessary for ensuring proper isolation. Such a feature is referred to as composability. As the NoC is the main shared component in NoC-based MPSoCs, quality-of-service (QoS) mechanisms are mandatory to meet application requirements in term of communication. In this work, we propose a hardware/software approach to achieve applications …", "num_citations": "20\n", "authors": ["519"]}
{"title": "A monitoring and adaptive routing mechanism for qos traffic on mesh noc architectures\n", "abstract": " The development of MPSoCs targeting embedded systems with a dynamic workload of applications constitutes an important challenge. The growing number of applications running on these systems produces a considerable utilization of resources, implying a high demand of computation and communication in the different MPSoC parts. The heterogeneity of processing elements brings to the application traffic a dynamic and unpredictable nature, due to the variability on data injection rates. NoCs are the communication infrastructure to be used in such systems, due to its performance, reliability and scalability. Different strategies may be employed to deal with traffic congestion, such as adaptive routing, buffer sizing, and even task migration. The goal of this work is to investigate the use of adaptive routing algorithms, where the path between source and target PEs may be modified due to congestion events. The major …", "num_citations": "20\n", "authors": ["519"]}
{"title": "Validation of executable application models mapped onto network-on-chip platforms\n", "abstract": " Due to the increasing design size, complexity, and heterogeneity of todaypsilas embedded systems, designers need novel design methods in order to validate application-specific functionality together with different platform implementation alternatives. Ideally, this should happen at as early stage of the design process as possible, so that designers can explore the design space before they have to commit to specific processor architectures or custom hardware implementation. This paper takes advantage of the hierarchical design style and the support for heterogeneous models of computation (MoC) existing in actor-oriented frameworks and presents a methodology for modelling and validation of multiprocessor embedded systems. The proposed methodology is fully model-based, with different modelling styles for the application and the underlying implementation platform. In this paper we focus on the validation of …", "num_citations": "20\n", "authors": ["519"]}
{"title": "Hierarchical energy monitoring for task mapping in many-core systems\n", "abstract": " This work addresses a research subject with a rich literature: task mapping in NoC-based systems. Task mapping is the process of selecting a processing element to execute a given task. The number of cores in many-core systems increases the complexity of the task mapping. The main concerns in task mapping in large systems include (i) scalability; (ii) dynamic workload; and (iii) reliability. It is necessary to distribute the mapping decision across the system to ensure scalability. The workload of emerging many-core systems may be dynamic, i.e., new applications may start at any moment, leading to different mapping scenarios. Therefore, it is necessary to execute the mapping process at runtime to support a dynamic workload assignment. The workload assignment plays an important role in the many-core system reliability. Load imbalance may generate hotspots zones and consequently thermal implications …", "num_citations": "19\n", "authors": ["519"]}
{"title": "Runtime Adaptive Circuit Switching and Flow Priority in NoC-Based MPSoCs\n", "abstract": " With the significant increase in the number of processing elements in NoC-based MPSoCs, communication becomes, increasingly, a critical resource for performance gains and quality-of-service (QoS) guarantees. The main gap observed in the NoC-based MPSoCs literature is the runtime adaptive techniques to meet QoS. In the absence of such techniques, the system user must statically define, for example, the scheduling policy, communication priorities, and the communication switching mode of applications. The goal of this paper is to investigate the runtime adaptation of the NoC resources, according to the QoS requirements of each application running in the MPSoC. This paper adopts an NoC architecture with duplicated physical channels, adaptive routing, support to flow priorities and simultaneous packet and circuit switching. The monitoring and adaptation management is performed at the operating system …", "num_citations": "19\n", "authors": ["519"]}
{"title": "A robust architectural approach for cryptographic algorithms using GALS pipelines\n", "abstract": " This article presents the design of a cryptographic chip using a globally asynchronous, locally synchronous (GALS) design methodology. The design demonstrates the key advantage of using asynchrony in cryptography: the randomization of event timing internal to the chip leads to a dramatic increase in its robustness to side-channel attacks based on power and electromagnetic emission signatures.", "num_citations": "19\n", "authors": ["519"]}
{"title": "HeMPS-S: A homogeneous NoC-based MPSoCs framework prototyped in FPGAs\n", "abstract": " Current chip transistor density enables the design of multiprocessor systems-on-chip (MPSoCs). MPSoCs are an alternative to create complex computational systems because they reduce the cost, area, power dissipation and design time per chip. Due to their complexity and huge design space to explore for such systems, CAD tools and frameworks to customize MPSoCs are mandatory. The main goal of this paper is to present an open source platform for MPSoC development, named HeMPS Station (HeMPS-S). HeMPS-S is derived from the MPSoC HeMPS. HeMPS-S, in its present state, includes the platform (NoC, processors, DMA, NI), embedded software (microkernel and applications) and a dedicated CAD tool to generate the required binaries and perform debugging. Experiments show the execution of a real application running in HeMPS-S.", "num_citations": "18\n", "authors": ["519"]}
{"title": "CAFES: A framework for intrachip application modeling and communication architecture design\n", "abstract": " This paper describes CAFES, an extensible, open-source framework supporting several tasks related to high-level modeling and design of applications employing complex intrachip communication infrastructures. CAFES comprises several built-in models, including application, communication architecture, energy consumption and timing models. It also includes a set of generic and specific algorithms and additional supporting tools, which jointly with the cited models allow the designer to describe and evaluate applications requirements and constraints on specified communication architectures. Several examples of the use of CAFES underline the usefulness of the framework. Some of these are approached in this paper: (i) a realistic application captured at high-level that has its computation time estimated after mapping at the clock cycle level; (ii) a multi-application system that is automatically mapped to a large …", "num_citations": "18\n", "authors": ["519"]}
{"title": "Estimation of layout densities for CMOS digital circuits\n", "abstract": " The transistor density is one of the parameters to be considered for an optimal use of CMOS process. Therefore, layout strategies have to be evaluated through metrics considering all the involved parameters. The objective of this paper is to study the real transistor density available for a given technology at the cell and circuit levels. This study has three main interests:(i) to evaluate the quality of the layout synthesis tools in terms of area;(ii) to give a feedback to the logic synthesis step, allowing an accurate area prediction from the gate level abstraction; and (iii) to determine a transistor density roadmap.", "num_citations": "18\n", "authors": ["519"]}
{"title": "Spatially distributed dual-spacer null convention logic design\n", "abstract": " Null convention logic allows designing power, area and speed-efficient asynchronous circuits while maintaining a standard cell-based design flow. This paper proposes a new logic template for null convention logic design. The template relies on the spatial distribution of different spacer values, using both return-to-one and return-to-zero handshake protocols. In order to compare this template with others, transistor level simulation of a Kogge-Stone adder serves as case study. Simulation results demonstrate that the proposed template allows better energy, static power and speed tradeoffs while furthering a standard cell-based approach.", "num_citations": "17\n", "authors": ["519"]}
{"title": "Arbitration and routing impact on NoC design\n", "abstract": " The increasing number of processing elements packed inside integrated circuits requires communication architectures such as a Networks-on-Chip (NoCs) to deal with scalability, bandwidth and energy consumption goals. Many different NoC architectures have been proposed, and several experiments reveal that routing and arbitration schemes are key design features for NoC performance. Therefore, this work proposes a routing scheme called planned source routing, which is implemented in a NoC architecture with distributed arbitration called Hermes-SR. The paper compares Hermes-SR to the Hermes NoC that employs distinct arbitration and routing mechanisms and algorithms. One set of experiments enables to confront design time planned source routing and runtime distributed routing. Additionally, the paper presents the advantages of using deadlock free adaptive routing algorithms as basis for balancing …", "num_citations": "17\n", "authors": ["519"]}
{"title": "Floating point hardware for embedded processors in fpgas: Design space exploration for performance and area\n", "abstract": " Although the use of floating point hardware in FPGAs has long been considered unfeasible or relegated to use only in expensive devices and platforms, this is no longer the case. This paper describes fully-fledged implementations of single-precision floating point units for a MIPS processor architecture implementation. These coprocessors take as little room as 6% of a medium-sized FPGA, while the processor CPU may take only 2% of the same device. The space exploration process described here values the area and performance metrics and considers variations on the choice of synthesis tool, floating point unit generation method and architectural issues like clocking schemes. The conducted experiments show reductions of up to 22 times in clock cycles count for typical floating point application modules, compared to the use of software-emulated floating point processing.", "num_citations": "17\n", "authors": ["519"]}
{"title": "BrNoC: A broadcast NoC for control messages in many-core systems\n", "abstract": " The messages exchanged in computational systems fall into two broad categories: data and control messages. Data messages transport data exchanged between tasks at the application layer. In computational systems, several other messages do not belong directly to the application layer. Those messages called control messages are related to the system management. The state-of-the-art shows a grow in the number of proposals employing dedicated NoC architectures for control messages. Dedicated NoCs are employed for, e.g., cache management, security, resource allocation, fault-tolerance, circuit switching, and system monitoring. A common limitation of these proposals is specialization. For example, it is not possible to use a dedicated NoC designed for cache coherence protocols to fault tolerance purposes. This paper presents the BrNoC, which can be employed for different specialized control messages …", "num_citations": "16\n", "authors": ["519"]}
{"title": "A non-intrusive and reconfigurable access control to secure NoCs\n", "abstract": " Following the current trend in the semiconductor industry (MPSoC) and the massive advances presented by all things interconnected (Internet of Things), a massive quantity of private and metadata is being transferred through insecure channels. In the industry, almost no attention is given to the amount of data that can be collected from different individuals, just by getting access to their house appliances. With that in mind, this paper proposes a non-intrusive and reconfigurable access control architecture for Networks-on-Chip (NoCs). This architecture comprises firewalls, which are capable of filtering both incoming and outgoing network traffic by analyzing packet information and verifying a traffic initiator's access permission, providing a secure environment that is capable of protecting the user data. The firewalls have approximately 12% of the router area. When the number of routers increases, the firewall area …", "num_citations": "16\n", "authors": ["519"]}
{"title": "An integrated method for implementing online fault detection in NoC-based MPSoCs\n", "abstract": " The continuing development of the silicon technology leads to systems with hundreds of processors interconnected by a network on chip (NoC-based MPSoCs). On one hand, the nanotechnology enables to develop such complex systems, but, on the other hand, the vulnerability to faults increases. The literature presents partial fault-tolerant approaches, targeting specific parts of the system, as high-level methods, router level, link level, and routing algorithms. There is an important gap in the literature, with an integrated method, from the fault detection at the router level up to the fault recovery and correct execution of applications in a real MPSoC. This is the goal of the present work, to present a method with fault-tolerant techniques from the physical to the transport layers. The MPSoC is modeled at the RTL level, using VHDL. A fault campaign injection (5 simultaneous injected faults) resulted in 2,000 simulated …", "num_citations": "16\n", "authors": ["519"]}
{"title": "Improving QoS of multi-layer Networks-on-Chip with partial and dynamic reconfiguration of routers\n", "abstract": " Networks-on-Chip (NoC) allow several data transfers to occur in parallel and are indeed the communication infra-structure of future hundred-cores Systems-on-Chip (SoCs). However, if specialized modules are sending data at full speed to the NoC, Quality of Service (QoS) can be no longer guaranteed. This work presents a multi-layer mesh NoC approach to improve the QoS of such communication hungry SoCs. While one mesh layer is fixed in the system for control purposes, other data layers can be configured at runtime to provide the desired data throughput required by the application. This is accomplished by partially and dynamically reconfiguring the data layer routers. Arbitration algorithms, routing algorithms and huge crossbars are removed from the data layer routers, because all data routers in the path a configured accordingly before its utilization. A SoC following this idea was prototyped in a Virtex-4 …", "num_citations": "16\n", "authors": ["519"]}
{"title": "Applying UML interactions and actor-oriented simulation to the design space exploration of network-on-chip interconnects\n", "abstract": " This paper presents an approach supporting designer- driven interactive design space exploration for network-on-chip interconnects. It abstracts the functionality of the interconnect using UML interactions, which are in turn used as reference for the development of an actor-oriented model. Such model can be annotated with timing information, thus allowing the validation of the interconnect performance under a given traffic load. The proposed model allows simpler tuning and modification of the interconnect, improved observability and debugging, while presenting acceptable loss of accuracy with regard to a cycle-accurate RTL model.", "num_citations": "16\n", "authors": ["519"]}
{"title": "Demystifying the cost of task migration in distributed memory many-core systems\n", "abstract": " Task migration plays a major role in the implementation of runtime adaptive techniques for many-core systems, as thermal and power management, load balancing, QoS, and fault tolerance. A fast task migration protocol contributes to implementing self-adaptive techniques with low overhead. State-of-the-art proposals still have limitations, with an important impact on the applications' execution time due to the latency to migrate tasks. Aware of the number of simultaneous task migrations required by self-adaptive techniques, this work proposes a low latency tasks migration protocol for many-core systems with distributed memory hierarchy. Our technique eliminates checkpoints, task code replication, enables simultaneous task migrations even in tasks of the same application and parallelizes the task migration with the application execution. These features induce a low latency in the task migration, demystifying the cost …", "num_citations": "15\n", "authors": ["519"]}
{"title": "A method for NoC-based MPSoC energy consumption estimation\n", "abstract": " NoC-based MPSoCs are well suited for applications requiring high performance while maintaining a low-power profile. Therefore, it is important to estimate the energy consumption at early stages of the design flow due to the limited power budget imposed by the batteries. State-of-the-art proposals estimate the energy due to the NoC or the processing elements. Few works address the energy modeling and estimation for a NoC-based MPSoCs. This paper presents a method to estimate the energy/power for NoCs and processors from an RTL description, applying the proposed method to an MPSoC (36 processing elements interconnected by a 2D-mesh NoC) executing 4 real applications controlled by a multi-task operating system. The paper presents a set of results, identifying the energy due to the applications, to each element of the system, as well as the effect of two low power strategies.", "num_citations": "15\n", "authors": ["519"]}
{"title": "Proposal and evaluation of a task migration protocol for NoC-based MPSoCs\n", "abstract": " Task migration is a well-known strategy adopted in distributed systems for load balancing. but the adoption of such strategy in NoC-based MPSoC is scarce in the literature. This paper proposes a complete task migration protocol for NoC-based MPSoCs. The migration transfers the task code, data and context to another PE. The paper presents the communication strategy to ensure coherence in the messages delivery, the heuristic to compute the new task location, and the procedure to inform the new task position. Results evaluate the cost of the task migration using a real MPSoC (described in synthesizable VHDL), demonstrating that the cost to migrate a given task has a small impact in the system performance, enabling its use to improve the overall system performance.", "num_citations": "15\n", "authors": ["519"]}
{"title": "HardNoC: A platform to validate networks on chip through FPGA prototyping\n", "abstract": " The use of intrachip buses is no longer a consensus to build interconnection architectures for complex integrated circuits. Networks on chip (NoCs) are a choice in several real designs. However, the distributed nature of NoCs, the huge amount of wires and interfaces of large NoCs can make system/interconnection architecture debugging a nightmare. This work accelerates the NoC validation process using FPGA prototyping. HardNoC is a platform based on simple modules to inject traffic and collect basic statistics of NoCs. It can be used to early validate NoC designs and to provide initial numerical results for NoC evaluation and design.", "num_citations": "15\n", "authors": ["519"]}
{"title": "Buffer sizing for multimedia flows in packet-switching NoCs\n", "abstract": " Wormhole packet switching, used in many NoC designs, introduces jitter. This may produce violations of application deadlines. Several works in the literature propose stream workload models, and techniques for buffer sizing. These works do not consider the concurrency between different flows, or the NoC model is too abstract, masking the jitter introduced by data packaging and router processing. One technique to deal with jitter is to introduce a decoupling buffer (D-buffer) on the target IP. This buffer receives data from the NoC with jitter, while the target IP consumes data from this buffer at the application rate, without jitter. Two problems must be solved to implement D-buffers:(i) which size must the buffer have?(ii) how much time should be expected before data consumption starts (threshold)? This work proposes a general method to define D-buffer size and threshold, considering the influence of packaging, arbitration, routing and concurrency between flows. A traffic model for stream applications is detailed and used to characterize jitter sources in wormhole packet switching. Experimental results demonstrate the impact on multimedia flows with fixed and variable packet sizes (from real traffic traces). Simple traffic models employing constant frame sizes result in small D-buffers. On the other hand, employing multimedia frames from application traces (ie real application data) increases buffer size and threshold while still suppressing jitter. Another parameter analyzed in the paper is the percentage of deadline violations as a function of D-buffer size. The method guarantees throughput with no deadline violation and does not modify the NoC …", "num_citations": "15\n", "authors": ["519"]}
{"title": "Teaching computer organization and architecture with hands-on experience\n", "abstract": " This work describes part of a novel approach employed at the authors' institution in the last five years, which comprises the teaching of computer organization/ architecture through the effective implementation of processors and computers. The context of the courses is presented first, including a comparison of two hardware courses tracks in computer science and computer engineering curricula. Previous publications have described the structure of courses dealing with the minimal implementation of a working processor. Here, the emphasis is on subsequent courses, which take the minimal implementation and guide the students through the necessary steps to add performance, such as pipelining, and functionality, such as memory management and basic IO subsystems.", "num_citations": "15\n", "authors": ["519"]}
{"title": "Memphis: a framework for heterogeneous many-core socs generation and validation\n", "abstract": " This work presents Memphis, which comprises a flexible EDA framework and a many-core model for heterogeneous SoCs. The framework, together with the many-core model supports the integration of processors, network interfaces, routers, and peripherals. A set of tools enable a decoupled generation and compilation of the hardware, operating systems, and applications. The hardware model is cycle-accurate, with a SystemC model to speed up simulation time and a VHDL model enabling prototyping in FPGAs devices. The framework provides a rich set of graphical debugging tools enabling an easy and intuitive understanding of computation and communication events happening at runtime. The coupled integration of the platform model to the EDA framework makes Memphis well suited to be employed in research and teaching. As case studies, we provide a set of evaluations addressing the many-core …", "num_citations": "14\n", "authors": ["519"]}
{"title": "A Distributed Energy-aware Task Mapping to Achieve Thermal Balancing and Improve Reliability of Many-core Systems\n", "abstract": " Investigating novel techniques to improve many-core embedded systems lifetime, reliability, and thermal management is a fundamental challenge for the semiconductor industry. Imbalanced mapping of applications may considerably affect the system performance and lifetime due to thermal issues in an integrated circuit (eg hotspot zones). Traditional mapping techniques focus on local optimizations, eg minimize the number of hops between communicating tasks, which may lead to hotspot zones and underutilization of some processing resources. This paper proposes a runtime mapping heuristic whose cost function targets temporal workload and energy consumption balance in large scale systems. The proposed heuristic minimizes the occurrence of hotspots by distributing application workload onto the processing elements in a uniform way, which contributes to a balanced thermal distribution across the system …", "num_citations": "14\n", "authors": ["519"]}
{"title": "Software-based test for nonprogrammable cores in bus-based system-on-chip architectures\n", "abstract": " With the advance in hardware integration, system-on-a-chip (SoC) test activities using only automatic test equipments (ATEs) result in an expensive option. Hardware-based test may reduce the ATE dependency. However, hardware-based test imposes some constraints like area overhead and processing speed degradation. The main objective of this work is to investigate and evaluate a less intrusive test approach called software-based test. Software-based test uses an embedded processor as source and sink of the test, sending the test patterns and reading the responses. A new integrated design and test environment has been developed to automatically synthesize test programs to test non-programmable cores of SoCs. Some benchmarks ISCAS85 and ISCAS89 are used to evaluate the proposed methodology.", "num_citations": "14\n", "authors": ["519"]}
{"title": "Development of a tool-set for remote and partial reconfiguration of FPGAs\n", "abstract": " This work describes the implementation of digital reconfigurable systems (DRS) using commercial FPGA devices. The main goal is to present a set of tools for remote and partial reconfiguration developed for the Virtex FPGA family. Even though the tools are targeted to a specific device, their building principles may easily be adapted to other FPGA families, if they have an internal architecture enabling partial reconfiguration. The main contribution of the paper is the tool-set proposed to manipulate cores using partial reconfiguration in existing FPGAs.", "num_citations": "14\n", "authors": ["519"]}
{"title": "A systemic and secure SDN framework for NoC-based many-cores\n", "abstract": " Recent exploration of Software-Defined Networking (SDN) for Many-Core Systems-on-Chip (MCSoCs) showed higher management flexibility and reduced physical complexity compared to other runtime communication management. In SDN, there is a software SDN Controller (control layer) that configures generic routers (data layer). The adoption of SDN makes the path establishment programmable and straightforward, according to different network policies, such as low power, QoS, fault-tolerance. It is also possible to change the path establishment policies at runtime without the need to redesign the NoC. Current works focus on proposing SDN architectures, lacking a systemic framework that describes the steps required to implement SDN into a Many-core environment. Security is an observed gap in SDN designs. A malicious task could configure SDN routers and take control of the NoC. The contribution of this …", "num_citations": "13\n", "authors": ["519"]}
{"title": "Software-defined networking architecture for NoC-based many-cores\n", "abstract": " The Software-Defined Networking (SDN) is a communication paradigm adopted in computer networking. The SDN assumes simple and programmable routers, removing the control logic from the routers' level, and assigning it to a high-level controller (software), which is responsible for defining the path of the communication flows at run-time. The controller can implement different communication rules to define the paths, as Quality-of-Service (QoS), fault-tolerance, and security. Many-cores may adopt the SDN paradigm due to its advantages: reduced hardware complexity, high reusability, and flexible management of communication policies. However, the challenge to apply the SDN may be the overhead for defining the paths in software against hardware-based approaches. The goal of this paper is to show that SDN can be a viable alternative for NoC management in many-core systems. This work proposes a …", "num_citations": "13\n", "authors": ["519"]}
{"title": "Managing QoS flows at task level in NoC-based MPSoCs\n", "abstract": " The use of NoCs in complex MPSoCs is a reality in academic researches and industrial designs. A lot of research effort has been conducted in the last years in NoC and MPSoC designs, but few works address the gap between the NoC infrastructure and the MPSoC software applications. An important issue in MPSoC design is QoS, since applications running in such systems may have tight timing constraints, as video processing or fast communication protocols. This work bridges the hardware/software gap, exploring the integration of low-level NoC services into an application programming interface (API). Such API hides the interconnection complexity from programmer and provides efficient design space exploration to meet the QoS application requirements. Results shows that, even with the huge available bandwidth offered by NoCs, such interconnection architecture is not capable to meet QoS constraints when …", "num_citations": "13\n", "authors": ["519"]}
{"title": "A cryptographic coarse grain reconfigurable architecture robust against dpa\n", "abstract": " This work addresses the problem of information leakage of cryptographic devices, by using the reconfiguration technique allied to an RNS based arithmetic. The information leaked by circuits, like power consumption, electromagnetic emissions and time to compute may be used to find cryptographic secrets. The results issue of prototyping shows that our coarse grained reconfigurable architecture is robust against power analysis attacks.", "num_citations": "13\n", "authors": ["519"]}
{"title": "Propose of a hardware implementation for fingerprint systems\n", "abstract": " Fingerprint is graphical flow-like ridges presents on human fingers. Each fingerprint is unique, offering a clear and unambiguous method to identify an individual. The uniqueness of each fingerprint is determined by fine details embedded in its overall structure, named minutiae. Fingerprint classification system is CPU time intensive, usually implemented in software. This paper presents an alternative way to identify the minutiae from fingerprints, aiming real-time processing. In the first part is implemented the alternative algorithm in software (Delphi) and after this is presented an architecture to be implemented using a configurable devices (FPGA). The performance of this algorithm, in hardware and software, are analyzed, presenting the spent time within each system block.", "num_citations": "13\n", "authors": ["519"]}
{"title": "Activation of secure zones in many-core systems with dynamic rerouting\n", "abstract": " Many-core architectures provide massive parallelism and high performance to the users. They also introduce key challenges regarding security. The main threat rises from the resource sharing. Adoption of firewalls, encryption mechanisms and resource isolation (processor or memory) are common strategies to treat the security threats. The two first strategies present high hardware cost, while the resource isolation does not protect the communication infrastructure. This paper proposes to protect communication and computation simultaneously, creating continuous Secure Zones (SZ) at runtime. The SZ is an isolated area in the system, preventing traffic flows to cross the boundaries of the zone, reserving the Processing Elements (PEs) inside the SZ to execute a secure application (Appsec). The Appsec traffic is enclosed inside the SZ, and any other traffic crossing the SZ is rerouted to the outside of the SZ …", "num_citations": "12\n", "authors": ["519"]}
{"title": "A Hierarchical and Distributed Fault Tolerant Proposal for NoC-based MPSoCs\n", "abstract": " Aggressive scaling of CMOS process technology allows the fabrication of highly integrated chips such as NoC-based MPSoCs. However, fault probability increases when devices' size reduces. Hence, fault tolerant design has an important role in current nanometric technologies, leading to research on fault mitigation techniques for NoC-based MPSoCs. Most of the state-of-the-art papers present partial solutions to design a fault tolerant MPSoC, i.e., they present fault tolerant mechanisms for either NoCs or processing elements (PEs). The goal of this paper is to propose a comprehensive integration of previously defined recovery mechanisms. The main novelty is the system-level integration itself, which is organized in a hierarchical and distributed manner, ensuring the correct execution of applications in the presence of multiple transient or permanent faults in both the NoC and/or the PEs. The combination of both …", "num_citations": "12\n", "authors": ["519"]}
{"title": "Crosstalk fault tolerant NoC: design and evaluation\n", "abstract": " The innovations on integrated circuit fabrics are continuously reducing components size, which increases the logic density of systems-on-chip (SoC), but also affect the reliability of these components. Chip-level global buses are especially subject to crosstalk faults, which can lead to increased delay and glitches. This paper evaluates different crosstalk fault tolerant approaches for Networks-on-chip (NoCs) links such that the network can maintain the original network performance even in the presence of errors. Three different approaches are presented and evaluated in terms of area overhead, packet latency, power consumption, and residual fault coverage. Results demonstrate that the use of CRC coding at each link is preferred when minimal area and power overhead are the main goals. However, each one of the methods presented here has its own advantages and can be applied depending on the …", "num_citations": "12\n", "authors": ["519"]}
{"title": "Reconfigurable systems enabled by a Network-on-Chip\n", "abstract": " A modern SoC design comprises dozens of dedicated IP cores for specialized tasks and processors for general-purpose tasks. Flexibility is the key feature of processors, since it is easy to modify their tasks behavior at runtime. However, most current SoCs have no capability to modify the hardware behavior or structure after system fabrication. On the other hand, to cope with current SoC internal communication complexity, suggestions to employ networks-on-chip (NoCs) are becoming widespread. This paper proposes to extend the inherent software flexibility to hard IP cores in SoCs using NoCs as the main internal communication resource. This is achieved by making IP cores reconfigurable. The paper advances two main contributions: first, a straightforward design flow for SoCs with reconfigurable IP cores; second, the proposition of a NoC, named Artemis, supporting IP core reconfiguration", "num_citations": "12\n", "authors": ["519"]}
{"title": "MultiNoC: A multiprocessing system enabled by a network on chip\n", "abstract": " The MultiNoC system implements a programmable onchip multiprocessing platform built on top of an efficient, low area overhead intra-chip interconnection scheme. The employed interconnection structure is a network on chip, or NoC. NoC are emerging as a viable alternative to increasing demands on interconnection architectures, due to the following characteristics: (i) energy efficiency and reliability; (ii) scalability of bandwidth, when compared to traditional bus architectures; (iii) reusability; (iv) distributed routing decisions. An external host computer feeds MultiNoC with application instructions and data. After this initialization procedure, MultiNoC executes some algorithm. After finishing execution of the algorithm, output data can be read back by the host. Sequential or parallel algorithms conveniently adapted to the MultiNoC structure can be executed. The main motivation to propose this design is to enable the …", "num_citations": "12\n", "authors": ["519"]}
{"title": "Codesign of fully parallel neural network for a classification problem\n", "abstract": " This paper presents a neural network implementation using reconfigurable devices (FPGA) and a signal processor (DSP) available in a flexible codesign platform. The network is described using C and VHDL languages, for the software and hardware parts respectively. The software part is responsible for the learning phase and the hardware part is responsible for the propagation phase. Our objective for the hardware part is twofold: define a codification for the numbers used by the network, aiming hardware cost reduction, and exploit the inherent parallelism of neural networks, aiming speed-up the image processing. We present a synchronous implementation for the network and a codification analysis using PSNR (Peak Signal Noise Ratio).", "num_citations": "12\n", "authors": ["519"]}
{"title": "Uso de um ambiente codesign para a implementação de redes neurais\n", "abstract": " This paper presents a hardware implementation of neural networks into reprogrammable devices, FPGAs. It was used for this implementation the LIRMM board, which allows to develop both hardware and software designs, using C and VHDL languages, respectively. A feedforward neural network was implemented, using backpropagation learning. Emphasis is given for the net calculus, since intensive multiplications and additions are needed to compute this function. At the neuron level, the size of arithmetic operators was reduced by correctly coding the synaptics weights and input patterns, as well as replacing multipliers by adders and look-up-tables. At the network level, two techniques were employed to neuron synchronization. The synchronous solution resulted in a correct neural network implemented in hardware. After this implementation, the simulation of the neural network is presented. This work is organized as follows: section 1 introduces the use of neural network; section 2 presents the hardware-software environment used; section 3 details the neural network implementations (digital, analog, hybrid), our network and the simulation; and finally, our conclusions and future work.", "num_citations": "12\n", "authors": ["519"]}
{"title": "Hierarchical adaptive Multi-objective resource management for many-core systems\n", "abstract": " The typical workload of many-core systems produces peaks and valleys of resources utilization throughout the time. The power capping limits the full system utilization in a workload peak, but also creates a power slack to apply different resource management (RM) policy in a valley phase. Related works do not consider this workload behavior, by proposing RMs with fixed goals. This work proposes a hierarchical adaptive Multi-Objective Resource Management (MORM) for many-core systems under a power cap. MORM works with dynamic workloads, which presents peaks and valleys of utilization. The hierarchical approach allows clusters of processing elements (PEs) to execute applications according to different objectives simultaneously. A cluster can drive the PEs to optimize either performance or energy. MORM can dynamically shift the goals of a cluster according to the workload behavior. Comparison with a …", "num_citations": "11\n", "authors": ["519"]}
{"title": "SDN-based circuit-switching for many-cores\n", "abstract": " Software-Defined Networking (SDN) is a paradigm adopted in computer networks that decouple the control logic from the physical to the software layer, reducing the routers' complexity and enabling a high-level network awareness. This work explores the SDN paradigm on NoCs to manage Circuit Switching (CS) connections in an original Multi-Physical Network (MPN) architecture. Related works focus its CS proposals only at the NoC context. This work proposes a CS design that covers all applications' lifetime stages, through a systemic many-core CS support that addresses both the hardware and software layers. The proposal explores the MPN's path diversity to provide a permanent CS during the real-time applications' lifetime. Results show that: (i) the MPN design provides a rich path diversity; (ii) the search path algorithm reaches success rates superior to 97% for 6 and 8 CS subnets; (iii) the SDN paradigm …", "num_citations": "11\n", "authors": ["519"]}
{"title": "Enabling adaptive techniques in heterogeneous mpsocs based on virtualization\n", "abstract": " This article explores the use of virtualization to enable mechanisms like task migration and dynamic mapping in heterogeneous MPSoCs, thereby targeting the design of systems capable of adapt their behavior to time-changing workloads. Because tasks may have to be mapped to target processors with different instruction set architectures, we propose the use of Low Level Virtual Machine (LLVM) to postcompile the tasks at runtime depending on their target processor. A novel dynamic mapping heuristic is also proposed, aiming to exploit the advantages of specialized processors while taking into account the overheads imposed by virtualization. Extensive experimental work at different levels of abstraction---FPGA prototype, RTL and system-level simulation---is presented to evaluate the proposed techniques.", "num_citations": "11\n", "authors": ["519"]}
{"title": "Task mapping on NoC-based MPSoCs with faulty tiles: Evaluating the energy consumption and the application execution time\n", "abstract": " The use of spare tiles in a networks-on-chip based multi-processor chip can improve the yield, reducing the cost of the chip and maintaining the system functionality even if the chip is defective. However, the impact of this approach on application characteristics, such as energy consumption and execution time, is not documented. For instance, on one hand the application tasks might be mapped onto any tile of a defect-free chip. On the other hand, a chip with a defective tile needs special task mapping that avoid fault tiles. This paper presents a task mapping aware of faulty tiles, where an alternative task mapping can be generated and evaluated in terms of energy consumption and execution time. The results show that faults on tiles have, on average, a small effect on energy consumption but no significant effect on execution time. It demonstrates that spare tiles can improve yield with a small impact on the …", "num_citations": "11\n", "authors": ["519"]}
{"title": "Characterising embedded applications using a UML profile\n", "abstract": " Application designers need to start the application design process before the final platform is available. Therefore, the designers need to have an abstract model of the platform at the early stages of the design process in order to validate the application functionality and evaluate its performance. Furthermore, platform designers need an application model to evaluate whether the computation and communication capacity of the platform is sufficient for the application. This paper identifies a minimalistic set of modelling constructs that can extensively characterise an application, which can be validated over a multicore Network-on-Chip (NoC) platform. The identified set of constructs is organized as a Unified Modeling Language (UML) profile in order to facilitate its use within UML-based design flows and tools. We present a practical application using the profile's constructs to model and constrain several subsystems of …", "num_citations": "11\n", "authors": ["519"]}
{"title": "A high abstraction, high accuracy power estimation model for networks-on-chip\n", "abstract": " Due to the vast number of alternatives in the design space of NoC-based MPSoCs, fast and accurate performance evaluation approaches can result in earlier-and often better-design decisions. Important design metrics for mobile embedded systems include power dissipation and energy consumption. To speed-up the evaluation of such metrics, state-of-the-art research proposes abstract models of the NoC interconnect, employing, for example, TLM SystemC, analytical descriptions and graph descriptions. Power parameters used at higher abstraction models (eg TLM) frequently rely upon data generated at lower abstraction levels (eg RTL). This paper presents an abstract model of a NoC coupled with a power estimation model, aiming to provide accurate estimations early on the design flow. Despite being abstract, this model considers typical NoC communication behavior such as congestion and burst …", "num_citations": "11\n", "authors": ["519"]}
{"title": "Reducing the power consumption in networks-on-chip through data coding schemes\n", "abstract": " This work investigates the reduction of power consumption in networks-on-chip (NoCs) through the reduction of transition activity using data coding schemes developed for bus-based systems and proposes a new coding scheme suitable for NoC-based systems. The estimation of the NoC power consumption was performed with basis on macromodels which reproduce the power consumption on each internal NoC module according to the transition activity on its input ports. Such macromodels were embedded in a system model and a series of simulations were performed, aiming to analyze the trade-off between the power savings due to coding techniques versus the power consumption overhead due to the encoding and decoding modules. The proposed coding scheme presented the best results for all of the simulated traffic patterns, when compared to other coding schemes found in the literature.", "num_citations": "11\n", "authors": ["519"]}
{"title": "FiPRe: An implementation model to enable self-reconfigurable applications\n", "abstract": " ASIPs and reconfigurable processors are architectural choices to extend the capabilities of a given processor. ASIPs suffer from fixed hardware after design, while ASIPs and reconfigurable processors suffer from the lack of a pre-established instruction set, making them difficult to program. As intermediate choice, reconfigurable coprocessors systems (RCSs) contain dedicated hardware (coprocessors) coupled to a standard processor core to accelerate specific tasks, allowing inserting or substituting hardware functionalities at execution time. This paper proposes a generic model for RCSs, targeted to reconfigurable devices with self-reconfiguration capabilities. A proof-of-concept case study is presented as well.", "num_citations": "11\n", "authors": ["519"]}
{"title": "Sistema integrado e multiplataforma para controle remoto de residências\n", "abstract": " Este trabalho é um estudo e implementação de um sistema que tem a finalidade de permitir que pessoas possam administrar seus lares remotamente, de uma forma simples, com um custo baixo (implantação e administração), utilizando uma plataforma portável e flexível a avanços tecnológicos, facilitando a implementação de domótica em lares, escritórios e prédios.Este capítulo caracteriza automação doméstica. A Seção 1.1 apresenta conceitos básicos em que esse trabalho está baseado. A Seção 1.2 mostra alguns requisitos de sistemas de domótica. A Seção 1. 3 lista benefícios em termos de segurança, conforto, facilidade de comunicação, e economia de energia que o usuário de tal sistema de automação pode usufruir. Finalmente, a Seção 1.4 apresenta o que motiva o desenvolvimento deste projeto.", "num_citations": "11\n", "authors": ["519"]}
{"title": "VLSI Hardware Design by Computer Science Students: How early can they start? How far can they go?\n", "abstract": " This work describes a novel approach to teach computer organization concepts with extensive hands-on design experience very early in computer science curricula. While describing the proposed teaching method, it addresses relevant questions about teaching VLSI design to students in computer science and related fields. The approach involves the analysis, simulation, design and effective construction of processors. It is enabled by the use of both, VLSI hardware prototyping platforms constructed with reconfigurable hardware and powerful computer aided design tools for design entry, validation and implementation. The approach comprises a 4-hour a week lecture course on computer organization and a 2-hour a week laboratory, both taught in the 3rd semester. In the first two editions of the course, most students have obtained successful processor implementations. In some cases, considerably complex …", "num_citations": "11\n", "authors": ["519"]}
{"title": "Evaluating the cost to cipher the NoC communication\n", "abstract": " The trend in the semiconductor industry is to present more highly dense and functional MPSoC due to the increasing demand for interconnected devices (e.g., Internet of Things). In this context, these devices are holding an increasing amount of personal data from its users. With the goal of protecting users against attacks, this paper proposes a secure architecture and provides the costs of increasing the security for Networks-on-Chip (NoCs). The architecture is composed of a firewall capable of filtering incoming and outgoing network traffic and encrypting sensitive information performing end-to-end security using an AES cipher block. The Firewall plus the AES increases the router area by 193.7% and latency increases in the worst-case scenario 395.92%. Despite this performance penalty, the traffic is protected against attacks. Considering that the injection rate of applications is small (typically 5-10%), a small …", "num_citations": "10\n", "authors": ["519"]}
{"title": "Extending FreeRTOS to support dynamic and distributed mapping in multiprocessor systems\n", "abstract": " With the ever-increasing complexity of both embedded application workloads and multiprocessor platforms grows the demand for efficient mapping heuristics able of allocating several application workloads at runtime. The majority of promoted mapping techniques are bespoke implementations that consider an in-house operating system, which is developed to a particular architecture, restricting its adoption in other platforms. This work proposes a FreeRTOS extension that supports distributed task mapping heuristics, which enables to balance application workloads in multiprocessor architectures at runtime. Promoted extension is validated through a trustworthy number of scenarios considering large scale Cortex-M-based multiprocessor systems executing up to 600 application tasks.", "num_citations": "10\n", "authors": ["519"]}
{"title": "BAT-Hermes: A Transition-Signaling Bundled-Data NoC Router\n", "abstract": " Networks on chip (NoCs) are efficient infrastructures to enable communication among the large number of IPs that compose modern systems on chip (SoCs). However, even if recent technologies allow the construction of such complex systems, they increase the cost and effort of designing a correct and efficient chip-wide clock delivery network for a fully synchronous system. Asynchronous NoCs are an attractive alternative, as they allow each IP to operate on an independent clock domain, eliminating the need for a global clock network and producing globally asynchronous locally synchronous (GALS) systems. This paper details the design of a low power NoC router that is asynchronous and employs a transition-signaling bundled-data design style. Results show reductions of 27% in energy consumption when compared to a similar synchronous router.", "num_citations": "10\n", "authors": ["519"]}
{"title": "Scalability evaluation in many-core systems due to the memory organization\n", "abstract": " Many-core systems are a common place in the electronic consumer market. Thus, complex benchmark suites have been modeled for shared memory (SM) architectures since it is easier to develop applications (threads) for many-core. Shared memory presents a scalability limitation due to the number of memory accesses. One way to mitigate the SM limitations is to adopt distributed memory system (DSM) architectures. However, DSM presents the same scalability limitation, since the number of processors is clearly superior to the number of SMs in the system. The alternative is to adopt distributed memory organization (DM), which enables the direct communication among the tasks (message passing). The goal of this paper is to highlight the limitations of shared memory connected through a network-on-chip (NoC) in many-core systems, executing a similar workload with both memory organizations. Results evaluate …", "num_citations": "9\n", "authors": ["519"]}
{"title": "Fault recovery protocol for distributed memory MPSoCs\n", "abstract": " Fault handling mechanisms become more relevant as systems integrate more hardware logic. For instance, current multi-processor system-on-chips (MPSoCs) consists of hundreds of processors connected by an interconnection network. This type of system can only be cost effective if it can handle faults on its main components (i.e. processors and interconnect). Traditional fault recovery approaches for multi-processors were adapted from the domain of cluster of computers and might be more complex than required for common MPSoC applications domains. This paper presents a lightweight online fault recovery for embedded processors of MPSoCs based on distributed memory. This approach automatically restarts affected applications reallocating tasks to healthy processors. All steps are performed at the kernel level, without changing user application code. Results show very short recovery time, from 110 μs to …", "num_citations": "9\n", "authors": ["519"]}
{"title": "Effects of the NoC Architecture in the Performance of NoC-based MPSoCs\n", "abstract": " The goal of this work is to evaluate the impact of multiple Network-on-Chip (NoC) architectural parameters over the performance of applications running on Multiprocessors Systems-on-Chip (MPSoCs) using message passing as communication protocol. Nowadays, MPSoCs have so many constraints of performance that bus-based communications are not able to achieve the full potential of MPSoCs, therefore, the adoption of NoCs is a trend for the communication infrastructure in MPSoCs due to their performance compared to bus-based architectures and scalability compared to crossbar-based architectures. However, there is an important gap in the literature with works evaluating the impact of NoC parameters in the performance of applications running in MPSoCs. This work proposes the evaluation of how different NoC parameters affect applications running in a real MPSoC, trying to answer the following …", "num_citations": "9\n", "authors": ["519"]}
{"title": "Achieving QoS in NoC-based MPSoCs through Dynamic Frequency Scaling\n", "abstract": " The management of Quality-of-Service (QoS) constraints in NoC-based MPSoCs, with dozens of tasks running simultaneously, is still a challenge. Techniques applied at design or run-time to address this issue adopts different QoS metrics. Designers include in their systems monitoring techniques, adapting at run-time the QoS parameters to cope with the required constraints. In order words, MPSoC are able to self-adapt themselves, while executing a given set of applications. Self-adaptation capability is a key feature to meet applications' requirements in dynamic systems. Dynamic Voltage and Frequency Scaling (DVFS) is an adaptation technique frequently used to reduce the overall energy consumption, not coupled to QoS constraints, as throughput or latency. Another example of adaptation technique is task migration, which focus on throughput or latency optimization. The self-adaptation technique proposed in …", "num_citations": "9\n", "authors": ["519"]}
{"title": "Beware the Dynamic C-Element\n", "abstract": " The C-element is a well known component of asynchronous circuits. To overcome problems of current CMOS technologies, its use has even been extended to specific domains of the synchronous paradigm, such as clock generation, clock gating, and registers. An economical implementation of this component is the dynamic C-element. Its advantages over static implementations are reduced power, transition, and propagation delays as well as lower silicon area. Yet, research evaluating its electrical behavior, functionality, and robustness is scarce. This brief presents an in-depth analysis of the dynamic C-element electrical behavior. The analysis points to a constrained nature, which can lead to undefined output logic values, as well as excessive static power consumption. The brief also proposes a technique for robust design of such components that avoids such undefined values.", "num_citations": "9\n", "authors": ["519"]}
{"title": "A spectrum of MPSoC models for design space exploration and its use\n", "abstract": " Implementing on-chip multiprocessors is enabled by the use of deep submicron technologies and constitutes today a daunting task, due to the complexity of their design and verification. The development of such devices can be facilitated by the use of a carefully crafted set of models for each implementation step. This paper proposes the use of such a set of abstract models at several levels. These improve simulation speed and observability in one sense and level of detail and precision in the opposite sense. Initial development tasks such as software development and functionality specification refinement can evolve fast with very abstract models, while confidence in the final implementation can be achieved with lower level models. Our basic multi-processor system on a chip is configurable in several parameters, including number of processors, type of employed communication architecture and combination of …", "num_citations": "9\n", "authors": ["519"]}
{"title": "Energy-efficient cache coherence protocol for noc-based mpsocs\n", "abstract": " As the number of cores and functionalities integrated in embedded devices increases, the amount of memory used on these devices also increases, justifying the development of memory architectures presenting scalability, low energy consumption and low latency. To implement memory solutions, most works adopting NoC-based MPSoCs only employ basic communication services, such as send/receive, without exploring the services NoCs can offer, for instance connection, priorities and multicast communication. Multicast can be used to optimize the cache coherence protocol, leading to both traffic and energy consumption reduction. The goal of this work is to optimize a directory-based cache coherence protocol exploiting specific NoC services, as multicast and priorities. To demonstrate our proposal, an MPSoC described at the RTL level is used, enabling accurate performance and energy evaluation. Results …", "num_citations": "9\n", "authors": ["519"]}
{"title": "Exploring heterogeneous NoC-based MPSoCs: From FPGA to high-level modeling\n", "abstract": " This paper proposes a novel strategy for enabling dynamic task mapping on heterogeneous NoC-based MPSoC architectures. The solution considers three different platforms with different area constraints and applications with distinct efficient characteristics. We propose a solution that uses a unified model-based framework, which is calibrated according to area information obtained from FPGA synthesis. Besides, we present the performance of various applications running on different processors on FPGAs aiming to obtain application efficiency characteristics for calibrating the proposed high-level model. The paper also presents three different scenarios and discusses the reduction in terms of energy consumption as well as the end-to-end communication cost for different applications such as MPEG and ADPCM, among others multimedia benchmarks.", "num_citations": "9\n", "authors": ["519"]}
{"title": "ATLAS-an environment for NoC generation and evaluation\n", "abstract": " MPSoC is becoming a much more prevalent design style, to achieve tight time-to-market design goals, to maximize design reuse, to simplify the verification process and to provide flexibility and programmability for post-fabrication reuse of complex platforms [6]. Networks-on-chip (NoCs) are employed as the communication infrastructure able to handle MPSoC communication requirements due to its scalability, power efficiency, and support to globally asynchronous locally synchronous (GALS) paradigm [10][8][3]. NoCs are composed of cores connected to routers, and routers interconnected by communication channels [2].The adoption of NoCs includes new challenges to the MPSoC design flow, such as choosing a suitable routing algorithm, NoC topology, buffering strategy, flow control scheme, or reducing power dissipation. Due to the vast design space alternatives that these challenges may impose to the final application and its required performance, the evaluation of NoCs become a mandatory step in the MPSoCs design flow [8][1]. The evaluation of NoCs is required to establish a good trade-off between the NoC architecture characteristics and the requirements of the given application. The ATLAS environment automates the various processes related to the design flow for some of NoCs (eg Hermes [7], Mercury) proposed by the GAPH Group [4] and eventually by other groups with which we collaborate. ATLAS is written in Java, allowing its execution in different hardware/software platforms. Figure 1 presents the ATLAS design exploration tool.", "num_citations": "9\n", "authors": ["519"]}
{"title": "Model-based design flow for NoC-based MPSoCs\n", "abstract": " High-level abstraction modeling of NoC-based MPSoCs is an emerging approach to handle the vast design space alternatives of such systems. In this context, this work presents a model-based design flow, allowing the design space exploration of NoC-based MPSoCs at early stages of the design flow. The proposed flow supports accurate performance evaluation, latency and power consumptions for example, which are important to the adoption or rejection of design alternatives. A case of study is used to demonstrate some steps of the flow and to show some possible performance parameters that can be considered in the proposed design flow.", "num_citations": "9\n", "authors": ["519"]}
{"title": "Flow oriented routing for NOCS\n", "abstract": " Several NoC routing schemes proposals targeting overall performance optimization are available in the literature. However, such proposals do not differentiate the application flows. The goal here is to demonstrate that adaptive routing algorithms can be used in flows with temporal constraints, enabling an enhanced degree of path exploration. The main contribution of this work is to expose the routing algorithm at the IP level. Results show gains in latency, throughput and jitter for hotspot scenarios, with minimal area overhead.", "num_citations": "9\n", "authors": ["519"]}
{"title": "Joint validation of application models and multi-abstraction network-on-chip platforms\n", "abstract": " Application models are often disregarded during the design of multiprocessor Systems-on-Chip (MPSoC). This is due to the difficulties of capturing the application constraints and applying them to the design space exploration of the platform. In this article we propose an application modelling formalism that supports joint validation of application and platform models. To support designers on the trade-off analysis between accuracy, observability, and validation speed, we show that this approach can handle the successive refinement of platform models at multiple abstraction levels. A case study of the joint validation of a single application successively mapped onto three different platform models demonstrates the applicability of the presented approach.", "num_citations": "9\n", "authors": ["519"]}
{"title": "Dynamic and partial reconfiguration in FPGA SoCs: requirements tools and a case study\n", "abstract": " Current technology allows building integrated circuits (ICs) complex enough to contain all major elements of a complete end product, which are accordingly called Systems-on-Chip (SoCs)[1]. A SoC usually contains one or more programmable processors, on-chip memory, peripheral devices, and specifically designed complex hardware modules. SoCs are most often implemented as a collection of reusable components named intellectual property cores (IP cores or cores). An IP core is a complex hardware module, created for reuse and that fulfills some specific task.Field Programmable Gate Arrays (FPGAs1) have revolutionized the digital systems business after their introduction, almost 20 years ago. The first FPGAs were fairly simple, being able to house a circuit with no more than a few thousand equivalent gates. They were launched in the mid eighties, at the same time when rather complex microprocessors …", "num_citations": "9\n", "authors": ["519"]}
{"title": "Requirements, primitives and models for systems specification\n", "abstract": " This paper presents a metamodel, called RPM, which is proposed to systematize and encompass many models of computation. RPM is based on the decomposition of a computational system model into its requirements, primitives and models of computation. A taxonomy for telecom computational systems is proposed and related to the RPM metamodel. The goal of the paper is to pave the way for a codesign CAD system with heterogeneous specification. Such systemic specification is to be mapped into one or more homogeneous descriptions.", "num_citations": "9\n", "authors": ["519"]}
{"title": "LASCA-interconnect parasitic extraction tool for deep-submicron ic design\n", "abstract": " A fast capacitance and resistance extraction tool (wire extractor) is presented. Five models are implemented: ground capacitances, ground plus coupling capacitances and RC models (L, /spl pi/ and T lumped). The designer can choose one of these models according some criteria, such as accuracy, CPU time and circuit complexity. Comparisons between our wire extractor and Diva extractor (Cadence Design Systems) for C models, give an average difference of only 5% in the final delay of some benchmarks, being up to 30 times faster than Diva.", "num_citations": "9\n", "authors": ["519"]}
{"title": "Dynamic Real-Time Scheduler for Large-Scale MPSoCs\n", "abstract": " Large-scale MPSoCs requires a scalable and dynamic real-time (RT) task scheduler, able to handle non-deterministic computational behaviors. Current proposals for MPSoCs have limitations, as lack of scalability, complex static steps, validation with abstract models, or are not flexible to enable changes at runtime of the RT constraints. This work proposes a hierarchical task scheduler with monitoring features. The scheduler is dynamic, supporting changes in RT constraints at runtime. An API enables these features allowing to the application developer to reconfigure the tasks' period, deadline, and execution time by annotating the task code. At runtime, according to the task execution, the scheduler handles the API calls and adjust itself to ensure RT guarantees according to the new constraints. Scalability is ensured by dividing the scheduler into two hierarchical levels: LS (Local Schedulers), and CS (Cluster …", "num_citations": "8\n", "authors": ["519"]}
{"title": "Hierarchical energy monitoring for many-core systems\n", "abstract": " Power/energy managers for many-core systems has been proposed as a possible solution for the restricted power constraints imposed by new chip technologies. Therefore, when these management approaches are implemented on real systems, strong limitations to apply the management techniques has been reported. The hierarchical energy monitoring method presented in this paper provides a multi-level energy data for power/energy management. The proposed energy monitoring is implemented at the software level on a real homogeneous NoC-based many-core platform, with low intrusiveness on hardware. The energy monitoring data is transmitted through packets on the network with low impact on system performance.", "num_citations": "8\n", "authors": ["519"]}
{"title": "An open-source framework for heterogeneous MPSoC generation\n", "abstract": " The design of a Multiprocessor System-on-Chip (MPSoC) is a complex task, including steps as application development, platform configuration, code generation, task mapping onto the platform and debugging. An integrated environment covering most of these steps is a gap in the literature. The present work first details an MPSoC architecture, which supports the execution of distributed applications, including an operating system enabling multitask execution at each processing element. The MPSoC is heterogeneous, due to the support to different processor architectures. Then, a framework able to cover the design steps previously mentioned is presented. The framework enables the design space exploration for applications to be executed in the MPSoC, varying for example the number and type of processors, the memory size, the task mapping. Results demonstrate the correct operation for different MPSoC …", "num_citations": "8\n", "authors": ["519"]}
{"title": "A path-load based adaptive routing algorithm for Networks-on-Chip\n", "abstract": " Applications executing in current MPSoCs present traffic behavior with different characteristics in terms of QoS requirements and traffic modeling. Another important MPSoC traffic feature is its unpredictability and dynamic nature. Networks-on-chip (NoCs) are communication structures being used due to higher degree of parallelism, fault tolerance, and scalability, when compared to busses. Even with increased bandwidth due to parallelism, some flows may compete for the same network resources, affecting the applications performance, and possibly violating QoS requirements. Adaptive routing algorithms may reduce such congestion, enabling dynamic path modification according to some congestion evaluation metric. State of the art approaches have a limited view of the congestion areas, since each router take routing decisions based on its neighbors congestion status. Such local decision may lead packets to …", "num_citations": "8\n", "authors": ["519"]}
{"title": "MOTIM-A scalable architecture for Ethernet switches\n", "abstract": " The main goal of this work is to describe a scalable and reusable architecture useful for the construction of Ethernet switches, named MOTIM. The main requirement of MOTIM is to allow achieving low latency and high throughput with a generic structure that can be easily scaled. In order to make the architecture scalable, its design is based on the use of a network on chip (NoC), a concept recently proposed for enhancing SoC interconnect design (Benini, 2002). NoCs stand as a good compromise between silicon cost and performance scalability, easing to attain design requirements. Minkenberg et al. recently identified a set of trends arising in packet switch design and discussed their consequences (Minkenberg, 2003). The most important of these trends indicates that the aggregate throughput grow by increasing the amount of ports in switches, rather than by increasing port speed. This imposes a demand for …", "num_citations": "8\n", "authors": ["519"]}
{"title": "Adaptive coding in networks-on-chip: Transition activity reduction versus power overhead of the Codec Circuitry\n", "abstract": " This work investigates the reduction of power consumption in Networks-on-Chip (NoCs) through the reduction of transition activity using data coding schemes. The estimation of the NoC power consumption is performed with basis on macromodels which reproduce the power consumption on each internal NoC module according to the transition activity on its input ports. Such macromodels are embedded in a system model and a series of simulations are performed, aiming to analyze the trade-off between the power savings due to coding schemes versus the power consumption overhead due to the encoding and decoding modules.", "num_citations": "8\n", "authors": ["519"]}
{"title": "Prototyping of embedded digital systems from SDL language: a case study\n", "abstract": " The goal of this paper is to evaluate the performance of embedded digital systems generated from a system level description language. The target language is SDL, which is automatically synthesized with a codesign tool, resulting in VHDL and C descriptions. The codesign tool is responsible for software, hardware and communication synthesis. Two case studies are presented, exploring area and delay results. The results concern only the hardware synthesis, since the goal is to compare the performance of systems generated from hand coded HDL descriptions against a synthesized HDL. The analysis of the advantages and drawbacks of this automatic hardware design flow and the evaluation of the commercial tools integration are also reported.", "num_citations": "8\n", "authors": ["519"]}
{"title": "An Efficient Layout Style for Three-Metal CMOS Macro-Cells\n", "abstract": " This paper presents a new layout style for macro-cells, using three-metal layers CMOS processes with stacked vias. The routing method between leaf cells reduces the track density up to 50% (compared to a double-layer router), allowing an important area reduction. The motivation to develop this work is the requirement in submicron technologies: smaller area, small delay and less power consumption. To attain these requirements, the main cost function in all algorithms (cell generation, placement, routing) is the parasitic capacitance reduction. Our contribution is the new layout style and the associated routing method.", "num_citations": "8\n", "authors": ["519"]}
{"title": "Distributed SDN architecture for NoC-based many-core SoCs\n", "abstract": " In the Software-Defined Networking (SDN) paradigm, routers are generic and programmable forwarding units that transmit packets according to a given policy defined by a software controller. Recent research has shown the potential of such a communication concept for NoC management, resulting in hardware complexity reduction, management flexibility, real-time guarantees, and self-adaptation. However, a centralized SDN controller is a bottleneck for large-scale systems.", "num_citations": "7\n", "authors": ["519"]}
{"title": "Runtime creation of continuous secure zones in many-core systems for secure applications\n", "abstract": " Security is an important design issue in current many-core systems. Several applications run simultaneously, processing sensitive data. The literature describes different attacks on many-core systems, stealing data from processors, by unauthorized access to the memories, and from the communication infrastructure, by sniffing the packets or even modifying them using Hardware Trojans. Thus protect at the same time the computation and communication infrastructures is a paramount requirement to add security to applications processing sensitive data. This paper presents a method to create at runtime secure zones in the many-core, by reserving the computation and communication resources exclusively to the secure application. The method isolates the processing elements of the secure zone, blocking any traffic to cross the region. Traffic that should cross the secure zone is forwarded to the outside of the region …", "num_citations": "7\n", "authors": ["519"]}
{"title": "Static Differential NCL Gates: Towards Low Power\n", "abstract": " This brief proposes a new topology for implementing differential null convention logic gates. The new topology relies on the static implementation of conventional versions of such gates and uses a set of extra minimum-sized transistors to cut off connections to the power rails in specific nodes while the gate is switching. It shows that albeit the extra transistors adding cost in area, they enable solid savings in dynamic and static power and improve transition delays. Electrical simulation results for a Kogge-Stone adder case study led to savings of 67.3% in dynamic power, 61.9% in static power, 67.2% in energy per operation, and 8.9% in forward propagation delay, when compared with a state-of-the-art differential topology.", "num_citations": "7\n", "authors": ["519"]}
{"title": "Graphical interface for debugging RTL Networks-on-Chip\n", "abstract": " One problem of Multiprocessor Systems-on-Chip (MPSoCs) based on Networks-on-Chip (NoCs) is tracing the dozens of parallel communications that are transferred in the system. The goals of tracing communications are usually either debugging or monitoring the NoC for design space exploration. On Register Transfer Level (RTL) NoCs the tracing is frequently verified by waveforms, which provides limited useful information about the global status of the NoC. The goal of this work is to improve the tracing capabilities of RTL NoCs and provide a global picture of what is happening in the NoC. This is accomplished by using a Java tool to represent graphically relevant events of the NoC. The input of this tool is a list of relevant events generated by the RTL simulator during the simulation of an MPSoC. The HERMES NoC is used as test case for the tool.", "num_citations": "7\n", "authors": ["519"]}
{"title": "A 10 Gbps OTN framer implementation targeting FPGA devices\n", "abstract": " Integrated circuits for very high-speed telecommunication protocols often use ASICs, due to their strict timing constraints. This scenario is changing, since modern FPGAs, implemented in 65 or 45 nm technologies achieve high operating frequencies, and serializer/deserializer hardwired modules enable the reception of high speed aggregated rates (e.g. 10 Gbps or more), spanning the input stream for internal parallel computation. This paper presents a complete solution for an optical transport network framer using FPGA devices. The framer receives a 10 Gbps stream originated from optical fiber medium, extracts its payload information, and transmits payload data at 10 Gbps. A working prototype was implemented in Virtex-4 and Virtex-5 devices.", "num_citations": "7\n", "authors": ["519"]}
{"title": "Investigating runtime task mapping for NoC-based multiprocessor SoCs\n", "abstract": " Multiprocessor Systems on Chip (MPSoCs) are a trend in VLSI design, since they minimize the design crisis configured by the gap between the silicon technology and the actual SoC design capacity. An important issue in MPSoCs is task mapping. Applications running in MPSoCs execute a varying number of tasks simultaneously, where each task may be started at some distinct moment, according to applications requests. Thus, task mapping should be executed at runtime. This work investigates the performance of dynamic task mapping heuristics in NoC-base MPSoCs, targeting NoC congestion minimization. Tasks are mapped on demand, according to the NoC channels load. Results using congestion-aware mapping heuristics compared to a straightforwardly defined heuristic achieve better results. In average, it is possible to reach up to 31% smaller channel load, up to 22% smaller packet latency, and up to 88 …", "num_citations": "7\n", "authors": ["519"]}
{"title": "QoS in networks-on-chip–beyond priority and circuit switching techniques\n", "abstract": " The idea behind the proposition of Networks-on-Chip (NoCs) for modern and future systems on chip capitalizes on the fact that busses do not scale well when shared by a large number of cores. Even if NoC research is a relatively young field, the literature abounds with propositions of NoC architectures. Several of these propositions claim providing quality of service (QoS) guarantees, which is essential for real time and multimedia applications. The most widespread approach to attain some degree of QoS guarantee relies on a two-step process. The first step is to characterize application performance through traffic modeling and simulation. The second step consists in tuning a given network template to achieve some degree of QoS guarantee. These QoS targeted NoC templates usually provide specialized structures to allow either the creation of connections (circuit switching) or the assignment of priorities to …", "num_citations": "7\n", "authors": ["519"]}
{"title": "Evaluating the impact of data encoding techniques on the power consumption in networks-on-chip\n", "abstract": " This work addresses the problem of power consumption in networks-on-chip (NoCs). It investigates the reduction of dynamic power consumption through the reduction of transition activity using data coding techniques. Power macromodels for various NoC modules were built, allowing the estimation of the power consumption as a function of the transition activity at each module's inputs. Such macromodels were embedded in a system model and a series of simulations were performed, aiming to analyze the trade-off between the power savings due to coding techniques versus the power consumption overhead due to the encoding and decoding modules.", "num_citations": "7\n", "authors": ["519"]}
{"title": "MPSoC-H–Implementação e Avaliação de Sistema MPSoC Utilizando a Rede Hermes\n", "abstract": " As NoCs estão surgindo como uma possível solução para as restrições das arquiteturas de interconexões existentes devido as seguintes características:(i) eficiência no consumo de energia;(ii) largura de banda escalável, quando comparada à arquiteturas de barramento tradicionais;(iii) reusabilidade;(iv) desisões de roteamento distribuídas;(v) paralelismo na comunicação. Graças a essas características, as NoCs tornam-se a melhor opção de estrutura de comunicação para o projeto de sistemas multiprocessados (MPSoCs).MPSoCs são antes de tudo SoCs, os quais incluem diversos processadores programáveis. SoCs geralmente visam a especialização, procurando atingir objetivos como alto desempenho, e redução de custo e consumo. MPSoCs tentam balancear especialização e programação, pois os processadores permitem que o SoC seja programado após sua fabricação. São muitas vezes referidos como plataformas porque viabilizam muitas implementações para um determinado tipo de sistema. A programação oferece como vantagens o fato de o mesmo chip pode ser usado em diversos produtos, reduzindo o custo do produto e proporcionando um tempo de vida útil superior a um SoC especializado [WOL05].", "num_citations": "7\n", "authors": ["519"]}
{"title": "Redes Intra-Chip parametrizáveis com interface padrão para síntese em Hardware\n", "abstract": " A evolução tecnológica tem permitido aumentar a complexidade dos projetos, e por conseqüência o número de núcleos de propriedade intelectual em um mesmo circuito integrado. Este acréscimo de núcleos conduz à pesquisa de novas estruturas de interconexão intra-chip que devem atender as necessidades de comunicação dos futuros SoCs: escalabilidade, reusabilidade e paralelismo. Uma destas estruturas de interconexão são as redes intra-chip, ou NoCs. As redes intrachip utilizam conceitos de redes de interconexão de computadores paralelos e redes de computadores. Para auxiliar no projeto de SoCs a reusabilidade das estruturas de interconexão e dos módulos de hardware é indispensável. Para aumentar a reusabilidade de projeto, as interfaces externas dos núcleos e as interfaces das estruturas de interconexão devem ser padronizadas. Neste cenário, o presente trabalho concentra-se no desenvolvimento de redes intra-chip parametrizáveis com interface padrão OCP para síntese em hardware. A maior contribuição desse trabalho consiste na unificação destas frentes de estudo, NoCs e interfaces padrão, através do desenvolvimento da ferramenta Maia, a qual automatiza a geração de redes intra-chip com interface padrão OCP.", "num_citations": "7\n", "authors": ["519"]}
{"title": "Tendências em Reconfiguração dinâmica de FPGAs\n", "abstract": " Esta palestra compreende quatro partes:(1) a primeira parte introduz conceitos relacionados à reconfiguração parcial, assim como justifica seu uso;(2) a segunda parte apresenta o estado-da-arte em sistemas reconfiguráveis, classificando-os temporamelmente;(3) a terceira parte da palestra analisará as duas únicas famílias de dispositivos configuráveis (disponíveis comercialmente) que habilitam reconfigurabilidade dinâmica e parcial;(4) a última parte da palestra mostrará as tendências observadas na literatura quanto à reconfiguração parcial e dinâmica.", "num_citations": "7\n", "authors": ["519"]}
{"title": "R8 Processor Architecture and Organization Specification and Design Guidelines\n", "abstract": " In the start of 1997, a major revision of the then 13-year old Computer Science undergraduate curriculum started to be applied. The new curriculum significantly enhanced the hardware contents taught with regard to the previous one. Also, the hardware courses track in the curriculum was designed to expose students very early to hardware design using mostly professional tools. The reasoning to do so is exposed in detail in [1]. The basic idea is to propose a processor implementation as practical work to be developed along several semesters. First, the students have to produce a processor description from a detailed specification, implementing it in a hardware description language (currently, VHDL). Validation of their design is achieved by functional simulation. This happens in the third semester of the curriculum. A following course requires the students to start from their previous semester design and transform their implementation into a pipelined processor with the same architecture (register bank, instruction set, etc.). In a subsequent course, input-output capabilities and memory hierarchy considerations are added to the same design.Every semester, a different processor specification is prepared. Specifications differ from one another in some aspects, the main ones being the requirement of unified memory or Harvard organization and obviously instruction set. However, all processors share common characteristics of being load-store, 16-bit RISC-like architectures, with a bank of 16 16-bit registers, and the instruction word length being fixed at 16 bits. These characteristics define the Rx clan. The first of these specifications was the R1 …", "num_citations": "7\n", "authors": ["519"]}
{"title": "System Prototyping dedicated to Neural Network Real-Time Image Processing\n", "abstract": " Pattern localization and classification are CPU time intensive being normally implemented in software, however with lower performance than custom implementations. Custom implementation in hardware (ASIC) allows real-time processing, having higher cost and time-to-market than software implementation. We present an alternative that represents a good trade-off between performance and cost. This paper presents initially the state-of-the-art in this field, analyzing the performance and implementation of each work. After we propose a system for localization and classification of shapes using reconfigurable devices (FPGA) and a signal processor (DSP) available in a flexible codesign platform. The system will be described using C and VHDL languages, for the software and hardware parts respectively, and has been implemented in an APTIX prototyping platform.", "num_citations": "7\n", "authors": ["519"]}
{"title": "Métodos para desenvolvimento e distribuição de IP cores\n", "abstract": " This work addresses the need of using predesigned and preverified circuit designs (cores) to implement complex systems. The design flow using cores to implement system-on-a-chip devices is discussed. A set of tools to implement a core distribution system is presented. The implemented environment allows to share soft and hard cores. Hard cores, distributed as FPGA bitstreams, can be useful only if partial reconfiguration is supported. We first address complete reconfiguration, presenting a system that allows remote and complete bitstream reconfiguration. The last part of this paper proposes an approach that virtualizes the hardware, using dynamic and partial reconfiguration.", "num_citations": "7\n", "authors": ["519"]}
{"title": "An improved path enumeration method considering different fall and rise gate delays\n", "abstract": " Most of path enumeration-based timing analysis tools use a single delay per gate for path delay calculation. However, the timing analysis of current submicron designs demands more accurate delay calculation methods, which can improve path enumeration accuracy and especially, critical delay estimation accuracy. This paper presents modifications to the classical best-first procedure proposed by Yen et al. (1989) in order to consider a pair of delays per gate. The increase in the accuracy of path delay calculation is evaluated by running both the original and the improved path delay calculation methods on the ISCAS'85 circuits.", "num_citations": "7\n", "authors": ["519"]}
{"title": "Security in Many-Core SoCs Leveraged by Opaque Secure Zones\n", "abstract": " This paper presents an original approach to protect the execution of applications with security constraints in many-core systems. The proposed method includes three defense mechanisms. The first one is the application admission into the many-core using ECDH and MAC techniques. The second is the spatial reservation of computation and communication resources, resulting in an Opaque Secure Zone (OSZ). The key feature enabling the runtime creation of OSZs is a rerouting mechanism responsible for deviating any traffic traversing an OSZ. The last mechanism is the access to peripherals using a secure protocol to open access points in the OSZ border, and lightweight encryption mechanisms.", "num_citations": "6\n", "authors": ["519"]}
{"title": "Runtime energy management under real-time constraints in MPSoCs\n", "abstract": " The workload of many-core systems includes real-time (RT) applications. Obtain energy savings while executing RT applications is a challenge due to the RT timing constraints. The techniques used to reduce the consumption, as dynamic voltage and frequency scaling (DVFS), usually delays the applications, leading to constraint violations. Most works in the literature ensure RT constraints based on design-time analysis of the expected workload by defining the voltage and frequency levels. Our main contribution is the proposal of a Runtime Energy Management for RT applications (RT-REM), using monitored data, and DVFS and task mapping as actuation policies. Supervising the application slack time enables to save energy of RT applications. Evaluations on many-core systems (up to 144 PEs), achieves 18% in energy savings, keeping constraint misses below 2.5%. Our proposal stands out from related works …", "num_citations": "6\n", "authors": ["519"]}
{"title": "System management recovery protocol for MPSoCs\n", "abstract": " The advances in silicon technology lead to systems with hundreds of processors, the NoC-based MPSoCs. However, the higher fault probability in deep sub-micron technologies shortens the integrated circuits lifetime. Operating systems enable to execute distributed applications in the MPSoC processing elements (PEs). Large systems require PEs dedicated to management purposes, for example, execute the task mapping, handle monitoring data, and run self-awareness adaptation. This paper addresses an MPSoC hierarchically organized: PEs with an embedded operating system executing the applications (SpE) and dedicated PEs manage at runtime the system resources (Mpe). A rich literature presents fault-tolerant proposals for the hardware and software components of the MPSoC, but there is a significant gap related to fault-tolerant approaches at the system level, i.e., related to the PEs with the function to …", "num_citations": "6\n", "authors": ["519"]}
{"title": "A Fast Runtime Fault Recovery Approach for NoC-Based MPSoCS for Performance Constrained Applications\n", "abstract": " Mechanisms for runtime fault-tolerance in Multi-Processor System-on-Chips (MPSoCs) are mandatory to cope with transient and permanent faults. This issue is even more relevant in nanotechnologies due to process variability, aging effects, and susceptibility to upsets, among other factors. The literature presents isolated solutions to deal with faults in the MPSoC communication infrastructure. In this context, one gap to be fulfilled is to integrate all layers, resulting in a solution to cope with NoC faults from the physical layer up to the application layer. The goal of this work is to present a runtime integrated approach to cope with NoC faults in MPSoCs. The original contribution is the proposal of a set of hardware and software mechanisms to ensure both efficient and reliable communication in NoC-based MPSoCs. The proposal has an acceptable silicon area overhead and a small memory footprint. Experiments …", "num_citations": "6\n", "authors": ["519"]}
{"title": "Runtime QoS Support for MPSoC: a Processor Centric Approach\n", "abstract": " The MPSoC literature related to runtime support of Quality of Service (QoS) presents proposals related to the management of the interconnection infrastructure and the processing elements (PEs). The QoS management of computation resources is essential to fulfill real-time (RT) applications, as in multimedia systems, where dynamic workload and CPU sharing are commonplace. However, few works concerning QoS at the processor level for RT applications are found in the literature. The proposed work provides a runtime support for QoS acting in the PEs, coupled to a monitoring scheme at the task level. The main goal of the present work is to employ a low overhead task migration combined with task scheduling priority, to increase the computation resources for RT applications. An important feature of the proposal is to act indirectly over the QoS application, by minimizing the interference of the best effort (BE) tasks …", "num_citations": "6\n", "authors": ["519"]}
{"title": "Charge Sharing Aware NCL Gates Design\n", "abstract": " Interest in asynchronous circuits has increased in the VLSI research community due the growing limitations faced during the design of synchronous circuits, which often result in over constrained design and operation. For designing asynchronous circuits quasi-delay-insensitive approaches are often preferable due to their simple timing analysis and closure. Null Convention Logic (NCL) is a style that supports quasi-delay-insensitive design and enables power-, area- and speed-efficient circuits using a standard-cell methodology. However, the correct functionality of such circuits can be jeopardized by glitches caused by charge sharing effects, which can generate single event upsets. This work scrutinizes the electrical behavior of NCL gates and proposes design optimizations that improve their robustness to charge sharing glitches. Experimental results suggest that the proposed optimizations lead to more robust …", "num_citations": "6\n", "authors": ["519"]}
{"title": "Comparative analysis of dynamic task mapping heuristics in heterogeneous NoC-based MPSoCs\n", "abstract": " Dynamic mapping heuristics can cope with dynamic application scenarios by allocating tasks to cores of an MPSoC during runtime. In this paper, we compare eight heuristics in terms of the response time of application tasks - that is, the time between the issuing of a task and the time when it completes executing and communicating. By taking into account the task execution, communication and waiting times, we could better evaluate the quality of the different heuristics and show that there is room for improvement when it comes to heterogeneous platforms under high utilization.", "num_citations": "6\n", "authors": ["519"]}
{"title": "Mazenoc: Novel approach for fault-tolerant noc routing\n", "abstract": " This paper presents an original approach to define a path between two routers in a NoC with faulty routers. Current state-of-the art adopts non-scalable solutions, using tables to store paths, or distributed approaches that keep the status of neighbor routers. The proposed approach searched its foundations in the firsts routing algorithms for VLSI circuits, using a three-step process: seek new path, backtrack the path, store the new path. Results demonstrate the effectiveness of the approach, with the algorithm being able to find the path between routers in complex scenarios, with a small area overhead over a baseline router.", "num_citations": "6\n", "authors": ["519"]}
{"title": "Exploring dynamic mapping impact on NoC-based MPSoCs performance using a model-based framework\n", "abstract": " The power evaluation of NoC-based MPSoCs is an important and a time-consuming process. Mapping tasks onto processing elements (PEs) has a critical impact on system performance, as well as power dissipation. To cope with complex dynamic behavior of applications, it is common to perform task mapping at runtime so that the utilization of processors and interconnect can be taken into account when deciding the most appropriate PE to host tasks. On the other hand, the process of accurately comparing different mapping heuristics can be very costly once each adopted solution has to be evaluated using simulation that can take hours or even days in the case of large MPSoCs. In this context, this paper has two major contributions:(i) evaluation of dynamic mapping by employing a model-based framework that unifies abstract models of applications, NoC-based platforms and mapping heuristics, and (ii) power …", "num_citations": "6\n", "authors": ["519"]}
{"title": "Evaluating the impact of communication latency on applications running over on-chip multiprocessing platforms: a layered approach\n", "abstract": " The evaluation of communication latency in multiprocessor platforms requires the profiling of the application, the description of the architecture of the platform and of the mapping of application tasks onto processing cores. In this paper, we describe a layered approach that allows application developers to obtain accurate figures for communication latency from an abstract model of the application functionality. A complete separation of concerns is a critical part of this approach, so the major contribution here is the definition of interfaces between different layers: an abstract application model, its executable counterpart, the mapping heuristic and the multiprocessor platform model. Case studies with a realistic application and a NoC-based multiprocessor platform show the potential of the proposed approach using two different system evaluation techniques: simulation and static analysis.", "num_citations": "6\n", "authors": ["519"]}
{"title": "Increasing NoC power estimation accuracy through a rate-based model\n", "abstract": " This research work presents and compares two NoC power estimation models, one based on the volume of information transmitted in the network, and another based on the transmission rates of each router.", "num_citations": "6\n", "authors": ["519"]}
{"title": "Effective industry-academia cooperation in telecom: a method, a case study and some initial results\n", "abstract": " This work suggests a method to achieve successful cooperation between industry and academia in telecommunication in the context of developing countries. To illustrate the method, the authors describe a case study on how to integrate an academic research group and an industrial development team to generate useful research results as well as products. The trade-off that must be done between academic and industrial interests is stressed as the single most important point of an effective cooperation between industry and academia. The authors present the first results obtained in an ongoing cooperation. The paper also presents a set of issues that must be addressed to improve the quality of the method and consequently the satisfaction of both parties involved.", "num_citations": "6\n", "authors": ["519"]}
{"title": "Pre-layout performance prediction for automatic macro-cell synthesis\n", "abstract": " In this paper we present an approach allowing the area and delay prediction of macro-cells to be used in automatic layout synthesis tools. These parameters are of great importance in IC design. They allow us to guide the floor planning phase of an IC by specifying the number of rows and the aspect ratio of the macro-cell or to explore the power delay trade-off by selecting the size of the transistors (before layout generation) to satisfy the user constraints. We propose here a calibration method based on specific benchmarks to determine post-layout parasitic contribution at pre-layout level. Experimental results are given when we compare predicted and simulated post-layout performances of various circuits for different sizing alternatives.", "num_citations": "6\n", "authors": ["519"]}
{"title": "An environment to Design Digital Circuits Based on the Brazilian Gate-Array\n", "abstract": " This paper describes AGÁ (H), a low cost custom environment to design digital circuits based on the Brazilian Gate Array. The matrix and its metal programming are provided by Centro Tecnológico para a Informática, CTI. All aspects regarding the current status of the CAD system are presented, as well as future developments and distribution policy. Although all the system runs in IBM-PC and Sun workstations, the project is targeted to IBM-PC platforms.", "num_citations": "6\n", "authors": ["519"]}
{"title": "SDN-Based Secure Application Admission and Execution for Many-Cores\n", "abstract": " General-purpose many-core system-on-chip (MCSoC) requires support to the execution of dynamic workloads, i.e., admission of new applications at runtime. Some applications may require QoS and security from the MCSoC, not tolerating that malicious tasks or hardware Trojans steal or corrupts their data. A robust method to provide security is to isolate the communication and computation. Most current works employ such isolation in continuous regions named secure zones (SZ). Motivated by the recent study of the Software-Defined Networking (SDN) paradigm for MCSoCs, this work proposes to use SDN-based management to implement the communication isolation at runtime. The computation isolation occurs by mapping only tasks of the same application at each core. The communication isolation is supported by the SDN paradigm, which establishes dedicating paths for secure applications. Results show that …", "num_citations": "5\n", "authors": ["519"]}
{"title": "Self-adaptive qos management of computation and communication resources in many-core socs\n", "abstract": " Providing quality of service (QoS) for many-core systems with dynamic application admission is challenging due to the high amount of resources to manage and the unpredictability of computation and communication events. Related works propose a self-adaptive QoS mechanism concerned either in communication or computation resources, lacking, however, a comprehensive QoS management of both. Assuming a many-core system with QoS monitoring, runtime circuit-switching establishment, task migration, and a soft real-time task scheduler, this work fills this gap by proposing a novel self-adaptive QoS management. The contribution of this proposal comes with the following features in the QoS management: (i) comprehensiveness, by covering communication and computation resources; (ii) online, adopting the ODA (Observe, Decide, Act) runtime closed-loop adaptation; and (iii) reactive and proactive …", "num_citations": "5\n", "authors": ["519"]}
{"title": "Exploring RSA performance up to 4096-bit for fast security processing on a flexible instruction set architecture processor\n", "abstract": " This paper explores the RSA (Rivest, Adi Shamir and Leonard Adleman) encryption/decryption performance using a scalable and programmable approach with an improved processor architecture and software implementation. The methodology gives a new perspective when investigates the design and performance of custom hardware on a flexible instruction set architecture platform targeting embedded systems. The approach consists of design new hardware stages at the same time uses an open-source big number library to execute operations up to 4096-bit length. All the optimizations are based on Montgomery Modular Multiplication and Exponentiation, employing it to perform RSA operations. Our experiments show that the overall performance of the hybrid solution is comparable and sometimes outperforms dedicated solutions, therefore it can be put into perspective as an effective and viable choice …", "num_citations": "5\n", "authors": ["519"]}
{"title": "Evaluating serialization for a publish-subscribe based middleware for MPSoCs\n", "abstract": " Efficient serialization is a must-have feature in distributed embedded protocol stacks because of the restrained resources available for use in such systems. Although there are many serialization libraries out there, only some of them focus on resource usage, which is of most importance for the embedded domain. Thus, a comparison of serialization libraries considering resource usage is of high relevance for the embedded systems domain. This paper presents an experiment-based comparison of serialization libraries while concentrating on resource usage for a multiprocessor system-on-chip (MPSoC) platform. Results show that MsgPuck library surpasses other libraries for both serialization speed and memory consumption criteria.", "num_citations": "5\n", "authors": ["519"]}
{"title": "Runtime energy management for many-core systems\n", "abstract": " The on-chip power dissipation limits the number of active transistors on recent CMOS technologies nodes. Designs have to adopt power techniques as power-gating and/or DVFS for respecting the restricted power budget. As a result of the limited power budget scenario, the management of many-core systems must support power techniques for improving the energy efficiency of such systems while avoiding power emergencies. Due to the complexity of developing a power management solution, researchers adopt high-level models which abstract characteristics of real systems. On the other hand, low-level proposals are not scalable or limited to small systems. This work proposes a Runtime Energy Management (REM) for many-core systems using fine-grain DVFS as the primary power control policy. Scalability is ensured by a distributed management architecture, responsible for power monitoring and actuation on …", "num_citations": "5\n", "authors": ["519"]}
{"title": "A hierarchical LST-based task scheduler for NoC-based MPSoCs with slack-time monitoring support\n", "abstract": " Emerging large-scale MPSoCs can have hundreds of PEs (Processing Elements), and scalable real-time support is necessary. Current proposals in MPSoCs scheduling have static behaviors or lack accurate validation, from a clock cycle model of the system. This paper proposes a hierarchical scheduling algorithm. At the bottom level, each PE executes a local LST-based scheduler algorithm with extended features to handle with inter-task communication and interruption overheads. At the top level, a global scheduler manages at run-time task mapping and real-time adaptation by using task migration and monitored information. The run-time adaptation is supported by a slack time monitoring that notifies the global scheduler the slack time of the PEs. The monitoring data, combined with traditional real-time metrics, provide a powerful real-time management that, as demonstrated by a clock cycle validation, can be …", "num_citations": "5\n", "authors": ["519"]}
{"title": "MoNoC: A monitored network on chip with path adaptation mechanism\n", "abstract": " Complex systems on chip containing dozens of processing resources with critical communication requirements usually rely on the use of networks on chip (NoCs) as communication infrastructure. NoCs provide significant advantages over simpler infrastructures such as shared busses or point to point communication, including higher scalability, more efficient energy management, higher bandwidth and lower average latency. Applications running on NoCs with more than 10% of bandwidth usage attest that the most significant portion of message latencies refers to buffered packets waiting to enter the NoC, whereas the latency portion that depends on the packet traversing the NoC is sometimes negligible. This work presents an adaptive routing architecture, named Monitored NoC (MoNoC), which is based on a traffic monitoring mechanism and the exchange of high priority control packets. This method enables to …", "num_citations": "5\n", "authors": ["519"]}
{"title": "Runtime Fault Recovery Protocol for NoC-based MPSoCs\n", "abstract": " The design of reliable MPSoCs is mandatory to cope with faults during fabrication or product lifetime. For instance, permanent faults on the interconnect network can stall or crash applications even though the network has alternative fault-free paths to a given destination. This paper presents a novel fault-tolerant communication protocol that takes advantage of the NoC parallelism to provide alternative paths between any source-target pair of processors, even in the presence of multiple faults. At the application layer, the method is seen as a typical MPI-like message passing protocol. At the lower layers, the method consists of a software kernel layer that monitors the regularity of message exchanges between pairs of tasks. If a message is not delivered in a certain time, the software fires a path finding mechanism implemented in hardware, which guarantees complete network reachability. The proposed approach …", "num_citations": "5\n", "authors": ["519"]}
{"title": "Multi-level MPSoC modeling for reducing software development cycle\n", "abstract": " Multiprocessor SoCs (MPSoCs) have rapidly evolved towards high-performance heterogeneous computing systems designed under performance, power efficiency and scalability concerns. Such systems accomplish billions of operations per second moving towards hundreds of processing elements that communicate through a network-on-chip. The hardware and software complexity of such systems is increasing dramatically, resulting in new design challenges, such as providing scalable modeling facilities and verification for both hardware and software. This work proposes a multi-level design approach for MPSoCs, targeting the reduction of software development cycle. The paper also presents different scenarios for exploration purposes, showing the benefits in term of design space exploration for to the proposed environment.", "num_citations": "5\n", "authors": ["519"]}
{"title": "A Generic FPGA Emulation Framework\n", "abstract": " Verification techniques face growing challenges, as digital system design becomes increasingly complex. Currently, verification is believed to be the main bottleneck for expedite complex designs, consuming at least 70% of the whole system development effort. This paper proposes a new, generic hardware emulation framework to improve the observability of designs as well as reducing emulation-based verification intrusiveness. The proposed emulator provides enhanced observability and controllability of inner workings of the system when compared to commercial FPGA-based emulators and is less intrusive on the design under verification. As FPGA-vendor specific products, the proposed emulator is generic, supporting in principle any digital system design. To enhance flexibility, stimuli generation and response capture is under control of a host computer and communication between the host and the design …", "num_citations": "5\n", "authors": ["519"]}
{"title": "Enhancing Performance of MPSoCs through Distributed Resource Management\n", "abstract": " The constant growth in the number of cores in SoCs implies an important issue: scalability. NoC-based MPSoCs offer scalability at the hardware level. However, the management of the MPSoC resources requires also scalable methods, to effectively extract the computational power offered by dozens of processors. State-of-the-art proposals adopt different approaches to tackle such problem, using the MPSoC clustering as the most common approach. The present work proposes a distributed mapping approach, using a clustering method, having as main goal to evaluate its pros and cons. Evaluation is carried-out using cycle accurate simulation, in large MPSoCs (up to 144 processors). Results show an important reduction in the total execution time of the applications running in the MPSoC, even if some processors are reserved for resources management.", "num_citations": "5\n", "authors": ["519"]}
{"title": "Exploiting multicast messages in cache-coherence protocols for NoC-based MPSoCs\n", "abstract": " MPSoCs are largely used in embedded systems, allowing the design of complex systems within short time-to-market. The shift in the communication infrastructure, from buses to networks-on-chip (NoCs), adds new design challenges. Standard directory-based cache coherence protocols represent a performance bottleneck due to number of transactions in the network, reducing performance and increasing the energy consumption. State-of-the-art works investigate new protocols, at abstract levels (e.g. TLM), to optimize the performance of the memory organization. Differently from previous works, we investigate the benefits NoCs can bring to directory-based cache coherence protocols using RTL modeling. The main functionality NoCs may provide for the protocols is the way messages are sent through the network. Most NoCs support multicast as a set of unicast messages. Such method is not suitable for cache …", "num_citations": "5\n", "authors": ["519"]}
{"title": "SPP-NIDS-a sea of processors platform for network intrusion detection systems\n", "abstract": " A widely used approach to avoid network intrusion is SNORT, an open source network intrusion detection system (NIDS). This work describes SPP- NIDS, a architecture for intrusion detection supporting SNORT rules. SPP-NIDS is attractive to real-world network intrusion detection, due to its scalability, flexibility and performance features. A parameterizable cluster of simple processors provides system scalability. Hardware NIDSs described in the literature often employ hardwired comparators to verify if the incoming network traffic has data potentially containing intrusion attacks. Such NIDSs must be re-synthesized when a new set of rules is available, which happens frequently. In SPP-NIDS, the rule set defining network intrusion patterns is stored in RAM, enabling its straightforward upgrade. The proposed system, when implemented in a 2-million gate FPGA is able to work at a 100 Mbps network data rate, using the …", "num_citations": "5\n", "authors": ["519"]}
{"title": "A leak resistant architecture against side channel attacks\n", "abstract": " Hardware implementations of cryptographic algorithms may leak some information that can be used to recover cryptographic keys. This work combines reconfigurable techniques with the recently proposed leak resistant arithmetic (LRA) to thwart some side channel attacks (SCA). The introduced architecture outcomes the performance of classical implementation of modular multiplication, for key size exceeding 2048 bits, with a reasonable extra area overhead. Nevertheless, this is not a drawback, but a cost, since the main issue of the proposed architecture is the improved robustness in terms of security.", "num_citations": "5\n", "authors": ["519"]}
{"title": "Test time reduction reusing multiple processors in a network-on-chip based architecture\n", "abstract": " The increasing complexity and the short life cycles of embedded systems are pushing the current system-on-chip designs towards a rapid increase in the number of programmable processing units, while decreasing the gate count for custom logic. Considering this trend, this work proposes a test planning method capable of reusing available processors as test sources and sinks, and the on-chip network as the test access mechanism. Experimental results are based on ITC'02 benchmarks and on two open core processors, compliant with MIPS and SPARC instruction sets. The results show that the cooperative use of both the on-chip network and the embedded processors can increase the test parallelism and reduce the test time without additional cost in area and pins.", "num_citations": "5\n", "authors": ["519"]}
{"title": "Réseau d'Interconnexion pour les Systèmes sur Puce: le Réseau HERMES\n", "abstract": " Les connexions dédiées et les bus ne seront probablement plus utilisées dans cinq ou dix ans, à cause de leur manque de flexibilité et de leur faible scalabilité. Ces interconnexions seront remplacées par des réseaux sur puce (NOC Network On Chip) à commutation de paquet et une synchronisation de type GALS (Globalement Asynchrone Localement Synchrone). Apres un rapide état de l’art, nous étudions un réseau maillé à commutation de paquet appelé Hermes. Nous montrerons les performances obtenues par ce type de réseau, notamment en terme de latence et de débit.", "num_citations": "5\n", "authors": ["519"]}
{"title": "Arquitetura multiprocessada em SoCs: estudo de diferentes topologias de conexão\n", "abstract": " A maior parte do desenvolvimento de métodos e ferramentas para o projeto de sistemas digitais das últimas quatro décadas (60 a 90) derivaram de necessidades relacionadas com o projeto de computadores e sistemas periféricos. Contudo, a ênfase de pesquisa tem se deslocado gradativamente para um mercado muito mais vasto, o de sistemas eletrônicos que entram na composição de produtos de uso específico. Exemplos são automóveis, aeronaves, eletrodomésticos e dispositivos de comunicação pessoal tais como telefones celulares e pagers. Sistemas embarcados ou sistemas embutidos são para todos os efeitos, sistemas computacionais que executam uma função específica. Eles possuem a mesma estrutura geral de um computador, mas a especificidade de suas tarefas faz com que não sejam nem usados nem percebidos como um computador [DEM95][LAV95].De acordo com vários autores [HAM97][PAT97], em menos de 7 anos já existirão no mercado circuitos integrados compostos por mais de um bilhão de transistores. Com esta capacidade de integração, pode-se imaginar a inclusão de um sistema computacional completo em um mesmo chip, o que cria o conceito de SoC (System On a Chip). A vantagem na utilização de SoCs está na interface de comunicação, pois nos sistemas atuais o maior gargalo é a perda de desempenho causada pela troca de informações entre o hardware e o software executados em CIs (Circuitos Integrados) distintos. Caso os componentes de hardware e software estejam integrados em um único CI, o desempenho global do sistema tende a ser muito maior. Além do mais, a possibilidade de …", "num_citations": "5\n", "authors": ["519"]}
{"title": "Desenvolvimento de um Ambiente de Co-Simulação Distribuído e Heterogêneo\n", "abstract": " Este trabalho apresenta a implementação de um ambiente de simulação conjunta entre módulos hardware e software. Este ambiente é composto por diversos simuladores para cada módulo do sistema, que podem estar distribuídos em uma WAN (wide area network). Os simuladores se comunicam com uso de sockets através de um programa roteador que estabelece a conexão entre todos os módulos. Um simples estudo de caso é apresentado com o objetivo de validar esta metodologia de co-simulação.", "num_citations": "5\n", "authors": ["519"]}
{"title": "Design of a classification system for rectangular shapes using a co-design environment\n", "abstract": " Pattern localization and classification are CPU time intensive, being normally implemented in software. Custom implementations in hardware allow real-time processing. In practice, in ASIC or FPGA implementations, the digitization process introduces errors that should be taken into account. This paper presents initially the state-of-the-art in this field, analyzing the performance and implementation of each work. After we propose a system for rectangular shapes localization and classification using reconfigurable devices (FPGA) and a signal processor (DSP) available in a flexible codesign platform. The system will be described using C and VHDL languages, for the software and hardware parts respectively. Finally, the classification block of the system, implemented as an artificial neural network (ANN) in a rapid prototyping platform, is described.", "num_citations": "5\n", "authors": ["519"]}
{"title": "Fine-grain temperature monitoring for many-core systems\n", "abstract": " The power density may limit the amount of energy a many-core system can consume. A many-core at its maximum performance may lead to safe temperature violations and, consequently, result in reliability issues. Dynamic Thermal Management (DTM) techniques have been proposed to guarantee that many-core systems run at good performance without compromising reliability. DTM techniques rely on accurate temperature information and estimation, which is a computationally complex problem. However, related works usually abstract the temperature monitoring complexity, assuming available temperature sensors. An issue related to temperature sensors is their granularity, frequently measuring the temperature of a large system area instead of a processing element (PE) area. Therefore, the first goal of this work is to propose a fine-grain (PE level) temperature monitoring for many-core systems. The second one …", "num_citations": "4\n", "authors": ["519"]}
{"title": "A Framework for Heterogeneous Many-core SoCs Generation\n", "abstract": " This work presents a framework for heterogeneous many-core SoCs generation, which comprises a flexible EDA (Electronic Design Automation) framework and a many-core model for heterogeneous SoCs. The framework together with the many-core model supports the integration of processors, network interfaces, routers, and peripherals. The hardware model is cycleaccurate, with a SystemC model to speed up simulation time and a VHDL model enabling prototyping in FPGAs devices. The framework provides a rich set of graphical debugging tools enabling an easy and intuitive understanding of computation and communication events happening at runtime. The coupled integration of the platform model to the EDA framework makes the many-core well suited to be employed in research and teaching. As case-study, we provide an evaluations addressing the many-core generation, simulation, and debugging.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Secure Admission of Applications in Many-Cores\n", "abstract": " The adoption of many-cores systems makes the concern for data protection a critical design requirement. A secure application that processes sensitive data may have its security harmed by a malicious process. The literature contains several proposals to protect many-cores against attacks, focusing for example in the protection of the application execution or the access to shared memories. However, a complete solution, covering the entire application lifetime is a gap to be fulfilled. Designers must follow these steps to protect the execution of an application: provide a secure admission process; give to the application a protected environment to execute; protect the access to memory and peripherals. The article main goal is to cover the secure admission by using mutual authentication, and Message Authentication Code (MAC) to guarantee the integrity of applications during the object code transfer. This work also …", "num_citations": "4\n", "authors": ["519"]}
{"title": "Secure Environment Architecture for MPSoCs\n", "abstract": " The widespread use of complex MPSoCs (Multiprocessor SoCs) is a trend in the semiconductor industry due to the increasing demand for interconnected devices, thus Internet of Things (IoT). The use these devices to store, process and protect private information increases everyday, since all devices are interconnected. As a goal to create resilience against attacks on users' information, this paper proposes a secure architecture and provides the costs of increasing the security for MPSoCs. The secure architecture contains a firewall capable of filtering incoming and outgoing network traffic and ciphering sensitive information by performing end-to-end encryption using an AES cipher block. The keys are stored at each firewall using a secure channel, through a dedicated path, isolated from the NoC. The firewall and the AES block increases the router area by 95.63% and the application execution time increases in the …", "num_citations": "4\n", "authors": ["519"]}
{"title": "Exploring the impact of soft errors on NoC-based multiprocessor systems\n", "abstract": " Software reliability is an essential design metric in emerging large-scale multiprocessor embedded systems. Designers should identify soft error susceptibility of multiple applications executing in parallel early in the design time to ensure reliable system operation. This work proposes a non-intrusive fault injection engine that enables to conduct bespoke soft error analysis, allowing to identify and understand the soft error propagation through the processing elements (PEs). The proposed fault injection campaign evaluates the impact of soft errors considering real benchmarks in an RTL model of a distributed-memory NoC-based multiprocessor. Experiments demonstrate that 19% of soft errors are propagated to other PEs, where 31.6% of them led to erroneous computation and 58.4% to a system crash. Thus, the fault analysis must consider not only its local effect on the processor and memory but also how the fault …", "num_citations": "4\n", "authors": ["519"]}
{"title": "Secure admission and execution of applications in many-core systems\n", "abstract": " Many-core architectures are similar to a computer network, where it is necessary to ensure the security during the execution of sensitive applications. This article discusses two security-related issues: the secure admission of applications and the prevention of resource sharing during their execution. The safe application admission is an open research subject for many-core systems. Although several methods are available for the Internet, computer networks, and software in general, low-cost computational proposals were not yet been proposed for many-core systems. Methods preventing resource sharing adopts firewalls, encryption mechanisms, and resource isolation to deal with the security threats. This paper proposes a protocol, executed at runtime, to tackle these issues. The application admission authenticates trusty entities. An entity authenticated might deploy applications, requiring only a MAC verification to …", "num_citations": "4\n", "authors": ["519"]}
{"title": "MPSoCBench: A benchmark for high-level evaluation of multiprocessor system-on-chip tools and methodologies\n", "abstract": " Recent design methodologies and tools aim at enhancing the design productivity by providing a software development platform before defining the final MPSoC architecture details. Motivated by the lack of MPSoC virtual platforms prototyping integrating both scalable hardware and software in order to create and evaluate new methodologies and tools, we present the MPSoCBench, a scalable set of MPSoCs including four different ISAs (PowerPC, MIPS, SPARC, and ARM) organized in platforms with up to 64 cores, cross-compilers, IPs, interconnections, 17 parallel versions of software from well-known benchmarks, and power consumption estimation for main components (processors, routers, memory, and caches), including DVFS support.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Efficient traffic balancing for NoC routing latency minimization\n", "abstract": " Modern technologies of integrated circuits allow billions of transistors arranged into a single chip, enabling to implement complex systems, which need a scalable and parallel communication architecture. Network-on-Chip (NoC) is a natural candidate to fulfill such communication requirements, providing high performance when the communication demands are balanced. This work proposes a new static balancing method that uses the application's traffic pattern for NoC latency reduction. This method allows the generation of a deterministic routing algorithm with simplistic implementation and low latency. Experimental results compare four balancing methods, showing the improvement of the proposed static balancing concerning the average NoC latency.", "num_citations": "4\n", "authors": ["519"]}
{"title": "A lightweight software-based runtime temperature monitoring model for multiprocessor embedded systems\n", "abstract": " High-thermal variation and temperature operation can have a noteworthy impact on system performance, power consumption and reliability, which is a major and increasingly critical design metric in emerging multiprocessor embedded systems. Existing thermal management techniques rely on physical sensors to provide them with temperature figures to regulate the system's operating temperature and thermal variation at runtime. However, on-chip thermal sensors present limitations (e.g. extra power and area cost), which may restrict their use in large scale systems. In this regard, this paper proposes a lightweight software-based runtime temperature model, enabling to capture detailed temperature distribution information of multiprocessor systems at a negligible overhead. To validate the proposal, the model is embedded in a distributed-memory MPSoC platform described in RTL. Further, results show that the …", "num_citations": "4\n", "authors": ["519"]}
{"title": "Tool-set for NoC-based MPSoC Debugging – A Protocol View Perspective\n", "abstract": " Software development becomes an important issue in today's MPSoC design. Due to the inherent non-deterministic behavior of MPSoCs, they are prone to concurrency bugs. Debugging tools for MPSoC may be grouped in the following classes: simulators, parallel software development environments, NoC debuggers. An important gap is observed concerning a complete NoC-based MPSoC: tools to inspect the traffic exchanged between processing elements in a higher abstraction level, and not simply as raw data. This is the goal of the paper: propose a new class of debugging tools, able to trace the messages exchanged between PEs, enabling debugging at the protocol level. Examples of protocols include communication between tasks, mapping heuristics, monitoring schemes for QoS, among others. The paper presents the proposed debug framework, as well as a task migration protocol as case study.", "num_citations": "4\n", "authors": ["519"]}
{"title": "A Framework for MPSoC Generation and Distributed Applications Evaluation\n", "abstract": " The design of MPSoCs is a complex task. From the designer side point of view, a new feature inserted into the system (e.g. a mapping heuristic or a new function in the operating system) must be validated with a large set of the MPSoC configurations. From the application developer side point of view, the performance of a set of applications running simultaneously in the MPSoC platform must be also evaluated for different MPSoC configurations. Therefore, for both designers and application developers a framework enabling the automatic MPSoCs generation and simulation is mandatory for design space exploration. This is the goal of the present work, present a parameterizable MPSoC, including distributed management, and a framework to generate and simulate several MPSoCs configurations automatically. Results show that it is feasible to simulate large platforms, up to 400 processing elements, using a cycle …", "num_citations": "4\n", "authors": ["519"]}
{"title": "Determining the Test Sources/Sinks for NoC TAMs\n", "abstract": " Conventional approaches using the Network-on-Chip (NoC) as Test Access Mechanism (TAM), called NoC TAM, model the test sources/sinks and the routing algorithm as constraints to the test scheduling, reducing its efficiency. This paper is based on a new NoC TAM model where these constraints do not exist, potentially resulting in shorter tests. The contribution of this paper is to present the part of the test flow which determines the optimal number and location of the test sources and sinks in a NoC TAM without constraining the test scheduler. Searching the minimal number of sources/sinks can minimize the silicon area overhead since each NoC source/sink requires about 4300 gates for a NoC channel with 32-bit width.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Secure triple track logic robustness against differential power and electromagnetic analyses\n", "abstract": " Side channel attacks (SCA) are known to be efficient techniques to retrieve secret data. In this context, this paper concerns the evaluation of the robustness of secure triple track logic (STTL) against power and electromagnetic analyses on FPGA devices. More precisely, it aims at demonstrating that the basic concepts behind STTL are valid in general and particularly for FPGAs. Also, the paper shows that this new logic may provide interesting design guidelines to get circuits that are resistant to differential power analysis (DPA) attacks which and also more robust against differential electromagnetic attacks (DEMA).", "num_citations": "4\n", "authors": ["519"]}
{"title": "Implementação de uma arquitetura Reed-Solomon para uso em Redes OTN 10.7 Gbps\n", "abstract": " Observa-se, no cenário mundial, uma crescente demanda por largura de banda e qualidade de serviço, principalmente em redes de longo alcance (WANs). Esta demanda é evidenciada, cada vez mais, pelo uso de técnicas de transmissão de voz e vídeo em tempo real, o que proporciona economia e aumento de rendimento para diversas instituições.A crescente necessidade de banda incentivou a criação da recomendação G. 709 OTN (Optical Transport Network), pela ITU-T (International Telecommunications Union–Telecomunications), que define interfaces de rede para enlaces de fibra óptica de até 40Gbps [1]. A recomendação G. 709 foi construída a partir da experiência e dos benefícios dos protocolos SONET e SDH, para proporcionar a base para as redes de fibra óptica da próxima geração [2]. Porém, alguns elementos foram adicionados para aumentar o seu desempenho e reduzir custos. O elemento mais importante e mais justificativo para a criação desta nova recomendação é a inclusão de um mecanismo de controle de erros mais robusto, o que aumenta o desempenho e possibilita enlaces mais longos de fibra óptica.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Architectural issues in homogeneous noc-based mpsoc\n", "abstract": " Multi-processors systems-on-chip (MPSoCs) are becoming increasingly popular in embedded systems for the high degree of performance and flexibility they permit. While most MPSoCs are today highly heterogeneous for better fitting the target applications, homogeneous systems may become in a near future a viable alternative bringing other benefits such as run-time load balancing. The work presented in this paper relies on a homogenous NoC-based MPSoC framework we developed which allows us to conduct evaluations of 3 different techniques: proactive/reactive communication, preemptive task mapping and task replication. The impact on the system performance is discussed for several mappings of a MJPEG decoder application.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Run-time mapping and communication strategies for Homogeneous NoC-Based MPSoCs\n", "abstract": " Multiprocessor systems-on-chip are becoming increasingly popular in embedded systems for the high degree of performance and flexibility they permit. While most MPSoCs are today highly heterogeneous for better fitting the target applications, homogeneous systems may become in a near future a viable alternative bringing other benefits such as run-time load balancing, high performance and low power consumption. The work presented in this paper relies on a homogeneous NoC-based MPSoC framework we developed which allows us to conduct cycle-accurate evaluations of 2 different techniques: proactive and reactive communications.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Design and Prototyping of an E1 Drop_Insert soft core\n", "abstract": " The paper describes the design and prototyping of a telecommunication intellectual property soft core developed in the scope of an industry–academia co-operation. The soft core allows the manipulation of E1 2048 kHz 32-channel carrier information. It inserts/removes data into/from an E1 frame and multiframe structures. The soft core was fully described in VHDL, functionally validated by simulation, prototyped in FPGA platforms and certified using E1 testers. The main use of the developed soft core in the implementation of data communication equipment is to allow multiple users to share a common E1 carrier with a flexible scheme for bandwidth allocation. The main contribution of the paper is a reusable hardware module that increases performance and reduces latency of the data treatment when compared to existing commercial solutions.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Interconnection length estimation at logic-level\n", "abstract": " Accurate and fast interconnection length estimation of CMOS circuits during the design phase is essential to evaluate placement, routing and power estimation. The goal of this work is to estimate the average interconnection length of the nets for a given circuit at the logic level. We propose a look-up-table method, taking into account three parameters available at the logic level: number of cells, number of nets and fanout of each cell. To validate the method we use an automatic layout generator, TROPIC3, which generates the circuit layout from a SPICE netlist, reporting the net lengths after synthesis. The proposed method is compared with the values obtained after layout synthesis. The difference between estimated length and real length are lower then 10%.", "num_citations": "4\n", "authors": ["519"]}
{"title": "A fast prototyping neural network model for image classification\n", "abstract": " This paper presents a neural network implementation using reconfigurable devices (FPGA) and a signal processor (DSP) available in a flexible codesign platform. The network is described using C and VHDL languages, for the software and hardware parts respectively. The software part is responsible for the learning phase and the hardware part is responsible for the propagation phase. Our objective for the hardware part is twofold: define a codification for the numbers used by the network, aiming hardware cost reduction, and exploit the inherent parallelism of neural networks, aiming speed-up the image processing. We present a synchronous implementation for the network and a codification analysis using PSNR (Peak Signal Noise Ratio). Finally, is described a classification problem solved by ANN implemented in a rapid prototyping platform.", "num_citations": "4\n", "authors": ["519"]}
{"title": "Influence of logic block layout architecture on FPGA performance\n", "abstract": " Among the several FPGA technologgies available today, the comparison of tiiming performances is always device dependent.In order to compare accurately the performances of the logic block architectures used in FPGA's families, we have implemented different functions.Using a layout synthesizer we evaluate post layout performances of these functions.A methodology to optimize the size of transistor gates in Look-up Tables is proposed", "num_citations": "4\n", "authors": ["519"]}
{"title": "Security Vulnerabilities and Countermeasures in MPSoCs\n", "abstract": " MPSoCs are vulnerable to software and hardware attacks, which may access sensitive data, disrupting an application, or physically damaging the system. The present state-of-the-art proposals enforce the system security with mechanisms tightly coupled to the MPSoC architecture, with silicon cost and performance penalties. This work proposes the adoption of four security countermeasures: spatial isolation of applications, a dedicated network to send sensitive data, filters to block malicious traffic, lightweight cryptography. This proposal is decoupled from the MPSoC architecture, protecting the system from attacks, such as Denial of Service and man-in-the-middle, ensuring confidentiality and integrity to applications.", "num_citations": "3\n", "authors": ["519"]}
{"title": "A FPGA parameterizable multi-layer architecture for CNNs\n", "abstract": " Advances in hardware platforms boosted the use of Convolutional Neural Networks (CNNs) to solve problems in several fields such as Computer Vision and Natural Language Processing. With the improvements of algorithms involved in learning and inferencing for CNNs, dedicated hardware architectures have been proposed with the goal to speed up the CNNs' performance. However, the CNNs' requirements in bandwidth and processing power challenge designers to create architectures fitted for ASICs and FPGAs. Embedded applications targeting IoT (including sensors and actuators), health devices, smartphones, and any other battery-powered device may benefit from CNNs. For that, the CNN design must follow a different path, where the cost function is a small area footprint and reduced power consumption. This paper is a step towards this goal, by proposing an architecture for the main modules of modern …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Mapping of real-time applications on a packet switching NoC-based MPSoC\n", "abstract": " Many-core systems are commonplace in the consumer electronic market, with Real-Time (RT) applications being part of the workload. Therefore, the design of many-core systems (MPSoCs) requires mechanisms to meet RT constraints. The goal of this paper is to present a mapping heuristic that guarantees the RT constraints in a packet switching NoC-based MPSoC. The RT mapping heuristic adopts the response time using the Response Time Analysis (RTA) test to meet the RT constraints. The RTA ensures that already mapped tasks dot not interfere in the mapping of a new task. Experiments executing in a cycle-accurate MPSoC shows that the use of the proposed mapping guarantees the constraints of embedded RT applications. The proposed mapping is compared with two reference mappings (LEC-DN and HEAT), varying the MPSoC occupation and the number of RT applications executing simultaneously in …", "num_citations": "3\n", "authors": ["519"]}
{"title": "A data extraction and debugging framework for large-scale MPSoCs\n", "abstract": " Although it is possible to design and manufacture MPSoCs with hundreds of processors, there is still a gap in the ability to debug hardware, software, and applications for such chips. Current state-of-the-art works related to MPSoC debugging suffer from poor integration, scalability in data storage, and simple graphical data representation. This work proposes a modular debugging framework to aid the software development for large-scale MPSoCs. The framework contains two parts: back-end and front-end. The back-end contains a generic model for extraction and storage of communication and computation data. The frontend comprises a graphical debugging toolset, which provides intuitive debugging tools for the communication and computation data events. A key point of the proposal is to be generic and applicable to different MPSoC architectures due to the decoupling of the back-end and the front-end …", "num_citations": "3\n", "authors": ["519"]}
{"title": "A layered approach for fault tolerant NoC-based MPSoCs - Special session: Dependable MPSoCs\n", "abstract": " Fault tolerant design has a key role in current nanometric technologies, leading to research on fault mitigation techniques for NoC-based MPSoCs. Most of the state-of-the-art papers present partial solutions to design a fault tolerant MPSoC, i.e., they present fault tolerant mechanisms for either NoCs or processing elements (PEs). The goal of this paper is to propose a comprehensive set of recovery mechanisms, organized in a layered stack, ensuring the correct execution of applications in the presence of transient or permanent faults, for both NoC and PEs. Faults injected into the NoC may induce it to operate in degraded mode or require the search of fault-free paths. In both cases, the communication is reestablished in less than 50 microseconds, using an end-to-end recovery mechanism. Faults injected into the PEs fire a lightweight and fast task relocation protocol, which executes in less than one millisecond.", "num_citations": "3\n", "authors": ["519"]}
{"title": "Exploração de Desempenho, Consumo Dinâmico e Eficiência Energética em MPSoCs\n", "abstract": " To explore performance and energy efficiency in MPSoCs designs, it is necessary a system level simulation infrastructure with resources for evaluating energy consumption in the early stages of the design. This paper presents an extension of a framework for MPSoCs designs to support dynamic voltage and frequency scaling (DVFS) in MPSoCs simulators and evaluates three DVFS mechanisms. The experiments show that applying DVFS can save considerably the energy consumption, with negligible loss of performance.Resumo. Para realizar exploraçao de desempenho e eficiência energética em projetos de MPSoCs, faz-se necessária uma infraestrutura de simulaçao em nıvel de sistema que forneça recursos para avaliar consumo de energia nos estágios iniciais do projeto. Este artigo apresenta uma extensao de um framework para projetos MPSoCs que fornece suportea escalabilidade dinâmica de voltagem e frequência (DVFS) em simuladores de MPSoCs e a avalia três mecanismos de DVFS. Os experimentos mostram que a aplicaçao de técnicas de DVFS pode economizar energia consideravelmente, com insignificante perda de desempenho da simulaç ao.", "num_citations": "3\n", "authors": ["519"]}
{"title": "SDDS-NCL Design: Analysis of Supply Voltage Scaling\n", "abstract": " Despite their substantial power savings, voltage scaling design increases the concern about sensitivity to manufacturing process and operating conditions variations. These can induce significant delay changes in fabricated circuits. An elegant approach to cope with these issues is to employ quasi delay-insensitive asynchronous design styles, which allow relaxing timing assumptions, enabling simpler timing closure when compared to clocked solutions. This work explores the effects of supply voltage scaling on a specific class of quasi-delay-insensitive circuits called spatially distributed dual spacer null convention logic (SDDS-NCL). It first analyzes basic SDDS-NCL gates from a 65 nm cell library. The analysis explores the effects of supply voltage scaling on isolated cells, encompassing static power, energy and delay trade-offs. Next, it shows the results of a similar analysis applied to a 324-cell case study circuit …", "num_citations": "3\n", "authors": ["519"]}
{"title": "The YeAH! NoC Router\n", "abstract": " This work presents the network-on-chip router YeAH!. The router was designed as part of the work developed in the Sistemas Integrados em Chip class, lectured by Professor Fernando Moraes. The proposed router is based on the Hermes router, allowing the implementation of networks with multiple configurations and characteristics, covering different network topologies, routing algorithms and arbitration policies. This technical report details the YeAH! router, which main difference between the original Hermes router is the distributed architecture that splits the routing algorithm and arbitration policy across the ports of the router.", "num_citations": "3\n", "authors": ["519"]}
{"title": "Adaptive QoS Techniques for NoC-Based MPSoCs\n", "abstract": " With the significant increase in the number of processing elements in NoC-Based MPSoCs, communication becomes, increasingly, a critical resource for performance gains and QoS guarantees. The main gap observed in the NoC-Based MPSoCs literature is the runtime adaptive techniques to meet QoS. In the absence of such techniques, the system user must statically define the resource distribution to each real-time task. The goal of this research is to investigate the runtime adaptation of the NoC resources, according to the QoS requirements of each application running in the MPSoC. The adaptive techniques presented in this work focused in adaptive routing, flow priorities, and switching mode. The monitoring and adaptation management is performed at the operating system level, ensuring QoS to the monitored applications. Monitoring and QoS adaptation were implemented in software. In the experiments …", "num_citations": "3\n", "authors": ["519"]}
{"title": "A message-level monitoring protocol for QoS flows in NoCs\n", "abstract": " This work proposes a traffic monitoring scheme to be applied to NoCs. Current schemes transmit monitoring traffic to one or more MSA (Monitoring Service Access Point), and such MSAs are responsible to take some action, as task migration and fault detection. The proposed monitoring method is flow-oriented, i.e, it works at the message-level, and traffic congestion is evaluated all along the source-target path. It can be applied to different adaptation methods as adaptive routing, task migration and dynamic task mapping. Traffic information of QoS flows is stored in tables located at each router. Traffic initiators indicate the routers of the QoS flow path that should be monitored. MSAs are placed in targets of QoS traffic, and notify to the traffic source the occurrence of congestion. DATA packets are used to transmit both application data and monitoring traffic. Presented results evaluate the method in terms of area …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Buffer sizing for QoS flows in wormhole packet switching NoCs\n", "abstract": " Networks on chip (NoCs) are communication infrastructures that offer parallelism and scalability. Most NoC designs employ wormhole packet switching, since this switching mode optimizes the use of NoC resources. However, this mode may introduce jitter, possibly producing packet loss, due to the violation of temporal QoS constraints. One technique to deal with jitter is to introduce a decoupling buffer (D-buffer) on the target IP. This buffer receives data from the NoC with jitter, while the target IP consumes data from this buffer at the application rate, without jitter. Two problems must be solved to implement D-buffers:(i) which size must the buffer have?(ii) how much buffer space should be filled before data consumption starts (threshold)? This work proposes a general method to define D-buffer size and threshold, considering the influence of packaging, arbitration, routing and concurrency between flows. Before …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Current mask generation: an analog circuit to thwart dpa attacks\n", "abstract": " This work addresses the leakage information problem concerning cryptographic circuits. Physical implementations of cryptographic algorithms may let escape some side channel information, like electromagnetic emanations, temperature, computing time, and power consumption. With this information, an attacker can retrieve the data that is being computed, like cryptographic keys. This paper proposes a novel method to thwart DPA attacks, based on power consumption control. As main contribution, this approach not requires any modification on the cryptographic algorithm, the messages or keys.", "num_citations": "3\n", "authors": ["519"]}
{"title": "Design and Protityping of an SDH-E1 Mapper Soft-Core\n", "abstract": " This paper describes the design and prototyping of EMS, a telecommunication intellectual property soft-core developed in the scope of industry-academia cooperation. EMS performs insertion (mapping) and extraction (demapping) of EI channels into/from Synchronous Digital Hierarchy (SDH) frames. The basic SDH frame is transmitted in 155.52 Mbps rate, allowing to pack up to sixty-three 2.048 Mbps El channels. El channels belong to the Plesiochronous Digital Hierarchy (PDH). The paper addresses the solution of several synchronization problems implied by the El channels mapping/demapping process. EMS was fully described in RTL VHDL. It was functionally validated by simulation and prototyped in FPGA platforms. Together with the exploration of the techniques involved in embedding PDH into SDH frames, another contribution of the work is the availability of a reusable and parameterizable telecom core with high performance, low latency, and small size.", "num_citations": "3\n", "authors": ["519"]}
{"title": "A cost-effective test flow for homogeneous network-on-chip\n", "abstract": " Network-on-Chip (NoC)[2] has recently emerged as an alternative communication architecture for complex system chips. Different aspects regarding NoC design have been studied in the literature. In a NoC-based system, cores communicate with each other sending and receiving packets, like in a computer network. The main components of the NoC are routers. For further details on NoC refer to [2]. However, the test of the NoC itself for manufacturing faults has been marginally tackled. To the best knowledge of the authors, some NoC-specific test approaches were suggested in the literature [4], but no experimental results have been reported. It is demonstrated in the paper that straightforward Design-for-Test (DfT) approaches for embedded cores cannot be directly applied for NoCs without a considerable negative impact. Thus, we propose a scalable test strategy for the routers in a NoC, based on partial scan and on on-chip response evaluation. The proposed test strategy takes advantage of the NoC regular design to reduce test area overhead, test time and test data volume. The main assumption of this work is that there are several identical routers in the NoC. Other design choices of NoCs like routing, arbitration and flow control algorithms are supported by the proposed test strategy. Thus, the conclusions drawn here can be applied to a large class of network implementations where the main assumption is true.SoCin network [6] has been used as case study. It uses input buffering, round-robin algorithm for the arbiter, handshake algorithm for flow control and an oblivious routing algorithm. SoCin is configured to 16-bit wide data, 4 word-depth …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Reconfiguração Parcial e Dinâmica para Núcleos de Propriedade Intelectual com Interfaces de Comunicação Padronizadas\n", "abstract": " Este trabalho aborda a utilização de módulos de hardware, pré-projetados e pré-validados no desenvolvimento e implementação de sistemas computacionais em um único circuito integrado (SoC-System-on-Chip). Tais módulos, denominados núcleos de propriedade intelectual, núcleos IP, ou simplesmente cores, podem ser inseridos e removidos no sistema em tempo de execução através da reconfiguração parcial e dinâmica. É proposta uma infra-estrutura para reconfiguração através da adaptação de um fluxo de desenvolvimento de projetos digitais de um fabricante de FPGAs chamado Projeto Modular. Como contribuição secudária, foi desenvolvida uma ferramenta que automatiza o processo de implementação e geração de sistemas digitais reconfiguráveis utilizando o fluxo e infra-estrutura proposta. Através dos estudos de caso, foi possível tornar factível a reconfiguração parcial em um nível de abstração alto, sem o conhecimento de especificidades arquiteturais do dispositivo reconfigurável e demonstrar que a reconfiguração pode ser viável comparada com funções computacionais implementados em software.", "num_citations": "3\n", "authors": ["519"]}
{"title": "Are coarse grain reconfigurable architectures suitable for cryptography?\n", "abstract": " Cryptographic algorithms are increasingly used in personal transaction through Internet network, smart card and telecommunication applications. Those algorithms are well known for their high complexity data computing. This paper focuses on Montgomery algorithm, which computes modular multiplication efficiently. This operation is the most time consuming part of public-key cryptosystems. A comparison among different implementations of the Montgomery algorithm in different architectures (GPP 1 , DSP, fine grain FPGA, coarse grain reconfigurable architecture [CGRA]) is presented. It is shown that coarse grain reconfigurable architecture might be good candidate to implement and to execute Montgomery multiplication. The paper also details the CGRA chosen to implement the referred algorithm.", "num_citations": "3\n", "authors": ["519"]}
{"title": "Design of a fingerprint system using a hardware/software environment\n", "abstract": " Processing system of fingerprint are CPU time intensive, being normally implemented in software. This paper present a new algorithm for fingerprint features localization, that can be easily implemented in hardware (system-on-a-chip, FPGA). This algorithm is composed by 3 stages, first stage read a fingerprint image (255x255pixels, ash tones) and apply a Gaussian Filter, after this, apply a absolute difference mask (ADM) for detector the edges in the image filtered and the last stage look for fingerprint features into the image. The information showed by 3th stage are the coordinate X and Y for each feature detected, asked minutiae. For localization the minutiae, the system pursue the edge detected by ADM, this edge represent ridge edge, and analyzing the information from each pixel pursued is possible to locate the minutiae. The average time for localization all minutiae into the fingerprint image, implemented in …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Software-Based Test Integration in a SoC Design Flow\n", "abstract": " Hardware-based test imposes some constraints like area overhead and processing speed degradation. In addition, with the advance in hardware integration, system-on-achip (SoC) test activities using only automatic test equipments (ATEs) results in an expensive option. The main objective of this work is to investigate and evaluate pros and cons of software-based test. Techniques, such as pattern compaction based on LFSR reseeding are used to minimize some of the drawbacks. Another objective of this work is to introduce a Computer Aided Test (CAT) tool used to generate a C code for testing core-based SoCs. The benchmark c6288 are used to evaluate the proposed tool and test techniques.", "num_citations": "3\n", "authors": ["519"]}
{"title": "Reconfiguração Parcial e Remota de Cores FPGAs\n", "abstract": " In application areas such as multimedia, telecommunications and embedded systems in general, high performance is an essential issue. The strategy of using a conventional microprocessor executing the tasks of such systems in software usually may not correspond to the performance expectations or requirements. Combining conventional microprocessors with (re) configurable hardware devices such as RAM-based FPGAs it is possible to obtain an economically interesting product and yet efficient for a more vast range of applications. However, not always the ideal hardware for fulfilling the performance requirements fits in the configurable device due to size, power or speed restrictions of the device or its technology. The problem can be avoided, for example, by employing a scheme for dynamically reconfiguring the FPGA (s). This work addresses partial and/or remote reconfiguration of FPGAs, but has as main …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Projeto para Prototipação de um IP Soft Core MAC Ethernet.\n", "abstract": " Dentre as tecnologias de transmissão de dados em redes locais modernas (em inglês, Local Area Networks ou LANs), aquela conhecida como Ethernet é sem dúvida a mais difundida. Sua popularidade deriva de diversos fatores. Entre estes, salienta-se o fato de se tratar de padrão internacional reconhecido por diversos organismos internacionais (eg IEEE, ISO, ANSI)[4]. Outro motivo para sua difusão em escala mundial é que desde sua proposta original por Metcalfe e Boggs [6], as especificações e o direito de construir este tipo de interfaces de rede foram abertos. Esta abertura, combinada com a facilidade de uso e robustez do sistema, resultou no grande sucesso da tecnologia, entre outros no ramo de computadores. A maioria dos computadores pessoais atualmente comercializados estão equipados com uma interface 10-Mbps e/ou 100-Mbps Ethernet, possibilitando conectá-los facilmente a uma LAN preexistente. Outra vantagem relevante da tecnologia Ethernet é a escalabilidade da tecnologia, vinculada ao caminho evolutivo do padrão para velocidades de transmissão cada vez mais altas (10, 100 e 1Gbps) e compatibilidade a nível de meio físico de transmissão e equipamentos.O presente trabalho descreve o projeto e a validação de parte da tecnologia Ethernet voltado para a implementação sobre dispositivos reconfiguráveis. Trata-se aqui da implementação do protocolo de acesso ao meio em redes Ethernet (Medium Access Control, ou MAC), que corresponde à camada do protocolo diretamente implementada em hardware digital. Tal implementação toma a forma de um módulo de Propriedade Intelectual reutilizável pré …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Implementação eficiente de uma arquitetura load/store em VHDL\n", "abstract": " This work presents the specification, design, implementation and test of a simple, 16-bit load/store instruction set architecture in the VHDL hardware description language. During the description of the whole process the paper establishes a discussion about how to incrementally tune the initial VHDL description to obtain an efficient hardware implementation. The merits of several VHDL constructs with regard to their cost in hardware and their code compactness are compared. As a result, some guidelines are developed to employ during the design in order to evaluate tradeoffs between the size of the implementation against the ease of description.", "num_citations": "3\n", "authors": ["519"]}
{"title": "Synthese topologique de macro-cellules en technologie CMOS\n", "abstract": " Les problèmes majeurs de la génération automatique du dessin des masques des circuits intégrés sont la dépendance vis-à-vis des règles de dessin et le dimensionnement correct des transistors. Les méthodes traditionnelles, telles que l'utilisation de cellules pré-caractérisées, manquent de flexibilité, car les portes des bibliothèques (en nombre limité) sont dessinées et dimensionnées (independarnment de l'application) pour une technologie donnée. Les méthodes de synthèse automatique du dessin des masques ont pour but de surmonter ces problèmes. Les techniques les plus couramment utilisées sont le \"gate-matrix\" et le \"linear-matrix\". L'indépendance vis-à-vis des règles de dessin est obtenue en utilisant la technique de description symbolique (dessin sous une grille unitaire), et les dimensions des transistors sont définies par le concepteur ou par un outil de dimensionnement. Nous proposons une méthode et un prototype logiciel pour la synthèse automatique des masques, en utilisant le style \"linear-matrix multi-bander\". La description d'entree du générateur est un fichier format SPICE (au niveau transistor), ce qui permet d'avoir un nombre très élevé de cellules, en particulier les portes complexes (A01), et ainsi avoir une meilleure optimisation lors de la phase d'assignation technologique.  Les macro-cellules générées doivent être assemblées afin de réaliser un circuit complet. Deux contraintes supplémentaires sont ainsi imposées au générateur: malléabilité de la forme et position des broches d'entrées/sorties sur la périphérie de la macro-cellule. Les macro-cellules sont assemblées en utilisant un environnement de conception …", "num_citations": "3\n", "authors": ["519"]}
{"title": "Multiple-objective Management based on a Distributed SDN Architecture for Many-cores\n", "abstract": " The management of many-core systems is evolving to meet multiple objectives simultaneously. The Software-Defined Networking (SDN) has benefits explored in recent works that point it as a candidate to address this requirement at the communication level, at the same time that promotes management flexibility and reduced hardware complexity. Most of the research in SDN for many-cores assumes a centralized SDN (C-SDN) Controller and single-objective management This work proposes multi-objective management based on a distributed SDN (D-SDN) architecture (SELF-SDN). The management is self-adaptive, addressing QoS and fault-tolerance simultaneously at the communication level. Experiments targeting QoS show that SELF-SDN provides a reduced amount of latency misses (−67%) and fast reaction time (−49.6%) to recover the QoS constraints compared to a C-SDN approach. Fault-tolerance …", "num_citations": "2\n", "authors": ["519"]}
{"title": "Mapping and Migration Strategies for Thermal Management in Many-Core Systems\n", "abstract": " New technology nodes enable the integration of billions of transistors in a small silicon area by replicating identical structures, resulting in many-core systems. However, power density may limit the amount of energy the system can consume. A many-core at its maximum performance may lead to safe temperature violations and, consequently, result in reliability issues. Dynamic Thermal Management (DTM) techniques proposals guarantee that many-core systems run at good performance without compromising reliability. In this paper, we review recent DTM works, discussing their limitations, and propose new heuristics for thermal-aware application mapping and migration, using a hardware accelerator that enables temperature monitoring on systems with a large number of processing elements. Results show that using straightforward heuristics, with reactive actions based on runtime temperature monitoring, reduce …", "num_citations": "2\n", "authors": ["519"]}
{"title": "Lightweight security mechanisms for MPSoCs\n", "abstract": " Computational systems tend to adopt parallel architectures, by using multiprocessor systems-on-chip (MPSoCs). MPSoCs are vulnerable to software and hardware attacks, as infected applications and Hardware Trojans respectively. These attacks may have the purpose to gain access to sensitive data, interrupt a given application or even damage the system physically. The literature presents countermeasures using dedicated routing algorithms, cryptography, firewalls and secure zones. These approaches present a significant hardware cost (firewalls, cryptography) or are too restrictive regarding the use of MPSoC resources (secure zones). The goal of this paper is to present lightweight security mechanisms for MPSoCs, using four techniques: spatial isolation of applications; dedicated network to send sensitive data; traffic blocking filter; lightweight cryptography. These mechanisms protect the MPSoC against the …", "num_citations": "2\n", "authors": ["519"]}
{"title": "Exploring Asynchronous End-to-End Communication Through a Synchronous NoC\n", "abstract": " SoC design will require asynchronous techniques as the large parameter variations across the chip impose challenges to control delays in clock networks and other global signals efficiently. Today's state-of-the-art SoCs contain an ever-growing number of IP cores, each of which is immersed in its independent clock domain. When the IP core population increases and the minimum transistor size shrinks, it is challenging to keep all the different clock domains synchronized across the die while maintaining the considerable data bandwidth between them. One of the most promising solutions to this interconnect issue is the Globally Asynchronous, Locally Synchronous approach. Our goal is to provide an interconnection architecture which supports asynchronous communication between IPs working on its frequency. Instead of designing a fully asynchronous Network-on-Chip (NoC), our idea is to improve an existing …", "num_citations": "2\n", "authors": ["519"]}
{"title": "An LSSD compliant scan cell for flip-flops\n", "abstract": " Most recent timing resilient templates are using asynchronous design techniques and integrating both flip-flops and latches in their design to enable more aggressive performance improvement and reduction in energy consumption. Despite these benefits, they impose challenges in terms of testability because both latches and flip-flops typically use different test protocols. This paper presents an optimized scan cell for flip-flops which is compatible with the protocol used by scannable latches. By using the proposed cell, it is possible to have latches and flip-flops in the same scan chain and the DfT flow fully automated by commercial EDA tools. Experimental results show that the proposed cell reduces silicon area, leakage, and dynamic power compared to the original cell.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Estimation methods for static noise margins in CMOS subthreshold logic circuits\n", "abstract": " Operating CMOS circuits at subthreshold supply voltages is an attractive solution for substantial energy reduction, at the expense of strong timing performance degradation, for a broad range of battery operated appliances. One of the challenges of this approach in current technology nodes is the reduced available noise margin when operating at low supplies. This paper evaluates the Static Noise Margin (SNM) to ensure reliable estimations in subthreshold CMOS circuits. The evaluation starts with a DC simulation of cells, providing a guideline on how its inputs should be stressed. The analysis shows that improperly employing the DC simulation may lead up to 70% worst results, thereby underestimating the SNM. The DC simulation methodology was applied herein to three different techniques, to identify which can reduce the SNM pessimism without overestimating. To extended the range of assessment, and to …", "num_citations": "2\n", "authors": ["519"]}
{"title": "Distributed Runtime Energy Management for Many-Core Systems Running Real-Time Applications\n", "abstract": " The workload of many-core systems includes soft real-time (SRT) applications. Obtaining energy savings while executing SRT applications is a challenge due to the timing constraints. Techniques used to reduce the energy consumption, such as dynamic voltage and frequency scaling (DVFS), usually delay applications, leading to deadline misses. Most works in the literature achieve energy savings while ensuring RT constraints applying design time analysis of the expected workload. This work presents a holistic proposal for Runtime Energy Management (REM) targeting SRT and besteffort (BE) applications as the main contribution. This comprehensive approach initially presents a general method to estimate energy, at the processing element (PE) level, without using physical sensors. The REM monitoring obtains the energy per PE and the slack time of the SRT applications executing in the system. The …", "num_citations": "2\n", "authors": ["519"]}
{"title": "A new local clock generator for globally asynchronous locally synchronous MPSoCs\n", "abstract": " The evolution of technology into deep sub-micron domains leads to increasingly complex timing closure problems to design multiprocessor systems. One natural alternative is to resort to the globally asynchronous, locally synchronous paradigm. This work proposes a generic architecture for very low power- and area-overhead local clock generators (LCGs) to drive processors, network-on-chip routers and other intellectual properties (IPs). As one original contribution, the article details the design of a digitally controlled oscillator (DCO) which is the core of the LCG architecture. This DCO was designed using a CMOS 65 nm technology. It produces at least 16 distinct frequencies from 117 MHz to 1 GHz and supports clock gating and glitch-free frequency changes. The DCO design is robust to process, voltage and temperature variations, takes 850.6 µm2 and dissipates up to 197 µW. The article also proposes …", "num_citations": "2\n", "authors": ["519"]}
{"title": "A platform-based design framework to boost many-core software development\n", "abstract": " Embedded software engineers are dealing with complex and large software codes, which will continue to grow. To achieve a cost-effective design, concomitant hardware and software development is required during early design phases. This paper presents an open-source platform based design framework that combines different ADLs and simulators aiming at improving embedded software productivity, targeting future many-core embedded systems. The proposed approach adopts three models: RTL-VHDL level; RTL-SystemC coupled to ISSs; PBD (Platform Based Design) using OVP. The software (operating system and user applications) is the same for both models. Therefore, the OVP modeling allows fast software validation and debuggability. With the SystemC-ISS, it is possible to accurate estimate performance and energy consumption. The low-level model enables, besides area estimation, the validation of …", "num_citations": "2\n", "authors": ["519"]}
{"title": "A context saving fault tolerant approach for a shared memory many-core architecture\n", "abstract": " Mechanisms for runtime fault-tolerance in many-core architectures are mandatory to cope with transient and permanent faults. This issue is even more relevant with aggressive technology nodes due to process variability, aging effects, and susceptibility to upsets, among other factors. This work proposes to save periodically the context and to re-schedule tasks to the last reliable known state and avoid the faulty processor. This technique is implemented on an embedded multicore architecture named P2012. The proposed fault-tolerant approach induces a limited overhead of 9.37% in an industrial image processing application while guaranteeing a full-error recovery if any error is detected.", "num_citations": "2\n", "authors": ["519"]}
{"title": "A Digitally Controlled Oscillator for Fine-Grained Local Clock Generators in MPSoCs\n", "abstract": " The evolution of technology into deep submicron domains leads to increasingly complex timing closure problems to design multiprocessor systems. One natural alternative is to resort to the globally asynchronous, locally synchronous paradigm (GALS). This work proposes a generic architecture for very low power- and area-overhead local clock generators (LCG) to drive individual modules of a multiprocessor, e.g. network on chip routers and other elements. As main original contribution it details the design of a digitally controlled oscillator (DCO), the core of the clock generator architecture. This DCO can produce at least 16 distinct frequencies between 117 MHz and 1 GHz and supports clock gating and glitch-free frequency changes. Its design is robust to PVT variations and takes less than 1000 μm 2 .", "num_citations": "2\n", "authors": ["519"]}
{"title": "Dynamic flow reconfiguration strategy to avoid communication hot-spots\n", "abstract": " Application-specific Network-on-Chip allows optimization for the interconnection to minimize its cost. When used with streaming applications, large flows of data can be predicted. However, these flows can be modified during the applications providing a dynamic flow graph. In that case, applying on off-line optimization leads to an over-sizing of the NoC. On the other hand, dynamic reconfiguration leads to unordered data deliveries with costly re-ordering units. In this paper, we propose a coarse grain dynamic reconfiguration which avoids data re-ordering requirement. We show that the proposed solution is efficient to deal with communication hot-spots, with a small area overhead, and can save up to 33% of latency.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Infraestrutura para controle de projetos em FPGAs através do Protocolo Ethernet\n", "abstract": " Array) estão frequentemente presentes em projetos de sistemas digitais que requerem alto desempenho e um custo relativamente baixo. É comum, atualmente, nos depararmos com tal tecnologia e o presente trabalho propõe uma forma de configuração e monitoramento de dados destes dispositivos, através de uma rede Ethernet, usando um computador remoto. O objetivo deste trabalho é desenvolver, em hardware, os protocolos básicos de acesso à rede utilizando a pilha TCP/IP", "num_citations": "2\n", "authors": ["519"]}
{"title": "A case study of hierarchically heterogeneous application modelling using UML and Ptolemy II\n", "abstract": " The heterogeneity of the state-of-the art embedded systems containing multicore platforms requires the application design flow to enable the creation of parallel applications using multiple Models of Computation. Components of such systems may interact in various ways, often using ad hoc methods. However, due to the poor reusability and analysability of ad hoc solutions, more structured approaches to heterogeneous modelling are needed. This paper takes advantage of the hierarchically heterogeneous modelling style of the Ptolemy II framework and presents a case study of building and simulating an autonomous vehicle application model using various Models of Computation.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Moreas,\" Implementation and evaluation of a congestion aware routing algorithm for networks-on-chip\n", "abstract": " The major part of the state of art routing proposals have a limited view of the NoC congestion, since each router takes decisions based on few neighbors' status. Such local decision may lead packets to other congested regions, therefore being inefficient. The goal of this work is to propose and evaluate an adaptive source routing algorithm, where the path between source and target PEs may be modified due to congestion events. The proposed method requires QoS session establishment and traffic monitoring. A QoS session establishes a connection between two IPs, applying application constraints. Traffic monitoring carries congestion information to the target, leading to a global view of the routing path. Evaluated performance figures include latency, traffic distribution and the delay to switch to a new path. For hot-spot traffic scenarios, the average latency is reduced by 10%. The proposed routing method also achieved a better network occupation.", "num_citations": "2\n", "authors": ["519"]}
{"title": "A Leak Resistant SoC to Counteract Side Channel Attacks\n", "abstract": " This work addresses the problem of hardware attacks against cryptographic circuits. The most dangerous side-channel attack: the differential power analysis (DPA) is discussed, as well the state of art countermeasures. Then new reconfigurable system on chip resistant against DPA attacks is proposed. Results shows that our architecture is efficient against DPA attacks, but also outcomes the performance of classical implementation of modular exponentiation, for key size exceeding 2048 bits, with a reasonable extra area overhead", "num_citations": "2\n", "authors": ["519"]}
{"title": "Design, Validation and Prototyping of the EMS SDH STM-1 Mapper Soft-core\n", "abstract": " This paper describes the design, verification and prototyping of EMS, a telecommunication intellectual property soft-core developed in the scope of an industry-academia cooperation. EMS performs insertion (mapping) and extraction (demapping) of E1 channels into/from Synchronous Digital Hierarchy (SDH) frames. The paper addresses the solution of several synchronization problems implied by the E1 channels mapping/demapping process. EMS was fully described in RTL VHDL. It was functionally validated by simulation and prototyped in FPGA platforms. Together with the exploration of the techniques involved in embedding E1 into SDH frames, another contribution of the work is the availability of a reusable and parameterizable telecom core with high performance, low latency, and small size.", "num_citations": "2\n", "authors": ["519"]}
{"title": "PROCESSADORES RECONFIGURÊVEIS: ESTADO DA ARTE\n", "abstract": " Processadores reconfiguráveis estendem a capacidade de um processador otimizando seu conjunto de instruções para uma tarefa específica. Com isto é obtido um aumento de desempenho e flexibilidade, ao mesmo tempo que a área do núcleo do processador permanece inalterada. Este artigo apresenta o estado da arte em processadores reconfiguráveis. Uma proposta de processador reconfigurável fracamente acoplado é apresentada. O objetivo deste processador é permitir a reconfiguração parcial e dinâmica utilizando dispositivos FPGAs atuais. Uma implementação prova de conceito é apresentada, mostrando o ganho de desempenho obtido.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Design frameworks and configuration controllers for dynamic and partial reconfiguration\n", "abstract": " Dynamically reconfigurable systems, especially those where the hardware can be changed during runtime, have the potential to provide hardware with flexibility similar to that of software. At the same time, they may lead to better performance and smaller system size. However, there is a clear lack of support devices, tools and design flows adequate for such systems. This paper presents the state of the art of design frameworks to dynamic and partial reconfiguration and proposes a framework named PaDReH. Also discuss the problems for enabling dynamically reconfigurable systems is the unavailability of efficient methods to control the hardware configuration process and, proposes a configuration controller, called RSCM. This controller is implemented and validated in Virtex-II Xilinx FPGAs.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Barramento de alto desempenho para interação software/hardware\n", "abstract": " Este trabalho apresenta o projeto de um módulo de hardware reutilizável, soft core, para a implementação do padrão PCI, 32 bits-33 MHz. A motivação para o desenvolvimento deste soft core é prover aos projetistas de hardware um módulo que aumente a largura de banda na iteração hardware/software. Apresenta-se as características gerais do padrão PCI, seguindo-se com a definição, na forma de diagrama de blocos, da arquitetura do core. A implementação deste core é feita utilizando-se a linguagem de descrição de hardware VHDL, validando-o através de simulação funcional. A simulação testa os ciclos básicos de leitura e escrita, tanto em modo simples quanto em rajada. A etapa seguinte deste trabalho é a validação do core em um ambiente de prototipação, composto de FPGA e barramento PCI.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Proposta de um Sistema para Processamento de lmpressoes Digitais Implementado em Hardware\n", "abstract": " Fingerprint is the impression on a surface of the curves formed by the ridges on a fingertip. Each fingerprint is unique, offering a clear and unambiguous method to identify an individual. The uniqueness of each fingerprint is determined by fine details embedded in its overall structure, named minutiae. Fingerprint classification system is CPU time intensive, usually implemented in software. This paper presents an alternative way to identify the minutiae from fingerprints, aiming real-time processing. In the first part is implemented the alternative algorithm in software and after this is presented an architecture to be implemented using a configurable devices (FPGA). The performance of this algorithm, in hardware and software, are analyzed, presenting the spent time within each system block.Resumo: Impressão digital é formada por uma superfície que apresenta franjas localizadas nos dedos do indivíduo. Cada …", "num_citations": "2\n", "authors": ["519"]}
{"title": "Direct Torque Control with Stator Ripple Frequency Imposed by Dithering\n", "abstract": " Direct Torque Control of induction motors is the latest step in motor drives. Hysteresis band amplitude choice is one of the initial difficulties involved in the technique since it determines ripple frequencies and amplitude error of control variables. Correlation between hysteresis bands, ripple frequencies and error amplitudes is due to the establishment of limit cycles in inner control loops. In this paper, an alternative structure which simplifies designers work through the control of flux and torque error amplitudes by means of dithering is presented. A simulation environment developed in MATLAB/Simulink is used to obtain the results. This environment takes into account the dynamic behavior of each individual block allowing for the project and test of controlling structures for DTC in an inexpensive way.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Modeling of Embedded Digital Systems from SDL Language: a Case Study\n", "abstract": " The goal of this paper is to evaluate the performance of digital systems generated from a high-level description language. The target language in this work is SDL. The SDL description is automatically synthesized with a codesign tool, resulting in a VHDL description. The codesign tool is responsible for software, hardware and communication synthesis. The presented results concerns only the hardware synthesis, since the goal is to compare the performance of systems generated from manual VHDL descriptions against a synthesized VHDL. Two case studies are presented, exploring area and delay results.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Um Ambiente de Compilaçao e Simulaçao para Processadores Embarcados Parametrizáveis\n", "abstract": " Este artigo apresenta um conjunto de ferramentas para compilação e simulação de uma arquitetura de processador a ser utilizada em aplicações embarcadas. A arquitetura desenvolvida é parametrizável tanto no conjunto e formato das instruções quanto na organização interna. A parametrização do conjunto de instruções possibilita ao projetista selecionar as instruções que mais se adaptam a sua aplicação. Por exemplo, a existência ou não de determinadas instruções aritméticas, como multiplicação ou divisão, pode aumentar o desempenho ou reduzir o custo do processador a ser implementado. A parametrização da organização interna do processador reflete as escolhas tomadas na seleção das instruções, como número de registradores, operações da unidade lógico-aritmética ou o funcionamento da pilha. A disponibilidade de um processador que seja flexível, apresente baixo custo em termos de área …", "num_citations": "2\n", "authors": ["519"]}
{"title": "RECKON–A Reconfigurable Prototyping Kit for Engineering and IT Laboratory Based Courses\n", "abstract": " This work describes an educational kit developed at the University of Sussex, UK. The kit is based on reconfigurable computing technology, targeting its use in different laboratory based courses, with minimal modifications of the hardware components. The paper describes the software and hardware modules of the system, and the main stages of the project.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Ambiente de Desenvolvimento de Processador Embarcado para Aplicações de Codesign\n", "abstract": " This paper presents an environment to compile, simulate and optimize a configurable processor architecture adequate to embedded applications. The configurable parts of the architecture are the instruction set and the data path organization. The instruction set parameterization allows to fit the instruction set to the user application. The internal organization, composed by a data-path and a control unit reflects the instruction set choices, as the number of internal registers, the arithmetic and logic unit functions and the instructions of the control block. The availability of a flexible, low cost, high performance processor is crucial in systemon-a-chip designs. The environment includes five tools: architecture configuration mapper, assembler, simulator, C compiler and VHDL code generator.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Power Estimation at Logic-Level Considering Interconnection Capacitances\n", "abstract": " Accurate and fast power estimation of CMOS circuits during the design phase is required to guide power optimization techniques employed to meet stringent power specifications. Logic-level power estimation tools, such as those available in the SIS frameworks (POSE and Power Estimate) are able to accurately calculate the switching activity under a given delay model. However, capacitance modeling is crude. The goal of the work described in this paper is to estimate the average power of a circuit with interconnection capacitances and transistors extracted from the layout. To validate the method we user the Diva extractor (Cadence Design Systems) and LASCA [8] extractor. We propose new models for the input and output capacitances of logic gates, taking into account the internal capacitances of the gates. The results we present show a comparison of logic-level power estimation with capacitances extracted of DIVA and LASCA, with less that 10% error.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Estudo da viabilidade de implementação de um sistema de localização e reconhecimento de objetos com uso de RNAs implementadas em FPGA\n", "abstract": " Pattern localization and recognition are CPU time intensive, being normally implemented in software. Custom implementations in hardware allow real-time processing. In practice, in ASIC or FPGA implementations, the digitization process introduces errors that should be taken into account. This paper presents initially the state-of-the-art in this field, analyzing the performance and implementation of each work. After, we present our implementation in a prototype platform, exploring the inherent parallelism of the hardware implementation. We analyze our implementation in terms of required hardware for the ANN (artificial neural network) and the maximum frequency of operation. Also the same model is implemented in software, and analysis in terms of image quality is presented. A quantitative analysis is finally presented between the performance obtained by the FPGA and the possible one obtained by a DSP.", "num_citations": "2\n", "authors": ["519"]}
{"title": "Cleo-LIRMM: um experimento de implemetação de processadores dedicados em plataformas de prototopação de sistemas embarcados\n", "abstract": " Descreve-se a implementação do processador didático Cleópatra sobre a plataforma de prototipação de sistemas embarcados LIRMM. O núcleo do processador e os módulos de comunicação com o restante da plataforma foram implementados sobre um único FPGA, a partir de suas descrições completas em VHDL. Os módulos de comunicação desempenham as funções de controle de carga do código objeto na memória, disparo da execução do código objeto pelo processador e recuperação dos dados de saída após a execução do programa. O trabalho aqui descrito constitui o primeiro estudo de caso completo desenvolvido pelos autores sobre a construção de arquiteturas dedicadas para sistemas embarcados e sua integração em plataformas de prototipação e/ou de emulação de sistemas digitais.", "num_citations": "2\n", "authors": ["519"]}
{"title": "A high-level modeling framework for estimating hardware metrics of CNN accelerators\n", "abstract": " GPUs became the reference platform for both training and inference phases of Convolutional Neural Networks (CNN) due to their tailored architecture to the CNN operators. However, GPUs are power-hungry architectures. A path to enable the deployment of CNNs in energy-constrained devices is adopting hardware accelerators for the inference phase. The design space exploration of CNNs using standard approaches, such as RTL, is limited due to their complexity. Thus, designers need frameworks enabling design space exploration that delivers accurate hardware estimation metrics to deploy CNNs. This work proposes a framework to explore CNNs design space, providing power, performance, and area (PPA) estimations. The heart of the framework is a system simulator. The system simulator front-end is TensorFlow, and the back-end is performance estimations obtained from the physical synthesis of hardware …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Dynamic Thermal Management in Many-Core Systems Leveraged by Abstract Modeling\n", "abstract": " For years, transistor size reduction led to a linear decrease in power dissipation. This is the Dennard scaling law, which ended in 2000’s technology nodes because the supply voltage no longer scales. The consequence is the increase of the power density in integrated circuits, leading to high temperatures, accelerating aging effects. Dynamic thermal management (DTM) is a technique adopted at runtime to act in the system using the components’ current temperature to minimize hotspots and peak temperatures. This paper aims to present a DTM for NoC-based many-cores, using an abstract model, to estimate the temperature at the processing element level and task migration as the main actuation mechanism. Results show up to 12% of temperature reduction and almost 10°C of peak temperature reduction, highlighting the approach’s effectiveness, compared to the pattering and spiral mappings.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Hardware Accelerator for Runtime Temperature Estimation in Many-cores\n", "abstract": " A challenge related to the design of many-core systems in recent technology nodes is the power density, which may induce safe temperature violations and reliability degradation. Dynamic Thermal Management (DTM) techniques rely on accurate temperature estimation obtained from thermal sensors or analytical temperature models. This work proposes a Temperature Estimation Accelerator (TEA) to estimate the temperature of processing elements at runtime in a fast and energy-efficient way compared to a software approach. Thermal monitoring based on TEA provides fine-grain temperature data and can enable DTMs to deal with unpredictabilities, such as network congestion, by actuating in large many-cores systems at runtime.", "num_citations": "1\n", "authors": ["519"]}
{"title": "A TensorFlow and system simulator integration approach to estimate hardware metrics of convolution accelerators\n", "abstract": " GPUs became the reference platform for both training and inference phases of Convolutional Neural Networks (CNN), due to their tailored architecture to the CNN operators. However, GPUs are power-hungry architectures. A path to enable the deployment of CNNs in energy-constrained devices is adopting hardware accelerators for the inference phase. The design space exploration of CNNs using standard approaches, such as RTL, is limited due to their complexity. Thus, designers need frameworks enabling design space exploration that delivers accurate hardware estimation metrics do deploy CNNs. This work aims to propose a framework to explore hardware accelerators' design space, providing power, performance, and area (PPA) estimations. The heart of the framework is a system simulator with TensorFlow as front-end and as back-end performance estimations obtained from the physical synthesis …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Evaluation of the soft error assessment consistency of a JIT‐based virtual platform simulator\n", "abstract": " Soft error resilience has become an essential design metric in electronic computing systems as advanced technology nodes have become less robust to high‐charged particle effects. Designers, therefore, should be able to assess this metric considering several software stack components running on top of commercial processors, early in the design phase. With this in mind, researchers are using virtual platform (VP) frameworks to assess this metric due to their flexibility and high simulation performance. In this regard, herein, this goal is achieved by analysing the soft error consistency of a just‐in‐time fault injection simulator (OVPsim‐FIM) against fault injection campaigns conducted with event‐driven simulators (ie more realistic and accurate platforms) considering single and multicore processor architectures. Reference single‐core fault injection campaigns are performed on RTL descriptions of Arm Cortex‐M0 and M3 processors, while gem5 simulator is used to multicore Arm Cortex‐A9 scenarios. Campaigns consider different open‐source and commercial compilers as well as real software stacks including FreeRTOS/Linux kernels and 52 applications. Results show that OVPsim‐FIM is more than 1000x faster than cycle‐accurate simulators and up to 312x faster than event‐driven simulators, while preserving the soft error analysis accuracy (ie mismatch below to 10%) for single and multicore processors.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Chronos: An Abstract NoC-based Manycore with Preserved Temporal and Spatial Traffic Distribution\n", "abstract": " The time spent to assess the application performance through clock-cycle simulators is a bottleneck of an NoC-based manycore design; thus, requiring higher abstraction levels at early design stages. However, high-level synchronization of processing and communication in such systems is a challenge. This work develops and validates Chronos, an untimed abstraction of an NoC-based manycore, built with Open Virtual Platform, that seeks precise traffic modeling in such a way to preserve the temporal and spatial distributions of the physical implementation. Results show the similarity of the temporal and spatial traffic distributions compared to a reference RTL-level platform.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Reducing NoC Energy Consumption Exploring Asynchronous End-to-end GALS Communication\n", "abstract": " Systems-on-Chip (SoCs) with a large number of cores adopt Networks-on-chip (NoCs) as the communication infrastructure due to its scalability. The complexity to distribute a skew-free synchronous clock signal over the entire chip increases in current fabrication technologies due to the process variability. Thus, designers may choose among fully asynchronous and Globally Asynchronous, Locally Synchronous (GALS) NoCs. This work proposes an intermediate solution. Each Intellectual Property (IP) core may have its clock domain, and the NoC supports both synchronous and asynchronous communication. The NoC has its own clock domain, with the synchronous communication used to establish end-to-end paths. Once the end-to-end path is established, the NoC connects the IPs asynchronously, as wires with repeaters. The message is transmitted using handshake protocol at the source IP frequency. The …", "num_citations": "1\n", "authors": ["519"]}
{"title": "An IR-UWB pulse generator using PAM modulation with adaptive PSD in 130nm CMOS process\n", "abstract": " This paper proposes an adaptive pulse generator using Pulse Amplitude Modulation (PAM). The circuit was implemented with eight Pulse Generator Units (PGUs) to produce up to eight monocycles per pulse. The number of monocycles per pulse is inversely proportional to the Power Spectrum Density (PSD) bandwidth in the Impulse Radio Ultra-Wide Band (IR-UWB). The complete circuit contains two pulse generator blocks, each one composed by eight PGUs to build a rectangular waveform at the output. The PGU has been implemented with Edge Combiners High (ECH) and Edge Combiners Low (ECL) to encode the information. Each Edge Combiner has a high impedance circuit that is selected by digital control signals. The circuit has been simulated, showing an output pulse amplitude of≈ 70mV for the high logic level and an amplitude of≈ 35mV for the low logic level, both at 100 MHz Pulse Repetition …", "num_citations": "1\n", "authors": ["519"]}
{"title": "The power impact of hardware and software actuators on self-adaptable many-core systems\n", "abstract": " Many-core systems rely on the advantages of the latest Complementary Metal Oxide Semiconductor (CMOS) technologies to increase the number of cores. However, this improvement comes at the cost of higher power dissipation, which prevents full use of the chip. To continue improving performance on future many-core systems, Resource Management (RM) becomes imperative to handle multi-objective and conflicting requirements such as power, performance, resilience, among others. In this task, RM can use both hardware (e.g., dynamic voltage and frequency scaling) and software actuators (e.g., task remapping). However, the complexity of synchronizing available actuators to follow a particular goal while avoiding actuation overlapping is a remaining challenge. This paper evaluates the power impact of each actuator and provides insights that will help engineers develop appropriate resource management …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Fault-tolerance at the Management Level in Many-core Systems\n", "abstract": " The technology nodes reduction enabled the emergence of NoC-based many-cores with dozens to hundreds of processing elements (PEs). Despite the processing power offered by a large number of processors and communication flexibility due to the adoption of NoCs, it is necessary to manage the many-core resources to ensure scalability. The execution of the management tasks requires a processing element reserved exclusively to execute such actions. A centralized approach would induce a significant load to the managers PE (MPE) in large-scale systems. The adoption of distributed approaches, with MPEs hierarchically organized, reduces the management load, being the organization adopted in this work. Consider a permanent fault in an MPE. In a centralized approach the entire system is compromised, and in a hierarchical organization, a set of PEs become inaccessible due to the fault in the MPE …", "num_citations": "1\n", "authors": ["519"]}
{"title": "XGT4: An industrial grade, open source tester for multi-gigabit networks\n", "abstract": " Network test needs grow as fast as network performance. These must be reliable, remain available without Interruption, and secure user data. Thus, they must continually be tested for service quality, based on measurements like throughput, latency, and jitter. Network and network equipment tests can rely on test software, dedicated test hardware, or in FPGA platforms. The latter offer a trade-off between software solutions limited bandwidth and high performance dedicated test equipment. This work proposes a new, industrial grade, low-cost and accurate network test solution, XGT4. XGT4 employs the NetFPGA SUME board and provides full support to the RFC2544 test benchmarks for 1G and 10G Ethernet equipment, a feature not available in other open source testers. Besides, XGT4 can be remotely operated through a dedicated web interface, and deals with multiple simultaneous 10GbE streams. Results of …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Exploiting performance, dynamic power and energy scaling in full‐system simulators\n", "abstract": " Energy consumption constraints have become a critical issue in Multiprocessor Systems on Chip (MPSoC) designs. Whereas processor performance comes with a high power cost, there is an increasing interest in exploring the trade‐off between power and performance, taking into account the target application domain. Dynamic Voltage and Frequency Scaling (DVFS) techniques adaptively scale frequency or voltage level of CPU allowing it to reach just enough performance to process the system workload while meeting throughput constraints, and thereby, reducing the energy consumption. To explore this wide design space for energy efficiency and performance, hardware and software components, a system‐level simulation infrastructure must provide features to evaluate power savings mechanisms in early stages of the design. This paper presents an extension work of a framework for MPSoCs designs to …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Hardware and software infrastructure to implement many-core systems in modern FPGAs\n", "abstract": " Many-core systems are increasingly popular in embedded systems due to their high-performance and flexibility to execute different workloads. These many-core systems provide a rich processing fabric but lack the flexibility to accelerate critical operations with dedicated hardware cores. Modern Field Programmable Gate-Arrays (FPGAs) evolved to more than reconfigurable devices, providing embedded hard-core processors with several IP cores. While FPGAs provide a rich reconfigurable hardware fabric, only one or two embedded hard-core processors are available to execute complex software applications. Therefore, modern FPGAs offer the possibility to merge the benefits of many-core systems with the reconfigurability of FPGAs. The goal of this paper is to present an infrastructure to implement many-core systems in modern FPGAs. An embedded hard-core processor is used to manage the many-core area …", "num_citations": "1\n", "authors": ["519"]}
{"title": "A Monitored NoC with Runtime Path Adaptation\n", "abstract": " Networks-on-chip (NoCs) are already a common choice of communication infrastructure for complex systems-on-chip (SoCs) containing a large number of processing resources and with critical communication requirements. A NoC provides several advantages, such as higher scalability, efficient energy management, higher bandwidth and lower average latency, when compared to bus-based systems. Experiments with applications running on NoCs with more than 10% of bandwidth usage show that most of a typical message latency refers to buffered packets waiting to enter the NoC, while the latency portion that depends on packets traversing the NoC is often negligible. This work proposes a Monitored NoC called MoNoC, which is based on a monitoring mechanism and on the exchange of high-priority control packets. Practical experiments show that our fast adaptation method enables transmitting packets with …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Fault recovery communication protocol for NoC-based MPSoCs\n", "abstract": " Mechanisms for fault-tolerance in MPSoCs are mandatory to cope with faults during fabrication or product lifetime. For instance, permanent faults on the interconnect network can stall or crash applications even though the network has alternative fault-free paths to a given destination. This PhD work presents a fault-tolerant communication protocol that takes advantage of the NoC routing method to provide alternative paths between any source-target pair of processors. At the application layer, the method is seen as a typical MPI-like message passing protocol. At the lower layers, the method consists of a software kernel layer that monitors the regularity of message exchanges between pairs of tasks. If a message is not delivered in a certain time, the software fires the path finding mechanism, which guarantees complete network reachability. The proposed approach determines new paths quickly, and the costs of extra …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Evaluation of Adaptive Management Techniques in NoC-Based MPSoCs\n", "abstract": " Self-adaptation capability is as a key feature to meet runtime application requirements in dynamic systems such as NoC-Based MPSoCs. This paper presents an evaluation of adaptive management techniques combined with task monitoring, which are able to change at runtime the communication priority, the tasks scheduling priority and execute task migration. The monitoring is designed based on application profiling. The obtained results in terms execution time, latency and jitter, demonstrate the feasibility of such approach and the ability to support real-time applications.", "num_citations": "1\n", "authors": ["519"]}
{"title": "A self-adaptable distributed DFS scheme for NoC-based MPSoCs\n", "abstract": " As processor count in MPSoCs increases, the use of NoCs becomes relevant, if not mandatory. However, power and energy restrictions, especially in mobile applications, may render the design of NoC-based MPSoCs over-constrained. The use of traditional dynamic voltage and frequency scaling (DVFS) techniques proved useful in several scenarios to save energy/power, but it presents scaling problems and slow response times. This work proposes a self-adaptable distributed dynamic frequency scaling (DFS) scheme for NoC-based MPSoCs. It takes into account the communication load and the utilization level of each processor to dynamically change its operating frequency. Frequency change decisions and clock generation are executed locally to each processor. Clock generation is simple, based on clock gating of a single global clock. The overhead of the scheme is minimum, the range of generated clocks is …", "num_citations": "1\n", "authors": ["519"]}
{"title": "Evaluating energy consumption of homogeneous MPSoCs using spare tiles\n", "abstract": " The yield of homogeneous network-on-chip based multi-processor chips can be improved with the addition of spare tiles. However, the impact of this reliability approach on the chip energy consumption is not documented. For instance, in a homogeneous MPSoC, application tasks can be placed onto any tile of a defect-free chip. On the other hand, a chip with defective tile needs a special task placement, where the faulty tile is avoided. This paper presents a task placement tool and the evaluation of energy consumption of homogeneous NoC-based MPSoCs with spare tiles. Results show NoC energy consumption overhead ranging from 1 to 10% when considering up to three faults randomly distributed over the tiles of a 3×4 mesh network. The results also indicate that faults on the central tiles typically have more impact on energy overhead.", "num_citations": "1\n", "authors": ["519"]}
{"title": "HeMPS Station: an environment to evaluate distributed applications in NoC-based MPSoCs\n", "abstract": " Multi-Processor Systems-on-Chip (MPSoCs) are increasingly popular in embedded systems. Due to their complexity and huge design space to explore for such systems, CAD tools and frameworks to customize MPSoCs are mandatory. The main goal of this paper is to present a conceptual platform for MPSoC development, named HeMPS Station. HeMPS Station is derived from the MPSoC HeMPS. HeMPS, in its present state, includes the platform (NoC, processors, DMA, NI), embedded software (microkernel and applications) and a dedicated CAD tool to generate the required binaries and perform basic debugging. Experiments show the execution of a real application running in HeMPS.", "num_citations": "1\n", "authors": ["519"]}
{"title": "MOTIM: an industrial application using nocs\n", "abstract": " High-speed networks used to interconnect computers advance at an extraordinary pace, driven by the evolution of several contributing technologies. Due to the ever-increasing complexity of designing parts and equipments for these networks, design complexity management makes scalability and reusability more important issues than performance, in most cases. This paper describes MOTIM, a scalable and reusable architecture enabling the implementation of Ethernet switches with low latency and high throughput. The architecture is built around a network-on-chip-based switch fabric, which guarantees scalability. The architecture has been validated by functional simulation and prototyped in FPGAs. The experimental results show that even under severe traffic conditions the architecture achieves packet transmission with low latencies.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Avaliando o Impacto de Técnicas de Codificação de Dados Sobre o Consumo de Potência em Networks-On-Chip\n", "abstract": " This work investigates the reduction of power consumption in Networks-on-Chip (NoCs) through the reduction of transition activity using data coding schemes. The estimation of the NoC power consumption is performed with basis on macromodels which reproduce the power consumption on each internal NoC module according to the transition activity on its input ports. Such macromodels are embedded in a system model and a series of simulations are performed, aiming to analyze the trade-off between the power savings due to coding schemes versus the power consumption overhead due to the encoding and decoding modules.", "num_citations": "1\n", "authors": ["519"]}
{"title": "A mesh based Network on Chip characterization: A GALS approach\n", "abstract": " Archive ouverte HAL - A Mesh Based Network on Chip characterization : A GALS Approach Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation lirmm-00106054, version 1 Communication dans un congrès A Mesh Based Network on Chip characterization : A GALS Approach Gilles Sassatelli 1 Lionel Torres 1 Séverine Riso 2 Michel Robert 1 Fernando Moraes 2 Détails 1 SysMIC - Conception et Test de Systèmes MICroélectroniques LIRMM - Laboratoire d'Informatique de Robotique et de Microélectronique de …", "num_citations": "1\n", "authors": ["519"]}
{"title": "A CAD tool for the integration on hardware IP blocks\n", "abstract": " Building a SoC based on IP blocks can be a error-prone and tedious task when it is performed manually. There is a emerging trend towards the development of such design automation tools which helps the designer in the IP block integration. The goal of this work is to present the current status of a CAD tool which helps the user to integrate existing VHDL descriptions over a bus-based communication architecture in such way to build a more complex system. A example system based on ISCAS cores has been built to present some results in terms of number of gates.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Exploiting reconfigurability for low-power control of embedded processors\n", "abstract": " This paper proposes and evaluates a new implementation for the lowest level of instruction cache memories, which provides considerable power savings in the control memory subsystem of standard embedded processors. Instead of using power-demanding 6-T SRAMs for small I-caches, we exploit the possibility of using smaller switching capacitances, substituting the memory array with a specialized programmable logic circuit. Switching gains provided by this substitution are presented, illustrating a dramatic potential for power reduction in processor architectures for portable multimedia embedded applications.", "num_citations": "1\n", "authors": ["519"]}
{"title": "An adaptable educational platform for engineering and IT laboratory based courses\n", "abstract": " This work describes an educational kit developed at the University of Sussex, UK. The kit is based on reconfigurable computing technology, targeting its use in different laboratory based courses, with minimal modifications of the hardware components, and small GUI development. The paper describes the kit modules, and its adaptation to a case study.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Tool-Set for Remote and Partial Reconfiguration\n", "abstract": " Using the features of the Virtex device, a set of tools for remote, partial and dynamic reconfiguration was developed. Remote reconfiguration allows to upgrade or to modify a system from a distant location, by sending a partial (or complete) bitstream via radio or any other media. Partial reconfiguration can be used to quickly modify the system, inserting or removing cores, interconnecting different pre-verified hardware modules, called IP cores, in a single Systems-on-Chip (SOC) design. Even though the tools are target to a specific device, their principles can easily be used to other FPGA families, if they have an internal structure allowing partial reconfiguration", "num_citations": "1\n", "authors": ["519"]}
{"title": "Algoritmo de Roteamento Maze para Dispositivos Programáveis FPGA\n", "abstract": " Esta dissertação apresenta o desenvolvimento de um algoritmo de roteamento para dispositivos programáveis do tipo FPGAs. A principal motivação para o desenvolvimento deste algoritmo é encontrar uma solução eficiente para o problema de roteamento dos dispositivos programáveis FPGA. O trabalho apresenta a arquitetura de roteamento dos dispositivos programáveis da Xilinx, pois esta arquitetura é a utilizada pelo algoritmo. Os algoritmos acadêmicos de roteamento e suas características principais são apresentados em tabelas comparativas. Uma vez apresentados os algoritmos de roteamento encontrados na literatura, é apresentado o desenvolvimento do algoritmo de roteamento, comparando-o com o estado-da-arte. Por fim, apresenta-se uma proposta de implementação paralela do algoritmo, com o objetivo de reduzir o tempo de processamento para rotear grandes circuitos.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Deriving Different Computer Science Curricula from a Common Core of Disciplines\n", "abstract": " This paper addresses the construction of three different computer science curricula starting from a common core of disciplines. The curricula are named Information Systems, Computer Science and Computer Engineering. The first curriculum targets the formation of professionals intended to use computer as tools defined by the applications they run. The second prepares professionals to develop computer applications ranging from specific systems to basic software. The third is destined to produce professionals able to explore the hardware software interface in detail to implement basic software, such as drivers and operating system kernels.", "num_citations": "1\n", "authors": ["519"]}
{"title": "MODELAGEM E DESCRIÇÃO DE SISTEMAS COMPUTACIONAIS-UM ESTUDO DE CASO DE COMPARAÇÃO DAS LINGUAGENS VHDL E SDL\n", "abstract": " This paper discusses several aspects of the modeling and description of computational systems. A metamodel for representing the process of obtaining an abstract description (ie a model) of a computational system is proposed and justified. To concretely illustrate the compromises involved in modeling computational systems, the paper shows a case study of specifying a telecom hardware module and describing it in two languages with widely different modeling assumptions, namely VHDL and SDL. The comparison of the resulting descriptions shows some of the strengths and weaknesses of each language in the chosen context. Thus, the adequate choice of languages to use for specifying and describing complex computational systems is showed to be a critical step of the implementation of technological products.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Definição e Desenvolvimento de Metodologia de Codesign\n", "abstract": " Este documento tem o propósito de apresentar o trabalho desenvolvido durante a disciplina de Trabalho Individual I.O principal enfoque deste trabalho é ter contato com os princípios de codesign. Visando TI II, começaremos o desenvolvimento de aplicações simples baseado no fluxo de projeto conjunto hardware e software. Com a aplicação de preenchimento de polígono, pretendemos ter contato com todas as etapas de desenvolvimento de codesign. Porém, em um primeiro momento desenvolveremos este estudo de caso manualmente. Posteriormente serão realizadas análises comparativas entre o fluxo de projeto de sistemas computacionais manual e automático.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Projeto, Implementação e Validação de um IP Soft Core Ethernet sobre Dispositivos Reconfiguráveis\n", "abstract": " Este artigo descreve as estratégias de projeto, implementação e validação de um Núcleo de Propriedade Intelectual (IP soft Core) destinado a desempenhar o papel de protocolo de Controle de Acesso ao Meio para redes locais do tipo Ethernet. O projeto deste IP soft Core é completamente realizado na linguagem VHDL, sendo assim flexível, portável e personalizável para aplicações específicas. A implementação é especialmente desenvolvida para adaptar-se bem a ambientes onde o Core reside em dispositivos de hardware reconfigurável tais como FPGAs baseados em RAM. Também se descreve aqui a prototipação do IP soft Core Ethernet usando placas comerciais reconfiguráveis. Finalmente, o artigo introduz uma proposta para vários ambientes de validação, visando testar e caracterizar completamente o IP soft Core Ethernet em redes locais reais.", "num_citations": "1\n", "authors": ["519"]}
{"title": "VHDL\n", "abstract": " –Na Figura acima, tem-se o módulo F (entity desenhada à esquerda), com entradas A e B e saída Y. A architecture de F desenhada como sendo composta pelos módulos G, H, I e pelos sinais internos s1 e s2. Note-se que G e H possuem a mesma entity (entradas X, T, e saída U), representando (G e H) duas instâncias distintas de um mesmo módulo de hardware.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Reconfiguração Parcial e Remota de Dispositivos FPGA da Família Virtex\n", "abstract": " This work addresses partial and remote reconfiguration of FPGAs, having as main objective to provide the basis for research and development in the field of dynamically, partially and remotely reconfigurable systems. The main idea is to bring to hardware mechanisms similar to those used in virtual memory, ie, hardware virtualization. It presents an analysis of FPGA device (VIRTEX) and tools (Jbits) that enable partial and remote reconfiguration of FPGAs. Using in-house developed software, results of applying a complete and remote reconfiguration process are presented. Extensions of the tools to deal with partial reconfiguration are under development.", "num_citations": "1\n", "authors": ["519"]}
{"title": "WTROPIC: a www-based macro-cell generator\n", "abstract": " This paper presents a www-based macro-cell generator tool integrated in a www-based framework. The Wtropic tool allows user connections through the Internet and it provides a communication layer to execute the physical synthesis tool remotely from any machine with a Web-browser. The Wtropic server processes the client request at the server-side. So, only a small machine is requiredat the client-side. The Wtropic may have many servers in order to take advantage of distributed resources that can execute the physical synthesis tool.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Fast interconnect parasitic extraction in deep submicron using bin-based algorithm\n", "abstract": " Presents a fast interconnect capacitance extraction tool (wire extractor) LASCA, which considers the lateral coupling, ground and crossover capacitances. Using the bin-based algorithm to extract connectivity, empirical formulation and a simple 2 1/2 D methodology, we provide a good trade-off between accuracy and efficiency when compared to traditional layout extraction. Comparisons between our wire extractor with the Diva extractor (Cadence design Systems), give an average difference of only 5% in the final delay of some benchmarks, being up to 30 times faster than Diva.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Anatomia de uma Ferramenta de Síntese Automática de Layout\n", "abstract": " Este Capítulo apresenta os procedimentos que são necessários para implementar uma ferramenta de síntese automática de layout, assim como integrá-la a um fluxo de projeto que contemple níveis abstratos de descrição, como por exemplo, VHDL. O Capítulo 2 apresenta os conceitos de biblioteca virtual de células e síntese de macro-células. Estes conceitos são importantes, pois permitem situar a abordagem de síntese automática frente a outras abordagens, como standard-cells ou full-custom. Ainda neste Capítulo, apresenta-se as motivações que conduziram ao desenvolvimento da ferramenta TROPIC3, que será a ferramenta utilizada como exemplo no decorrer do texto.O Capítulo 3 apresenta o estilo de layout adotado na ferramenta TROPIC3. Cada detalhe de implementação, como posicionamento dos transistores, posição da alimentação, posição dos nós de saída, entre outros, são apresentados e justificados. O Capítulo 4 apresenta de forma simplificada os algoritmos necessários para implementar-se uma ferramenta de síntese de layot. Considerando a importância das capacitâncias parasitas em tecnologias sub-micrônicas, o Capítulo 5 apresenta o procedimento adotado para extrair-se estas capacitâncias, de uma forma rápida e precisa.", "num_citations": "1\n", "authors": ["519"]}
{"title": "Controling Configurations on Dynamic Reconfigurable Systems\n", "abstract": " Dynamically Reconfigurable Systems (DRSs) have the potential to provide hardware with flexibility similar to that of software. At the same time, they may lead to better performance and smaller system size. However, there is a clear lack of support devices, tools and design flows adequate for such systems. One of the main problems for enabling dynamically reconfigurable systems is the unavailability of efficient methods to control the hardware configuration process. The main contribution of this work is the proposal of a configuration controller totally built in hardware. This is different from previous approaches, where software implementations dominate. The proposed controller has been implemented and validated in Virtex-II Xilinx FPGAs.", "num_citations": "1\n", "authors": ["519"]}