{"title": "Communication quality in business negotiations\n", "abstract": " The quality of a business negotiation process is usually assessed by its economic outcome, e.g. in terms of Pareto efficiency or distance to Nash equilibrium. We argue that this assessment method is insufficient in that it fails to provide a comprehensive analysis of business negotiations. Negotiators engage in highly complex communication tasks, and these communication processes should be analysed along with the outcome in the overall evaluation of a business negotiation. To this end, we will introduce Communication Quality as a new construct for analyzing the negotiation process. Furthermore, it will be argued that Communication Quality itself can affect economic negotiation outcomes both short- and long-term. We will present relevant aspects of Communication Quality, outline a scheme for its operationalisation and measurement, and discuss its probable impacts on business negotiations.", "num_citations": "72\n", "authors": ["1325"]}
{"title": "Barriers to online booking of scheduled airline tickets\n", "abstract": " In the early years of e-Commerce, the tourism sector had high expectations for online booking. All the major airlines invested huge sums of money, not only to make booking features available, but also to integrate them into attractive, easy-to-use Web offerings. Nevertheless, even after years of investment and improvements, the booking ratio for all but the no-frills airlines is still disappointing. This paper discusses reasons for the slow adoption of online booking. Online booking systems are analyzed as consumer information environments for scheduled airline tickets. The analyses are based on two experiments conducted in 1999 and 2002 respectively. The negative effects of the underlying market structure and the product complexity in the adoption of online booking is also discussed.", "num_citations": "42\n", "authors": ["1325"]}
{"title": "An empirical investigation of the acceptance of electronic negotiation support system features\n", "abstract": " Electronic negotiation support aims at enabling complex trade interactions through means of information technology. Present research in electronic negotiation support is limited to a large extent to the analytical decision support view. There is a lack of empirical evidence on the acceptance of the different types of support in the negotiation support portfolio and their value contribution. In this paper, the results of a laboratory experiment evaluating the communication support feature of a particular negotiation support system, namely the Negoisst system, is presented. It is concluded, that dedicated communication support is highly relevant in users’ perception of usefulness.", "num_citations": "31\n", "authors": ["1325"]}
{"title": "The antecedents of renegotiations in practice—an exploratory analysis\n", "abstract": " In order to support business negotiations with electronic tools effectively, a deep understanding of real-life business negotiations is required. Comparing the settings usually applied in negotiation experiments with the every-day experiences of business negotiators, it can be stated that the work of business negotiators is much more iterative and embedded. Renegotiations appear on a regular basis. This observation stresses the importance of flawless communication in business negotiations and raises questions regarding the reasons for renegotiations and the role of information technology in this context. This paper investigates data gathered in a 2005 survey study in order to identify the context factors that drive B2B renegotiations using a preliminary regression model. The rules of interaction, task complexity, and business relationship are found to be significant predictors of the renegotiation likelihood …", "num_citations": "30\n", "authors": ["1325"]}
{"title": "Prosuming in der Telekommunikationsbranche: Konzeptionelle Grundlagen und Ergebnisse einer Delphi-Studie\n", "abstract": " Der vorliegende Bericht systematisiert verschiedene Formen des Prosuming und erarbeitet einen Klassifikationsrahmen speziell für die computergestützte Konfiguration digitaler Produkte. Innovative Telekommunikationsdienstleistungen wie unified messaging oder locationbased services sind gleichsam der Prototyp computergestützter Konfiguration, da sie kundenindividuelle, situativ differenzierte Einstellungen erfordern, um ihre Leistungen entfalten zu können. Obwohl die verstärkte Einbindung von Kunden in den Konfigurationsprozess die Voraussetzung für die Weiterentwicklung und Verbreitung innovativer Telekommunikationsdienstleistungen ist, sind am Markt erst rudimentäre Ansätze, zumeist in Form von Selbstbedienungs-Portalen, erkennbar. Um diesen wirklichen oder scheinbaren Widerspruch aufzulösen und eine Abschätzung der gegenwärtigen Bedeutung wie der künftigen Potenziale von Konfiguration und Selbstbedienungselementen in der Telekommunikationsbranche zu erhalten, haben wir mit einem Expertenpanel eine Delphi-Studie durchgeführt, deren Ergebnisse im zweiten Teil des Arbeitsberichts vorgestellt werden.", "num_citations": "26\n", "authors": ["1325"]}
{"title": "Challenges and solutions\n", "abstract": " Negotiation is an iterative communication and decision process. The aim of system support for electronic negotiations has led to a number of research approaches. An analysis of important existing approaches has shown two different predominant theoretical foundations. While the most prominent perspective is that on decision support, communication support has recently received more attention. In this paper, we will argue that the support of negotiation as a communication and decision process requires an integrated decision and communication perspective. Furthermore, we will present an integrated framework for negotiation support and exemplify the integration by introducing the negotiation support system Negoisst that implements an integrative approach.", "num_citations": "25\n", "authors": ["1325"]}
{"title": "Decision Support in Electronic Negotiation Systems-New challenges\n", "abstract": " Electronic negotiations can involve complex communication and decision processes if complex goods or service are involved. In such cases, an electronic negotiation support system (NSS) extended by a decision support (DS) component can provide valuable help for the users. However, since users have a bounded rationality, such complex processes will never be strictly linear nor rational. Therefore, there are a number of challenges that a DS method to be integrated into an NSS has to meet. This paper discusses the challenges and evaluates different methods for preference elicitation with respect to these challenges.", "num_citations": "11\n", "authors": ["1325"]}
{"title": "Personalisation in mobile information services\n", "abstract": " From a vendor’s point of view, eCommerce can facilitate new models of division of labour, which typically encompass a higher level of involvement on the customer’s, specifically consumer’s, end. In order to overcome shortcomings of computer-mediated communications, numerous individualization or personalization features have been added to eCommerce applications. In the telecommunication industry, as one prominent example, increasingly selfservice portals have been established which provide administrative functions such as a check of billing status, change of tariff or billing address. More advanced features like unified messaging are even more customer specific and are beneficial inasmuch as they are regularly adapted to the individual, situation specific needs.However, in contrast to vendor’s expectations, these features have not been well received and adopted by customers so far (eg Yahoo’s personalization features). In a first round of empirical enquiry, we have conducted several focus group analyses combined with usability tests with mobile phone users, which showed two major shortcomings: firstly, many functions were not known at all and, secondly, the usability of the Web portal was very limited. These findings must be quite troubling for the vendors as ongoing innovations in the telecommunications industry are leading to a need for even more user involvement: eg location based services require adaptable and regularly updated consumer profiles in order to provide satisfying results.", "num_citations": "9\n", "authors": ["1325"]}
{"title": "An empirical study on the use of communication media in electronic negotiations\n", "abstract": " Negotiation is a communicative process (Schoop et al., 2004; Weigand et al., 2003). Philosophers such as Habermas (1981) argue that the very purpose of communication is coordination which is what we see in business transactions and resource allocation today. Despite the dominance of research in the area of negotiations based on decision theory and game theory, flawless communication is a precondition and, therefore, its contingencies and possible breakdowns during business transactions need to be addressed. Although research on web-based electronic negotiation support systems is advanced, their application in real-life business negotiations is limited and empirical data on the reasons are scarce. Our aim is thus to research the use of different electronic media in B2B negotiation practices. In particular, we want to investigate which media are used for what purposes and why (cf. Poole et al., 1992, who review the beneficial and harmful impact of media on negotiations). These insights are the prerequisite for developing electronic negotiation systems that will be used in practice.", "num_citations": "8\n", "authors": ["1325"]}
{"title": "A meta model for electronic negotiations-Comparison of existing approaches\n", "abstract": " The negotiation phase of electronic transactions can be implemented in various forms including numerous auction mechanisms. As the rules of interaction must be understood by all transaction partners, humans as well as electronic negotiation agents, the need for precise negotiation models is evident. Therefore an integrated view is needed which also allows comparisons of different approaches. In this paper we will review and analyse existing negotiation (meta) models and identify the requirements for an integrated description formalism of electronic negotiations.", "num_citations": "8\n", "authors": ["1325"]}
{"title": "Electronic negotiation support systems and their role in business communication: an exploratory evaluation of auction use\n", "abstract": " 4. Results-A Grounded Theory Field Study of E-Auction Appropriation and Communicative Impact................................................................. 72", "num_citations": "2\n", "authors": ["1325"]}
{"title": "An Integrated Meta Model for Electronic Negotiations\n", "abstract": " In a discussion of the dominance of the auction paradigm in electronic business negotiations, Kersten et al.(2000) claim that “there is a strong demand for mechanisms that allow for different types of negotiations”. The questions that need to be addressed are how to characterise the different types, how to model them, and, eventually, how to integrate the different types. The negotiation phase of electronic transactions can be implemented in various forms including numerous bargaining or auction mechanisms. There is currently a gap between progressive research approaches and their application in practice. In order to close this gap, the rules of interaction must be understood by all transaction partners, humans as well as electronic negotiation agents. Thus the need for precise negotiation models is evident. Currently, modelling approaches can be distinguished according to three research schools, namely auctions (Bichler, 2000), agents (Jennings et al., 2001), and electronic negotiation support (Kersten and Noronha, 1999). Although all of these approaches address the same process, there is no comparative view.", "num_citations": "2\n", "authors": ["1325"]}