{"title": "Creating a Historical Database for Estimation Using the EPCU Approximation Approach for COSMIC (ISO 19761)\n", "abstract": " In the actual competitive software industry, software development organizations need a better and formal estimation approaches in order to increase the success rate of software projects. However, currently the estimation approach typically employed in industry is the expert judgment ('experience-based'). Using measures and estimations that continue to be based on researchers' intuition does not contribute to obtaining successful projects nor to mature software engineering. Any organization that aims to have or develop estimation approaches needs historical data, and the majority of the organizations do not have this information. Additionally acquisition of this information has expensive cost and time/effort consuming. This paper proposed the use of the EPCU approximation approach-that has demonstrated a several benefits-aiming to create a formal database with low cost and effort, that can be employed as a …", "num_citations": "6\n", "authors": ["2012"]}
{"title": "Design Of A Fuzzy Logic Estimation Process For Software Projects\n", "abstract": " Blurb/Shorttext: Project estimation is important because it is the basis for the allocation and management of the resources associated to a project, when the estimation process is not performed properly, this leads to higher risks and the organizations frequently end up with losses instead of the expected profits. Usually in the project’s early phases there is high uncertainty and the information about the project is vague, considering this issue, the existent estimations models (parametric) are not easy to be used because they requires quantitative information instead of subjective information and also historic data. This situation makes that the estimation technique more often used in software industry were “Expert Judgement”. This Book describes the EPCU model (Estimation of Projects in Contexts of Uncertainty), this is an estimation process based on fuzzy logic that aims to solve this problem taking the benefits of the …", "num_citations": "6\n", "authors": ["2012"]}
{"title": "Earned scope management: Scope performance evaluation for software projects considering people and effort as resources\n", "abstract": " Three of the significant constraints on projects are scope (size), cost (money) and time (schedule), and while Earned Value Management (EVM) and Earned Schedule (ES) techniques manage the cost and time constraints, they do not explicitly tackle the scope constraint. Even though scope management is recognized as a critical success factor in software projects, there is a lack of formal techniques in the literature to manage scope. This paper presents the results of the improvements to the Earned Scope Management (ESM) technique developed since 2015 and currently tested in Mexico with real projects.", "num_citations": "5\n", "authors": ["2012"]}
{"title": "Analyzing the performance of two COSMIC approximation sizing techniques at the functional process level\n", "abstract": " For accurate results, standards for the measurement of the functional size of software require that the functionality to be measured be fully known. However, when estimating in the early phases of software development where there is a lack of detail, approximate sizing techniques must be used. This paper investigates ‘equal size bands’ approximation and fuzzy-logic based approximation techniques using two distinct upper size boundaries and compares performance using a set of 180 functional processes identified from 63 use cases.", "num_citations": "4\n", "authors": ["2012"]}
{"title": "Analyzing the Performance of Two COSMIC Sizing Approximation Techniques Using FUR at the Use Case Level\n", "abstract": " For accurate results, standards for the measurement of the functional size of software require that the functionality to be measured be fully known. However, when estimating in the early phases of software development where there is a lack of detail, approximate sizing techniques must be used. An approximation mechanism that has proven useful when there is no historical data is the technique of approximation by EPCU, there are two EPCU contexts with the range of the output variable other than 16.4 CFP and 44 CFP. Previous studies have shown that when functional requirements are at a granularity level of Functional Process, the context recommending being applied is that the output variable has a cut-off at 16.4 CFP, this is done when comparing the distribution of approximation results against the distribution of the REAL sizes. This paper investigates the two EPCU contexts defined in the literature, seeking to identify which technique appears to better represent the distribution of the REAL sizes when the granularity level was Use Cases (UC), the ‘Equal Size Bands’(ESB) approximation and fuzzy logic-based approximation technique (EPCU) were also compared to identify which technique appears to represent the distribution of the REAL sizes better, when the granularity level was Use Cases (UC).From the results, it is not clear which approximation technique has the best performance, however carrying out the non-parametric test, it is possible to confirm statistically that the distribution of the EPCU44 approximation technique displays behavior similar to that of the distribution of the COSMIC REAL sizes.", "num_citations": "2\n", "authors": ["2012"]}
{"title": "Earned scope management: A case of study of scope performance using Use Cases as Scope in a real project\n", "abstract": " Three of the major constraints on projects are scope (size), cost (money), and time (schedule). While the Earned Value Management (EVM) and Earned Schedule (ES) techniques manage cost and time constraints, they do not explicitly tackle the scope constraint. While scope management is recognized as a key success factor in software projects, there is a lack of formal techniques in the literature to manage scope. This paper proposes an Earned Scope Management (ESM) technique based on non-conventional scope units such as Use Cases, for a software project scope.", "num_citations": "2\n", "authors": ["2012"]}
{"title": "Earned Scope Management: A Case of Study of Scope Performance using COSMIC (ISO 19761) with a Real Project\n", "abstract": " Three of the major constraints on projects are scope (size), cost (money) and time (schedule). While the Earned Value Management (EVM) and Earned Schedule (ES) techniques manage the cost and time constraints they do not explicitly tackle the scope constraint. While scope management is recognized as a key success factor in software projects, there is a lack of formal techniques in the literature to manage scope. This paper proposes an Earned Scope Management (ESM) technique based on ISO 19761 (COSMIC measurement method) as a standard measure of software scope.", "num_citations": "2\n", "authors": ["2012"]}
{"title": "Analysis of automated estimation models using machine learning\n", "abstract": " Plenty of practice based on software estimation has been developed in software industry. Algorithmic models represent the most formal approach that have provided the most reliable results. However, the use of informal practice is still prevalent just like the expert judgment which will not allow Software Engineering grow up.An important activity in big and small companies is to generate reliable estimation models. The development of these models is usually based on information obtained from past projects and requires a deep and precise analysis.This paper presents the application of the automated estimation-model generator system that uses machine learning techniques whit the objective of analysing the accuracy of these models comparing them to the traditional estimation methods using an international database and the internal database of a company.", "num_citations": "1\n", "authors": ["2012"]}
{"title": "Validation of supplier estimates using COSMIC method\n", "abstract": " In the software development industry, it is well known that software development organizations (suppliers) need a better and formal estimation approaches in order to increase the success rate of software projects developed. Considering a systematic view, any project requested by a customer needs to be validated in the estimation provided by the supplier, regardless of how formal or not the estimation method utilized was.However, very often the customers do not know the information used by the suppliers to make their estimations. The software decision makers must face a validation estimates problem where the more useful solution is used the expert judgment, with several problems related to it. In this paper, a real case study is described where a validation estimates model was generated from a reference database based in COSMIC method. The defined model using a density function helps to the customer to define validation criteria considering the probability that the supplier estimate will be met according to an industry reference database.", "num_citations": "1\n", "authors": ["2012"]}
{"title": "Finding core crosscutting concerns from object oriented systems using information retrieval\n", "abstract": " During the software development cycle, software products can undergo many changes in requirements and design. In one of those products, the source code of the system, these changes can impact the original specifications and design, leading to tangled and scattered code that affects the design and maintenance processes. Research efforts have been made to analyze the scattered code for concerns identification and extraction. In object oriented systems, these concerns can be distributed across many classes, leading to the definition and identification of crosscutting concerns. Many methods have been proposed to identify, extract and separate crosscutting concerns. In this paper, a method for crosscutting concerns identification using information retrieval techniques is presented. This work aims to identify the core crosscutting concerns, which are the main tasks a system has to satisfy whose code is scattered …", "num_citations": "1\n", "authors": ["2012"]}
{"title": "Using the ISO 19761 COSMIC Measurement Standard to Reduce “Information Asymmetry” in Software Development Contracts and Enable Greater Competitiveness\n", "abstract": " In most economic transactions involving software development projects, differences in the amount and quality of information possessed by economic agents (i.e. producers and customers) can lead to significant market inefficiencies. This paper describes the way the information derived from the functional size of software measured using the ISO 19761 COSMIC measurement standard that can help reduce information asymmetry in software development transactions, and lead to increased competitiveness in the software industry.", "num_citations": "1\n", "authors": ["2012"]}