{"title": "Cultura de café no Brasil: novo manual de recomendações\n", "abstract": " Biblioteca Conmemorativa Orton (IICA / CATIE) Catálogo ORTON Búsqueda general: Formato: Cantidad a desplegar: Orden ascendente: Texto completo: Búsqueda por diccionario: Cantidad a desplegar: Alianza SIDALC 1 / 1 Seleccione referencia / Select reference Signatura: 633.730981 C968 2005 Corporativo: Ministério da Agricultura, da Pecuária e do Abastecimento, Brasília, DF (Brasil) Autor: Matiello, JB; Santinato, R.; García, AWR; Almeida, SR; Fernandes, DR Título: Cultura de café no Brasil: novo manual de recomendacoes. Idioma: PT P.imprenta: Rio de Janeiro, RJ (Brasil). 2005. 434 p. Edición ; ed. rev. ampl. Notas: 55 ilus. 95 tab. Descriptores_Es: COFFEA ARABICA; MANEJO DEL CULTIVO; FACTORES CLIMATICOS; ZONIFICACION; VARIEDADES; PREPARACION DEL SITIO; SISTEMAS DE CULTIVO; RIEGO; PODA; CONTROL DE PLAGAS; COSECHA; CALIDAD; PROCESAMIENTO DE …", "num_citations": "313\n", "authors": ["1215"]}
{"title": "Efeitos da inconstitucionalidade da lei (A questão da repristinação da lei que revogou disciplina legal anterior e que ela própria foi afastada por inconstitucional)\n", "abstract": " 1. Introdução; 2. Os sistemas de controle de constitucionalidade; 3. O modelo brasileiro; 3. 1. Controle Difuso,· 3.2. O controle abstrato/concentrado; 4. Os efeitos da inconstitucionalidade, no Brasil; 4.1. Controle abstrato/concentrado; 4.2-Controle difuso; 4.3-A questão da repristinação da lei que revogou a lei anterior e que, posteriormente foi afastada, por inconstitucional; 5. Breves conclusões.", "num_citations": "96\n", "authors": ["1215"]}
{"title": "Exception flows made explicit: An exploratory study\n", "abstract": " Most of the exceptions exert a global design impact as they tend to flow through multiple module interfaces of a software system. Exception handling mechanisms in programming languages were originally proposed to improve the robustness and comprehension of error handling code. These mechanisms are traditionally based on the fundamental assumption that global exception flows should be always implicit. However, it has been empirically found that the implementation of global exception handling in real-life software projects tends to exhibit poor quality. This paper presents an exploratory study to assess the benefits and drawbacks of explicit exception flows (or exception channels), as opposed to implicit exception flows. The experiment design involved 15 participants using three alternative mechanisms for exception handling. Our analysis was driven by key indicators of software usability: (i) implementation …", "num_citations": "32\n", "authors": ["1215"]}
{"title": "Software reuse versus stability: Evaluating advanced programming techniques\n", "abstract": " With system development becoming increasingly incremental, software reuse and stability stand out as two of the most desirable attributes of high-quality software. In this context, a key goal in contemporary software design is to simultaneously promote reuse and stability of the software modules. However, the achievement of this goal is far from trivial as it largely depends on the programming techniques being employed in the software implementation. While the use of a specific advanced mechanism can somehow contribute to modules' reuse, it might also require developers to make various undesirable changes in their interfaces and implementation. In this context, there are a growing number of techniques for improving modularity, ranging from aspect-oriented and feature-oriented programming to composition filters. This paper presents an exploratory analysis of advanced programming techniques on how they …", "num_citations": "24\n", "authors": ["1215"]}
{"title": "A branch-and-bound algorithm for autonomic adaptation of multi-cloud applications\n", "abstract": " Adaptation is an important concern in cloud-based applications composed of services provided by different cloud providers since cloud services can suffer from Quality of Services(QoS) fluctuations. Other conditions that can also trigger an adaptation process at runtime are the unavailability of services or the violation of user-defined policies. Moreover, the detection and reaction on such changes must be done in an autonomic way, without the need of user intervention. This paper presents a dynamic adaptation approach for multi-cloud applications supported by a Branch-and-Bound (B&B) algorithm in order to optimize the adaptation process itself when selecting the services to be deployed within the application. Computational experiments comparing the B&B algorithm with another algorithm that evaluates all possible configurations for adapting an application showed that the B&B algorithm is faster than the …", "num_citations": "23\n", "authors": ["1215"]}
{"title": "Towards aspect-oriented programming for context-aware systems: A comparative study\n", "abstract": " Development of modular context-aware applications has been a deep challenge to software engineers. One of the main reasons is the crosscutting nature of certain context-awareness concerns. Specific distributed aspect-oriented programming (AOP) techniques have recently emerged as a promising candidate to address these shortcomings. This paper reports our ongoing effort on the definition of relevant criteria to perform a comparative analysis of five emerging AOP approaches for context-aware systems. We evaluate to what extent their specialized linguistic mechanisms scale to distributed systems, in particular context-aware mobile systems.", "num_citations": "22\n", "authors": ["1215"]}
{"title": "Almost automorphy profile of solutions for difference equations of Volterra type\n", "abstract": " This work deals with the almost automorphic profile of solutions of the nonlinear Volterra difference equation , n∈ℤ, for λ in a distinguished subset of the complex plane, where a(n) is a complex summable sequence and the perturbation f is a non-Lipschitz nonlinearity. Many illustrating remarks and examples are considered.", "num_citations": "15\n", "authors": ["1215"]}
{"title": "A contribuição do lazer no processo de hospitalização: um estudo de caso sobre os benefícios do projeto risoterapia\n", "abstract": " O presente artigo pretende realizar um estudo sobre a contribuição das atividades lúdicas na minimização dos efeitos causados no processo de hospitalização, que não deve ser levado em consideração apenas as implicações físicas, mas também o lado psicológico, social e emocional de cada enfermo. De modo específico, um dos objetivos é identificar os benefícios gerados pela atuação do Projeto RisoTerapia no município de Caicó-RN, também detectar de acordo com as faixas etárias como se encontra o nível de satisfação dos pacientes que conhecem o projeto. Para alcançar os objetivos, foi realizada uma pesquisa bibliográfica onde se obteve melhor compreensão da temática abordada, em seguida, foi realizada uma visita para observação da atuação dos voluntários, isso porque se fez necessário sentir primeiro como os integrantes atuam, para assim, poder realizar a construção de um formulário que visou a percepção dos pacientes em relação ao RisoTerapia. Após a aplicação dos formulários pode-se notar que a grande maioria dos pacientes visualiza benefícios e alta satisfação com a atuação do projeto, citam que após a visita, melhoram o humor, ficam mais alegres, a rotina hospitalar é amenizada, melhoram a autoestima, alivia a dor e sensação de abandono, aumenta a perspectiva de melhora, motiva o paciente entre outros fatores considerados benéficos para uma pessoa internada. Observa-se que todas as faixas etárias demonstram em sua maioria um nível de satisfação alto ou médio e que em relação ao nível de importância dado ao projeto, considera-se muito importante ou importante. Todos os 30 entrevistados …", "num_citations": "13\n", "authors": ["1215"]}
{"title": "Avaliação nutricional do feno de leucena com aves caipiras\n", "abstract": " Para avaliar a digestibilidade dos nutrientes de rações simplificadas contendo feno de leucena para aves caipiras em fase de crescimento, foram utilizadas 24 unidades experimentais, distribuídas em delineamento inteiramente casualizado em esquema fatorial 2x2, a saber: uma ração controle (RCO) e outra ração com feno de leucena (FLE), fornecidas em duas fases de crescimento, uma entre 8 e 10 semanas (fase de cria–FC) e outra entre 16 e 18 semanas de idade (fase de recria-FR). As aves foram alojadas aos pares em gaiolas metálicas adaptadas para coleta total de excretas, dispostas em baterias padronizadas, recebendo água e alimentação à vontade. Os resultados de digestibilidade aparente para FLE foram inferiores à RCO, sendo observadas médias gerais de 79, 07% para matéria seca (MS), de 84, 57% para proteína bruta (PB), de 76, 55% para extrato etéreo (EE), de 31, 79% para fibra em detergente neutro (FDN), de 22, 42% para fibra em detergente ácido (FDA), de 77, 92% para energia bruta (EB) e disponibilidade de 19, 87% para matéria mineral (MM). Assim, a inclusão de 20% do feno de leucena na ração das aves, em ambas as fases de crescimento, não propiciou redução significativa na digestibilidade total, tornando permissível a inclusão dietética desta leguminosa para aves caipiras.", "num_citations": "13\n", "authors": ["1215"]}
{"title": "Dynamic decision-making based on NFR for managing software variability and configuration selection\n", "abstract": " Due to dynamic variability, identifying the specific conditions under which non-functional requirements (NFRs) are satisfied may be only possible at runtime. Therefore, it is necessary to consider the dynamic treatment of relevant information during the requirements specifications. The associated data can be gathered by monitoring the execution of the application and its underlying environment to support reasoning about how the current application configuration is fulfilling the established requirements. This paper presents a dynamic decision-making infrastructure to support both NFRs representation and monitoring, and to reason about the degree of satisfaction of NFRs during runtime. The infrastructure is composed of:(i) an extended feature model aligned with a domain-specific language for representing NFRs to be monitored at runtime;(ii) a monitoring infrastructure to continuously assess NFRs at runtime; and …", "num_citations": "12\n", "authors": ["1215"]}
{"title": "O sistema do precatório\n", "abstract": " Traz abordagem histórica do precatório requisitório no Brasil e estuda o sistema atual de execução contra a Fazenda Pública através do precatório, apontando também as controvérsias sobre o tema no Código de Processo Civil.", "num_citations": "11\n", "authors": ["1215"]}
{"title": "lp-boundedness properties for Volterra difference equations\n", "abstract": " This work deals with l p-boundedness of solutions of a class of Volterra functional difference equation. The effect of different kinds of the nonhomogeneous term (Lipschitz, local Lipschitz, completely continuous), are taken into consideration.", "num_citations": "10\n", "authors": ["1215"]}
{"title": "On the role of composition code properties on evolving programs\n", "abstract": " Composition code defines the binding of two or more modules in a program. Post object-oriented programming techniques are increasingly providing expressive mechanisms to enable the flexible definition of composition code. Such composition mechanisms are intended to support programmers in factoring out the complexity of a program and facilitate its evolution. However, the properties of composition code might introduce new flavours of complexity, and in turn cause side effects on program evolvability. Unfortunately, the role of composition code properties on evolving software systems is not yet well understood. This gap is mostly due to the lack of a measurement framework to characterize and quantify composition code. Existing metrics suites are focused on quantifying properties of programs and their modules only. Therefore, programmers are not able to analyse and understand the impact of particular …", "num_citations": "9\n", "authors": ["1215"]}
{"title": "A questão do prazo razoável da duração do processo\n", "abstract": " Informa que a duração razoável do processo é um princípio constitucional positivado entre os direitos e garantias constitucionais desde a EC n. 45/2004, que acrescentou o inc. LXXVIII ao art. 5º da CF/88.", "num_citations": "8\n", "authors": ["1215"]}
{"title": "Apontamentos Científicos em um Campo Multidisciplinar: turismo, ciência moderna e complexidade\n", "abstract": " No contexto de cientificidade e superação de paradigmas na sociedade atual, o turismo insere-se no debate de categorização ou não como ciência. Pesquisadores apresentam trabalhos epistemológicos contribuindo para o entendimento e avanço dos estudos na área. Entende-se que, para tal discussão, é pertinente construir caminhos alternativos que afastem a ideia de ciência normal do turismo, considerando o seu potencial. Sendo assim, o objetivo do presente artigo é iniciar uma discussão teórica sobre as possibilidades de uma nova visão do turismo como uma possível ciência, com propriedades mutáveis e flexíveis. Para isso, utilizouse uma metodologia de trabalho ensaístico, baseado em bibliografias e teorias de autores constituintes do debate sobre teoria do turismo e ciência normal. Discute-se a questão da ciência normal, perpassando pela ciência moderna, inserindo o contexto do turismo, chegando a autores com abordagem do campo do turismo como multidisciplinar e interdisciplinar. Alguns apontamentos foram realizados, voltados para revisão da concepção de ciência normal e rígida, além de tratar o turismo como núcleo fugidio em virtude da sua complexidade, das reivindicações deste campo como colônia de outras disciplinas e a necessidade da busca dos pesquisadores do turismo por maior autonomia teórica e metodológica e maior aderência da teoria da complexidade.", "num_citations": "7\n", "authors": ["1215"]}
{"title": "Inclusion of annatto seed by-product in diets containing sorghum for slow-growth broilers\n", "abstract": " Sorghum is used as a source of energy alternative to corn, however, its low pigments content are considered hindrance to the use of this feedstuff for poultry. The inclusion of annatto seed by-product (ASB) may solve this problem. In this context, the objective of this study was to evaluate the effect of ASB inclusion in diets containing sorghum as the main source of energy on performance, carcass traits, meat color, and economic viability in the production of slow-growth broilers. A total of 420 sexed chicks of the Carijó Pesadão line were distributed in a completely randomized design according to a 2 × 7 factorial arrangement, with three replicates of 10 birds per treatment. Studied factors were two sexes (males and females) and seven diets, wherein one had corn as source of energy and the others contained sorghum plus inclusion of 0, 3, 6, 9, 12, and 15% of ASB. Irrespective of the sex, diets did not affect feed intake (g/bird), feed conversion (g/g), yields (%) of carcass, breast and drumstick+thigh, percentage of abdominal fat, or relative weight of the liver. However, the inclusion of ASB influenced the color parameters of the meat making it more pigmented and improved the economic viability parameters. In diets for slow-growth birds containing sorghum as the main source of energy, ASB can be included up to 15%, and meat pigmentation problems can be reduced with total substitution of corn by sorghum with inclusion of ASB from 3%.", "num_citations": "7\n", "authors": ["1215"]}
{"title": "Effect of Syzygium cumini leaves on laying hens performance and egg quality\n", "abstract": " The aim of this study was to evaluate the effect of Syzygium cumini leaves (SCL) in laying hens diets on productive performance, egg quality and lipid oxidation of yolk. A total of 108 Hysex White laying hens were distributed in a completely randomized design with three treatments and six replicates of six birds each. The treatments consisted of SCL inclusion at dietary levels of 0, 5 and 10 g/kg. There was no significant effect of SCL inclusion on feed intake, laying percentage, weight and egg mass, feed conversion ratio, Haugh units, specific gravity, percentage of yolk, albumen and egg shells and shell thickness. However, the inclusion of SCL significantly influenced the yolk color and yolk lipid oxidation measured by TBARS values. Yolk color increased and TBARS values ​​decreased with the inclusion of SCL. The inclusion of SCL in laying hens diets improves pigmentation and lipid stability of yolk.", "num_citations": "6\n", "authors": ["1215"]}
{"title": "About the behavior of solutions for Volterra difference equations with infinite delay\n", "abstract": " We study the existence of discrete almost automorphic solutions and asymptotic behavior for non-linear Volterra difference equations of convolution type with infinite delay where the nonlinear perturbation is considered not necessarily globally Lipschitz. The results are a consequence of application of different fixed point theorems, namely, the contraction principle, the Leray–Schauder, the Krasnoselkii and Matkowski’s fixed point technique.", "num_citations": "6\n", "authors": ["1215"]}
{"title": "Reuse vs. maintainability: revealing the impact of composition code properties\n", "abstract": " Over the last years, several composition mechanisms have emerged to improve program modularity. Even though these mechanisms widely vary in their notation and semantics, they all promote a shift in the way programs are structured. They promote expressive means to define the composition of two or more reusable modules. However, given the complexity of the composition code, its actual effects on software quality are not well understood. This PhD research aims at investigating the impact of emerging composition mechanisms on the simultaneous satisfaction of software reuse and maintainability. In order to perform this analysis, we intend to define a set of composition driven metrics and compare their efficacy with traditional modularity metrics. Finally, we plan to derive guidelines on how to use new composition mechanisms to maximize reuse and stability of software modules.", "num_citations": "6\n", "authors": ["1215"]}
{"title": "Detecting Modularity Flaws of Evolving Code: What the History Can Reveal?\n", "abstract": " Modularity flaws can hamper the reuse and maintainability of code or even indicating the architecture degradation of a system. Therefore, researchers have increasingly investigated new mechanisms to assist the detection of these anomalies. Strategies for detection these flaws usually ignore information about the software change history. However, recent studies report that these strategies have been considered counter-productive. This article proposes and evaluates the use of detection strategies consisting of metrics that consider historic properties of evolving source code. It also proposes tool support for history-sensitive detection of modularity flaws. The strategies are evaluated in terms of precision and recall to detect three classic modularity flaws over 16 versions of two systems. Several observations were made, including: (i) exploiting information about the code evolution can contribute to effective detection of …", "num_citations": "6\n", "authors": ["1215"]}
{"title": "Fresh and stored copra meal in meat quail diets\n", "abstract": " The aim of the current study was to evaluate the addition of fresh and stored copra meal to the diet of meat quails. Two hundred eighty-seven-day-old male and female quails were distributed in a completely randomized design, with five treatments, in a 2 × 2 + 1factorial arrangement. Two copra meal types (fresh and stored) at inclusion levels of 12.5% and 25%, respectively, were added to a corn-soybean meal-based diet, with seven replicates, of eight quails each. Copra meal acidity index recorded oleic acid percentage increase from 0.47 to 3.03% after six storage months. However, regardless of storage type, its addition to quails’ diet resulted in higher values of metabolizable energy, in lower feed intake and better feed conversion than corn-soybean meal diet. Copra meal addition to quails’ diet did not affect carcass traits, liver and pancreas relative weight, and bone growth and quality. Although …", "num_citations": "4\n", "authors": ["1215"]}
{"title": "Turismo em áreas naturais protegidas: análise da perspectiva do planejamento turístico nas unidades de conservação em processo de criação no Polo Costa das Dunas/RN\n", "abstract": " A presente pesquisa tem como objetivo central compreender como a gestão do Polo Turístico Costa das Dunas está se envolvendo no planejamento turístico das unidades de conservação que estão em processo de criação. O Rio Grande do Norte possui nove UC’s legalmente instituídas que corresponde cerca de 240 mil hectares, além disso, o IDEMA/RN, por meio do Núcleo de Unidades de Conservação está investindo na criação de novas unidades, e as que encontram-se localizadas no Polo Costa das Dunas são objetos do presente estudo, o Parque Estadual do Jiqui, localizado no município de Parnamirim/RN e o Parque Estadual dos Mangues do Potengi que está localizado em Natal/RN. Para construção do trabalho foram realizados levantamentos bibliográficos e documentais buscando maior aprofundamento na temática e conhecimento sobre as áreas de estudo. A pesquisa tem caráter exploratório e descritivo com abordagem qualitativa e as técnicas de análise utilizadas foram descritivas e análise de conteúdo. Dessa maneira, os resultados da investigação trouxeram o entendimento do processo de criação das UC’s, envolvimento de atores do turismo, bem como, a percepção do conselho gestor do Polo Costa das Dunas quanto aos riscos e benefícios que em potencial referente ao uso turístico em ambos os parques em criação. Destarte, constatou-se que o processo de criação dos parques encontram-se parados e as discussões referentes as UC’s são escassas no contexto de reuniões do Polo Costa das Dunas, especialmente se tratando dos Parques em criação, Mangues do Potengi e Jiqui, além disso, notou-se que …", "num_citations": "4\n", "authors": ["1215"]}
{"title": "Lp‐boundedness and topological structure of solutions for flexible structural systems\n", "abstract": " This work deals with Lp‐boundedness of mild solutions for an abstract version of the damped wave equation u′′+αu′′′=βΔu + γΔu′+f that models the vibrations of flexible structures possessing internal material damping and external force f. We prove that the set consisting of mild solutions for this problem is compact and connected in the space of continuous functions. This property is known in the literature as the Kneser's property. Copyright © 2015 John Wiley & Sons, Ltd.", "num_citations": "4\n", "authors": ["1215"]}
{"title": "On-demand integration of product lines: A study of reuse and stability\n", "abstract": " The integration of multiple SPLs is increasingly becoming a trend to enable on-demand derivation of new products and accelerate their time-to-market. Integration of SPLs often implies the reuse of a previously-implemented feature across other SPLs. The reuse of a SPL feature is only viable if the underlying programming mechanisms enable its smooth composition within the code of other SPLs. If the required modifications are significant, the design of the target SPLs are likely to be destabilized. This paper presents an exploratory study on the integration of three product lines from the board game domain. We investigate how aspect-oriented and feature-oriented programming impact on the reuse and stability of those product lines.", "num_citations": "4\n", "authors": ["1215"]}
{"title": "Stability of product lines with composition filters: An exploratory study\n", "abstract": " With system development becoming increasingly incremental, design stability stands out as one of the most desirable software quality attributes. Development of stable software systems is particularly challenging in the domain of software product lines (SPLs), where their core architecture, set of features, and multiple products are continuously evolving. Contemporary programming languages, such as Compose*, are promising solutions to support enhanced SPL stability through the notion of composition filters. Aspect-oriented and feature-oriented programming models have often being used and assessed in the context of SPL development. However, there is little empirical knowledge on which situations such composition filters mechanisms, in fact, can be used to build SPLs with superior stability. This paper presents an exploratory study that compares the stability of Compose* and AspectJ implementations through multiple releases of two product lines. These implementations are evaluated by means of independentlyvalidated stability metrics. Our results show that the use of Compose* to implement non-functional features and interacting code-sharing features often foster more stable SPL designs than AspectJ ones.", "num_citations": "4\n", "authors": ["1215"]}
{"title": "Breves considerações sobre plebiscito, referendo e participação popular no Brasil\n", "abstract": " Analisa os instrumentos de participação popular no processo legislativo, buscando identificar-lhe as vantagens e desvantagens, tendo em vista a Lei n. 9709/98, que regulamentou a execução do disposto nos incs. I, II e III do art. 14 da CF/88.", "num_citations": "4\n", "authors": ["1215"]}
{"title": "Almost periodicity for a nonautonomous discrete dispersive population model\n", "abstract": " In this article, study the almost periodic profile of solutions for nonautonomous difference equations in Banach spaces. We apply our results in population dynamics.", "num_citations": "3\n", "authors": ["1215"]}
{"title": "Inclusão do resíduo da semente do urucum em rações contendo sorgo para frangos de corte de crescimento lento\n", "abstract": " SOUZA, Davyd Herik et al. Inclusão do resíduo da semente do urucum em rações contendo sorgo para frangos de corte de crescimento lento. Ciênc. agrotec.[online]. 2015, vol. 39, n. 3, pp. 248-259. ISSN 1981-1829. https://doi. org/10.1590/S1413-70542015000300006.", "num_citations": "3\n", "authors": ["1215"]}
{"title": "Higiene genital feminina\n", "abstract": " Introdução: A saúde genitourinária da mulher encontra-se diretamente relacionada com a sua higiene íntima diária. O conhecimento da anatomia da mulher, fases do ciclo menstrual e do ciclo de vida da mulher, melhoram a capacidade de cada mulher promover uma higiene íntima diária adequada à sua fase da vida. Objetivos: Informar sobre os cuidados diários de higiene genital feminina Transmitir conselhos práticos sobre hábitos de higiene, vestuário e comportamentos que promovem o conforto diário   Aconselhar acerca da escolha dos produtos de higiene apropriados Desenvolvimento: A região genital feminina é anatomicamente composta pela vulva (grandes e pequenos lábios, introito vaginal, uretra, clitóris), região perianal e região nadegueira A pele região genital tem 2 funções: proteção (térmica, mecânica, química e contra agentes infeciosos) e de barreira biológica, através um pH ácido da barreira lipídica e do suor. O objetivo da realização da higiene íntima diária é a manutenção das funções da pele descritas removendo os resíduos e secreções, mantendo a barreira protetora da pele. Assim, a higienização da região anogenital deve ser efetuada com água corrente, até 2 minutos de duração, com movimentos circulares, utilizando um produto adequado ao pH e sempre da região vulvar para a região perianal. Está aconselhada a sua realização duas vezes por dia, podendo no entanto ser necessário adequar a frequência tendo em conta a temperatura ambiente, idade ou fase do ciclo menstrual. A secagem da zona higienizada deve ser sempre realizada com toalha de algodão e poder-se-á efetuar a hidratação da pele …", "num_citations": "3\n", "authors": ["1215"]}
{"title": "Integrating software product lines: A study of reuse versus stability\n", "abstract": " To achieve large-scale reuse and accelerate time-to-market, integration of multiple software product lines (SPLs) is becoming a trend. The integration of independently-developed SPLs enables the derivation of new products on demand in a particular domain. The basic goal is to foster the reuse of previously-implemented features across a family of independently-developed SPLs. The programming technique employed in this context should promote the reuse of feature code across the SPLs with minimum change effort. Otherwise, the stability of the target SPLs would be compromised. This paper presents an exploratory study on the stepwise integration of three product lines from the board game domain. We investigate how the programming mechanisms supported by aspect-oriented and feature-oriented programming impacted the reuse and stability of those product lines. In particular, we also analyse and …", "num_citations": "3\n", "authors": ["1215"]}
{"title": "A reforma das leis processuais\n", "abstract": " 1. Introdução 2. Bases ideológicas de qualquer reforma processual 3. Breve noção da linha evolutiva dos sistemas processuais e identificação do sistema processual civil brasileiro 4. Resumo das reformas das leis processuais civis brasileiras: 4.1–Natureza e diretrizes 4.2–Breve resumo das reformas já realizadas 4.3–Exame sucinto da última fase da reforma, com ressalto para a apreciação de duas modificações introduzidas pela EC nº 45/2004: o prazo razoável e a Súmula Vinculante: a) O prazo razoável: I-Conceito II-A questão da responsabilização pelo não atendimento da exigência b) A Súmula Vinculante I–Argumentos favoráveis II–Opinião de JC Barbosa Moreira III–Nossa opinião 5. A reforma que falta (crítica a algumas mudanças processuais).", "num_citations": "3\n", "authors": ["1215"]}
{"title": "Tribunal Constitucional do Brasil: novo paradigma do poder moderador\n", "abstract": " 1. A criação da Corte Constitucional no Brasil; 1.1. Proêmio; 1.2. Caracterfsticas dos Tribunais Constitucionais; 1.3. O Supremo Tribunal Federal brasi-leiro (STF): Tribunal Constitucional; 1.4. Necessidade de aperfeiçoamentos; 1.4. 1. Na competência; 1.4. 2. Naforma de composição; 1.4. 5. Sugestões de mudanças.", "num_citations": "2\n", "authors": ["1215"]}
{"title": "Níveis de sombreamento em cafezal na regiao serrana de Pernambuco, 3\n", "abstract": " Biblioteca Conmemorativa Orton (IICA / CATIE) Catálogo ORTON Búsqueda general: Formato: Cantidad a desplegar: Orden ascendente: Texto completo: Búsqueda por diccionario: Cantidad a desplegar: Alianza SIDALC 1 / 1 Seleccione referencia / Select reference Signatura: 633.73063 C749 1989 Corporativo: Instituto Brasileiro do Café, Rio de Janeiro (Brasil). Diretoria de Producao Autor: Matiello, JB; Dantas, FA de S.; Camargo, AP de; Ribeiro, RNC Conferencia: 15. Congresso Brasileiro de Pesquisas Cafeeiras. Maringá, PR (Brasil). 26-29 Set 1989. Título: Níveis de sombreamento em cafezal na regiao serrana de Pernambuco, 3. Título Monografía: Trabalhos apresentados. P.imprenta: Rio de Janeiro (Brasil). 1989. p. 182. Notas: 1 tab Descriptores_Es: COFFEA ARABICA; CATUAI; SOMBRA; RENDIMIENTO; BRASIL Descriptores_In: COFFEA ARABICA; SHADE; YIELDS; BRAZIL k=433128 Total de registros: …", "num_citations": "2\n", "authors": ["1215"]}
{"title": "Arborizacao de cafeeiros com Grevilea robusta na regiao serrana de Pernambuco\n", "abstract": " Foram estudados tres níveis de sombra em cafeeiros, através de tres diferentes espacamentos de plantio de Grevilea robusta no meio de cafezal, sendo 8 x 8, 8 x 16 e 16 x 16 m, além da testemunha sem arborizacao. O ensaio foi conduzido em Brejao-Pernambuco, com plantio de café em 1981 e das grevíleas em 1982. Após os resultados de 3 safras foram observados aumentos médios de producao variando de 21 a 65 por cento nos tratamentos com sombra, com melhor resposta na área com espacamento de árvores mais junto (8 x 8 m).", "num_citations": "2\n", "authors": ["1215"]}
{"title": "A note on temporal regularity of second order difference equations\n", "abstract": " This work deals with the study of maximal ℓp‐regularity of a pair (A,B) of bounded linear operators on a complex Banach space   associated to the second order difference equation un + 2 = Bun + 1 + Aun + fn, where f is a given sequence on  . We obtain results of characterization based on spectral analysis of the discrete sine family, which is the resolvent family of this equation.", "num_citations": "1\n", "authors": ["1215"]}
{"title": "Percepção de estudantes quanto aos impactos na criação e visitação de parques naturais protegidos\n", "abstract": " O objetivo do presente artigo é investigar os impactos ambientais, econômicos e sociais associados ao apoio à criação e visitação de áreas naturais protegidas, como os parques naturais, realizado com alunos de graduação em turismo do Estado do Rio Grande do Norte. Neste sentido, foi feita uma pesquisa quantitativa descritiva, com amostragem não probabilística, aplicada a 111 alunos de graduação em turismo nas instituições IFRN e UFRN. O instrumento de pesquisa consistiu em um questionário elaborado e aplicado no mês de maio de 2017, no qual continha 39 assertivas sobre o tema proposto a serem respondidas de acordo com o grau de concordância em escala métrica de 11 pontos. Utilizou-se o Software SPSS versão 22.0/2013 para o tratamento e análise dos dados. A análise fatorial foi realizada com o objetivo reduzir variáveis e construir um conjunto que explicasse as determinadas dimensões. Os resultados demonstraram um significativo apoio à criação de parques naturais protegidos pelo público de estudantes, associado aos possíveis impactos positivos ambientais, sociais e econômicos. Acredita-se que estudos que contemplem outros públicos como residentes e gestores dos parques podem contribuir para uma melhor compreensão do apoio a criação destas áreas e os impactos relacionados a este processo e ao uso público das mesmas. Perception of students as to the impact on creation and visitation of protected natural parks The objective of the present article was to investigate the environmental, economic and social impacts associated to the support to the creation and visitation of protected natural areas …", "num_citations": "1\n", "authors": ["1215"]}
{"title": "Breves considerações sobre o direito processual constitucional\n", "abstract": " Analisa a existência de uma nova disciplina jurídica nascida da interseção entre o Direito Processual e o Direito Constitucional e avalia qual a denominação mais apropriada para ela.", "num_citations": "1\n", "authors": ["1215"]}
{"title": "Jurisdição constitucional: sistemas de controle da constitucionalidade e o modelo brasileiro\n", "abstract": " Descreve a jurisdição constitucional, a inconstitucionalidade sob a perspectiva da garantia, o estado de direito e o controle jurisdicional, além de analisar os sistemas de controle de constitucionalidade das normas, enfocando o sistema brasileiro.", "num_citations": "1\n", "authors": ["1215"]}
{"title": "Breves considerações sobre a constitucionalidades da Lei de Arbitragem\n", "abstract": " Comenta sobre a constitucionalidade da Lei de Arbitragem, analisando inovações trazidas como o exercício da função jurisdicional.", "num_citations": "1\n", "authors": ["1215"]}
{"title": "Tabela para estimar a evapotranspiração potencial na região do Triângulo Mineiro\n", "abstract": " Biblioteca Conmemorativa Orton (IICA / CATIE) Catálogo ORTON Búsqueda general: Formato: Cantidad a desplegar: Orden ascendente: Texto completo: Búsqueda por diccionario: Cantidad a desplegar: Alianza SIDALC 1 / 1 Seleccione referencia / Select reference Signatura: 633.73063 C749 1989 Corporativo: Instituto Brasileiro do Café, Rio de Janeiro (Brasil). Diretoria de Producao Autor: Camargo, AP de Conferencia: 15. Congresso Brasileiro de Pesquisas Cafeeiras. Maringá, PR (Brasil). 26-29 Set 1989. Título: Tabela para estimar a evapotranspiracao potencial na regiao do triangulo mineiro. Título Monografía: Trabalhos apresentados. P.imprenta: Rio de Janeiro (Brasil). 1989. p. 193-194. Notas: Tab. 3 ref Descriptores_Es: ZONAS CAFETERAS; EVAPOTRANSPIRACION; BRASIL Descriptores_In: EVAPOTRANSPIRATION; BRAZIL k=433479 Total de registros: 1 BD ORTON BD REVIS Ayuda MegaBase …", "num_citations": "1\n", "authors": ["1215"]}
{"title": "POTENCIAL DO URUCUM E SEUS RESÍDUOS PARA PIGMENTAÇÃO DOS PRODUTOS AVÍCOLAS\n", "abstract": " No Brasil, as rações para aves se caracterizam pelo uso do milho, como principal fonte de energia, e do farelo de soja, como principal fonte protéica. Esses insumos têm produção e comercialização influenciadas por fatores econômicos do mercado nacional e internacional, estando sujeitos a variações de preço, em função da disponibilidade e economicidade. Esses fatores, aliados à crescente procura desses cereais para alimentação humana, têm levado ao aumento significativo dos custos desses ingredientes em algumas épocas do ano, principalmente, nas regiões onde a produção é insuficiente para atender a demanda. O aumento nos custos com alimentação advindos da elevação dos preços do milho e farelo de soja ou a baixa disponibilidade desses ingredientes em algumas regiões tem incentivado as pesquisas para buscar alimentos alternativos que possam suprir as necessidades das aves, sem …", "num_citations": "1\n", "authors": ["1215"]}