{"title": "Dealing with REST services in model-driven web engineering methods\n", "abstract": " A demanded industry requirement is how to integrate the functionality from Web 2.0 applications into their Information Systems (IS). In recent years, Web Engineering has faced this issue defining a set of conceptual models that abstract the communication with external SOAP Web Services. However, Web 2.0 applications usually expose their functionality by means of REST Services. Since this type of services lacks of a formal specification, the integration issues must be manually addressed. The main purpose of this work is to introduce a Model-driven approach for the integration of Web 2.0 functionality implemented as REST Services. To achieve this goal, this works presents a REST Metamodel for specifying these REST Services as conceptual models. It also introduces how the models created using this metamodel, can be used within Model-driven Web Engineering methods.", "num_citations": "62\n", "authors": ["613"]}
{"title": "Applying conceptual modeling to better understand the human genome\n", "abstract": " The objective of the work is to present the benefits of the application of Conceptual Modeling (CM) in complex domains, such as genomics. This paper explains the evolution of a Conceptual Schema of the Human Genome (CSHG), which seeks to provide a clear and precise understanding of the human genome. We want to highlighting all the advantages of the application of CM in a complex domain such as Genomic Information Systems (GeIS). We show how over time this model has evolved, thus we have discovered better forms of representation. As we advanced in exploring the domain, we understood that we should be extending and incorporating the new concepts detected into our model. Here we present and discuss the evolution to reach the current version (CSHG v2). A solution based on conceptual models gives a clear definition of the domain with direct implications for the medical context.", "num_citations": "45\n", "authors": ["613"]}
{"title": "Facing the technological challenges of web 2.0: A RIA model-driven engineering approach\n", "abstract": " One of the main reasons for the success of Web 2.0 is the improvement in user experience. This improvement is a consequence of the evolution from HTML User Interfaces (UI) to more usable and richer UI. The most popular Web 2.0 applications have selected the Rich Internet Application (RIA) paradigm to achieve this goal. However, the current Web Engineering methods do not provide the expressivity required to produce RIA interfaces. This work presents a RIA Metamodel to deal with the new technological challenges that have arisen with Web 2.0 development. This metamodel supports two main perspectives: 1) the definition of the UI as a combination of widgets from a selected RIA technology; and 2) the specification of the UI interaction as a consequence of the events produced by the user. In order to illustrate how this RIA Metamodel can be used in a Model-driven Engineering (MDE) method, this …", "num_citations": "40\n", "authors": ["613"]}
{"title": "Applying interaction patterns: Towards a model-driven approach for rich internet applications development\n", "abstract": " Recently, a wide array of Web Applications has evolved to Rich Internet Applications (RIAs). This new application paradigm emphasizes the use of client-side technologies in order to provide more responsive and interactive Web Interfaces. The main contribution of this work is an Interaction Model to specify the new semantics to deal with the Model-Driven RIA development. This model is made up of Interaction Patterns that describe, from a conceptual point of view, a generic solution for a common user-system interaction. Following the HCI principles, this model has two views: 1) an Abstract view made up of Abstract Interaction Patterns that describe the interaction without taking into account technological details and, 2) a Concrete view made up of RIA Interaction Patterns which specify the new interaction and interface requirements. Applying this Interaction Model within a Model-Driven software process, a functional RIA can be obtained. Finally, to illustrate this approach, two RIA Interaction Patterns are described.", "num_citations": "28\n", "authors": ["613"]}
{"title": "Improving automatic UML2 profile generation for MDA industrial development\n", "abstract": " In the context of MDA-oriented solutions, a modeling language with a precise semantics is a mandatory requirement. Even though MDA encourages the use of UML, there are several MDA approaches that define their own Domain Specific Modeling Languages (DSML) in order to obtain the needed semantic precision. However, the high acceptance of UML in the software industry has led different MDA-approaches to integrate their DSMLs semantics into UML by means of UML profiles. Certain approaches provide alternatives to elaborate a UML profile from the DSML metamodel, but generally speaking, the resultant profile does not include all the semantic expressiveness of the original DSML. This paper provides a solution that is focused on the MDA industrial development. This solution is based on a systematic approach to generate a DSML metamodel that is used to automatically obtain a UML profile …", "num_citations": "24\n", "authors": ["613"]}
{"title": "Using profiles to support model transformations in the model-driven development of user interfaces\n", "abstract": " The model-driven User Interface (UI) development life cycle usually evolves from high-level models, which represent abstract UI concepts, to concrete models, which are more related to the UI implementation details, until the final UI is generated. This process is based on a set of model-to-model and model-to-code transformations. Several industrial tools have applied this approach in order to generate the UI. However, these model transformations are mainly fixed and are not always the best solution for a specific UI. In this work, the notion of Transformation Profile is introduced to better specify the model-to-model transformations. A Transformation Profile is made up of a set of predefined Model Mappings and a Transformation Template. The mappings connect initial and target UI models in a flexible way, whereas the Transformation Template gathers high-level parameters to apply to the transformation. As a …", "num_citations": "22\n", "authors": ["613"]}
{"title": "Data quality problems when integrating genomic information\n", "abstract": " Due to the complexity of genomic information and the broad amount of data produced every day, the genomic information accessible on the web has become very difficult to integrate, which hinders the research process. Using the knowledge from the Data Quality field and after a specific study of a set of genomic databases we have found problems related to six Data Quality dimensions. The aim of this paper is to highlight the problems that bioinformaticians have to face when they integrate information from different genomic databases. The contribution of this paper is to identify and characterize those problems in order to understand which ones hinder the research process, increasing the time-waste that this task means for researchers.", "num_citations": "18\n", "authors": ["613"]}
{"title": "Oows 2. 0: un método de ingeniería web dirigido por modelos para la producción de aplicaciones web 2. 0\n", "abstract": " Los métodos de Ingeniería Web dirigidos por modelos han mejorado tanto la calidad como la eficiencia, a la hora de desarrollar aplicaciones Web. Estos métodos utilizan modelos conceptuales para capturar, de manera abstracta, una representación detallada de la aplicación Web a desarrollar. La ventaja más destacada de esta aproximación es que a partir de estos modelos, ampliamente validados en entornos industriales, es factible la generación sistemática del código que implementa la aplicación Web.", "num_citations": "16\n", "authors": ["613"]}
{"title": "An Abstract Interaction Model for a MDA Software Production Method.\n", "abstract": " Currently, most well-known model-based software production methods focus on defining the system functionality (business logic and persistence). However, the interaction between users and the system is too often not accurately described. Frequently an interface must be generated for multiple technological platforms (Desktop, Web, Mobile devices etc.) from the same model. The key issue is the model that was designed for describing a specific platform interface. When this model is used in other platforms, the final user interfaces have usability problems due to a lack of expressiveness at conceptual level. An interesting approach is to solve this problem from a MDA point of view. Two abstraction levels are defined in order to model interaction: a PIM (Platform Independent Model) or abstract level to describe interaction without taking into account technological issues and a PSM (Platform Specific Model) or concrete level to deal with platform concrete requirements. This paper explains in detail how the PIM level is defined in order to produce multiplatform user interfaces. This Abstract Interaction Model is made up of two models: an User Model that defines different types of users and an Abstract Interface Model to define the user interface. The final goal is to introduce these new models into OO-Method, an MDA-based software production method to produce software systems. As a result, a user interface which can be used as a prototype is automatically generated.", "num_citations": "16\n", "authors": ["613"]}
{"title": "Involving end-users in the design of a domain-specific language for the genetic domain\n", "abstract": " The participation of end-users in software development ensures a better representation of their requirements in the resulting software product. With this aim, Domain-specific Languages (DSL) were proposed for abstracting the programming complexity of a domain and to provide an understandable tool for end-users. However, how end-users must be involved in the DSL development itself is also important, but it is not usually taken into account. As a solution, we propose a DSL development process for involving end-users; concretely, in this paper, we focus on their involvement during the design of the DSL syntax. For achieving this goal, we identify the decisions that developers must address to design the syntax, and we discuss how end-users can participate in those decisions. As a proof of concept, we apply the proposal to design the syntax of a DSL for genetic disease diagnosis software with the …", "num_citations": "14\n", "authors": ["613"]}
{"title": "Automating the interoperability of conceptual models in specific development domains\n", "abstract": " An increasing number of modeling approaches for representing concepts related to a wide variety of domains can be clearly observed in software engineering. In this context, the definition of sound interoperability mechanisms to reuse knowledge and share ideas among existing conceptual models, and also apply them into concrete development processes, is an important challenge to be faced. Thus, different modeling approaches, tools, and standards can be integrated and coordinated to reduce the implementation and learning time of development processes as well as to improve the quality of the final software products. However, there is a lack of approaches to support automatic interoperability among modeling approaches. For tackling this situation, this chapter presents an interoperability approach focused on the characterization of different modeling approaches in a common software development …", "num_citations": "11\n", "authors": ["613"]}
{"title": "Interoperability for model-driven development: Current state and future challenges\n", "abstract": " Nowadays, the emergence of several model-driven development (MDD) proposals that are related to multiple domains requires the definition of proper interoperability mechanisms that facilitate the reuse of knowledge in the MDD community by taking advantage of already defined modeling languages, tools, and standards. However, there are no recent studies that cover the existent interoperability alternatives in the model-driven domain nor is there a common interoperability framework. This paper confronts this situation through a systematic analysis of recent interoperability approaches that provide relevant features for MDD processes. From this analysis, a general interoperability framework is depicted, which is complemented with our contributions to solve specific interoperability issues. Therefore, we present those aspects that are already covered by existent proposals as well as those pending subjects that …", "num_citations": "11\n", "authors": ["613"]}
{"title": "Dealing with abstract interaction modeling in an MDE development process: a pattern-based approach\n", "abstract": " Currently, in the Model-Driven Engineering (MDE) community, there is not any standard model to define the interaction between the user and the software system. However, the Human–Computer Interaction (HCI) community has been recently dealing with this issue. A widely accepted proposal is the specification of the interaction at two levels or views: an Abstract Level, in which the User Interface (UI) is defined without taking into account any technological details, and a Concrete Level, in which the previous abstract models are extended with the information related to the target technology. The purpose of this chapter is to introduce the Abstract Level into the OO-Method MDE development process. Specifically, this chapter is focused on how the abstract interaction can be modeled by means of Abstract Interaction Patterns (AIPs). These patterns define a generic solution for an interaction between a user and …", "num_citations": "9\n", "authors": ["613"]}
{"title": "Diagen: A model-based bioinformatic tool for genetic analysis\n", "abstract": " Geneticists that use software tools to carry out their diagnosis claim that current solutions do not fulfill completely their requirements. From an Information System perspective, this issue is a consequence of the lack of formal data descriptions, which has led to genetic repositories full of heterogeneous data and inconsistencies. Simultaneously, the same lack of formalization is perceived in software tools for genetic data analysis. As a solution, we provide a unified view that formalizes genetic concepts through the definition of a Conceptual Schema of the Human Genome (CSHG). In order to demonstrate the benefits of this approach, a Web application for genetic analysis, named Diagen, has been developed applying the aforementioned CSHG: Diagen is a model-based tool since each of its software components is a projection of the CSHG proposed.", "num_citations": "7\n", "authors": ["613"]}
{"title": "Capability design with CDD\n", "abstract": " One of the key tasks of the CDD methodology concerns designing capabilities starting from existing business requirements, enterprise models, and other kinds of organizational designs. As described in this chapter, the CDD methodology contains three complementary strategies for the design of capabilities: goal-first, process-first, and concept-first strategies. The view of the goal-first strategy is that capabilities exist as means to fulfill an organization’s long-term business objectives. The process-first strategy considers that capabilities are delivered through the execution of well-established business processes and therefore should be designed based on such processes. The concept-first strategy views stable information structures as the primary means for capability design. All three strategies for capability design shares four generic phases: scoping, identification, interlinking, and contextualizing and adapting …", "num_citations": "6\n", "authors": ["613"]}
{"title": "Conceptual schema of the human genome (CSHG)\n", "abstract": " ¿ Por qué es esencial el modelado conceptual (CM)[1] para diseñar y desarrollar sistemas de formación adecuados? Esta es una cuestión fundamental dentro de la comunidad de CM, la cual está interesada en demostrar que sólo mediante el uso de técnicas de CM se puede lograr el diseño y desarrollo de sistemas de información de calidad.Para ir un paso más adelante con respecto a esta cuestión, como objetivo principal de nuestro trabajo buscamos responder a esta pregunta de una manera convincente. La necesidad de una estrategia de diseño y desarrollo basado en CM debería ser más evidente mientras mayor sea la complejidad del sistema en estudio.", "num_citations": "6\n", "authors": ["613"]}
{"title": "Diagen: A model-driven framework for integrating bioinformatic tools\n", "abstract": " Nowadays, the diagnosis of disease based on genomic information is feasible by searching genetic variations on DNA sequences. However, geneticists struggle with bioinformatic tools that are supposed to simplify DNA sequence analysis. As a universal tool to support every requirement is far from be implemented, geneticists themselves must solve the data exchange among several tools. Due to the fact that there are no standards to support this integration task, it must be managed in every analysis. This paper addresses this integration by means of a model-driven framework. The Diagen framework is a software implementation based on conceptual modeling principles that formalizes data exchange and simplifies bioinformatic tool integration. First, we analyze how conceptual modeling can be used to deal with data exchange among tools. Then, the presented framework is used to search for variations on …", "num_citations": "6\n", "authors": ["613"]}
{"title": "OOWS 2.0: Un Método De Ingeniería Web Dirigido Por Modelos Para La Producción De Aplicaciones WEB 2.0\n", "abstract": " Los métodos de Ingeniería Web dirigidos por modelos han mejorado tanto la calidad como la eficiencia a la hora de desarrollar aplicaciones Web. Estos métodos utilizan modelos conceptuales para capturar de forma abstracta una representación detallada de la aplicación Web a desarrollar. La ventaja más destacada de esta aproximación es que a partir de estos modelos, ampliamente validados en entornos industriales, es factible la generación sistemática del código que implementa la aplicación Web. Las aplicaciones Web 2.0 destacan, fundamentalmente, en la alta implicación de los usuarios a la hora de crear sus contenidos, ya sean en forma de opiniones, fotos, definiciones o videos. Este hecho enfatiza el carácter colaborativo de las aplicaciones Web 2.0 y otorga al usuario un rol primordial en la aplicación. Para lograr la colaboración del usuario, es un requisito imprescindible que la aplicación proporcione una interacción precisa e intuitiva. Este objetivo se ha conseguido en las aplicaciones Web 2.0 mediante: 1) una interfaz de usuario tecnológicamente muy avanzada y con un elevado grado de usabilidad; y 2) la reutilización de un conjunto de buenas prácticas, ampliamente aplicadas en el dominio de la Web 2.0, que proporcionan al usuario una forma sencilla y conocida de interactuar con la aplicación. Con el objetivo de desarrollar aplicaciones Web 2.0 de calidad, ambos aspectos tienen que estar presentes en los métodos de Ingeniería Web. Esta tesis doctoral presenta el método de Ingeniería Web dirigido por modelos OOWS 2.0 como una evolución incremental y necesaria del método OOWS. El objetivo esencial de este …", "num_citations": "5\n", "authors": ["613"]}
{"title": "Facing the challenges of genome information systems: a variation analysis prototype\n", "abstract": " In Bioinformatics there is a lack of software tools that fit with the requirements demanded by biologists. For instance, when a DNA sample is sequenced, a lot of work have to be performed manually and several tools are used. The application of Information Systems (IS) principles into the development of bioinformatics tools opens a new interesting research path. One of the most promising approaches is the use of conceptual models in order to precisely define how genomic data is represented into an IS. This work introduces how to build a Genome Information System (GIS) using these principles. As a first step to achieve this goal, a conceptual model to formally describe genomic mutations is presented. In addition, as a proof of concept of this approach, a variation analysis prototype has been implemented using this conceptual model as a development core.", "num_citations": "5\n", "authors": ["613"]}
{"title": "Improvement of a web engineering method through usability patterns\n", "abstract": " Usability is a feature of software quality that has traditional significance in the Human Computer Interaction (HCI) community. Recent works that have been proposed by the Software Engineering (SE) community are intended to improve the usability of software applications. This paper combines aspects that are defined in both these communities to produce usable web applications. To achieve this goal, a well-known strategy to improve usability is used: usability patterns. However, many usability patterns and guidelines could only be applied when the final system is implemented. In this work, STATUS patterns have been chosen because they solve usability issues at conceptual level. The main purpose of this paper is to improve the usability of Web Applications automatically generated by OOWS (a model-based web engineering method) applying the STATUS patterns.", "num_citations": "5\n", "authors": ["613"]}
{"title": "How to deal with Haplotype data: An Extension to the Conceptual Schema of the Human Genome\n", "abstract": " The goal of this work is to describe the advantages of the application of Conceptual Modeling (CM) in complex domains, such as genomics. Nowadays, the study and comprehension of the human genome is a major challenge due to its high level of complexity. The constant evolution in the genomic domain contributes to the generation of ever larger amounts of new data, which means that if we do not manage it correctly data quality could be compromised (ie, problems related with heterogeneity and inconsistent data). In this paper, we propose the use of a Conceptual Schema of the Human Genome (CSHG), designed to understand and improve our ontological commitment to the domain and also extend (enrich) this schema with the integration of a novel concept: Haplotypes. Our focus is on improving the understanding of the relationship between genotype and phenotype, since new findings show that this question is more complex than was originally thought. Here we present the first steps in our data management approach with haplotypes (variations, frequencies and populations) and discuss the database evolution to support this data. Each new version in our conceptual schema (CS) introduces changes to the underlying database structure that has essential and practical implications for better understanding and managing the relevant information. A solution based on conceptual models gives a clear definition of the domain with direct implications in the medical field (Precision Medicine), in which Genomic Information Systems (GeIS) play a very important role.", "num_citations": "4\n", "authors": ["613"]}
{"title": "Involving End-users in Domain-Specific Languages Development-Experiences from a Bioinformatics SME\n", "abstract": " Involving end-users in software development is a goal envisioned by the Software Engineering community. As they have the domain knowledge, it is feasible to develop software applications that really fulfil their requirements. Domain-specific languages (DSL) are widely applied to accomplish this vision. However, end-users collaboration in DSL development is also important to ensure that their needs are well understood and represented. This research work proposes a DSL development process that combines methodological guidelines for DSL development with good practices from agile methods to encourage end-user involvement. In this paper, we overview the complete process and we focus on the two first stages: Decision and Analysis. In order to illustrate the proposal, it is applied in the development of a DSL for a bioinformatics SME that works on genetic disease diagnosis.", "num_citations": "4\n", "authors": ["613"]}
{"title": "Web 2.0 patterns: A model-driven engineering approach\n", "abstract": " Web Engineering methods, specifically Model-driven Engineering (MDE) ones, are not yet ready to cope with user involvement features that Web 2.0 is demanding. In this work, Web 2.0 patterns are introduced using conceptual models that represent both interaction and functionality, since in Web 2.0 applications both features are intertwined to support the user involvement concern. This work also drafts how Web 2.0 patterns can be integrated into models of a model-driven Web Engineering method.", "num_citations": "4\n", "authors": ["613"]}
{"title": "Applying Conceptual Modeling to Alignment Tools One Step towards the Automation of DNA Sequence Analysis.\n", "abstract": " Nowadays, the search of variations in DNA samples according to a reference sequence is performed using several bioinformatic tools. Due to the process complexity, none of these tools fulfill all the functionality required by biologists. For that reason, the definition of an integration process between these different tools becomes a mandatory requirement. One interesting issue is that bioinformatic tools do not comply with any standard format for expressing the output reports. As a consequence, the flow among tools must be manually solved. This paper proposes a conceptual model in order to formalize how the output from alignment tools must be produced. This work also provides a textual format based on this conceptual model. Thanks to both contributions, the integration is handled in the problem space and the related technological details are avoided. As a proof of concept of these ideas, the proposed format has been applied in a DNA sequence analysis process which uses two bioinformatic tools.", "num_citations": "3\n", "authors": ["613"]}
{"title": "Continuous validation of a modelling tool in an industrial setting\n", "abstract": " Capability as a Service for the Digital Enterprise (CaaS) is a European research project for developing a novel Enterprise modeling methodology. For supporting the industrial practice of that methodology, a modelling tool named Capability Design Tool (CDT) has been implemented. This paper summarizes the evaluation procedure carried on with industrial stakeholders from two IT companies to validate the tool acceptance and gather feedback for improvement.", "num_citations": "2\n", "authors": ["613"]}
{"title": "Supporting navigation accessibility requirements in web engineering methods\n", "abstract": " Web accessibility not only guarantees universal user access to the Web, but also provides interesting benefits for Web development. In order to achieve the goal of Web accessibility, an interesting approach is the incorporation of accessibility requirements into current Web engineering methods. This article presents the Accessibility for Web Applications (AWA) approach with the aim of integrating accessibility into Web engineering methods. The paper also discusses the application of the AWA approach to the Object-Oriented Web Solutions (OOWS) engineering method to produce accessible Web applications with a focus on navigational requirements. In order to demonstrate the practical applicability and usefulness of the approach, a proof of concept is described, the results of which indicating the satisfaction of navigation accessibility requirements. With the application of the AWA approach in the model-driven development (MDD) method, previously-defined OOWS models have been extended with the accessibility criteria, providing resources for the required changes in the process.", "num_citations": "2\n", "authors": ["613"]}
{"title": "Using Profiles to Support Model Transformations in Model-Driven User Interfaces Development\n", "abstract": " Using Profiles to Support Model Transformations in Model-Driven User Interfaces Development | DIAL.pr - BOREAL Skip to main content User menu Cart Login Home DIAL.pr - BOREAL Search form Search Home All Publications Export Help You are here Home» Using Profiles to Support Model Transformations in Model-Driven User Interfaces Development Accès à distance ? S'identifier sur le proxy UCLouvain | Saint-Louis Using Profiles to Support Model Transformations in Model-Driven User Interfaces Development Primary tabs view(active tab) attached files FNRS validity Aquino Salvioni, Nathalie Marylin [UCL] Vanderdonckt, Jean [UCL] Valverde, Francisco [Polytechnic University of Valencia] Pastor, Oscar [Polytechnic University of Valencia] metadata Document type Communication à un colloque (Conference Paper) – Présentation orale avec comité de sélection Publication date 2008 Language Anglais …", "num_citations": "2\n", "authors": ["613"]}
{"title": "DSL Development with Geneticists\n", "abstract": " This document is a proof of concept of the DSL development method proposed in the PhD of Maria Jose Villanueva, whose title is \"An agile model-driven method for involving end-users in DSL develoment\". This report explains in detail the artefacts created in the different stages of DSL development to develop a DSL for the genetic analysis domain.", "num_citations": "1\n", "authors": ["613"]}
{"title": "Assessing a Web Engineering Method in Practice: a Preliminary Analysis for Personal Genomics Portals.\n", "abstract": " Over fifteen years of academic research in Web Engineering resulted in sound engineering principles and full-fledged design methods for Web applications. Nevertheless, the community suffers a lack of industrial adoption and a lack of validation of the methods in realistically sized modern Web applications. This paper addresses this hiatus and presents an experience report on the application of OOWS 2.0, a state-of-the-art Web engineering method, on two real-life complex Web applications in the Personal Genomics field. Based on this analysis, we verify the technical completeness of the method, gather information about its use, identify shortcomings and present some improvements.", "num_citations": "1\n", "authors": ["613"]}