{"title": "Online communities and open innovation\n", "abstract": " How can firms make use of online communities as part of an innovation strategy aimed at leveraging resources and ideas outside the four walls of the enterprise? Online communities are today a widespread phenomenon that takes a variety of forms. Free and open source software is probably the most well-known case, where geographically dispersed individuals collectively develop new software and produce innovation. In 1991 Linus Torvalds founded the Linux kernel, the heart of an operating system with the ability to have a real impact on Microsoft’s market share. Torvalds’ initial ideas led to the building of a community that collectively developed the Linux kernel. From the original incorporation of some 10,000 lines of source code, by 2005 the community had developed more than 6,000,000 lines of code. But online communities are more than simply free and open source software. For instance, social …", "num_citations": "243\n", "authors": ["872"]}
{"title": "Skills, division of labor and performance in collective inventions: Evidence from open source software\n", "abstract": " This paper investigates the skills and the division of labor among participants in collective inventions. Our analysis draws on a large sample of projects registered at Sourceforge.net, the world's largest incubator of open source software activity. We test the hypothesis that skill variety of participants is associated with project performance. We also explore whether the level of modularization of project activities is correlated with performance. Our econometric estimations show that skill heterogeneity is associated with project survival and performance. However, the relationship between skill diversity and performance is non-monotonic. Design modularity is also positively associated with the performance of the project. Finally, the interaction between skill heterogeneity and modularity is negatively associated with performance.", "num_citations": "98\n", "authors": ["872"]}
{"title": "Explaining leadership in virtual teams: The case of open source software\n", "abstract": " This paper contributes to the open source software (OSS) literature by investigating the likelihood that a participant becomes a project leader. Project leaders are key actors in a virtual community and are crucial to the success of the OSS model. Knowledge of the forces that lead to the emergence of project managers among the multitude of participants is still limited. We aim to fill this gap in the literature by analyzing the association between the roles played by an individual who is registered with a project, and a set of individual-level and project-level characteristics. In line with the theory of occupational choice elaborated by (Lazear, E.P., 2002. Entrepreneurship. NBER Working Paper No. 9109, Cambridge, Mass; Lazear, E.P., 2004. Balanced skills and entrepreneurship, American Economic Review 94, pp. 208–211), we find that OSS project leaders possess diversified skill sets which are needed to select the inputs …", "num_citations": "98\n", "authors": ["872"]}
{"title": "The periphery on stage: The intra-organizational dynamics in online communities of creation\n", "abstract": " This paper theorizes the intra-organizational dynamics of online communities of creation such as Free and Open Source software projects. It describes the role of the participants at the peripheries of these online communities and analyze how the division of labor among peripheral and core members is handled. The paper further demonstrates that this mode of labor division is possible only if the periphery is able to acquire and absorb the standards associated with the developers’ activities, described here as a social practice. We describe how the propagation of such standards takes place through non-material artifacts such as code and virtual discussions. We show that because of the capacity of these artifacts to effectively disseminate the standards of a social practice, such standards can be transferred not only face to face, but also asynchronously, asymmetrically and openly.", "num_citations": "93\n", "authors": ["872"]}
{"title": "Dynamics of innovation in an “open source” collaboration environment: lurking, laboring, and launching FLOSS projects on SourceForge\n", "abstract": " A systems analysis perspective is adopted to examine the critical properties of the Free/Libre/Open Source Software (FLOSS) mode of innovation, as reflected on the SourceForge platform (SF.net). This approach re-scales March's  framework and applies it to characterize the “innovation system” of a “distributed organization” of interacting agents in a virtual collaboration environment, rather than to innovation within a firm. March  views the process of innovation at the organizational level as the coupling of sub-processes of exploration and exploitation. Correspondingly, the innovation system of the virtual collaboration environment represented by SF.net is an emergent property of two “coupled” processes: one involves the interactions among agents searching the locale for information and knowledge resources to use in designing novel software products (i.e., exploration), and the other involves the mobilization …", "num_citations": "82\n", "authors": ["872"]}
{"title": "Problem‐formulation and problem‐solving in self‐organized communities: How modes of communication shape project behaviors in the free open‐source software community\n", "abstract": " Research summary: Building on the problem‐solving perspective, we study behaviors related to projects and the communication‐based antecedents of such behaviors in the free open‐source software (FOSS) community. We examine two kinds of problem/project‐behaviors: Individuals can set up projects around the formulation of new problems or join existing projects and define and/or work on subproblems within an existing problem. The choice between these two behaviors is influenced by the mode of communication. A communication mode with little a priori structure is the best mode for communicating about new problems (i.e., formulating a problem); empirically, it is associated with project launching behaviors. In contrast, more structured communication fits subproblems better and is related to project joining behaviors. Our hypotheses derive support from data from the FOSS community. Managerial summary …", "num_citations": "68\n", "authors": ["872"]}
{"title": "Bio-ecological diversity vs. socio-economic diversity: A comparison of existing measures\n", "abstract": " This paper aims to enrich the standard toolbox for measuring diversity in economics. In so doing, we compare the indicators of diversity used by economists with those used by biologists and ecologists. Ecologists and biologists are concerned about biodiversity: the diversity of organisms that inhabit a given area. Concepts of species diversity such as alpha (diversity within community), beta (diversity across communities) and gamma (diversity due to differences among samples when they are combined into a single sample) have been developed (Whittaker, 1960). Biodiversity is more complex than just the species that are present, it includes species richness and species evenness. Those various aspects of diversity are measured by biodiversity indices such as Simpson's Diversity Indices, Species Richness Index, Shannon Weaver Diversity Indices, Patil and Taillie Index, Modified Hill's Ratio. In economics, diversity measures are multi-faceted ranging from inequality (Lorenz curve, Gini coefficient, quintile distribution), to polarisation (Esteban and Ray, 1994; Wolfon, 1994, D'Ambrosio (2001)) and heterogeneity (Alesina, Baqir and Hoxby, 2000). We propose an interdisciplinary comparison between indicators. We review their theoretical background and applications. We provide an assessment of their possible use according to their specific properties.", "num_citations": "65\n", "authors": ["872"]}
{"title": "Inequality and marginalisation: social innovation, social entrepreneurship and business model innovation: The common thread of the DRUID Summer Conference 2015\n", "abstract": " Nowadays societies face many societal challenges, among which increasing inequality and marginalisation. This paper uses this key to read the discussion undertaken during the DRUID Conference 2015 ‘Relevance of Innovation’, held at LUISS Business School (Rome, IT). We focus on the speeches, sessions, and debates that were hosted at the conference. We expand them and build on them to advance scholarly discussion on how social innovation, social entrepreneurship and business model innovation can be used to face inequality and marginalisation. The main idea we place at the centre of the discussion is empowerment of marginalised individuals by social innovation initiatives and social entrepreneurial ventures. Business model innovation is seen as instrumental to this, being a crucial tool to foster hybrid organisations and institutions able to merge the social and economic dimensions.", "num_citations": "46\n", "authors": ["872"]}
{"title": "Crowdfunding as' Donations': Theory & Evidence\n", "abstract": " For a wide class of crowdfunding approaches, we argue that the reward structure (for funders) is closer to that of charitable donations to public goods than it is to traditional entrepreneurial finance. Many features of the design of crowdfunding platforms can therefore be understood as attempts to deal with attendant “free-rider” problems in motivating contributions. Reviewing institutional features of today’s crowdfunding, we clarify that there are often limits in the extent to which tangible rewards can be used to motivate contributions. Drawing on analogies with charitable donations, we theorize that intangible sources of motivation—(i) direct psychological rewards,(ii) reciprocity and (iii) social interactions—can play a role in entrepreneurial crowdfunding. In our detailed empirical analysis of a representative project we find abundant evidence consistent with this characterization and we proceed to discuss implications for platform design and entrepreneurial funding and unique and defining characteristics of crowdfunding.", "num_citations": "44\n", "authors": ["872"]}
{"title": "The bright side of hybridity: Exploring how social enterprises manage and leverage their hybrid nature\n", "abstract": " Over the last 15 years, social enterprises have acquired growing centrality in the academic debate about the role of business in society because of their recognized capacity to address deep-seated societal problems such as unemployment, poverty, and environmental damage (Smith et al. 2013).The Journal of Business Ethics has been at the forefront of this debate with its 2012 special issue “Social Entrepreneurship in Theory and Practice”(Pless 2012), which proposed a very pragmatic perspective focusing on the most practical constituencies of social entrepreneurship. Building on this ground, in 2016 a second special issue—“Social Entrepreneurship and Business Ethics: Does Social Equal Ethical?”(Chell et al. 2016)—has opened a new, interesting research route focused more specifically on the ethical challenges faced by social enterprises (André and Pache 2016; Chell et al. 2016) and social entrepreneurs …", "num_citations": "38\n", "authors": ["872"]}
{"title": "Dragging developers towards the core. How the Free/Libre/Open Source Software community enhances developers’ contribution\n", "abstract": " The paper presents a dynamic perspective on the landscape of Free/Libre/Open Source Software (FLOSS) developers' motivations and tries to isolate mechanisms sustaining developers' contribution over time. The first part of the paper uses data gathered by the empirical studies relative to the FLOSS case to judge the relative importance of each group of incentives detected by the literature. In the second part of the paper, the same data are used to further characterize developers' motivations in dynamics terms. In particular, the study shows that the relative importance of different incentives do change over time. Drawing inspiration from the literature aimed at explaining these changes, the third part of the paper identifies a specific mechanism fostering developers' contribution to the community activities, namely that: Independently of developers' exogenous preferences, the more their exposure to the FLOSS community social environment, the more their contribution to the community activities. The key point of this hypothesis is that, if the exposure to the FLOSS community social environment is able to foster developers' contribution beyond the level granted by their predetermined preferences, this leads directly to the evidence that the FLOSS community is provided with a mechanism sustaining and enhancing developers' incentives to produce and diffuse code. In the last part of the paper, data relative to 14,497 developers working on SourceForge.net during two years (2001-2002) are employed to estimate a model testing the aforementioned hypothesis. Endogeneity problems are explicitly accounted for, and robustness checks are performed in …", "num_citations": "38\n", "authors": ["872"]}
{"title": "Health-related coping and social interaction in people with multiple sclerosis supported by a social network: pilot study with a new methodological approach\n", "abstract": " Background: Social media are a vital link for people with health concerns who find in Web communities a valid and comforting source for information exchange, debate, and knowledge enrichment. This aspect is important for people affected by chronic diseases like multiple sclerosis (MS), who are very well informed about the disease but are vulnerable to hopes of being cured or saved by therapies whose efficacy is not always scientifically proven. To improve health-related coping and social interaction for people with MS, we created an MS social network (SMsocialnetwork. com) with a medical team constantly online to intervene promptly when false or inappropriate medical information are shared.Objective: The goal of this study was to assess the impact of SMsocialnetwork. com on the health-related coping and social interaction of people with MS by analyzing areas of interest through a Web-based survey.Methods: Referring to previous marketing studies analyzing the online platform’s role in targeted health care, we conducted a 39-item Web-based survey. We then performed a construct validation procedure using a factorial analysis, gathering together like items of the survey related to different areas of interest such as utility, proximity, sharing, interaction, solving uncertainty, suggestion attitude, and exploration.Results: We collected 130 Web-based surveys. The areas of interest analysis demonstrated that the users positively evaluated SMsocialnetwork. com to obtain information, approach and solve problems, and to make decisions (utility: median 4.2); improve feeling of closeness (proximity: median 5); catalyze relationships and text …", "num_citations": "36\n", "authors": ["872"]}
{"title": "Hybridisation of diverging institutional logics through common-note practices–an analogy with music and the case of social enterprises\n", "abstract": " Hybrid organisations exhibit high degree of innovativeness, but also instability due to the conflicting institutional logics underpinning their activities. We enrich the discussion on how to reconcile conflicting logics in hybrid organisations using the analogy with music theory. In particular, we get inspiration from a technique used to modulate conflicting harmonies by means of the notes they have in common (common-notes) to derive ideas on how to compose conflicting logics by means of the practices they have in common. We illustrate these ideas in the specific case of social enterprises, showing that practices able to ‘unblock’ a marginalised individual’s value creation capabilities can be considered common-note practices allowing the social enterprise to fruitfully and sustainably combine commercial and social welfare logics.", "num_citations": "33\n", "authors": ["872"]}
{"title": "Made in carcere: Integral human development in extreme conditions\n", "abstract": " This paper analyzes the case of Made in Carcere, an innovative social enterprise providing jobs to one of the most marginalized groups in society: convicted women. Relying on an extensive database that covers 8 years of activity, we propose a micro-level analysis of the processes adopted by Made in Carcere to foster the integral human development of convicted women, its target stakeholders. We show that this complex effort has successfully unfolded through two macro-processes: creating a safe space for experimentation and allowing convicted women to bridge their experience to the outside reality. Our work provides evidence of an organization that successfully confronts the restrictive and dehumanizing setting of prisons by means of market mechanisms that can foster convicted women’s integral human development.", "num_citations": "19\n", "authors": ["872"]}
{"title": "Curious exceptions? Open source software and” open” technology\n", "abstract": " The aim of this chapter is to explore the differences and commonalities between open source software and other cases of open technology. The concept of open technology is used here to indicate various models of innovation based on the participation of a wide range of different actors who freely share the innovations they have produced. The chapter begins with a review of the problems connected to the production of public goods and explains why open source software seems to be a “curious exception” for traditional economic reasoning. Then it describes the successful operation of similar models of innovation (open technology) in other technological fields. The third section investigates the literature in relation to three fundamental issues in the current open source research agenda, namely, developers’ motivations, performance, and sustainability of the model. Finally, the fourth section provides a final …", "num_citations": "17\n", "authors": ["872"]}
{"title": "Toward a new industrial organization? OSS in economic and managerial perspective\n", "abstract": " At present, an more and more users are running Open Source software (OSS) on their systems. Major companies, like IBM, Oracle, or Sun Microsystems, have now started to make significant investments in developing open communities and creating a portfolio of systems incorporating OSS applications into their design. Meanwhile, an increasing number of firms are entering the market by offering OSS-based solutions to their customers, often supplying a mix of proprietary and open solutions through hybrid business models. In this context, economists and management scientists are now moving beyond the state of puzzlement that has driven much of the initial attention towards OSS. Located in the context of OSS2007 in order to foster close and fruitful interactions with scholars from various other disciplines, this workshop aims at contributing to the current evolutions of the economic and managerial research …", "num_citations": "16\n", "authors": ["872"]}
{"title": "The micro-dynamics of open source software development activity\n", "abstract": " This study aims to isolate and identify the properties of FLOSS development insofar as these can be revealed by examining the ecology of SF.net. It characterizes the contrast between the many “lurkers” and a much smaller core of “entrepreneurial” developers who are responsible for launching new projects, and gives an interpretation of the function of platforms such as SF.net as sites that people with a propensity to start open source projects can use to recruit “laborers”. It describes the process underpinning the mobility of those who are recruited among the projects that are launched and provides insights on the evolution of developers’ level and mode of involvement in FLOSS production.", "num_citations": "15\n", "authors": ["872"]}
{"title": "Rendere sociali le imprese. Impatto sociale, confini dell’impresa e rete di stakeholder\n", "abstract": " E’possibile ampliare il concetto di impresa sociale fino a comprendere imprese for profit posizionate fuori dai confini fissati dalla definizione ex lege? La risposta a questa domanda necessita di un cambio di punti di vista: la gestione dell’eventuale surplus non può più essere una discriminante di ciò che viene inteso come impresa sociale. E’necessario muovere l’attenzione verso i processi che invece permettono di realizzare l’impatto sociale a prescindere da ciò che accade dal lato degli eventuali profitti. Fatto ciò, è quindi importante capire quale determinante di questi processi può essere posta alla base della creazione di impatto sociale anche in presenza di soggetti che perseguano fini for profit. In particolare, l’impresa for profit dovrà essere vista nel contesto del più ampio network di stakeholder che deve essere mobilitato per raggiungere i fini sociali. La mobilitazione degli stakeholder ha il ruolo fondamentale di “far quadrare il cerchio”, cioè di permettere ad attori for profit di raggiugere fini sociali, e di poter quindi essere assimilati concettualmente all’idea di imprese sociali. Questo tuttavia non può avvenire lasciando invariate le organizzazioni che decidono di intraprendere questa strada (non ancora riconosciuta, e forse difficilmente catturabile, dalla legge). Appare evidente, infatti, come la mobilitazione degli stakeholder a fini sociali influenzi profondamente i confini dell’impresa: quando gli attori operano sulla base di valori condivisi finalizzati a raggiungere un certo impatto sociale, le imprese parte del network devono optare per comportamenti trasparenti, rendendo ulteriormente permeabili i propri confini. Per rendere evidente questo …", "num_citations": "14\n", "authors": ["872"]}
{"title": "The Debate and the Community.“Reflexive Identity” in the FLOSS Community\n", "abstract": " In order to simply communicate members of the Free/Open/Source Software community (FLOSS) have to negotiate the system of meanings they use to interface with the world and with the communitarian environment. But this means reshaping also their own visions of the world, redefining their identities. Community aims, principles and ethos act directly on members' identities, making them internalize the communitarian structure of rules. The first contribution of this paper is then showing how the concept of reflexivity developed by Giddens can link Wenger's idea of community of practice to developers' incentives. The result is that it is possible to find a mechanism, the reflexive identify process, acting as an antidote to free-riding and thus sustaining the cooperative production of FLOSS. However, the same mechanism shows that the community can be defined as an unstable (i.e. subject to revolutions) and dissipative (i.e. burning much more resources than the ones actually producing the outcome) object. On the theoretical side, the same mechanism asks for a wider conceptualization of practices. Using Habermas concept of 'practical interest' and 'communicative action' it is shown that the interaction between developers distributes among the different layers constituting the community debate, and that each one of these layers, not only practices, has a crucial role in defining developers' identities and thus their motivations.", "num_citations": "14\n", "authors": ["872"]}
{"title": "Bio-Ecological Diversity vs. Socio-Economic Diversity: A Comparison of Existing Measures\n", "abstract": " The purpose of the paper is to enrich the standard toolbox for measuring diversity in economics. In so doing, we compare the indicators of diversity used by economists with those used by biologists and ecologists.", "num_citations": "12\n", "authors": ["872"]}
{"title": "Endogenous growth of open collaborative innovation communities: a supply-side perspective\n", "abstract": " This article analyzes the conditions under which open collaborative innovation communities can be generated and are able to grow and prosper in the long run. We build a formal model of the interaction between such communities and the alternative institutional setting based on intellectual property rights that we call Technology. The model accounts for both the communitarian social process taking place inside the community and for the presence of spillovers both across and within each institution. We prove that communities grow endogenously above a certain size threshold, and that such growth depends on supply-side mechanisms centered on the developers’ social motivations and interactions. In a comparative statics analysis, we show that the community’s innovative performance rests not only on its own characteristics (strength of social motivations and/or of protection of the community-produced …", "num_citations": "8\n", "authors": ["872"]}
{"title": "Da dove nasce l’innovazione sociale? La comunità degli innovatori sociali nel network Ashoka: evidenze empiriche tra regioni e settori\n", "abstract": " Due progetti vicini, entrambi incentrati sul grano; due approcci differenti, il cui denominatore comune è l’innovazione delle modalità relazionali ed organizzative per garantire sostenibilità economica, sociale, ambientale. Entrambi testimoniano come un business model alternativo possa modificare il contesto economico e sociale, stravolgendo le dinamiche di domanda e offerta dei mercati convenzionali e generando valore per la comunità. Il Patto della Farina e il progetto di San Marco sono esemplificazioni pratiche della multifunzionalità dell’agricoltura. Accanto alla produzione di cibo e fibre, infatti, all’attività agricola sono attribuite tre funzioni complementari e generatrici di esternalità positive (Van Huylenbroeck et al., 2007): la funzione ambientale, in riferimento alla tutela del paesaggio, del territorio e della biodiversità; la funzione economica, vale a dire il sostegno generale che l’agricoltura offre agli altri settori, anche nelle economie più industrializzate; la funzione sociale, espletata nella tutela delle comunità rurali, del patrimonio culturale locale e dell’insieme di conoscenze ed informazioni sul territorio e sull’attività agricola stessa. Il concetto di multifunzionalità si sposa con l’accezione di seconda rivoluzione verde usata in questo studio. A tale principio fanno riferimento, ad esempio, gli accordi e le attività in materia agricola dell’Organizzazione Mondiale del Commercio e dell’Organizzazione per la Cooperazione e lo Sviluppo Economico; esso costituisce inoltre uno dei pilastri della Politica Agricola Comune dell’Unione Europea e dei Paesi membri, nell’ottica di realizzare una strategia agricola competitiva, sostenibile e responsabile.", "num_citations": "8\n", "authors": ["872"]}
{"title": "Reti strategiche come evoluzione delle reti emergenti. L’esperienza di due contratti di rete nel bresciano (Strategic networks as an evolution of emerging networks. The …\n", "abstract": " Obiettivo del paper: L’impresa italiana è chiamata a governare il proprio riposizionamento competitivo. Le aggregazioni reticolari tipiche dei nostri territori, come i distretti industriali o le filiere di subfornitura, non sono più sufficienti a generare questo riposizionamento, poiché sono aggregazioni emergenti, non progettate strategicamente per raggiungere un obiettivo. Nell’articolo viene presentato un percorso evolutivo, empiricamente rappresentato da due casi studio, che porta alla definizione del concetto di rete strategica, vale a dire coscientemente disegnata per riposizionare le imprese che ne fanno parte in un segmento a più alto valore aggiunto della catena del valore.Metodologia: Questo lavoro analizza il contratto di rete come fenomeno empirico che cattura il concetto teorico di rete strategica, approfondendo il caso di due contratti di rete stipulati nella provincia di Brescia.Risultati: Le reti strategiche analizzate tramite i due contratti di rete oggetti di analisi hanno permesso di capire come vi siano diverse strategie volte a mettere a valore la diversità delle compagini di imprese retiste, come questa diversità possa sollevare dei rischi, e come questi rischi possano essere affrontati con opportune scelte di governance. Limiti della ricerca: L’analisi si concentra su due casi emblematici. Sicuramente, l’ampliamento dell’analisi a reti presenti in territori diversi porterebbe ad una estensione ed arricchimento delle tematiche affrontate nell’articolo.", "num_citations": "6\n", "authors": ["872"]}
{"title": "User innovation in creative industries\n", "abstract": " This chapter integrates different perspectives on user communities to show how professionals and firms in creative industries can create fruitful business models and produce value from users’ creative potential, competences, and knowledge. In the last 20 years management research has documented and analysed the changing nature of innovation. The traditional idea according to which innovation processes—that is the creation of novel knowledge and solutions—are undertaken within the boundaries of the firm has been challenged by the increasingly informal nature of innovation activities and the wider dispersion of the sources of innovation. Innovation studies have documented that in a variety of industries, from software to sporting equipment and others, many sources of novel knowledge are found outside of the firms’ boundaries (Chesbrough, 2003; Laursen and Salter, 2004, 2006; Dahlander and Gann, 2010; Baldwin and Von Hippel, 2009). Individuals external to firms—eg users, experts, and hobbyists—are often involved in the improvement and modification of existing products on the basis of their passion and interest, even when no monetary compensation is provided (Jeppesen and Frederiksen, 2006; Jeppesen and Molin, 2003; Ghosh et al., 2002; David et al., 2003).The investigation of distributed innovation processes has revealed that individuals invest their time and attention mainly in the context of communities emerging from their shared interests (David and Foray, 2003). We witness communities of software developers, fashion connoisseurs, brand enthusiasts, and the like. These communities represent a fascinating and …", "num_citations": "6\n", "authors": ["872"]}
{"title": "MNC strategies to limit spillovers: How subsidiaries manage knowledge breadth to decrease spillovers\n", "abstract": " The aim of this paper is to investigate the factors influencing the speed at which knowledge flows from foreign to domestic firms. The focus is not on whether a knowledge spillover occurs, but on the time an MNC subsidiary’s knowledge takes to spread in the surroundings. Filling the gap in the literature regarding spillover speed in International Business by means of the insights from Innovation Studies, with particular reference to the literature on search, we propose a conceptual model where the speed of local knowledge diffusion is influenced by the technology sourcing strategies of subsidiaries. We then test our model using a database covering 1394 US patents from foreign MNC subsidiaries in the semiconductors sector. We find that not only does the breadth of the set of subsidiary knowledge sources slow down local knowledge diffusion, but the delay is mainly related to the diversity of global and internal …", "num_citations": "4\n", "authors": ["872"]}
{"title": "A test of Lazear’s theory of entrepreneurship in the open source software virtual community\n", "abstract": " This paper studies the emergence of entrepreneurs and their skill profile in the open source software (OSS) community. We test the hypothesis that entrepreneurs, carrying out complex, multitask activities, have more balanced skill sets compared with individuals who are less involved in project management activities.Our empirical analysis employs the SourceForge dataset containing information on 77,039 individuals working in 54,229 OSS projects. We estimate logit and ordered logit models to explore the likelihood that an individual is a project founder or manager. Our main regressors include individual attributes like skill level and diversity, and project-level controls. Results support our hypothesis.", "num_citations": "4\n", "authors": ["872"]}
{"title": "Creating Value in Nonprofit-Business Collaborations: New Thinking and Practice, by James E. Austin and M. May Seitanidi. San Francisco: John Wiley and Sons, 2014. 320 pp. ISBN …\n", "abstract": " //static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS1052150X16000634/resource/name/firstPage-S1052150X16000634a.jpg", "num_citations": "3\n", "authors": ["872"]}
{"title": "Employment and skill configurations in KIBS sectors: a longitudinal analysis\n", "abstract": " Knowledge-Intensive Business Services (KIBS) are specialized suppliers of intermediate inputs with expertise in locating, developing, combining, and applying generic knowledge to specific needs. The sectors in which these firms operate have experienced extraordinary growth over the last two decades both in terms of employment share and of value added, and are often referred to as key hubs within the modern knowledge-based society. This chapter offers a review of scholarly perspectives on the growth trajectory of KIBS, and elaborates an empirical analysis to explore in detail commonalities and differences across this diverse group of sectors.", "num_citations": "3\n", "authors": ["872"]}
{"title": "The Meso-level structure of F/OSS collaboration network: local communities and their innovativeness\n", "abstract": " Social networks in Free/Open Source Software (F/OSS) have been usually analyzed at the level of the single project e.g., [6], or at the level of a whole ecology of projects, e.g., [33]. In this paper, we also investigate the social network generated by developers who collaborate to one or multiple F/OSS projects, but we focus on the less-studied meso-level structure emerging when applying to this network a community-detection technique. The network of ‘communities’ emerging from this analysis links sub-groups of densely connected developers, sub-groups that are smaller than the components of the network but larger than the teams working on single projects. Our results reveal the complexity of this meso-level structure, where several dense sub-groups of developers are connected by sparse collaboration among different sub-groups. We discuss the theoretical implications of our findings with reference to …", "num_citations": "3\n", "authors": ["872"]}
{"title": "Curious Exceptions?\n", "abstract": " The aim of this chapter is to explore the differences and commonalities between open source software and other cases of open technology. The concept of open technology is used here to indicate various models of innovation based on the participation of a wide range of different actors who freely share the innovations they have produced. The chapter begins with a review of the problems connected to the production of public goods and explains why open source software seems to be a “curious exception” for traditional economic reasoning. Then it describes the successful operation of similar models of innovation (open technology) in other technological fields. The third section investigates the literature in relation to three fundamental issues in the current open source research agenda, namely, developers’ motivations, performance, and sustainability of the model. Finally, the fourth section provides a final comparison between open source software and the other cases of open technology.", "num_citations": "3\n", "authors": ["872"]}
{"title": "Industry 4.0 technological trajectories and traditional manufacturing regions: The role of knowledge workers\n", "abstract": " The technological trajectory of a region depends on the local repository of competences and knowledge, and their evolution over time. Using the case of a region with Marshallian features, we explore the Industry 4.0 potential for regional transformation showing how the employment ratios of synthetic and analytical knowledge workers of local firms evolve in relation to the adoption of a set of digital technologies. Results show that technological change in this type of region exhibits strong path dependence and goes hand in hand mainly with an increase in the employment ratio of synthetic knowledge workers.", "num_citations": "2\n", "authors": ["872"]}
{"title": "Crowdfunding as Donations to Entrepreneurial Firms\n", "abstract": " The bulk of today's (“preorder-,” “reward-,” “gift-,” and “donation-based”) crowdfunding raises funds for small, private entrepreneurial ventures without granting funders private claims to the projects’ income or the ability to guarantee the realization and delivery of project outcomes. We theorize and show empirically – via a mixed-method approach applied to a representative and remarkably informative case – that the payoff structure for crowdfunders, akin to a public good contribution problem, leads to the tangible value of main project outputs exerting little influence on contributions to crowdfunding. This then raises the question of which funder motivations fund seekers may have to address to crowdfund their projects. We demonstrate the especially large role of non-pecuniary motivations and pinpoint three particular motivations that profit-seeking entrepreneurs may stimulate to be financed through crowdfunding. The …", "num_citations": "2\n", "authors": ["872"]}
{"title": "How context and attention shape behaviors in online communities: a modified garbage can model\n", "abstract": " Online communities have emerged as important organizational forms, but there are many gaps in our understanding. In particular, researchers have mainly focused on individual-level drivers of behaviors in communities, while downplaying (formal, informal) context at various levels. We theorize that different dimensions of context (i.e. omnibus and discrete context) influence decision-making in online communities through mechanisms involving community members’ attention. Specifically, context influences which problems members perceive and which solutions they retrieve and apply, thereby shaping the process of matching solutions and problems. We derive four hypotheses about contribution behaviors in online communities and how such behaviors are influenced by context. The empirical setting for our study is the open-source software community. We find support for our hypotheses in a unique dataset that …", "num_citations": "2\n", "authors": ["872"]}
{"title": "The Digital Revolution and COVID-19\n", "abstract": " We develop a simple model of digital markets to analyze the impact of Covid-19 on the digital transformation of sectors. The lockdown due to Covid-19 is modeled as a shock that wipes out the physical market, temporarily leaving digital consumption as the only option. Under plausible assumptions on digital demand and supply, the model predicts that such temporary shock produces an irreversible rise of the digital markets. This happens for three distinct reasons. First, by temporarily eliminating the physical market, Covid-19 provides a strong incentive for firms to carry out the fixed investments necessary to venture into the digital market (supply channel). Secondly, by forcing even the most reluctant consumers into the digital market, Covid-19 pushes them to familiarize with digital platforms, and this confidence endures in the post-Covid era (demand channel). Finally, if consumers’ taste for digitalization is affected by the size of the digital market, a market may be entrapped into a low-digital equilibrium indefinitely. In such context, the lockdown due to the pandemic is the shock that may unleash the forces of digitalization and tilt the entire sector towards a high-digital equilibrium (network externalities channel).", "num_citations": "2\n", "authors": ["872"]}
{"title": "L’innovazione dei modelli di business nella sharing economy: il caso italiano del car sharing (The innovation of business models in the sharing economy: the Italian case of car …\n", "abstract": " Obiettivo del paper: studiare il fenomeno della sharing economy, ed in particolare il car sharing, proponendo una analisi dei principali modelli di business del settore. Metodologia: lo studio ha natura esplorativa e adotta un approccio di tipo qualitativo. In particolare, sono state condotte interviste semi strutturate all’interno di tre organizzazioni che operano nel settore del car sharing in Italia. Risultati: i risultati evidenziano le caratteristiche dei business model adottati dalle aziende; tali risultati sono utili, in particolare, per capire quali sono gli elementi di innovazione che sono stati introdotti nei modelli di business delle tre aziende attive nella sharing economy.Limiti della ricerca: data la natura qualitativa ed esplorativa dello studio, è difficile generalizzare i risultati ottenuti a tutte le istanze della sharing economy. Implicazioni pratiche: la ricerca fornisce utili informazioni a tutti gli operatori/manager della sharing economy per programmare strategie e politiche di innovazione dei loro modelli di business.Originalità del lavoro: il principale elemento di originalità del lavoro consiste nella proposta di un framework teorico ed interpretativo dei modelli di business nel settore della sharing economy e del car sharing in particolare.", "num_citations": "2\n", "authors": ["872"]}
{"title": "L’innovazione dei modelli di business nella sharing economy: il caso italiano del car sharing\n", "abstract": " Obiettivo del paper: studiare il fenomeno della sharing economy, ed in particolare il car sharing, proponendo una analisi dei principali modelli di business del settore. Metodologia: lo studio ha natura esplorativa e adotta un approccio di tipo qualitativo. In particolare, sono state condotte interviste semi strutturate all’interno di tre organizzazioni che operano nel settore del car sharing in Italia. Risultati: i risultati evidenziano le caratteristiche dei business model adottati dalle aziende; tali risultati sono utili, in particolare, per capire quali sono gli elementi di innovazione che sono stati introdotti nei modelli di business delle tre aziende attive nella sharing economy. Limiti della ricerca: data la natura qualitativa ed esplorativa dello studio, è difficile generalizzare i risultati ottenuti a tutte le istanze della sharing economy. Implicazioni pratiche: la ricerca fornisce utili informazioni a tutti gli operatori/manager della sharing economy per programmare strategie e politiche di innovazione dei loro modelli di business. Originalità del lavoro: il principale elemento di originalità del lavoro consiste nella proposta di un framework teorico ed interpretativo dei modelli di business nel settore della sharing economy e del car sharing in particolare.", "num_citations": "2\n", "authors": ["872"]}
{"title": "Designing shared spaces for firm‐community collaborations for innovation: Formal policies and coordination in open source projects\n", "abstract": " This paper adds to the growing debate on the design of the shared space between firms and communities in co‐innovation processes. We investigate specific organizational design initiatives that firms can take when collaborating with online communities to nurture their joint knowledge creation process and to realize a useful output. We contend that drafting a formal policy, leaving the coordination of the joint project to others and, in case of taking on the coordination duty, dedicating an employee's full time to realize the project administrator task can help increase the amount of useful output of such collaborations. Results based on a sample of 1,099 open source software projects hosted on the platform SourceForge.net support our hypotheses.", "num_citations": "1\n", "authors": ["872"]}
{"title": "Performance measurement and evaluation of R&D units in pharmaceutical companies\n", "abstract": " This thesis will analyse the way pharmaceutical companies evaluate and understand the performance of their Research and Development (R&D) Units. The decision to make a study on this subject sees its birth in difficulties R&D Units lead to in terms of performance analysis and data interpretation for managers. Evaluating an R&D Unit in pharmaceutical companies is extremely complex from the moment that the entire process required to develop a drug from its first phases (the molecular targeting) to the last ones (approval of the drug from the competent authority) lasts between fifteen and twenty years, requiring incredibly high amounts of investments without having any reassurance on the success of the project. The thesis is structured in three chapters.The first one describes the different performance measurement systems known and that might be adopted from the companies of any industry to make analysis and have a picture of their current situation by adapting these systems to their own necessities. It will then be explained what Key Performance Indicators are, their importance for the companies and the characteristics that these must have to be effective in a managerial analysis and from a generic explanation of the KPIs it will be depicted how they can be adapted and set to a Research and Development Unit of a pharmaceutical industry and the correct way to interpret them. Following, the second chapter goes more in detail with the pharmaceutical industry and its R&D Units. The objective of the chapter is to understand how the research and development process works and is structured, which are the main risks that a pharmaceutical …", "num_citations": "1\n", "authors": ["872"]}
{"title": "From CSR to hybrid organization: the development of benefit corporations and the role of CSR manager in Italy\n", "abstract": " Is CSR in need of an update? A new paradigm: hybrid organizations. Empirical investigation: analysis of the evolution of CSR and the figure of CSR manager in Italy.", "num_citations": "1\n", "authors": ["872"]}
{"title": "Innovazione simbolica e comunità di consumatori\n", "abstract": " L'articolo discute del ruolo dei consumatori e delle comunità di pratica nei processi di innovazione delle imprese, mettendo in evidenza le dinamiche sociali connesse alla produzione e scambio di conoscenza entro le comunità. Rispetto all'attenzione data da studi e ricerche all'innovazione tecnologica, viene approfondita l'innovazione di natura simbolica ei processi creativi sottostanti legati alla sfera comunitaria.[Testo dell'editore].The paper discusses about the role of consumers and communities of practices in firms' innovation processes, by emphasizing community-based social dynamics related to knowledge production and sharing. Despite the attention given by prior studies on technological innovation, the paper is oriented to explore symbolic innovation and creativity processes linked to communities.[Publisher's Text].", "num_citations": "1\n", "authors": ["872"]}
{"title": "Le reti d’impresa per aumentare la competitività. L’esperienza dei contratti di rete nel bresciano.\n", "abstract": " L’impresa italiana è chiamata a governare il proprio riposizionamento competitivo. Le aggregazioni reticolari tipiche dei nostri territori, come i distretti industriali o le filiere di subfornitura, non sono più sufficienti a generare questo riposizionamento, poiché sono aggregazioni emergenti, non progettate strategicamente per raggiungere un obiettivo. Nell’articolo viene presentato un percorso evolutivo, empiricamente rappresentato da due casi studio, che porta alla definizione del concetto di rete strategica, vale a dire coscientemente disegnata per riposizionare le imprese che ne fanno parte in un segmento a più alto valore aggiunto della catena del valore.", "num_citations": "1\n", "authors": ["872"]}
{"title": "Coordinating distributed innovation processes: The case of the automative and open source software industries\n", "abstract": " This paper casts light on the question how coordination of distributed innovation processes is achieved by comparing the automotive and open source software industries. These industries represent very different settings of distributed innovation, one a traditional industries that has opened up innovation, the other the extreme case of network innovation. They have not so far been object of a comparative study. We present a comparative literature review, and then draw on empirical research in the automotive and open source software industries to compare how coordination is achieved in each. We apply qualitative methods to the auto industry, where we draw from a 10-year case study of a major European auto firm. We apply quantitative methods to the open source software industry, where we do an econometric analysis of 5810 projects registered on SourceForge. We find a surprising similarity regarding how coordination is provided in both cases: the use of templates at early stages of the project, which foster coordination of joint search processes by distributed actors through acting on their representations of search trajectories and eliminating some of the potential trajectories.", "num_citations": "1\n", "authors": ["872"]}