{"title": "Industry practices and event logging: Assessment of a critical software development process\n", "abstract": " Practitioners widely recognize the importance of event logging for a variety of tasks, such as accounting, system measurements and troubleshooting. Nevertheless, in spite of the importance of the tasks based on the logs collected under real workload conditions, event logging lacks systematic design and implementation practices. The implementation of the logging mechanism strongly relies on the human expertise. This paper proposes a measurement study of event logging practices in a critical industrial domain. We assess a software development process at Selex ES, a leading Finmeccanica company in electronic and information solutions for critical systems. Our study combines source code analysis, inspection of around 2.3 millions log entries, and direct feedback from the development team to gain process-wide insights ranging from programming practices, logging objectives and issues impacting log analysis …", "num_citations": "64\n", "authors": ["1416"]}
{"title": "Emmon: A wsn system architecture for large scale and dense real-time embedded monitoring\n", "abstract": " Wireless sensor networks (WSNs) have attracted growing interest in the last decade as an infrastructure to support a diversity of ubiquitous computing and cyber-physical systems. However, most research work has focused on protocols or on specific applications. As a result, there remains a clear lack of effective, feasible and usable system architectures that address both functional and non-functional requirements in an integrated fashion. In this paper, we outline the EMMON system architecture for large-scale, dense, real-time embedded monitoring. EMMON provides a hierarchical communication architecture together with integrated middleware and command and control software. It has been designed to use standard commercially-available technologies, while maintaining as much flexibility as possible to meet specific applications requirements. The EMMON architecture has been validated through extensive …", "num_citations": "26\n", "authors": ["1416"]}
{"title": "Operating system support to detect application hangs\n", "abstract": " On-line failure detection is an essential means to control and assess the dependability of complex and critical software systems. In such context, effective detection strategies are required, in order to minimize the possibility of catastrophic consequences. This objective is however difficult to achieve in complex systems, especially due to the several sources of non-determinism (e.g., multi-threading and distributed interaction) which may lead to software hangs, i.e., the system is active but no longer capable of delivering its services. The paper proposes a detection approach to uncover application hangs. It exploits multiple indirect data gathered at the operating system level to monitor the system and to trigger alarms if the observed behavior deviates from the expected one. By means of fault injection experiments conducted on a research prototype, it is shown how the combination of several operating system monitors actually leads to an high quality of detection, at an acceptable overhead.", "num_citations": "14\n", "authors": ["1416"]}
{"title": "Exploiting SDN approach to tackle cloud computing security issues in the ATC scenario\n", "abstract": " Cloud Computing has been receiving great attention in the last few years due to the benefits it provides in terms of flexibility, scalability, virtualization and service provision. Nevertheless, many companies remain reluctant to such a cutting-edge technology due to the serious security issues affecting virtualized environments, especially in critical application scenarios where high safety and dependability levels are required. This work is aimed at discussing and presenting the main security threats for cloud computing infrastructures, as well as proposing a novel architecture in charge of reacting to security attacks in Infrastructure as a Service platforms. The basic idea is to migrate the attacked virtual appliance and to reconfigure the network by means of Software Defined Networking approach. The paper presents the architecture we have in mind and that will be deployed and validated against a real world …", "num_citations": "10\n", "authors": ["1416"]}
{"title": "The dark side of demmon: what is behind the scene in engineering large-scale wireless sensor networks\n", "abstract": " Most research work on WSNs has focused on protocols or on specific applications. There is a clear lack of easy/ready-to-use WSN technologies and tools for planning, implementing, testing and commissioning WSN systems in an integrated fashion. While there exists a plethora of papers about network planning and deployment methodologies, to the best of our knowledge none of them helps the designer to match coverage requirements with network performance evaluation. In this paper we aim at filling this gap by presenting an unified toolset, ie, a framework able to provide a global picture of the system, from the network deployment planning to system test and validation. This toolset has been designed to back up the EMMON WSN system architecture for large-scale, dense, real-time embedded monitoring. It includes network deployment planning, worst-case analysis and dimensioning, protocol simulation and …", "num_citations": "10\n", "authors": ["1416"]}
{"title": "OS-level hang detection in complex software systems\n", "abstract": " Many critical services are nowadays provided by large and complex software systems. However, the increasing complexity introduces several sources of non-determinism, which may lead to   hang failures  : the system appears to be running, but part of its services is perceived as unresponsive. Online monitoring is the only way to detect and to promptly react to such failures. However, when dealing with off-the-shelf-based systems, online detection can be tricky since instrumentation and log data collection may not be feasible in practice. In this paper, a detection framework to cope with software hangs is proposed. The framework enables the non-intrusive monitoring of complex systems, based on multiple sources of data gathered at the operating system (OS) level. Collected data are then combined to reveal hang failures. The framework is evaluated through a fault injection campaign on two complex systems from …", "num_citations": "10\n", "authors": ["1416"]}
{"title": "On the evaluation of vm provisioning time in cloud platforms for mission-critical infrastructures\n", "abstract": " Cloud Computing has risen a great interest over the last years as it represents an enabling technology for flexible and ubiquitous access over the network to a set of shared computing resources. This work comes from an industrial experience aiming at exploiting the cloud potential for virtualizing complex infrastructures such as an entire Air Traffic Center (ATC), a clear example of complex SoS (System of Systems). The use of virtualization is convenient because industry can leverage in-house test-beds to perform distributed testing campaigns in pre-operational phases or to design new automatic fail-over mechanisms for fully distributed systems. In order to realize such mitigation and recovery techniques in the ATC field, indeed, a cloud platform is required to guarantee a low VM provisioning time with the objective of minimizing the service disruption. In this perspective, after having introduced the principal concepts …", "num_citations": "9\n", "authors": ["1416"]}
{"title": "Practical experience and evaluation of continuous code static analysis with C++ test\n", "abstract": " The static code analysis tools are a fundamental instruments to validate the developed code. They allow detecting bugs (as memory leak, accessing arrays out of bounds, etc..), structural errors and preventing entire classes of errors. This work refers to the Parasoft's tool\" C++ test\". It helps developers prevent and eliminate defects using rules tuned to nd code patterns that lead to reliability, performance, and security problems. To be practical, the static analysis must be seamlessly in-tegrated into the team's work-ow. The\"continuous static analysis\"'allows executing automatically the analysis when the new code is released. In this way is possible to realize a further automation in the software development executing the tool during the night or weekend. The time saved to run the tool can be used to analyze and correct the bugs. When you deal with static analysis, it's important to under-line the problem of false positive. It …", "num_citations": "7\n", "authors": ["1416"]}
{"title": "Applying the SecRAM methodology in a cloud-based ATM environment\n", "abstract": " The SESAR ATM Security Risk Assessment Methodology (SecRAM) aims at providing a methodology to be applied by the SESAR Operational Focus Areas (OFAs). To give effectiveness to the evaluation of SecRAM, Air Traffic Management (ATM) operative scenarios are greatly required. In this paper we leverage a Cloud-based approach to build up a virtualized replica of a real Air Control Centre (ACC) in order to realize a vulnerability analysis and to find some possible points of attacks. Then we applied the SecRAM methodology on our test-bed and we built a real threat scenario for which a risk treatment is properly designed.", "num_citations": "6\n", "authors": ["1416"]}
{"title": "Event logging in an industrial development process: Practices and reengineering challenges\n", "abstract": " This paper discusses our preliminary analysis of event logging practices adopted in a large-scale industrial development process at Selex ES, a top-leading Finmeccanica company in electronic and information technologies for defense systems, aerospace, and land security. The analysis aims to support log reengineering activities that are currently conducted at SELEX ES. At time being, some of the issues described in the paper have been fixed by system developers. Analysis encompasses total around 50+ millions lines of log produced by an Air Traffic Control (ATC) system. Analysis reveals that event logging is not strictly regulated by company-wide practices, which results into heterogeneous logs across different development teams. We introduce our ongoing effort at developing an automatic support to browse collected logs along with a uniform logging policy supplementing the reengineering process.", "num_citations": "5\n", "authors": ["1416"]}
{"title": "Data distribution technologies in wide area systems: lessons learned from the SWIM-SUIT project experience\n", "abstract": " The Air Traffic Management (ATM) domain is moving from fragmented systems towards a single sky. SWIM is the world recognized technological programme aiming to support in-formation sharing and data exchange in the next generation ATM systems. A prototype of the SWIM architecture has been realized in the framework of the SWIM-SUIT project, which is the focus of this paper. It reports practical ex-perience gained by SELEX-SI 1, developers when coping with data distribution task over these systems, both from a methodological and technological perspective.", "num_citations": "5\n", "authors": ["1416"]}
{"title": "An OpenFlow-based architecture for IaaS security\n", "abstract": " Cloud Computing technology and its service model, Infrastructure as a Service, are emerging as the leading approaches to encourage the scalable and efficient utilization of resources and the convenient consumption of elastic services. Despite all the advantages that derive from the application of Cloud Computing IaaS model, when dealing with mission and safety critical infrastructures\" built in the cloud\", it is needed to be also aware of the security gaps and concerns. In this work we present our proposed architecture to tackle cloud security issues and we describe the first results of our experimental campaign.", "num_citations": "4\n", "authors": ["1416"]}
{"title": "WSRTesting: Hands-on solution to improve web services robustness testing\n", "abstract": " Web services are widely used as software components that must provide a robust interface to client applications. Robustness testing is an approach particularly suitable for detecting robustness issues in web services. In fact, several research works have been conducted in the past leading to the proposal of different robustness testing techniques for such environments. However, although of utmost importance, most techniques do not consider the needs of complex systems and services as the ones being developed by the software industry for business and safety critical scenarios. In this industrial practice paper we introduce an enhanced web services robustness testing approach that is being used at SESM Scarl. The proposed technique was built based on actual needs and has been applied in the context of an Air Traffic Control (ATC) application. Results show that companies can successfully use robustness …", "num_citations": "4\n", "authors": ["1416"]}
{"title": "A recovery-oriented approach for software fault diagnosis in complex critical systems\n", "abstract": " This paper proposes an approach to software faults diagnosis in complex fault tolerant systems, encompassing the phases of error detection, fault location, and system recovery. Errors are detected in the first phase, exploiting the operating system support. Faults are identified during the location phase, through a machine learning based approach. Then, the best recovery action is triggered once the fault is located. Feedback actions are also used during the location phase to improve detection quality over time. A real world application from the Air Traffic Control field has been used as case study for evaluating the proposed approach. Experimental results, achieved by means of fault injection, show that the diagnosis engine is able to diagnose faults with high accuracy and at a low overhead.", "num_citations": "3\n", "authors": ["1416"]}
{"title": "Automatic robustness assessment of dds-compliant middleware\n", "abstract": " The next generation of critical systems requires an efficient, scalable and robust data dissemination infrastructure. Middleware solutions compliant with the novel OMG standard, called Data Distribution Service (DDS), are being traditionally used for architecting large-scale systems, because they well meet the requirements of scalability, seamless decoupling and fault tolerance. Due to such features, industrial practitioners are enforcing the adoption of such middleware solutions also within the context of critical systems. However, these systems pose serious dependability requirements, which in turn demand DDS compliant products also to realize reliable data dissemination in different and heterogeneous contexts. Hence, assessing the supported reliability degree and proposing improvement strategies becomes crucial and requires a clear understanding of DDS compliant middleware failing behavior. This paper …", "num_citations": "3\n", "authors": ["1416"]}
{"title": "Emmon: A system architecture for large-scale, dense and real-time wsns\n", "abstract": " In spite of the significant amount of scientific work in Wireless Sensor Networks (WSNs), there is a clear lack of effective, feasible and usable WSN system architectures that address both functional and non-functional requirements in an integrated fashion. This poster abstract outlines the EMMON system architecture for large-scale, dense, real-time embedded monitoring. EMMON relies on a hierarchical network architecture together with integrated middleware and command&control mechanisms. It has been designed to use standard commercially– available technologies, while maintaining as much flexibility as possible to meet specific applications’ requirements. The EMMON WSN architecture has been validated through extensive simulation and experimental evaluation, including through a 300+ node test-bed, the largest WSN test-bed in Europe to date", "num_citations": "3\n", "authors": ["1416"]}
{"title": "Modeling and Analyzing the Dependability of Short Range Wireless Technologies via Field Failure Data Analysis.\n", "abstract": " Direct analysis of failures from the field of ap-plication is an effective practice to understand the actual dependability behavior of an operational system. However, despite its wide use over the last four decades on a large variety of systems, field data analysis has rarely been applied to wireless networks. Users accessing the Internet ubiquitously through these networks are increasing, and they expect the same dependability level they already experience on wired networks. But how can we analyze the dependability level of a wireless network? The article defines a novel combined approach to model and analyze the dependability of short range wireless technologies exploiting field data. Through the experience gained from extensive failure analysis of Bluetooth networks, the paper shows how field failure data can play a key role to fill the gap on understanding the dependability behavior of wireless networks.", "num_citations": "3\n", "authors": ["1416"]}
{"title": "Software Faults Diagnosis in Complex, OTS-based, Critical Systems\n", "abstract": " Hardware and software technologies are progressing fast, dramatically increasing the complexity of modern computer systems. Large scale and distributed infrastructures are being increasingly employed, even in the context of critical scenarios; programs are being developed according to modular software architectures, typically based on Off-The-Shelf (OTS) software items. These allow industries to be competitive by reducing the development costs and the time to market.Over the last decade, computers are enabling crucial human everyday activities, such as public economy, large scale critical infrastructures management (eg, for water and power supply plants and energy production), and air traffic control. Given the growing dependence on computers in these life-and cost-critical applications, dependability becomes an essential demand: a failure, indeed, can be catastrophic in terms of business or, even worse, human losses.", "num_citations": "2\n", "authors": ["1416"]}
{"title": "NAPOLI FUTURA: Novel Approaches for Protecting Critical Infrastructures from Cyber Attacks\n", "abstract": " This paper presents the main objectives and preliminary results of the NAPOLI FUTURA project, which aims to define novel approaches for protecting critical infrastructures from cyber attacks. The paper focuses on the architectural design of the NAPOLI FUTURA platform. The platform leverages cutting-edge big data analytics solutions to detect security attacks and to support live migration of services in the context of Critical Information Infrastructures (CIIs).", "num_citations": "1\n", "authors": ["1416"]}
{"title": "JFIT: An Automatic Tool for Assessing Robustness of DDS-Compliant Middleware\n", "abstract": " The use of publish/subscribe middleware within the context of critical systems has raised the issue of assessing the provided degree of reliability and fault tolerance. Literature is rich of frameworks for the performance evaluation of publish/subscribe services. However, it lacks efficient solutions for an effective robustness evaluation of these middleware. For this purpose, this paper proposes a tool to automatically evaluate the robustness of DDS-compliant solutions. In addition, experiments have been conducted on an actual implementation of the DDS standard, by means of injecting a set of invalid and/or exceptional inputs through its API and analyzing the observed behaviors. The tool has helped revealing two types of middleware misbehaviors, which according to the CRASH scale, were classified as Silent and Restart.", "num_citations": "1\n", "authors": ["1416"]}
{"title": "Monitoring Infrastructure for Diagnosing Complex Software\n", "abstract": " This work presents an overview of monitoring approaches to support the diagnosis of software faults and proposes a framework to reveal and diagnose the activation of faults in complex and Off-The Shelf (OTS) based software systems. The activation of a fault is detected by means of anomaly detection on data collected by OS-level monitors. Instead, the fault diagnosis is accomplished by means of a machine learning approach. The evaluation of the proposed framework is carried out using an industrial prototype from the Air Traffic Control  domain by means of software fault injection. Results show that the monitoring and diagnosis framework is able to reveal and diagnose faults with high recall and precision with low latency and low overhead.", "num_citations": "1\n", "authors": ["1416"]}