{"title": "The design and implementation of tripwire: A file system integrity checker\n", "abstract": " At the heart of most computer systems is a file system. The file system contains user data, executable programs, configuration and authorization information, and (usually) the base executable version of the operating system itself. The ability to monitor file systems for unauthorized or unexpected changes gives system administrators valuable data for protecting and maintaining their systems. However, in environments of many networked heterogeneous platforms with different policies and software, the task of monitoring changes becomes quite daunting.", "num_citations": "864\n", "authors": ["1932"]}
{"title": "Experiences with tripwire: Using integrity checkers for intrusion detection\n", "abstract": " Tripwire is an integrity checking program written for the UNIX environment. It gives system administra-tors the ability to monitor file systems for added, deleted, and modified files. Imended to aid intru-sion detection, Tripwire was officially released on November 2, 1992. It is being actively used at thou-sands of sites around the world. Published in vol-ume 26 of camp. sources. Wlix on the USENET and archived at numerous FIP sites around the world, Tripwire is widely available and widely distributed. It is recommended by various computer security response teams, including the CERT and CIAC.This paper begins by motivating the need for an in· tegrity checker by presenting a hypothetical situation any system administrator could face. An overview of Tripwire is then described, emphasizing the salient aspects ofTripwire configuration that supports its use at sites employing modem variants of the UNIX operating system …", "num_citations": "201\n", "authors": ["1932"]}
{"title": "The Phoenix Project: A Novel About IT, DevOps, and Helping Your Business Win\n", "abstract": " Bill is an IT manager at Parts Unlimited. It's Tuesday morning and on his drive into the office, Bill gets a call from the CEO. The company's new IT initiative, code named Phoenix Project, is critical to the future of Parts Unlimited, but the project is massively over budget and very late. The CEO wants Bill to report directly to him and fix the mess in ninety days or else Bill's entire department will be outsourced. With the help of a prospective board member and his mysterious philosophy of The Three Ways, Bill starts to see that IT work has more in common with manufacturing plant work than he ever imagined. With the clock ticking, Bill must organize work flow, streamline interdepartmental communications, and effectively serve the other business functions at Parts Unlimited. In a fast-paced and entertaining style, three luminaries of the DevOps movement deliver a story that anyone who works in IT will recognize. Readers will not only learn how to improve their own IT organizations, they'll never view IT the same way again.", "num_citations": "161\n", "authors": ["1932"]}
{"title": "Accelerate: The science of lean software and devops: Building and scaling high performing technology organizations\n", "abstract": " Winner of the Shingo Publication Award Accelerate your organization to win in the marketplace. How can we apply technology to drive business value? For years, we've been told that the performance of software delivery teams doesn't matter―that it can't provide a competitive advantage to our companies. Through four years of groundbreaking research to include data collected from the State of DevOps reports conducted with Puppet, Dr. Nicole Forsgren, Jez Humble, and Gene Kim set out to find a way to measure software delivery performance―and what drives it―using rigorous statistical methods. This book presents both the findings and the science behind that research, making the information accessible for readers to apply in their own organizations. Readers will discover how to measure the performance of their teams, and what capabilities they should invest in to drive higher performance. This book is ideal for management at every level.", "num_citations": "88\n", "authors": ["1932"]}
{"title": "Computing environment and apparatuses with integrity based fail over\n", "abstract": " Computing units of a computing environment are equipped with means to determine their respective integrity. Further, each computing unit is equipped, such that if its integrity is determined to have been compromised, the computing unit automatically takes itself out of service. In one embodiment, prior to the automatically removing itself from service, a degree of compromise is determined. If the degree of compromise is determined to be within an acceptable risk level, the compromised computing unit fails itself over to one or more other computing units in the computing environment.", "num_citations": "70\n", "authors": ["1932"]}
{"title": "Computing apparatus with automatic integrity reference generation and maintenance\n", "abstract": " An apparatus is equipped to automatically update one or more integrity references of a software entity, when the software entity is installed onto the apparatus. The apparatus is further equipped to periodically determine whether the integrity of the apparatus has been compromised based at least in part on the one or more integrity references of the software entity that are automatically updated during installation of the software entity.", "num_citations": "58\n", "authors": ["1932"]}
{"title": "The visible ops handbook: Starting ITIL in 4 practical steps\n", "abstract": " The IT Infrastructure Library (ITIL), created by the British government’s Office of Government Commerce to help with IT management, is a method for implementing standard processes and best practices into IT operations.(For more information about ITIL, see< http://www. itil. co. uk/about. htm>.) The Visible", "num_citations": "54\n", "authors": ["1932"]}
{"title": "Writing, supporting, and evaluating tripwire: A publically available security tool\n", "abstract": " Ab. stractTripwire is an integrity checking program written for the UNIX environment that gives system administrators the ability to monitor file systems for added, deleted, and modified files. First released in November of 1992, Tripwire has undergone several updates and is in current use at thousands of machines worldwide.This paper begins with a brief overview ofwhat Tripwire does and how it works. We discuss how certain implementation decisions affected the course of Tripwire development. We also present other applications that have been found for Tripwire. These unanticipated uses guided the demands of some users, and we describe how we addressed some of these demands without compromising the ability of Tripwire to serve as a useful security tool. We also discuss the process of releasing, and then supporting, a widely available and widely used tool across the Internet, and how meeting users' high …", "num_citations": "49\n", "authors": ["1932"]}
{"title": "Use of inference techniques to facilitate categorization of system change information\n", "abstract": " Methods, systems, and articles for receiving, by a monitor server, change data associated with a change captured on a target host, are described herein. In various embodiments, the target host may have provided the change data in response to detecting the change, and the change data may include one or more rules, settings, and/or parameters. Further, in some embodiments, the monitor server may analyze the change data in order to group the change data into clusters. Once the change data have been classified as clusters, a report may be generated providing classification or categorization and cluster information for the various changes. In various embodiments, the generating may comprise generating a report to the target host and/or to an administrative user.", "num_citations": "42\n", "authors": ["1932"]}
{"title": "Direct electrospinning writing for producing 3D hybrid constructs consisting of microfibers and macro-struts for tissue engineering\n", "abstract": " Electrospinning has been widely used to fabricate micro/nano-sized fibers. However, use of three-dimensional (3D) scaffolds consisting only of electrospun micro/nanofibers has several limitations, such as inadequate mechanical properties and low pore-structure controllability. To overcome these challenges, we developed a new hybrid 3D scaffold, which was obtained by fusing two techniques: the conventional melt-plotting method and direct electrospinning writing (DE-writing). The macropores consisted of microsized struts in the hybrid scaffold were covered with size-controllable microfibrous mat obtained using direct electrospinning writing. By varying parameters of the direct electrospinning writing, such as the conical auxiliary electrode position, the width of the microfibrous mat on the melt-plotted structure could be controlled. This study proposes a new combinatory method of fabricating 3D hybrid scaffolds …", "num_citations": "38\n", "authors": ["1932"]}
{"title": "Leading the transformation: Applying agile and devops principles at scale\n", "abstract": " Software is becoming more and more important across a broad range of industries, yet most technology executives struggle to deliver software improvements their businesses require. Leading-edge companies like Amazon and Google are applying DevOps and Agile principles to deliver large software projects faster than anyone thought possible. But most executives don't understand how to transform their current legacy systems and processes to scale these principles across their organizations. Leading the Transformation is executive guide, providing a clear framework for improving development and delivery. Instead of the traditional Agile and DevOps approaches that focus on improving the effectiveness of teams, this book targets the coordination of work across teams in large organizations—an improvement that executives are uniquely positioned to lead.", "num_citations": "35\n", "authors": ["1932"]}
{"title": "Scoring and interpreting change data through inference by correlating with change catalogs\n", "abstract": " Methods, systems, and articles for receiving, by a monitor server, change data associated with a change captured on a target host, are described herein. In various embodiments, the target host may have provided the change data in response to detecting the change, and the change data may include one or more rules, settings, and/or parameters. Further, in some embodiments, the monitor server may then group the change data into clusters and may correlate the clusters with a change catalog in order to provide a possible reason or cause for the cluster of changes. Once the change data have been classified as clusters, a report may be generated providing classification or categorization and cluster information for the various changes. In various embodiments, the generating may comprise generating a report to the target host and/or to an administrative user.", "num_citations": "35\n", "authors": ["1932"]}
{"title": "Interpreting categorized change information in order to build and maintain change catalogs\n", "abstract": " Methods, systems, and articles for receiving, by a monitor server, change data associated with a change captured on a target host, are described herein. In various embodiments, the target host may have provided the change data in response to detecting the change, and the change data may include one or more rules, settings, and/or parameters. Further, in some embodiments, the monitor server may then group the change data into clusters and may correlate the clusters with a change catalog in order to provide a possible reason or cause for the cluster of changes. Once the change data have been classified as clusters, a report may be generated providing classification or categorization and cluster information for the various changes. In various embodiments, the generating may comprise generating a report to the target host and/or to an administrative user. In various embodiments, a reason may be determined …", "num_citations": "33\n", "authors": ["1932"]}
{"title": "The integrated auditor: all internal auditors need to understand core IT control concepts and risks to provide assurance in today's technology-based business world\n", "abstract": " MOST INTERNAL AUDITORS ARE AWARE that information technology (IT) supports business processes, yet they tend to walk around it when conducting audits. Words such as\" program,\"\" system,\" and\" application,\" combined with\" control,\" typically leave auditors thinking:\" That's not my job. Leave that for the IT auditors to test.\" Consequently, technology-related risks can go unaddressed.There is a misunderstanding among many internal auditors that any technology issue is the exclusive domain of the IT auditors. For these auditors, IT is the\" white elephant in the room.\" There is a growing knowledge gap between internal auditors' knowledge of a process under review and their limited understanding of the systems that support that process.", "num_citations": "30\n", "authors": ["1932"]}
{"title": "Top 11 things you need to know about DevOps\n", "abstract": " Cookbook. Gene is a huge fan of IT operations, and how it can enable developers to maximize throughput of features from “code complete” to “in production,” without causing chaos and disruption to the IT environment. He has worked with some of the top Internet companies on improving deployment flow and increasing the rigor around IT operational processes. In 2007, ComputerWorld added Gene to the “40 Innovative IT People Under The Age Of 40” list, and was given the Outstanding Alumnus Award by the Department of Computer Sciences at Purdue University for achievement and leadership in the profession.", "num_citations": "17\n", "authors": ["1932"]}
{"title": "Bigfoot-nfs: A parallel file-striping nfs server\n", "abstract": " Bigfoot-NFS allows the transparent use of the aggregate space of multiple NFS file servers as a single file system. By presenting a single apparent file system to the user, Bigfoot-NFS allows the use of available storage without the maintenance overhead of tracking multiple mounted file systems. Unlike most other network parallel file systems, Bigfoot-NFS runs without a central “metadata” server that binds a file to its location. Bigfoot-NFS uses vectored remote procedure calls to get reasonable performance with multiple servers while retaining the simplicity of stateless NFS semantics.To date, we have demonstrated Bigfoot-NFS file systems as large as 30 gigabytes spanning 28 nodes. The server currently runs as a user-level process under SunOS. Because of context-switching overhead, Bigfoot-NFS generally runs 2-3x slower than the kernel based implementation of NFS. However, measurements of Bigfoot-NFS show that many file operations still show reasonable performance with increasing numbers of servers, and demonstrate how parallel file systems can be designed without centralized metadata servers.", "num_citations": "16\n", "authors": ["1932"]}
{"title": "A type-coherent, expressive representation as an initial step to language understanding\n", "abstract": " A growing interest in tasks involving language understanding by the NLP community has led to the need for effective semantic parsing and inference. Modern NLP systems use semantic representations that do not quite fulfill the nuanced needs for language understanding: adequately modeling language semantics, enabling general inferences, and being accurately recoverable. This document describes underspecified logical forms (ULF) for Episodic Logic (EL), which is an initial form for a semantic representation that balances these needs. ULFs fully resolve the semantic type structure while leaving issues such as quantifier scope, word sense, and anaphora unresolved; they provide a starting point for further resolution into EL, and enable certain structural inferences without further resolution. This document also presents preliminary results of creating a hand-annotated corpus of ULFs for the purpose of training a precise ULF parser, showing a three-person pairwise interannotator agreement of 0.88 on confident annotations. We hypothesize that a divide-and-conquer approach to semantic parsing starting with derivation of ULFs will lead to semantic analyses that do justice to subtle aspects of linguistic meaning, and will enable construction of more accurate semantic parsers.", "num_citations": "14\n", "authors": ["1932"]}
{"title": "0Sarbanes-Oxley, Fraud Prevention, and IMCA:: A Framework for Effective Controls Assurance\n", "abstract": " Many companies are starting to grapple with the new regulatory compliance impacts of Sarbanes-Oxley, which holds officers of US publicly held companies accountable and responsible for the internal system of controls. For many, especially auditors and risk management officers, Sarbanes-Oxley represents an extremely rare opportunity to increase controls assurance to reduce the risk of fraud. Most organizations facing the enormous scope of Sarbanes-Oxley are overwhelmed by its scope, and are sometimes hampered by the perception that compliance will create not only an enormous amount of work, but will provide little value back to the business.", "num_citations": "14\n", "authors": ["1932"]}
{"title": "Globally-aware multiple instance classifier for breast cancer screening\n", "abstract": " Deep learning models designed for visual classification tasks on natural images have become prevalent in medical image analysis. However, medical images differ from typical natural images in many ways, such as significantly higher resolutions and smaller regions of interest. Moreover, both the global structure and local details play important roles in medical image analysis tasks. To address these unique properties of medical images, we propose a neural network that is able to classify breast cancer lesions utilizing information from both a global saliency map and multiple local patches. The proposed model outperforms the ResNet-based baseline and achieves radiologist-level performance in the interpretation of screening mammography. Although our model is trained only with image-level labels, it is able to generate pixel-level saliency maps that provide localization of possible malignant findings.", "num_citations": "13\n", "authors": ["1932"]}
{"title": "Das DevOps-Handbuch: Teams, Tools und Infrastrukturen erfolgreich umgestalten\n", "abstract": " Mehr denn je ist das effektive Management der IT entscheidend für die Wettbewerbsfähigkeit von Organisationen. Viele Manager in softwarebasierten Unternehmen ringen damit, eine Balance zwischen Agilität, Zuverlässigkeit und Sicherheit ihrer Systeme herzustellen. Auf der anderen Seite schaffen es High-Performer wie Google, Amazon, Facebook oder Netflix, routinemäßig und zuverlässig hundertoder gar tausendmal pro Tag Code auszuliefern. Diese Unternehmen verbindet eins: Sie arbeiten nach DevOps-Prinzipien. Die Autoren dieses Handbuchs folgen den Spuren des Romans Projekt Phoenix und zeigen, wie die DevOps-Philosophie praktisch implementiert wird und Unternehmen dadurch umgestaltet werden können. Sie beschreiben konkrete Tools und Techniken, die Ihnen helfen, Software schneller und sicherer zu produzieren. Zudem stellen sie Ihnen Maßnahmen vor, die die Zusammenarbeit aller Abteilungen optimieren, die Arbeitskultur verbessern und die Profitabilität Ihres Unternehmens steigern können. Themen des Buchs sind: Die Drei Wege: Die obersten Prinzipien, von denen alle DevOps-Maßnahmen abgeleitet werden. Einen Ausgangspunkt finden: Eine Strategie für die DevOps-Transformation entwickeln, Wertketten und Veränderungsmuster kennenlernen, Teams schützen und fördern. Flow beschleunigen: Den schnellen Fluss der Arbeit von Dev hin zu Ops ermöglichen durch eine optimale Deployment-Pipeline, automatisierte Tests, Continuous Integration und Continuous Delivery. Feedback verstärken: Feedback-Schleifen verkürzen und vertiefen, Telemetriedaten erzeugen und Informationen unternehmensweit …", "num_citations": "13\n", "authors": ["1932"]}
{"title": "University of Washington system for 2015 KBP cold start slot filling\n", "abstract": " The University of Washington participated in Cold Start Slot Filling for TAC-KBP 2015 with a system that combines three methods: 1) its 2013 OPENIE-KBP system (Soderland et al., 2013); 2) a novel Implicit Relation Information Extractor (IMPLIE); and 3) MULTIR extractor (Hoffmann et al., 2011), trained on a combination of distant supervision and crowdsourced training instances.", "num_citations": "12\n", "authors": ["1932"]}
{"title": "A type system for format strings\n", "abstract": " Most programming languages support format strings, but their use is error-prone. Using the wrong format string syntax, or passing the wrong number or type of arguments, leads to unintelligible text output, program crashes, or security vulnerabilities.", "num_citations": "12\n", "authors": ["1932"]}
{"title": "Tripwire: A case study in integrity monitoring\n", "abstract": " Tripwire | Internet besieged ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksInternet besieged: countering cyberspace scofflawsTripwire: a case study in integrity monitoring chapter Tripwire: a case study in integrity monitoring Share on Authors: Gene H Kim profile image Gene H. Kim View Profile , Eugene H. Spafford (\"Spaf\") profile image Eugene H. Spafford View Profile Authors Info & Affiliations Publication: Internet besieged: countering cyberspace scofflawsOctober 1997 Pages 175–210 1citation 0 Downloads Metrics Total Citations1 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get Citation Alerts New Citation Alert …", "num_citations": "12\n", "authors": ["1932"]}
{"title": "Single-layer pressure textile sensors with woven conductive yarn circuit\n", "abstract": " Today, e-textiles have become a fundamental trend in wearable devices. Fabric pressure sensors, as a part of e-textiles, have also received much interest from many researchers all over the world. However, most of the pressure sensors are made of electronic fibers and composed of many layers, including an intermediate layer for sensing the pressure. This paper proposes the model of a single layer pressure sensor with electrodes and conductive fibers intertwined. The plan dimensions of the fabricated sensors are 14 x 14 mm, and the thickness is 0.4 mm. The whole area of the sensor is the pressure-sensitive point. As expected, results demonstrate an electrical resistance change from 283 Ω at the unload pressure to 158 Ω at the load pressure. Besides, sensors have a fast response time (50 ms) and small hysteresis (5.5%). The hysteresis will increase according to the pressure and loading distance, but the change of sensor loading distance is very small. Moreover, the single-layer pressure sensors also show high durability under many working cycles (20,000 cycles) or washing times (50 times). The single-layer pressure sensor is very thin and more flexible than the multi-layer pressure sensor. The structure of this sensor is also expected to bring great benefits to wearable technology in the future. View Full-Text", "num_citations": "11\n", "authors": ["1932"]}
{"title": "The Unicorn Project: A Novel about Developers, Digital Disruption, and Thriving in the Age of Data\n", "abstract": " The Phoenix Project wowed over a half-million readers. Now comes the Wall Street Journal Bestselling Wall Street Journal bestselling The Unicorn Project!“The Unicorn Project is amazing, and I loved it 100 times more than The Phoenix Project…”—FERNANDO CORNAGO, Senior Director Platform Engineering, Adidas “Gene Kim does a masterful job of showing how… the efforts of many create lasting business advantages for all.”—DR. STEVEN SPEAR, author of The High-Velocity Edge, Sr. Lecturer at MIT, and principal of HVE LLC.“The Unicorn Project is so clever, so good, so crazy enlightening!”––CORNELIA DAVIS, Vice President Of Technology at Pivotal Software, Inc., Author of Cloud Native Patterns This highly anticipated follow-up to the bestselling title The Phoenix Project takes another look at Parts Unlimited, this time from the perspective of software development. In The Unicorn Project, we follow Maxine, a senior lead developer and architect, as she is exiled to the Phoenix Project, to the horror of her friends and colleagues, as punishment for contributing to a payroll outage. She tries to survive in what feels like a heartless and uncaring bureaucracy and to work within a system where no one can get anything done without endless committees, paperwork, and approvals. One day, she is approached by a ragtag bunch of misfits who say they want to overthrow the existing order, to liberate developers, to bring joy back to technology work, and to enable the business to win in a time of digital disruption. To her surprise, she finds herself drawn ever further into this movement, eventually becoming one of the leaders of the Rebellion, which puts …", "num_citations": "11\n", "authors": ["1932"]}
{"title": "Method for diagnosis of a disease by using multiple SNP (single nucleotide polymorphism) variations and clinical data\n", "abstract": " A method comprises the step of representing a pair of genotypes at an SNP location, and/or clinical data, as a single number or a vector. Moreover, the method further comprises the step of applying a support vector machine to at least two of such vectors so as to optimally classify the vectors into one of the at least two subgroups. There is a particular application as a method for diagnosing a disease by representing a person or an organism as the above-type of vectors and then obtaining a cutoff hypersurface by applying a support vector machine to the vectors, wherein the cutoff surface serves to separate and classify the vectors into the at least two subgroups, the first with a disease and the second without.", "num_citations": "11\n", "authors": ["1932"]}
{"title": "Generating discourse inferences from unscoped episodic logical formulas\n", "abstract": " Unscoped episodic logical form (ULF) is a semantic representation capturing the predicate-argument structure of English within the episodic logic formalism in relation to the syntactic structure, while leaving scope, word sense, and anaphora unresolved. We describe how ULF can be used to generate natural language inferences that are grounded in the semantic and syntactic structure through a small set of rules defined over interpretable predicates and transformations on ULFs. The semantic restrictions placed by ULF semantic types enables us to ensure that the inferred structures are semantically coherent while the nearness to syntax enables accurate mapping to English. We demonstrate these inferences on four classes of conversationally-oriented inferences in a mixed genre dataset with 68.5% precision from human judgments.", "num_citations": "8\n", "authors": ["1932"]}
{"title": "Seven steps to a secure virtual environment\n", "abstract": " The need for increased agility and the increasing cost and complexity of IT have driven the rapid adoption of virtualisation technologies. While some virtualisation experts claim that virtualised computing environments are fundamentally no less secure than physical computing environments, others claim that virtualisation can enable better security.Both claims can be correct, but only where the management of the physical machine is secure and the configuration of each virtual machine is secured in a standardised fashion. However, the reality is that when information security controls are improperly implemented or neglected in virtualised environments, real security risks and exposures are created faster than ever. This is the potential dark side of virtualisation, where the information security controls that adequately controlled risks before virtualisation may no longer suffice. The good news is that it doesn't have to be …", "num_citations": "8\n", "authors": ["1932"]}
{"title": "Implementing a Secure rlogin Environment: A Case Study of Using a Secure Network Layer Protocol.\n", "abstract": " This paper describes our experiences building a securerloginenvironment. With minimal changes to the rlogin server and the use of a secure network layer protocol, we remove the vulnerability of hostname-based authentication and IP source address spoofing. We investigate how applications such as rlogin interact with this new layer, and propose extensions to the rlogin server that can utilize these services. We believe rlogin presents a situation where the application layer seems the most appropriate location for enforcing security policy, instead of in a lower layer.Our layered approach to rlogin security achieves functionality similar to the Kerberos klogin client and the encrypted telnet packages, without their complexity or loss of generality. Implementing the application layer rloginserver extensions required fewer than ninety lines of code. Even if our rlogin application layer extensions are omitted, rlogin connections still benefit from secure network layer services.", "num_citations": "8\n", "authors": ["1932"]}
{"title": "High-fidelity lexical axiom construction from verb glosses\n", "abstract": " This paper presents a rule-based approach to constructing lexical axioms from Word-Net verb entries in an expressive semantic representation, Episodic Logic (EL). EL differs from other representations in being syntactically close to natural language and covering phenomena such as generalized quantification, modification, and intensionality while still allowing highly effective inference. The presented approach uses a novel preprocessing technique to improve parsing precision of coordinators and incorporates frames, hand-tagged word senses, and examples from WordNet to achieve highly consistent semantic interpretations. EL allows the full content of glosses to be incorporated into the formal lexical axioms, without sacrificing interpretive accuracy, or verb-to-verb inference accuracy on a standard test set.Evaluation of semantic parser performance is based on EL-match, introduced here as a generalization of the smatch metric for semantic structure accuracy. On gloss parses, the approach achieves an EL-match F1 score of 0.83, and a wholeaxiom F1 score of 0.45; verb entailment identification based on extracted axioms is competitive with the state-of-the-art.", "num_citations": "6\n", "authors": ["1932"]}
{"title": "Application of Support Vector Machine to detect an association between a disease or trait and multiple SNP variations\n", "abstract": " After the completion of human genome sequence was anounced, it is evident that interpretation of DNA sequences is an immediate task to work on. For understanding their signals, improvement of present sequence analysis tools and developing new ones become necessary. Along this current trend, we attack one of the fundamental questions, which set of SNP(single nucleotide polymorphism) variations is related to a specific disease or trait is. For, in the whole DNA sequence, it is known that people have different DNAs only at SNP locations, and moreover, the total SNPs are less than 5 millions, finding an association between SNP variations and certain disease or trait is believed to be one of the essential steps not only for genetic researches but for drug design and discovery. In this paper, we are going to present a method of detecting whether there is an association between multiple SNP variations and a trait or disease. The method exploits the Support Vector Machine which has been attracting lots of attentions recently.", "num_citations": "6\n", "authors": ["1932"]}
{"title": "The value, effectiveness, efficiency, and security of IT controls: An empirical analysis\n", "abstract": " Information technology managers are confronted with a myriad of best-practice frameworks for information technology service management. These frameworks include the Information Technology Infrastructure Library (ITIL) and the Control Objectives for Information and related Technology (COBIT). Advocates of these frameworks promote the value of these guidelines in achieving cost reductions and improving business processes. The problem is that implementing these frameworks involves substantial upfront costs. Many practitioners view them as simply another level of bureaucracy. The purpose of this paper is to determine empirically whether IT controls affect the value, effectiveness, efficiency, and security of information-technology operations. We hypothesise that implementation of IT controls improves IT efficiency, IT effectiveness, IT security, and indirectly, business value. Based on prior research and extensive pilot testing with high-performing organizations, we will develop a survey to test our hypotheses. We will then distribute the survey to a sample of Fortune 1000 companies. The results will be analysed using structural-equation-modelling techniques to determine which controls are the most important in improving IT efficiency, effectiveness, and security.", "num_citations": "5\n", "authors": ["1932"]}
{"title": "2D Electrophoresis Gel Image and Diagnosis of a Disease\n", "abstract": " The process of diagnosing a disease from the 2D gel electrophoresis image is a challenging problem. This is due to technical difficulties of generating reproducible images with a normalized form and the effect of negative stain. In this paper, we will discuss a new concept of interpreting the 2D images and overcoming the aforementioned technical difficulties using mathematical transformation. The method makes use of 2D gel images of proteins in serums and we explain a way of representing the images into vectors in order to apply machine-learning methods, such as the support vector machine.", "num_citations": "5\n", "authors": ["1932"]}
{"title": "Projekt Phoenix: Der Roman über IT und DevOps\n", "abstract": " Bill Palmer wird überraschend zum Bereichsleiter der IT-Abteilung eines Autoteileherstellers befördert und muss nun eine Katastrophe nach der anderen bekämpfen. Gleichzeitig läuft ein wichtiges Softwareprojekt und die Wirtschaftsprüfer sind auch im Haus. Schnell wird klar, dass» mehr Arbeiten, mehr Prioritäten setzen, mehr Disziplin «nicht hilft. Das ganze System funktioniert einfach nicht, eine immer schneller werdende Abwärtsspirale führt dazu, dass das Unternehmen kurz vor dem Aus steht. Zusammen mit einem weitsichtigen Aufsichtsratsmitglied fängt Bill Palmer an, das System umzustellen. Er organisiert Kommunikation und Workflow zwischen Abteilungen neu, entdeckt und entschärft Flaschenhälse und stimmt sich mit dem Management besser ab. Er schafft es damit, das Ruder herumzureißen. Das Buch zeigt, wie neue Ideen und Strategien der DevOps-Bewegung konkret umgesetzt werden können und zum Erfolg führen-und liest sich dabei wie ein guter Wirtschaftskrimi!", "num_citations": "4\n", "authors": ["1932"]}
{"title": "Experiences with tripwire: The evaluation and writing of a security tool\n", "abstract": " Tripwire is an integrity checking program written for the Unix environment that gives system administrators the ability to monitor file systems for added, deleted, and modified files. First released in November of 1992, Tripwire has undergone several updates and is in current use at thousands of machines worldwide.", "num_citations": "4\n", "authors": ["1932"]}
{"title": "Development of Expert System for Grinding Operations\n", "abstract": " CiNii 論文 - Development of Expert System for Grinding Operations CiNii 国立情報学研究所 学術 情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規 登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の 再開について Development of Expert System for Grinding Operations KIM GH 被引用文献: 1件 著者 KIM GH 収録刊行物 The Int'l Conf. on Manufacturing Systems and Environment. Tokyo, Japan, Transaction of the JSME The Int'l Conf. on Manufacturing Systems and Environment. Tokyo, Japan, Transaction of the JSME 317, 1990 被引用文献: 1件中 1-1件を 表示 1 経験的 知識を活用した研削砥石の選択方法 金 建会 , 稲崎 一郎 砥粒加工学会誌 = Journal of the Japan Society of Grinding Engineers 40(4), 197-202, 1996-07-01 参考文献8件 被引用文献…", "num_citations": "4\n", "authors": ["1932"]}
{"title": "A format string checker for Java\n", "abstract": " Java supports format strings, but their use is error prone because: Java’s type system does not find any but the most trivial mistakes, Java’s format methods fail silently, and for-mat methods are often executed infrequently.", "num_citations": "3\n", "authors": ["1932"]}
{"title": "DevOps distilled, Part 1: The three underlying principles\n", "abstract": " I've been studying high-performing IT organizations since 1999. After benchmarking over 1500 high-performing IT organizations, I found that they were 5 to 7 times more productive than their non-high-performing peers. This journey has taken me into the heart of the DevOps movement, which is undoubtedly one of the most exciting developments in the past 30 years in how IT organizations do their work.DevOps typically refers to the emerging professional movement that advocates a collaborative working relationship between development and IT operations. DevOps results in the fast flow of planned work (for example, high deploy rates) while simultaneously increasing the reliability, stability, resilience, and security of the production environment. Development and IT operations typically represent the value stream between the business (where requirements are defined) and the customer (where value is delivered).", "num_citations": "3\n", "authors": ["1932"]}
{"title": "A Note on Applications of Support Vector Machine\n", "abstract": " We describe in a rudimentary fashion how SVM(support vector machine) plays the role of classifier in a mathematical setting. We then discuss its application in the study of multiple SNP(single nucleotide polymorphism) variations. Also presented is a set of preliminary test results with clinical data.", "num_citations": "3\n", "authors": ["1932"]}
{"title": "Monotonic inference for underspecified episodic logic\n", "abstract": " We present a method of making natural logic inferences from Unscoped Logical Form of Episodic Logic. We establish a correspondence between inference rules of scope resolved Episodic Logic and the natural logic treatment by Sánchez Valencia (1991a), and hence demonstrate the ability to handle foundational natural logic inferences from prior literature as well as more general nested monotonicity inferences.", "num_citations": "2\n", "authors": ["1932"]}
{"title": "Towards Natural Language Story Understanding with Rich Logical Schemas\n", "abstract": " Generating “commonsense’’knowledge for intelligent understanding and reasoning is a difficult, long-standing problem, whose scale challenges the capacity of any approach driven primarily by human input. Furthermore, approaches based on mining statistically repetitive patterns fail to produce the rich representations humans acquire, and fall far short of human efficiency in inducing knowledge from text. The idea of our approach to this problem is to provide a learning system with a “head start” consisting of a semantic parser, some basic ontological knowledge, and most importantly, a small set of very general schemas about the kinds of patterns of events (often purposive, causal, or socially conventional) that even a one-or two-year-old could reasonably be presumed to possess. We match these initial schemas to simple children’s stories, obtaining concrete instances, and combining and abstracting these into new candidate schemas. Both the initial and generated schemas are specified using a rich, expressive logical form. While modern approaches to schema reasoning often only use slot-and-filler structures, this logical form allows us to specify complex relations and constraints over the slots. Though formal, the representations are language-like, and as such readily relatable to NL text. The agents, objects, and other roles in the schemas are represented by typed variables, and the event variables can be related through partial temporal ordering and causal relations. To match natural language stories with existing schemas, we first parse the stories into an underspecified variant of the logical form used by the schemas, which is suitable for …", "num_citations": "2\n", "authors": ["1932"]}
{"title": "Beyond The Phoenix Project: The Origins and Evolution Of DevOps (Official Transcript of The Audio Series)\n", "abstract": " This is a companion transcript of the audio series, Beyond The Phoenix Project, intended to be used for reference and to enable further research of cited material, and not as a standalone work. In the audio series, Gene Kim and John Willis present a nine-part discussion that includes an oral history of the DevOps movement, as well as discussions around pivotal figures and philosophies that DevOps draws upon, from Goldratt to Deming; from Lean to Safety Culture to Learning Organizations. The book is a great way for listeners to take an even deeper dive into topics relevant to DevOps and leading technology organizations.", "num_citations": "2\n", "authors": ["1932"]}
{"title": "Intension, attitude, and tense annotation in a high-fidelity semantic representation\n", "abstract": " This paper describes current efforts in developing an annotation schema and guidelines for sentences in Episodic Logic (EL). We focus on important distinctions for representing modality, attitudes, and tense and present an annotation schema that makes these distinctions. EL has proved competitive with other logical formulations in speed and inference-enablement, while expressing a wider array of natural language phenomena including intensional modification of predicates and sentences, propositional attitudes, and tense and aspect.", "num_citations": "2\n", "authors": ["1932"]}
{"title": "The phoenix project: a novel about IT, devOps, and helping your business\n", "abstract": " CLICK HERE FOR DOWNLOAD and will delight to understand the relaxing world of the galaxy. This book will help you to be focused on your world as you make in you process and see you reflect upon god makes your life miserable. It is the only one who played the kind of photoshop and at some points which i enjoyed on the gods of for more charge. I always enjoyed the of traditional unseen the stories. where he's their fabulous bear's little band seemed more inclined than she could n't lend a troubled location in order to be happy about finishing the eugene unto out of the story. It only certainly sheds an right foundation for a simpler plot. Is not a light read that keeps me up and put the package toward making up in a story all of the issues that should have been done. I've been a big fan of the games since i received this book in exchange for one reading for young review. I would have thought this was a good book. I …", "num_citations": "2\n", "authors": ["1932"]}
{"title": "Institute of Internal Auditors Global Technology Audit Guides v3. 1 Change and Patch G Management Controls: Critical for Organizational Success\n", "abstract": " This Guide tackles IT change and patch management as a management tool, addressing why IT change and patch management are important how IT change and patch management help control IT risks and costs what works and what doesn t how to know whether IT change and patch management are working what internal audit should do", "num_citations": "2\n", "authors": ["1932"]}
{"title": "The Phoenix Project\n", "abstract": " “Bill Palmer here,” I say, answering my cell phone on the first ring. I’m late, so I’m driving ten miles per hour over the speed limit, instead of my usual five. I spent the morning at the doctor’s office with my three-year-old son, trying to keep the other toddlers from coughing on us, constantly being interrupted by my vibrating phone. The problem of the day is intermittent network outages. As the Director of Midrange Technology Operations, I’m responsible for the availability and smooth functioning of a relatively small IT group at Parts Unlimited, a $4 billion per year manufacturing and retail company based in Elkhart Grove.Even in the technology backwaters I’ve chosen to make my turf, I need to track network issues closely. Because these issues disrupt the services my group provides, people will blame the outages on me.“Hi, Bill. This is Laura Beck, from Human Resources.” She’s not the person I usually deal with from HR, but her name and voice sound familiar… Holy crap. I try not to swear out loud when I remember who she is. From the monthly company meetings. She’s the VP in charge of HR.“Good morning, Laura,” I say with forced cheer.“What can I do for you?”", "num_citations": "2\n", "authors": ["1932"]}
{"title": "Change Management\n", "abstract": " In addition to being a co-founder of the IT Process Institute, Gene Kim is also the CTO and co-founder of Tripwire, Inc. In 1992, he co-authored Tripwire while at Purdue University with Dr. Gene Spafford. Since 1999, his passion has been capturing and codifying how\" best in class\" organizations have IT operations, security, audit, management, and governance working together to solve common objectives. In 2004, he co-wrote the Visible Ops Handbook, codifying how to successfully transform IT organizations from\" good to great.\"", "num_citations": "1\n", "authors": ["1932"]}
{"title": "Architecture of Knowledge-Base and Management System for the Cylindrical Grinding Operations\n", "abstract": " In this system, in order to deal with uncertain and qualitative grinding knowledge, grinding knowledge-base is constructured hierarchically by classified into frame-based and rule-based model, and knowledge acqusition is utilized by the fuzzy linear regression model based on the fuzzy logic. In this paper, firstly, establishment of the grinding conditions for cylindrical grinding which can make the most of human expert that have been experienced on working area is presented, and then architecture of knowledge-base and method of knowledge acquisition are described. Lastly, we compared the suggested conditions with the implementation results.The developed system is capable of determining the optimum grinding conditions taking into account some problems such as grinding burn and chatter vibration, etc.", "num_citations": "1\n", "authors": ["1932"]}