{"title": "Temporal-logic-based reactive mission and motion planning\n", "abstract": " This paper provides a framework  to automatically  generate a hybrid controller that  guarantees  that the robot can achieve its task when a robot model, a class of admissible environments, and a high-level task or behavior for the robot are provided. The desired task specifications, which are expressed in a fragment of linear temporal logic (LTL), can capture complex robot behaviors such as search and rescue, coverage, and collision avoidance. In addition, our framework explicitly captures sensor specifications that depend on the environment with which the robot is interacting, which results in a novel paradigm for sensor-based temporal-logic-motion planning. As one robot is part of the environment of another robot, our sensor-based framework very naturally captures multirobot specifications in a decentralized manner. Our computational approach is based on first creating discrete controllers satisfying specific LTL …", "num_citations": "728\n", "authors": ["1038"]}
{"title": "Robustness of temporal logic specifications for continuous-time signals\n", "abstract": " In this paper, we consider the robust interpretation of Metric Temporal Logic (MTL) formulas over signals that take values in metric spaces. For such signals, which are generated by systems whose states are equipped with non-trivial metrics, for example continuous or hybrid, robustness is not only natural, but also a critical measure of system performance. Thus, we propose multi-valued semantics for MTL formulas, which capture not only the usual Boolean satisfiability of the formula, but also topological information regarding the distance, ε, from unsatisfiability. We prove that any other signal that remains ε-close to the initial one also satisfies the same MTL specification under the usual Boolean semantics. Finally, our framework is applied to the problem of testing formulas of two fragments of MTL, namely Metric Interval Temporal Logic (MITL) and closed Metric Temporal Logic (clMTL), over continuous-time signals …", "num_citations": "446\n", "authors": ["1038"]}
{"title": "Temporal logic motion planning for dynamic robots\n", "abstract": " In this paper, we address the temporal logic motion planning problem for mobile robots that are modeled by second order dynamics. Temporal logic specifications can capture the usual control specifications such as reachability and invariance as well as more complex specifications like sequencing and obstacle avoidance. Our approach consists of three basic steps. First, we design a control law that enables the dynamic model to track a simpler kinematic model with a globally bounded error. Second, we built a robust temporal logic specification that takes into account the tracking errors of the first step. Finally, we solve the new robust temporal logic path planning problem for the kinematic model using automata theory and simple local vector fields. The resulting continuous time trajectory is provably guaranteed to satisfy the initial user specification.", "num_citations": "429\n", "authors": ["1038"]}
{"title": "Where's waldo? sensor-based temporal logic motion planning\n", "abstract": " Given a robot model and a class of admissible environments, this paper provides a framework for automatically and verifiably composing controllers that satisfy high level task specifications expressed in suitable temporal logics. The desired task specifications can express complex robot behaviors such as search and rescue, coverage, and collision avoidance. In addition, our framework explicitly captures sensor specifications that depend on the environment with which the robot is interacting, resulting in a novel paradigm for sensor-based temporal logic motion planning. As one robot is part of the environment of another robot, our sensor-based framework very naturally captures multi-robot specifications. Our computational approach is based on first creating discrete controllers satisfying so-called general reactivity formulas. If feasible, the discrete controller is then used in order to guide the sensor-based …", "num_citations": "259\n", "authors": ["1038"]}
{"title": "Temporal logic motion planning for mobile robots\n", "abstract": " In this paper, we consider the problem of robot motion planning in order to satisfy formulas expressible in temporal logics. Temporal logics naturally express traditional robot specifications such as reaching a goal or avoiding an obstacle, but also more sophisticated specifications such as sequencing, coverage, or temporal ordering of different tasks. In order to provide computational solutions to this problem, we first construct discrete abstractions of robot motion based on some environmental decomposition. We then generate discrete plans satisfying the temporal logic formula using powerful model checking tools, and finally translate the discrete plans to continuous trajectories using hybrid control. Critical to our approach is providing formal guarantees ensuring that if the discrete plan satisfies the temporal logic formula, then the continuous motion also satisfies the exact same formula.", "num_citations": "250\n", "authors": ["1038"]}
{"title": "Hybrid controllers for path planning: A temporal logic approach\n", "abstract": " Robot motion planning algorithms have focused on low-level reachability goals taking into account robot kinematics, or on high level task planning while ignoring low-level dynamics. In this paper, we present an integrated approach to the design of closed–loop hybrid controllers that guarantee by construction that the resulting continuous robot trajectories satisfy sophisticated specifications expressed in the so–called Linear Temporal Logic. In addition, our framework ensures that the temporal logic specification is satisfied even in the presence of an adversary that may instantaneously reposition the robot within the environment a finite number of times. This is achieved by obtaining a Büchi automaton realization of the temporal logic specification, which supervises a finite family of continuous feedback controllers, ensuring consistency between the discrete plan and the continuous execution.", "num_citations": "206\n", "authors": ["1038"]}
{"title": "Translating structured english to robot controllers\n", "abstract": " Recently, Linear Temporal Logic (LTL) has been successfully applied to high-level task and motion planning problems for mobile robots. One of the main attributes of LTL is its close relationship with fragments of natural language. In this paper, we take the first steps toward building  a natural language interface for LTL planning methods with mobile robots as the application domain. For this purpose, we built a structured English language which maps directly to a fragment of LTL.", "num_citations": "165\n", "authors": ["1038"]}
{"title": "Simulation-based adversarial test generation for autonomous vehicles with machine learning components\n", "abstract": " Many organizations are developing autonomous driving systems, which are expected to be deployed at a large scale in the near future. Despite this, there is a lack of agreement on appropriate methods to test, debug, and certify the performance of these systems. One of the main challenges is that many autonomous driving systems have machine learning (ML) components, such as deep neural networks, for which formal properties are difficult to characterize. We present a testing framework that is compatible with test case generation and automatic falsification methods, which are used to evaluate cyber-physical systems. We demonstrate how the framework can be used to evaluate closed-loop properties of an autonomous driving system model that includes the ML components, all within a virtual environment. We demonstrate how to use test case generation methods, such as covering arrays, as well as requirement …", "num_citations": "139\n", "authors": ["1038"]}
{"title": "Experimental cooperative control of fixed-wing unmanned aerial vehicles\n", "abstract": " Recent years have seen rapidly growing interest in the development of networks of multiple unmanned aerial vehicles (UAVs), as aerial sensor networks for the purpose of coordinated monitoring, surveillance, and rapid emergency response. This has triggered a great deal of research in higher levels of planning and control, including collaborative sensing and exploration, synchronized motion planning, and formation or cooperative control. In this paper, we describe our recently developed experimental testbed at the University of Pennsylvania, which consists of multiple, fixed-wing UAVs. We describe the system architecture, software and hardware components, and overall system integration. We then derive high-fidelity models that are validated with hardware-in-the-loop simulations and actual experiments. Our models are hybrid, capturing not only the physical dynamics of the aircraft, but also the mode switching …", "num_citations": "125\n", "authors": ["1038"]}
{"title": "Robustness of temporal logic specifications\n", "abstract": " In this paper, we consider the robust interpretation of metric temporal logic (MTL) formulas over timed sequences of states. For systems whose states are equipped with nontrivial metrics, such as continuous, hybrid, or general metric transition systems, robustness is not only natural, but also a critical measure of system performance. In this paper, we define robust, multi-valued semantics for MTL formulas, which capture not only the usual Boolean satisfiability of the formula, but also topological information regarding the distance, ε, from unsatisfiability. We prove that any other timed trace which remains ε-close to the initial one also satisfies the same MTL specification with the usual Boolean semantics. We derive a computational procedure for determining an under-approximation to the robustness degree ε of the specification with respect to a given finite timed state sequence. Our approach can be used for …", "num_citations": "114\n", "authors": ["1038"]}
{"title": "On-line monitoring for temporal logic robustness\n", "abstract": " In this paper, we provide a Dynamic Programming algorithm for on-line monitoring of the state robustness of Metric Temporal Logic specifications with past time operators. We compute the robustness of MTL with unbounded past and bounded future temporal operators (MTL) over sampled traces of Cyber-Physical Systems. We implemented our tool in Matlab as a Simulink block that can be used in any Simulink model. We experimentally demonstrate that the overhead of the MTL robustness monitoring is acceptable for certain classes of practical specifications.", "num_citations": "96\n", "authors": ["1038"]}
{"title": "Mining parametric temporal logic properties in model-based design for cyber-physical systems\n", "abstract": " One of the advantages of adopting a model-based development process is that it enables testing and verification at early stages of development. However, it is often desirable to not only verify/falsify certain formal system specifications, but also to automatically explore the properties that the system satisfies. In this work, we present a framework that enables property exploration for cyber-physical systems. Namely, given a parametric specification with multiple parameters, our solution can automatically infer the ranges of parameters for which the property does not hold on the system. In this paper, we consider parametric specifications in metric or Signal Temporal Logic (MTL or STL). Using robust semantics for MTL, the parameter mining problem can be converted into a Pareto optimization problem for which we can provide an approximate solution by utilizing stochastic optimization methods. We include …", "num_citations": "74\n", "authors": ["1038"]}
{"title": "Revising temporal logic specifications for motion planning\n", "abstract": " In this paper, we introduce the problem of automatic formula revision for Linear Temporal Logic (LTL) motion planning specifications. Namely, if a specification cannot be satisfied on a particular environment, our framework returns information to the user regarding (i) why the specification cannot be satisfied and (ii) how the specification can be modified so it can become satisfiable. This work contributes towards rendering temporal logic motion planning frameworks more user friendly by providing feedback to the user when the LTL planning phase fails.", "num_citations": "72\n", "authors": ["1038"]}
{"title": "Temporal logic verification using simulation\n", "abstract": " In this paper, we consider a novel approach to the temporal logic verification problem of continuous dynamical systems. Our methodology has the distinctive feature that enables the verification of the temporal properties of a continuous system by verifying only a finite number of its (simulated) trajectories. The proposed framework comprises two main ideas. First, we take advantage of the fact that in metric spaces we can quantify how close are two different states. Based on that, we define robust, multi-valued semantics for MTL (and LTL) formulas. These capture not only the usual Boolean satisfiability of the formula, but also topological information regarding the distance from unsatisfiability. Second, we use the recently developed notion of bisimulation functions to infer the behavior of a set of trajectories that lie in the neighborhood of the simulated one. If the latter set of trajectories is bounded by the tube of …", "num_citations": "70\n", "authors": ["1038"]}
{"title": "Querying parametric temporal logic properties on embedded systems\n", "abstract": " In Model Based Development (MBD) of embedded systems, it is often desirable to not only verify/falsify certain formal system specifications, but also to automatically explore the properties that the system satisfies. Namely, given a parametric specification, we would like to automatically infer the ranges of parameters for which the property holds/does not hold on the system. In this paper, we consider parametric specifications in Metric Temporal Logic (MTL). Using robust semantics for MTL, the parameter estimation problem can be converted into an optimization problem which can be solved by utilizing stochastic optimization methods. The framework is demonstrated on some examples from the literature.", "num_citations": "60\n", "authors": ["1038"]}
{"title": "Formal property verification in a conformance testing framework\n", "abstract": " In model-based design of cyber-physical systems, such as switched mixed-signal circuits or software-controlled physical systems, it is common to develop a sequence of system models of different fidelity and complexity, each appropriate for a particular design or verification task. In such a sequence, one model is often derived from the other by a process of simplification or implementation. E.g. a Simulink model might be implemented on an embedded processor via automatic code generation. Three questions naturally present themselves: how do we quantify closeness between the two systems? How can we measure such closeness? If the original system satisfies some formal property, can we automatically infer what properties are then satisfied by the derived model? This paper addresses all three questions: we quantify the closeness between original and derived model via a distance measure between their …", "num_citations": "54\n", "authors": ["1038"]}
{"title": "Ant colonies for temporal logic falsification of hybrid systems\n", "abstract": " The Extended Ant Colony Optimization (EACO) metaheuristic is applied to the problem of Metric Temporal Logic (MTL) falsification of nonautonomous hybrid systems. The goal of the MTL falsification problem is to detect operating conditions and input signals that will generate system trajectories that do not satisfy a user provided specification in MTL. A new method for parameterizing the input space using splines and Hermitian polynomials is introduced and the performance of the new algorithm is compared against Monte Carlo testing techniques. It is envisioned that this work will help practitioners in designing complex control or mixed-signal systems.", "num_citations": "53\n", "authors": ["1038"]}
{"title": "From structured english to robot motion\n", "abstract": " Recently, Linear Temporal Logic (LTL) has been successfully applied to high-level task and motion planning problems for mobile robots. One of the main attributes of LTL is its close relationship with fragments of natural language. In this paper, we take the first steps toward building a natural language interface for LTL planning methods with mobile robots as the application domain. For this purpose, we built a structured English language which maps directly to a fragment of LTL.", "num_citations": "53\n", "authors": ["1038"]}
{"title": "Utilizing S-TaLiRo as an automatic test generation framework for autonomous vehicles\n", "abstract": " This paper proposes an approach to automatically generating test cases for testing motion controllers of autonomous vehicular systems. Test scenarios may consist of single or multiple vehicles under test at the same time. Tests are performed in simulation environments. The approach is based on using a robustness metric for evaluating simulation outcomes as a cost function. Initial states and inputs are updated by stochastic optimization methods between the tests for achieving smaller robustness values. The test generation framework has been implemented in the toolbox S-TaLiRo. The proposed framework's ability to generate interesting test cases is demonstrated by a case study.", "num_citations": "51\n", "authors": ["1038"]}
{"title": "Translating temporal logic to controller specifications\n", "abstract": " The problem of designing hybrid controllers in order to satisfy safety or liveness specifications has received much attention in the past decade. Much more recently, there is an increased interest in designing hybrid controllers in order to achieve more sophisticated discrete specifications, such as those expressible in temporal logics. A great challenge is how to compose safety and liveness controllers in order to achieve more complex specifications. Existing approaches are predominantly bottom-up, in the sense that the overall control and composition (or switching) logic requires verification of the integrated closed-loop hybrid system. In this paper, we advocate and develop a top-down approach for this problem by synthesizing controllers which satisfy the specification by construction. Given a flat linear temporal logic specification as an input, we develop an algorithm that translates the temporal logic specification into …", "num_citations": "50\n", "authors": ["1038"]}
{"title": "Functional gradient descent method for metric temporal logic specifications\n", "abstract": " Metric Temporal Logic (MTL) specifications can capture complex state and timing requirements. Given a nonlinear dynamical system and an MTL specification for that system, our goal is to find a trajectory that violates or satisfies the specification. This trajectory can be used as a concrete feedback to the system designer in the case of violation or as a trajectory to be tracked in the case of satisfaction. The search for such a trajectory is conducted over the space of initial conditions, system parameters and input signals. We convert the trajectory search problem into an optimization problem through MTL robust semantics. Robustness quantifies how close the trajectory is to violating or satisfying a specification. Starting from some arbitrary initial condition and parameter and given an input signal, we compute a descent direction in the search space, which leads to a trajectory that optimizes the MTL robustness. This …", "num_citations": "47\n", "authors": ["1038"]}
{"title": "Hierarchical synthesis of hybrid controllers from temporal logic specifications\n", "abstract": " In this paper, the problem of synthesizing a hybrid controller for a specification expressed as a temporal logic formula φ is considered. We propose a hierarchical approach which consists of three steps. First, the plant to be controlled is abstracted to a fully actuated system. Using the notion of approximate simulation relation, we design a continuous interface allowing the plant to track the trajectories of its abstraction with a guaranteed precision δ. The second step, which is also the main contribution of this paper, consists in deriving a more robust specification φ′ from the temporal logic formula φ such that given a trajectory satisfying φ′, any other trajectory remaining within distance δ satisfies φ. Third, we design a hybrid controller for the abstraction such that all its trajectories satisfy the robust specification φ′. Then, the trajectories of the plant satisfy the original specification. An application to the control of a …", "num_citations": "46\n", "authors": ["1038"]}
{"title": "Robust sampling for MITL specifications\n", "abstract": " Real-time temporal logic reasoning about trajectories of physical systems necessitates models of time which are continuous. However, discrete time temporal logic reasoning is computationally more efficient than continuous time. Moreover, in a number of engineering applications only discrete time models are available for analysis. In this paper, we introduce a framework for testing MITL specifications on continuous time signals using only discrete time analysis. The motivating idea behind our approach is that if the dynamics of the signal fulfills certain conditions and the discrete time signal robustly satisfies the MITL specification, then the corresponding continuous time signal should also satisfy the same MITL specification.", "num_citations": "45\n", "authors": ["1038"]}
{"title": "Requirements-driven test generation for autonomous vehicles with machine learning components\n", "abstract": " Autonomous vehicles are complex systems that are challenging to test and debug. A requirements-driven approach to the development process can decrease the resources required to design and test these systems, while simultaneously increasing the reliability. We present a testing framework that uses signal temporal logic (STL), which is a precise and unambiguous requirements language. Our framework evaluates test cases against the STL formulae and additionally uses the requirements to automatically identify test cases that fail to satisfy the requirements. One of the key features of our tool is the support for machine learning (ML) components in the system design, such as deep neural networks. The framework allows evaluation of the control algorithms, including the ML components, and it also includes models of CCD camera, lidar, and radar sensors, as well as the vehicle environment. We use multiple …", "num_citations": "40\n", "authors": ["1038"]}
{"title": "Gray-box adversarial testing for control systems with machine learning components\n", "abstract": " Neural Networks (NN) have been proposed in the past as an effective means for both modeling and control of systems with very complex dynamics. However, despite the extensive research, NN-based controllers have not been adopted by the industry for safety critical systems. The primary reason is that systems with learning based controllers are notoriously hard to test and verify. Even harder is the analysis of such systems against system-level specifications. In this paper, we provide a gradient based method for searching the input space of a closed-loop control system in order to find adversarial samples against some system-level requirements. Our experimental results show that combined with randomized search, our method outperforms Simulated Annealing optimization.", "num_citations": "39\n", "authors": ["1038"]}
{"title": "Deep predictive models for collision risk assessment in autonomous driving\n", "abstract": " In this paper, we investigate a predictive approach for collision risk assessment in autonomous and assisted driving. A deep predictive model is trained to anticipate imminent accidents from traditional video streams. In particular, the model learns to identify cues in RGB images that are predictive of hazardous upcoming situations. In contrast to previous work, our approach incorporates (a) temporal information during decision making, (b) multi-modal information about the environment, as well as the proprioceptive state and steering actions of the controlled vehicle, and (c) information about the uncertainty inherent to the task. To this end, we discuss Deep Predictive Models and present an implementation using a Bayesian Convolutional LSTM. Experiments in a simple simulation environment show that the approach can learn to predict impending accidents with reasonable accuracy, especially when multiple cameras …", "num_citations": "39\n", "authors": ["1038"]}
{"title": "Robustness-guided temporal logic testing and verification for stochastic cyber-physical systems\n", "abstract": " We present a framework for automatic specification-guided testing for Stochastic Cyber-Physical Systems (SCPS). The framework utilizes the theory of robustness of Metric Temporal Logic (MTL) specifications to quantify how robustly an SCPS satisfies a specification in MTL. The goal of the testing framework is to detect system operating conditions that cause the system to exhibit the worst expected specification robustness. The resulting expected robustness minimization problem is solved using Markov chain Monte Carlo algorithms. This also allows us to use finite-time guarantees, which quantify the quality of the solution after a finite number of simulations. In a Model-Based Design (MBD) process, our framework can be combined with Statistical Model Checking (SMC). Finally, we present a case study on a high fidelity engine model where the goal is to verify the air-to-fuel ratio problem.", "num_citations": "39\n", "authors": ["1038"]}
{"title": "Inverse design of airfoils based on a novel formulation of the ant colony optimization method\n", "abstract": " In the past, Ant Colony Optimization (ACO) methods were used to solve combinatorial optimization problems such as the well-known Traveling Salesman Problem. The present article introduces an extension of the ACO method that is capable of solving optimization problems involving free variables with continuous search spaces. To this purpose, various notions, which are implicit in the ACO techniques, have been modified in order to account for design parameters that may vary continuously between lower and upper user-defined bounds. The intention was to create a tool for a particular class of engineering problems, namely the inverse design of isolated or turbomachinery blade airfoils and to demonstrate its effectiveness. Computational Fluid Dynamics codes are used for the evaluation of candidate solutions.", "num_citations": "39\n", "authors": ["1038"]}
{"title": "Conformance testing as falsification for cyber-physical systems\n", "abstract": " In Model-Based Design of Cyber-Physical Systems (CPS), it is often desirable to develop several models of varying fidelity. Models of different fidelity levels can enable mathematical analysis of the model, control synthesis, faster simulation etc. Furthermore, when (automatically or manually) transitioning from a model to its implementation on an actual computational platform, then again two different versions of the same system are being developed. In all previous cases, it is necessary to define a rigorous notion of conformance between different models and between models and their implementations. This paper argues that conformance should be a measure of distance between systems. Albeit a range of theoretical distance notions exists, a way to compute such distances for industrial size systems and models has not been proposed yet. This paper addresses exactly this problem. A universal notion of conformance as closeness between systems is rigorously defined, and evidence is presented that this implies a number of other application-dependent conformance notions. An algorithm for detecting that two systems are not conformant is then proposed, which uses existing proven tools. A method is also proposed to measure the degree of conformance between two systems. The results are demonstrated on a range of models.", "num_citations": "38\n", "authors": ["1038"]}
{"title": "Towards formal specification visualization for testing and monitoring of cyber-physical systems\n", "abstract": " One of the main challenges in software development for safety-critical Cyber-Physical Systems (CPS) is in achieving a certain level of confidence in the system correctness and robustness. In order to perform formal monitoring, testing and verification of CPS, the fully modular tool STaliro is presented. The tool is designed for seamless integration with the Model Based Design (MBD) process in Matlab/Simulink™. STaliro performs robustness guided Metric Temporal Logic (MTL) testing and monitoring. Since writing specifications in MTL is an error prone task that requires expert temporal logic users, a graphical formalism for the development and visualization of specifications is presented. The article provides an upto-date overview of STaliro. It includes a discussion on the benefits of the fully modular architecture and the challenges encountered in its development.", "num_citations": "37\n", "authors": ["1038"]}
{"title": "Linear hybrid system falsification through local search\n", "abstract": " In this paper, we address the problem of local search for the falsification of hybrid automata with affine dynamics. Namely, given a sequence of locations and a maximum simulation time, we return the trajectory that comes closest to the unsafe set. This problem is formulated as a differentiable optimization problem and solved. The purpose of developing such a local search method is to combine it with high level stochastic optimization algorithms in order to falsify hybrid systems with complex discrete dynamics and high dimensional continuous spaces. Experimental results indicate that the local search procedure improves upon the results of pure stochastic optimization algorithms.", "num_citations": "35\n", "authors": ["1038"]}
{"title": "Towards modeling and analysis of cyber-physical medical systems\n", "abstract": " Contemporary health care systems are increasingly incorporating medical sensors and automatically controlled actuation devices to deliver smart and proactive health services. The embedded devices used in this regard continuously interact with the human body or patient either through sensing of physiological signals or through the execution of critical medical actuation such as drug delivery. Given the high risks in their deployment, patient safety during operation of these Cyber-Physical Medical Systems (CPMSes) has to be guaranteed even before use. This paper proposes CPS-MAS, a cyber-physical medical system modeling and analysis framework for safety verification. However, given the complex nature of interaction of the medical devices with the human body, characterized by non-linearity, transport delay, spatio-temporal effects, and nontrivial aggregation of interaction during networked operation of …", "num_citations": "33\n", "authors": ["1038"]}
{"title": "Computing descent direction of MTL robustness for non-linear systems\n", "abstract": " The automatic analysis of transient properties of nonlinear dynamical systems is a challenging problem. The problem is even more challenging when complex state-space and timing requirements must be satisfied by the system. Such complex requirements can be captured by Metric Temporal Logic (MTL) specifications. The problem of finding system behaviors that do not satisfy an MTL specification is referred to as MTL falsification. This paper presents an approach for improving stochastic MTL falsification methods by performing local search in the set of initial conditions. In particular, MTL robustness quantifies how correct or wrong is a system trajectory with respect to an MTL specification. Positive values indicate satisfaction of the property while negative values indicate falsification. A stochastic falsification method attempts to minimize the system's robustness with respect to the MTL property. Given some arbitrary …", "num_citations": "32\n", "authors": ["1038"]}
{"title": "ARCH-COMP 2019 Category Report: Falsification.\n", "abstract": " This report presents the results from the 2019 friendly competition in the ARCH workshop for the falsification of temporal logic specifications over Cyber-Physical Systems. We describe the organization of the competition and how it differs from previous years. We give background on the participating teams and tools and discuss the selected benchmarks and results. The benchmarks are available on the ARCH website 1, as well as in the competition’s gitlab repository 2. The main outcome of the 2019 competition is a common benchmark repository, and an initial base-line for falsification, with results from multiple tools, which will facilitate comparisons and tracking of the state-of-the-art in falsification in the future.", "num_citations": "30\n", "authors": ["1038"]}
{"title": "VISPEC: A graphical tool for elicitation of MTL requirements\n", "abstract": " One of the main barriers preventing widespread use of formal methods is the elicitation of formal specifications. Formal specifications facilitate the testing and verification process for safety critical robotic systems. However, handling the intricacies of formal languages is difficult and requires a high level of expertise in formal logics that many system developers do not have. In this work, we present a graphical tool designed for the development and visualization of formal specifications by people that do not have training in formal logic. The tool enables users to develop specifications using a graphical formalism which is then automatically translated to Metric Temporal Logic (MTL). In order to evaluate the effectiveness of our tool, we have also designed and conducted a usability study with cohorts from the academic student community and industry. Our results indicate that both groups were able to define formal …", "num_citations": "30\n", "authors": ["1038"]}
{"title": "Approximate solutions for the minimal revision problem of specification automata\n", "abstract": " As robots are being integrated into our daily lives, it becomes necessary to provide guarantees of safe and provably correct operation. Such guarantees can be provided using automata theoretic task and mission planning where the requirements are expressed as temporal logic specifications. However, in real-life scenarios, it is to be expected that not all user task requirements can be realized by the robot. In such cases, the robot must provide feedback to the user on why it cannot accomplish a given task. Moreover, the robot should indicate what tasks it can accomplish which are as “close” as possible to the initial user intent. Unfortunately, the latter problem, which is referred to as minimal specification revision problem, is NP complete. This paper presents an approximation algorithm that can compute good approximations to the minimal revision problem in polynomial time. The experimental study of the algorithm …", "num_citations": "30\n", "authors": ["1038"]}
{"title": "Convergence proofs for simulated annealing falsification of safety properties\n", "abstract": " The problem of falsifying temporal logic properties of hybrid automata can be posed as a minimization problem by utilizing quantitative semantics for temporal logics. Previous work has used a variation of Simulated Annealing (SA) to solve the problem. While SA is known to converge to the global minimum of a continuous objective function over a closed and bounded search space, or when the search space is discrete, there do not exist convergence proofs for the cases addressed in that previous work. Namely, when the objective function is discontinuous, and when the objective is a vector-valued function. In this paper, we derive conditions and we prove convergence of SA to a global minimum in both scenarios. We also consider matters affecting the practical performance of SA.", "num_citations": "29\n", "authors": ["1038"]}
{"title": "Formal requirement debugging for testing and verification of cyber-physical systems\n", "abstract": " A framework for the elicitation and debugging of formal specifications for Cyber-Physical Systems is presented. The elicitation of specifications is handled through a graphical interface. Two debugging algorithms are presented. The first checks for erroneous or incomplete temporal logic specifications without considering the system. The second can be utilized for the analysis of reactive requirements with respect to system test traces. The specification debugging framework is applied on a number of formal specifications collected through a user study. The user study establishes that requirement errors are common and that the debugging framework can resolve many insidious specification errors.", "num_citations": "26\n", "authors": ["1038"]}
{"title": "Metric interval temporal logic specification elicitation and debugging\n", "abstract": " In general, system testing and verification should be conducted with respect to formal specifications. However, the development of formal specifications is a challenging and error prone task, even for experts. This is especially true when considering complex spatio-temporal requirements in real-time embedded systems, mixed-signal circuits, or more generally, software-controlled physical systems. In this work, we present a framework for the elicitation and debugging of formal specifications. The elicitation of formal specifications is handled through a graphical user interface. The debugging algorithm checks inconsistent and wrong specifications. Namely, it detects validity, redundancy and vacuity issues in formal specifications developed in a fragment of Metric Interval Temporal Logic (MITL). The algorithm informs system engineers on any issues in their specifications. This improves the specification elicitation process …", "num_citations": "26\n", "authors": ["1038"]}
{"title": "Arch-comp 2020 category report: Falsification\n", "abstract": " This report presents the results from the 2020 friendly competition in the ARCH workshop for the falsification of temporal logic specifications over Cyber-Physical Systems. We briefly describe the competition settings, which have been inherited from the previous year, give background on the participating teams and tools and discuss the selected benchmarks. The benchmarks are available on the ARCH website 1, as well as in the competition’s gitlab repository 2. In comparison to 2019, we have two new participating tools with novel approaches, and the results show a clear improvement over previous performances on some benchmarks.", "num_citations": "23\n", "authors": ["1038"]}
{"title": "Rapidly-exploring random trees for testing automated vehicles\n", "abstract": " One of the expectations from fully or partially automated vehicles is to never cause an accident and actively avoid dangerous situations. However, an automated vehicle may not be able to avoid all collisions, e.g., collisions caused by other vehicles. Hence, it is important for the system developers to understand the boundary case scenarios where an autonomous vehicle can no longer avoid a collision. In this paper, an automated test generation approach that utilizes Rapidly-exploring Random Trees is presented to explore these boundary scenarios. An important advantage of the approach is the openness of the test scenarios: one can set the road geometry and the number of adversarial objects and let the system search for interesting trajectories and environment parameters. A cost function is proposed which guides the test generation toward almost-avoidable collisions or near-misses.", "num_citations": "21\n", "authors": ["1038"]}
{"title": "Evaluating perception systems for autonomous vehicles using quality temporal logic\n", "abstract": " For reliable situation awareness in autonomous vehicle applications, we need to develop robust and reliable image processing and machine learning algorithms. Currently, there is no general framework for reasoning about the performance of perception systems. This paper introduces Timed Quality Temporal Logic (TQTL) as a formal language for monitoring and testing the performance of object detection and situation awareness algorithms for autonomous vehicle applications. We demonstrate that it is possible to describe interesting properties as TQTL formulas and detect cases where the properties are violated.", "num_citations": "20\n", "authors": ["1038"]}
{"title": "A graphical language for LTL motion and mission planning\n", "abstract": " Linear Temporal Logic (LTL) has recently become a popular high-level specification language for robotic applications. One of the main reasons for the adoption of LTL is that LTL control synthesis algorithms are scalable while providing sufficient expressive power for a range of applications. However, despite the recent progress, one challenge remains. How can a non-expert robot user, who is not a logician, provide mission and motion plans for multiple robots in LTL? In this paper, we propose a graphical specification environment for LTL specifications that utilizes touchscreen technologies. We demonstrate that the graphical interface can express all the properties of interest that have appeared in the literature.", "num_citations": "19\n", "authors": ["1038"]}
{"title": "Worst-case satisfaction of stl specifications using feedforward neural network controllers: a lagrange multipliers approach\n", "abstract": " In this paper, a reinforcement learning approach for designing feedback neural network controllers for nonlinear systems is proposed. Given a Signal Temporal Logic (STL) specification which needs to be satisfied by the system over a set of initial conditions, the neural network parameters are tuned in order to maximize the satisfaction of the STL formula. The framework is based on a max-min formulation of the robustness of the STL formula. The maximization is solved through a Lagrange multipliers method, while the minimization corresponds to a falsification problem. We present our results on a vehicle and a quadrotor model and demonstrate that our approach reduces the training time more than 50 percent compared to the baseline approach.", "num_citations": "18\n", "authors": ["1038"]}
{"title": "ARCH-COMP18 Category Report: Results on the Falsification Benchmarks.\n", "abstract": " This report presents results from the 2018 friendly competition in the ARCH workshop [3] for the falsification of temporal logic specifications over Cyber-Physical Systems category. The results extend those of the competition of the previous year 2017 by including an additional approach to falsification. The benchmarks are available on the ARCH website (cps-vo. org/group/ARCH). In this report, we present results on a powertrain model developed by Toyota Technical Center which contains a complex automatic air-fuel control subsystem [10].", "num_citations": "17\n", "authors": ["1038"]}
{"title": "Falsification of cyber-physical systems with robustness uncertainty quantification through stochastic optimization with adaptive restart\n", "abstract": " This work is in the field of requirements driven search-based test case generation methods for Cyber-Physical Systems (CPS). The basic characteristic of search-based testing methods is that the search process is guided by high level requirements captured in formal logic and, in particular, Signal Temporal Logic (STL). Given a system trajectory, STL specifications can be equipped with quantitative semantics which evaluate the closeness of the given trajectory from violating the requirement. Hence, by searching for trajectories of decreasing value with respect to the specification, a test generation method can be formulated which searches for system behaviors with a closeness to violation value of less than 0. These system behaviors, i.e., trajectories that violate the requirements and yield STL closeness value less than 0, are referred to as falsiping behaviors. In addition, signed distance can be utilized when …", "num_citations": "16\n", "authors": ["1038"]}
{"title": "Sim-ATAV: Simulation-based adversarial testing framework for autonomous vehicles\n", "abstract": " One of the main challenges in testing autonomous driving systems is the presence of machine learning components, such as neural networks, for which formal properties are difficult to establish. We present a simulation-based testing framework that supports methods used to evaluate cyber-physical systems, such as test case generation and automatic falsification. We demonstrate how the framework can be used to evaluate closed-loop properties of autonomous driving system models that include machine learning components.", "num_citations": "16\n", "authors": ["1038"]}
{"title": "Functional gradient descent optimization for automatic test case generation for vehicle controllers\n", "abstract": " A hierarchical framework is proposed for improving the automatic test case generation process for high-fidelity models with long execution times. The framework incorporates related low-fidelity models for which certain properties can be analytically or computationally evaluated with provable guarantees (e.g., gradients of safety or performance metrics). The low-fidelity models drive the test case generation process for the high-fidelity models. The proposed framework is demonstrated on a model of a vehicle with Full Range Adaptive Cruise Control with Collision Avoidance (FRACC), for which it generates more challenging test cases on average compared to test cases generated using Simulated Annealing.", "num_citations": "16\n", "authors": ["1038"]}
{"title": "Hybrid approximate gradient and stochastic descent for falsification of nonlinear systems\n", "abstract": " Studying transient properties of nonlinear systems is an important problem for safety applications. Computationally, it is a very challenging problem to verify that a nonlinear system satisfies a safety specification. Therefore, in many cases, engineers try to solve a related problem, i.e., they try to find a system behavior that does not satisfy a given specification. This problem is called specification falsification. Optimization has been shown to be very effective in providing a practical solution to the falsification problem. In this paper, we provide effective and practical local and global optimization strategies to falsify a smooth nonlinear system of arbitrary complexity.", "num_citations": "16\n", "authors": ["1038"]}
{"title": "Encoding and monitoring responsibility sensitive safety rules for automated vehicles in signal temporal logic\n", "abstract": " As Automated Vehicles (AV) get ready to hit the public roads unsupervised, many practical questions still remain open. For example, there is no commonly acceptable formal definition of what safe driving is. A formal definition of safe driving can be utilized in developing the vehicle behaviors as well as in certification and legal cases. Toward that goal, the Responsibility-Sensitive Safety (RSS) model was developed as a first step toward formalizing safe driving behavior upon which the broader AV community can expand. In this paper, we demonstrate that the RSS model can be encoded in Signal Temporal Logic (STL). Moreover, using the S-TaLiRo tools, we present a case study of monitoring RSS requirements on selected traffic scenarios from CommonRoad. We conclude that monitoring RSS rules encoded in STL is efficient even in heavy traffic scenarios. One interesting observation is that for the selected traffic …", "num_citations": "15\n", "authors": ["1038"]}
{"title": "Vacuity aware falsification for MTL request-response specifications\n", "abstract": " We propose a method to improve the automated test case generation for Metric Temporal Logic (MTL) falsification for Cyber-Physical Systems (CPS). In this work, we focus on request-response MTL specifications. That is, specifications that consist of at least one antecedent and a corresponding consequent. Test case generation is particularly difficult for these specifications since the consequent is only considered if the antecedent is satisfied. Therefore, we propose a method that first targets the antecedent in the specification. We show that our framework can improve upon existing falsification methods on a number of benchmark problems.", "num_citations": "15\n", "authors": ["1038"]}
{"title": "Planning in dynamic environments through temporal logic monitoring\n", "abstract": " We present a framework that enables online planning for robotic systems in dynamic environments. The PLANrm framework presented in this work utilizes the theory of robustness and monitoring of Metric Temporal Logic (MTL) specifications to inspect and modify available plans to both avoid obstacles and satisfy specifications in a dynamic environment. The use of MTL allows the practitioner to set complex event and timing based specifications that need to be satisfied in the execution of the plan. The monitoring algorithm inspects the possible paths in a bounded window and selects and adjusts a path to satisfy the specifications. In this paper, we present initial results on the framework and an extended summary of the algorithmic results. The approach is illustrated using a running example of a car-like model with a number of MTL specifications.", "num_citations": "15\n", "authors": ["1038"]}
{"title": "Discof: Cooperative pathfinding in distributed systems with limited sensing and communication range\n", "abstract": " Cooperative pathfinding is often addressed in one of two ways in the literature. In fully coupled approaches, robots are considered together and the plans for all robots are constructed simultaneously. In decoupled approaches, the plans are constructed only for a subset of robots at a time. While decoupled approaches can be much faster than fully coupled approaches, they are often suboptimal and incomplete. Although there exist a few decoupled approaches that achieve completeness, global information (which makes global coordination possible) is assumed. Global information may not be accessible in distributed robotic systems. In this paper, we provide a window-based approach to cooperative pathfinding with limited sensing and communication range in distributed systems (called DisCoF). In DisCoF, robots are assumed to be fully decoupled initially, and may gradually increase the level of coupling …", "num_citations": "14\n", "authors": ["1038"]}
{"title": "An introduction to multi-valued model checking\n", "abstract": " Nowadays computer systems have become ubiquitous. Most of the resources in the development of such systems, and especially in the fail-safe ones, are allocated into the simulation and verification of their behavior. One such automated method of verification is model checking. Given a mathematical description of the real system and a specification usually in the form of temporal logics, a model checker verifies whether the specification is satisfied on the model of the system. Recently, a multi-valued extension to the classical model checking has been proposed. In this approach both the model of the system and the specification take truth values over lattices with more then just two values. Such an extension enhances the expressive power of temporal logics and allows reasoning under uncertainty. Some of the applications that can take advantage of the multi-valued model checking are abstraction techniques, reasoning about conflicting viewpoints and temporal logic query checking. In this paper, we present three different approaches to the multi-valued model checking problem. The first is a reduction from multi-valued CTL* to CTL*, the second a multi-valued CTL symbolic model checking algorithm and, finally, a reduction technique from multi-valued μ-calculus to the classical one.", "num_citations": "14\n", "authors": ["1038"]}
{"title": "Specifying and evaluating quality metrics for vision-based perception systems\n", "abstract": " Robust perception algorithms are a vital ingredient for autonomous systems such as self-driving vehicles. Checking the correctness of perception algorithms such as those based on deep convolutional neural networks (CNN) is a formidable challenge problem. In this paper, we suggest the use of Timed Quality Temporal Logic (TQTL) as a formal language to express desirable spatio-temporal properties of a perception algorithm processing a video. While perception algorithms are traditionally tested by comparing their performance to ground truth labels, we show how TQTL can be a useful tool to determine quality of perception, and offers an alternative metric that can give useful information, even in the absence of ground truth labels. We demonstrate TQTL monitoring on two popular CNNs: YOLO and SqueezeDet, and give a comparative study of the results obtained for each architecture.", "num_citations": "12\n", "authors": ["1038"]}
{"title": "Falsification of temporal logic requirements using gradient based local search in space and time\n", "abstract": " We study the problem of computing input signals that produce system behaviors that falsify requirements written in temporal logic. We provide a method to automatically search for falsifying time varying uncertain inputs for nonlinear and possibly hybrid systems. The input to the system is parametrized using piecewise constant signals with varying switch times. By applying small perturbations to the system input in space and time, and by using gradient descent approach, we try to converge to the worst local system behavior. The experimental results on non-trivial benchmarks demonstrate that this local search can significantly improve the rate of finding falsifying counterexamples.", "num_citations": "12\n", "authors": ["1038"]}
{"title": "Using S-TaLiRo on industrial size automotive models\n", "abstract": " In Model Based Development (MBD) of embedded systems, it is often desirable to verify or falsify certain formal specifications. In some cases it is also desirable to find the range of specification parameters for which the specification does not hold on the system. We illustrate these methods on a challenge problem from the automotive industry on a high-fidelity, industrial scale engine model.", "num_citations": "12\n", "authors": ["1038"]}
{"title": "Modeling concurrency and reconfiguration in vehicular systems: A π-calculus approach\n", "abstract": " As autonomous or semi-autonomous vehicles are deployed on the roads, they will have to eventually start communicating with each other in order to achieve increased efficiency and safety. Current approaches in the control of collaborative vehicles primarily consider homogeneous simplified vehicle dynamics and usually ignore any communication issues. This raises an important question of how systems without the aforementioned limiting assumptions can be modeled, analyzed and certified for safe operation by both industry and governmental agencies. In this work, we propose a modeling framework where communication and system reconfiguration is modeled through π-calculus expressions while the closed-loop control systems are modeled through hybrid automata. We demonstrate how the framework can be utilized for modeling and simulation of platooning behaviors of heterogeneous vehicles.", "num_citations": "11\n", "authors": ["1038"]}
{"title": "Automatic parallelization of Simulink models for multi-core architectures\n", "abstract": " This paper addresses the problem of parallelizing existing single-rate Simulink models for embedded control applications on multi-core architectures considering communication cost between blocks on different CPU cores. Utilizing the block diagram of the Simulink model, we derive the dependency graph between the different blocks. In order to solve the scheduling problem, we describe a Mixed Integer Linear Programming (MILP) formulation for optimally mapping the Simulink blocks to different CPU cores. Since the number of variables and constraints for MILP solver grows exponentially when model size increases, solving this problem in a reasonable time becomes harder. For addressing this issue, we introduce a set of techniques for reducing the number of constraints in the MILP formulation. By using the proposed techniques, the MILP solver finds solutions that are closer to the optimal solution within a given …", "num_citations": "11\n", "authors": ["1038"]}
{"title": "Robustness of temporal logic specifications for finite state sequences in metric spaces\n", "abstract": " In this paper, we consider the robust interpretation of metric temporal logic (MTL) formulas over timed sequences of states. For systems whose states are equipped with nontrivial metrics, such as continuous, hybrid, or general metric transition systems, robustness is not only natural, but also a critical measure of system performance. In this paper, we define robust, multi-valued semantics for MTL formulas, which capture not only the usual Boolean satisfiability of the formula, but also topological information regarding the distance, ε, from unsatisfiability. We prove that any other timed trace which remains ε-close to the initial one also satisfies the same MTL specification with the usual Boolean semantics. We derive a computational procedure for determining the robustness degree ε of the specification with respect to a given finite timed trace. Our approach can be used for robust system simulation and testing, as well as form the basis for simulation-based verification.", "num_citations": "11\n", "authors": ["1038"]}
{"title": "ARCH-COMP17 Category Report: Preliminary Results on the Falsification Benchmarks.\n", "abstract": " This report presents some preliminary base results from the 2017 friendly competition in the ARCH workshop [2] for the falsification of temporal logic specifications over Cyber-Physical Systems category. The benchmarks are available on the ARCH website (cps-vo. org/group/ARCH). In this report, we present results on a powertrain model developed by Toyota Technical Center which contains a complex automatic air-fuel control subsystem [7].", "num_citations": "10\n", "authors": ["1038"]}
{"title": "Hybrid modeling and experimental cooperative control of multiple unammned aerial vehicles\n", "abstract": " Recent years have seen rapidly growing interest in the development of networks of multiple unmanned aerial vehicles (UAVs), as aerial sensor networks for the purpose of coordinated monitoring, surveillance, and rapid emergency response. This has triggered a great deal of research in higher levels of planning and control, including collaborative sensing and exploration, synchronized motion planning, and formation or cooperative control. In this paper, we describe our recently developed experimental testbed at the University of Pennsylvania, which consists of multiple, fixed-wing UAVs. We describe the system architecture, software and hardware components, and overall system integration. We then derive high-fidelity models that are validated with hardware-in-the-loop simulations and actual experiments. Our models are hybrid, capturing not only the physical dynamics of the aircraft, but also the mode switching logic that supervises lower level controllers. We conclude with a description of cooperative control experiments involving two fixed-wing UAVs.", "num_citations": "10\n", "authors": ["1038"]}
{"title": "An efficient algorithm for monitoring practical TPTL specifications\n", "abstract": " We provide a dynamic programming algorithm for the monitoring of a fragment of Timed Propositional Temporal Logic (TPTL) specifications. This fragment of TPTL, which is more expressive than Metric Temporal Logic, is characterized by independent time variables which enable the elicitation of complex real-time requirements. For this fragment, we provide an efficient polynomial time algorithm for off-line monitoring of finite traces. Finally, we provide experimental results on a prototype implementation of our tool in order to demonstrate the feasibility of using our tool in practical applications.", "num_citations": "9\n", "authors": ["1038"]}
{"title": "Traffic light status detection using movement patterns of vehicles\n", "abstract": " Vision-based methods for detecting the status of traffic lights used in autonomous vehicles may be unreliable due to occluded views, poor lighting conditions, or a dependence on unavailable high-precision meta-data, which is troublesome in such a safety-critical application. This paper proposes a complementary detection approach based on an entirely new source of information: the movement patterns of other nearby vehicles. This approach is robust to traditional sources of error, and may serve as a viable supplemental detection method. Several different classification models are presented for inferring traffic light status based on these patterns. Their performance is evaluated over real and simulated data sets, resulting in up to 97% accuracy in each set.", "num_citations": "9\n", "authors": ["1038"]}
{"title": "Revision of specification automata under quantitative preferences\n", "abstract": " We study the problem of revising specifications with preferences for automata based control synthesis problems. In this class of revision problems, the user provides a numerical ranking of the desirability of the subgoals in their specifications. When the specification cannot be satisfied on the system, then our algorithms automatically revise the specification so that the least desirable user goals are removed from the specification. We propose two different versions of the revision problem with preferences. In the first version, the algorithm returns an exact solution while in the second version the algorithm is an approximation algorithm with non-constant approximation ratio. Finally, we demonstrate the scalability of our algorithms and we experimentally study the approximation ratio of the approximation algorithm on random problem instances.", "num_citations": "9\n", "authors": ["1038"]}
{"title": "Hybrid modeling and experimental cooperative control of multiple unmanned aerial vehicles\n", "abstract": " Recent years have seen rapidly growing interest in the development of networks of multiple unmanned aerial vehicles (UAVs), as aerial sensor networks for the purpose of coordinated monitoring, surveillance, and rapid emergency response. This has triggered a great deal of research in higher levels of planning and control, including collaborative sensing and exploration, synchronized motion planning, and formation or cooperative control. In this paper, we describe our recently developed experimental testbed at the University of Pennsylvania, which consists of multiple, fixed-wing UAVs. We describe the system architecture, software and hardware components, and overall system integration. We then derive high-fidelity models that are validated with hardware-in-the-loop simulations and actual experiments. Our models are hybrid, capturing not only the physical dynamics of the aircraft, but also the mode switching …", "num_citations": "9\n", "authors": ["1038"]}
{"title": "Automotive control design bug-finding with the S-TaLiRo tool\n", "abstract": " One of the important challenges in the Model Based Development (MBD) of automotive systems is the problem of verifying functional system properties. In its general form, the verification problem is undecidable due to the interplay between continuous and discrete system dynamics [1]. In this tutorial, we present the bounded-time temporal logic testing and verification problem for Cyber-Physical Systems (CPS) [2]. Temporal logics [3] can formally capture both state-space and real-time system requirements. For example, temporal logics can mathematically state requirements like “whenever the system switches to first gear, then it should not switch to second gear within 2.5 sec”. Our approach in tackling this challenging problem is to convert the verification problem into an optimization problem through a notion of robustness for temporal logics [4]. The robust interpretation of a temporal logic specification over a system …", "num_citations": "8\n", "authors": ["1038"]}
{"title": "Extended LTLvis motion planning interface\n", "abstract": " This paper introduces a graphical interface for Linear Temporal Logic (LTL) specifications for mobile robots. It is a sketch based interface built on the Android platform which makes the LTL control interface more friendly to non-expert users. By predefining a set of areas of interest, this interface can quickly and efficiently create plans that satisfy extended plan goals in LTL. The interface can also allow users to customize the paths for this plan by sketching a set of reference trajectories. Given the custom paths by the user, the LTL specification and the environment, the interface generates a plan balancing the customized paths and the LTL specifications. We also show experimental results with the implemented interface.", "num_citations": "7\n", "authors": ["1038"]}
{"title": "Minimal specification revision for weighted transition systems\n", "abstract": " In this paper, we study the problem of revising Linear Temporal Logic (LTL) formulas that capture specifications for optimal planning over weighted transition systems. Namely, it is assumed that the model of the system is a weighted finite state transition system. The LTL specification captures the system requirements which must be satisfied by a plan which costs less than a certain cost budget. If the cost bounds cannot be satisfied with the initial specification, then it is desirable to return to the user a specification that can be satisfied on the system within the desired cost budget. We prove that the specification revision problem for automata-based optimal planning is NP-complete. In order to provide exact solutions to the problem, we present an Integer Linear Program (ILP) and a Mixed-Integer Linear Program (MILP) formulation for different versions of the problem. Finally, we indicate that a Linear Program (LP …", "num_citations": "7\n", "authors": ["1038"]}
{"title": "Dynamic programming algorithm for computing temporal logic robustness\n", "abstract": " In this thesis we deal with the problem of temporal logic robustness estimation. We present a dynamic programming algorithm for the robust estimation problem of Metric Temporal Logic (MTL) formulas regarding a finite trace of time stated sequence. This algorithm not only tests if the MTL specification is satisfied by the given input which is a finite system trajectory, but also quantifies to what extend does the sequence satisfies or violates the MTL specification. The implementation of the algorithm is the DP-TALIRO toolbox for MATLAB. Currently it is used as the temporal logic robust computing engine of S-TALIRO which is a tool for MATLAB searching for trajectories of minimal robustness in Simulink/Stateflow. DP-TALIRO is expected to have near linear running time and constant memory requirement depending on the structure of the MTL formula. DP-TALIRO toolbox also integrates new features not supported in its ancestor FW-TALIRO such as parameter replacement, most related iteration and most related predicate. A derivative of DP-TALIRO which is DP-T-TALIRO is also addressed in this thesis which applies dynamic programming algorithm for time robustness computation. We test the running time of DP-TALIRO and compare it with FW-TALIRO. Finally, we present an application where DP-TALIRO is used as the robustness computation core of S-TALIRO for a parameter estimation problem.", "num_citations": "7\n", "authors": ["1038"]}
{"title": "Rapidly-exploring random trees-based test generation for autonomous vehicles\n", "abstract": " Autonomous vehicles are in an intensive research and development stage, and the organizations developing these systems are targeting to deploy them on public roads in a very near future. One of the expectations from fully-automated vehicles is never to cause an accident. However, an automated vehicle may not be able to avoid all collisions, e.g., the collisions caused by other road occupants. Hence, it is important for the system designers to understand the boundary case scenarios where an autonomous vehicle can no longer avoid a collision. In this paper, an automated test generation approach that utilizes Rapidly-exploring Random Trees is presented. A comparison of the proposed approach with an optimization-guided falsification approach from the literature is provided. Furthermore, a cost function that guides the test generation toward almost-avoidable collisions or near-misses is proposed.", "num_citations": "6\n", "authors": ["1038"]}
{"title": "Optimal multi-valued ltl planning for systems with access right levels\n", "abstract": " We propose a method for optimal Linear Temporal Logic (LTL) planning under incomplete or uncertain knowledge with a minimum required truth degree. In order to introduce modeling flexibility to the framework, we propose semantics over ranges of truth values and operators that reason over such ranges of truth values. We show that the resulting optimal planning problem can be solved efficiently. In terms of application, we show how this method can be used for motion planning in autonomous driving cars for road networks with multiple degrees of accessibility.", "num_citations": "6\n", "authors": ["1038"]}
{"title": "Towards composition of conformant systems\n", "abstract": " Motivated by the Model-Based Design process for Cyber-Physical Systems, we consider issues in conformance testing of systems. Conformance is a quantitative notion of similarity between the output trajectories of systems, which considers both temporal and spatial aspects of the outputs. Previous work developed algorithms for computing the conformance degree between two systems, and demonstrated how formal verification results for one system can be re-used for a system that is conformant to it. In this paper, we study the relation between conformance and a generalized approximate simulation relation for the class of Open Metric Transition Systems (OMTS). This allows us to prove a small-gain theorem for OMTS, which gives sufficient conditions under which the feedback interconnection of systems respects the conformance relation, thus allowing the building of more complex systems from conformant components.", "num_citations": "6\n", "authors": ["1038"]}
{"title": "Tltk: A toolbox for parallel robustness computation of temporal logic specifications\n", "abstract": " This paper presents the Temporal Logic Toolkit (TLTk), a modular falsification tool for signal temporal logic specifications developed in Python and C. At the core of the tool, an algorithm for robustness computation is utilized that supports multi-threaded CPU/GPU computation. The tool enables memory-efficient, parallel, robustness computation of system traces. In addition, the python implementation enables the addition and modification of temporal operators for application-specific scenarios. The performance of the tool is evaluated against state-of-the-art robustness computation engines DP-TaLiRo and Breach on a number of benchmark problems.", "num_citations": "5\n", "authors": ["1038"]}
{"title": "Search-based test-case generation by monitoring responsibility safety rules\n", "abstract": " The safety of Automated Vehicles (AV) as Cyber-Physical Systems (CPS) depends on the safety of their consisting modules (software and hardware) and their rigorous integration. Deep Learning is one of the dominant techniques used for perception, prediction and decision making in AVs. The accuracy of predictions and decision-making is highly dependant on the tests used for training their underlying deep-learning. In this work, we propose a method for screening and classifying simulation-based driving test data to be used for training and testing controllers. Our method is based on monitoring and falsification techniques, which lead to a systematic automated procedure for generating and selecting qualified test data. We used Responsibility Sensitive Safety (RSS) rules as our qualifier specifications to filter out the random tests that do not satisfy the RSS assumptions. Therefore, the remaining tests cover driving …", "num_citations": "5\n", "authors": ["1038"]}
{"title": "Task scheduling with nonlinear costs using SMT solvers\n", "abstract": " There are many natural and engineering processes which require scheduling under nonlinear cost functions. Current tools and theories only support scheduling under linear cost functions. In this paper, we model the scheduling problem under nonlinear costs using Priced Timed Automata (PTA). We also present a translation from PTA to Satisfiability Modulo Theory (SMT) formulas whose models correspond to schedules which satisfy the scheduling constraints under a given cost bound. We present a case-study for batch scheduling in bio-manufacturing. We compare our results with UPPAAL CORA when the costs are linear. We show that the SMT based solution outperforms the UPPAAL CORA solver when the length of the schedule is bounded.", "num_citations": "5\n", "authors": ["1038"]}
{"title": "Continuous simulation optimization with model mismatch using Gaussian process regression\n", "abstract": " Multi-fidelity simulation optimization is an emerging area looking at the use of low-fidelity (computationally cheap but inaccurate) models to optimize high-fidelity (expensive and accurate) models. In this context, low-fidelity models exhibit a mismatch to high-fidelity models whose values can be point-wise obtained by querying an expensive simulator. Herein, an efficient multi-fidelity algorithm is proposed for continuous global optimization. The algorithm is made up of an additive model that consolidates low-fidelity and bias (mismatch) predictions. Two sampling criteria with different use of the cumulated high and low-fidelity information are introduced as well as a cheap certificate guiding the decision on whether to sample from the expensive simulator. The performance of proposed algorithms is evaluated using a state of the art stochastic search benchmark algorithm. The results show that the proposed methods can …", "num_citations": "5\n", "authors": ["1038"]}
{"title": "Local descent for temporal logic falsification of cyber-physical systems\n", "abstract": " One way to analyze Cyber-Physical Systems is by modeling them as hybrid automata. Since reachability analysis for hybrid nonlinear automata is a very challenging and computationally expensive problem, in practice, engineers try to solve the requirements falsification problem. In one method, the falsification problem is solved by minimizing a robustness metric induced by the requirements. This optimization problem is usually a non-convex non-smooth problem that requires heuristic and analytical guidance to be solved. In this paper, functional gradient descent for hybrid systems is utilized for locally decreasing the robustness metric. The local descent method is combined with Simulated Annealing as a global optimization method to search for unsafe behaviors.", "num_citations": "5\n", "authors": ["1038"]}
{"title": "DisCoF+: Asynchronous DisCoF with flexible decoupling for cooperative pathfinding in distributed systems\n", "abstract": " In our prior work, we outlined an approach, named DisCoF, for cooperative pathfinding in distributed systems with limited sensing and communication range. Contrasting to prior works on cooperative pathfinding with completeness guarantees which assume access to global communication and coordination, DisCoF does not make this assumption. The implication is that at any given time in DisCoF, the robots may not all be aware of each other which is often the case in distributed systems. As a result, DisCoF represents an inherently online approach since coordination can only be realized in an opportunistic manner between robots that are within each other's sensing and communication range. However, there are a few assumptions made in DisCoF to facilitate a formal analysis which must be removed to work with distributed multi-robot platforms. In this paper, we present DisCoF +  which extends DisCoF by …", "num_citations": "5\n", "authors": ["1038"]}
{"title": "A user guide for TaLiRo\n", "abstract": " TaLiRo (TemporAl LogIc RObustness) is a tool for the computation of the robustness of a propositional temporal logic specification with respect to a discrete time signal. This document provides a brief introduction to Linear and Metric Temporal Logics, describes the usage of the toolbox and concludes with several examples. This guide refers to version v0. 1 of TaLiRo.", "num_citations": "5\n", "authors": ["1038"]}
{"title": "Risk-bounded control using stochastic barrier functions\n", "abstract": " In this letter, we design real-time controllers that react to uncertainties with stochastic characteristics and bound the probability of a failure in finite-time to a given desired value. Stochastic control barrier functions are used to derive sufficient conditions on the control input that bound the probability that the states of the system enter an unsafe region within a finite time. These conditions are combined with reachability conditions and used in an optimization problem to find the required control actions that lead the system to a goal set. We illustrate our theoretical development using a simulation of a lane-changing scenario in a highway with dense traffic.", "num_citations": "4\n", "authors": ["1038"]}
{"title": "Linear hybrid system falsification with descent\n", "abstract": " In this paper, we address the problem of local search for the falsification of hybrid automata with affine dynamics. Namely, if we are given a sequence of locations and a maximum simulation time, we return the trajectory that comes the closest to the unsafe set. In order to solve this problem, we formulate it as a differentiable optimization problem which we solve using Sequential Quadratic Programming. The purpose of developing such a local search method is to combine it with high level stochastic optimization algorithms in order to falsify hybrid systems with complex discrete dynamics and high dimensional continuous spaces. Experimental results indicate that indeed the local search procedure improves upon the results of pure stochastic optimization algorithms.", "num_citations": "4\n", "authors": ["1038"]}
{"title": "Safe Navigation in Human Occupied Environments Using Sampling and Control Barrier Functions\n", "abstract": " Sampling-based methods such as Rapidly-exploring Random Trees (RRTs) have been widely used for generating motion paths for autonomous mobile systems. In this work, we extend time-based RRTs with Control Barrier Functions (CBFs) to generate, safe motion plans in dynamic environments with many pedestrians. Our framework is based upon a human motion prediction model which is well suited for indoor narrow environments. We demonstrate our approach on a high-fidelity model of the Toyota Human Support Robot navigating in narrow corridors. We show in three scenarios that our proposed online method can navigate safely in the presence of moving agents with unknown dynamics.", "num_citations": "3\n", "authors": ["1038"]}
{"title": "Automatic parallelization of multirate block diagrams of control systems on multicore platforms\n", "abstract": " This article addresses the problem of parallelizing model block diagrams for real-time embedded applications on multicore architectures. We describe a Mixed Integer Linear Programming formulation for finding a feasible mapping of the blocks to different CPU cores. For single-rate models, we use an objective function that minimizes the overall worst-case execution time. We introduce a set of heuristics to solve the problem for large models in a reasonable time. For multirate models, we solve the feasibility problem for finding a valid mapping. We study the scalability and efficiency of our approach with synthetic benchmarks and an engine controller from Toyota.", "num_citations": "3\n", "authors": ["1038"]}
{"title": "Formal requirement elicitation and debugging for testing and verification of cyber-physical systems\n", "abstract": " A framework for the elicitation and debugging of formal specifications for Cyber-Physical Systems is presented. The elicitation of specifications is handled through a graphical interface. Two debugging algorithms are presented. The first checks for erroneous or incomplete temporal logic specifications without considering the system. The second can be utilized for the analysis of reactive requirements with respect to system test traces. The specification debugging framework is applied on a number of formal specifications collected through a user study. The user study establishes that requirement errors are common and that the debugging framework can resolve many insidious specification errors.", "num_citations": "3\n", "authors": ["1038"]}
{"title": "Linear hybrid system falsification through descent\n", "abstract": " In this paper, we address the problem of local search for the falsification of hybrid automata with affine dynamics. Namely, if we are given a sequence of locations and a maximum simulation time, we return the trajectory that comes the closest to the unsafe set. In order to solve this problem, we formulate it as a differentiable optimization problem which we solve using Sequential Quadratic Programming. The purpose of developing such a local search method is to combine it with high level stochastic optimization algorithms in order to falsify hybrid systems with complex discrete dynamics and high dimensional continuous spaces. Experimental results indicate that indeed the local search procedure improves upon the results of pure stochastic optimization algorithms.", "num_citations": "3\n", "authors": ["1038"]}
{"title": "Mtl robust testing and verification for lpv systems\n", "abstract": " This paper deals with the robust metric temporal logic (MTL) testing and verification of linear systems with parametric uncertainties. This is a very general class of systems that includes not only linear time invariant (LTI) systems with unknown constant parameters, but also linear time varying (LTV) systems and certain classes of nonlinear systems through abstraction. The two main tools for the solution of this problem are the approximate bisimulation relations and a notion of robustness for temporal logic formulas.", "num_citations": "3\n", "authors": ["1038"]}
{"title": "DEEPCRASHTEST: Turning Dashcam Videos into Virtual Crash Tests for Automated Driving Systems\n", "abstract": " The goal of this paper is to generate simulations with real-world collision scenarios for training and testing autonomous vehicles. We use numerous dashcam crash videos uploaded on the internet to extract valuable collision data and recreate the crash scenarios in a simulator. We tackle the problem of extracting 3D vehicle trajectories from videos recorded by an unknown and uncalibrated monocular camera source using a modular approach. A working architecture and demonstration videos along with the open-source implementation are provided with the paper.", "num_citations": "2\n", "authors": ["1038"]}
{"title": "Model Checking Clinical Decision Support Systems Using SMT\n", "abstract": " Individual clinical Knowledge Artifacts (KA) are designed to be used in Clinical Decision Support (CDS) systems at the point of care for delivery of safe, evidence-based care in modern healthcare systems. For formal authoring of a KA, syntax verification and validation is guaranteed by the grammar. However, there are no methods for semantic verification. Any semantic fallacy may lead to rejection of the outcomes by care providers. As a first step toward solving this problem, we present a framework for translating the logical segments of KAs into Satisfiability Modulo Theory (SMT) models. We present the effectiveness and efficiency of our work by automatically translating the logic fragment of publicly available KAs and verifying them using Z3 SMT solver.", "num_citations": "2\n", "authors": ["1038"]}
{"title": "Temporal logic control under incomplete or conflicting information\n", "abstract": " Temporal logic control methods have provided a viable path towards solving the single- and multi-robot path planning, control and coordination problems from high level formal requirements. In the existing frameworks, the prevalent assumption is that there is a single stakeholder with full or partial knowledge of the environment or the system. However, this assumption may not be valid in both off-line and on-line temporal logic control problems. That is, multiple stakeholders and inaccurate sources of information may produce a self-contradictory model of the world or the system. Classical control synthesis methods cannot handle non-consistent model environments even though such inconsistencies may not affect the control synthesis problem for a given formal requirement. In this work, we show how such problems can be circumvented by utilizing multi-valued temporal logics and system models.", "num_citations": "2\n", "authors": ["1038"]}
{"title": "Temporal logic robustness guided testing for cyber-physical systems\n", "abstract": " Embodiments of model-based system design with model verification are disclosed. An embodiment includes receiving a model for a system and at least one specification for the system. In some embodiments, the system determines at least one of a minimum expected robustness value and a maximum expected robustness value for a region of a search space of the model with respect to the at least one specification. The model may be modified based on the determined minimum or maximum expected robust ness value.", "num_citations": "2\n", "authors": ["1038"]}
{"title": "Proceedings of the 19th International Conference on Hybrid Systems: Computation and Control, HSCC 2016, Vienna, Austria, April 12-14, 2016\n", "abstract": " Proceedings of the 19th International Conference on Hybrid Systems: Computation and Control, HSCC 2016, Vienna, Austria, April 12-14, 2016 - Archive ouverte HAL Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-01371898, version 1 Direction d'ouvrage, Proceedings, Dossier Proceedings of the 19th International Conference on Hybrid Systems: Computation and Control, HSCC 2016, Vienna, Austria, April 12-14, 2016 Alessandro Abate 1, 2 Georgios E. Fainekos 3 Détails 1 Department of Computer …", "num_citations": "2\n", "authors": ["1038"]}
{"title": "Querying parametric temporal logic properties in model based design\n", "abstract": " One of the advantages of adopting the Model Based Development (MBD) process is that it enables testing and verification at early stages of development. However, it is often desirable to not only verify/falsify certain formal system specifications, but also to automatically explore the properties that the system satisfies. In this work, we present a framework that enables property exploration for Cyber-Physical Systems. Namely, given a parametric specification with multiple parameters, our solution can automatically infer the ranges of parameters for which the property holds/does not hold on the system. In this paper, we consider parametric specifications in Metric Temporal Logic (MTL). Using robust semantics for MTL, the parameter estimation problem can be converted into a Pareto optimization problem for which we can provide an approximate solution by utilizing stochastic optimization methods. We include solutions and algorithms for the exploration and visualization of multi-parameter specifications. The framework is demonstrated on an industrial size, highfidelity engine model and examples from the related literature.", "num_citations": "2\n", "authors": ["1038"]}
{"title": "Work-in-progress: towards assurance case evidence generation through search based testing\n", "abstract": " Requirements-driven search-based testing (SBT), also known as falsification, has proven to be a practical and effective method for discovering erroneous behaviors in Cyber-Physical Systems. However, SBT techniques do not provide guarantees on correctness if no falsifying behavior is found within the test budget. Hence, the applicability of SBT methods for evidence generation supporting assurance cases is limited. In this work, we make progress towards developing finite-time guarantees for SBT techniques with associated confidence metrics. We demonstrate the applicability of our approach to the F16 GCAS benchmark challenge.", "num_citations": "1\n", "authors": ["1038"]}
{"title": "Efficient optimization-based falsification of cyber-physical systems with multiple conjunctive requirements\n", "abstract": " Optimization-based falsification, or search-based testing, is a method of automatic test generation for Cyber-Physical System (CPS) safety evaluation. CPS safety evaluation is guided by high level system requirements that are expressed in Signal Temporal Logic (STL). Trajectories from executed CPS simulations are evaluated against STL requirements using satisfaction robustness as a quantitative metric. In particular, robustness is the distance metric between the simulated system trajectory, associated to a specific input, and the known unsafe set, i.e., regions of the search space that violate the requirements. Identification of violations can be formulated as an optimization problem, where inputs that minimize the robustness function are of interest. In fact, an input falsifies a requirement if the associated robustness is negative. In this work, specifically, we consider the case where multiple requirements determine the …", "num_citations": "1\n", "authors": ["1038"]}
{"title": "Mission Planning for Multiple Vehicles with Temporal Specifications using UxAS\n", "abstract": " In this paper, we present extensions to Unmanned Systems Autonomy Services (UxAS) to handle mission specifications that require a synchronization of task execution. UxAS uses Process Algebra (PA) as a formal language to specify mission requirements for unmanned aerial vehicle (UAV) operations. However, the current implementation of PA in UxAS utilizes assigned semantics which does not guarantee the order of task completion and is unable to provide a mission planning required vehicle-synchronization. To enable the capability of UxAS in operating synchronized mission specifications, we introduce a notion of Synchronized Process Algebra (SPA) which extends PA by adding a synchronized composition operator to the syntax of PA. Such an operator allows us to specify the task’s duration and enforce the next task is executed after the previous one has terminated. Moreover, we provide a new service in …", "num_citations": "1\n", "authors": ["1038"]}
{"title": "MITL specification debugging for monitoring of cyber-physical systems\n", "abstract": " •\" A software error may prevent the transmission from downshifting, such as shifting from 5th to 4th gear when coasting,\" said NHTSA in its recalls summary of the problem.\" This may result in decreased engine RPMs and possible engine stall, increasing the risk of a crash.\"•… the software that “allows the ECU to establish a ‘handshake’with the engine is in error. The ECU monitors certain driving conditions, and when the engine is found to be out of tolerance, the software picks up an anomaly. When this happens, the ECU triggers a fault code. As the ECU tries to find an optimal driving condition outside its prescribed tolerances, a rough idle or stalling situation ensues.”•… to update the software that controls the hybrid electric motor. Under certain circumstances, it is possible, according to the company,\"... for the electric motor to rotate in the direction opposite to that selected by the transmission.“• If the fault occurs, cruise control can only be disabled by turning of the ignition while drivingwhich would mean a loss of some control and in many cars also disables power steering. Braking or pressing the cancel button will not work.", "num_citations": "1\n", "authors": ["1038"]}
{"title": "Pareto front exploration for parametric temporal logic specifications of cyber-physical systems\n", "abstract": " Temporal Logic Verification Using Simulation Page 1 1 Lab CPS School of Computing, Informatics and Decision System Engineering Arizona State University  bhoxha at asu edu  http://www.public.asu.edu/~bhoxha Bardh Hoxha and Georgios Fainekos Pareto Front Exploration for Parametric Temporal Logic Specifications of Cyber-Physical Systems 1st Workshop on Monitoring and Testing of Cyber-Physical Systems Vienna, Austria – April 2016 – CPS Week Page 2 2 Lab CPS Parameter Mining System Σ x 0 ∈X 0 u ∈U y=Δ(x 0 ,u) Page 3 3 Lab CPS Parameter Mining What is the shortest time that the engine speed can exceed 3200RPM? System Σ x 0 ∈X 0 u ∈U y=Δ(x 0 ,u) Page 4 4 Lab CPS Parameter Mining What is the shortest time that the engine speed can exceed 3200RPM? System Σ x 0 ∈X 0 u ∈U y=Δ(x", "num_citations": "1\n", "authors": ["1038"]}
{"title": "Computing schedules for time-triggered control using genetic algorithms\n", "abstract": " In this work, we study the optimal scheduling problem for embedded control systems. Given a number of numerical computation tasks that must be executed on an embedded computer, the goal is to find a periodic schedule that minimizes the error of the implementation with respect to the ideal system. In this paper, we pose two open problems: the decidability of the optimal scheduling problem for timed-triggered controllers (OSTTC) and the time complexity of the corresponding bounded version of the problem. We conjecture that the former is undecidable and that the latter is NP-Complete. In view of the previous conjectures, we present a Genetic Algorithm (GA) for the OSTTC problem. Initial experimental results of GA-OSTTC are very promising when compared to random search and exhaustive bounded search.", "num_citations": "1\n", "authors": ["1038"]}