{"title": "Technology pillars in the architecture of future 5G mobile networks: NFV, MEC and SDN\n", "abstract": " This paper analyzes current standardization situation of 5G and the role network softwarization plays in order to address the challenges the new generation of mobile networks must face. This paper surveys recent documentation from the main stakeholders to pick out the use cases, scenarios and emerging vertical sectors that will be enabled by 5G technologies, and to identify future high-level service requirements. Driven by those service requirements 5G systems will support diverse radio access technology scenarios, meet end-to-end user experienced requirements and provide capability of flexible network deployment and efficient operations. Then, based on the identified requirements, the paper overviews the main 5G technology trends and design principles to address them. In particular, the paper emphasizes the role played by three main technologies, namely SDN, NFV and MEC, and analyzes the main …", "num_citations": "167\n", "authors": ["1938"]}
{"title": "T-NOVA: A marketplace for virtualized network functions\n", "abstract": " Network Functions Virtualization (NFV) is a concept, which has attracted significant attention as a promising approach towards the virtualization/“softwarisation” of network infrastructures. With the aim of promoting NFV, this paper outlines an integrated architecture, designed and developed within the context of the EU FP7 T-NOVA project, which allows network operators not only to deploy virtualized Network Functions (NFs) for their own needs, but also to offer them to their customers, as value-added services (Network Functions as-a-Service, NFaaS). Virtual network appliances (gateways, proxies, firewalls, transcoders, analyzers etc.) can be provided on-demand as-a-Service, eliminating the need to acquire, install and maintain specialized hardware at customers' premises. A “NFV Marketplace” is also introduced, where network services and functions created by a variety of developers can be published, acquired …", "num_citations": "117\n", "authors": ["1938"]}
{"title": "Enhancing VNF performance by exploiting SR-IOV and DPDK packet processing acceleration\n", "abstract": " The primary goal of Network Function Virtualization (NFV) is the migration of physical network functions to software versions running on virtual machines (VM) in cloud computing environments. Rapid developments in virtualization technologies have made high-speed network connections and line rate packet processing viable in virtualized infrastructure environments. Deep Packet Inspection (DPI) of network traffic in the form of a computational intensive virtualized network function (VNF) was selected as a representative use-case. The DPI use case was used, to demonstrate the benefits of using SR-IOV enabled devices with DPDK to support performant Virtual Network Function (VNF) deployments. Performance evaluation of VNF versions using LibPCAP, SR-IOV and DPDK have been carried out. The results demonstrate that significantly higher packet throughput performance can be achieved when using SR-IOV …", "num_citations": "60\n", "authors": ["1938"]}
{"title": "T-nova: An open-source mano stack for nfv infrastructures\n", "abstract": " One of the primary challenges associated with network functions virtualization (NFV) is the automated management of the service lifecycle. In this paper, we present a full software-based management and orchestration (MANO) stack which operates with OpenStack and OpenDaylight controllers and has the in-built functionality to automate the key phases of the NFV service lifecycle, namely resource discovery and matching, service mapping, service deployment, and monitoring. The MANO stack is being implemented by the EU FP7 project T-NOVA, with the components being released as open-source software. Service mapping and service deployment solutions developed in the scope of T-NOVA are presented in detail. As a proof-of-concept, we evaluate the performance of a virtualized traffic classifier network function, demonstrating the gains of virtualized hardware acceleration.", "num_citations": "52\n", "authors": ["1938"]}
{"title": "TeNOR: Steps towards an orchestration platform for multi-PoP NFV deployment\n", "abstract": " Network Functions Visualization is focused on migrating traditional hardware-based network functions to software-based appliances running on standard high volume severs. There are a variety of challenges facing early adopters of Network Function Virtualizations; key among them are resource and service mapping, to support virtual network function orchestration. Service providers need efficient and effective mapping capabilities to optimally deploy network services. This paper describes TeNOR, a micro-service based network function virtualisation orchestrator capable of effectively addressing resource and network service mapping. The functional architecture and data models of TeNOR are described, as well as two proposed approaches to address the resource mapping problem. Key evaluation results are discussed and an assessment of the mapping approaches is performed in terms of the service …", "num_citations": "40\n", "authors": ["1938"]}
{"title": "An integrating framework for efficient NFV monitoring\n", "abstract": " Most challenges associated with Network Functions Virtualisation (NFV) are related to the automated and large-scale deployment of virtualised network functions (VNFs) within an operational infrastructure, as well as their availability and performance. In order to effectively face these challenges, efficient and comprehensive monitoring of NFV services is a critical aspect. This paper discusses the challenges of proper NFV monitoring, focusing on the process of collecting NFV Infrastructure (NFVI) metrics and processing them at Virtualised Infrastructure Management (VIM) level. It also presents an open-source integrating framework for efficient NFV monitoring, developed in the frame of the EU-funded project T-NOVA. The presented framework enables agent-based and agent-less infrastructure monitoring as well as VNF application metrics collection, aggregation, processing and exposure in a lightweight and scalable …", "num_citations": "32\n", "authors": ["1938"]}
{"title": "Shot boundary detection without threshold parameters\n", "abstract": " Automatic shot boundary detection is a field, where many techniques and methods have been proposed and have claimed to perform reliably, especially for abrupt scene cut detection. However, all the proposed methods share a common drawback: the necessity of a threshold value, which is used as a reference for detecting scene changes. The determination of the appropriate value or the dynamic reestimation of this threshold parameter remains the most challenging issue for the existing shot boundary detection algorithms. We introduce a novel method for shot boundary detection of discrete cosine transform (DCT)-based and low-bit-rate encoded clips, which exploits the perceptual blockiness effect detection on each frame without using any threshold parameter, therefore minimizing the processing demands required for algorithm implementation.", "num_citations": "29\n", "authors": ["1938"]}
{"title": "Reverse Path Technologies in Interactive DVB-T Broadcasting\n", "abstract": " The convergence of different networking infrastructures and the integration of fixed, mobile and broadcasting technologies is the new era in telecommunications. This paper describes the design, implementation and testing of a network architecture able to integrate DVB-T broadcasting technology for the downlink with GSM and LMDS access technologies for the uplink. It provides fast access to IP services and digital television to residential and mobile users and it will be used as a demonstration platform for the EU-funded MAMBOIST project.", "num_citations": "27\n", "authors": ["1938"]}
{"title": "5GTANGO: A beyond-MANO service platform\n", "abstract": " Unlike previous generations, 5G will be more than just a mobile network. 5G will have broader coverage, including humans, but also cars, robots, and things in general; and will target verticals like eHealth, Automotive, or Industry 4.0, just name a few. To deal with this, 5G will need to be faster, more efficient, reliable, flexible, agile, and, at the same time, cost less. For this to be possible, 5G has to engage with the best-of-breed of the emerging technologies, where NFV is definitely in the top list. ETSI NFV is today in an advanced stage of standardization. In particular, many MANO platforms are today available, with different levels of development, varying on the number of features and maturity levels. In this context, this paper describes the 5GTANGO Service Platform, an open source MANO framework currently under development in the scope of the 5GTANGO H2020 project, and whose main developments started in a …", "num_citations": "26\n", "authors": ["1938"]}
{"title": "Migrating to a NFV-based Home Gateway: Introducing a Surrogate vNF approach\n", "abstract": " Virtualizing network functions is becoming a major trend in today's research on cloud computing. Among networking elements, the Home Gateway appears to be one with the most diverse functions to handle and thus, with great potential for virtualization. To this end, the paper proposes a solution to ease adoption by Service Providers of the latest breakthroughs in cloud computing technologies towards a virtualized Home Gateway. Although the NFV approach globally pretends bringing operational advantages in terms of CAPEX and OPEX, it is essential to prove them for Home Gateways scenarios where compatibility and versatility are strong requirements. To achieve this goal, we introduce the concept of Surrogate vNF, which makes Home Gateways NFV aware. The paper highlights a migration path towards full Home Gateway virtualization and proves its concept through a real implementation and a simulated …", "num_citations": "26\n", "authors": ["1938"]}
{"title": "UAV-assisted 5G network architecture with slicing and virtualization\n", "abstract": " Next generation networks promise not only extremely high data rates and low latency, but also ubiquitous coverage and massive IoT. One of the major challenges is the guaranteed service provision even in cases of network failure (e.g. infrastructure damage, remote areas, flash crowd areas etc.). Flying nodes that will act as aerial base stations or relays could back-up the network fast and prevent any service interruption or even enhance network performance. This paper discusses the architecture and possible applications of flying modes in the frame of a 5G network supporting network slicing and lightweight virtualization. It also provides aerial LTE measurement results to support the feasibility check for using UAVs in two possible scenarios, i.e. network capacity enhancement and increasing network coverage.", "num_citations": "23\n", "authors": ["1938"]}
{"title": "An NFV-based video quality assessment method over 5G small cell networks\n", "abstract": " A video quality assessment mechanism for next-generation (5G) mobile networks uses the small cell deployment architecture to implement a virtual network function to enable in-service monitoring of delivered video quality.", "num_citations": "23\n", "authors": ["1938"]}
{"title": "Media ecosystems: A novel approach for content-awareness in future networks\n", "abstract": " This chapter proposes a novel concept towards the deployment of a networked ‘Media Ecosystem’. The proposed solution is based on a flexible cooperation between providers, operators, and end-users, finally enabling every user first to access the offered multimedia services in various contexts, and second to share and deliver his own audiovisual content dynamically, seamlessly, and transparently to other users. Towards this goal, the proposed concept provides content-awareness to the network environment, network-and user contextawareness to the service environment, and adapted services/content to the end user for his best service experience possible, taking the role of a consumer and/or producer.", "num_citations": "22\n", "authors": ["1938"]}
{"title": "Unidirectional lightweight encapsulation: performance evaluation and application perspectives\n", "abstract": " Multi Protocol Encapsulation (MPE) is today the dominant method for encapsulating IP data into the MPEG-2 Transport Stream so they can be conveyed over digital television platforms (DVB or ATSC). Unidirectional Lightweight Encapsulation (ULE) is a new alternative to MPE, providing simplicity, efficiency and configurability. This paper presents the principle and benefits of ULE, approaches the issues associated with its adoption and compares it against MPE through extensive performance measurements in a fully functional testbed under IPv4 and IPv6 load. It also proposes, implements and demonstrates the combination of MPEG-4/H.264, IPv6 and ULE as the most efficient and flexible protocol stack for next-generation transmission of digital video over Digital Television networks", "num_citations": "21\n", "authors": ["1938"]}
{"title": "Automated generation of VNF deployment rules using infrastructure affinity characterization\n", "abstract": " As the rollout of NFV in the Telecommunications domain gains momentum, methods that enable the automated and performant deployment of VNFs are required to support large scale deployments. This paper presents a framework that enables the automated characterization of VNFs and modelling of the relationships between resource types, quantities and achieved performance. A workload characterization approach is proposed to identify the most appropriate types of resources to be allocated to a VNF at deployment time. Machine learning modelling was used to identify the appropriate deployment configuration which meets required performance targets, such as network throughput. The proposed framework has been experimentally validated based on the optimization of a Traffic Classifier VNF deployment in an OpenStack cloud environment.", "num_citations": "19\n", "authors": ["1938"]}
{"title": "Insights from SONATA: Implementing and integrating a microservice-based NFV service platform with a DevOps methodology\n", "abstract": " In pursuit of a flexible, resource efficient and high- performant 5G infrastructure, many operators, vendors and research consortia are currently developing, testing and integrating their NFV platform with associated management and orchestration (MANO) functionality. The SONATA NFV platform follows a micro-service design, which involves a tight coupling between an SDK, monitoring and MANO functionality, targeting a secure and stable software foundation. This experience paper gives a thorough overview on the encountered challenges, insights and resulting learnings when implementing and integrating the SONATA Service Platform using a continuous integration and delivery DevOps methodology. This is the result of a strong cooperation between prominent equipment vendors, network operators, software companies and universities, providing a set of constructive recommendations in hope of catalysing the …", "num_citations": "18\n", "authors": ["1938"]}
{"title": "A cloud-enabled small cell architecture in 5G networks for broadcast/multicast services\n", "abstract": " The evolution of 5G suggests that communication networks become sufficiently flexible to handle a wide variety of network services from various domains. The virtualization of small cells as envisaged by 5G, allows enhanced mobile edge computing capabilities, thus enabling network service deployment and management near the end user. This paper presents a cloud-enabled small cell architecture for 5G networks developed within the 5G-ESSENCE project. This paper also presents the conformity of the proposed architecture to the evolving 5G radio resource management architecture. Furthermore, it examines the inclusion of an edge enabler to support a variety of virtual network functions in 5G networks. Next, the improvement of specific key performance indicators in a public safety use case is evaluated. Finally, the performance of a 5G enabled evolved multimedia broadcast multicast services service is …", "num_citations": "17\n", "authors": ["1938"]}
{"title": "Scalable media coding enabling content-aware networking\n", "abstract": " Increasingly popular multimedia services are expected to play a dominant role in the future of the Internet. In this context, it is essential that content-aware networking (CAN) architectures explicitly address the efficient delivery and processing of multimedia content. This article proposes the adoption of a content-aware approach into the network infrastructure, thus making it capable of identifying, processing, and manipulating media streams and objects in real time to maximize quality of service (QoS) and experience (QoE). Our proposal is built on the exploitation of scalable media coding technologies within such a content-aware networking environment. This discussion is based on four representative use cases for media delivery (unicast, multicast, peer-to-peer, and adaptive HTTP streaming) and reviews CAN challenges, specifically flow processing, caching/buffering, and QoS/QoE management.", "num_citations": "17\n", "authors": ["1938"]}
{"title": "An adaptive system for real-time scalable video streaming with end-to-end QOS control\n", "abstract": " This paper presents a real-time adaptive video streaming system based on the latest standardized video codec H.264/MPEG-4 AVC scalable extension (SVC). The system provides a full MPEG-21 media access framework over heterogeneous networks and terminals with end-to-end QoS control and multimedia adaptation based on SVC. This adaptive streaming system is composed of a server with a real-time SVC encoder, an adaptive network node, and a terminal with appropriate feedback of perceptual quality, network conditions and user preferences for adaptation support. The system facilitates a general content adaptation solution to achieve the end-to-end QoS control.", "num_citations": "17\n", "authors": ["1938"]}
{"title": "INSPIRE-5Gplus: Intelligent security and pervasive trust for 5G and beyond networks\n", "abstract": " The promise of disparate features envisioned by the 3GPP for 5G, such as offering enhanced Mobile Broadband connectivity while providing massive Machine Type Communications likely with very low data rates and maintaining Ultra Reliable Low Latency Communications requirements, create a very challenging environment for protecting the 5G networks themselves and associated assets. To overcome such complexity, future 5G networks must employ a very high degree of network and service management automation, which is a security challenge by itself as well as an opportunity for smarter and more efficient security functions. In this paper, we present the smart, trustworthy and liable 5G security platform being designed and developed in the INSPIRE-5Gplus 1 project. This platform takes advantage of new techniques such as Machine Learning (ML), Artificial Intelligence (AI), Distributed Ledger Technologies …", "num_citations": "16\n", "authors": ["1938"]}
{"title": "T-nova: Network functions as-a-service over virtualised infrastructures\n", "abstract": " The EU funded FP7 project T-NOVA, with the specific goal of accelerating the evolution of NFV, proposes an open architecture to provide Virtual Network Functions as a Service (VNFaaS), together with a dynamic, and flexible platform for the management of Network Services (NSs) composed by those Virtual Network Functions (VNFs). The proposed architecture allows operators to deploy distinct virtualized network functions, not only for their internal operational needs, but also to offer them to their customers, as value-added services. Virtual network appliances (e.g. gateways, proxies or even traffic analyzers) can be provided on-demand, eliminating the need to acquire, install, and maintain specialized hardware at customer premises. This demo illustrates work carried out on the deployment of a VNF on a Network Function Virtualization Infrastructure (NFVI) using resource aware scheduling methods to ensure …", "num_citations": "16\n", "authors": ["1938"]}
{"title": "Statistical-based anomaly detection for NFV services\n", "abstract": " Large-scale, carrier-grade Network Functions Virtualisation (NFV) services are expected to involve a significant number of Virtual Network Functions, deployed across multiple Points-of-Presence (PoPs) and possibly in heterogeneous infrastructures. While proper monitoring is crucial for the commercial viability of NFV services, effectively and efficiently monitoring a huge number of VNF instances, promptly detecting any malfunctions or anomalies in order to trigger corrective actions, becomes a real challenge. This paper presents the use of an open-source monitoring system especially tailored for NFV in conjunction with statistical approaches commonly used for anomaly detection, towards the timely detection of anomalies in deployed NFV services.", "num_citations": "15\n", "authors": ["1938"]}
{"title": "Joint assessment of Network-and Perceived-QoS in video delivery networks\n", "abstract": " Given the increasing number of IP streaming video customers, service providers are seeking an efficient way to monitor in real time the offered quality of service, as perceived by each end user. Since real-time video quality assessment via image processing algorithms is quite bandwidth- and processing-power-demanding, a feasible alternative could be to monitor the Network-level Quality of Service (NQoS) and associate it with the Perceived QoS (PQoS). This article presents a network-agnostic framework for the joint assessment of N- and P-QoS, with the aim of correlating these two parameters for a specific network and service configuration. This framework/architecture is implemented with open source software tools and is being demonstrated in an actual WiMAX streaming video distribution platform.", "num_citations": "15\n", "authors": ["1938"]}
{"title": "An interactive DVB-T platform with broadband LMDS uplink\n", "abstract": " Contemporary DTV technologies introduce the concept of interactivity to traditional TV broadcast services, provided that a data return channel exists. This paper proposes a wireless access network which is a result of the convergence of wireless data network technologies and digital broadcasting. The proposed network, which is being implemented in the frame of the EU-funded MAMBO IST project, can offer digital television and fast Internet access to stationary users, utilizing DVB-T technology for broadband downlink, while the uplink is based on an LMDS network.", "num_citations": "15\n", "authors": ["1938"]}
{"title": "Service mapping and orchestration over multi-tenant cloud-enabled RAN\n", "abstract": " Fifth-generation (5G) envisages a “hyper-connected society” where an enormous number of diverse entities could communicate with each other anywhere and at any time, some of which will demand extremely challenging performance requirements such as sub-millisecond latency, and higher data rates. Cloud-enabled radio access networks (CE-RANs) where intelligence is placed at the edge of the mobile network and in the proximity of end users emerge as a promising solution to improve online experience. To make CE-RAN more flexible and cost-effective, network functions virtualization and software defined networking technologies are employed, enabling features such as resource pooling, scalability, spectral efficiency, and multi tenancy. The accommodation of such technologies in the context of 5G requires multipronged efforts at various levels, in particular at the management and orchestration. Among all …", "num_citations": "13\n", "authors": ["1938"]}
{"title": "Broadband multimedia on the move with DVB-H\n", "abstract": " DVB-H is the newly standardized extension to DVB-T, aiming at the provision of IP datacasting (IPDC) services to mobile terminals. This tutorial paper outlines the structure of an interactive DVB-H platform and presents in brief the technical advances of the new specification. It also discusses some interesting scenarios of interactive and non-interactive services which can be directly deployed with the use of the DVB-H technology either as a stand-alone broadcast network or as a complement to existing cellular (2G/3G/WLAN) infrastructures.", "num_citations": "13\n", "authors": ["1938"]}
{"title": "Pre-encoding PQoS assessment method for optimized resource utilization\n", "abstract": " This paper presents an assessment method for fast and quantified estimation of the Perceived Quality of Service (PQoS) for homogeneous MPEG-4 video content, enabling optimized utilization of the corresponding storage and bandwidth resources. Besides, the Mean Perceived Quality of Service (MPQoS) as a function of the video encoding rate is introduced and exploited as a metric for objective video quality assessment. The validity of this metric is evaluated by comparing PQoS experimental curves to the theoretical benefit functions. Based on the proposed metric the paper presents a method for pre-encoding PQoS assessment based on the fast estimation of the ST activity level for homogeneous MPEG-4 video content, encoded at constant bit-rate.", "num_citations": "12\n", "authors": ["1938"]}
{"title": "Cross-layer monitoring in IPTV networks\n", "abstract": " In a time when media content, including user-generated, is flooding the Internet, and WebTV services are becoming more and more attractive and competitive, “fenced wall” IPTV operators need to come up with clear benefits, focusing on high content quality and guaranteed QoS/QoE. Quality guarantees can be achieved only via an end-to-end network and service management architecture, supported by an efficient monitoring system. This article discusses cross-layer IPTV service and network monitoring approaches, presenting overall aims and challenges, metrics to be monitored, and measurement strategies according to point of observation (in-network or client-side monitoring). Finally, it presents the monitoring system developed within the ALICANTE research project as an example of a complete end-to-end cross-layer monitoring framework for media services.", "num_citations": "11\n", "authors": ["1938"]}
{"title": "Broadband data access over hybrid DVB-T networks\n", "abstract": " Contemporary DVB-based digital terrestrial systems (DVB-T, DVB-H) provide an efficient distribution network not only for DTV programs, but also for interactive data services. When combined with an appropriate interaction network (return channel), the DVB platform can act as the downlink in a hybrid asymmetric network, enabling for bidirectional broadband data access, supporting Internet connectivity and client-server applications. In this context, this paper presents an interactive DVB-T platform based on various uplink technologies, and validates the performance of each configuration in data communication.", "num_citations": "11\n", "authors": ["1938"]}
{"title": "A scalable and flexible packet forwarding method for future internet networks\n", "abstract": " The paper proposes a novel flexible packet forwarding (FPF) method designed for Future Internet networks. It follows the source routing principle at an inter-domain level and applies the list of domain customized identifiers to forward packets on the end-to-end path. The main features are capability to introduce flexible routing path selection, native support for multipath and multicast packet transfer, ability for exploitation of advanced in-network packet processing as, e.g., content recoding and caching. The performance and scalability of FPF approach were evaluated by experimentation on developed prototype as well as by scalability studies assuming Internet-scale network scenario.", "num_citations": "10\n", "authors": ["1938"]}
{"title": "ENTHRONE perspective for E2E QoS\n", "abstract": " In this paper ENTHRONE (End-to-End QoS through Integrated Management of Content, Networks and Terminals) outlines its perspective for E2E QoS. The aim is to develop an integrated management solution that will handle in a homogeneous manner the considered types of network segments, comprised of wired (IP based core network) and wireless (DVB, WLAN, UMTS) segments. Apart from enforcing and proposing management policies the solution will also monitor and analyse performance and QoS levels as provided by the network segments. The network architecture, certain operational phases alongside remedial actions to QoS degradation are the focal points on this work.", "num_citations": "10\n", "authors": ["1938"]}
{"title": "5G-Enabled UAVs with Command and Control Software Component at the Edge for Supporting Energy Efficient Opportunistic Networks\n", "abstract": " Recently Unmanned Aerial Vehicles (UAVs) have evolved considerably towards real world applications, going beyond entertaining activities and use. With the advent of Fifth Generation (5G) cellular networks and the number of UAVs to be increased significantly, it is created the opportunity for UAVs to participate in the realisation of 5G opportunistic networks by carrying 5G Base-Stations to under-served areas, allowing the provision of bandwidth demanding services, such as Ultra High Definition (UHD) video streaming, as well as other multimedia services. Among the various improvements that will drive this evolution of UAVs, energy efficiency is considered of primary importance since will prolong the flight time and will extend the mission territory. Although this problem has been studied in the literature as an offline resource optimisation problem, the diverse conditions of a real UAV flight does not allow any of the existing offline optimisation models to be applied in real flight conditions. To this end, this paper discusses the amalgamation of UAVs and 5G cellular networks as an auspicious solution for realising energy efficiency of UAVs by offloading at the edge of the network the Flight Control System (FCS), which will allow the optimisation of the UAV energy resources by processing in real time the flight data that have been collected by onboard sensors. By exploiting the Multi-access Edge Computing (MEC) architectural feature of 5G as a technology enabler for realising this offloading, the paper presents a proof-of-concept implementation of such a 5G-enabled UAV with softwarized FCS component at the edge of the 5G network (ie, the MEC …", "num_citations": "8\n", "authors": ["1938"]}
{"title": "Connectivity services management in multi-domain content-aware networks for multimedia applications\n", "abstract": " This paper proposes a new framework, for connectivity services management in overlay Virtual Content Aware Networks (VCAN) built over multi-domain, multiprovider IP networks. The framework is part of a Future Internet-oriented Multimedia networked architecture developed inside a FP7 European ICT research project, ALICANTE. The VCAN new concept is a stronger coupling between network and applications. The VCANs are managed by CAN Providers, and the high level services by Service Providers (SP). The CANP offers to SPs enhanced connectivity services, including unicast, multicast, in a multi-domain networking context. The management framework is based on vertical and horizontal Service Level Agreements (SLA) negotiated and concluded between providers and possibly also on content/service description information (metadata) inserted in the media flow packets by the servers.", "num_citations": "8\n", "authors": ["1938"]}
{"title": "Provisioning of end to end QoS in diverse environments: the ENTHRONE view.\n", "abstract": " Present and Future networks are highly diverse environments bringing together in a synergy different technologies such as IP, WLAN, DVB, UMTS. End-to-End delivery of services over heterogeneous environments with quality of service guarantees is a major challenge for research community with no apparent unified solution. In this paper, the perspective for End-to-End (E2E) QoS is outlined in the view of ENTHRONE (End-to-End QoS through Integrated Management of Content, Networks and Terminals) project. The aim is to develop an integrated network management solution that will handle in a homogeneous manner a number of network segments, including wired (IP based core network) and wireless (DVB, WLAN, UMTS), segments. Apart from implementing the management functions, enforcing policies and making provisioning decisions for optimising the usage of network resources, the solution will also provide service level monitoring functions for in-service verification of offered services by verifying whether the committed QoS performance guarantees are in fact being met. The overall network architecture, certain operational scenarios alongside remedial actions to QoS degradation are focal points of this paper.", "num_citations": "8\n", "authors": ["1938"]}
{"title": "5G Network Slicing Enabling Edge Services\n", "abstract": " Network slicing already plays an important role as a critical enabler in the current 5G technology domain. 5G aims to disrupt and accelerate innovation in various vertical fields, among those is the vehicular industry. In the detailed scope of the 5G-DRIVE research project promoting cooperation between the EU and China, a set of trials is to be undertaken towards promoting 5G growth. In this paper, initially, we identify a variety of challenges arising from the 5G convergence to the automotive industry. Then we describe the specific innovative framework of the 5G-DRIVE research, together with a novel network slicing mechanism deployed at the edge. Then an analysis on the corresponding architectures is presented, and how they operate in a set of trials for new 5G services. The services described are a virtualized caching network function (vCache), and a deep packet inspection one (vDPI), which are deployed at the …", "num_citations": "7\n", "authors": ["1938"]}
{"title": "A monitoring framework for 5G service deployments\n", "abstract": " Network softwarization - through the adoption of Software Defined Networking (SDN), Network Functions Virtualization (NFV) and Cloud-Fog computing technologies - is deeply impacting telecom and ICT industries. This transformation, along with numerous advantages, brings also considerable challenges. In this paper, we discuss the main features of monitoring in the afore-mentioned landscape as well as the main requirements imposed to resource monitoring systems for supporting future 5G deployments and services. Moreover, a generic architecture for monitoring both physical and virtual resources, either SDN/NFV-compliant or legacy, is presented and its main components are discussed. Finally, a preliminary implementation of a monitoring framework is presented that follows the identified design principles.", "num_citations": "7\n", "authors": ["1938"]}
{"title": "A fast route planning algorithm for MPLS-TE\n", "abstract": " MPLS and MPLS-TE are playing a key role in resource management of contemporary packet networks and also in the provisioning of end-to-end virtualized network services. In this context, route planning and resource allocation in MPLS networks, conforming to MPLS-TE requirements, is of vital importance for optimizing network usage. This paper proposes an MPLS-TE-conformant route planning algorithm which is significantly fast - and thus suitable for online use - while at the same time yields satisfactory results. Performance assessment results are also presented, accompanied with a comparison with existing algorithms.", "num_citations": "7\n", "authors": ["1938"]}
{"title": "Media ecosystem deployment in a content-aware future internet architecture\n", "abstract": " Creation and efficient distribution of new rich media services is foreseen to play a key role in the Future Internet. Emerging FI architectures should be able to fully support and facilitate all kinds of current and future media-oriented applications. The architecture illustrated in this paper facilitates the deployment of an integrated Media Ecosystem, where all users can efficiently not only have access to, but also compose and share rich media services. This is achieved via a mesh of intelligent, media-centric home gateways (“HomeBoxes”), which utilize novel Content-Aware network overlays, developed on top of the existing transport infrastructures. This concept has been designed and is being implemented as an international pilot demonstrator in the frame of the EU-funded ICT project ALICANTE.", "num_citations": "7\n", "authors": ["1938"]}
{"title": "The use of a DVB-T platform as an IP backbone for interconnection of LANs\n", "abstract": " DVB-T technology has traditionally been used as an access network, providing digital TV programs along with IP based multimedia services to single end users. This paper presents an additional usage of DVB-T as a backbone for the interconnection of Local Area Networks, scattered all over the DVB-T coverage area.", "num_citations": "7\n", "authors": ["1938"]}
{"title": "Evaluation of Apache spot's machine learning capabilities in an SDN/NFV enabled environment\n", "abstract": " Software Defined Networking (SDN) and Network Function Virtualisation (NFV) are transforming modern networks towards a service-oriented architecture. At the same time, the cybersecurity industry is rapidly adopting Machine Learning (ML) algorithms to improve detection and mitigation of complex attacks. Traditional intrusion detection systems perform signature-based detection, based on well-known malicious traffic patterns that signify potential attacks. The main drawback of this method is that attack patterns need to be known in advance and signatures must be preconfigured. Hence, typical systems fail to detect a zero-day attack or an attack with unknown signature. This work considers the use of machine learning for advanced anomaly detection, and specifically deploys the Apache Spot ML framework on an SDN/NFV-enabled testbed running cybersecurity services as Virtual Network Functions (VNFs). VNFs …", "num_citations": "6\n", "authors": ["1938"]}
{"title": "Performant deployment of a virtualised network functions in a data center environment using resource aware scheduling\n", "abstract": " The EU funded FP7 project T-NOVA, with the specific goal of accelerating the evolution of NFV, proposes an open architecture to provide Virtual Network Functions as a Service (VNFaaS), together with a dynamic, and flexible platform for the management of Network Services (NSs) composed by those Virtual Network Functions (VNFs). The proposed architecture allows operators to deploy distinct virtualized network functions, not only for their internal operational needs, but also to offer them to their customers, as value-added services. Virtual network appliances (e.g. gateways, proxies or even traffic analyzers) can be provided on-demand, eliminating the need to acquire, install, and maintain specialized hardware at customer premises. This demo illustrates early work carried out on the deployment of a VNF on a Network Function Virtualization Infrastructure (NFVI) using resource aware scheduling methods to …", "num_citations": "6\n", "authors": ["1938"]}
{"title": "Dynamic bandwidth allocation for LAN-2-LAN interconnection using DVB-S satellite transmission\n", "abstract": " This paper proposes architecture to interconnect remotely located heterogeneous terrestrial distribution nodes in a mesh topology. The meshed topology was achieved through the use of an on board regenerative satellite. An emulated DVB-S regenerative environment was created using an actual transparent GEO satellite. Furthermore a dynamic bandwidth mechanism is proposed, applied directly on the DVB-S stream of the uplink of each distribution node was performed to achieve efficient usage of the available bandwidth. This dynamic bandwidth mechanism enables the provision of interactive IP based multimedia services, at a guaranteed QoS. An actual GEO satellite link has been used to demonstrate the interoperability of DVB-S, DVB-T and WLAN networks, to validate the performance of the network architecture and the bandwidth management mechanism.", "num_citations": "5\n", "authors": ["1938"]}
{"title": "In-service Video Quality assessment based on SDN/NFV techniques\n", "abstract": " This paper discusses the utilization of SDN/NFV as enabling technology for the provision of in-service video quality assessment. The proposed method is based on a reduced reference extension of the widely used full reference SSIM metric, proving how the applicability of SDN/NFV can support the development of novel value-added service. The proposed video quality assessment method is based on a two-step process, where in the first step a test pattern is used as a reference for the assessment of the original and the degraded signal and in the second step the SSIM value is estimated by the combination of these measurements. For the validation of the proposed method, a SDN/NFV infrastructure was deployed, supporting traffic steering of selected video flows through the VNF instantiation of the proposed method. The evaluation results demonstrated the advantages in terms of agility and flexibility of the SDN …", "num_citations": "5\n", "authors": ["1938"]}
{"title": "An SNMP agent for active in-network measurements\n", "abstract": " Active network measurements play an important role not only in network monitoring for OAM purposes, but also in assessing the current network status and providing real-time information for the optimization of applications. This paper proposes the extension of SNMP-based monitoring mechanisms to also support active in-network measurements conforming to the standardized OWAMP protocol. A specialized SNMP agent is designed and implemented, featuring an OWAMP-compliant probe module and accompanied by the appropriate MIB. The proper operation of the mechanism is validated in a laboratory testbed under emulated network conditions, achieving remarkable accuracy and seamless integration with SNMP-compatible network managers.", "num_citations": "5\n", "authors": ["1938"]}
{"title": "A preliminary implementation of a Content-Aware network node\n", "abstract": " This paper presents a preliminary implementation of a content-aware network node as part of a Content-Aware capable network infrastructure. The proposed network node facilitates all the possible functions provided by an ordinary router or gateway while at the same time exploits flow- and content- awareness in order to identify the content carried within a flow and handle it efficiently. In this context this paper discusses the main concepts and operating principles around the flow and content awareness and presents a preliminary implementation, build around the Linux operating system.", "num_citations": "5\n", "authors": ["1938"]}
{"title": "Performance evaluation of H264/SVC streaming system featuring real-time in-network adaptation\n", "abstract": " In the recent years one of the most active research topics in multimedia networking is the exploitation of the Scalable Video Coding (SVC) as a scalable solution for efficient network resources utilization. SVC introduces scalability by exploiting a layered encoding of the video stream, thus enabling real-time in-network adaptation by selectively allowing the transmission of appropriate layers. This paper presents an architecture that exploits SVC capabilities in order to provide end-to-end QoS assurance via in-network video adaptation. The adaptation system management is based on MPEG-21 framework while the network QoS mechanisms are based on DiffServ standard. The performance evaluation of the proposed architecture is performed over a real test-bed infrastructure.", "num_citations": "5\n", "authors": ["1938"]}
{"title": "A Markov modified model of H. 264 VBR video traffic\n", "abstract": " Video is expected to posses a large portion of the total traffic in future wireless communication networks, given that multimedia services are becoming increasingly popular. Consequently, traffic characterization of such video services is essential for efficient traffic control and resource management via the adaptation of the video properties in the design of communication and transmission networks. The new H. 264/AVC standard, proposed by the ITU-T Video Coding Expert Group (VCEG) and ISO/IEC Moving Pictures Expert Group (MPEG), was designed satisfying two challenging tasks: Considerably higher coding efficiency and improved network adaptation compared to the already widely used standards. Hence, H. 264, featuring slice partitioning, Intra refreshing, separation of picture and sequence data from slice data, provides robustness during transmission, setting it the most appropriate video coding standard for error prone environments. This paper, based on a previously published frame and layer statistical analysis of H. 264 encoded sources, proposes a Markov modified model of H. 264 unconstraint VBR traffic.", "num_citations": "5\n", "authors": ["1938"]}
{"title": "Enthrone core networking elements for end-to-end QoS provision over heterogeneous settings\n", "abstract": " Enthrone Core Networking Elements for End-to-End QoS Provision over Heterogeneous Settings - Université de Bordeaux Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support Université de Bordeaux Archive Ouverte HAL Accueil Consultation Liste des articles Liste par domaine Liste par auteurs Rechercher hal-00361849, version 1 Communication dans un congrès Enthrone Core Networking Elements for End-to-End QoS Provision over Heterogeneous Settings Toufik Ahmed 1 Abolghasem (hamid) Asgari Eugen Borcoci Stefan Eccles Georgios Kormentzas Anastasios Kourtis Ahmed Mehaoua 2 Georgios Xilouris Détails 1 LaBRI - Laboratoire Bordelais de Recherche en Informatique 2 PRISM - …", "num_citations": "5\n", "authors": ["1938"]}
{"title": "The New Interconnecting Television: An alternative approach to next generation broadband networking\n", "abstract": " In Sevilla European council it was indicated that two major problems (among the others) have to be solved towards eEurope 2005 and beyond: the transition to digital television in UHF band (digital switchover) and the broadband access for all. This paper considers that if proper decision will be taken for the digital switchover (taking into account the networking aspect of the new television) it will also provide a solution for the second problem (the broadband access for all citizens). It presents an approach towards the solution of the digital switchover that comprises the use of the DVB stream for interconnecting next generation network (NGN) nodes, by the use of regenerative configurations. The utilisation of regenerative configurations enables for the realisation of a virtual common Ethernet backbone that can be exploited by 3G/UMTS and B3G operators and broadcasters, besides enabling for broadband access for …", "num_citations": "5\n", "authors": ["1938"]}
{"title": "SNMP-driven active measurements in DiffServ networks\n", "abstract": " Active network monitoring techniques have been traditionally used in network management frameworks for OAM operations. They can also provide vital end-to-end network status information which can be exploited for application optimization (Network-Aware Applications). The paper proposes a novel, standards-compliant management framework for conducting active measurements on DiffServ networks, solely based on SNMP as control protocol. A specialized SNMP agent (SNMP for Active Measurements - SAM) is introduced for this purpose, accompanied with a custom MIB, which utilizes the standardized OWAMP (One-Way Active Measurement Protocol) for establishing active measurement sessions. A proof-of-concept implementation deployed on a laboratory testbed shows that the proposed framework exhibits satisfactory accuracy and scalability, while at the same time being compatible with off-the-shelf …", "num_citations": "4\n", "authors": ["1938"]}
{"title": "An MPLS-DiffServ experimental core network infrastructure for E2E QoS content delivery\n", "abstract": " The continuing and rapid growth of the Internet has created an extremely large capacity problem to the service and content provider's networks. The increased network traffic and the absence of service priority, usually produce high network congestions, delayed data and service transmissions and lack of throughput. The effect of these factors in AW content transmission is to distort the initial content and decrease the content quality. To avoid this negative effect, service and content providers are looking for architectures that give them greater control on traffic passing through their domains and other heterogeneous networks. This document proposes an experimental core network architecture (MPLS-DiffServ) presenting a solution for content providers that want reliable and agreed level of quality, even if the network is under congestion. MPLS-DiffServ architecture, couples the DiffServ'sper hop guarantees with MPLS …", "num_citations": "4\n", "authors": ["1938"]}
{"title": "A mesh topology DVB-S network architecture for node interconnection, featuring QoS capabilities\n", "abstract": " This paper proposes a prototype mesh topology network architecture based on regenerative DVB GEO satellites, which enables the interconnection of heterogeneous terrestrial distribution nodes to each other, with minimum possible delay and offering maximum spectral efficiency of the satellite transponder. A dynamic bandwidth management mechanism, applied directly on the DVB-S stream is proposed which enables the provision of interactive IP based multimedia services at a guaranteed QoS. An actual transparent GEO satellite was used in order to create an emulated DVB-S regenerative environment and validate the performance of the network architecture, the interoperability of the heterogeneous networks and the bandwidth management mechanism.", "num_citations": "4\n", "authors": ["1938"]}
{"title": "A SDN-based WiFi-VLC Coupled System for Optimised Service Provision in 5G Networks\n", "abstract": " Visible Light Communication (VLC) is a powerful supplement, which has gained tremendous attention recently and has become a favorable technology in short-range communication scenarios for the Fifth Generation (5G) networks. VLC possesses a number of prominent features to address the highly demanding 5G system requirements for high capacity, high data rate, high spectral efficiency, high energy efficiency, low battery consumption, and low latency. However, this prominent performance is limited by the imperfect reception, since line of sight channel condition may not always exist in practice. This paper presents and experimentally validates a SDN-assisted VLC system, which is coupled with WiFi access technology in order to improve the reliability of VLC system, reassuring zero packet loss reception quality due to misalignment or path obstructions or when the user is moving between two consecutive …", "num_citations": "3\n", "authors": ["1938"]}
{"title": "D7. 1 Evaluation strategy and testbed setup report\n", "abstract": " Status to be approved by EC Editor L. Roullet (NBLF) Contributors G. Xilouris (NCSRD), L. Roullet (NBLF), Felipe Vicens (ATOS), Daniel Behnke, Patrick-Benjamin Bök, Marcel Müller (WEID), Ricard Vilalta, Raul Munoz, Javier Vilchez, Josep Maria Fabrega (CTTC) Reviewer (s) J. Bonnet (ALTL), P. Twamley (HUAW)", "num_citations": "3\n", "authors": ["1938"]}
{"title": "A testbed environment for validation of end-to-end QoS provision for the content delivery chain over heterogeneous systems\n", "abstract": " The content delivery chain encompasses content creation, delivery and consumption. To support this, the content has to be identified, described, generated, delivered, managed and protected. Furthermore, content/services of different format will be distributed over heterogeneous networks and delivered on a variety of user terminals. The scarce resource of bandwidth needs to be dynamically managed and the QoS should remain within predefined limits, accepted by the end users. This will enable the provision of network and terminal resources on demand to form user communities, where the content can be created, protected and shared, always with the agreed/contracted quality, reliability and flexibility. It is therefore imperative to develop an integrated solution that is able to manage the functionality of various entities in the digital information distribution chain, from content/service generation to user terminals, using heterogeneous networks, comprised of wired (IP based core network) and wireless (DVB, WLAN, UMTS) segments, and based on the end-to-end QoS approach. The aim of this work is to propose and to build a suitable testbed environment where such a solution, namely the approach of ENTHRONE (End-to-End QoS through Integrated Management of Content, Networks and Terminals), can be tested and demonstrated. In this respect, an operational networking infrastructure is outlined which can be used as a test bed to demonstrate, in real conditions, the functionalities and the performance of ENTHRONE approach to E2E QoS provisioning.", "num_citations": "3\n", "authors": ["1938"]}
{"title": "5g experimentation: The experience of the athens 5genesis facility\n", "abstract": " 5G is the latest wireless standard designed to comply with stringent performance requirements for supporting diverse use cases spanning over different verticals, considered not feasible with previous cellular network technology. In this context, the European Commission has funded multiple research projects aiming at validating 5G Key Performance Indicators (KPIs) over large scale field trials on different use cases. The 5GENESIS project provides a flexible and open experimentation suite with network slicing, in order to support and facilitate validation of KPIs over 5G infrastructure. This paper discusses the experimentation framework of the Athens 5GENESIS Facility, presents results on throughput, Round-Trip-Time (RTT) and latency and summarizes the lessons learned from the activities that took place.", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Orchestrating Live Immersive Media Services Over Cloud Native Edge Infrastructure\n", "abstract": " Live streaming is becoming an essential for the entertainment and media industry. Quality of Service (QoS) and reliability is a major factor in live streaming, whereas availability and interaction between users are considered very important. Furthermore, the amount of data those services produce is huge, while the data production rate has dramatically increased the last years. Thus, the use of 5G networking technologies, such as Network Function Virtualization (NFV), appears to be a promising solution for addressing the above-mentioned challenges. To this end, in this paper, we describe how an existing infrastructure of live streaming and social media services can take advantage of the NFV-enabled 5GTANGO Service Platform (SP). Also, in this paper we describe the capabilities of the SP and how it can support such services. To be more specific, an efficient monitoring framework, that supports the monitoring of …", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Virtualization evolution: from IT infrastructure abstraction of cloud computing to virtualization of network functions\n", "abstract": " This chapter discusses the evolution of the cloud computing paradigm and its applicability in various sections of the computing and networking/telecommunications industry, such as the cloud networking, the cloud offloading, and the network function virtualization. The new heterogeneous virtualized ecosystem that is formulated creates new needs and challenges for management and administration at the network part. For this purpose, the approach of Software-Defined Networking is discussed and its future perspectives are further analyzed.", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Towards autonomic policy-based network service deployment with sla and monitoring\n", "abstract": " Unlike previous generations, 5G will need to be faster, more efficient, reliable, flexible, agile, and, at the same time, cost less. For this to be possible, 5G has to engage with the best-of-breed of the emerging technologies, where NFV is definitely in the top list. In this context, this paper describes the SONATA Service Platform, an open source MANO framework extended in the scope of the 5GTANGO H2020 project. In particular, this demo presents some features that go beyond the state-of-the-art including Monitoring, Policy, and SLA Management.", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Service specific management and orchestration for a content delivery network\n", "abstract": " Any non-trivial network service requires service specific orchestration to meet its carrier-grade requirements regarding resiliency, availability, etc. How the network service components are mapped on the substrate, how VNFs get reconfigured after a monitored event or how they scale, only network service/function developers know how to execute such workflows to guarantee an optimal QoS. It is therefore of paramount importance that NFV Service Platforms allow developer specified input when performing such life cycle events, instead of defining generic workflows. Within the scope of the SONATA and 5GTANGO projects, a mechanism was designed that allows developers to create and execute Service and Function Specific Managers. These managers are processes, created by the developer, that define service or function specific orchestration behaviour. The SONATA Service Platform executes these managers …", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Exploiting NFV techniques towards future VQA methods\n", "abstract": " This paper introduces a novel approximation of the widely used full reference SSIM metric, ideal for the in-network assessment of QoE for multimedia streams. The QoE estimation approximation algorithm has been implemented as a Virtualised Network Function (VNF) in order to be deployed over Network Function Virtualisation (NFV) infrastructures. The proposed method is based on a two steps evaluation process, making use of a test pattern as an intermediate reference according to which the quality of the original and degraded signal is estimated and expands the applicability of SSIM as a reduced reference metric. For the evaluation of the proposed method as a VNF, a laboratory-scale prototype NFV infrastructure was used, supporting dynamic steering of selected video flows towards the proposed nQoEe estimator VNF via an SDN Control Plane application using OpenFlow protocol for the communication with …", "num_citations": "2\n", "authors": ["1938"]}
{"title": "D4. 1. Orchestrator Prototype\n", "abstract": " Status Final Editor José Bonnet (AlticeLabs) Contributors José Bonnet (AlticeLabs), Santiago Rodrıguez (Optare), Aurora Ramos, Felipe Vicens (ATOS), George Xilouris, Stavros Kolometsos, Christos Sakkas (NCSRD), Stuart Clayman, Alex Galis, Francesco Tusa, Dario Valocchi (UCL), Theodore Zahariadis, Panos Trakadas, Panos Karkazis, Sotiris Karachontzitis (SYN), Thomas Soenen (iMinds), Sharon Mendel-Brin (Nokia), Bruno Vidalenc (Thales), Michael Bredel (NEC), Muhammad Shuaib Siddiqui, Dani Guija (i2CAT), Manuel Peuster, Sevil Dräxler (UPB) Reviewer (s) Michael Bredel (NEC), Pedro Aranda (TID)", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Distributed adaptation decision-taking framework and Scalable Video Coding tunneling for edge and in-network media adaptation\n", "abstract": " Existing and future media ecosystems need to cope with the ever-increasing heterogeneity of networks, devices, and user characteristics collectively referred to as (usage) context. The key to address this problem is media adaptation to various and dynamically changing contexts in order to provide a service quality that is regarded as satisfactory by the end user. The adaptation can be performed in many ways and at different locations, e.g., at the edge and within the network resulting in a substantial number of issues to be integrated within a media ecosystem. This paper describes research challenges, key innovations, target research outcomes, and achievements so far for edge and in-network media adaptation by introducing the concept of Scalable Video Coding (SVC) tunneling.", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Enthrone experimental infrastructure for E2E QoS provisioning\n", "abstract": " The content delivery chain encompasses content creation, delivery and consumption. To support this, the content has to be identified, described, generated, delivered, managed and protected. Furthermore, content/services of different format will be distributed over heterogeneous networks and delivered on a variety of user terminals. The scarce resource of bandwidth needs to be dynamically managed and the QoS should remain within predefined limits, accepted by the end users. This will enable the provision of network and terminal resources on demand to form user communities, where the content can be created, protected and shared, always with the agreed/contracted quality, reliability and flexibility. It is therefore imperative to develop an integrated solution that is able to manage the functionality of various entities in the digital information distribution chain, from content/service generation to user terminals …", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Digital Switchover: An alternative solution towards broadband access for all citizens.\n", "abstract": " The paper anticipates that the actions to be taken concerning the Digital Switchover (transition form analogue to digital broadcasting–DSO) in UHF are of strategic importance for the European Member Countries and most candidate ones, as long as DSO arises as a possible and complementary solution towards the deployment of Broadband Access Infrastructures, especially in less favoured regions. Taking into account the networking potentialities of the new digital TV in UHF (Terrestrial Digital Video Broadcasting–DVB-T) and the broadband capabilities of the recent access technologies (ie WLAN, UMTS, etc.), the paper proposes a networking infrastructure that utilises the DVB-T stream in regenerative configurations for the realization of a common Ethernet backbone capable to interconnect all citizens within the broadcasting area. Citizens access this backbone via appropriate Distribution Nodes (DN), which make use of broadband access technologies. Such an approach enables for a multi-service capable environment (digital TV programmes, Interactive TV programmes, Internet access, e-mail, video/audio on demand, etc.), which is commonly shared among broadcasters, telecom operators and any active citizen who creates, manipulates and distributes his own content to the entire infrastructure (MPEG-21 approach).", "num_citations": "2\n", "authors": ["1938"]}
{"title": "Network slicing for 5G edge services\n", "abstract": " In the current 5G technology domain network slicing already plays an important role as a critical enabler. An industry that 5G aims to disrupt is the vehicular one. In this paper the brief scope of the 5G‐DRIVE research project is presented, regarding 5G vehicular research between the EU and China. In the frame of 5G‐DRIVE a set of slicing mechanisms are investigated and evaluated in regard to their performance. Firstly, related to slicing mechanisms in the NFV domain the OSM orchestrator is measured in terms of scalability and performance. In the next experimental set related to RAN slicing, the Katana Slice Manager is evaluated and depicts how different slicing configurations can achieve different performance results. Furthermore, the paper showcases how 5G network slicing can be integrated as a key enabler to the stringent demands of a vehicular network environment. Finally, the paper concludes, setting …", "num_citations": "1\n", "authors": ["1938"]}
{"title": "An End-to-End Carrier Ethernet MEF enabled 5G network architecture\n", "abstract": " 5G introduces new paradigms that enable communication networks to become more flexible and handle a wide variety of network services from various vertical domains. Small cell deployment exploiting virtualization techniques as envisaged by 5G, allows enhanced mobile edge computing capabilities, thus enabling flexible network service deployment and slicing support near the end user. This paper presents a cloud-enabled small cell architecture for 5G networks developed within the 5G-ESSENCE project. The paper also presents the implementation and deployment of an Ethernet Virtual Connection service over a 5G-enabled infrastructure.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "INtelligent security and pervasive trust for 5G and beyond\n", "abstract": " This Deliverable presents the current security landscape of 5G networks, as well as the evolution of requirements and trends in 5G security. It includes a summary of the 5G threat landscape, the 5G networks classification criteria and their threat taxonomy; a description of security requirements of 5G systems, divided into domain-specific use cases, and the elicitation of security requirements from relevant stakeholders in 5G; the current status of 5G networks, the solutions state for securing 5G systems, the standardization effort in the domain of 5G security, the relevant 5G projects, and open source initiatives; and a description of future trends and technologies in 5G networks, their limitations, and gaps related to the security of 5G networks. This deliverable aims to provide a basis for the identification of use cases and the development of 5G security enablers in INSPIRE-5Gplus.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "Service orchestration leveraging software networks and DevOps in 5G\n", "abstract": " Recently software networks are in the spotlight of the research community. Notably future 5G network architectures will leverage software networks in order to offer flexibility and programmability in the development and deployment of added value network services. In this context, this paper presents the description of SONATA project demonstrator. SONATA project supports agile development and orchestration of network services in 5G networks.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "Deployment of virtual network functions over multiple WAN interconnected PoPs\n", "abstract": " Network Functions Virtualization allows Communication Service Providers to extend their traditional service portfolio to new models of service offerings, such as Virtualized Network Functions as a Service (VNFaaS), in which network functions can be traded following the “on-demand” Cloud paradigm. Incremental deployment and interoperability with legacy infrastructure, in particular Wide Area Network (WAN) domains and enterprise services, are key requirements to make this vision come true in the short/medium term. This paper discusses the main challenges that need be addressed for the adoption of VNFaaS in production environments and is particularly focused on the integration of NFV and WAN. To this end, two components are proposed: Netfloc, to support traffic steering inside NFV infrastructure points of presence, and the WAN Infrastructure Connectivity Manager (WICM), to handle the integration of …", "num_citations": "1\n", "authors": ["1938"]}
{"title": "Devops based service orchestration in 5G virtualised networks-SONATA project demo\n", "abstract": " Research in 5G architectures is focused on exploring ways to leverage the use of virtualisation offered by cloud infrastructures and network programmability to provide flexibility and agility in the development and deployment of Network Services and virtual network functions. In this context, this paper presents the description of SONATA project demonstrator. SONATA supports agile development and orchestration of network services in 5G networks.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "VNFaaS with end-to-end full service orchestration\n", "abstract": " The EU funded FP7 project T-NOVA, with the specific goal of accelerating the evolution of NFV, proposes an open architecture to provide Virtual Network Functions as a Service (VNFaaS), together with a dynamic, and flexible platform for the management of Network Services (NSs) composed by those Virtual Network Functions (VNFs). This demo illustrates mature work carried out on the orchestration and deployment of NS over Network Function Virtualization Infrastructures (NFVI) using resource aware scheduling methods to ensure optimal use of resources and performance.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "The Surrogate vNF approach for Content Distribution\n", "abstract": " Since the introduction of high speed Internet technologies such as xDSL and FTTx, End-Users’ demands for Internet services have grown at an exponential rate. According to Akamai, the average bandwidth has continued to globally increase by 65% in the second quarter of 2014 compared to 2013 [1]. In order to cope with this drastic growth, new solutions have been raised for efficient content delivery emerge, such as Content Delivery Networks (CDNs), distributed streaming and adaptive streaming (MPEG DASH). The proliferation of virtualization solutions and the current trend of exploitation within Telco environment eg Network Function Virtualization (NFV) created the appropriate environment for the combination of the above evolutions to enhance streaming technologies and architectures in order to respond to mass demands.The rise of internet videos traffic and its inherent volatility is a challenge for the actors responsible for delivering the quality of service customers expect. From Content Providers (CP) to Content Delivery Networks (CDN) to Service providers (SP), every actor struggles with finding a proper way to fulfill the expected Quality of Service while maintaining a decent profit margin. For example, Liu et al.[2] showed that 20% of VoD video streaming session experienced a rebuffering ratio greater than 10%.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "Efficient planning of virtual network services\n", "abstract": " This paper addresses the issue of virtual network service provision, i.e. establishment of virtualized connectivity services over heterogeneous network infrastructures and argues that, besides the enabling transport and switching technologies, effective planning methods must also be studied so that such services can be provided on-demand, within reasonable provisioning times. In this context, the paper proposes a relatively simple and fast method for MPLS - particularly - and virtual network - generally - planning, able to map several demands over complex infrastructures within minutes. The proposed method is evaluated with regard not only to its response time, but also to the uniformity and balance of the traffic load distributed to the network.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "Quality of Services Assurance for Multimedia Flows based on Content-Aware Networking\n", "abstract": " This paper proposes a new architectural solution to support Quality of Services (QoS) for real time media flows in a multi-domain system based on new concepts as Content-Aware Networks (CAN) and Network Aware Application (NAA). The system described, based on coupling between network and applications is focused, but not limited to, on multimedia services, with content aware processing in the network, including QoS assurance. The architecture actually parallelizes the Internet in virtual CAN networks, spanning multiple domains and assigning specific quality of services classes to different CANs. This work is a part of the starting effort inside of a new European FP7 ICT research project, ALICANTE.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "IP and Broadcasting Systems Convergence\n", "abstract": " The vision of the Internet of the Future for service ubiquity dictates that end users should be able to access services—mostly media-oriented ones—at any time from a variety of networks, including mobile, broadband, and broadcast. In order to achieve network interworking and service ubiquity, IP arises as a key element for the realisation of a unified/fusion environment which enables the convergence/synergy between traditional and emerging technologies. In this context, IP can be also seen as the “gluing factor” in the rapidly progressing convergence between the technologically different sectors of Networking and Broadcasting. This convergence, witnessed both at technological and service levels, is mainly empowered by the evolution of broadcasting standards (DVB, ISDB, ATSC, CMMB) and the recent advances in IP networking. In this way, a broadcasting platform is no longer restricted to transmitting “bouquets” of TV programs. The ability to include IP services into the broadcast multiplex, along with the large coverage area and the high bit rate capabilities, allows broadcasting systems to constitute flexible broadband IP networking infrastructures, complementing existing and emerging wireless access networks such as 3G, WiMAX, and LTE.Conversely, the provision of broadcast TV services over IP networks and over the Internet is further fading the borders between the IP/Networking and Broadcast worlds. The aim of this special issue has been to include recent research efforts focusing on the convergence between the IP and Broadcasting systems, that is, the provision of IP services", "num_citations": "1\n", "authors": ["1938"]}
{"title": "A perceived quality-aware cross layer monitoring framework for real-time media content adaptation\n", "abstract": " The media content provision in a variety of quality and price levels, through the concept of the perceived quality of service (PQoS) is considered as the most dominant among the various future visions of multimedia networking. The concept of the PQoS-driven service provision, based on multimedia content adaptation across heterogeneous networks, will become in the near future a key-issue among service providers (SPs). This paper presents, describes and proposes a novel cross layer monitoring architecture, driven by a prototype mapping between network QoS (NQoS) and PQoS parameters, aiming at providing perceived performance verification with respect to the QoS guarantees specified in contractual agreements between providers and end-users. Towards this, the proposed framework takes sophisticated actions for real time media content adaption with aim the optimization of the finally delivered …", "num_citations": "1\n", "authors": ["1938"]}
{"title": "A demonstration infrastructure for E2E QoS services provisioning\n", "abstract": " The content delivery chain encompasses content creation, delivery and consumption. To support this, the content has to be identified, described, generated, delivered, managed and protected. Furthermore, content/services of different format will be distributed over heterogeneous networks and delivered on a variety of user terminals. The scarce resource of bandwidth needs to be dynamically managed and the QoS should remain within predefined limits, accepted by the end users. This will enable the provision of network and terminal resources on demand to form user communities, where the content can be created, protected and shared, always with the agreed/contracted quality, reliability and flexibility. It is therefore imperative to develop an integrated solution that is able to manage the functionality of various entities in the digital information distribution chain, from content/service generation to user terminals …", "num_citations": "1\n", "authors": ["1938"]}
{"title": "Perceived Quality Evaluation for Multimedia Services\n", "abstract": " The scope of this article is to outline the existing procedures and methods for estimating the PQoS level of a multimedia service.", "num_citations": "1\n", "authors": ["1938"]}
{"title": "Mobility issues in a DVB-T environment.\n", "abstract": " Digital Video Broadcasting (DVB) is the leading technology for permitting digital television access to a wide repartition of users. There exist many different types of DVB technologies: DVB-T for Terrestrial, DVB-S for Satellite, DVB-C for Cable, each one with its own specifications. This paper focuses on the DVB-T mechanism and the way it handles mobility; it describes all the mobility issues and challenges arising from this technology. Investigations on the integration of the Internet Protocol, IP, over the coming terrestrial digital television standard, DVB-T, are also included. It presents mobility scenarios in a special DVB-T environment, along with a complete broadcasting architecture, in which all leading mobile technologies coexist, and provides solutions and enhancements for a better technology deployment.", "num_citations": "1\n", "authors": ["1938"]}