{"title": "A replication of perceived usefulness and perceived ease of use measurement\n", "abstract": " This paper presents the results of a replication of construct measurement of perceived usefulness and ease of use. This replication extends the work of recent research which examined these constructs through structural equation modeling. This research uses a new data set for two different technologies in conducting the replication of the construct measurement. The results of the construct measurement for perceived usefulness and ease of use in this research are quite consistent with the results reported in recent research with minor variations. Perceived usefulness, and not ease of use, is a determinant of predicted future usage.", "num_citations": "755\n", "authors": ["1212"]}
{"title": "A probabilistic model for predicting software development effort\n", "abstract": " Recently, Bayesian probabilistic models have been used for predicting software development effort. One of the reasons for the interest in the use of Bayesian probabilistic models, when compared to traditional point forecast estimation models, is that Bayesian models provide tools for risk estimation and allow decision-makers to combine historical data with subjective expert estimates. In this paper, we use a Bayesian network model and illustrate how a belief updating procedure can be used to incorporate decision-making risks. We develop a causal model from the literature and, using a data set of 33 real-world software projects, we illustrate how decision-making risks can be incorporated in the Bayesian networks. We compare the predictive performance of the Bayesian model with popular nonparametric neural-network and regression tree forecasting models and show that the Bayesian model is a competitive …", "num_citations": "253\n", "authors": ["1212"]}
{"title": "An empirical application of the DeLone and McLean model in the Kuwaiti private sector\n", "abstract": " An empirical application of the DeLone and McLean model in private sector organizations of Kuwait is presented. Seven organizations representing the seven sectors in the Kuwaiti Stock market participated. Certain direct associations between the variables in the original DeLone and McLean model were supported from initial correlation analysis. Subsequent regression analyses confirmed these associations. Information quality and system quality impact user satisfaction significantly. System usage has a significant influence on individual impact.", "num_citations": "253\n", "authors": ["1212"]}
{"title": "Imaging features and safety and efficacy of endovascular stroke treatment: a meta-analysis of individual patient-level data\n", "abstract": " BackgroundEvidence regarding whether imaging can be used effectively to select patients for endovascular thrombectomy (EVT) is scarce. We aimed to investigate the association between baseline imaging features and safety and efficacy of EVT in acute ischaemic stroke caused by anterior large-vessel occlusion.MethodsIn this meta-analysis of individual patient-level data, the HERMES collaboration identified in PubMed seven randomised trials in endovascular stroke that compared EVT with standard medical therapy, published between Jan 1, 2010, and Oct 31, 2017. Only trials that required vessel imaging to identify patients with proximal anterior circulation ischaemic stroke and that used predominantly stent retrievers or second-generation neurothrombectomy devices in the EVT group were included. Risk of bias was assessed with the Cochrane handbook methodology. Central investigators, masked to …", "num_citations": "201\n", "authors": ["1212"]}
{"title": "Penumbral imaging and functional outcome in patients with anterior circulation ischaemic stroke treated with endovascular thrombectomy versus medical therapy: a meta-analysis …\n", "abstract": " BackgroundCT perfusion (CTP) and diffusion or perfusion MRI might assist patient selection for endovascular thrombectomy. We aimed to establish whether imaging assessments of irreversibly injured ischaemic core and potentially salvageable penumbra volumes were associated with functional outcome and whether they interacted with the treatment effect of endovascular thrombectomy on functional outcome.MethodsIn this systematic review and meta-analysis, the HERMES collaboration pooled patient-level data from all randomised controlled trials that compared endovascular thrombectomy (predominantly using stent retrievers) with standard medical therapy in patients with anterior circulation ischaemic stroke, published in PubMed from Jan 1, 2010, to May 31, 2017. The primary endpoint was functional outcome, assessed by the modified Rankin Scale (mRS) at 90 days after stroke. Ischaemic core was …", "num_citations": "159\n", "authors": ["1212"]}
{"title": "Effect of general anaesthesia on functional outcome in patients with anterior circulation ischaemic stroke having endovascular thrombectomy versus standard care: a meta …\n", "abstract": " BackgroundGeneral anaesthesia (GA) during endovascular thrombectomy has been associated with worse patient outcomes in observational studies compared with patients treated without GA. We assessed functional outcome in ischaemic stroke patients with large vessel anterior circulation occlusion undergoing endovascular thrombectomy under GA, versus thrombectomy not under GA (with or without sedation) versus standard care (ie, no thrombectomy), stratified by the use of GA versus standard care.MethodsFor this meta-analysis, patient-level data were pooled from all patients included in randomised trials in PuMed published between Jan 1, 2010, and May 31, 2017, that compared endovascular thrombectomy predominantly done with stent retrievers with standard care in anterior circulation ischaemic stroke patients (HERMES Collaboration). The primary outcome was functional outcome assessed by …", "num_citations": "153\n", "authors": ["1212"]}
{"title": "Software quality and IS project performance improvements from software development process maturity and IS implementation strategies\n", "abstract": " The capability maturity model (CMM) is part of several software process improvement (SPI), six sigma, and total quality management (TQM) initiatives in organizations. SPI and continuous quality improvements are associated with better return on investment (ROI) for organizations. The purpose of this empirical research is to study the impact of the CMM on certain critical factors in information systems implementation strategy, software quality and software project performance. Our findings are that CMM levels do associate with IS implementation strategies and higher CMM levels relate to higher software quality and project performance. We also conclude that information systems (IS) implementation strategies have a significant impact on software quality and project performance. While certain IS implementation strategies – executive commitment and prototyping – have a significant impact on both software quality and …", "num_citations": "146\n", "authors": ["1212"]}
{"title": "The phases of ERP software implementation and maintenance: A model for predicting preferred ERP use\n", "abstract": " Nearly all information technology educators and practitioners are familiar with the concept of a systems development life cycle (SDLC). The SDLC model is mainly based on new software development. The stages vary based on methodology, but mostly include planning and requirements definition, analysis, design of the new system, implementation, and post-implementation support such as maintenance and security. Less explored and known are the stages involved in commercial off the shelf installation. The actual implementation of commercial off the shelf software ERP (enterprise resource planning) systems is an area that is suggested to have a life cycle of its own. The importance of specific phases of this ERP implementation life cycle is the subject of this study. By surveying SAP enterprise resource planning implementations at two divisions of a major manufacturing company, a confirmatory factor analysis …", "num_citations": "119\n", "authors": ["1212"]}
{"title": "Restenosis and risk of stroke after stenting or endarterectomy for symptomatic carotid stenosis in the International Carotid Stenting Study (ICSS): secondary analysis of a …\n", "abstract": " BackgroundThe risk of stroke associated with carotid artery restenosis after stenting or endarterectomy is unclear. We aimed to compare the long-term risk of restenosis after these treatments and to investigate if restenosis causes stroke in a secondary analysis of the International Carotid Stenting Study (ICSS).MethodsICSS is a parallel-group randomised trial at 50 tertiary care centres in Europe, Australia, New Zealand, and Canada. Patients aged 40 years or older with symptomatic carotid stenosis measuring 50% or more were randomly assigned either stenting or endarterectomy in a 1:1 ratio. Randomisation was computer-generated and done centrally, with allocation by telephone or fax, stratified by centre, and with minimisation for sex, age, side of stenosis, and occlusion of the contralateral carotid artery. Patients were followed up both clinically and with carotid duplex ultrasound at baseline, 30 days after …", "num_citations": "83\n", "authors": ["1212"]}
{"title": "A comparison of the decision table and tree\n", "abstract": " The effectiveness of the decision aids is determined by their ability to help in the understanding of conditional logic. Their relative effectiveness in facilitating such understanding however, has previously not been subject to proper empirical testing. Our research concerns the effectiveness of the decision table and tree in the user interface (ie, we are interested in their relative effectiveness as communication tools in user validation of conditional logic and as decision aids in problem solving). Since these aids are normally applied in a specific context involving the users, we use a computer investment game that requires their use for decision making. A key feature of our research is the use of this computer game to promote highly motivated and engaged subjects.", "num_citations": "69\n", "authors": ["1212"]}
{"title": "An empirical study of the Cobb–Douglas production function properties of software development effort\n", "abstract": " In this paper we study whether software development effort exhibits Cobb–Douglas functional form with respect to team size and software size. We empirically test this relationship using real-world software engineering data set containing over 500 software projects. The results of our experiments indicate that the hypothesized Cobb–Douglas function form for software development effort with respect to team size and software size is true. We also find increasing returns to scale relationship between software size and team size with software development effort.", "num_citations": "66\n", "authors": ["1212"]}
{"title": "An examination of some software development effort and productivity determinants in ICASE tool projects\n", "abstract": " Integrated computer-aided software engineering (ICASE) tools and their effect on software development effort and productivity have gained interest in recent research. This research studies the applicability of function points and technical complexity factor as software development effort estimators for ICASE projects. In addition, the effect of three factors—ICASE tool type, systems development method, and ICASE tool experience—on software development productivity is studied. ICASE-based software projects from Texas Instruments and Electronic Data Systems were used in this empirical research. Function points accounted for 74 to 82 percent of the variance in software development effort. Technical complexity factor, however, had only a small indirect effect on software effort. While software productivity differences between the ICASE tool types could not be confirmed, productivity was significantly higher for the …", "num_citations": "64\n", "authors": ["1212"]}
{"title": "An empirical study of the measurement and instrument validation of perceived strategy value of information systems\n", "abstract": " A number of frameworks have been proposed to study the competitive use of information systems. While these frameworks help in the choice of information systems to provide strategic use, the approval and funding of these systems depends solely on the business justification and strategic value of these applications as perceived by top management. The perception of strategic value of information systems (PSVIS) by top management is conceptualized as ii) an operational support type, ii) a managerial productivity enhancement type, and iii) a strategic decision aid type. An instrument was developed and validated to measure PSVIS. The instrument was associated with good reliability, convergent and discriminant validity values. The PSVIS constructs were also shown to be unidimensional using the limited factor analysis approach.", "num_citations": "57\n", "authors": ["1212"]}
{"title": "An empirical analysis of software effort estimate alterations\n", "abstract": " This research studies the effect of descriptive estimate alterations on the accuracy of the resulting estimate. The two major reasons for estimate alterations studied here are the project manager's experience and time constraints. Estimate alterations done for these two reasons and their effect on accuracy is also examined. The confidence of the project manager in the estimation model and its effect on the accuracy of the resulting estimate is also studied. The extent of estimate alterations, estimate alterations made for these two reasons, and the project manager's confidence significantly affect the accuracy of the resulting final estimate. Finally, the reasons reported by managers to explain the percentage of relative error in software effort estimation are documented.", "num_citations": "56\n", "authors": ["1212"]}
{"title": "Managing information technology with outsourcing: An assessment of employee perceptions\n", "abstract": " Outsourcing is the contracting out of all or part of a companys information systems functions to outside parties. This research provides preliminary findings on the perceptions of IS (Information Systems) professionals on outsourcing. The findings of this study indicate that in order to effectively deal with the human aspects of outsourcing, management must understand what perceptions exist within the employee ranks and develop a plan which addresses employee needs and perceptions. Such a management action plan is presented in this paper.", "num_citations": "49\n", "authors": ["1212"]}
{"title": "The Selection of Computer‐Aided Software Engineering Tools: A Multi‐Criteria Decision Making Approach\n", "abstract": " The selection of the appropriate computer‐aided software engineering (CASE) tools to suit the needs of an organization requires the systematic application of the multi‐criteria decision methodology (MCDM). In order to make a case for the use of MCDM, the application of the ELECTRE I method to the selection of CASE tools from a possible set of six alternatives is demonstrated. The demonstration helps in gaining a grasp of the MCDM approach and the ELECTRE I method. There is potential for the application of the MCDM approach in other software engineering decisions, especially in the feasibility analysis of the systems life cycle.", "num_citations": "38\n", "authors": ["1212"]}
{"title": "An exploratory case study of enterprise resource planning implementation\n", "abstract": " Enterprise Resource Planning (ERP) systems are a growing area of research in business information systems. The primary purpose of this research was to test the effect of ERP implementation on users. We used the implementation and performance stage model and studied issues related to adaptation, acceptance, and routinization stages. An exploratory case study was conducted to study these research issues. The case study consisted of a survey and interview of 25 employees at one organization. The results provide data analysis findings from the survey and qualitative findings from the interview. The findings of the case study point to a positive user climate during transition to SAP, increased user productivity, and improved job understanding through the use of SAP software.", "num_citations": "37\n", "authors": ["1212"]}
{"title": "Balancing four factors in system development projects\n", "abstract": " Introduction The success of system development is most often gauged by three primary indicators: the number of days of deviation from scheduled delivery date, the percentage of deviation from the proposed budget, and meeting the needs of the client users. Tools and techniques to help perform well along these dimensions abound in practice and research. However, the project view of systems development should be broader than any particular development tool or methodology. Any given development philosophy or approach can be inserted into a systems development project to best fit the conditions, product, talent, and goals of the markets and organization. In order to best satisfy the three criteria, system development project managers must focus on the process of task completion and look to apply controls that ensure success, promote learning within the team and organization, and end up with a software …", "num_citations": "36\n", "authors": ["1212"]}
{"title": "An empirical study of the effect of complexity, platform, and program type on software development effort of business applications\n", "abstract": " Several popular cost estimation models like COCOMO and function points use adjustment variables, such as software complexity and platform, to modify original estimates and arrive at final estimates. Using data on 666 programs from 15 software projects, this study empirically tests a research model that studies the influence of three adjustment variables—software complexity, computer platform, and program type (batch or online programs) on software effort. The results confirm that all the three adjustment variables have a significant effect on effort. Further, multiple comparison of means also points to two other results for the data examined. Batch programs involve significantly higher software effort than online programs. Programs rated as complex have significantly higher effort than programs rated as average.", "num_citations": "36\n", "authors": ["1212"]}
{"title": "Dimensionality reduction in software development effort estimation\n", "abstract": " During the last decade, an increasing number of researchers have attempted to address the problem of estimating software development effort. Recent empirical evaluations of the effort estimation models developed to date indicate two problems — model complexity and poor portability. A methodology that works on the notion of reduced dimensionality in the choice of a small set of site-relevant variables is presented. We contend that this methodology could incorporate model simplicity and site specificity in current estimation models. The working of our method is demonstrated and tested using the COCOMO data base. The ability of this method to estimate effort of projects within an acceptable relative error range is studied using discriminant analysis.", "num_citations": "35\n", "authors": ["1212"]}
{"title": "User perception differences in enterprise resource planning implementations\n", "abstract": " Enterprise Resource Planning (ERP) Systems have been developed to help coordinate the information flow that parallels the physical flow of goods, from raw materials to finished goods. The purpose of this study is to examine user perception differences in ERP phases — preparation and training, transition, performance and usefulness, and maintenance phases — for two ERP implementations. Our study uses both qualitative and quantitative research to triangulate our results and provide better insights and findings. Both quantitative and qualitative analysis points to the importance of all the four phases in ERP implementation. However, the study's results point only to differences in the transition and maintenance phases. The preparation and training, and performance and usefulness phases do not have significant difference between the two implementations.", "num_citations": "28\n", "authors": ["1212"]}
{"title": "Estimated GFR and the effect of intensive blood pressure lowering after acute intracerebral hemorrhage\n", "abstract": " BackgroundThe kidney-brain interaction has been a topic of growing interest. Past studies of the effect of kidney function on intracerebral hemorrhage (ICH) outcomes have yielded inconsistent findings. Although the second, main phase of the Intensive Blood Pressure Reduction in Acute Cerebral Hemorrhage Trial (INTERACT2) suggests the effectiveness of early intensive blood pressure (BP) lowering in improving functional recovery after ICH, the balance of potential benefits and harms of this treatment in those with decreased kidney function remains uncertain.Study DesignSecondary analysis of INTERACT2, which randomly assigned patients with ICH with elevated systolic BP (SBP) to intensive (target SBP < 140 mm Hg) or contemporaneous guideline-based (target SBP < 180 mm Hg) BP management.Setting & Participants2,823 patients from 144 clinical hospitals in 21 countries.PredictorsAdmission estimated …", "num_citations": "26\n", "authors": ["1212"]}
{"title": "Outsourcing: Organizational benefits and potential problems\n", "abstract": " Outsourcing | Managing information technology investments with outsourcing ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksManaging information technology investments with outsourcingOutsourcing: organizational benefits and potential problems chapter Outsourcing: organizational benefits and potential problems Share on Authors: Mehdi Khosrowpour profile image Mehdi Khosrowpour View Profile , Girish H Subramanian profile image Girish H. Subramanian View Profile Authors Info & Affiliations Publication: Managing information technology investments with outsourcingJanuary 1995 Pages 244–268 0citation 0 Downloads …", "num_citations": "23\n", "authors": ["1212"]}
{"title": "An empirical study of certain object-oriented software metrics\n", "abstract": " This research focuses on analyzing certain software metrics in an object-oriented (OO) environment. The metrics collected and analyzed includes size, number of message (NOM) sends, reuse, inherited methods, and hierarchical nesting level. The site used is the factory systems department of a large manufacturing company. This department uses SmallTalk as the OO programming language to implement the OO design paradigm. Using automated tools developed in SmallTalk, these metrics were collected from three domain applications comprising 600 classes. Four propositions are empirically tested and the results provided in this study.", "num_citations": "22\n", "authors": ["1212"]}
{"title": "Benchmarking software development productivity of CMMI level 5 projects\n", "abstract": " In this paper, data envelopment analysis variable returns to scale (DEA VRS) model is applied to data collected on 79 software development projects from a leading CMMI level 5 organization. We divide overall software effort into software development effort, software quality conformance effort (EoC), and software maintenance non-conformance (EoNC) effort due to poor software quality at delivery time. Partitioning effort into software development and software quality metrics provides us a comprehensive model to measure productivity of software projects and to identify best practice projects. Some of positive productivity drivers from the DEA best practice efficient projects point to good customer rapport and application familiarity. Inefficient projects had problems such as customer requirements volatility, and the use of unfamiliar technology. The DEA results identify 12 “best practice” projects that can be …", "num_citations": "20\n", "authors": ["1212"]}
{"title": "An empirical study of ICASE learning curves and probability bounds for software development effort\n", "abstract": " In this paper, we investigate the existence of learning curves in software development. Under the assumption of independent and identical distribution (iid) of programmer’s experience and identical effort-experience learning curve relationship for different programmers, we illustrate the existence of an exponentially decreasing learning curve relationship between a programmer’s effort and his/her ICASE tool experience, and show that the effort-experience relationship is inelastic when a programmer’s ICASE tool experience is low. We analyze the impact of our assumptions on actual software development effort, and propose a tight probability upper bound and a central-limit theorem based probability estimator for estimating the approximate probability that the software development effort will be less than or equal to a certain number. Examples to illustrate the use of the probability estimator are also provided.", "num_citations": "20\n", "authors": ["1212"]}
{"title": "Information systems in supply chain management: a comparative case study of three organisations\n", "abstract": " Supply Chain Management (SCM) is recognised as a core competitive strategy for businesses in almost every industry. A strong supply chain provides products and services to consumers faster, cheaper, and better. The paper discusses SCM and information systems in the supply chain. Case studies of Wal-Mart, Amazon.Com and United Parcel Services (UPS) and their use of information systems in the supply chain are presented. Wal-Mart and Amazon have established critical and timely strategies in their supply chains through huge investments in Information Technology (IT). While Wal-Mart and Amazon are offering their products to consumers, UPS offers logistics solutions to clients. These companies use a variety of information technologies which include satellite systems, barcodes, web-based Electronic Data Interchange (EDI), Radio Frequency Identification (RFID), data warehousing, and e-commerce in …", "num_citations": "20\n", "authors": ["1212"]}
{"title": "Connectionist models for learning, discovering, and forecasting software effort: an empirical study\n", "abstract": " Mining information and knowledge from very large databases is recognized as a key research area in the machine learning and expert systems field. We show connectionist models can be used to learn software effort when the available data set is small. We use a connectionist model to learn software effort from a small training data set of several software projects and validate the model on a holdout sample. Several design issues associated with developing connectionist models on a small training data set are described. Our research indicates that connectionist models, whenever carefully designed, could help knowledge discovery and software effort estimation.", "num_citations": "17\n", "authors": ["1212"]}
{"title": "Software effort estimation using a neural network ensemble\n", "abstract": " Accurate software effort estimation is crucial for software consulting organizations to stay competitive in their software development costs and retain customers. Artificial Neural Network (ANN) is an effective tool to obtain accurate effort estimates. In this paper, software effort estimation models using Artificial Neural Network (ANN) ensembles and regression analysis are developed based on data collected from 163 software development projects. The main emphasis of the paper is in developing an effective experimental design to achieve superior effort estimation results. In addition, we compare the software effort estimation of ANNs and multiple regression analysis. We found two interesting results. First, variables other than size (function points) are not especially helpful in predicting software development effort. Second, a properly designed ANN ensemble significantly outperforms estimation using regression …", "num_citations": "16\n", "authors": ["1212"]}
{"title": "Benefits from expert systems: An exploratory investigation\n", "abstract": " This study uses data collected from persons in industry and business to assess benefits derived front expert system technology. This work explores variables linked to expert system benefits from the viewpoint of those working with them. The results show that although expected expert system benefits are often realized, there are differences between benefits expected and those actually realized.", "num_citations": "16\n", "authors": ["1212"]}
{"title": "An empirical evaluation of factors influencing expert systems effectiveness\n", "abstract": " This study explores expert system effectiveness by testing an expert system development model and analyzing the life cycle development process. The objective is to determine the nature of the interactions within the expert system development process and how the process affects expert system effectiveness. The results suggest that life cycle development stages critically impact the overall perception of system effectiveness.", "num_citations": "15\n", "authors": ["1212"]}
{"title": "The development and validation of an instrument to measure preceived strategic value of information systems\n", "abstract": " The authors present the theoretical conceptualization and validation of an instrument to measure the perceptions of top management on the strategic value of information systems (PSVIS). Responses for the PSVIS items from a sample of 71 senior level managers were used in measuring PSVIS. Factor analysis was used to determine the factor loadings and to empirically test the theoretical conceptualization of the dimensions of PSVIS presented. The reliability and validity values of the instrument were both high and indicate high confidence in the measurement of PSVIS.< >", "num_citations": "13\n", "authors": ["1212"]}
{"title": "Systems dynamics-based modeling of data warehouse quality\n", "abstract": " Data warehouses (DW) are a key component of business intelligence and decision-making. In this paper, we present an approach that combines Grounded Theory and System Dynamics to develop causal loop diagrams/models for data warehouse quality and processes. We used the top 51 data warehousing academic papers to arrive at concepts and critical success factors. A simple data warehouse quality causal model and a Data Warehouse Project Initialization Loop Analysis, Data Source Availability & Monitoring Loop Analysis and Data Model Quality and DBMS Quality Analysis models were developed. Visualization of the cause-effect loops and how data warehouse variables are interrelated provide a clear understanding of DW process. Key findings include data quality and data model quality that are more important than DBMS quality for ensuring data warehouse quality, and the number of data entry errors …", "num_citations": "9\n", "authors": ["1212"]}
{"title": "User control of information display in menus\n", "abstract": " Menus are a popular user interrace in information systems, a useful tool in prototyping, and in user validation of information systems (22). The legal battle over the use of Lotus 1-2-3's compatible menu structure by Borland in its spreadsheet package Quattro pro (3), the MS-DOS and Windows menuing software (4, 30) which aid users to use these personal computer operating systems, and the menus used to help users interact with database management systems packages are examples of the popular usage of menus. Menudriven interfaces have received considerable attention through several research studies (2, 5, 27). In the comparison of data flow diagrams and menus in the user validation task, menus provide a better understanding of process (22). Menus are\" more concise, in English, easier and quicker to find answer and to follow flow\"(22). But menus\" leave out too much information and forces one to make …", "num_citations": "6\n", "authors": ["1212"]}
{"title": "An examination of determinants of software testing and project management effort\n", "abstract": " Software estimation research has primarily focused on software effort involved in direct software development. As more and more organizations buy instead of building software, more effort is spent on software testing and project management. In this empirical study, the effect of program duration, computer platform, and software development tool (SDT) on program testing effort and project management effort is studied. The study results point to program duration and software tool as significant determinants of testing and management effort. Computer platform, however, does not have an effect on testing and management effort. Furthermore, the mean testing effort for third generation (3G) development environment was significantly higher than the mean testing effort for fourth generation (4G) environments that used IDE. In addition, the management effort for 4G environment projects without the use of IDE was lower …", "num_citations": "5\n", "authors": ["1212"]}
{"title": "Predicting re-hospitalisations using intelligent systems: an exploratory study\n", "abstract": " Intelligent systems and knowledge management are shown to have wide ranging applications for businesses. In healthcare, applications of expert systems and knowledge management have been popular since the use of MYCIN in the 1970s. In this research, we study the use of intelligent systems in the prediction of re-hospitalisations. A Bayesian network, an artificial neural network using multilayer perception, an artificial neural network using radial basis function, a support vector machine and an expert system (five intelligent systems) were used in the prediction. All the models except the support  vector machine were able to provide good prediction of re-hospitalisation  (with AUC > 0.6) and complete risk stratification for re-hospitalisation within 30 days of discharge with data available at admission, showing great promise for future application of intelligent systems in healthcare.", "num_citations": "5\n", "authors": ["1212"]}
{"title": "Perceived strategic value of information systems: measurement, determinants, and effects\n", "abstract": " Busch et al.(1991) report Lhal the Chief Executive Officer's (CEO) perception of Information Technology (IT) importance had the strongest effect on the progressive use of IT in the firm. They advocate additional research on the perceptions of the CEO and other top management of the value of IT. The perceptions of top management on the strategic value of infonnation systems (PSVIS) are classified into three types based on a review of the strategic use of information systems literature. The first type is the perception of a support role for information systems (PSVISSUP). This role is supported in the work of Porter and Millar (1985), Kim and Michelman (1990), and other frameworks based on Porter's (1980) work. The second is the perception of information systems as managerial productivity enhancement tools (PSVISPRO). The evidence for this role is seen from the fact that data sharing and communication across departments and the high penetration and use of office automation and communication technology were expressed as needs by CEOs from information technology departments (Moynihan 1990). The third type is the perception of information systems as strategic decision aid tools (PS VISSTR). An example of this role would be the use of Group Decision Support Systems (GDSS) in supporting competitive analysis as illustrated in Dennis, Nunamaker, auid Paranka (1991). Inter-organizational information systems (Johnston and Vitale 1988) are incorporated in the support perception as linkages to suppliers and in the strategic decision aid perception as cooperative partnerships. Responses for the items iii the PSVIS instrument froin as: unple …", "num_citations": "5\n", "authors": ["1212"]}
{"title": "ERP Implementation model, research findings, and its applications to government\n", "abstract": " An ERP implementation model is developed with the help of a review of relevant literature. This implementation model has four phases: preparation and training, transition, performance and usefulness, and maintenance. Research findings from our study provide empirical support for the ERP implementation model. For the purpose of this chapter, we use content analysis of the structured interviews to come up with solutions and recommendations for ERP implementation in government. We finally present the conclusion and future directions.", "num_citations": "4\n", "authors": ["1212"]}
{"title": "A probabilistic model for predicting software development effort\n", "abstract": " We use the naïve Bayes model to forecast software effort. A causal model is developed from the literature, and a procedure to learn Bayesian prior and conditional probabilities is provided. Using a data set of 40 real-life software projects we test our model. Our results indicate that the probabilistic forecasting models allow managers to estimate joint probability distribution over different software effort estimates. A software project manager may use the joint probability distribution to develop a cumulative probability distribution, which in turn may help the manager estimate the uncertainty that the project effort may be greater than the estimated effort.", "num_citations": "4\n", "authors": ["1212"]}
{"title": "A COMPARISON OF VOICE MAIL AND INFORMATION RETRIEVAL SYSTEMS ON TECHNOLOGY ACCEPTANCE AND INFORMATION CHARACTERISTICS\n", "abstract": " This material is brought to you by the Americas Conference on Information Systems (AMCIS) at AIS Electronic Library (AISeL). It has been accepted for inclusion in AMCIS 1996 Proceedings by an authorized administrator of AIS Electronic Library (AISeL). For more information, please contact elibrary@ aisnet. org.", "num_citations": "4\n", "authors": ["1212"]}
{"title": "An empirical examination of software development modes\n", "abstract": " Organic, embedded, and semidetached are three software development modes conceptualized by Boehm. The presence of these three modes is empirically tested in this study. This study also aims to identify the software development attributes that distinguish these development modes. The identification of these attributes will help us suggest a systematic way to classify a software project based on these attributes into one of the modes.", "num_citations": "4\n", "authors": ["1212"]}
{"title": "Implementation of Enterprise Resource Planning (ERP) Systems: Issues and Challenges\n", "abstract": " Enterprise resource planning (ERP) systems are a growing area of research in business information systems. The primary purpose of this research is to review the literature on ERP implementation and to present results of a case study on ERP implementation. An exploratory case study was conducted to study these research issues. The case study consisted of a survey and interview of 25 employees at one organization. The results provide data analysis findings from the survey and qualitative findings from the interview. Using this case study, the chapter indicates the presence of four phases in ERP implementation through the support from qualitative interviews. Using t-tests, the results confirm the presence of a positive feeling of users toward the four ERP implementation phases.", "num_citations": "3\n", "authors": ["1212"]}
{"title": "An Empirical Study of Learning Curve Theory's application to the Software Development Effort-Experience Relationship in Software Engineering and Project Management\n", "abstract": " The experience of software developers in a given tool is often perceived as an endogenous factor in software cost estimation. Many manufacturing applications have modeled resources devoted to output production, and worker’s knowledge as learning curves. In this paper, we use and test the learning curve theory in software industry. We illustrate that a programmer’s effort exponentially decreases as his/her tool experience increases. After certain amount of tool-experience, the effort reduction asymptotically stabilizes. We believe that the learning curve theory and its application provide an excellent opportunity for IT project managers to better utilize the experience of their software personnel.", "num_citations": "2\n", "authors": ["1212"]}
{"title": "User perceptions of voice mail technology: A comparative study of internal and external users\n", "abstract": " User perceptions of usefulness and ease of information technology have been shown by empirical research to influence technology usage and acceptance. The effect of user type, internal or external user, on the user perceptions of voice mail technology is the subject of this empirical research. User type has a significant effect on user perceptions of usefulness and ease of use of voice mail. Further, internal users perceive voice mail to be more useful and easier to use in comparison to the perceptions of external users. Finally, these results are used to help devise a technology transition framework for voice mail introduction and usage in organizations.", "num_citations": "2\n", "authors": ["1212"]}
{"title": "Connectionist and evolutionary models for learning, discovering and forecasting software effort\n", "abstract": " Mining information and knowledge from very large databases is recognized as a key research area in machine learning and expert systems. In the current research, we use connectionist and evolutionary models for learning software effort. Specifically, we use these models to learn the software effort from a set of training data set containing information on software projects and test the performance of the model on a holdout sample. The design issues of developing connectionist and evolutionary models for mining software effort patterns on a data set are described. Our research indicates that connectionist and evolutionary models, whenever carefully designed, hold a great promise for knowledge discovery and forecasting software effort.", "num_citations": "1\n", "authors": ["1212"]}
{"title": "A Delphi Study Of Web-Enabled Technologies: Identification And Prioritization Of Critical Issues\n", "abstract": " The role of the Internet as an enabling technology is critical to the strategic planning of national and local governments, educational institutions, hospitals, manufacturing as well as non-manufacturing companies, and increasingly, for small organizations as much as for larger ones. Like other technologies, the path to effective assimilation of Internet-based technologies has not been free of problems and challenges. This paper presents the results of a Delphi study to identify and rank critical issues for effective deployment of Internet-based technologies in organizations. The critical issues identified in this study provide valuable insights for formulating strategies for the overall utilization and management of Web-enabled technologies in organizations.", "num_citations": "1\n", "authors": ["1212"]}
{"title": "Performance difference between user customized and standard designer provided interfaces: An empirical study of organizational users\n", "abstract": " Customizing or personalizing user interfaces is a current development in software design. This study empirically examines the effectiveness of the customized interface vs. the standard designer provided interface with respect to accuracy and time for completion of tasks. This study reports an experiment with organizational users performing computer tasks similar to their job-related computer activities. Performance differences between the interfaces, observed in an earlier study with student samples, were supported with organizational users. Customized interface outperformed the standard designer provided interface in our research study.", "num_citations": "1\n", "authors": ["1212"]}
{"title": "A methodology to attain site specificity and model simplicity in software development effort estimation\n", "abstract": " The dissertation seeks to develop an improved method of Software Development Effort Estimation. Software development effort estimation helps in estimating the person-months for the software project and is useful in:(1) aiding the marketing function for making realistic quotes,(2) ensuring that cost estimates are realistic and reasonable profits are feasible,(3) answering the\" make or buy\" software decision, and (4) manpower and resource planning for software development.", "num_citations": "1\n", "authors": ["1212"]}