{"title": "Testing Web-based applications: The state of the art and future trends\n", "abstract": " Software testing is a difficult task and testing Web-based applications may be even more difficult, due to the peculiarities of such applications. In the last years, several problems in the field of Web-based applications testing have been addressed by research work, and several methods and techniques have been defined and used to test Web-based applications effectively. This paper will present the main differences between Web-based applications and traditional ones, how these differences impact the testing of the former ones, and some relevant contributions in the field of Web application testing developed in recent years. The focus is mainly on testing the functionality of a Web-based application, even if some discussion about the testing of non-functional requirements is provided too. Some indications about future trends in Web application testing are also outlined in the paper.", "num_citations": "280\n", "authors": ["72"]}
{"title": "Testing web applications\n", "abstract": " The rapid diffusion of Internet and open standard technologies is producing a significant growth of the demand of Web sites and Web applications with more and more strict requirements of usability, reliability, interoperability and security. While several methodological and technological proposals for developing Web applications are coining both from industry and academia, there is a general lack of methods and tools to carry out the key processes that significantly impact the quality of a Web application (WA), such as the validation & verification (V&V), and quality assurance. Some open issues in the field of Web application testing are addressed in this paper. The paper exploits an object-oriented model of a WA as a test model, and proposes a definition of the unit level for testing the WA. Based on this model, a method to test the single units of a WA and for the integration testing is proposed. Moreover, in order to …", "num_citations": "266\n", "authors": ["72"]}
{"title": "WARE: A tool for the reverse engineering of web applications\n", "abstract": " The development of Web sites and applications is increasing dramatically to satisfy the market requests. The software industry is facing the new demand under the pressure of a very short time-to-market and an extremely high competition. As a result, Web sites and applications are usually developed without a disciplined process: Web applications are directly coded and no, or poor, documentation is produced to support the subsequent maintenance and evolution activities, thus compromising the quality of the applications. This paper presents a tool for reverse engineering Web applications. UML diagrams are used to model a set of views that depict several aspects of a Web application at different abstraction levels. The recovered diagrams ease the comprehension of the application and support its maintenance and evolution. A case study, carried out with the aim of assessing the effectiveness of the proposed tool …", "num_citations": "140\n", "authors": ["72"]}
{"title": "Reverse engineering Web applications: the WARE approach\n", "abstract": " The rapid, progressive diffusion of Web applications in several productive contexts of our modern society is laying the foundations of a renewed scenario of software development, where one of the emerging problems is that of defining and validating cost‐effective approaches for maintaining and evolving these software systems. Due to several factors, the solution to this problem is not straightforward. The heterogeneous and dynamic nature of components making up a Web application, the lack of effective programming mechanisms for implementing basic software engineering principles in it, and undisciplined development processes induced by the high pressure of a very short time‐to‐market, make Web application maintenance a challenging problem. A relevant issue consists of reusing the methodological and technological experience in the sector of traditional software maintenance, and exploring the …", "num_citations": "134\n", "authors": ["72"]}
{"title": "Identifying cross site scripting vulnerabilities in web applications\n", "abstract": " Cross site scripting (XSS) is a vulnerability of a Web application that is essentially caused by the failure of the application to check up on user input before returning it to the client's Web browser. Without an adequate validation, user input may include malicious code that may be sent to other clients and unexpectedly executed by their browsers, thus causing a security attack. Techniques to prevent this type of attacks require that all application input must be checked up and filtered, encoded, or validated before sending them to any user. In order to discover the XSS vulnerabilities in a Web application, traditional source code analysis techniques can be exploited. In this paper, in order to assess the XSS vulnerability of a Web application, an approach that combines static and dynamic analysis of the Web application is presented. Static analysis based criteria have been defined to detect potential vulnerabilities in the …", "num_citations": "130\n", "authors": ["72"]}
{"title": "Comprehending web applications by a clustering based approach\n", "abstract": " The number and complexity of Web applications are increasing dramatically to satisfy market needs, and the need of effective approaches for comprehending them is growing accordingly. Recently, reverse engineering methods and tools have been proposed to support the comprehension of a Web application; the information recovered by these tools is usually rendered in graphical representations. However, the graphical representations become progressively less useful with large-scale applications, and do not support adequately the comprehension of the application. To overcome this limitation, we propose an approach based on a clustering method for decomposing a Web application (WA) into groups of functionally related components. The approach is based on the definition of a coupling measure between interconnected components of the WA that takes into account both the typology and topology of the …", "num_citations": "85\n", "authors": ["72"]}
{"title": "Recovering use case models from object-oriented code: a thread-based approach\n", "abstract": " Use case models describe the behavior of a software system from the user's perspective. This paper presents a reverse engineering approach for recovering a use case model from object-oriented code. The approach identifies use cases by analyzing class method activation sequences triggered by input events and terminated by output events. The approach produces a structured use case model including diagrams at various levels of abstraction, comprising actors, use cases, associations between actors and use cases, and relationships among use cases. A case study carried out to validate the approach on a C++ small-sized system, produced encouraging results, showing the approach feasibility and highlighting aspects of the approach requiring further investigation.", "num_citations": "65\n", "authors": ["72"]}
{"title": "Recovering class diagrams from data-intensive legacy systems\n", "abstract": " Several reverse engineering methods for recovering objects from legacy systems have been proposed in the literature, but most of them neglect to identify the relationships among the objects, or recover only a part of them. The paper describes a method for recovering an OO (object oriented) model together with the objects and relationships among them. The proposed approach integrates the results of reverse engineering of both the procedural code and the persistent data stores of the system, and exploits a number of heuristic criteria to obtain a class diagram. A preliminary experiment carried out to validate the method on a COBOL medium-sized system yielded encouraging results.", "num_citations": "44\n", "authors": ["72"]}
{"title": "Abstracting business level UML diagrams from web applications\n", "abstract": " In this paper, a reverse engineering approach for reconstructing UML diagrams at business level of the application domain of a Web application is presented. In particular, the approach allows the reconstruction of the UML class diagram providing an object-oriented conceptual model of the application domain, sequence diagrams modeling the interactions among the identified business objects and use case diagrams modeling the user functionalities provided by the Web Application. Heuristic criteria exploiting source code analysis are used for recovering the diagrams. Tools for implementing these criteria have been produced, and experiments for validating them have been carried out with the support of case studies. Experimental results showed the feasibility and the effectiveness of the proposed approach.", "num_citations": "42\n", "authors": ["72"]}
{"title": "Web site accessibility: Identifying and fixing accessibility problems in client page code\n", "abstract": " Web accessibility is an important issue to address along Web application development. Accessibility aims to allow the access to the content of the Web application even in presence of reduced hardware/software configurations on the client side of the application (such as browser configurations disabling graphical visualization, or scripting execution), or of users with physical disabilities (such as blind people). Some guidelines and rules have been defined by several organizations to grant and assess Web accessibility. This paper presents an approach to verify if the code of client pages of an existing application does not meet some accessibility rules or guidelines, making the application not accessible to some groups of users. A model representing the several features involved in the identification of accessibility problems that client page code may contain has been defined. This model is mainly based on the recent …", "num_citations": "30\n", "authors": ["72"]}
{"title": "Testing aspect oriented programs: an approach based on the coverage of the interactions among advices and methods\n", "abstract": " Testing is a fundamental issue to ensure software quality. Testing aspect oriented programs may be more difficult than traditional ones, due to the large impact that aspects have on the static structure and dynamic behavior of the overall system. Aspects may be sources for failures due to new kinds of faults in their code, by affecting the overall quality of the system. New testing approaches and criteria, taking into account the aspect-oriented constructs, are needed to capture the new kind of program failures. In this paper we propose a set of testing coverage criteria based on the interactions among the advices and the methods they affect. The proposed criteria are based on the inter-procedural aspect control flow graph (IACFG) representing the inter-procedural interactions among advices and methods.", "num_citations": "24\n", "authors": ["72"]}
{"title": "A model-driven approach for the fast prototyping of web applications\n", "abstract": " This paper presents an approach for the model-driven fast prototyping of Web applications. The approach exploits well known Model-Driven Engineering frameworks and technologies, such as Eclipse EMF, GMF, and Xpand, to enable the design of a Web application and the automatic generation of the code artifacts implementing a ready to deploy prototype of it. The approach allows to effortlessly and quickly carry out a modeling-generation-validation process in order to validate and refining the design of a Web application before actually implementing it. The paper describes the approach and the process followed to define it, the supporting tools and the technologies used to develop them, and the results from a case study of designing and generating the prototype of a Web application for on-line note taking and sharing. The process and the technologies used to develop the proposed approach can be reused to …", "num_citations": "21\n", "authors": ["72"]}
{"title": "An Aspect-Oriented Programming-based approach to software development for fault detection in measurement systems\n", "abstract": " An Aspect-Oriented Programming-based approach to the development of software components for fault detection in automatic measurement systems is proposed. Faults are handled by means of specific software units, the “aspects”, in order to better modularize issues transversal to several components. As a case study, this approach was applied to the design of the fault detection software inside a flexible framework for magnetic measurements, developed at the European Organization for Nuclear Research (CERN). Experimental results of software modularity and performance measurements for comparing aspect- and object-oriented solutions in rotating coils tests on superconducting magnets are reported.", "num_citations": "21\n", "authors": ["72"]}
{"title": "The re-uwa approach to recover user centered conceptual models from web applications\n", "abstract": " Large-scale Web Applications, especially those intended to publish contents and provide information to its users, are by nature subject to continuous and fast changes. This often means fast obsolescence of the design documentation and a lot of effort required to comprehend the application when performing maintenance and evolution tasks. This paper presents a reverse engineering approach for Web Applications enabling the semi-automatic recovery of user-centered conceptual models describing, from a user perspective, key aspects, such as the delivered contents and navigational paths. The abstracted models are formalized according to the Ubiquitous Web Applications (UWA) design methodology, but any other design method for Web Applications could be used instead. The paper describes the recovery process, a tool developed to support the process, and the results from a case study conducted to …", "num_citations": "19\n", "authors": ["72"]}
{"title": "A technique for reducing user session data sets in web application testing\n", "abstract": " Exploiting user session data is a promising approach for testing a Web application. However, the effectiveness of user session testing techniques depends on the set of collected user session data: the wider this set, the greater the capability of the approach to detect failures, but the wider the user session data set, the greater the cost of collecting, analysing and storing data. In this paper, a technique for reducing a set of user sessions into an equivalent smaller one will be proposed. This technique allows equivalent user behaviours included in user sessions to be identified and classified, and produces a reduced set of user sessions that can be used to design test suites with a reduced effort. Some preliminary case studies were carried out to validate the proposed technique and to evaluate its effectiveness. Results of a case study will be presented in the paper", "num_citations": "19\n", "authors": ["72"]}
{"title": "Improving design pattern quality using aspect orientation\n", "abstract": " Object oriented (OO) implementations of design patterns (DP) may suffer of some problems due to deficiencies of (OO) languages affecting some quality attributes such as modularity, comprehensibility, maintainability and testability. Aspect oriented programming (AOP) provides powerful constructs able to better handle modularity and composition; these constructs can help to overcome some of the trade-offs in current OO implementations of DPs. An approach to re-implement DPs by AOP is presented in this paper: some different AOP re-implementations of DPs in existing systems from real world have been performed to improve DPs quality. A set of existing metrics has been used to evaluate the quality of the different AOP implementations. Such an evaluation helps to select the implementation to use/reuse in a specified context", "num_citations": "17\n", "authors": ["72"]}
{"title": "An interprocedural aspect control flow graph to support the maintenance of aspect oriented systems\n", "abstract": " Aspect oriented programming (AOP) supports the cross-cutting of concerns by means of aspects. The maintenance of AO systems may be more difficult than 'traditional' ones, due to the large impact that aspects have on the static structure and dynamic behavior of the overall system. In this paper an inter-procedural aspect control flow graph is proposed to represent the interactions among the aspects and the object oriented (OO) components of an AO system. The graph allows an easier identification of the impact between aspects and the OO components. It helps the maintainer to identify sources of undesired side and ripple effects in the code and avoid the introduction of new ones when modifying an AOP system.", "num_citations": "16\n", "authors": ["72"]}
{"title": "Recovering conceptual models from web applications\n", "abstract": " This paper proposes a reverse engineering approach for abstracting conceptual user-centered models from existing Web applications to re-document them at a high level of abstraction and from a user perspective. The recovered models are specified by referring to the Ubiquitous Web Application (UWA) design methodology. UWA models are able to describe the structure of the application contents, the semantic relations among contents, the different views on contents the application offers to users, and the navigation paths and the navigation nodes used to present contents to users. The approach exploits existing reverse engineering methods and tools to extract fine grained structural information from the analyzed applications and abstracts UWA models from them. The architecture of a tool to support the reverse engineering approach is described and the results from some preliminary experiments are discussed.", "num_citations": "16\n", "authors": ["72"]}
{"title": "Recovering interaction design patterns in web applications\n", "abstract": " In the last years, appropriate user interaction design patterns for Web applications have been defined to improve the development and quality of such applications. Identifying which interaction design patterns are implemented in the Web client pages of an existing application may make easier some maintenance tasks, such as the re-engineering of the user interfaces. In this paper a method to support the automatic identification of interaction design patterns implemented in a Web client page is proposed. The method is based on reverse engineering techniques aiming to search the page code for those features characterizing a pattern.", "num_citations": "16\n", "authors": ["72"]}
{"title": "Model-driven detection of Design Patterns\n", "abstract": " Tracing source code elements of an existing Object Oriented software system to the components of a Design Pattern is a key step in program comprehension or re-engineering. It helps, mainly for legacy systems, to discover the main design decisions and trade-offs that are often not documented. In this paper an approach is presented to automatically detect Design Patterns in existing Object Oriented systems by tracing system's source code components to the roles they play in the Patterns. Design Patterns are modelled by high level structural Properties (e.g. inheritance, dependency, invocation, delegation, type nesting and membership relationships) that are checked, by source code parsing, against the system structure and components. The approach allows to detect also Pattern variants, defined by overriding the Pattern structural properties. The approach was applied to some open-source systems to validate it …", "num_citations": "15\n", "authors": ["72"]}
{"title": "Model-driven fast prototyping of RIAs: From conceptual models to running applications\n", "abstract": " Fast prototyping is a quick and cost effective development of a (minimum) viable version of a software useful to some purpose (e.g., requirements verification or design validation), which can be discarded or refactored to become the version of the software to be delivered. In this paper we propose a model-driven approach for the fast prototyping of Rich Internet Applications (RIAs). Starting from the conceptual model of a RIA, intermediate models and the source code of a ready-to-deploy application prototype are automatically generated through a model-driven development process which exploits well known model-driven engineering frameworks and technologies including Eclipse EMF, GMF, and Xpand. Compared to traditional, non model-driven, prototyping approaches, our proposal allows to drastically reduce the overall prototyping effort to just the effort required to define the conceptual model of the application …", "num_citations": "12\n", "authors": ["72"]}
{"title": "Maintenance and intermodular dependencies in Pascal environment\n", "abstract": " The authors outline the important role that actual and (mainly) potential intermodular dependencies play in the maintenance phase of a software product. They discuss the problem with reference to Pascal systems and they show how reverse engineering and static code analysis enable the identification of the actual and potential intermodular data flow and relationships. Some constraints are proposed to prevent an uncontrollable proliferation of data binding among modules and their reciprocal calls. To achieve the consistency of the programs with respect to the adopted constraints, the intermodular dependency knowledge, as produced by reverse engineering, is used to restructure both data and module declarations.< >", "num_citations": "12\n", "authors": ["72"]}
{"title": "Aspect oriented-based software synchronization in automatic measurement systems\n", "abstract": " An aspect-oriented approach to software synchronization in automatic measurement systems is proposed. Tasks are synchronized by means of \"aspects \", a specific software unit to better modularize issues transversal to many modules (\"crosscutting concerns\"). In this way, maintainability and reusability of a measurement software are improved: once a modification in the synchronization policy occurs, only the related aspects have to be modified. As a case study, this technique is applied to the software synchronization of motors for actuators in a generic measurement station.", "num_citations": "11\n", "authors": ["72"]}
{"title": "Conan: A tool for the identification of crosscutting concerns in object oriented systems based on type hierarchy analysis\n", "abstract": " In Object Oriented systems the analysis of Type Hierarchies allows to identify class members that are scattered and tangled along each hierarchy, thus contributing to the implementation of static crosscutting concerns. This paper presents ConAn: a tool to automatically analyze the Type Hierarchies in an existing system and to identify the Type Fragments (i.e. a portion of a Type in terms of its members and relationships) implementing static crosscutting concerns. The structural information about the Type Fragments composing each concern and the crosscutting relationships among them are useful to drive their re-engineering towards Aspects.", "num_citations": "10\n", "authors": ["72"]}
{"title": "A role-based crosscutting concerns mining approach to evolve java systems towards aop\n", "abstract": " A key step in the evolution of a Java system towards the aspect oriented paradigm is the identification of crosscutting concerns that need to be refactored.", "num_citations": "10\n", "authors": ["72"]}
{"title": "Recovering a conceptual data model from cobol code\n", "abstract": " Recovering a Conceptual Data Model from Cobol Code IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS Archivio della ricerca dell'Università degli studi del Sannio Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Recovering a Conceptual Data Model from Cobol Code Italiano Italiano English Recovering a Conceptual Data Model from Cobol Code / G. Canfora; A. Cimitile; Di Lucca G. - (1996). ((Intervento presentato al convegno 8th International Conference on Software Engineering & Knowledge Engineering SEKE '96 tenutosi a Lake Tahoe, Nevada, USA nel June 10-12, 1996. Scheda breve Scheda completa Titolo: Recovering a Conceptual Data Model from Cobol Code Autori interni: CANFORA, Gerardo CIMITILE, Aniello DI LUCCA, Giuseppe Antonio Data di : 1996 : ://…", "num_citations": "9\n", "authors": ["72"]}
{"title": "Improving Design Patterns Finder Precision Using a Model Checking Approach.\n", "abstract": " In this paper we propose an approach exploiting the model checking technique to automatically refine the results produced by a Design Patterns mining tool called Design Pattern Finder (DPF) to improve the precision of its results by verifying the detected DPs automatically. To assess the feasibility of the proposed approach along with its effectiveness, we have applied it to an open source Object Oriented system with good results in improving the precision of the detected DPs.", "num_citations": "8\n", "authors": ["72"]}
{"title": "Web pages classification using concept analysis\n", "abstract": " Analysis and classification of Web application user interfaces is a relevant problem in Web maintenance processes. This paper presents an approach for the reliable classification of HTML pages of a dynamic Web application. The approach is based on the assumption that groups of semantically equivalent built pages are characterized by the same key features which can be used for discriminating the pages. These features are obtained by an iterative process that exploits formal concept analysis for finding features that are specific for each class of pages. The process is supported by a toolkit that allows an effective definition of the discriminating features. The approach has been preliminarily validated with an experiment that produced encouraging results.", "num_citations": "8\n", "authors": ["72"]}
{"title": "Fault self-defection of automatic testing systems by means of aspect-oriented programming\n", "abstract": " An Aspect Oriented approach to implement fault detection in automatic measurement systems is proposed. Faults are handled by means of “aspects”, a specific software unit to better modularize issues transversal to many modules (“crosscutting concerns”). In this way, maintainability and reusability of a measurement software are improved: indeed, once a modification of the fault detection policy occurs, only the related aspects have to be modified. As an experimental case study, this technique has been applied to the fault self-detection of a flexible framework for magnetic measurements, developed at the European Organization for Nuclear Research (CERN).", "num_citations": "7\n", "authors": ["72"]}
{"title": "Supporting the Comprehension of Object-oriented Software Systems by Extended MM Graph.\n", "abstract": " SUPPORTING THE COMPREHENSION OF OBJECT-ORIENTED SOFTWARE SYSTEMS BY EXTENDED MM GRAPH Mario Luca Bernardi, Giuseppe Antonio Di Lucca RCOST Research Centre on Software Technology Dept. of Engineering University of Sannio Palazzo ex Poste, via Traiano, 82100 Benevento, Italy dilucca/mlbernar@unisannio.it ABSTRACT Tracing user functional requirements to the source code components implementing them is a difficult, time con- suming and expensive software comprehension task, spe- cially when adequate documentation is absent. In object- oriented systems functional requirements are implemented by a chain of method activations started by an input event and terminating when an output event is generated. Such a chain may be modelled by the Method-Message Graph that has been used to effectively support the identification of sequences of method activations of a given /…", "num_citations": "7\n", "authors": ["72"]}
{"title": "Research directions in web systems evolution IV: Migrating to the cloud\n", "abstract": " Cloud computing is gaining momentum in part because it enables a distributed systems infrastructure that offers more advantages than traditional ones. It provides a hosted environment of virtualized hardware, effectively unlimited storage, and software services that can aid in system development and deployment. This session is the fourth in a series of special events held at WSE focused on selected aspects of research directions in Web systems evolution, and the second session focused on issues related to migrating Web applications to the cloud.", "num_citations": "6\n", "authors": ["72"]}
{"title": "Analysing object type hierarchies to identify crosscutting concerns\n", "abstract": " In Object Oriented (OO) systems super-imposition is a way to implement crosscutting concerns that introduce scattering and tangling of code components among the Types implemented along Type Hierarchies. This paper presents the results of the analysis of a set of existing Java systems to confirm and verify this assumption. The analysis was carried out exploiting a method to automatically analyse and identify the Type Fragments implementing static crosscutting concerns in OO systems.", "num_citations": "6\n", "authors": ["72"]}
{"title": "The conan tool to identify crosscutting concerns in object oriented systems\n", "abstract": " This paper presents the main features of ConAn, a tool supporting an approach to find scattered and tangled class members in OO systems and to group them in concerns. The recovered information is useful for refactoring/migration tasks, such as towards Aspect Oriented Programming (AOP).", "num_citations": "5\n", "authors": ["72"]}
{"title": "UsCaAb: a tool for abstracting use case diagrams\n", "abstract": " The Use Case Abstractor (UsCaAb) tool automatically recovers use case diagrams from C++ and Java software systems. The target system is represented by the E-M-M graph; hence this graph is analysed to identify groups of related components implementing the use-cases and the relationships among them. The aim of the tool is to provide software engineers with a useful and extensible environment supporting program comprehension, software maintenance and testing tasks.", "num_citations": "5\n", "authors": ["72"]}
{"title": "Controlling side-effects in maintenance\n", "abstract": " Each time a maintenance operation is performed on a program the overall quality of a software system can rapidly decrease because of the introduction of side effects. Such side effects are due to the relationships existing between the components of a software system, and these can be classified into potential relationships and actual relationships. Successful maintenance requires knowledge of both actual and potential relationships in order to avoid, or at least reduce to a minimum, the introduction of side-effects.               A method is proposed to analyze both potential and actual relationships existing in programs coded by a language with strict scope and visibility rules. The method is based on the definition, use and computation of some Boolean matrices and allows the identification of the software units that will be affected by a modification involving data references in a software unit.", "num_citations": "5\n", "authors": ["72"]}
{"title": "An approach to reuse reengineering of existing software\n", "abstract": " An approach to Reuse Reengineering of Existing Software IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS Archivio della ricerca dell'Università degli studi del Sannio Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno An approach to Reuse Reengineering of Existing Software Italiano Italiano English An approach to Reuse Reengineering of Existing Software / Canfora, G.; Cimitile, A.; De Carlini, U.; Di Lucca, G. - (1992). ((Intervento presentato al convegno ERCIM Workshop on Methods and Tools for Software Reuse tenutosi a Heraklion, Crete, Greece nel October 29-30,1992. Scheda breve Scheda completa Titolo: An approach to Reuse Reengineering of Existing Software Autori interni: CANFORA, Gerardo CIMITILE, Aniello DI LUCCA, Giuseppe Antonio mostra contributor :…", "num_citations": "5\n", "authors": ["72"]}
{"title": "A metric model for aspects' coupling\n", "abstract": " Aspect Oriented Programming (AOP) introduces new types of coupling among the aspects and the components of the base system. Indeed, several and different new kinds of interactions among aspects and the other components can be introduced by the AOP constructs, allowing the alteration both of the structure, control and data flow of the components of the base system. These interactions can make higher the complexity of the overall system affecting its comprehension.", "num_citations": "4\n", "authors": ["72"]}
{"title": "Kernel Design of a Flexible Software Framework for Magnetic Measurements at CERN\n", "abstract": " The kernel design of the flexible framework for magnetic measurements (FFMM), under development at the European Organization for Nuclear Research (CERN), is described. The design aims at satisfying the critical scenario of short-term requirement variability for the small batches of magnets after the commissioning for the large hadron collider (LHC). The experimental test results of software flexibility and scalability are illustrated for a case study of superconducting magnets in warm and cold on-field conditions.", "num_citations": "4\n", "authors": ["72"]}
{"title": "Guest editor's introduction: 10th conference on software maintenance and reengineering\n", "abstract": " Editorial: Guest Editor's Introduction: 10th Conference on Software Maintenance and Reengineering: Journal of Systems and Software: Vol 81, No 4 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Journal of Systems and Software Periodical Home Latest Issue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsJournal of Systems and SoftwareVol. , No. Editorial: Guest Editor's Introduction: 10th Conference on Software Maintenance and Reengineering article Editorial: Guest Editor's Introduction: 10th Conference on Software Maintenance and Reengineering Share on Authors: Giuseppe Antonio Di Di Lucca profile image Giuseppe A. Di Lucca RCOST - Research Centre on , :…", "num_citations": "4\n", "authors": ["72"]}
{"title": "Identifying reusable components in web applications.\n", "abstract": " IDENTIFYING REUSABLE COMPONENTS IN WEB APPLICATIONS Giuseppe Antonio Di Lucca*, Anna Rita Fasolino, Porfirio Tramontana, Ugo De Carlini dilucca@unisannio.it, fasolino@unina.it, ptramont@unina.it, decarl@unina.it *RCOST -Research Centre on Software Technology, University of Sannio via Traiano, Palazzo ex Poste, 82100 Benevento, Italy Dipartimento di Informatica e Sistemistica, Università di Napoli Federico II Via Claudio, 21, 80125 Napoli, Italy Abstract This paper presents an approach for identifying reusable software components within Web applications by exploiting clone analysis techniques. The approach is based on a classification of software clones in Web applications proposed in the paper, and exploits a structured process that allows clones to be detected in existing applications, and used to populate a repository of reusable components. A tool that supports the identification of has , . '…", "num_citations": "4\n", "authors": ["72"]}
{"title": "Recovering object classes and inheritance relationships from existing code\n", "abstract": " Recovering object classes and inheritance relationships from existing code IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS Archivio della ricerca dell'Università degli studi del Sannio Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Recovering object classes and inheritance relationships from existing code Italiano Italiano English Recovering object classes and inheritance relationships from existing code / Canfora, G; Di Lucca, Giuseppe A.; Tortorella, Maria. - (1994). Scheda breve Scheda completa Titolo: Recovering object classes and inheritance relationships from existing code Autori interni: CANFORA, Gerardo DI LUCCA, Giuseppe Antonio TORTORELLA, Maria Data di pubblicazione: 1994 Handle: http://hdl.handle.net/20.500./10748 Appare nelle tipologie: 4.1 in Atti :…", "num_citations": "4\n", "authors": ["72"]}
{"title": "Identifying the crosscutting among concerns by methods’ calls analysis\n", "abstract": " Aspect Oriented Programming allows a better separation and encapsulation of the (crosscutting) concerns by means of the “aspects”. This paper proposes an approach to identify and analyze the crosscutting relationships among identified concerns with respect to the concerns’ structure (in terms of source code elements) and their interactions due to the calls among methods. The approach has been applied to several software systems producing valid results.", "num_citations": "3\n", "authors": ["72"]}
{"title": "An aspect oriented-based architectural framework for synchronization in measurement systems\n", "abstract": " An Aspect-Oriented approach to software synchronization in automatic measurement systems is proposed. Tasks are synchronized by means of “aspects”, a specific software unit to better modularize properties and features transversal to many modules (“crosscutting concerns”). In this way, maintainability and reusability of a measurement software are improved: once a modification in the synchronization policy occurs, only the related aspects have to be modified. As an experimental case study, this technique is applied to the software synchronization of a measurement station for testing superconducting magnets at the European Organization for Nuclear Research (CERN).", "num_citations": "3\n", "authors": ["72"]}
{"title": "An algebraic notation for representing threads in object oriented software comprehension\n", "abstract": " In object oriented systems a thread represents a chain of method activations started by an input event and terminating when an output event is generated. Functional requirements can be implemented by a single thread or by a combination of more threads. Thread analysis can be used as a tool for understanding object oriented software behavior and to support maintenance tasks. The paper presents an algebraic notation, called MM-exp, for representing the threads, that expressively describes relevant details about thread composition. An approach to carry out comprehension processes based on the MM-exp notation is discussed, and a technique to support testing activities guided by the threads is also presented. The proposed approaches are experimented with a case study involving a small sized system implemented in C++ language. The experiment results show that the MM-exp analysis effectively supports …", "num_citations": "3\n", "authors": ["72"]}
{"title": "Profiling cancer-related needs and the role of physical, practical and psychological difficulties: A latent class analysis approach.\n", "abstract": " e22161Background: There was an increasing attention to the humanization of oncological cares that focused on patients’ needs – which have a strong impact on quality of life. Cancer-related needs seem to be related both to physical, practical and psychological difficulties as well as gender and age. Using a Latent Class Analysis (LCA) the aim of the study was to identify a latent structure accounting for the covariance between cancer-related needs. A one-factor model with two classes was hypothesized, which comprised needs as indicators and difficulties as external variables that moderate the latent structure. Methods: Patients (N = 171, 50.3% female, mean age = 64.6, SD = 12.7) were enrolled at the Department of Medical Oncology, “Presidio Ospedaliero” of Saronno, ASST Valle Olona, Italy. Using a standardized checklist patients were tested for physical issues, practical problems and distress (Psychological …", "num_citations": "2\n", "authors": ["72"]}
{"title": "A Taxonomy of Interactions Introduced by Aspects\n", "abstract": " Aspects have a large impact on the static structure and dynamic behaviour of the system they belong. This is due to the intrinsic intrusive nature of aspects and the woven process allowing the alteration of the structure, the control and data flow of the components of the base system in aspect oriented (AO) systems. Several and different types of interactions among aspects and the other components can be introduced according to the different mechanisms provided by AO Programming. These interactions can make higher the complexity of the overall system affecting its comprehension. In this paper we propose a taxonomy to categorize these types of interactions among aspects and the components of the base system. The taxonomy can be used to understand how each type of interaction affects the complexity, and thus the comprehensibility, of the system.", "num_citations": "2\n", "authors": ["72"]}
{"title": "Assuring quality of web-based applications\n", "abstract": " The Internet is rapidly expanding into all sectors of our society and becoming an indispensable platform of information systems and other computer applications. Web-based applications are complex, ever evolving and rapidly updated software systems. Testing and maintaining web-based applications impose a challenge to existing software quality assurance and testing techniques because the Internet is a heterogeneous, distributed, multiplatform, multilingual, multimedia, autonomous, and cooperative wide area network computing environment. Traditional quality models, testing methods and tools are not adequate for web-based applications because they do not address problems associated with the new features of web-based applications.With support from and in conjunction with IEEE International Computer Software and Applications Conferences (COMPSAC), a series of international workshops on Quality …", "num_citations": "2\n", "authors": ["72"]}
{"title": "Identifying Cross Site Scripting Vulnerabilities in Web Applications\n", "abstract": " Identifying Cross Site Scripting Vulnerabilities in Web Applications Page 1 1 Identifying Cross Site Scripting Vulnerabilities in Web Applications P. Tramontana, AR Fasolino Dipartimento di Informatica e Sistemistica University of Naples Federico II, Italy GA Di Lucca RCOST – Research Centre on Software Technology University of Sannio, Benevento, Italy M. Mastroianni Second University of Naples, Italy Page 2 2 The problem of Internet security and privacy ∎ Security and privacy are fundamental requirements for Web Applications ∎ 75% of the malicious attacks on the Web occur at the application level (Gartner Group) ∎ As more complex and automated Web Applications arise so does the probability of creating security loopholes. Page 3 3 The problem of Internet security and privacy ∎ Security and privacy are usually guaranteed by: ∎ specific security systems (such as firewalls, or Intrusion Detection Systems) and (, …", "num_citations": "2\n", "authors": ["72"]}
{"title": "Formal Verification of Radio Communication Management in Railway Systems Using Model Checking Technique\n", "abstract": " The European Railway Traffic Management System has the purpose to provide a common signaling system for all the European nations. It consists of two subsystems: the trackside subsystem (TSS) and the on-board subsystem (OBS) that communicate to exchange information about the state of the trackside and/or the train. Radio communication can take place according to the requirements specification reported in ERTMS/ETCS SUBSET-026-3. As the communication between TSS and OBS is a critical issue, we exploit model checking to verify the correctness of the communication process as specified in the SUBSET-026-3. The results achieved during the experimentation seem to be very promising.", "num_citations": "1\n", "authors": ["72"]}