{"title": "Results of 10 Years of Software Process Improvement in Brazil Based on the MPS-SW Model\n", "abstract": " In December 2003 the MPS. BR Program was launched aiming at establishing and disseminating a software process reference model -- the MPS-SW -- allowing both micro, small and medium-sized enterprises and large organizations to achieve the benefits of process improvement. Nowadays, ten years later, the achieved results exceed MPS. BR's predefined benchmarks in several ways. [Objective] This paper aims at providing an overview on the MPS-SW model and presenting these results, describing its nationwide adoption in Brazil (more than 500 assessments spread across the country) and outcomes of two recent surveys concerning the impact of such adoption in the software industry. [Method] We planned surveys to capture the impact from two different and complementary points of view: the qualitative perception of the customers (sponsors of MPS-SW adopting organizations) and the performance results …", "num_citations": "34\n", "authors": ["1358"]}
{"title": "SPI-KM-lessons learned from applying a software process improvement strategy supported by knowledge management\n", "abstract": " Software development organizations recognize the importance of improving software processes to enhance their competitive advantages. COPPE/ UFRJ software process research group has been providing SPI consultancy services to the Brazilian software industry for more than two decades. In order to support the SPI activities of the group, a SPI deployment strategy named SPI-KM that is supported by Knowledge Management and has been developed based on international and national reference models and standards. This paper presents the SPI-KM strategy and the results of an empirical study executed aiming to characterize the SPI initiatives that employed it. The study findings are presented as lessons learned and their applications are discussed in different organizations. We consider the adoption of the SPI-KM strategy and the lessons learned as important knowledge to be appreciated during …", "num_citations": "33\n", "authors": ["1358"]}
{"title": "MPS. BR: promovendo a adoção de boas práticas de engenharia de software pela indústria brasileira\n", "abstract": " The MPS model has been developed in the context of the MPS. BR Program in order to address the business needs of the Brazilian software industry. In this paper we present the current version of the MPS model, quantitative results of its adoption, and qualitative performance results obtained by software organizations that adopted the model, gathered through an experimental strategy based on surveys applied during two consecutive years. The quantitative results (174 organizations appraised until September 2009) point to an increasing adoption of the MPS model by Brazilian software organizations and to its capacity in promoting good software engineering practices. The qualitative results, on the other hand, show an increase of customer satisfaction and productivity, and capacity to deal with bigger projects for organizations that adopted the MPS model.", "num_citations": "28\n", "authors": ["1358"]}
{"title": "ESTAÇÃO taba: Uma infra-estrutura para Implantação do Modelo de referência para Melhoria de Processo de Software\n", "abstract": " Pesquisas recentes sobre qualidade na área de software demonstram que é necessário um esforço para melhorar processos de software. Este trabalho descreve uma abordagem para apoiar a implantação do Modelo de Referência para melhoria de processo de software Brasileiro. Os resultados iniciais da implantação deste modelo e as funcionalidades da Estação TABA são descritos neste trabalho.", "num_citations": "28\n", "authors": ["1358"]}
{"title": "MPS model and TABA workstation: Implementing software process improvement initiatives in small settings\n", "abstract": " Small and medium-size enterprises (SME) are usually hindered from improving their processes due to the complexity and costs involved in software process improvement (SPI). In this context, Brazilian software industries and research universities are working cooperatively to implement a strategy aiming to improve software processes of Brazilian SME. The main goal of this initiative is to develop and disseminate a Brazilian software process model (named MPS model) aligned to Brazilian software industry realities. In order to cope with factors that have influence on SPI success, we developed an approach to implement MPS model-based initiatives through the support of a process-centered software engineering environment named TABA Workstation. This paper presents the MPS Model components and the main functionalities of the TABA Workstation to support MPS model-based implementations in SME. We also …", "num_citations": "25\n", "authors": ["1358"]}
{"title": "Reference model for software process improvement: a Brazilian experience\n", "abstract": " Recent research efforts about quality in the software area demonstrate that a concentrated effort is necessary to improve software process. Mainly in Brazil, there is an urge to enhance software processes performance aiming to improve the quality of software products and to increase Brazilian organizations competitive advantages both in the national and international markets. This work describes an approach developed to establish the base for Brazilian organizations to improve software processes. The focus of this work is to increase the software development capability of small and medium size companies in a fast pace. The presented approach consists of the development of a Reference Model for software process improvement and an appraisal method for the Brazilian software industry. This model has been deployed in several Brazilian companies thorough the support of Software Development …", "num_citations": "24\n", "authors": ["1358"]}
{"title": "Software project management in high maturity: A systematic literature mapping\n", "abstract": " High maturity in software development involves statistically controlling the performance of critical subprocesses and using the predictability thus gained to manage projects with better planning precision and monitoring control. Maturity models such as CMMI mention statistical and other quantitative methods, techniques, and tools supporting high-maturity project management, but do not provide details about them, their use or their available types. Thus, knowledge is lacking on how to support software process improvement initiatives to select and apply statistical and other quantitative methods, techniques and tools in this context. The goal of this study is to identify various methods, techniques, and tools which can assist in high-maturity software project management. By conducting a systematic literature mapping, we identified 108 papers describing 153 contributions. We describe the contributions identified …", "num_citations": "23\n", "authors": ["1358"]}
{"title": "ROI of software process improvement at BL informática: SPIdex is really worth it\n", "abstract": " In today's global competitive environment, organizations are always trying to improve their practices aiming to achieve higher levels of productivity, quality and competitiveness. Software process improvement (SPIdex) is one of the most used approaches to achieve these goals. However, this kind of initiative is not easy, and usually great investments are necessary. Therefore, determining the return on these investments is very important to justify them and keep high‐level management and project teams motivated for continuous improvement. In this article, we present quantitative results of return on investment (ROI) at BL Informática, a Brazilian small‐sized organization which is improving its processes since 2003 and is experiencing great success. We present the benefits regarding schedule, costs, productivity, quality, customer satisfaction and also financial benefits. Results show that investments in SPIdex really …", "num_citations": "23\n", "authors": ["1358"]}
{"title": "Uma abordagem para a identificação de causas de problemas utilizando Grounded Theory\n", "abstract": " É cada vez mais evidente para uma organização de desenvolvimento de software a importância da adoção de estratégias preventivas contra qualquer tipo de problema.", "num_citations": "22\n", "authors": ["1358"]}
{"title": "Implementação do Nível F do MR-MPS com Práticas Ágeis do Scrum em uma Fábrica de Software\n", "abstract": " Este artigo descreve a metodologia utilizada na iniciativa de melhoria de processos de software da Rightway Consultoria & Sistemas objetivando alcançar o nível F do MR-MPS em conjunto com práticas ágeis da metodologia ágil Scrum. Este artigo apresenta ainda as fases do processo padrão de desenvolvimento contendo as práticas da metodologia Scrum e os desafios e as lições aprendidas na implementação de cada processo previsto pelo MPS. BR em um ambiente ágil.", "num_citations": "21\n", "authors": ["1358"]}
{"title": "Gerência de Configuração em Ambientes de Desenvolvimento de Software Orientados a Organização\n", "abstract": " Ao longo do ciclo de vida de um projeto de software, uma grande quantidade de itens de informação é produzida e alterada. A Gerência de Configuração de Software surgiu da necessidade de controlar essas alterações para evitar a perda de controle do projeto de software. Este artigo apresenta uma abordagem para o processo de Gerência de Configuração de Software baseada no processo de Gerência de Configuração proposto pela norma ISO/IEC 12207 e pelo Software Engineering Body of Knowledge (SWEBOK). Além disso, a abordagem proposta também suporta as atividades de Gerência de Configuração que uma organização necessita executar para atingir o nível 2 de maturidade do Capability Maturity Model Integration (CMMI). Uma ferramenta denominada GConf foi implementada para apoiar a abordagem proposta. A ferramenta construída está inserida no contexto dos Ambientes de Desenvolvimento de Software Orientados à Organização.", "num_citations": "21\n", "authors": ["1358"]}
{"title": "Using a Software Development Environment with Knowledge Management to Support Deploying Software Processes in Small and Medium Size Companies.\n", "abstract": " This paper addresses the use of a software development environment to support software processes deployment in small and medium size Brazilian companies. The objective of this project is to increase the capability of software organizations through the adequate use of Software Engineering techniques in its development and maintenance processes. The benefits of the project are the increase of software organizations competitive advantages and the enhancement of software products.", "num_citations": "20\n", "authors": ["1358"]}
{"title": "Improvement of IT service processes: a study of critical success factors\n", "abstract": " Maturity models and Information Technology (IT) service management models guide the definition and improvement of service management processes. Known approaches include ITIL, COBIT, ISO/IEC 20000, CMMI-SVC, and MR-MPS-SV. The implementation of these models results in benefits such as: increased user and customer satisfaction with IT services; financial savings due to less rework and less time used, and improved resource management and usage; improved decision making and optimized risk; and better alignment based on the business focus. However, some organizations find it difficult to use the models. This paper presents a study in which we identified critical factors for success and failure of the improvement of IT service processes. By doing a systematic mapping study and by snowballing, we were able to identify factors such as: project implementation strategy; support, commitment, and …", "num_citations": "16\n", "authors": ["1358"]}
{"title": "Uma abordagem para Medição e Análise em Projetos de Desenvolvimento de Software\n", "abstract": " Durante o processo de Medição e Análise é desenvolvida e implantada a capacidade de avaliação das medidas que servirão como importantes fontes de informação para a gerência da Organização. A melhor abordagem para seleção das medidas adequadas é a que define, antes de tudo, o que a Organização deseja ou precisa saber, e somente então escolhe as medidas apropriadas. Este artigo apresenta uma abordagem para o processo de Medição e Análise em projetos de desenvolvimento de software baseada no método Goal-Question-Metrics (GQM) e nos requisitos da área de processo Medição e Análise do CMMI. Apresenta também duas ferramentas de apoio à abordagem proposta.", "num_citations": "16\n", "authors": ["1358"]}
{"title": "Implantação de Processo de Software na BL Informática Um Caso de Sucesso\n", "abstract": " Durante os anos de 2003 e 2004, a BL Informática esteve envolvida com a escolha, preparação e implantação de um processo definido de software. O objetivo deste relato é expor mais detalhadamente esta experiência que culminou com a obtenção da certificação ISO 9001: 2000 pela empresa. São apresentadas as dificuldades encontradas, fatores de sucesso e lições aprendidas como resultado da implantação do processo.", "num_citations": "14\n", "authors": ["1358"]}
{"title": "Influência e Impacto do Programa MPS. BR na Pesquisa Relacionada a Qualidade de Software no Brasil\n", "abstract": " O Programa Brasileiro de Melhoria de Processos de Software (MPS. BR) é uma iniciativa para melhorar a capacidade de desenvolvimento de software nas organizações brasileiras iniciada em 2003. O impacto do MPS. BR na indústria de software brasileira pode ser observado, por exemplo, a partir de indicadores de desempenho medidos (ie, iMPS). No entanto, ainda não foram relatados estudos que procurem observar os impactos causados no ambiente de pesquisa de Qualidade de Software. Este artigo apresenta um estudo baseado em revisão sistemática da literatura que procura avaliar a influência e o impacto do MPS. BR na produção científica relacionada a Qualidade de Software no país.", "num_citations": "13\n", "authors": ["1358"]}
{"title": "Learning organizational knowledge: an evolutionary proposal for requirements engineering\n", "abstract": " The rapid deployment of high quality commercial technology often results in organizational reengineering. These changes reflect in different software engineering aspects, as the increase of software complexity. Within heterogeneous environments, due to the variety of users classes and their geographical distribution, a common understanding of the domain knowledge can be a hard task and would lead to a high uncertainty of the knowledge of real needs. User centered design methods along with knowledge engineering techniques proved to be suitable in such cases. This paper describes an evolutionary proposal for requirements engineering of a system to support the management of telecommunication networks. The proposal enhanced and speeded the software development, achieving a better acceptance of the system since the software group managed to efficiently acquire the organizational knowledge.", "num_citations": "13\n", "authors": ["1358"]}
{"title": "Software Process Improvement Implementation Risks: A Qualitative Study Based on Software Development Maturity Models Implementations in Brazil\n", "abstract": " Background: Several problems affect software process improvement (SPI) initiatives planning and institutionalization. Past SPI initiatives provide valuable knowledge that can be used to identify risks that might affect new ones. Aims: In this article we aimed to identify risks that might affect SPI initiatives involving the adoption of software development maturity models such as CMMI-DEV and MR-MPS-SW. Method: We (i) conducted a systematic mapping study to identify potential risks sources in Brazilian SPI-related literature and (ii) performed a qualitative analysis of selected articles using coding procedures and thematic analysis. Results: From 86 articles discussing SPI-related problems we were able to identify 17 risk categories, or top-level risks, that might affect software development maturity models deployment. These 17 risk categories are decomposed on 135 first level risks. Each risk is …", "num_citations": "12\n", "authors": ["1358"]}
{"title": "Metrics to Support IT Service Maturity Models–A Systematic Mapping Study\n", "abstract": " Background: Maturity models for IT service such as CMMI-SVC and MR-MPS-SV requires identification of critical business process and definition of relevant metrics to support decision-making, but there is no clear direction or strict suggestion about which should be those processes and metrics. Aims: We aim to identify adequate metrics to be used by organizations deploying IT service maturity models and the relationship between those metrics and processes of IT service maturity models or standards. Research questions are:(i) Which metrics are being suggested for IT service quality improvement projects?(ii) How do they relate to IT service maturity models processes? Method: We have defined and executed a systematic mapping review protocol. A specialist on systematic mapping review and IT service maturity models evaluated the protocol and its results. Results: Of 114 relevant studies, 13 addressed the research questions. All of them presented quality metrics, but none presented tools or techniques for metrics identification. Conclusions: We identified 133 metrics, 80 related to specific processes areas of service maturity models. Even being a broad result, not all models aspects were considered in this study.", "num_citations": "12\n", "authors": ["1358"]}
{"title": "Lições Aprendidas em uma Iniciativa de Melhoria de Processos de Software sob Diferentes Perspectivas: Membros da Organização, Implementadores e Avaliadores\n", "abstract": " A Instituição Implementadora e Avaliadora COPPE/UFRJ tem implementado e avaliado o MPS. BR em diversas empresas, acumulando experiências significativas. Em 2008, a Área de Qualidade de Software do Laboratório de Engenharia de Software da COPPE/UFRJ foi avaliada no Nível E do MR-MPS. Esta experiência possibilitou grande aprendizado da equipe responsável pela implementação e avaliação de processos atuando naquele momento como uma organização de desenvolvimento de software. Este artigo apresenta um conjunto de lições aprendidas que constituem um corpo de conhecimento útil a profissionais que atuem sob estas três diferentes perspectivas.", "num_citations": "12\n", "authors": ["1358"]}
{"title": "Uma Abordagem para Implantação de Processos de Software com ISO 9001 e CMMI\n", "abstract": " O interesse em processos de software está baseado em duas premissas. A primeira, é a dependência da qualidade do produto de software em relação à qualidade do processo pelo qual ele é construído e mantido. Asegunda premissa é que quando o processo de software é definido, este pode ser gerenciado, medido e melhorado. Este artigo descreve a experiência da Relacional Consultoria na implantação de processos de software para atingir a certificação ISO 9001 e CMMI nível 2 de forma simultânea, em março de 2005. A consultoria ISO foi realizada pela Associação Brasileira de Controle da Qualidade e a consultoria CMMI pela COPPE/UFRJ.", "num_citations": "11\n", "authors": ["1358"]}
{"title": "A Body of Knowledge for Executing Performance Analysis of Software Processes\n", "abstract": " The periodic execution of process performance analysis represents an important step for an organization to achieve quality in their processes and products. However, it is possible to notice that few software development organizations can establish and maintain this practice effectively. Many of the difficulties in executing performance analysis are related to the lack of knowledge in the field and difficulties of learning that are due to limitations and dispersion of currently available literature. In this sense, this paper presents the definition of a body of knowledge in process performance analysis, which will be made available through a knowledge-based system, aiming to support the execution of performance analysis in software development organizations. Particularly, we highlight the description of which knowledge the system must provide, as well as the ways how this knowledge is being captured and presented. For helping the understanding of the body of knowledge, an example of use is illustrated.", "num_citations": "10\n", "authors": ["1358"]}
{"title": "ISO 9001: 2000, MPS. BR Nível F e CMMI Nível 3: Uma Estratégia de Melhoria de Processos na BL Informática\n", "abstract": " Este trabalho apresenta resultados quantitativos do programa de melhoria da BL Informática através de análise comparativa entre o investimento realizado e o retorno obtido com a implantação da ISO 9001: 2000, MPS. BR Nível F e preparação para futura avaliação CMMI Nível 3. São apresentadas, também, as dificuldades encontradas, fatores de sucesso e lições aprendidas como resultado da implantação de processos.", "num_citations": "9\n", "authors": ["1358"]}
{"title": "ProcSoft: A Board Game to Teach Software Processes Based on ISO/IEC 29110 Standard\n", "abstract": " Software development processes must support all activities from requirements elicitation to product release and address software engineering best practices. International standards provide important, comprehensive and correct knowledge to help defining good software processes, but they are written in formal language, and their presentation are not easily assimilated by students. ProcSoft is a board game defined to promote software processes definition based on ISO/IEC 29110 standard. It has been used for several terms on Software Engineering classes. Complementary post-game activities aim at fostering content assimilation: students must answer software engineering questions in class, define a software development process and simulate its use. We present evaluation results evidencing great students' involvement during classroom activities, their acknowledgement of both ProcSoft contribution to learning …", "num_citations": "8\n", "authors": ["1358"]}
{"title": "Lições Aprendidas em Implementações de Melhoria de Processos em Organizações com Diferentes Características\n", "abstract": " Two key factors to the success of a software process improvement (SPI) initiative conducted by an Implementation Institution (II) are the existence of a good strategy and a competent team. However, this is not enough due to the complex nature of the SPI activities, which demands both technical and organizational culture knowledge so that such implementation can be suitable and effective. This paper presents the lessons learned by the COPPE/UFRJ II during SPI implementation in organizations with different characteristics.Resumo. A existência de uma boa estratégia e de uma equipe competente para a condução de iniciativas de implantação de melhoria de processos nas organizações por parte de uma Instituição Implementadora (II) são dois fatores de sucesso importantes. Porém, estes dois fatores não bastam por si só, devido à complexidade natural das atividades de implementação de melhoria, que demanda tanto o conhecimento técnico como o da cultura da organização, para que a iniciativa seja adequada e efetiva. Este artigo apresenta as lições aprendidas da II COPPE/UFRJ ao auxiliar a implementação de melhorias em organizações com características próprias, adaptando o trabalho da equipe de implementadores de acordo com estas características.", "num_citations": "8\n", "authors": ["1358"]}
{"title": "Uma abordagem para controle estatístico do processo e gerência quantitativa de projetos\n", "abstract": " O controle estatístico de processos é pré-requisito para apoio à melhoria contínua da qualidade e desempenho de processos. Muitas organizações buscam a melhoria de seus processos através desta prática, mas nem todas alcançam sucesso na sua aplicação. Uma das causas é aplicação incorreta do conhecimento estatístico necessário nas técnicas de análise. Este trabalho apresenta um exemplo de como controlar estatisticamente o processo e gerenciar quantitativamente os projetos, através da definição dos passos e técnicas a serem utilizadas, fornecendo conhecimento para organizações que desejem controlar estatisticamente seus processos na definição e execução dos passos e técnicas de análise.", "num_citations": "8\n", "authors": ["1358"]}
{"title": "Melhoria Contínua de Processo de Software Utilizando a Teoria das Restrições\n", "abstract": " O processo de desenvolvimento de software é composto por elementos que estão envolvidos durante a sua execução. Insumos, procedimentos, ferramentas e pessoas são exemplos de elementos do processo de desenvolvimento que, ao interagirem para produzir os produtos intermediários e produtos finais, ocasionam efeitos que podem influenciar de maneira desejável ou indesejável o desempenho do processo. Estes efeitos são fatores de influência que estão presentes nos processo de software, independentemente se estes são maduros e estáveis, ou se apresentam comportamento não previsível ao longo do tempo.A melhoria de processo é um fator importante para organizações de software que almejam ser competitivas. Organizações que mantêm um ciclo contínuo de melhoria podem, de maneira estruturada, melhorar a capacidade de seus processos, a fim de atingir melhores níveis de qualidade, tempo e custo de produção.", "num_citations": "7\n", "authors": ["1358"]}
{"title": "Implementando o nível F do MR-MPS com práticas da metodologia ágil Scrum\n", "abstract": " Rightway Consultoria & Sistemas is specialized in IT solutions and projects development. This paper describes the methodology used in its software process improvement initiative to achieve the MR-MPS level F with the support of Scrum’s agile practices, that were already used by the company. This paper also presents the standard development process phases adapted to Scrum’s agile practices and the case tools used to support the execution of this process.Resumo. A Rightway Consultoria & Sistemas é uma empresa especializada em desenvolvimento de soluções e projetos de Tecnologia da Informação. Este artigo descreve a metodologia utilizada na iniciativa de melhoria de processos de software para alcançar o nível F do MR-MPS em conjunto com práticas ágeis da metodologia Scrum, já utilizadas pela empresa. O artigo apresenta ainda as fases do processo padrão de desenvolvimento adaptadas às práticas da metodologia Scrum e as ferramentas utilizadas para apoiar a execução deste processo.", "num_citations": "7\n", "authors": ["1358"]}
{"title": "Aplicação da Estratégia SPI-KM para Apoiar a Implementação do MPS. BR Níveis G e F em Pequenas e Médias Empresas do Rio de Janeiro\n", "abstract": " Nos últimos 5 anos, universidades e a indústria de software do Brasil têm trabalhado para desenvolver e disseminar o MPS. BR com o intuito de melhorar a qualidade dos produtos e processos de software brasileiros. Para melhor lidar com as dificuldades que pequenas e médias empresas enfrentam durante a implementação de programas de melhoria de processos de software e facilitar a disseminação do MPS. BR, foi desenvolvida uma abordagem, denominada SPI-KM, apoiada por um ambiente de engenharia de software centrado em processos. Este artigo apresenta os resultados e lições aprendidas pela aplicação desta estratégia num grupo de 5 empresas situadas no Rio de Janeiro durante a implementação dos níveis G e F do MPS. BR.", "num_citations": "7\n", "authors": ["1358"]}
{"title": "MPS. BR Nível E–Uma Avaliação em Verde e Amarelo\n", "abstract": " Este artigo descreve uma abordagem para implantação de processos de software, com a realização de avaliação Nível E do MPS. BR (Melhoria de Processo do Software Brasileiro,) após a experiência da organização na certificação NBR ISO 9001: 2000 e a obtenção do Nível 2 do CMMI (Capability Maturity Model Integration) de forma simultânea.", "num_citations": "7\n", "authors": ["1358"]}
{"title": "Toward using Business Process Intelligence to Support Incident Management Metrics Selection and Service Improvement\n", "abstract": " Background: Businesses are increasingly dependent on IT services, and providers need to deliver fast, with high quality and low cost. An incident is an event that can lead to loss or disruption of services. Incident management reinstates normal service operation as quickly as possible and mitigates negative impact to business, ensuring agreed levels of service quality. So, reduce resolution time is usually the most important goal for incidents. Aims We aim to obtain knowledge about process and identify adequate metrics for Incident Management to help reduction of resolution time. Our research questions are:(i) Which Incident Management sub-process is causing more impact to resolution time?(ii) Which metrics can be used to measure this sub-process?(iii) What actions can be taken to improve Incident Management process in order to reduce impact of this subprocess in resolution time? Method: We present a case study in a global large company that considers reduction of incidents resolution time as a goal. Results: By applying BPM, BPI and Process Mining we were able to discover the underlined process and a bottleneck for resolution time. Moreover, we proposed metrics to improve process and service quality by applying GQM+ Strategies.", "num_citations": "6\n", "authors": ["1358"]}
{"title": "Experiência de Implantação do MR-MPS-SV no Service Desk da ECO Sistemas\n", "abstract": " Este artigo descreve a experiência da ECO Sistemas com a implementação do nível G MR-MPS-SV no seu Service Desk. A implementação teve inicio em Setembro de 2013 e a avaliação oficial foi concluída em Dezembro de 2013. Os resultados obtidos indicam aumento de produtividade na prestação do serviço e visibilidade de SLA atendida, além da criação de base histórica.", "num_citations": "5\n", "authors": ["1358"]}
{"title": "Uma Abordagem para Gerência Estratégica de Portfólio com Foco na Seleção de Projetos\n", "abstract": " A fim de buscar o aumento da taxa de sucesso dos projetos e o aumento da eficácia do gerenciamento, é necessário promover o alinhamento estratégico dos projetos aos interesses da organização. Isto pode ser alcançado com uma adequada gestão da carteira (portfólio) de projetos de forma a maximizar os benefícios eminimizar os riscos decorrentes da execução dos projetos. Este trabalho apresenta um processo para apoiar a gerência estratégica de portfólio, por meio da identificação das regras de governança do portfólio, identificação e categorização dos projetos, seleção, priorização e balanceamento do portfólio, manutenção do pipeline e encerramento dos projetos. O processo foi construído com base nas melhores práticas de gerência de projetos, programa e portfólio encontradas na literatura e está aderente ao processo de gerência de portfólio de projetos da norma ISO/IEC 12207: 2008.", "num_citations": "5\n", "authors": ["1358"]}
{"title": "Indicadores da Implementação do Nível E do MR-MPS em uma Instituição de Pesquisa\n", "abstract": " Em maio de 2008, a Área de Qualidade de Software do Laboratório de Engenharia de Software da COPPE/UFRJ foi a primeira unidade organizacional a ser avaliada no Nível E do MR-MPS versão 1.2. Este artigo apresenta os principais detalhes da implementação dessa iniciativa de melhoria de processos, incluindo as ferramentas utilizadas e uma análise da experiência baseada em resultados apresentados nos relatórios de medição.", "num_citations": "5\n", "authors": ["1358"]}
{"title": "Um Survey sobre Métodos Ágeis e o Pós-Agilismo\n", "abstract": " Contexto: Após mais de uma década de experiência com os métodos ágeis, críticos do movimento promovem um novo conceito de desenvolvimento ágil, onde os profissionais não estão mais presos a uma só método e sua implementação não mais segue estritamente o que descrevem os livros e guias. Objetivo: Esse trabalho propõe analisar os fatores positivos e negativos observados pelos profissionais de TI após a implementação dos métodos ágeis, e identificar de que maneira os métodos e práticas ágeis estão sendo aplicados. Método: Foi executado um survey descritivo interseccional com foco em profissionais de TI com experiência em métodos ágeis. Resultados: A maioria dos profissionais da amostra, após experiências com os métodos ágeis, são capazes de detectar o que funciona e descartar/alterar o que não funciona. A maioria dos respondentes não se prende a um único método. Conclusões: O objetivo foi alcançado, uma vez que foi possível identificar, no contexto da amostra, como o uso dos métodos ágeis estão evoluindo para um pensamento dito Pós-Agilista.", "num_citations": "4\n", "authors": ["1358"]}
{"title": "Software Process Improvement in Brazil: Evolving the MPS Model and Consolidating the MPS. BR Program\n", "abstract": " The main objective of the MPS. BR program is to develop and disseminate a software process model aiming to improve the software processes of Brazilian organizations in a fair period within reasonable costs. This paper focuses on the MPS model evolution and on the actions to consolidate the MPS. BR program achievements. We also present the most relevant results of this period along with the assets produced and data about performance results.", "num_citations": "4\n", "authors": ["1358"]}
{"title": "Application of the SPI‑KM Approach to Support the Implementation of the MPS Model in Small-and Medium‑Sized Enterprises in Brazil\n", "abstract": " Although small-and medium-sized enterprises (SMEs) represent most of the of Brazilian software industry, these organizations struggle to implement software process improvement (SPI) initiatives aiming to increase their competitive advantages. One cause of the failure of many SPI initiatives conducted by SMEs is the lack of adequate process implementation approaches aligned to common characteristics of SMEs, such as a lack of financial and human resources.", "num_citations": "4\n", "authors": ["1358"]}
{"title": "Deploying Software Reuse Management at COPPE/UFRJ Software Engineering Laboratory\n", "abstract": " Software projects reuse aim at providing more quality to the final product and increase productivity. To achieve this goal it is necessary to define a systematic reuse strategy as part of organization daily activities. This paper presents the deployment of software reuse management at COPPE/UFRJ Software Engineering Laboratory, the first organizational unit evaluated at MR-MPS v. 1.2 Level E whose Reuse Management Process is ISO/IEC 15504 compliant. We also present the difficulties and the lessons learned during this process institutionalization. 1.", "num_citations": "4\n", "authors": ["1358"]}
{"title": "Implantação do MR-MPS Nível E no Centro de Computação da Aeronáutica de São José dos Campos\n", "abstract": " Em outubro de 2006, o Centro de Computação da Aeronáutica de São José dos Campos (CCA SJ) se tornou a primeira organização pública brasileira a ser avaliada oficialmente no MR-MPS. Este artigo descreve a experiência do CCA SJ na implementação e avaliação de seus processos de software no nível E do MPS. BR. São discutidos os principais benefícios apontados pelos colaboradores, além de serem apresentados os principais resultados e lições aprendidas neste contexto.", "num_citations": "4\n", "authors": ["1358"]}
{"title": "Implementando MPS. BR nível F como preparação para certificação CMMI nível 3\n", "abstract": " Depois da aquisição da certificação ISO 9001: 2000, a BL Informática esteve envolvida com a preparação para a avaliação CMMI (Capability Maturity Model Integration) Nível 3, utilizando MPS BR. O objetivo deste relato é expor mais detalhadamente esta experiência, apresentando as dificuldades encontradas, fatores de sucesso e lições aprendidas como resultado desta preparação.", "num_citations": "4\n", "authors": ["1358"]}
{"title": "Apoio à Manutenção de Software através de Design Rationale em Ambientes de Manutenção de Software Taba “\n", "abstract": " Desenvolver e manter sistemas de software são tarefas intensas em conhecimento. Muitos estudos demonstraram que a maior parte dos gastos ocorridos durante o ciclo de vida de um produto de software ocorrem durante o processo de manutenção. O armazenamento e a recuperação da documentação de software visam minimizar os altos custos de manutenção de software e, portanto, constituem atividades básicas contidas nos diversos métodos e técnicas de Engenharia de Software desde os primeiros tempos. A documentação padrão de projeto consiste em uma descrição do projeto; efetivamente uma “fotografia” das decisões finais. Design Rationale oferece mais: não apenas as decisões, mas também as razões por trás de cada decisão, incluindo sua justificativa, outras alternativas consideradas, e a argumentação que levou a decisão. Este artigo apresenta uma abordagem de captura, representação e consulta de Design Rationale que apóia a manutenção do software. Este apoio ocorre no contexto dos Ambientes de Manutenção de Software TABA.", "num_citations": "4\n", "authors": ["1358"]}
{"title": "A Systematic Literature Mapping on Interorganizational Information Systems\n", "abstract": " Organizations increasingly need to establish partnerships with other organizations to face environment changes and remain competitive. This interorganizational relationship allows organizations to share resources and collaborate to handle business opportunities better. However, besides all benefits, organizations usually face several challenges. Organizations should consider many factors, but appropriate methods, techniques and tools that support these organizations to identify what is relevant and necessary for the partnership are still required. Moreover, there are open challenges concerning different ICT areas, among which to think over issues regarding the interorganizational information systems (IOIS) development. The present research explores the ICT support to interorganizational relationships. To this end, a systematic mapping was performed to understand what is an IOIS and how these systems support interorganizational relationships. A discussion about the findings, challenges and open issues identified from the retrieved literature is also provided to guide further work.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "Avaliação do Processo de Medição em Gerência de Incidentes e Gerência de Continuidade e Disponibilidade à Luz do MR-MPS-SV\n", "abstract": " An effective measurement process helps organizations to understand their capabilities to develop workable plans to execute and deliver agreed services to customers. MR-MPS-SV measurement process supports the company on understanding process behavior and, with that, also supports decision making, to control and improve them. This article presents an experience report about measuring Incident Management and Service Continuity and Availability Management processes in a large global company, to evaluate adherence to MR-MPS-SV Measurement process.Resumo. Um processo de medição eficaz ajuda a compreensão da habilidade de uma organização em desenvolver planos viáveis para executar e entregar os serviços acordados com seus clientes. No MR-MPS-SV, o processo Medição apoia a compreensão do comportamento dos processos e, com isso, a tomada de decisão para controlá-los e melhorá-los. Este artigo apresenta um relato de experiência sobre a medição nos processos de Gerência de Incidentes e Gerência de Continuidade e Disponibilidade de uma empresa global de grande porte, visando avaliar a aderência do processo adotado à luz do processo Medição do modelo de maturidade MS-MPS-SV.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "Componentes e Requisitos de um Ambiente Baseado em Conhecimento para Análise de Desempenho de Processos de Software\n", "abstract": " In the process improvement context, process performance analysis is very important for organizations achieve the highest maturity levels. For the purpose of supporting software development organizations to execute properly this analysis, a knowledge-based environment is proposed. This environment provides activities that must be performed during the performance analysis, and makes available the basic knowledge needed to execute them. This paper aims to present this environment’s requirements and components.Resumo. No contexto de melhoria de processos, verifica-se a importância da análise de desempenho de processos para que organizações alcancem os níveis mais altos de maturidade. A fim de auxiliar as organizações de desenvolvimento de software a executarem adequadamente esta análise, um ambiente baseado em conhecimento é proposto. Este ambiente provê as atividades que devem ser executadas durante a análise de desempenho, e disponibiliza o conhecimento básico necessário para executá-las. O objetivo deste artigo é apresentar os requisitos e componentes deste ambiente.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "Avaliação da Importância dos Fatores Técnicos e Ambientais do Método Pontos por Caso de Uso com Base no Método AHP.\n", "abstract": " Métodos de estimativas como o Pontos por Casos de Uso (PCU) calibram o tamanho do software baseado em características técnicas e ambientais associadas aos projetos e às equipes de desenvolvimento. Este artigo analisa os resultados de uma pesquisa realizada com profissionais da área de software, utilizando o método Processo Analítico Hierárquico (AHP), sobre a relevância de cada uma das características técnicas e ambientais. A importância delas foi agrupada segundo o perfil profissional, categoria empresarial e existência de processo de desenvolvimento na organização. Foram considerados mais importantes os aspectos motivação, requisitos estáveis, capacidade do analista chefe, segurança, desempenho e usabilidade. Foram considerados menos importantes os aspectos experiência dos usuários, dificuldade com a linguagem de programação, alocação em tempo parcial, facilidade de instalação, acesso a software de terceiros e necessidade de treinamento.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "Medição em Organizações de Software: Observações do Estado da Prática\n", "abstract": " O processo Medição deve ser implementado por empresas que objetivam o Nível F do Modelo de Referência do MPS. BR (MR-MPS). As organizações tem liberdade de decidir a melhor forma de implementar tal processo desde que seja aderente ao MR-MPS. Este artigo apresenta um relato sobre a implementação do processo Medição do MR-MPS em organizações a partir de observações do estado da prática em organizações que implementaram este processo. Espera-se, dessa forma, contribuir positivamente para a implementação deste processo em iniciativas de melhoria de processo de software baseadas no MR-MPS.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "Implantação do Nível F do MR-MPS Combinando Características do Processo Unificado com Práticas SCRUM\n", "abstract": " There is no software process model adequate to any organization and during all the time. This paper presents the evolution of the software de velopment process of Athenas Software. This process first version was based on what would become the Unified Process and now have evolved to support SCRUM agile practices and the MPS. BR Reference Model Level F practices.Resumo. Não existe um único modelo de processo de software que seja ade quado a todo o tipo de empresa nem por todo o tempo. Este artigo apresenta a evolução do processo de desenvolvimento de software da Athenas Software desde a sua primeira versão baseada no que viria se tornar o Processo Unifi cado até o momento atual onde se alinham, também, práticas ágeis do SCRUM e as práticas associadas ao Nível F do Modelo de Referência do MPS. BR.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "A Experiência na Implantação do Processo de Gerência de Reutilização no Laboratório de Engenharia de Software da COPPE/UFRJ\n", "abstract": " A reutilização em projetos de software visa prover mais qualidade ao produto final e aumentar a produtividade. Para atingir este objetivo é necessário definir uma estratégia que torne a reutilização sistemática e parte das atividades cotidianas da organização. Este artigo relata a experiência da Área de Qualidade de Software do Laboratório de Engenharia de Software da COPPE/UFRJ na implantação do processo de Gerência de Reutilização, primeira unidade organizacional a ser avaliada no nível E do MR-MPS v. 1.2. Também são apresentadas as dificuldades para institucionalização deste processo e as lições aprendidas com esta experiência.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "Uma Abordagem de Apoio à Solução Técnica em Ambientes de Desenvolvimento de Software Orientados à Organização\n", "abstract": " Os produtos de software estão se tornando cada vez maiores e mais complexos. Além disso, o número de projetos de software que não conseguem ser terminados dentro dos prazos e custos estabelecidos e que não implementam um produto que satisfaça às necessidades do cliente também cresce. Neste contexto, se situam as pesquisas com foco em processos de software, pois se percebeu que a qualidade do produto a ser desenvolvido está fortemente relacionada com a qualidade do processo utilizado para desenvolvê-lo. Este trabalho apresenta uma abordagem de apoio ao processo de Solução Técnica, que é executado durante o desenvolvimento de software.", "num_citations": "3\n", "authors": ["1358"]}
{"title": "DevOps Maturity Diagnosis–A Case Study in Two Public Organizations\n", "abstract": " Organizations have been applying practices and elements of DevOps culture in the last decade to approximate development and operation teams. Many software development processes address problems associated with keeping the desired stability in organizational operations while increasingly attending the frequency and quality of software deliveries. Nevertheless, the gap between the objectives of organizational units and development and operation teams persists due to the inadequacy of the solutions adopted for the unique scenarios each organization faces. Thus, to better support creating a DevOps culture in an organization and to guide the adoption of DevOps solutions it is necessary to diagnose its maturity and their teams’ to evaluate the knowledge and skills of the people involved. We present a process to diagnose DevOps maturity. We applied it to two public organizations. We found that both …", "num_citations": "2\n", "authors": ["1358"]}
{"title": "Usando KIPO para Modelar Problemas e Socialização na Elicitação de Requisitos.\n", "abstract": " A elicitação de requisitos essencialmente constitui uma atividade que envolve uma série de interações de comunicação entre os diversos stakeholders envolvidos no processo de desenvolvimento. Apesar disso, muitos engenheiros de requisitos não possuem ampla percepção sobre os problemas que acontecem durante a socialização, e não há entendimento preciso sobre como as técnicas específicas da engenharia de requisitos podem auxiliá-lo nessas atividades. A elicitação é um processo intensivo em conhecimento, pois a sua execução depende essencialmente do conhecimento dos envolvidos. Este artigo apresenta uma proposta para representar uma conceitualização mais precisa e explícita sobre alguns problemas e a dinâmica da socialização que ocorrem durante a elicitação de requisitos. A conceitualização é apresentada na forma de um modelo conceitual de domínio, que instancia o meta-modelo de processos intensivos em conhecimento representado pela KIPO (knowledge-intensive process ontology). Seu objetivo é compartilhar uma visão comum e tornar o domínio da engenharia de requisitos mais explícito e semanticamente preciso a seus stakeholders.", "num_citations": "2\n", "authors": ["1358"]}
{"title": "An Evaluation of Software Process Performance Analysis Activities: Insights from Different Viewpoints\n", "abstract": " Process performance analysis (PPA) is a key step for implementing continuous software process improvement in organizations. The person responsible for executing PPA must have specific knowledge to execute it properly. Most of this knowledge is spread in books, papers, journals and academic theses, or in expert's minds. In order to support organizations in executing PPA, we are proposing a body of knowledge, as well as the definition of a knowledge-based system to manage and make such knowledge available. In this paper, we present an evaluation of the proposed activities and tasks for executing PPA, by means of a peer review carried out with some stakeholders with different backgrounds. Results of this peer review allowed us to improve the description of the organized knowledge and also revealed under explored support for some activities in software companies, especially regarding the establishing …", "num_citations": "2\n", "authors": ["1358"]}
{"title": "A Method for Service Agile Construction\n", "abstract": " Service-Oriented Architecture (SOA) and agile methods share common drivers. However, there is a lack of guidelines a SOA team should pursue in order to develop services considering best practices, acceptance tests, distributed teams, contract refactoring, among other issues related to SOA principles and agile practices. This work presents a new method that addresses team concerns and needs aiming at a systematic approach for service development using XP's agile practices and SOA principles. We provide best practices, phases and activities that specifically address XP's core practices and service-oriented best practices. We also provide an example of our proposal in order to demonstrate its applicability.", "num_citations": "2\n", "authors": ["1358"]}
{"title": "Fatores Críticos de Sucesso para Melhoria de Processos de Serviços de TI: Um Mapeamento Sistemático\n", "abstract": " Modelos para maturidade e gestão de serviços de TI orientam a melhoria de processos de gerenciamento de serviços de TI. Abordagens já conhecidas incluem ITIL, COBIT, ISO/IEC 20.000, CMMI-SVC e MR-MPSSV. A implantação desses modelos resulta em benefícios, mas há organizações que enfrentam dificuldades. Este artigo apresenta um mapeamento sistemático da literatura, a fim de identificar fatores críticos de sucesso e de fracasso para a melhoria de processos de serviços de TI. Alguns fatores encontrados foram: estratégia de implementação do projeto; apoio, comprometimento e envolvimento; recursos e processos. Os resultados obtidos foram relacionados utilizando procedimentos da Grounded Theory de forma a facilitar a análise.", "num_citations": "2\n", "authors": ["1358"]}
{"title": "Uma Estratégia de Gerência de Configuração de Ativos de Processos de Software Apoiada por um Ambiente de Engenharia de Software Centrado em Processos\n", "abstract": " Assim como no desenvolvimento de software, os produtos derivados de projetos de melhoria de processos de software também precisam ser gerenciados. Os processos de software constituem importantes ativos de processo de uma organização e devem ter sua evolução controlada. Este artigo apresenta a abordagem de gerência de configuração de ativos de processo em uso na Estação Taba e descreve, também, o uso desta abordagem em uma empresa de software durante a preparação para uma avaliação seguindo o modelo MPS. BR.", "num_citations": "2\n", "authors": ["1358"]}
{"title": "Lições Aprendidas com a Implementação do Nível E do MR-MPS no Laboratório de Engenharia de Software da COPPE/UFRJ\n", "abstract": " Desde 2005, quando foi credenciada pela SOFTEX como Instituição Implementadora do MPS. BR, a COPPE/UFRJ vem implementando o MR MPS. BR em micro, pequenas, médias e grandes empresas, no Rio de Janeiro e também em outros estados do país. No início de 2008 foi realizada a avaliação da Área de Qualidade de Software do Laboratório de Engenharia de Software da COPPE/UFRJ, primeira unidade organizacional a ser avaliada no nível E do MR-MPS v. 1.2, experiência esta que se tornou uma importante fonte de lições aprendidas para aqueles que também realizam implementações em terceiros. Este artigo descreve os desafios enfrentados na implementação e um conjunto de lições aprendidas coletado pelos membros da equipe da COPPE/UFRJ e dos colaboradores que tiveram alguma participação na iniciativa de melhoria.", "num_citations": "2\n", "authors": ["1358"]}
{"title": "An Instrument to Assess the Organizational Climate of Agile Teams-A Preliminary Study\n", "abstract": " Background: Organizational climate surveys allow the access to the opinions, preferences, or dissatisfactions of the team members of their working conditions. Understanding how different factors influence the organizational climate of agile software development teams can be challenging for organizations. TACT is an instrument to assess the organization climate of agile teams. Its initial version comprises the Communication, Collaboration, and Leadership dimensions. Objective: We present the preliminary evaluation of TACT. Method: We planned and executed a case study considering two development teams. We evaluated TACT using open-ended questions, quantitative methods, and TAM dimensions of Intention to Use, Perceived Usefulness, and Output Quality. Results: TACT allowed to classify the organizational climate of both teams as positive for the Collaboration, Communication, and Leadership …", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Resistance to Change in Software Process Improvement-An Investigation of Causes, Effects and Conducts\n", "abstract": " Context: Resistance to change can affect the effectiveness of software process improvement initiatives as well as the maintenance of improvements after an official assessment. However, the inherent attributes of resistance to change are not entirely clear, for instance: its effects as well as actions to mitigate its occurrence. Objective: We aim to investigate potential causes and effects of resistance to change as well as conducts that can mitigate its occurrence on software processes improvement initiatives. Method: We performed a qualitative study in which we interviewed 21 practitioners and specialists in software process improvement. Results: We have identified 32 causes, 16 effects, and 29 conducts related to resistance to change. For instance, resistant senior management can sabotage the process by creating resistance to other stakeholders who want to implement improvements. Conclusion: We found that …", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Organisational climate assessments of Agile teams–a qualitative multiple case study\n", "abstract": " Agile methods are associated with values, principles, and practices that influence organisational climate. Organisational climate is the meaning employees attach to the policies, practices, and procedures they experience and the behaviours they observe getting rewarded, supported, and expected. A negative climate can influence team members on aspects such as motivation, ability to make good decisions, and willingness to innovate. Conversely, a positive climate can influence project success and the competitiveness of organisations. The authors investigate how organisations considered assessing the organisational climate of Agile teams, and which are the benefits and the difficulties associated with this assessment. They conducted a qualitative study on five Brazilian organisations. They interviewed key personnel involved with organisational climate assessments. They identified 16 benefits and nine …", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Interorganizational Information Systems: Systematic Literature Mapping Protocol\n", "abstract": " Organizations increasingly need to establish partnerships with other organizations to face environment changes and remain competitive. This interorganizational relationship allows organizations to share resources and collaborate to handle business opportunities better. This technical report present the protocol of the systematic mapping performed to understand what is an IOIS and how these systems support interorganizational relationships.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Causal Analysis and Resolution with Theory of Constraints: The CARTOC Method\n", "abstract": " Several problems can affect software development projects. Less complex problems can be solved punctually, or by applying simple Cause Analysis techniques which typically requires a low analysis effort. Problems of greater complexity, which occasionally affect other projects, are difficult to infer and require more extensive analysis effort possibly using more complex techniques. Also, not all factors that cause a complex problem have the same impact on the problem root cause. Knowing how to properly identify the problem root cause is critical to avoid its recurrence. We present the CARTOC method that structures the process of human reasoning to reduce the bias of those involved with the analysis during the root cause identification phase, validate established cause and effect relationships, and direct treatment of the identified causes. To achieve these objectives, CARTOC uses the Thinking Processes of the …", "num_citations": "1\n", "authors": ["1358"]}
{"title": "ProcSoft-Regras e Material de Apoio\n", "abstract": " Este relatório técnico apresenta o jogo educacional ProcSof, suas regras e o material de apoio. O objetivo do ProcSoft é ensinar conceitos relacionados à definição, estrutura e conteúdo de um processo de software para uma organização fiel a boas práticas de engenharia de software. Utilizou-se como base a norma ISO/IEC 29110, voltada para pequenas entidades. Resultados de uma avaliação realizada evidenciam o envolvimento dos participantes em sala de aula, a percepção de contribuição ao aprendizado e a influência positiva do jogo para que os participantes busquem conhecimento adicional fora da sala de aula.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Methods, Techniques and Tools to Support Software Project Management in High Maturity\n", "abstract": " High maturity in software development is associated to statistical control of critical subprocesses performance and the use of gained predictability to manage projects with better planning precision and monitoring control. Although maturity models such as CMMI mention some statistical and other quantitative approaches, methods and techniques that can support project management in high maturity, they do not provide details about them neither present their available types. Therefore, there is a lack of knowledge on how to support software process improvement initiatives to choose and use statistical and other quantitative approaches, methods and techniques on such context. The objective of this study is to identify different approaches, methods and techniques that can assist on managing projects in high maturity. By conducting a systematic literature mapping on major data sources, we identified 75 papers describing 101 contributions. We briefly describe identified approaches, methods and techniques grouped by similar types and provide some analysis regarding technological maturity stage and evaluation method, and supported development methods and characteristics and process/indicator area in which they were applied. We hope this information can fill some of the statistical and quantitative knowledge gap about the actual types of approaches, methods and techniques being proposed, evaluated, experimented and adopted by organizations to assist on quantitative project management in high maturity.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Organizational Transparency Maturity Assessment Method\n", "abstract": " Due to legal requirements many organizations face the challenge of implementing transparency practices. In order to assist them in systematically and progressively implementing these practices, the Maturity Model for Organizational Transparency was developed. This model is composed by a set of practices that describe how they can be applied and which work products are necessary for sustaining them. However, it does not allow by itself that organizations diagnose their current situation and find out their strengths and improvement opportunities regarding Organizational Transparency. This paper presents the Organizational Transparency Maturity Assessment Method that allows the understanding how transparent an organization is while also suggesting what needs to be done to continuously improving the transparency practices. We also present a case study of its application in a big Brazilian public health …", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Meta-modelo para Mudança Organizacional em Melhoria de Processo de Software\n", "abstract": " Mudança envolve processo, pessoas, competências, cultura organizacional e liderança, dentre outros tópicos que englobam os fatores críticos a serem observados para uma mudança bem-sucedida. Esse artigo apresenta um meta-modelo conceitual de mudança organizacional, que é capaz de representar os conceitos importantes envolvidos com mudança organizacional em uma iniciativa de melhoria de processo de software, tais como stakeholders, resistência e competência. Um estudo de caso foi aplicado em uma iniciativa de melhoria de processo de software de uma empresa para avaliar a aplicabilidade do meta-modelo.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Prefácio e Organização\n", "abstract": " Este é um evento realizado anualmente pela Sociedade Brasileira de Computação (SBC), por meio de sua Comissão Especial de Engenharia de Software (CEES). O SBQS é um fórum em que a comunidade científica e a indústria da área de software se encontram para compartilhar experiências, discutir problemas e soluções da área de qualidade de software e estabelecer novas parcerias.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "MR-MPS-SW e CERTICS: Mapeamento e Diretrizes para a Implantação Conjunta dos Modelos\n", "abstract": " O crescimento da indústria de Tecnologia da Informação no Brasil vem impulsionando o investimento das organizações em melhoria de processos de software, com o propósito de alcançar maior qualidade em seus produtos, além de obter as qualificações requeridas para concorrências públicas e internacionais. A utilização de multimodelos exige grande conhecimento destes modelos e suas interseções para que a implementação conjunta não gere processos redundantes, bem como esforços e custos desnecessários. Este artigo apresenta o resultado de um mapeamento sistemático sobre harmonização de multimodelos e também apresenta o mapeamento realizado entre o modelos MR-MPS-SW e a certificação de software CERTICS, com a orientação da aderência, visando apoiar as organizações que queiram implementá-los em conjunto.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Riscos em Iniciativas de Melhoria de Processos de Software Aderentes ao MR-MPS-SW e ao CMMI-DEV: Uma Investigação no Contexto Brasileiro\n", "abstract": " Iniciativas de melhoria de processos de software são afetadas pordiversos problemas que prejudicam a institucionalização dos processos. Nem sempre as organizações estão cientes dos possíveis problemas e, assim, não se precaveem para evitá-los. Este artigo apresenta um estudo qualitativo cujo objetivo é identificar riscos que comumente afetam iniciativas de melhoria de processos de software aderentes ao MR-MPS-SW e ao CMMI-DEV. Um mapeamento sistemático foi realizado nos principais eventos científicos que tratam especificamente qualidade de software no Brasil (SBQS e WAMPS). Procedimentos de codificação foram utilizados para identificar e categorizaros problemas relatados. Foram analisados 497 artigos e identificados 1152 códigos. Os códigos foram generalizados e organizados em 134 riscos associados a 34 categorias.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Avaliação da Gerência de Incidentes sob a Luz do MR-MPS-SV e Medição para Apoiar a Melhoria da Qualidade do Serviço de TI\n", "abstract": " O objetivo principal do gerenciamento de incidentes é restaurar o nível de serviço o mais rápido possível. Prestadores de serviços buscam continuamente métodos eficientes para medir e gerenciar seus serviços. Um processo de medição adequado ajuda a compreender as capacidades e desenvolver planos viáveis para entregar os serviços dentro da qualidade acordada. Este artigo apresenta a avaliação do processo de Gerência de Incidentes de uma empresa global de grande porte, sob a luz do MR-MPS-SV, e propõe um processo para seleção de medidas multiprocessos a partir do mapeamento e dos objetivos da organização para apoiar a melhoria de serviços de TI.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Guia de Avaliação em Transparência Organizacional\n", "abstract": " To verify the organization maturity level in relation to Organizational Transparency implementation, an Organizational Transparency Maturity Assessment Method was built. This method, described in the Organizational Transparency Assessment Guide, consists of evaluation process, scoring rules and tools to support the assessment. The objective of this paper is to describe the Organizational Transparency Assessment Guide.Resumo. Para verificar a maturidade de uma organização em relação à implementação da Transparência Organizacional foi construído o Método de Avaliação de Maturidade em Transparência Organizacional. Esse método, descrito no Guia de Avaliação em Transparência Organizacional, é composto basicamente pelo processo de avaliação, regras de pontuação e instrumentos de apoio à avaliação. O objetivo desse trabalho é descrever o Guia de Avaliação em Transparência Organizacional.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Processo de Avaliação da Transparência Organizacional\n", "abstract": " Transparência organizacional consiste em dar acesso, uso, qualidade, entendimento e permitir a auditabilidade de processos e informações. O modelo de Maturidade em Transparência Organizacional é o instrumento que permite a organização estabelecer as práticas para implantação deste conceito. Como todo modelo de maturidade, este modelo tem atrelado a ele o modelo de Avaliação em Transparência Organizacional, que permite verificar o estado de cada uma destas práticas. O presente trabalho tem como objetivo apresentar os processos necessários à realização desta avaliação.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "MPS. BR-Melhoria de Processo do Software Brasileiro\n", "abstract": " O MPS. BR 1 é um programa mobilizador, de longo prazo, criado em dezembro de 2003, coordenado pela Associação para Promoção da Excelência do Software Brasileiro (SOFTEX), que conta com apoio do Ministério da Ciência, Tecnologia e Inovação (MCTI), Financiadora de Estudos e Projetos (FINEP), Serviço Brasileiro de Apoio às Micro e Pequenas Empresas (SEBRAE) e Banco Interamericano de Desenvolvimento (BID/FUMIN).", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Definição de Processos de Aquisição de Software com Uso de Abordagem baseada em Reutilização\n", "abstract": " As organizações precisam ser capazes de evoluir em qualidade e produtividade, reduzindo custos e ganhando competitividade. Muitas vezes as organizações são obrigadas a adotarem uma estratégia baseada na terceirização de parte de suas atividades de desenvolvimento. No entanto, a falta de processos adequados pode ser uma das causas para o insucesso de projetos que envolvam aquisição de software. Este artigo apresenta uma abordagem para definição de processos de aquisição de software baseado no uso de uma linha de processo de software (LPS) específica para aquisição. Com o uso desta abordagem, espera-se facilitar a definição de processos e a reutilização do conhecimento modelado na linha de processos, além de minimizar os problemas gerados quando se adquire software e de apoiar as organizações a executarem a aquisição de software de forma mais adequada.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Uso dos Resultados de um Estudo Baseado em Revisão Sistemática para Elaborar uma Proposta Inicial de Pesquisa\n", "abstract": " A systematic review is a formal process to identify, evaluate and interpret the available and relevant research results on a certain subject. This paper presents how a systematic review-based study was planned and executed to assist the development and refinement of an approach to support the identification of problems’ root causes. We present the results of this study, as well as how they have influenced the definition of that approach.Resumo. Uma revisão sistemática é um processo formal para identificar, avaliar e interpretar a pesquisa disponível e relevante sobre determinado assunto. Este artigo apresenta como um estudo baseado em revisão sistemática foi planejado e executado para auxiliar a elaboração e refinamento de uma abordagem para apoiar a identificação de causas raiz de problemas. São apresentados os resultados deste estudo, além de como eles influenciaram positivamente na definição da abordagem.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Implantação do Processo Aquisição no Contexto do Processo de Desenvolvimento de Software na Synapsis Brasil\n", "abstract": " A execução de um projeto de software às vezes se mostra mais viável com a terceirização de algumas das etapas. Devido a isto, a definição e execução de um processo de aquisição de software são importantes visando ao aumento do controle e da qualidade do projeto. Este artigo apresenta a adoção do processo de aquisição durante a iniciativa de melhoria de processo mais recente da Synapsis Brasil, em conformidade com o MR-MPS e CMMI. É destacada a integração do processo de aquisição com o de desenvolvimento de software. Também são identificados os principais benefícios e dificuldades encontradas, fatores de sucesso e lições aprendidas.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Implementação do MR-MPS Níveis G e F em Grupos de Empresas do Rio de Janeiro\n", "abstract": " A COPPE/UFRJ tem prestado consultoria em melhoria de processos de software há vários anos e desde 2003 tem implantado processos de software em pequenas e médias empresas. Este artigo apresenta o trabalho realizado num grupo de empresas no Rio de Janeiro visando a obtenção dos níveis G e F do MR-MPS no modelo cooperado. São apresentadas as principais características de cada implementação, a estratégia de implementação adotada e as lições aprendidas a partir da experiência relatada.", "num_citations": "1\n", "authors": ["1358"]}
{"title": "Gerenciamento de Portfólio com Foco na Seleção de Projetos\n", "abstract": " Diversos estudos indicam que a estratégia de negócio de uma organização de software pode ser alcançada ou ligada à gerência de portfólio através da seleção dos projetos adequados dentro do processo de alinhamento estratégico definido. Assim um processo de seleção de oportunidades que leve em consideração os benefícios e riscos, o alinhamento estratégico e o balanceamento dos projetos, pode maximizar o retorno sobre os investimentos e as chances de alcance dos objetivos e metas previstos no planejamento estratégico. Este trabalho apresenta uma abordagem para gerência de portfólio, cujo foco principal é a seleção de projetos.", "num_citations": "1\n", "authors": ["1358"]}