{"title": "Defining System Context using Scenarios\n", "abstract": " It is already well known that in order to define the software system requirements deep knowledge of the universe of discourse is needed. This includes not only what is actually happening but also what the plans for the future are. Unless the requirements engineer has a previous knowledge of the domain, he or she may become overloaded by data of different nature. To cope with this, a gradual process which slowly migrates from learning to definition is advisable. During the learning phase, the focus should be placed on the current facts which should be organized and recorded. Later, the forthcoming plans should be also understood but instead of recording them as they are, they should be used to design future universe of discourse models. This chapter focuses on the description of current situations and lays foundations for the description of future situations by means of an evolution process.", "num_citations": "53\n", "authors": ["379"]}
{"title": "Uso de Escenarios en la Derivación de Software\n", "abstract": " Esta tesis presenta una estrategia en la Ingeniería de Requisitos, denominada SDRES, que intenta abordar temas poco tratados en la práctica real, tales como los cambios constantes en los requisitos, defectos del software originados en los requisitos, el contexto organizacional que rodea al sistema de software y la consideración de requisitos de calidad. Esta estrategia está dirigida por modelos (Léxico Extendido del Lenguaje, Escenarios y Documento de Requisitos) y orientada al cliente, por ello utiliza sus modelos escritos en lenguaje natural como medio de comunicación y elicitación. SDRES tiene en cuenta la calidad de los modelos que produce mediante procesos de verificación y validación. Para cada actividad de la estrategia se presenta un conjunto de heurísticas y recomendaciones. Se encara el tema de evolución y versionado de los modelos, así como distintas modalidades de utilizar la estrategia según la complejidad del problema, el conocimiento sobre el mismo y otras características.", "num_citations": "33\n", "authors": ["379"]}
{"title": "Creating Software System Context Glossaries\n", "abstract": " Requirements engineering (RE) is the area of software engineering responsible for the elicitation and definition of the software system requirements. This task implies joining the knowledge of the services that a software system can and cannot provide with the knowledge of clients’ and users’ needs (Jackson, 1995; Katasonov & Sakkinen, 2005; Kotonya & Sommerville, 1998; Sommerville & Sawyer, 1997; Sutcliffe, Fickas, & Sohlberg, 2006; Uchitel, Chatley, Kramer, & Magee, 2006). Frequently, this activity is done by people with a software engineering bias. The underlying hypothesis of this choice is that users’ needs are easier to understand than the software’s possible behaviors. This is not always true; however, this is the metacontext in which most RE heuristics and methodologies have been developed. Understanding clients’ and users’ needs is far more complex than merely interviewing selected clients and …", "num_citations": "29\n", "authors": ["379"]}
{"title": "Explicitar Requisitos del Software usando Escenarios.\n", "abstract": " Los escenarios describen situaciones del proceso del negocio, tanto del proceso observable actual como del proceso proyectado o futuro. En este último caso los escenarios resultan ser contenedores de la mayoría de los requisitos del sistema de software, pero no son los requisitos propiamente dichos. Muchas de las buenas prácticas o prácticas recomendadas en el proceso de desarrollo de software se basan en la existencia de un documento de requisitos en el que éstos se individualizan en forma precisa. En el presente artículo se presenta una estrategia para confeccionar un documento de requisitos a partir de escenarios ya construidos. La particularidad que presenta la misma es que los requisitos individualizados tienden a ser libres de conflictos y de ambigüedad a consecuencia del propio proceso de producción.", "num_citations": "20\n", "authors": ["379"]}
{"title": "Comprendiendo el Universo de Discurso Futuro con Escenarios.\n", "abstract": " La definición de requisitos es meramente el producto final de la fase de requisitos, pero es el punto de partida basamental para el diseño del software y para la tarea de seguimiento de requisitos, y además en muchos casos es un documento contractual con los clientes. Para lograr una correcta definición, no sólo es necesario comprender el Universo de Discurso presente sino también comprender el Universo de Discurso futuro. Se plantean en este artículo alternativas para la construcción de Escenarios Futuros, utilizando los mismos como medio de representación parcial del Universo de Discurso futuro en el que se asume la presencia del sistema de software que se planifica desarrollar.", "num_citations": "19\n", "authors": ["379"]}
{"title": "Facilitando la Asignación de Prioridades a los Requisitos.\n", "abstract": " Existe una gran variedad de propuestas y estándares internacionales que ofrecen guías de contenido y estilo para la generación de un documento de especificación de requisitos (SRS). Adicionalmente, la literatura da cuenta de diversos métodos para asignar prioridades a los requisitos, que parten de un conjunto de requisitos perfectamente individualizados, frecuentemente plasmados en un SRS. En este artículo se presenta una estrategia alternativa para asignar prioridades a los requisitos, que se apoya en el proceso previo que les dio origen: su derivación desde escenarios y la descomposición de objetivos en subobjetivos.", "num_citations": "16\n", "authors": ["379"]}
{"title": "Correcciones semánticas en métodos de estimación de completitud de modelos en lenguaje natural\n", "abstract": " La Ingeniería de Requisitos tiene como objetivo producir requisitos  de alta calidad, poniendo especial interés en la completitud de los modelos ela-borados. Establecer si la información elicitada y modelada es suficiente para  construir un software que cubra las necesidades del cliente es una cuestión de  difícil respuesta. Existen algunos intentos realizados en ese sentido, tal como  una adaptación del método decaptura-recaptura para estimar el tamaño de mo-delos de requisitos escritos en lenguaje natural. Basados en dicho trabajo y con-siderando la naturaleza de estos modelos, proponemos introducir un análisis  semántico previo a estimar el tamaño, dado que el método predictivo solo con-templa aspectos formales y cuantitativos. Dicho análisis semántico estudia la re-levancia, pertenencia, sinonimia y homonimia del contenido textual del modelo.  Comparando los resultados estadísticos detrabajos precedentes contra los obte-nidos realizando correcciones semánticas, concluimos que estas son beneficio-sas para la estimación dela completitud de modelos en lenguaje natural.", "num_citations": "15\n", "authors": ["379"]}
{"title": "Dealing with Completeness in Requirements Engineering\n", "abstract": " The Requirements Engineering (RE) goal is to systematize the process of requirements construction and management (Maculay, 1993; Reubenstein & Waters, 1991; Maté & Silva, 2005) along with the creation of a compromise among clients and users with developers, since both human groups must participate and collaborate together. To accomplish such tasks, the requirements engineers should understand and participate in the definition of the context of use for the software system to be developed. The requirements engineers usually ignore totally or partially both, the current and the foreseen future context of use. The latter must be conceived having as a resource the new tool: the system software itself. Frequently, nobody knows in detail such future context of use. To be able to participate in the definition of the future business process, the requirements engineers must understand the current business process …", "num_citations": "12\n", "authors": ["379"]}
{"title": "Un abordaje al problema de completitud en requisitos de software\n", "abstract": " La completitud es uno de los temas imposibles o casi imposibles de  ponderar  en la Ingeniería de Software en general y en la Ingeniería de  Requisitos en particular. Se han hecho algunos intentos de estimar la  completitud en los casos de prueba en inspecciones de sistemas mediante el uso  de técnicas predictivas. Estas técnicas permiten estimar el grado de completitud  alcanzado. Entre ellas se encuentra Detection Profile Method, que fue con  anterioridad aplicada a un modelo de requisitos escrito en lenguaje natural. Los  resultados fueron muy promisorios, pese a basarse sólo en aspectos formales y  cuantitativos del modelo. Una revisión ulterior de estos resultados ha permitido detectar que existen factores cualitativos, como distintas personas observan distintos problemas o partes del  mismo  problema, que podrían haber  distorsionado los resultados alcanzados. En el presente artículo, se reportan los  resultados de reanalizar el problema incorporando algunos elementos  semánticos a las estrategias involucradas", "num_citations": "12\n", "authors": ["379"]}
{"title": "A requirements engineering process adapted to global software development\n", "abstract": " MIGHETTI, Juan P. y HADAD, Graciela DS. A Requirements Engineering Process Adapted to Global Software Development. CLEIej [online]. 2016, vol. 19, n. 3, pp. 181-209. ISSN 0717-5000.", "num_citations": "7\n", "authors": ["379"]}
{"title": "Mejoras a un modelo léxico mediante mapas conceptuales\n", "abstract": " Para aumentar la probabilidad de éxito de un proyecto de software es fundamental partir de buenas especificaciones de requisitos, pues defectos en ellas se trasladan a subsiguientes modelos y componentes de software. Es por ello que deben realizarse verificaciones tempranas de los modelos que se construyen en el proceso de requisitos. La mayoría de las técnicas de verificación apuntan a detectar defectos del tipo hechos incorrectos, inconsistencias y en menor medida omisiones. Frecuentemente, los modelos en la Ingeniería de Requisitos suelen escribirse en lenguaje natural, lo que propende también a la aparición de ambigüedades. Se presenta una propuesta preliminar de verificación de un modelo léxico utilizando mapas conceptuales, centrada en detectar principalmente omisiones y ambigüedades, y en formular correcciones a las mismas. Esta propuesta fue aplicada a un caso real, donde se comprobó la detección de un número razonable de defectos.", "num_citations": "6\n", "authors": ["379"]}
{"title": "Mejoras semánticas para estimar la Completitud de Modelos en Lenguaje Natural\n", "abstract": " La Ingeniería de Requisitos tiene como objetivo  producir requisitos de alta calidad, siendo la  completitud un aspecto crítico. ¿Se ha elicitado y  modelado la suficiente información para construir  un sistema de software que cubra las expectativas y  necesidades del cliente? Esuna pregunta de difícil  respuesta a pesar de algunos intentos que se están  realizando en ese sentido. Un estudio de la  estimación del tamaño de modelos de requisitos  escritos en lenguaje natural ha dado resultados  prometedores, aunque se consideraron sólo los  aspectos formales y cuantitativos. Debido a la  naturaleza de estos modelos, se ha introducido un  análisis semántico que se realiza previo a la  aplicación del método estimativo de tamaño. Todos  los trabajos de estimación de tamaño, tanto con o  sin análisis semántico previo, se realizaron  utilizando una adaptación del método de captura-recaptura. En este artículo se presenta un nuevo  estudio de estimación de tamaño sobre un modelo  generado siguiendo un proceso de construcción más  refinado que el utilizado en estudios anteriores. Se  pudo observar que pese a las mejoras incorporadas  y varios estudios realizados, persiste aún una gran  incompletitud en los modelos elaborados. Se  considera que es probable que sea necesario  incrementar la profundidad del análisis semántico  para mejorar la estimación de completitud.", "num_citations": "5\n", "authors": ["379"]}
{"title": "Scenario inspections\n", "abstract": " Scenarios help practitioners to better understand the requirements of a software system as well as its interface with the environment. However, despite their widespread use both by object-oriented development teams and human–computer interface designers, scenarios are being built in a very ad-hoc way. Departing from the requirements engineering viewpoint, this article shows how inspections help software developers to better manage the production of scenarios. We used Fagan’s inspections as the main paradigm in the design of our proposed process. The process was applied to case studies and data were collected regarding the types of problems as well as the effort to find them.", "num_citations": "5\n", "authors": ["379"]}
{"title": "Nominalizations in requirements engineering natural language models\n", "abstract": " It is a usual practice to use natural language in any document intended for clients and users in the requirements engineering process of a software development. This facilitates the comprehension of the requirements engineer's proposals to clients and users. However, natural language introduces some drawbacks, such as ambiguity and incompleteness, which attempt a good comprehension of those documents. Glossaries help by reducing ambiguity, though they introduce their own linguistic weaknesses. The nominalization of verbs is one of them. There are sometimes appreciable differences between using a verb form or its nominal form, while in other cases they may be synonyms. Therefore, the requirements engineer must be aware of the precise meaning of each term used in the application domain in order to correctly define them and properly use them in every document. In this chapter, guidelines about …", "num_citations": "4\n", "authors": ["379"]}
{"title": "Dynamic Situational Adaptation of a Requirements Engineering Process\n", "abstract": " Literature shows that the elicitation techniques used in a requirements engineering process are often chosen based on the particular characteristics of the application context, mainly related to the involved human sources of information. However, these particularities, usually called situational factors, are seldom taken into account in other activities of the requirements process. Most situational factors, when considered in software projects, have a high influence on the requirements process. Therefore, the different situations that may attempt against or may favor a successful requirements process should be identified at the beginning of the project. Additionally, some factors may evolve along with software development life cycle; this may imply re-planning the requirements process at later strategic milestones. In this chapter, a process for constructing and dynamically adapting a requirements process is proposed. The …", "num_citations": "4\n", "authors": ["379"]}
{"title": "Procesamiento de lenguaje natural para estudiar completitud de requisitos\n", "abstract": " La Ingeniería de Software incluye el estudio inicial de los requisitos del sistema de software a desarrollar. A ello se dedican los Ingenieros de Requisitos, generando modelos que logren representar las necesidades de los clientes y usuarios y las soluciones a las mismas. El desarrollo de modelos de requisitos en lenguaje natural facilita la interacción entre todos los involucrados, aunque contribuye a generar ambigüedades. Por otro lado se ha comprobado la existencia de omisiones en una cantidad muy superior a la imaginada intuitivamente. Por su propia naturaleza, las omisiones son notoriamente elusivas. El desarrollo de un mismo modelo acerca del mismo problema por personas diferentes es la forma más eficaz para vislumbrar la magnitud de las omisiones en el dominio de la Ingeniería de Requisitos y posiblemente en muchas otras áreas. Para realizar estudios sobre la completitud de los modelos desarrollados, a fin de mejorar la calidad de los mismos, se ha propuesto la generación de una herramienta de software que permita comparar modelos escritos en lenguaje natural. Se propone que esta herramienta utilice recursos del Procesamiento del Lenguaje Natural.", "num_citations": "4\n", "authors": ["379"]}
{"title": "Experimento Controlado en la Inspección de un Léxico mediante Mapas Conceptuales\n", "abstract": " El proceso de Ingeniería de Requisitos involucra comprender el comportamiento actual en un contexto y definir la situación futura al incorporar un sistema de software. Es frecuente durante el proceso de requisitos construir modelos escritos en lenguaje natural, dado que facilitan la elicitación, validación y negociación con los clientes. Estas facilidades se incrementan cuando se escriben usando el lenguaje propio del cliente.Un modelo construido tempranamente en el proceso de requisitos es el Léxico Extendido del Lenguaje. Es un glosario que permite comprender y definir el vocabulario utilizado en un contexto, siendo un medio para mejorar la comunicación entre los involucrados y promover el uso de dicho vocabulario en la descripción de otros modelos.", "num_citations": "4\n", "authors": ["379"]}
{"title": "Estudio semántico de modelos construidos por elicitadores independientes observando el mismo problema: Proyecto Completitud de Modelos de Requisitos\n", "abstract": " Uno de los principales problemas que se presenta en la Ingeniería de Requisitos es la incompletitud  [Kotonya 98] [Loucopoulos 95] [Firesmith 05]. Esto se refiere a la dificultad en establecer si se ha elicitado  y modelado toda la información requerida para desarrollar un sistema de software que cubra las expectativas y necesidades de los clientes y usuarios.", "num_citations": "4\n", "authors": ["379"]}
{"title": "Derivar casos de uso de un glosario\n", "abstract": " El modelado del negocio permite detectar debilidades en los procesos del negocio dando pie a proyectar mejoras eficientes involucrando sistemas de software. Utilizando modelos en lenguaje natural se achica la brecha de comunicación entre los usuarios y los ingenieros de software, y cuando además se trata de modelos como los casos de uso o los escenarios, éstos estimulan la imaginación para proyectar mejoras en los procesos del negocio con sistemas de software, tanto por parte de los ingenieros de software como de los propios usuarios. Se presenta en este artículo un enfoque para el modelado del negocio construyendo casos de uso a partir de un glosario específico, denominado léxico extendido del lenguaje. Este enfoque aborda una modalidad middle-out para el modelado de los casos de uso, ofreciendo ventajas de arranque frente a otras propuestas.", "num_citations": "4\n", "authors": ["379"]}
{"title": "Inspección del lexico extendido del lenguaje﻿\n", "abstract": " El uso de glosariosen el proceso de elicitación de requisitos se ha difundido tanto entre los desarrolladores como entre los investigadores en el campo de la Ingeniería de Requisitos. Por otro lado, se ha comprobado que...", "num_citations": "4\n", "authors": ["379"]}
{"title": "Críticas Cognitivas a Heurísticas Orientadas a Modelos.\n", "abstract": " The requirements, as the foundation stone of the software system development, must be of the best possible quality, covering the real needs of the clients and the limitations of the project. Reaching an acceptable level of quality is not easy and sometimes it is not usually met. In previous research projects, these quality levels have been thoroughly evaluated in natural language written models, mainly in glossaries with definitions of the terms of the language used in the context of application, observing in these cases a low quality and low repetitiveness thereof. This feature is virtually independent of the model and of the sources of information used. Despite repeated efforts consisting of the incorporation of new heuristics, the improvements achieved were unsatisfactory. A retrospective review of these works allowed to detect that it is undoubtedly the cognitive ability of the own requirements engineer the origin of these defects. Notably, the heuristics used provide rudimentary guides on how to prepare the elicited information. This lack is the basis of the exploratory-descriptive research project that has been initiated and presented here.", "num_citations": "2\n", "authors": ["379"]}
{"title": "Evolución de los Factores Situacionales durante el Proceso de Requisitos\n", "abstract": " La literatura presenta una diversidad de procesos de software, que dependen en gran medida del tipo de software a construir y de la envergadura del mismo. La selección del proceso más adecuado y la adaptación a un contexto específico suele ser a su vez fuertemente dependiente de la experiencia de los desarrolladores. Sin embargo, condicionar el análisis de los factores situacionales de esta manera es una restricción innecesaria. Por otra parte, muchos de estos factores impactan en el proceso de software desde sus etapas iniciales. Es por ello que es beneficioso realizar una adaptación lo más temprana posible, en función de factores observables en el contexto. Es decir, considerar los factores situacionales desde el proceso de requisitos mismo. A partir de varios casos reales donde se aplicó un proceso de requisitos, se inició la evaluación de dichos factores, observándose que algunos de ellos son difíciles de establecer con precisión en los primeros pasos del proceso o que por su naturaleza cambian a lo largo del proceso. Conocer qué factores son más proclives a evolucionar por mejora de la estimación inicial o por cambios genuinos permitirá una mejor adaptación del proceso de requisitos.", "num_citations": "2\n", "authors": ["379"]}
{"title": "Inspección Centrada en Omisiones y Ambigüedades de un Modelo Léxico.\n", "abstract": " El uso de modelos escritos en lenguaje natural en la producción de requisitos está ampliamente difundido tanto en la literatura como en el ámbito profesional. Si bien estos modelos favorecen la comunicación entre los involucrados y la validación, presentan ciertos obstáculos, como la ambigüedad del texto y la dificultad en realizar verificaciones automatizadas. La inspección es reconocida como una técnica de verificación de alta efectividad para detectar defectos en código fuente, modelos de diseño y modelos de requisitos. Se propone una variante de la técnica de inspección basada en la construcción de mapas conceptuales para verificar un modelo léxico. Estudios estadísticos han comprobado que este modelo léxico presenta un bajo nivel de completitud, y que puede arrastrarse a otros modelos pues suele construirse al inicio de un proceso de requisitos. Dado ello, la inspección propuesta se aboca a detectar principalmente omisiones y ambigüedades, habiéndose probado en siete casos con resultados promisorios.", "num_citations": "2\n", "authors": ["379"]}
{"title": "Priorizar Requisitos: un Estudio sobre sus Propósitos\n", "abstract": " La literatura propone diversidad de técnicas de asignación de prioridades a requisitos, las que a veces se aplican sobre otros elementos intermedios generados en el proceso de ingeniería de requisitos, tales como casos de uso, historias de usuario, funciones o intereses estratégicos. Así como existe una variedad de algoritmos, escalas de valoraciones cuantitativas y cualitativas, puntos de vista y criterios a utilizar, también se pueden observar distintos propósitos al asignar prioridades. Esto último es un tema poco tratado cuando se realizan estudios comparativos de las mismas. Asimismo, el uso de estas técnicas debiera ser coherente con su propósito, sin embargo, se ha observado que esto no siempre ocurre. El objetivo principal del presente artículo es justamente poner en evidencia los propósitos explícitos y subyacentes de las técnicas de priorización y la coherencia o su falta en oportunidad de su uso, lo que no es una cuestión menor porque gran parte de las actividades del proceso de desarrollo están influenciadas por estas prioridades.", "num_citations": "2\n", "authors": ["379"]}
{"title": "Heurísticas para el modelado de requisitos escritos en lenguaje natural\n", "abstract": " El diseño de heurísticas de calidad comprobable que permitan facilitar la construcción de modelos en la Ingeniería de Requisitos es una ardua tarea. Disponer de dichas heurísticas simplifica las actividades del ingeniero de requisitos y permite mejorar la calidad de los modelos producidos. Trabajando sobre problemas de completitud de modelos en lenguaje natural, se observó que algunas heurísticas de construcción de dichos modelos no lograban efectos reales en la reducción de las omisiones. Es por ello que se propone una mejora en las heurísticas para facilitar la creación de un modelo en lenguaje natural llamado Léxico Extendido del Lenguaje. Estas heurísticas se elaboraron en base a la identificación de las causas que provocaban las omisiones detectadas.", "num_citations": "2\n", "authors": ["379"]}
{"title": "Introducing Variability in a Client-Oriented Requirements Engineering Process\n", "abstract": " It is a good practice to consider the adaptation of any process to particular situations. This applies to Requirements Engineering where the requirements production process becomes adaptable to particular situations. Indicators depicting these situations should be created in order to guide the choice of the requirements process that best suits each specific case. Almost all literature offers a fixed requirements process independent of the context where it will be carried out. Top-down and bottom-up approaches are the most widespread ones, though middle-out approaches or combinations of them sometimes provide more accurate solutions. Our present research project “Adaptability and Completeness in Requirements Process” is centered on improving a well-developed requirements process based on natural language models (a glossary, scenarios and requirement specifications). The idea is to establish the factors that may influence a software project and the adaptations that may be introduced in the requirements process.", "num_citations": "2\n", "authors": ["379"]}
{"title": "Inspecciones para mejorar la calidad de modelos en lenguaje natural\n", "abstract": " Las inspecciones han probado ser de gran eficacia en la detección de defectos en código fuente, por lo que esta técnica se ha adaptado para verificar modelos elaborados en el proceso de especificar requisitos. La literatura ha propuesto algunas variantes de inspección en el modo de detectar defectos en estos modelos, sin embargo, los estudios empíricos realizados no alcanzan para establecer qué variante puede ser más apropiada en determinadas situaciones, en función de la calidad exigida y tiempos disponibles. Dado el uso frecuente de modelos escritos en lenguaje natural en el proceso de requisitos, se ha llevado a cabo un experimento para comparar la eficiencia y eficacia de tres variantes de inspección aplicadas a 5 modelos léxico. Los resultados obtenidos permiten establecer una aproximación inicial en cuanto a que la variante basada en la lectura constructiva detecta un número superior de defectos, principalmente omisiones y ambigüedades, aunque insumiendo más tiempo.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Enhancing a Lexicon Model by Concept Mapping\n", "abstract": " Starting with good requirements specifications is an essential key to increase the likelihood of software project success. Defects persisting in specifications will inevitable be transferred to subsequent models and software components damaging client expectations through the software product. Therefore, early verifications of requirements models should be a regular activity in a software process. Most verification techniques aim to detect defects about wrong facts, inconsistencies and to a lesser extent omissions. Models produced in a Requirements Engineering process are frequently written in natural language, thus enabling the appearance of ambiguities. This article presents a preliminary proposal for verifying a lexicon model driven by concept maps, which is mainly focused on detecting omissions and ambiguities, and it recommends corrections to the model. This proposal was applied to a model produced for a real software project, detecting a reasonable number of defects.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Uso de un Léxico y Escenarios para Mitigar Amenazas a Requisitos en el Desarrollo Global de Software.\n", "abstract": " El desarrollo global de software se está difundiendo cada vez más en las organizaciones. Si bien brinda ventajas competitivas al aumentar la velocidad en las entregas del software y reducir costos por aprovechar recursos calificados más baratos, es una forma de trabajo compleja, donde amenazas provenientes principalmente de distancias geográficas y culturales pueden impactar negativamente en actividades y artefactos del proceso. La calidad de los requisitos suele deteriorarse debido a estas amenazas latentes no tratadas, propagando defectos en subsiguientes fases del desarrollo. Estas dificultades fueron estudiadas en un proyecto real de gran envergadura, desarrollado bajo esta modalidad de trabajo. Debido a ellas, se elaboró una propuesta utilizando un modelo Léxico y Escenarios para mitigar amenazas que afectan a los requisitos en esta modalidad distribuida. La propuesta fue aplicada en un nuevo proyecto real de similares características y, al compararlos en calidad y tiempos en requisitos, se obtuvieron resultados suficientemente promisorios.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Interacción de Atributos al Priorizar Requisitos a través de Objetivos\n", "abstract": " Una actividad que ejerce una fuerte influencia en la gestión de proyectos de software es establecer el orden de implementar los requisitos del software. Este ordenamiento determina la necesidad de recursos humanos y tecnológicos a lo largo del tiempo, el modo de puesta en operación parcial del software y su mantenimiento, entre otras actividades. Es uno de los motores de la evolución de los requisitos implementados y a implementar debido a realimentaciones de los usuarios al comenzar a utilizar los módulos instalados. Definir este orden es uno de los propósitos que detentan muchas técnicas de asignación de prioridades. Se ha observado que varias de estas técnicas no pueden ser aplicadas cuando se tiene un gran número de requisitos. Atendiendo a este problema, en proyectos anteriores se elaboró una propuesta para asignar prioridades utilizando los objetivos del software, de manera tal de transferir prioridades desde objetivos específicos hacia los requisitos, ya que el número de objetivos conforma un conjunto mucho menor que el de requisitos. La propuesta actual consiste en definir qué atributos deben utilizarse para establecer el orden de implementación de los requisitos.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Proceso de requisitos adaptable a factores situacionales\n", "abstract": " La estrategia de ingeniería de requisitos orientada al cliente, que se ha desarrollado a lo largo de varios proyectos de investigación desde 1995, ha sido difundida a través de cursos de grado y posgrado, y puesta en práctica en varios proyectos de software en la industria. Aún cuando esta estrategia puede considerarse suficientemente madura, todavía requiere mejoras en algunos aspectos relevantes. Una de las mejoras posibles está relacionada con la adaptación del proceso de requisitos a las características del proyecto de software. Estas características se manifiestan en factores observables que atañen al contexto de aplicación y al proyecto mismo. En base a estos factores se pueden tomar decisiones referidas a qué artefactos de requisitos deben construirse, qué actividades del proceso de requisitos son necesarias realizar y qué técnicas específicas son más convenientes aplicar. Es decir, se propone adaptar el proceso de requisitos a cada proyecto de software específico, en base a los factores situacionales imperantes en él. En la práctica hemos encontrado que esta tarea de adaptación no se realiza, o sólo se lleva a cabo parcialmente en base a la experiencia del ingeniero de requisitos a cargo, sin una guía de parámetros a contemplar.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Trazabilidad de versiones en Ingeniería de Requisitos\n", "abstract": " La trazabilidad persiste como un aspecto relevante y difícil de tratar en la práctica de la Ingeniería de Software. El presente proyecto considera tratar en forma combinada la trazabilidad y el manejo de versiones en el caso de modelos de requisitos. Es un hecho observable que las trazas fluyen esencialmente del proceso del negocio hacia los requisitos, mientras que los cambios de versiones suelen tener origen en fenómenos casi independientes de este flujo. Esta ortogonalidad puede ser muy bien descripta mediante un modelo conjunto de trazas y versionado. Este modelo debe ser acompañado de guías de producción de trazas para modelos basados en lenguaje natural. La idea primordial es que el modelo de trazas esté desacoplado de los modelos del problema y que la producción de trazas se realice simultáneamente con el modelado de requisitos y en forma automática o semiautomática. Por otro lado, se manejan los cambios en los modelos de requisitos generando concurrentemente cambios en las trazas, versionando luego las trazas.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Completitud en la Ingenieria de Requisitos\n", "abstract": " Cuando proyectos de software de gran envergadura fracasan (ver cuadro), habitualmente se llevan a cabo estudios posteriores para identificar las causas de dichos fracasos. Algunos de estos estudios son realizados por The Standish Group con sus denominados reportes CHAOS, por U.S. Government Accountability Office (GAO) de los Estados Unidos y por muchos investigadores en el área de la ingeniería de software [Faulk 92] [Lutz 93] [Leveson 95] [Finkelstein 96] [Breitman 99]. Una de las principales causas detectadas a través de estos estudios han sido problemas en los requisitos: requisitos inadecuados, cambios en los requisitos durante el ciclo de vida, requisitos no bien comprendidos o comprendidos tardíamente y requisitos incompletos.La incompletitud es uno de los graves problemas que se afronta en la fase de producción de requisitos [Kotonya 98] [Loucopoulos 95] [Firesmith 05], lo que inevitablemente se arrastra a las siguientes fases del proceso de desarrollo de software si no es atendida oportunamente. No es una tarea trivial detectar información faltante. Procurar la completitud de los requisitos, es por un lado un aspecto de calidad y por otro requiere una comprensión acabada del problema bajo estudio", "num_citations": "1\n", "authors": ["379"]}
{"title": "Agregando semántica a técnicas de predicción de completitud en modelos de requisitos\n", "abstract": " En casi todas las ramas de la ingeniería se genera un bosquejo/maqueta/plano/diagrama que representa el artefacto a construir. A través de él, se planifica la construcción de ese artefacto y se asegura que responda a las expectativas de los clientes. Sin embargo, en la Ingeniería de Software la dificultad se centra justamente en la representación del producto a construir, pues dicho producto (el software) es en sí mismo una representación parcial del mundo real. Esto requiere prestar especial atención a la generación de dichos modelos para que sean precisos, correctos y completos. El proceso de desarrollo de software debe arrancar elaborando modelos de requisitos con la calidad apropiada, siendo la completitud de los mismos una característica primordial. Aplicar técnicas de verificación y validación de los modelos debe formar parte de las actividades continuas del proceso de desarrollo, aunque ellas no permiten asegurar el grado de completitud alcanzado. Es necesario recurrir a técnicas predictivas que realicen estimaciones del tamaño esperado del modelo de requisitos. Se propone entonces agregar análisis semántico a la aplicación de estas técnicas predictivas, en particular el Método de Captura y Recaptura. Esto conllevará a establecer mejoras al proceso de construcción de los modelos de requisitos.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Documentando Requisitos en el Contexto de su Elicitacion\n", "abstract": " La línea de investigación “Especificación de Requisitos” está enfocada en formular los requisitos del sistema en forma clara y precisa, de manera tal de facilitar la gestión de los mismos y establecer las etapas de su puesta en servicio a través de unidades de software. Para ello, se propone el desarrollo de una estrategia para confeccionar un documento de definición de requisitos (SRS) a partir de escenarios futuros ya construidos, y la asignación de prioridades a dichos requisitos. La particularidad que se vislumbra en esta estrategia es que los requisitos individualizados tienden a ser libres de conflictos y de ambigüedad a consecuencia del propio proceso de producción La propuesta para asignar prioridades a requisitos se apoya en el proceso previo que les dio origen: su derivación desde escenarios y la descomposición de objetivos en sub-objetivos.", "num_citations": "1\n", "authors": ["379"]}
{"title": "Using scenarios to derive software\n", "abstract": " The present thesis describes a Requirements Engineering strategy, called SDRES (Scenario Driven Requirements Engineering Strategy), which proposes to face topics rarely treated in real practice, such as continuous changes in requirements, software defects originated during requirements production, the organisational context surrounding the software system and the treatment of quality requirements.", "num_citations": "1\n", "authors": ["379"]}