{"title": "On-line unsupervised outlier detection using finite mixtures with discounting learning algorithms\n", "abstract": " Outlier detection is a fundamental issue in data mining, specifically in fraud detection, network intrusion detection, network monitoring, etc. SmartSifter is an outlier detection engine addressing this problem from the viewpoint of statistical learning theory. This paper provides a theoretical basis for SmartSifter and empirically demonstrates its effectiveness. SmartSifter detects outliers in an on-line process through the on-line unsupervised learning of a probabilistic model (using a finite mixture model) of the information source. Each time a datum is input SmartSifter employs an on-line discounting learning algorithm to learn the probabilistic model. A score is given to the datum based on the learned model with a high score indicating a high possibility of being a statistical outlier. The novel features of SmartSifter are: (1) it is adaptive to non-stationary sources of data; (2) a score has a clear statistical/information …", "num_citations": "832\n", "authors": ["834"]}
{"title": "Outlier detection using replicator neural networks\n", "abstract": " We consider the problem of finding outliers in large multivariate databases. Outlier detection can be applied during the data cleansing process of data mining to identify problems with the data itself, and to fraud detection where groups of outliers are often of particular interest. We use replicator neural networks (RNNs) to provide a measure of the outlyingness of data records. The performance of the RNNs is assessed using a ranked score measure. The effectiveness of the RNNs for outlier detection is demonstrated on two publicly available databases.", "num_citations": "806\n", "authors": ["834"]}
{"title": "Autobiographical memory in depression: state or trait marker?\n", "abstract": " Two cognitive measures were used to assess 22 patients who met DSM–III–R criteria for major depressive disorder: the Autobiographical Memory (AM) test and the Dysfunctional Attitude Scale. They were followed up over seven months. Measurement of dysfunctional attitudes did not predict outcome at seven months. Overgeneral recall on the AM test at initial assessment, especially for emotionally positive memories, was highly correlated with failure to recover from depression and accounted for 33% of the variance in HRSD score at follow-up. Overgeneral recall of emotional memories did not change during follow-up. It is suggested that overgenerality is a trait marker indicating vulnerability to persistent depression.", "num_citations": "643\n", "authors": ["834"]}
{"title": "Data mining with Rattle and R: The art of excavating data for knowledge discovery\n", "abstract": " Data mining is the art and science of intelligent data analysis. By building knowledge from information, data mining adds considerable value to the ever increasing stores of electronic data that abound today. In performing data mining many decisions need to be made regarding the choice of methodology, the choice of data, the choice of tools, and the choice of algorithms. Throughout this book the reader is introduced to the basic concepts and some of the more popular algorithms of data mining. With a focus on the hands-on end-to-end process for data mining, Williams guides the reader through various capabilities of the easy to use, free, and open source Rattle Data Mining Software built on the sophisticated R Statistical Software. The focus on doing data mining rather than just reading about data mining is refreshing. The book covers data understanding, data preparation, data refinement, model building, model evaluation, and practical deployment. The reader will learn to rapidly deliver a data mining project using software easily installed for free from the Internet. Coupling Rattle with R delivers a very sophisticated data mining environment with all the power, and more, of the many commercial offerings.", "num_citations": "531\n", "authors": ["834"]}
{"title": "Emergence of vancomycin-resistant enterococci in New York City\n", "abstract": " Enterococci, a common cause of nosocomial infection, are intrinsically resistant to most antimicrobials and readily acquire additional resistance. Vancomycin-resistant enterococci (VRE) have caused clusters of nosocomial infections since 1988. In April, 1991, the New York City Department of Health asked all city laboratories to submit suspected VRE isolates for confirmation. Clinical and epidemiological characteristics of the first 100 patients with VRE were identified, and antimicrobial susceptibilty testing, restriction enzyme analysis, and DNA-DNA hybridisation with the vanA gene probe were done. From September, 1989, to October, 1991, 361 patients with VRE were identified at 38 hospitals. The number of hospitals reporting VRE increased from 1 in 1989 to 38 by October, 1991. 98% of 100 VRE infections were nosocomially acquired and 83% patients had received vancomycin and/or a cephalosporin in the 30 …", "num_citations": "417\n", "authors": ["834"]}
{"title": "A comparative study of RNN for outlier detection in data mining\n", "abstract": " We have proposed replicator neural networks (RNNs) for outlier detection. We compare RNN for outlier detection with three other methods using both publicly available statistical datasets (generally small) and data mining datasets (generally much larger and generally real data). The smaller datasets provide insights into the relative strengths and weaknesses of RNNs. The larger datasets in particular test scalability and practicality of application.", "num_citations": "343\n", "authors": ["834"]}
{"title": "Big data opportunities and challenges: Discussions from data analytics perspectives [discussion forum]\n", "abstract": " \"Big Data\" as a term has been among the biggest trends of the last three years, leading to an upsurge of research, as well as industry and government applications. Data is deemed a powerful raw material that can impact multidisciplinary research endeavors as well as government and business performance. The goal of this discussion paper is to share the data analytics opinions and perspectives of the authors relating to the new opportunities and challenges brought forth by the big data movement. The authors bring together diverse perspectives, coming from different geographical locations with different core research expertise and different affiliations and work experiences. The aim of this paper is to evoke discussion rather than to provide a comprehensive survey of big data research.", "num_citations": "254\n", "authors": ["834"]}
{"title": "Rattle: a data mining GUI for R\n", "abstract": " Data mining delivers insights, patterns, and descriptive and predictive models from the large amounts of data available today in many organisations. The data miner draws heavily on methodologies, techniques and algorithms from statistics, machine learning, and computer science. R increasingly provides a powerful platform for data mining. However, scripting and programming is sometimes a challenge for data analysts moving into data mining. The Rattle package provides a graphical user interface specifically for data mining using R. It also provides a stepping stone toward using R as a programming language for data analysis.", "num_citations": "220\n", "authors": ["834"]}
{"title": "PMML: An open standard for sharing models.\n", "abstract": " The PMML package exports a variety of predictive and descriptive models from R to the Predictive Model Markup Language (Data Mining Group, 2008). PMML is an XML-based language and has become the de-facto standard to represent not only predictive and descriptive models, but also data preand post-processing. In so doing, it allows for the interchange of models among different tools and environments, mostly avoiding proprietary issues and incompatibilities.The PMML package itself (Williams et al., 2009) was conceived at first as part of Togaware’s data mining toolkit Rattle, the R Analytical Tool To Learn Easily (Williams, 2009). Although it can easily be accessed through Rattle’s GUI, it has been separated from Rattle so that it can also be accessed directly in R.", "num_citations": "212\n", "authors": ["834"]}
{"title": "RI: an Expert in the Computer Systems Domain.\n", "abstract": " INTRODUCTION. Rl* is a rule-based system that has much in common with other domain-specific systems that have been developed over the past several years [l, 81. It differs from these systeins primarily in its use of Match rather than Generate-and-Test as its central problem solving method [2]; rather than exploring several hypotheses until an acceptable one is found, it exploits its knowledge of its task domain to generate a single acceptable solution. Rl’s domain of expertise is configuring Digital Equipment Corporation’s VAX-l l/780 systems. Its input is a customer’s order and its output is a set of diagrams displaying the spatial relationships among the components on the order; these diagrams are used by the technician who physically assembles the system. Since an order frequently lacks one or more components required for system functionality, a major part of Rl’s task is to notice what components are missing and add them to the order. Rl is currently being used on a regular basis by DEC’s manufacturing organization. 3THE DOMAIN. The VAX-11/780 is the first implementation of DEC’s VAX-1 1 architecture. The VAX-1 l/780 uses a high speed synchronous bus, the sbi, as its primary interconnect; the central processor, one or two memory control units, up to four massbus interfaces, and up to four unibus interfaces can be connected to the sbi. The massbuses and particularly the unibuses can support a wide variety of peripheral devices. A typical system contains about 90 components; these include cabinets, periperal devices, drivers for the devices, and cables. There are a large number of rules that constrain the ways in which these …", "num_citations": "206\n", "authors": ["834"]}
{"title": "Categoric and extended autobiographical memories\n", "abstract": " When people recall specific events in response to word cues, they often give overgeneral memories. These are either “categoric” (e.g., “Times I have fallen downstairs”) or “extended” memories (e.g., “The years I spent in Oxford”). Three studies showed that these two types of overgenerality were functionally independent of each other. Categoric memories were more likely to arise from deficient operation of the Supervisory Attentional System which normally formulates intermediate descriptions for searching memory. Extended memories were more likely to be given in response to emotional cues, and to be older and more unique, suggesting that they arise from a search for distinctiveness. Consistent with these distinctions, a study of depressed suicidal people showed that their greater overgenerality was wholely due to an excess of categoric memories.", "num_citations": "195\n", "authors": ["834"]}
{"title": "Computer-assisted therapy for medication-resistant auditory hallucinations: proof-of-concept study\n", "abstract": " BackgroundOne in four patients with schizophrenia responds poorly to antipsychotic medication, continuing to hear persecutory auditory hallucinations. Patients who are able to sustain a dialogue with their persecutor feel much more in control.AimsTo develop a computerised system that enables the patient to create an avatar of their persecutor. To encourage them to engage in a dialogue with the avatar, which the therapist is able to control so that the avatar progressively yields control to the patient.MethodAvatar therapy was evaluated by a randomised, single blind, partial crossover trial comparing the novel therapy with treatment as usual (TAU). We used three main outcome measures: (a) the Psychotic Symptom Rating Scale (PSYRATS), hallucinations section; (b) the Omnipotence and Malevolence subscales of the Revised Beliefs About Voices Questionnaire (BAVQ-R); and (c) the Calgary Depression Scale …", "num_citations": "189\n", "authors": ["834"]}
{"title": "Topic oriented community detection through social objects and link analysis in social networks\n", "abstract": " Community detection is an important issue in social network analysis. Most existing methods detect communities through analyzing the linkage of the network. The drawback is that each community identified by those methods can only reflect the strength of connections, but it cannot reflect the semantics such as the interesting topics shared by people. To address this problem, we propose a topic oriented community detection approach which combines both social objects clustering and link analysis. We first use a subspace clustering algorithm to group all the social objects into topics. Then we divide the members that are involved in those social objects into topical clusters, each corresponding to a distinct topic. In order to differentiate the strength of connections, we perform a link analysis on each topical cluster to detect the topical communities. Experiments on real data sets have shown that our approach was able …", "num_citations": "185\n", "authors": ["834"]}
{"title": "The use of mindfulness-based approaches for suicidal patients\n", "abstract": " Mindfulness-based approaches are becoming more widely used for individuals at risk of suicidal behavior: in the treatment of borderline personality disorder (in Dialectical Behavior Therapy), and as a way to reduce relapse in recurrent major depression (in Mindfulness-based Cognitive Therapy). This article describes and examines the commonalities and differences in the use of mindfulness in these two treatments. The reasons for considering the use of mindfulness-based approaches with suicidal individuals more widely are considered and potential risks outlined. The article closes with case examples to illustrate the use of mindfulness in the treatment of suicidal thoughts and behaviors.", "num_citations": "148\n", "authors": ["834"]}
{"title": "HEARSAY-II: A Domain-Independent Framework for Expert Systems.\n", "abstract": " Hearsay-III is a conceptually simple extenslon of the basic ideas in the Hearsay-II speech-understanding system. That domain-dependent expert system was, in turn, a product of a tradition of increasingly sophisticated production-rule-based expert systems. The use of production systems to encapsulate expert knowledge in manageable and relatively independent chunks has been a strong recurrent theme in Al. These systems have steadily grown more sophisticated in their pattern-match and action languages, and in their conflict-resolution mechanisms. In this paper, we describe the Hearsay-III framework, concentrating on its departures from Hearsay-II.", "num_citations": "133\n", "authors": ["834"]}
{"title": "Mining unexpected temporal associations: applications in detecting adverse drug reactions\n", "abstract": " In various real-world applications, it is very useful mining unanticipated episodes where certain event patterns unexpectedly lead to outcomes, e.g., taking two medicines together sometimes causing an adverse reaction. These unanticipated episodes are usually unexpected and infrequent, which makes existing data mining techniques, mainly designed to find frequent patterns, ineffective. In this paper, we propose unexpected temporal association rules (UTARs) to describe them. To handle the unexpectedness, we introduce a new interestingness measure, residual-leverage, and develop a novel case-based exclusion technique for its calculation. Combining it with an event-oriented data preparation technique to handle the infrequency, we develop a new algorithm MUTARC to find pairwise UTARs. The MUTARC is applied to generate adverse drug reaction (ADR) signals from real-world healthcare administrative …", "num_citations": "119\n", "authors": ["834"]}
{"title": "Mining risk patterns in medical data\n", "abstract": " In this paper, we discuss a problem of finding risk patterns in medical data. We define risk patterns by a statistical metric, relative risk, which has been widely used in epidemiological research. We characterise the problem of mining risk patterns as an optimal rule discovery problem. We study an anti-monotone property for mining optimal risk pattern sets and present an algorithm to make use of the property in risk pattern discovery. The method has been applied to a real world data set to find patterns associated with an allergic event for ACE inhibitors. The algorithm has generated some useful results for medical researchers.", "num_citations": "117\n", "authors": ["834"]}
{"title": "Mining the knowledge mine\n", "abstract": " As databases grow in size and complexity the task of adding value to the wealth of data becomes difficult. Data mining has emerged as the technology to add value to enormous databases by finding new and important snippets (or nuggets) of knowledge. With large training sets, however, extremely large collections of nuggets are being extracted, leading to much “fools gold” amongst which to fossick for the real gold. Attention is now being directed towards the problem of how to better focus on the most precious nuggets. This paper presents the hot spots methodology, adopting a multi-strategy and interactive approach to help focus on the important nuggets. The methodology first performs data mining and then explores the resulting models to find the important nuggets contained therein. This approach is demonstrated in insurance and fraud applications.", "num_citations": "117\n", "authors": ["834"]}
{"title": "Cause of death and predictors of all‐cause mortality in anticoagulated patients with nonvalvular atrial fibrillation: data from ROCKET AF\n", "abstract": " BackgroundAtrial fibrillation is associated with higher mortality. Identification of causes of death and contemporary risk factors for all‐cause mortality may guide interventions. Methods and ResultsIn the Rivaroxaban Once Daily Oral Direct Factor Xa Inhibition Compared with Vitamin K Antagonism for Prevention of Stroke and Embolism Trial in Atrial Fibrillation (ROCKET AF) study, patients with nonvalvular atrial fibrillation were randomized to rivaroxaban or dose‐adjusted warfarin. Cox proportional hazards regression with backward elimination identified factors at randomization that were independently associated with all‐cause mortality in the 14 171 participants in the intention‐to‐treat population. The median age was 73 years, and the mean CHADS2 score was 3.5. Over 1.9 years of median follow‐up, 1214 (8.6%) patients died. Kaplan–Meier mortality rates were 4.2% at 1 year and 8.9% at 2 years. The majority of …", "num_citations": "106\n", "authors": ["834"]}
{"title": "An Overview Of Temporal Data Mining.\n", "abstract": " Temporal Data Mining is a rapidly evolving area of research that is at the intersection of several disciplines, including statistics, temporal pattern recognition, temporal databases, optimisation, visualisation, high-performance computing, and parallel computing. This paper is first intended to serve as an overview of the temporal data mining in research and applications.", "num_citations": "95\n", "authors": ["834"]}
{"title": "Molecular Subtyping of Clostridium perfringens by Pulsed-Field Gel Electrophoresis To Facilitate Food-Borne-Disease Outbreak Investigations\n", "abstract": " Clostridium perfringens is a common cause of food-borne illness. The illness is characterized by profuse diarrhea and acute abdominal pain. Since the illness is usually self-limiting, many cases are undiagnosed and/or not reported. Investigations are often pursued after an outbreak involving large numbers of people in institutions, at restaurants, or at catered meals. Serotyping has been used in the past to assist epidemiologic investigations of C. perfringensoutbreaks. However, serotyping reagents are not widely available, and many isolates are often untypeable with existing reagents. We developed a pulsed-field gel electrophoresis (PFGE) method for molecular subtyping of C. perfringens isolates to aid in epidemiologic investigations of food-borne outbreaks. Six restriction endonucleases (SmaI, ApaI, FspI,MluI, KspI, and XbaI) were evaluated with a select panel of C. perfringens strains.SmaI was chosen for …", "num_citations": "92\n", "authors": ["834"]}
{"title": "From\" renaissance\" to restructuring: the dynamics of contemporary urban development\n", "abstract": " The notion that gentrification represents some sort of urban renaissance or revival is widespread, particularly in the United States (Gruen 1964, Alpern 1979, Sumka 1979, DeVito 1980, Demarest 1981). This perspective would imply some kind of prior secular decline and now a reversal of established trends. That is really the meaning of renaissance and it was the explicit symbolism behind the naming of Detroit's Ford-inspired Renaissance Center; the spiritual renewal after the fall. The popularity of the renaissance/revival theme lies in its inherent optimism and the belief that squalor is being expunged and the city is being reclaimed for the respectable classes. As such it is a sharply partisan view of contemporary urban change and one which negates the real history of urban development and change. There was no such simple fall and there is no such simple rebirth.ABSTRACT", "num_citations": "84\n", "authors": ["834"]}
{"title": "Decision models for record linkage\n", "abstract": " The process of identifying record pairs that represent the same real-world entity in multiple databases, commonly known as record linkage, is one of the important steps in many data mining applications. In this paper, we address one of the sub-tasks in record linkage, i.e., the problem of assigning record pairs with an appropriate matching status. Techniques for solving this problem are referred to as decision models. Most existing decision models rely on good training data, which is, however, not commonly available in real-world applications. Decision models based on unsupervised machine learning techniques have recently been proposed. In this paper, we review several existing decision models and then propose an enhancement to cluster-based decision models. Experimental results show that our proposed decision model achieves the same accuracy of existing models while significantly reducing …", "num_citations": "84\n", "authors": ["834"]}
{"title": "Data mining: Theory, methodology, techniques, and applications\n", "abstract": " This volume provides a snapshot of the current state of the art in data mining, presenting it both in terms of technical developments and industrial applications. The collection of chapters is based on works presented at the Australasian Data Mining conferences and industrial forums. Authors include some of Australia's leading researchers and practitioners in data mining. The volume also contains chapters by regional and international authors.", "num_citations": "83\n", "authors": ["834"]}
{"title": "Evolutionary hot spots data mining\n", "abstract": " Data Mining delivers novel and useful knowledge from very large collections of data. The task is often characterised as identifying key areas within a very large dataset which have some importance or are otherwise interesting to the data owners. We call this hot spots data mining. Data mining projects usually begin with ill-defined goals expressed vaguely in terms of making interesting discoveries. The actual goals are refined and clarified as the process proceeds. Data mining is an exploratory process where the goals may change and such changes may impact the data space being explored. In this paper we introduce an approach to data mining where the development of the goal itself is part of the problem solving process. We propose an evolutionary approach to hot spots data mining where both the measure of interestingness and the descriptions of groups in the data are evolved under the influence of …", "num_citations": "81\n", "authors": ["834"]}
{"title": "Classifying very high-dimensional data with random forests built from small subspaces\n", "abstract": " The selection of feature subspaces for growing decision trees is a key step in building random forest models. However, the common approach using randomly sampling a few features in the subspace is not suitable for high dimensional data consisting of thousands of features, because such data often contains many features which are uninformative to classification, and the random sampling often doesn’t include informative features in the selected subspaces. Consequently, classification performance of the random forest model is significantly affected. In this paper, the authors propose an improved random forest method which uses a novel feature weighting method for subspace selection and therefore enhances classification performance over high-dimensional data. A series of experiments on 9 real life high dimensional datasets demonstrated that using a subspace size of features where M is the total number of …", "num_citations": "68\n", "authors": ["834"]}
{"title": "A survey of open source data mining systems\n", "abstract": " Open source data mining software represents a new trend in data mining research, education and industrial applications, especially in small and medium enterprises (SMEs). With open source software an enterprise can easily initiate a data mining project using the most current technology. Often the software is available at no cost, allowing the enterprise to instead focus on ensuring their staff can freely learn the data mining techniques and methods. Open source ensures that staff can understand exactly how the algorithms work by examining the source codes, if they so desire, and can also fine tune the algorithms to suit the specific purposes of the enterprise. However, diversity, instability, scalability and poor documentation can be major concerns in using open source data mining systems. In this paper, we survey open source data mining systems currently available on the Internet. We compare 12 open …", "num_citations": "65\n", "authors": ["834"]}
{"title": "Simultaneous analysis of micro‐RNA and DNA for determining the body fluid origin of DNA profiles\n", "abstract": " Micro‐RNAs (miRNAs) can be specifically expressed in forensically relevant body fluids such as blood or saliva. The aim of the study was to develop a simultaneous extraction and analysis protocol that allows for the acquisition of a DNA profile and the identity of the body fluid using a single process. DNA and micro‐RNA were extracted from blood and saliva before undergoing a cDNA synthesis step by using stem‐loop reverse transcription PCR. The resulting extracts containing DNA and cDNA synthesized from body fluid–specific miRNA markers then underwent standard STR analysis using a modified ABI AmpFℓSTR® NGM SElect™ kit. In all samples, a full DNA profile was obtained along with additional peaks corresponding to the miRNA marker targeted. In all cases, blood samples profiled exhibited a peak indicating the presence of the blood‐specific miRNA marker and the saliva sample profiled exhibited a …", "num_citations": "61\n", "authors": ["834"]}
{"title": "Global survey of the frequency of atrial fibrillation–associated stroke: embolic stroke of undetermined source Global Registry\n", "abstract": " Background and Purpose—Atrial fibrillation (AF) is increasingly recognized as the single most important cause of disabling ischemic stroke in the elderly. We undertook an international survey to characterize the frequency of AF-associated stroke, methods of AF detection, and patient features. Methods—Consecutive patients hospitalized for ischemic stroke in 2013 to 2014 were surveyed from 19 stroke research centers in 19 different countries. Data were analyzed by global regions and World Bank income levels. Results—Of 2144 patients with ischemic stroke, 590 (28%; 95% confidence interval, 25.6–29.5) had AF-associated stroke, with highest frequencies in North America (35%) and Europe (33%) and lowest in Latin America (17%). Most had a history of AF before stroke (15%) or newly detected AF on electrocardiography (10%); only 2% of patients with ischemic stroke had unsuspected AF detected by …", "num_citations": "60\n", "authors": ["834"]}
{"title": "Quantitative PCR analysis of blood-and saliva-specific microRNA markers following solid-phase DNA extraction\n", "abstract": " The use of mRNA for the identification of body fluids is of particular interest in forensic science, and increasing support has been demonstrated for the use of microRNA (miRNA) analysis. MiRNA is more stable than mRNA and has been shown to be differentially expressed in body fluids. No studies involving miRNA analysis from previously extracted DNA samples have yet been reported. The aim of this experiment was to determine if it was possible to conduct miRNA analysis on samples that were previously extracted using standard DNA extraction. Blood and saliva samples were extracted using DNA and RNA kits, followed by cDNA synthesis, and then underwent quantitative PCR analysis. A direct comparison of ΔCt values shows a larger abundance of miRNA following DNA extraction as opposed to total RNA extraction for both blood- and saliva-specific markers. By carrying out a comparison between the …", "num_citations": "57\n", "authors": ["834"]}
{"title": "Mining X-ray images of SARS patients\n", "abstract": " Severe Acute Respiratory Syndrome (SARS) has infected more than 8,000 persons [1] after it first broke out in Guangdong China. As there was no fast and effective detection method of suspected SARS cases,this paper proposes a computer aided SARS detection system (CADSARS) based on data mining techniques.‘Typical pneumonia’ and SARS X-Ray chest radiographs were collected.Feature extraction of these images was performed after segmenting out pulmonary fields. Feature vectors were then constructed to build rules for the discrimination of SARS and ‘typical pneumonia’.Three methods were used to classify these images: C4.5, neural network and CART.Final results show that about 70.94% SARS cases can be detected. ROC charts and confusion matrix by these three methods are given and analyzed.Association rules mining was used to find whether there exists difference of lesions …", "num_citations": "48\n", "authors": ["834"]}
{"title": "Potentiated amygdaloid auditory-evoked potentials and freezing behavior after fear conditioning in mice\n", "abstract": " Elucidation of cellular and molecular mechanisms underlying fear-related memory would greatly benefit from the possibility of combined behavioral and electrophysiological recordings in genetically modified mice. As a first step to this goal, we implanted adult C57BL/6J mice with recording electrodes aimed at the basolateral amygdaloid complex and trained them in an auditory fear conditioning paradigm. After conditioning, animals with paired tone and footshock presentation showed not only intensified freezing behavior lasting for 2 days, but also increases, lasting 4 days, in slope and amplitude of the most negative component of auditory-evoked potentials triggered by the conditioned stimulus. These effects could not be observed in animals with unpaired tone and footshock presentation. Thus, our data show that a long-lasting association of a former neutral tone with an aversive situation is accompanied by a …", "num_citations": "45\n", "authors": ["834"]}
{"title": "Expert systems, knowledge engineering, and AI tools-an overview\n", "abstract": " Tw wo decades in research labs and universities have guided Al technology to commercial thresholds. New applications demonstrate AI's tremendous potential to bring inexpensive processing power to tasks once thoughtbeyond computer capability. Effects on both business and industry will be widespread, for Al technology can become a major competitive force in virtu-ally every marketplace.Successful commercial applications such as Digital Equipment Corporation's XCON configuration advisor for the VAX line have caused major corporations to recognize Al technology's potential; many have either initiated AI research and development groups or are actively integrating Al into their business and products. Many applicationsfinancial management support and manufacturing planning systems, computer-aided engineering workstations, defense systems and resource scheduling tools-will soon incorporate Al …", "num_citations": "45\n", "authors": ["834"]}
{"title": "Antibodies to voltage-gated calcium channels in children with falciparum malaria\n", "abstract": " Falciparum malaria can affect the central nervous system (CNS), causing neurological dysfunction and sequelae. The pathophysiology of these complications is currently very poorly understood. Production of autoantibodies has frequently been reported as a consequence of infection with Plasmodium falciparum. However, at present, the presence of antibodies to components of the CNS during malaria infection has not been reported. We have sought to identify such antibodies, define their specificity, and determine whether they are involved in the development of neurological complications of falciparum malaria. Here, we show that, in a cohort of Kenyan children, levels of antibodies to the voltage-gated calcium channels, but not to other ion channels, increased with the severity of malaria infection.", "num_citations": "41\n", "authors": ["834"]}
{"title": "Legendary pioneers of black radio\n", "abstract": " After World War II, when thousands of African Americans left farms, plantations, and a southern way of life to migrate north, African American disc jockeys helped them make the transition to the urban life by playing familiar music and giving them hints on how to function in northern cities. These disc jockeys became cultural heroes and had a major role in the development of American broadcasting. This collection of interviews documents the personalities of the pioneers of Black radio, as well as their personal struggles and successes. The interviewees also define their roles in the civil rights movement and relate how their efforts have had an impact on how African Americans are portrayed over the air.", "num_citations": "41\n", "authors": ["834"]}
{"title": "Foscarnet for cytomegalovirus retinitis\n", "abstract": " Excerpt             To the editor: We read with interest the three reports (1-3) of treatment with dihydroxy-propoxymethylguanine (DHPG) in 15 immunocompromised patients with cytomegalovirus infection. It was notable that in 5 patients with retinitis, relapse occurred as early as 4 weeks after the end of DHPG infusion and that daily maintenance treatment was required to sustain remission. Foscarnet (4) is a virostatic agent of importance in the treatment of cytomegalovirus infections after renal and bone marrow transplantation (5). We have recently used foscarnet to treat a patient with the acquired immunodeficiency syndrome and cytomegalovirus retinitis.             A white heterosexual man aged 54 years...", "num_citations": "40\n", "authors": ["834"]}
{"title": "Temporal sequence associations for rare events\n", "abstract": " In many real world applications, systematic analysis of rare events, such as credit card frauds and adverse drug reactions, is very important. Their low occurrence rate in large databases often makes it difficult to identify the risk factors from straightforward application of associations and sequential pattern discovery. In this paper we introduce a heuristic to guide the search for interesting patterns associated with rare events from large temporal event sequences. Our approach combines association and sequential pattern discovery with a measure of risk borrowed from epidemiology to assess the interestingness of the discovered patterns. In the experiments, we successfully identify a known drug and several new drug combinations with high risk of adverse reactions. The approach is also applicable to other applications where rare events are of primary interest.", "num_citations": "39\n", "authors": ["834"]}
{"title": "A delivery framework for health data mining and analytics\n", "abstract": " The iHealth Explorer tool, developed by CSIRO and DoHA, delivers web services type data mining and analytic facilities over a web interface, providing desktop access to sophisticated analyses over very large data collections. The tool allows users to access large transactional datasets to create profiles of selected patients. The patients’ profiles, together with windowed event sequences data, can then be analyzed using a user chosen data mining tool. The results of the analysis can then be visualized using various forms of knowledge representation methods. Although the initial implementation of the tool is focused on its application in adverse drug reaction exploration, this tool and the embedded data mining tools can be used in broad areas of health data analysis.", "num_citations": "36\n", "authors": ["834"]}
{"title": "Differentiating between monozygotic twins through DNA methylation-specific high-resolution melt curve analysis\n", "abstract": " Although short tandem repeat profiling is extremely powerful in identifying individuals from crime scene stains, it is unable to differentiate between monozygotic (MZ) twins. Efforts to address this include mutation analysis through whole genome sequencing and through DNA methylation studies. Methylation of DNA is affected by environmental factors; thus, as MZ twins age, their DNA methylation patterns change. This can be characterized by bisulfite treatment followed by pyrosequencing. However, this can be time-consuming and expensive; thus, it is unlikely to be widely used by investigators. If the sequences are different, then in theory the melting temperature should be different. Thus, the aim of this study was to assess whether high-resolution melt curve analysis can be used to differentiate between MZ twins. Five sets of MZ twins provided buccal swabs that underwent extraction, quantification, bisulfite treatment …", "num_citations": "34\n", "authors": ["834"]}
{"title": "Neighborhood density method for selecting initial cluster centers in K-means clustering\n", "abstract": " This paper presents a new method for effectively selecting initial cluster centers in k-means clustering. This method identifies the high density neighborhoods from the data first and then selects the central points of the neighborhoods as initial centers. The recently published Neighborhood-Based Clustering (NBC) algorithm is used to search for high density neighborhoods. The new clustering algorithm NK-means integrates NBC into the k-means clustering process to improve the performance of the k-means algorithm while preserving the k-means efficiency. NBC is enhanced with a new cell-based neighborhood search method to accelerate the search for initial cluster centers. A merging method is employed to filter out insignificant initial centers to avoid too many clusters being generated. Experimental results on synthetic data sets have shown significant improvements in clustering accuracy in comparison …", "num_citations": "31\n", "authors": ["834"]}
{"title": "Transitions between bound states for axially channeled MeV electrons\n", "abstract": " Photon lines emitted in the forward direction from 2.0–4.5 MeV electrons channeled along a <110> axis in a 3400 Å Si crystal have been measured and compared with calculations and with previous results from a 12 000 Å Si <111> crystal. Nearly all features agree with predictions based on an isolated string.", "num_citations": "30\n", "authors": ["834"]}
{"title": "Photonic crystal fibre as an optofluidic reactor for the measurement of photochemical kinetics with sub-picomole sensitivity\n", "abstract": " Photonic crystal fibre constitutes an optofluidic system in which light can be efficiently coupled into a solution-phase sample, contained within the hollow core of the fibre, over long path-lengths. This provides an ideal arrangement for the highly sensitive monitoring of photochemical reactions by absorption spectroscopy. We report here the use of UV/vis spectroscopy to measure the kinetics of the photochemical and thermal cis–trans isomerisation of sub-picomole samples of two azo dyes within the 19-μm diameter core of a photonic crystal fibre, over a path length of 30 cm. Photoisomerisation quantum yields are the first reported for “push–pull” azobenzenes in solution at room temperature; such measurements are challenging because of the fast thermal isomerisation process. Rate constants obtained for thermal isomerisation are in excellent agreement with those established previously in conventional cuvette …", "num_citations": "29\n", "authors": ["834"]}
{"title": "Identification and characterization of multiple species of vancomycin-resistant enterococci, including an evaluation of Vitek software version 7.1\n", "abstract": " A total of 374 clinical isolates of Enterococcus spp. were characterized to determine the species distribution and vancomycin resistance. The ability of the Vitek system (bioMerieux Inc, Hazelwood, St. Louis, Mo.) to identify enterococci to the species level and to recognize vancomycin resistance by using computer software version 7.1 was evaluated. Conventional methods were used for identification and agar dilution was used for susceptibility testing, the results of which were as follows (presented as number of vancomycin-resistant isolates/number of members of that species identified): 219/234 E. faecium, 9/112 E. faecalis, 2/3 E. mundtii, 0/1 E. durans, 0/1 E. hirae, 0/1 E. raffinosis, and 0/1 E. avium. Ten enterococci were in the vancomycin-intermediate category (six E. gallinarum, two E. casseliflavus, and one each of E. faecium and E. faecalis). The Vitek GPI card correctly identified 98% of E. faecium isolates, 99 …", "num_citations": "29\n", "authors": ["834"]}
{"title": "Feature selection for temporal health records\n", "abstract": " In this paper we consider three alternative feature vector representations of patient health records. The longitudinal (temporal), irregular character of patient episode history, an integral part of a health record, provides some challenges in applying data mining techniques. The present application involves episode history of monitoring services for elderly patients with diabetes. The application task was to examine patterns of monitoring services for patients. This was approached by clustering patients into groups receiving similar patterns of care and visualising the features devised to highlight interesting patterns of care.", "num_citations": "28\n", "authors": ["834"]}
{"title": "Visualizing temporal cluster changes using relative density self-organizing maps\n", "abstract": " We introduce a Self-Organizing Map (SOM)-based visualization method that compares cluster structures in temporal datasets using Relative Density SOM (ReDSOM) visualization. ReDSOM visualizations combined with distance matrix-based visualizations and cluster color linking, is capable of visually identifying emerging clusters, disappearing clusters, split clusters, merged clusters, enlarging clusters, contracting clusters, the shifting of cluster centroids, and changes in cluster density. As an example, when a region in a SOM becomes significantly more dense compared to an earlier SOM, and is well separated from other regions, then the new region can be said to represent a new cluster. The capabilities of ReDSOM are demonstrated using synthetic datasets, as well as real-life datasets from the World Bank and the Australian Taxation Office. The results on the real-life datasets demonstrate that changes …", "num_citations": "25\n", "authors": ["834"]}
{"title": "A case study in knowledge acquisition for insurance risk assessment using a KDD methodology\n", "abstract": " We describe some initial experiences in dealing with the task of acquiring knowledge where a very large collection of case histories is available. A Knowledge Discovery in Databases (KDD) approach is taken. KDD is the process of extracting novel information and knowledge from large databases, consisting of many interacting stages performing specific data manipulation and transformation operations with an information flow from one stage onto the next (and usually with feedback into previous stages). We characterise our experiences of this process for the task of acquiring knowledge for the domain of motor vehicle insurance premium setting for NRMA Insurance Limited.", "num_citations": "25\n", "authors": ["834"]}
{"title": "Hydrocortisone induces changes in gene expression and differentiation in immature human enterocytes\n", "abstract": " It is known that functional maturation of the small intestine occurring during the weaning period is facilitated by glucocorticoids (such as hydrocortisone, HC), including an increased expression of digestive hydrolases. However, the molecular mechanisms are not well understood, particularly in the human gut. Here we report a microarray analysis of HC-induced changes in gene expression in H4 cells (a well-characterized human fetal small intestinal epithelial cell line). This study identified a large number of HC-regulated genes, some involved in metabolism, cell cycle regulation, cell-cell or cell-extracellular matrix communication. HC also regulates the expression of genes important for cell maturation such as development of cell polarity, tight junction formation, and interactions with extracellular matrices. Using human small intestinal xenografts, we also show that HC can regulate the expression of genes important …", "num_citations": "23\n", "authors": ["834"]}
{"title": "Langmuir probe investigation of surface contamination effects on metals during femtosecond laser ablation\n", "abstract": " Characterisation of the plasma plume induced by femtosecond laser–metal interactions has been carried out using a Langmuir probe. A double peak distribution of ablated ions and electrons has been recorded during time of flight (TOF) experiments for three metals studied (Ag, Cu and Ni). The first peak which occurs earliest in time is attributed to a surface layer of contaminants on the metal surface as it is shown to disappear after several laser shots. The re-growth of this peak, thought to be due to a recontamination process on the surface of the metal, is the subject of this paper. Two re-contamination mechanisms were considered; adsorption of contaminants from the ambient gas, and surface diffusion effects from the surrounding contaminants. Re-contamination rates for Ag, Cu and Ni were studied under two distinct gas pressures to investigate the contamination effects from the ambient. Effects arising from …", "num_citations": "23\n", "authors": ["834"]}
{"title": "Association rule discovery with unbalanced class distributions\n", "abstract": " There are many methods for finding association rules in very large data. However it is well known that most general association rule discovery methods find too many rules, many of which are uninteresting rules. Furthermore, the performances of many such algorithms deteriorate when the minimum support is low. They fail to find many interesting rules even when support is low, particularly in the case of significantly unbalanced classes. In this paper we present an algorithm which finds association rules based on a set of new interestingness criteria. The algorithm is applied to a real-world health data set and successfully identifies groups of patients with high risk of adverse reaction to certain drugs. A statistically guided method of selecting appropriate features has also been developed. Initial results have shown that the proposed algorithm can find interesting patterns from data sets with unbalanced class …", "num_citations": "23\n", "authors": ["834"]}
{"title": "Representing association classification rules mined from health data\n", "abstract": " An association classification algorithm has been developed to explore adverse drug reactions in a large medical transaction dataset with unbalanced classes. Rules discovered can be used to alert medical practitioners when prescribing drugs, to certain categories of patients, to potential adverse effects. We assess the rules using survival charts and propose two kinds of probability trees to present them. Both of them represent the risk of given adverse drug reaction for certain categories of patients in terms of risk ratios, which are familiar to medical practitioners. The first approach shows risk ratios when all rule conditions apply. The second presents the risk associated with a single risk factor with other parts of the rule identifying the cohort of the patient subpopulation. Thus, the probability trees can present clearly the risk of specific adverse drug reactions to prescribers.", "num_citations": "22\n", "authors": ["834"]}
{"title": "Considering the effect of stem-loop reverse transcription and real-time PCR analysis of blood and saliva specific microRNA markers upon mixed body fluid stains\n", "abstract": " Forensic RNA analysis is gathering pace with reports of messenger RNA analysis being used in case work, and with microRNA being increasingly researched. Such techniques address a fundamental issue in body fluid identification, namely increased specificity over existing chemical tests, and the incorporation of additional body fluids such as vaginal material. The use of RNA analysis will be of particular value to sex offences, where there can be a mixture of multiple body fluids from different people. The aim of this study was to determine whether microRNA based body fluid identification tests can be applied to mixed body fluid samples.Blood and saliva were acquired from volunteers and underwent total RNA extraction. Mixed samples were prepared using a range of ratios from 1:1 to 10:1. Each mixed sample then underwent a blood–saliva differentiation test developed in-house, which includes stem-loop …", "num_citations": "21\n", "authors": ["834"]}
{"title": "Molecular dynamics and relaxation phenomena in glasses: proceedings of a workshop held at the Zentrum für interdisziplinäre Forschung, Universität Bielefeld, Bielefeld, FRG …\n", "abstract": " This book presents the proceedings of a workshop on glass-forming liquids held at the University of Bielefeld in 1985. The aim of the meeting was to seek unifying interpretations which may apply to all glass-forming materials like inorganic and polymer glasses. Also, new data was presented and modern interpretations were applied which represent the state-of-the-art knowledge about the unusual physical properties of these chemically-diverse glass-forming materials. The book should be of interest to specialists in the subject, to polymer scientists, glass technologists and materials scientists, but also-and most importantly-to researchers and teachers who wish to become informed on some of the most recent fundamental research in the fields.", "num_citations": "20\n", "authors": ["834"]}
{"title": "Sexual intimacy and gender identity ‘fraud’: Reframing the legal and ethical debate\n", "abstract": " This book is a legal and political intervention into a contemporary debate concerning the appropriateness of sexual offence prosecutions brought against young gender non-conforming people for so-called ‘gender identity fraud'. It comes down squarely against prosecution. To that end, it offers a series of principled objections based both on liberal principles, and arguments derived from queer and feminist theories.", "num_citations": "19\n", "authors": ["834"]}
{"title": "Descriptive and predictive analytics\n", "abstract": " Modelling is what we most often think of when we think of data mining. Modelling is the process of taking some data (usually) and building a simplified description of the processes that might have generated it. The description is often a computer program or mathematical formula. A model captures the knowledge exhibited by the data and encodes it in some language. Often the aim is to address a specific problem through modelling the world in some form and then use the model to develop a better understanding of the world.", "num_citations": "19\n", "authors": ["834"]}
{"title": "Data mining desktop survival guide\n", "abstract": " For this example we will use the survey dataset (see See Section 14.3. 4). This dataset is a reasonable size and has some common real world issues. The vignette for arules, by the authors of the package (Hahsler et al., 2005), also use a similar dataset, available within the package through data (Survey). We borrow some of their data transformations here.", "num_citations": "19\n", "authors": ["834"]}
{"title": "Inducing and combining decision structures for expert systems\n", "abstract": " Decisions are central to our daily existence. Every activity requires us to make decisions, many subconsciously. Knowledge, de ned as an acquaintance with facts, truths, or principles (Delbridge, 1982), is the key to correct decision making. Its representation and use by machine has been a major goal throughout the history of computing machinery. Research in the discipline of Arti cial Intelligence (AI) explicitly investigates ways in which knowledge can be e ectively represented and employed by computers in order to make intelligent and human-appreciable decisions. Knowledge-based expert systems (KBESs) are a family of successful, practical systems arising from AI research. These systems structure knowledge (as decision structures) in such a way that it can be e ciently employed to make decisions, and yet is easily understandable by humans.Signi cant research problems relating to KBESs remain. One such problem area falls under the general categories of machine learning and knowledge acquisition. It is generally agreed that learning is one of the most important components of intelligence. The research reported here focuses upon the acquisition of decision structures for use by KBESs. This thesis takes a well-established, practical tool for knowledge acquisition as its basis. Experiments are described, pinpointing some of the limitations of the tool. A new approach is then developed which builds upon this tool, introducing the idea of combining decision structures.", "num_citations": "19\n", "authors": ["834"]}
{"title": "The black disc jockey as a cultural hero\n", "abstract": " The radio disc jockey wakes us in the morning, puts us to sleep at night, and in between, his time, weather and music announcements take us through the day. But the black disc jockey has been more than an announcer. He has transcended his job as a radio station employee and becomes in many cases, a cultural hero, an individual admired and respected for his work in the black community, his concern for his fellow man, and his ability to effectuate changes in society.This study compares early black disc jockeys (1940-50) with those of a later period (1960-80) to illustrate the various roles each group has played in the community. The earlier group was characterized by the music its members played (mostly jazz, blues, and later rhythm and blues), their language patterns, and their personalities. Their styles developed from the clash of urban and rural cultures that helped define their lives. These early black disc …", "num_citations": "19\n", "authors": ["834"]}
{"title": "Experimental measurements of the collisional absorption of XUV radiation in warm dense aluminium\n", "abstract": " The collisional (or free-free) absorption of soft x rays in warm dense aluminium remains an unsolved problem. Competing descriptions of the process exist, two of which we compare to our experimental data here. One of these is based on a weak scattering model, another uses a corrected classical approach. These two models show distinctly different behaviors with temperature. Here we describe experimental evidence for the absorption of 26-eV photons in solid density warm aluminium (T e≈ 1 eV). Radiative x-ray heating from palladium-coated CH foils was used to create the warm dense aluminium samples and a laser-driven high-harmonic beam from an argon gas jet provided the probe. The results indicate little or no change in absorption upon heating. This behavior is in agreement with the prediction of the corrected classical approach, although there is not agreement in absolute absorption value. Verifying …", "num_citations": "18\n", "authors": ["834"]}
{"title": "Directional ion emission from thin films under femtosecond laser irradiation\n", "abstract": " Thin films of nickel have been irradiated using femtosecond laser pulses in vacuum. Subsequent emission of plasma ions is diagnosed using an ion probe. Angular distributions of the emitted ions are presented for a range of target film thicknesses. Data are compared to the Anisimov model of plasma expansion [S. I. Anisimov, D. Bauerle, and B. S. Luk’yanchuk, Phys. Rev. B 48, 12076 (1993)]. The tendency of the ions to be ejected at small angles to the normal of the target surface is explained in terms of the initial conditions of the plume. Results are explained in terms of the initial shape and adiabatic index of the plasma.", "num_citations": "17\n", "authors": ["834"]}
{"title": "International law and constitutional interpretation\n", "abstract": " Open Research: International Law and Constitutional Interpretation Skip navigation The Australian National University The Australian National University Open Research Library Search query Search Skip navigation Home About Contribute Publishing Policy Copyright Contact Statistics My Open Research close My Open Research Your list of unfinished submissions or submissions in the workflow. Edit Profile Receive email updates Statistics Login Menu Search Search query search scope Search Home About Contribute Publishing Policy Copyright Contact Search ANU web, staff & maps Search current site content Home » ANU Research » ANU Scholarly Output » ANU Research Publications » International Law and Constitutional Interpretation International Law and Constitutional Interpretation Statistics Export Reference to BibTeX Export Reference to EndNote XML Simpson, Amelia ; Williams, G J Collections ANU …", "num_citations": "17\n", "authors": ["834"]}
{"title": "WSRF: an R package for classification with scalable weighted subspace random forests\n", "abstract": " We describe a parallel implementation in R of the weighted subspace random forest algorithm (Xu, Huang, Williams, Wang, and Ye 2012) available as the wsrf package. A novel variable weighting method is used for variable subspace selection in place of the traditional approach of random variable sampling. This new approach is particularly useful in building models for high dimensional data–often consisting of thousands of variables. Parallel computation is used to take advantage of multi-core machines and clusters of machines to build random forest models from high dimensional data in considerably shorter times. A series of experiments presented in this paper demonstrates that wsrf is faster than existing packages whilst retaining and often improving on the classification performance, particularly for high dimensional data.", "num_citations": "16\n", "authors": ["834"]}
{"title": "A collaborative exercise on DNA methylation based body fluid typing\n", "abstract": " A collaborative exercise on DNA methylation based body fluid identification was conducted by seven laboratories. For this project, a multiplex methylation SNaPshot reaction composed of seven CpG markers was used for the identification of four body fluids, including blood, saliva, semen, and vaginal fluid. A total of 30 specimens were prepared and distributed to participating laboratories after thorough testing. The required experiments included four increasingly complex tasks: (1) CE of a purified single‐base extension reaction product, (2) multiplex PCR and multiplex single‐base extension reaction of bisulfite‐modified DNA, (3) bisulfite conversion of genomic DNA, and (4) extraction of genomic DNA from body fluid samples. In tasks 2, 3 and 4, one or more mixtures were analyzed, and specimens containing both known and unknown body fluid sources were used. Six of the laboratories generated consistent body …", "num_citations": "16\n", "authors": ["834"]}
{"title": "Ensemble clustering of high dimensional data with fastmap projection\n", "abstract": " In this paper, we propose an ensemble clustering method for high dimensional data which uses FastMap projection to generate subspace component data sets. In comparison with popular random sampling and random projection, FastMap projection preserves the clustering structure of the original data in the component data sets so that the performance of ensemble clustering is improved significantly. We present two methods to measure preservation of clustering structure of generated component data sets. The comparison results have shown that FastMap preserved the clustering structure better than random sampling and random projection. Experiments on three real data sets were conducted with three data generation methods and three consensus functions. The results have shown that the ensemble clustering with FastMap projection outperformed the ensemble clusterings with random sampling …", "num_citations": "15\n", "authors": ["834"]}
{"title": "DDDM2007: Domain driven data mining\n", "abstract": " Real-world data mining generally must consider and involve domain and business oriented factors such as human knowledge, constraints and business expectations. This encourages the development of a domain driven methodology to strengthen data-centered pattern mining. This report presents a review of the ACM SIGKDD Workshop on Domain Driven Data Mining (DDDM2007), held in conjunction with the Thirteenth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD07), which was held in San Jose, USA on 12 August, 2007. The aims and objectives of this workshop were to provide a premier forum for sharing innovative findings, knowledge, insights, experiences and lessons in tackling challenges met in domain driven, actionable knowledge discovery in the real world.", "num_citations": "15\n", "authors": ["834"]}
{"title": "Random forests\n", "abstract": " Building a single decision tree provides a simple model of the world, but it is often too simple or too specific. Over many years of experience in data mining, it has become clear that many models working together are better than one model doing it all. We have now become familiar with the idea of combining multiple models (like decision trees) into a single ensemble of models (to build a forest of trees).", "num_citations": "14\n", "authors": ["834"]}
{"title": "ReDSOM: relative density visualization of temporal changes in cluster structures using self-organizing maps\n", "abstract": " We introduce a self-organizing map (SOM) based visualization method that compares cluster structures in temporal datasets using relative density SOM (ReDSOM) visualization. Our method, combined with a distance matrix-based visualization, is capable of visually identifying emerging clusters, disappearing clusters, enlarging clusters, contracting clusters, the shifting of cluster centroids, and changes in cluster density. For example, when a region in a SOM becomes significantly more dense compared to an earlier SOM, and well separated from other regions, then the new region can be said to represent a new cluster. The capabilities of ReDSOM are demonstrated using synthetic datasets, as well as real-life datasets from the World Bank and the Australian Taxation Office. The results on the real-life datasets demonstrate that changes identified interactively can be related to actual changes. The identification of such …", "num_citations": "14\n", "authors": ["834"]}
{"title": "Exploratory multilevel hot spot analysis: Australian taxation office case study\n", "abstract": " Population based real-life datasets often contain smaller clusters of unusual sub-populations. While these clusters, called'hot spots', are small and sparse, they are usually of special interest to an analyst. In this paper we introduce a visual drill-down Self-Organizing Map (SOM)-based approach to explore such hot spots characteristics in real-life datasets. Iterative clustering algorithms (such as k-means) and SOM are not designed to show these small and sparse clusters in detail. The feasibility of our approach is demonstrated using a large real life dataset from the Australian Taxation Office.", "num_citations": "14\n", "authors": ["834"]}
{"title": "Spectrofluorimetry with attomole sensitivity in photonic crystal fibres\n", "abstract": " We report the use of photonic crystal fibres (PCF) as spectrofluorimetric systems in which sample solutions are excited within the microstructure of the fibre. The use of intra-fibre excitation has several advantages that combine to enable highly sensitive measurements of fluorescence spectra and lifetimes: long path-lengths are achieved by the efficient guidance of the fundamental mode; sample volumes contained within the micron-scale structure are very small, only a few nanolitres per cm of path; collection and guidance of the emitted fluorescence is efficient and the fluorescence lifetime is unperturbed. Fluorophores in bulk solution can be studied in hollow core PCF, whereas the use of PCF with a suspended, solid core enables selective excitation of molecules in close proximity to the silica surface, through interaction with the evanescent field. We demonstrate the measurement of fluorescence spectra and …", "num_citations": "13\n", "authors": ["834"]}
{"title": "GEM—A micro-computer based expert system for geographic domains\n", "abstract": " GEM—A micro-computer based expert system for geographic domains | 6th Internation Workshop Vol. 1 on Expert Systems & Their Applications ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedings6th Internation Workshop Vol. on Expert Systems & Their ApplicationsGEM—A micro-computer based expert system for geographic domains ARTICLE GEM—A micro-computer based expert system for geographic domains Share on Authors: Graham J Williams profile image GJ Williams View Profile , PM Nanninga profile image PM Nanninga View Profile , JR Davis profile image JR Davis View Profile Authors Info & Affiliations …", "num_citations": "13\n", "authors": ["834"]}
{"title": "Some experiments in decision tree induction.\n", "abstract": " This paper presents a number of experiments dealing with various aspects of the ID3 decision tree induction algorithm. The aspects dealt with include the choice of attribute to split on, exception split pruning, and combining decision trees.", "num_citations": "13\n", "authors": ["834"]}
{"title": "Specific identification of hemoglobin and myoglobin in renal tubular casts by the fluorescent antibody technic on fixed embedded tissues\n", "abstract": " Hemoglobin and myoglobin have been identified in formalin-fixed paraffin-embedded sections of human autopsy material with the indirect fluorescent antibody technic. The sensitivity and specificity observed were comparable to those reported by other investigators who used fresh-frozen sections. When this approach was applied to archival autopsy tissue, it was possible to identify some pigmented renal tubular casts specifically as myoglobin or hemoglobin and to separate them from other pigmented casts such as bile or melanin. The data suggest that the hemeproteins, as they pass along the nephron, are progressively denatured, and that their reactivities with specific antisera, iron stains, and peroxidase substrates are altered. Intact hemeprotein molecules react with specific antibody and show peroxidase activity, but the iron is not demonstrable by traditional methods. In the proximal tubules, after filtration …", "num_citations": "13\n", "authors": ["834"]}
{"title": "Extensions to quantile regression forests for very high-dimensional data\n", "abstract": " This paper describes new extensions to the state-of-the-art regression random forests Quantile Regression Forests (QRF) for applications to high-dimensional data with thousands of features. We propose a new subspace sampling method that randomly samples a subset of features from two separate feature sets, one containing important features and the other one containing less important features. The two feature sets partition the input data based on the importance measures of features. The partition is generated by using feature permutation to produce raw importance feature scores first and then applying p-value assessment to separate important features from the less important ones. The new subspace sampling method enables to generate trees from bagged sample data with smaller regression errors. For point regression, we choose the prediction value of Y from the range between two quantiles Q …", "num_citations": "12\n", "authors": ["834"]}
{"title": "Embolic protection system and method for use in an aortic arch\n", "abstract": " A device temporarily positionable within an aortic arch for deflecting embolic particles released during a therapeutic or diagnostic procedure comprises a resilient frame defining an opening and a barrier disposed in the opening. The barrier has a plurality of openings, which may be pores, proportioned to allow passage of blood therethrough but to prevent passage of embolic particles. The barrier has a concave shape having a convex surface positionable in contact with a wall of an aorta to cover at least a brachiocephalic ostium. The frame may include an upstream end including a pair of lobes and an apex between the lobes, and has a generally tapered downstream end.", "num_citations": "12\n", "authors": ["834"]}
{"title": "Characterisation of body fluid specific microRNA markers by capillary electrophoresis\n", "abstract": " The characterisation of RNA molecules for the purpose of body fluid identification is currently a major field in forensic genetics; with a great deal of effort going towards the analysis of messenger RNA (mRNA). There is also some effort with targeting microRNA (miRNA) which is a more stable RNA molecule than mRNA; due to its short size and role in RNA interference. Most research into forensic miRNA analysis is based around quantitative PCR (qPCR). No substantial research has yet been carried out on capillary electrophoretic (CE) analysis of miRNA. Thus the aim of this study was to explore the viability of CE of miRNA. Samples of blood, saliva, semen, and vaginal material were obtained from a number of volunteers with their informed consent. All samples then underwent standard DNA extraction using QIAAmp DNA mini kit. cDNA synthesis was carried out using stem-loop reverse transcription and …", "num_citations": "12\n", "authors": ["834"]}
{"title": "A Heuristic Lazy Bayesian Rule Algorithm.\n", "abstract": " LBR has demonstrated outstanding classification accuracy. However, it has high computational overheads when large numbers of instances are classified from a single training set. We compare LBR and the tree-augmented Bayesian classifier, and present a new heuristic LBR classifier that combines elements of the two. It requires less computation than LBR, but demonstrates similar prediction accuracy.", "num_citations": "12\n", "authors": ["834"]}
{"title": "Temporal data mining using multilevel-local polynomial models\n", "abstract": " This study proposes a data mining framework to discover qualitative and quantitative patterns in discrete-valued time series(DTS). In our method, there are three levels for mining temporal patterns. At the first level, a structural method based on distance measures through polynomial modelling is employed to find pattern structures; the second level performs a value-based search using local polynomial analysis; and then the third level based on multilevel-local polynomial models(MLPMs), finds global patterns from a DTS set. We demonstrate our method on the analysis of “Exchange Rates Patterns” between the U.S. dollar and Australian dollar.", "num_citations": "12\n", "authors": ["834"]}
{"title": "Templates for spatial reasoning in responsive geographical information systems\n", "abstract": " Responsive geographical information systems (GIS) address the needs of the decision-maker working in a spatially oriented environment where data is regularly updated, where the data is often voluminous, incomplete, and noisy, and where timely decisions must be made. Such environments stretch the capabilities of traditional GIS. A responsive GIS must play a more active role in the support of the decision-maker. This paper introduces the concept of a responsive GIS and demonstrates the integration of artificial intelligence techniques to provide such active support. Expert knowledge, represented as Templates, can have both spatial and temporal components, and remains within the GIS framework rather than providing separate, and often disjoint, GIS and Expert System modules.", "num_citations": "12\n", "authors": ["834"]}
{"title": "Successive bacterial colonisation of pork and its implications for forensic investigations\n", "abstract": " AimsBacteria are considered one of the major driving forces of the mammalian decomposition process and have only recently been recognised as forensic tools. At this point, little is known about their potential use as ‘post-mortem clocks’. This study aimed to establish the proof of concept for using bacterial identification as post-mortem interval (PMI) indicators, using a multi-omics approach.Methods and resultsPieces of pork were placed in the University’s outdoor facility and surface swabs were taken at regular intervals up to 60 days. Terminal restriction fragment length polymorphism (T-RFLP) of the 16S rDNA was used to identify bacterial taxa. It succeeded in detecting two out of three key contributors involved in decomposition and represents the first study to reveal Vibrionaceae as abundant on decomposing pork. However, a high fraction of present bacterial taxa could not be identified by T-RFLP. Proteomic …", "num_citations": "11\n", "authors": ["834"]}
{"title": "Hybrid weighted random forests for classifying very high-dimensional data\n", "abstract": " Random forests are a popular classification method based on an ensemble of a single type of decision trees from subspaces of data. In the literature, there are many different types of decision tree algorithms, including C4. 5, CART, and CHAID. Each type of decision tree algorithm may capture different information and structure. This paper proposes a hybrid weighted random forest algorithm, simultaneously using a feature weighting method and a hybrid forest method to classify very high dimensional data. The hybrid weighted random forest algorithm can effectively reduce subspace size and improve classification performance without increasing the error bound. We conduct a series of experiments on eight high dimensional datasets to compare our method with traditional random forest methods and other classification methods. The results show that our method consistently outperforms these traditional methods.", "num_citations": "11\n", "authors": ["834"]}
{"title": "Support vector machines\n", "abstract": " A support vector machine (SVM) searches for so-called support vectors which are observations that are found to lie at the edge of an area in space which presents a boundary between one of these classes of observations (e.g., the squares) and another class of observations (e.g., the circles). In the terminology of SVM we talk about the space between these two regions as the margin between the classes.", "num_citations": "11\n", "authors": ["834"]}
{"title": "Multilevels hidden markov models for temporal data mining\n", "abstract": " This paper describes new temporal data mining techniques for extracting information from temporal health records consisting of time series of diabetic patients’ treatments. In this new method, there are three steps for analyzing patterns from a longitudinal data set. The first step, a structural-based pattern search, to find qualitative patterns (or, structural patterns). The second step performs a value-based search to find quantitative patterns. In the third step we combine results from the first two steps to form new model. The hidden Markov model has the expressive power of both qualitative analysis and data quantitative analysis. The global patterns can therefore be identified from a DTS set.", "num_citations": "11\n", "authors": ["834"]}
{"title": "Expert system development requires knowledge engineering\n", "abstract": " Expert system development requires knowledge engineering | Computer Design ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Computer Design Periodical Home Latest Issue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsComputer DesignVol. , No. Expert system development requires knowledge engineering article Expert system development requires knowledge engineering Share on Authors: P Haley profile image P Haley View Profile , C Williams profile image C Williams View Profile Authors Info & Affiliations Publication: Computer DesignFebruary 1986 0citation 0 Downloads Metrics Total Citations0 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get Citation …", "num_citations": "11\n", "authors": ["834"]}
{"title": "Stratified over-sampling bagging method for random forests on imbalanced data\n", "abstract": " Imbalanced data presents a big challenge to random forests (RF). Over-sampling is a commonly used sampling method for imbalanced data, which increases the number of instances of minority class to balance the class distribution. However, such method often produces sample data sets that are highly correlated if we only sample more minority class instances, thus reducing the generalizability of RF. To solve this problem, we propose a stratified over-sampling (SOB) method to generate both balanced and diverse training data sets for RF. We first cluster the training data set multiple times to produce multiple clustering results. The small individual clusters are grouped according to their entropies. Then we sample a set of training data sets from the groups of clusters using stratified sampling method. Finally, these training data sets are used to train RF. The data sets sampled with SOB are guaranteed to be …", "num_citations": "10\n", "authors": ["834"]}
{"title": "Evaluation of low trace DNA recovery techniques from ridged surfaces\n", "abstract": " The first step in the DNA profiling process is the recovery of DNA from the crime scene or item. Such surfaces can be varying with absorbent and non-absorbent surfaces. Ridged surfaces, such as those encountered on bottle-tops or firearms, are also common. Although low trace DNA or “touch DNA” is problematic in forensic casework, ridged surfaces should be a more effective surface for the recovery of such DNA due their abrasive nature. The aim of this study was to evaluate six recovery techniques; single wet swab, dry-wet double swab, wet-dry double swab, flocked swab, PCR square, and tape lifts. 36 falcon tubes with screw top lids were sterilised before DNA was deposited on the screw-top lids. Each of the recovery techniques were then utilised on 6 screw-top lids. All recovery media then underwent standard DNA extraction prior to DNA quantification by UV/Vis spectroscopy and quantitative PCR. The data indicated that the tape lifts recovered significantly more DNA from the ridged surface than the other techniques. There was no significant difference between the remaining 5 techniques, although on average, flocked swabs recovered the least amount. This suggested that the success in recovery of DNA is not down to the particular technique used, but down to the competence of the individual examiner and the amount of DNA deposited onto the surface.", "num_citations": "10\n", "authors": ["834"]}
{"title": "Estimating episodes of care using linked medical claims data\n", "abstract": " Australia has extensive administrative health data collected by Commonwealth and state agencies. Using a unique cleaned and linked administrative health dataset we address the problem of empirically defining episodes of care. An episode of care is a time interval containing medical services relating to a particular medical situation. In this paper the medical situation is a hospital admission. The medical services of interest are pathology tests,diagnostic imaging and non-invasive investigative procedures performed before or after the hospital admission, but ‘associated’ with the hospital admission. The task can be viewed as detecting a signal in a time series relating to a hospital admission,distinct from the background noise of on-going medical care. Our approach uses an ensemble (panel of experts) paradigm where we implement multiple agents (alternative predictive models) to separately estimate …", "num_citations": "10\n", "authors": ["834"]}
{"title": "Temporal data mining using Hidden Markov-local polynomial models\n", "abstract": " This study proposes a data mining framework to discover qualitative and quantitative patterns in discrete-valued time series (DTS). In our method, there are three levels for mining similarity and periodicity patterns. At the first level, a structural-based search based on distance measure models is employed to find pattern structures; the second level performs a value-based search on the discovered patterns using local polynomial analysis; and then the third level based on hidden Markov-local polynomial models (HMLPMs), finds global patterns from a DTS set.We demonstrate our method on the analysis of“Exchange Rates Patterns” between the U.S. dollar and the United Kingdom Pound.", "num_citations": "10\n", "authors": ["834"]}
{"title": "Characterising the fluctuation of microRNA expression throughout a full menstrual cycle\n", "abstract": " When processing a crime scene, obtaining a DNA profile that can identify an individual is extremely important. However, the identification of the body fluid that the sample was obtained from could provide key information of the events that occurred. microRNA (miRNA) expression analysis is a technique that has the potential to differentiate body fluids. The presence and expression of body fluid specific miRNA would provide a fast and effective tool for progressing crime scene investigation, especially alleged sexual assault cases. Forensic case work lacks methods for identifying vaginal material, venous blood, menstrual blood and azoospermatozoic seminal fluid within samples. A large screening study followed by a 31 day study on five female volunteers was performed utilising RT-qPCR on a large panel of body fluid markers. Screening showed a selection of markers were suitable to differentiate each body fluid, in …", "num_citations": "9\n", "authors": ["834"]}
{"title": "Decision trees\n", "abstract": " Decision trees (also referred to as classification and regression trees) are the traditional building blocks of data mining and the classic machine learning algorithm. Since their development in the 1980s, decision trees have been the most widely deployed machine-learning based data mining model builder.", "num_citations": "9\n", "authors": ["834"]}
{"title": "Mining Temporal Patterns from Health Care Data*\n", "abstract": " This paper describes temporal data mining techniques for extracting information from temporal health records consisting of a time series of elderly diabetic patients’ tests. We propose a data mining procedure to analyse these time sequences in three steps to identify patterns from any longitudinal data set. The first step is a structure-based search using wavelets to find pattern structures. The second step employs a value-based search over the discovered patterns using the statistical distribution of data values. The third step combines the results from the first two steps to form a hybrid model. The hybrid model has the expressive power of both wavelet analysis and the statistical distribution of the values. Global patterns are therefore identified.", "num_citations": "9\n", "authors": ["834"]}
{"title": "The integrated delivery of large-scale data mining: The ACSys data mining project\n", "abstract": " Data Mining draws on many technologies to deliver novel and actionable discoveries from very large collections of data. The Australian Government’s Cooperative Research Centre for Advanced Computational Systems (ACSys) is a link between industry and research focusing on the deployment of high performance computers for data mining. We present an overview of the work of the ACSys Data Mining projects where the use of large-scale, high performance computers plays a key role. We highlight the use of large-scale computing within three complimentary areas: the development of parallel algorithms for data analysis, the deployment of virtual environments for data mining, and issues in data management for data mining. We also introduce the Data Miner’s Arcade which provides simple abstractions to integrate these components providing high performance data access for a variety of data mining …", "num_citations": "9\n", "authors": ["834"]}
{"title": "Data mining of administrative claims data for pathology services\n", "abstract": " Australia has a universal health insurance scheme called Medicare. Medicare payments for pathology services generate voluminous transaction data on patients, doctors and pathology laboratories. The Health insurance Commission (HIC) currently uses predictive models to monitor compliance with regulatory requirements. The HIC commissioned a project to investigate the generation of new features from the data. These features were summarised, visualised and used as inputs for clustering and outlier detection methods. Some initial interpretations and insights into the pathology service industry are discussed. Further work is required for feature selection, training of predictive models with the new features and the evaluation of performance against the currently deployed models.", "num_citations": "9\n", "authors": ["834"]}
{"title": "Mining taxation data with parallel BMARS\n", "abstract": " A new parallel version of Friedman's Multivariate Adaptive Regression Splines (MARS) algorithm is discussed. By partitioning the data over the processors of a parallel computational system one achieves good parallel efficiency. Instead of using truncated power basis functions of the original MARS, the new method (BMARS) utilises B-sp!ines which improves numerical stability and reduces the computational cost of the procedure. In addition, the coefficients of the basis functions of a BMARS model provide quickly accessible information about the local behaviour of the function. The algorithm has a time complexity proportional to the number of data records. The method provides a new means for the detection of areas in the space of features which are characterised by the \"interesting\" patterns of response values. This is applied to searching for classes of incorrect tax returns using multiple predictor variables …", "num_citations": "9\n", "authors": ["834"]}
{"title": "Executive capacity as a scarce resource\n", "abstract": " For comments on a draft of this paper, as a result of which a number of revisions were made, I am indebted to C. V. Brown, JV Cable, Guy Hunter, Richard Jolly, JL Joy, C. T. Leys, W. A. P. Reilly, Andrew E. Rice, S. G. Sandford, Bernard Schaffer, Radha Sinha, TP Soper, and John White. Responsibility for the views expressed is, however, of course mine.", "num_citations": "9\n", "authors": ["834"]}
{"title": "Electron refluxing and -shell line emission from Ti foils irradiated with subpicosecond laser pulses at 527 nm\n", "abstract": " We present data on emission of K-shell radiation from Ti foils irradiated with subpicosecond pulses of second harmonic radiation (527 nm) from the TARANIS laser system at intensities of up to 10 18 W cm− 2. The data are used to demonstrate that a resonance absorption type mechanism is responsible for absorption of the laser light and to estimate fast electron temperatures of 30–60 keV that are in broad agreement with expectation from models of absorption for a steep density gradient. Data taken with resin-backed targets are used to demonstrate clear evidence of electron refluxing even at the modest fast electron temperatures inferred.", "num_citations": "8\n", "authors": ["834"]}
{"title": "Hybrid random forests: Advantages of mixed trees in classifying text data\n", "abstract": " Random forests are a popular classification method based on an ensemble of a single type of decision tree. In the literature, there are many different types of decision tree algorithms, including C4.5, CART and CHAID. Each type of decision tree algorithms may capture different information and structures. In this paper, we propose a novel random forest algorithm, called a hybrid random forest. We ensemble multiple types of decision trees into a random forest, and exploit diversity of the trees to enhance the resulting model. We conducted a series of experiments on six text classification datasets to compare our method with traditional random forest methods and some other text categorization methods. The results show that our method consistently outperforms these compared methods.", "num_citations": "8\n", "authors": ["834"]}
{"title": "Advances in Knowledge Discovery and Data Mining: 5th Pacific-Asia Conference, PAKDD 2001 Hong Kong, China, April 16-18, 2001. Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the 5th Pacific-Asia Conference on Knowledge Discovery and Data Mining, PAKDD 2001, held in Hong Kong, China in April 2001. The 38 revised full papers and 22 short papers presented were carefully reviewed and selected from a total of 152 submissions. The book offers topical sections on Web mining, text mining, applications and tools, concept hierarchies, feature selection, interestingness, sequence mining, spatial and temporal mining, association mining, classification and rule induction, clustering, and advanced topics and new methods.", "num_citations": "8\n", "authors": ["834"]}
{"title": "An empirical comparison of outlier detection methods\n", "abstract": " Four outlier detection methods are compared using both publicly available smaller statistical datasets and real-life Knowledge Discovery in Databases (KDD) datasets [1]. The smaller datasets provide insight (via visualisations) into the relative strengths and weaknesses of the compared methods. The real-life large datasets test scalability and practicality of application. We are unaware of previous comparisons of outlier detection methods for data mining applications. A methodology for comparing outlier detection methods is developed and we provide performance benchmarks against which new outlier detection methods can be assessed.(outlier detection, empirical comparison, clustering, neural network, mixture modelling)", "num_citations": "8\n", "authors": ["834"]}
{"title": "A data mining tutorial\n", "abstract": " A Data Mining Tutorial Page 1 A Data Mining Tutorial Presented at the Second IASTED International Conference on Parallel and Distributed Computing and Networks (PDCN’98) 14 December 1998 Graham Williams, Markus Hegland and Stephen Roberts Copyright c 1998 Page 2 ACSys ACSys Data Mining CRC for Advanced Computational Systems – ANU, CSIRO, (Digital), Fujitsu, Sun, SGI – Five programs: one is Data Mining – Aim to work with collaborators to solve real problems and feed research problems to the scientists – Brings together expertise in Machine Learning, Statistics, Numerical Algorithms, Databases, Virtual Environments 1 Page 3 ACSys About Us Graham Williams, Senior Research Scientist with CSIRO Machine Learning Stephen Roberts, Fellow with Computer Sciences Lab, ANU Numerical Methods Markus Hegland, Fellow with Computer Sciences Lab, ANU Numerical Methods 2 Page 4 …", "num_citations": "8\n", "authors": ["834"]}
{"title": "Apparatus and method for diverting embolic material\n", "abstract": " An embolic deflection device includes an anchor engageable with a lumen of a branch vessel extending from an aortic arch and a deflection device, the deflection device having a first end coupled to the anchor and an elongate member extending from the deflection device. A method of deflecting embolic material away from a branch vessel extending from an aortic arch includes providing a deflection device comprising a anchor and an elongate member extending from the anchor. The anchor is engaged with a lumen of the branch vessel and positioned such that the elongate member extends within the aortic arch in proximity to ostia of at least two branch vessels. Embolic material flowing from the ascending aorta to the aortic arch is diverted by the elongate member away from the branch vessels and into the descending aorta.", "num_citations": "7\n", "authors": ["834"]}
{"title": "Body fluid mixtures: Resolution using forensic microRNA analysis\n", "abstract": " Body fluid identification is a crucial aspect of forensic biology; particularly in sexual assaults which is usually characterised as a mixture of body fluids. Whilst there are considerable efforts to identify single source body fluids using genetic markers; no substantial research appears to have been carried out on mixed body fluids. This is a potentially complex area and before such genetic based body fluid identification can be utilised, an understanding of the effects of mixtures on the results is required. Can body fluid mixtures be identified and if so, what is the value of the information gained?Samples of blood and saliva were acquired from volunteers with informed consent. The samples underwent total RNA extraction. A range of mixtures were then prepared in the mixing ratios of 1:1, 5:1, and 10:1 (both with blood and then with saliva as the major contributor). Single source controls were included. All samples then …", "num_citations": "7\n", "authors": ["834"]}
{"title": "Performing body fluid identification with microRNAs using capillary electrophoresis\n", "abstract": " MicroRNAs have a potential to be ideal forensic markers due to their small size (∼22 nt), high abundance per cell, and sensitive and specific detection. Thousands of microRNAs are present in biological material and they are suitable for body fluid identification (BFID). Their advantageous properties increase the chances of successful analysis from challenged crime scene samples. In addition, it has been demonstrated that informative microRNA expression levels can be obtained from common DNA extracts. Following an earlier pilot project on a single stream process with the integration of microRNA analysis into a DNA profiling multiplex, progress on this line of research is now presented. A panel of 8 microRNAs (hsa-miR-10a, -16a, -135a, -142, -203a, -205, -451a and -1260b) has been identified to allow differentiation between blood, saliva, semen and vaginal material. Here the analysis of the BFID markers …", "num_citations": "6\n", "authors": ["834"]}
{"title": "Exposure suits: a review of thermal protection for the recreational diver.\n", "abstract": " Some basic diving science on diver thermal protection is reviewed. The common methods of thermal protection used by recreational divers and the potential advantages and disadvantages of various forms of exposure protection are discussed. Diving suit related incidents in the Diving Incident Monitoring Study and fatalities in Project Stickybeak are reported.", "num_citations": "6\n", "authors": ["834"]}
{"title": "Design of decision support systems as federated information systems\n", "abstract": " The design of a decision support system (DSS) presents many challenges. While the term “DSS” has been applied to cover a wide range of systems supporting decision-making processes, a DSS is most typically defined as an information system used to support the solving of ill-defined problems (Simon, 1973). Broadly, ill-defined problems are characterized by the feature that both an understanding of the structure of the problem and the recognition of ‘good’solutions are developed progressively as the investigation proceeds. Typically, problemsolving requires some creativity and is essentially open-ended in terms of the data needed and the processing to be performed. This means that the usual information systems design approaches that focused on identification of data, the manipulations needed, and workflow have limited applicability. Rather, DSS development most frequently focuses on assembling a …", "num_citations": "6\n", "authors": ["834"]}
{"title": "Judicial Activism and Judicial Review in the High Court of Australia\n", "abstract": " Open Research: Judicial Activism and Judicial Review in the High Court of Australia Skip navigation The Australian National University The Australian National University Open Research Library Search query Search Skip navigation Home About Contribute Publishing Policy Copyright Contact Statistics My Open Research close My Open Research Your list of unfinished submissions or submissions in the workflow. Edit Profile Receive email updates Statistics Login Menu Search Search query search scope Search Home About Contribute Publishing Policy Copyright Contact Search ANU web, staff & maps Search current site content Home » ANU Research » ANU Scholarly Output » ANU Research Publications » Judicial Activism and Judicial Review in the High Court of Australia Judicial Activism and Judicial Review in the High Court of Australia Statistics Export Reference to BibTeX Export Reference to EndNote XML …", "num_citations": "6\n", "authors": ["834"]}
{"title": "The essentials of data science: knowledge discovery using R\n", "abstract": " The Essentials of Data Science: Knowledge Discovery Using R presents the concepts of data science through a hands-on approach using free and open source software. It systematically drives an accessible journey through data analysis and machine learning to discover and share knowledge from data.", "num_citations": "5\n", "authors": ["834"]}
{"title": "Special issue on behavior computing\n", "abstract": " Behavior is ubiquitous, widely seen from human being, machine and object-related activities and systems. Different from so-called data, behavior forms an intrinsic part of an underlying system and its problems. An abstract behavior [2, 10] can be described as a four-tuple object, consisting of actor (subject and/or object), operation (activity and activity properties), relation (interactions) and context (including environment). In deeply understanding behaviors [2], interaction, coupling relationships, semantics, dynamics, change, and impact and utility [5] are important factors to consider. Behavior Computing (or Behavior Informatics)[3, 4] is an emerging field which studies behaviors and behavior-oriented systems from the perspectives of informatics and analytics, aiming to build formal methods and computational theories and techniques for behavior representation, processing and engineering. It aims at inventing and …", "num_citations": "5\n", "authors": ["834"]}
{"title": "A novel method for the analysis of slash cuts to clothing\n", "abstract": " Slash attacks form a major element of physical assaults involving a sharp implement such as a knife. If the slash attack is inflicted onto a surface covered with fabric, such as clothing, then that fabric may receive a slash cut.  Investigation of the slash cut can provide further information as to the nature of the implement and the action of the attack.  This study aims to identify a quantifiable correlation between the nature of the slash cut and the implement causing said slash cut. The study also aims to develop a method of categorising the damage as well as a way of measuring the sharpness of a knife without blunting the blade. The two new simple techniques were developed and applied to a range of household implements. A quantifiable correlation could be seen between the damage categorisation and the relative sharpness of the implement. The degree of this correlation varied depending on the fabric type.", "num_citations": "5\n", "authors": ["834"]}
{"title": "Exploratory hot spot profile analysis using interactive visual drill-down self-organizing maps\n", "abstract": " Real-life datasets often contain small clusters of unusual sub-populations. These clusters, or ‘hot spots’, are usually sparse and of special interest to an analyst. We present a methodology for identifying hot spots and ranking attributes that distinguish them interactively, using visual drill-down Self-Organizing Maps. The methodology is particularly useful for understanding hot spots in high dimensional datasets. Our approach is demonstrated using a large real life taxation dataset.", "num_citations": "5\n", "authors": ["834"]}
{"title": "Identifying risk groups associated with colorectal cancer\n", "abstract": " In this paper, we explore data mining techniques for the task of identifying and describing risk groups for colorectal cancer (CRC) from population based administrative health data. Association rule discovery, association classification and scalable clustering analysis are applied to the colorectal cancer patients’ profiles in contrast to background patients’ profiles. These data mining methods enable us to identify the most common characteristics of the colorectal cancer patients. The knowledge discovered by data mining methods which are quite different from traditional survey approaches. Although it is heuristic, the data mining methods may identify risk groups for further epidemiological study, such as older patients living near health facilities yet seldom utilising those facilities, and with respiratory and circulatory diseases.", "num_citations": "5\n", "authors": ["834"]}
{"title": "Temporal event mining of linked medical claims data\n", "abstract": " For universal health care systems such as that found in Australia, the health care budget constitutes one of the largest items for government expenditure. Identifying even small pockets of inefficiencies and wastage can have considerable impact (one percent of $30 billion is still a significant amount) and can result in shifting funds to where they are most needed. We report on the use of a data mining approach to the problem of empirically identifying episodes of health care introduced in [1]. The task is one of detecting, within a temporal sequence relating to a hospital admission, primary care that might be associated with that admission. The results have been used in studies of the relationship between out of hospital and in-hospital care for policy research and, for example, exploring issues relating to preventable hospitalisations.", "num_citations": "5\n", "authors": ["834"]}
{"title": "Transitions between bound states for axially channeled MeV electrons\n", "abstract": " Predicted characteristic radiations corresponding to transitions between bound states of transverse motion in the axial channeling of relativistic electrons’, 2 have been recently observed in Si for two energy regimes: at 28-56 MeV3 and 1.54 MeV. 4 The lower energy data are of particular interest because individual transitions are resolved and these give detailed information on the “bound” motion^.^ We report on a similar set of low energy measurements, but using a thinner Si crystal, a single lattice spacing in the axis, and a better resolution detector. Detailed comparisons ofthe previous4 and present observations with the predictions of the single string approximation using a Molibre potential5 are also presented. In our measurements, a 2.0 to 4.5-MeV electron beam from the Dynamitron accelerator at Albany was first collimated to a total divergence of< 1.5 mrad before directing it to a (1 10) oriented 4400-i% Si …", "num_citations": "5\n", "authors": ["834"]}
{"title": "The emerging field of forensic epigenetics\n", "abstract": " DNA profiling characterises small sections of the genome referred to as Short Tandem Repeats. This DNA profile is robust and stable in that the DNA profile will not change over the lifetime of an individual and is in general the same DNA profile regardless of what body fluid is sampled (except in cases of rare chimerism). The value of DNA profiling is undeniably immense and with increasing sensitivity and specificity it is far and beyond the gold standard of forensic science. However, the amount of investment and research has advanced the field to the extent that significant capability gaps are existing elsewhere.", "num_citations": "4\n", "authors": ["834"]}
{"title": "Differentiating between genuine damage and falsified damage to a garment following an alleged sexual assault\n", "abstract": " An allegation of sexual assault was made in which a bra was torn off by the assailant causing extensive damage; however, it was observed that the hook and eye fastening was still intact. It was felt that it was not possible for a garment to receive such damage without damage to the hook and eye fastening, thus indicating that the complainant caused the damage to the bra herself to support a false allegation. Reconstruction experiments were conducted in which the conditions of the allegation were simulated utilizing a range of similar bras. Following the infliction of damage, the hook and eye fastenings were examined. In eight of nine experiments, the hook and eye fastening were intact, despite the application of enough force to cause separation of the bra cups in five of the experiments. This shows that bras may suffer extensive damage without damage to the hook and eye fastening.", "num_citations": "4\n", "authors": ["834"]}
{"title": "Forensic applications of whole genome amplification\n", "abstract": " Whole genome amplification (WGA) has been touted as a possible technique to augment fragment analysis of STRs in amplifying low-levels of DNA recovered from crime scenes or items. Only LCN DNA analysis is routinely used as an additional amplification step; but this is not without problems, such as the increased incidents of stochastic variations. A review of the literature was carried out in order to assess the latest research and to identify a potentially fit for purpose whole genome amplification technique. There are three potential alternative techniques which show promise, miPEP, dcDOP-PCR and MDA used in conjunction with a macromolecular crowder; with the majority of studies investigating the effect of non-crowded MDA on a variety of stains, including degraded, low-level and stains containing mixtures of DNA. A number of techniques are suggested for incorporation into STR analysis depending on the sample type as well as future strands of work.", "num_citations": "4\n", "authors": ["834"]}
{"title": "Detection of ampicillin resistance in Enterococcus spp. by disk diffusion and two commercial automated systems\n", "abstract": " A total of 154Enterococcus faecium and 48Enterococcus faecalis isolates, 55 % of which were ampicillin-resistant, were used to evaluate two commonly used automated systems, Vitek's GPS-TA card (bioMérieux, USA) and MicroScan's POS MIC Type 6 panel (Baxter Healthcare, USA), and the NCCLS disk diffusion method for the detection of ampicillin resistance. MicroScan panels were read by the Walk/Away system and by visual inspection. The results were as follows: disk diffusion, 100 % sensitive and specific; Vitek, 100 % sensitive and 95 % specific; and MicroScan, when read by the Walk/Away, 85 % sensitive and 98 % specific. When MicroScan was interpreted by visual inspection, however, sensitivity increased to 96 %.", "num_citations": "4\n", "authors": ["834"]}
{"title": "GRAND ROUNDS-GUYS-HOSPITAL-THALLIUM POISONING\n", "abstract": " Thallium is a heavy metal whose salts are used in some rodent poisons and in the manufacture of optical lenses, semiconductors, scintillation counters, low temperature thermometers and switching devices, green coloured fireworks, and imitation jewellery, and as chemical catalysts. In clinical practice thallium isotopes are used in cardiac scanning,1 2  but the use of thallium salts to treat scalp ringworm was abandoned earlier this century because of their toxicity. The sale of thallium in Britain is strictly licensed because of its toxicity and potential for use in murder, which is helped by the fact that thallous salts are colourless, tasteless, and odourless. The more water soluble salts (such as thallium sulphate, acetate, or carbonate) have higher toxicity, and although the toxic dose is variable most deaths occur after the ingestion of 10-15 mg/kg of soluble salt. Most cases of thallium toxicity occur after oral ingestion but …", "num_citations": "4\n", "authors": ["834"]}
{"title": "Models for dynamics of relaxation in glasses\n", "abstract": " Wide classes of disordered materials display relaxations which cannot be expressed in ] terms of a single decay rate. The analysis of experimental data often leads to the Kohlrausch-Williams-Watts stretched exponential exp[-(t/τ)β] or to algebraic time dependences C/tY .In this article, we show how such decay patterns may arise from quite different microscopic dynamics. Possible candidates for modelling disorder are (a) self-similar spatial distributions of sites (fractal geometries), (b) distributions of waiting times and (c) self-similar distributions of energy barriers (ultrametric spaces). For each of these models one may obtain under certain conditions stretched exponential or algebraic decays, although the microscopic relaxation dynamics differ in every case.", "num_citations": "4\n", "authors": ["834"]}
{"title": "117. A new synthesis of cystine and lanthionine\n", "abstract": " It appeared of interest, therefore, to investigate the action of sodium sulphide on a-acetamido-a-dimethylaminomethylmalonate methiodide (I). In accordance with expectations, heating (I) with an excess of aqueous sodium sulphide yielded a product which on acid hydrolysis and decarboxylation gave inactive lanthionine in 57% yield. The reaction between (I) and excess of alcoholic potassium hydrogen sulphide, followed by hydrolysis and decarboxylation, did not, however, give cysteine, but only lanthionine. No reaction occurred when the non-quaternised base was used (cf. Snyder and Eliel, J.", "num_citations": "4\n", "authors": ["834"]}
{"title": "The electrophoresis of certain hydrocarbons and aliphatic esters as a function of p H\n", "abstract": " A considerable amount of work has been performed on the electrophoresis of dispersed particles, the object being usually to correlate the electrophoretic mobility with the ionic composition of the aqueous phase. Attempts to relate the mobility to the chemical composition of the dispersed phase, however, have been much less numerous. Alty and Johnson 1 studied the electrophoretic behaviour of paraffin wax, alone and with the surface coated with aliphatic acids, amides and alcohols. They found that as the water soluble group was changed in the order-CONH,,-COOH,-CH, OH, the mobility progressively decreased. They also found that the mobility was decreased by lowering the PH of the aqueous phase.", "num_citations": "4\n", "authors": ["834"]}
{"title": "Critical evaluation of touch DNA recovery methods for forensic purposes\n", "abstract": " Over the past decade there has been a significant increase in the number of submissions of ‘touch DNA’ evidence to forensic laboratories. Previous research has indicated that analysis of these samples produces low success rates. Published research, as well as case work review by forensic practitioners, has also indicated more consideration of how to improve the evidential value of ‘touch DNA’ samples is needed. Therefore, this research aims to critically evaluate low level DNA recovery methods in order to maximise efficiency for forensic identification purposes. Typical evidential items, such as plastic handled screwdrivers, aluminium cans, drinking glasses and wooden handles, were handled in a mock-operational trial. The deposited DNA was recovered from these items using a range of swabbing materials including cotton, polyester and foam. These samples then underwent quantitative PCR analysis and …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Avatar Therapy\n", "abstract": " For families struggling with the difficulties of doing what’s right and best for their child living with a mental illness, this remarkable book will be an eye-opener, a comfort and even a life-changer. In the very first paragraph of his work, Solomon rejects common understanding. There’s no such thing as reproduction, he writes, only acts of production. Genetics notwithstanding, parents of exceptional children, meaning those very unlike themselves, can find they sooner or later face the same crucial question: to what extent should they accept their children for who they are and how far should they go to help them become their best selves possible?Far From The Tree (Scribner, 2012) is a book of stories about parents and their progeny, children who are either born or grow to become different in profound and challenging ways. In 10 chapters, Solomon tells of families coping with deafness, autism, dwarfism, Down syndrome, schizophrenia, multiple severe disabilities, with children who are prodigies or transgender, those who are conceived through rape and those who become criminals. While each of these situations sets a family apart, Solomon sees the differences within families as a universal link. We are all united in our diversity, he believes. In preparation for this tour de force of a work, Solomon interviewed some 300 families, accumulating over 40,000 pages of transcription. From his 700 pages of reportage, a reader soon encounters a startling fact: how eloquent ordinary people can be when facing extreme challenges. Their narratives are full of heartbreak and joy. Together they celebrate the full range of human experience and what it’s like to be a …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Analysis of cluster migrations using self-organizing maps\n", "abstract": " Discovering cluster changes in real-life data is important in many contexts, such as fraud detection and customer attrition analysis. Organizations can use such knowledge of change to adapt business strategies in response to changing circumstances. This paper is aimed at the visual exploration of migrations of cluster entities over time using Self-Organizing Maps. The contribution is a method for analyzing and visualizing entity migration between clusters in two or more snapshot datasets. Existing research on temporal clustering primarily focuses on either time-series clustering, clustering of sequences, or data stream clustering. There is a lack of work on clustering snapshot datasets collected at different points in time. This paper explores cluster changes between such snapshot data. Besides analyzing structural cluster changes, analysts often desire deeper insight into changes at the entity level, such as …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Photoswitching in photonic crystal fiber\n", "abstract": " The photoswitching dynamics of an azobenzene in hollow-core photonic crystal fiber are monitored in real-time via absorption spectroscopy, with greatly reduced irradiation time and sample volume requirement compared to a conventional cuvette.", "num_citations": "3\n", "authors": ["834"]}
{"title": "Exploring possible adverse drug reactions by clustering event sequences\n", "abstract": " Historically the identification of adverse drug reactions relies on manual processes whereby doctors and hospitals report incidences to a central agency. In this paper we suggest a data mining approach using administrative pharmaceutical usage data linked with hospital admissions data. Patients, represented by temporal sequences of drug usage, are clustered using unsupervised learning techniques. Such techniques rely on a distance measure, and we propose in this paper such a distance measure for comparing drug usage sequences based on an event-type hierarchy, based around the hierarchical drug classification system. Although developed for a specific domain, we indicate that it is applicable in other applications involving data where event types form a hierarchical structure, such as is found in telecommunications applications. The approach modifies the Uniform Kernel K-Nearest Neighbour …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Causes of drowning in divers.\n", "abstract": " Drowning is the endpoint of many diving fatalities for a variety of reasons. Most divers are not well enough trained and should be encouraged to undertake more training beyond basic recreational open water diving. Unexpected equipment failures may sometimes occur. How to cope with these problems is not always adequately taught during initial training. A quarter of equipment failure incidents result in morbidity, yet a surprising number of divers have poorly maintained or serviced equipment. Running out of air is one of the most common serious diving incidents, which suggests that there is something wrong with how divers are trained. Air integrated gauges/computers, most of which have audible warnings, are useful tools for gas supply management and should be utilised more than at present. Wrist mounted displays are more readily seen than dangling consoles. The Cave Diving Association of Australia …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Incompleteness in data mining\n", "abstract": " Database technology, as well as the bulk of data mining technology, is founded upon logic, with absolute notions of truth and falsehood, at least with respect to the data set. Patterns are discovered exhaustively, with carefully engineered algorithms devised to determine all patterns in a data set that belong to a certain class. For large data sets, many such data mining techniques are extremely expensive, leading to considerable research towards solving these problems more cheaply.               We argue that the central goal of data mining is to find SOME interesting patterns, and not necessarily ALL of them. As such, techniques that can find most of the answers cheaply are clearly more valuable than computationally much more expensive techniques that can guarantee completeness. In fact, it is probably the case that patterns that can be found cheaply are indeed the most important ones.               Furthermore …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Mining the knowledge mine: the hot spot methodology for mining large real world data bases\n", "abstract": " CSIRO Research Publications Repository - Mining the knowledge mine : the hot spot methodology for mining large real world data bases Skip to Main Content CSIRO Home Research Publications Repository Contact Us Help CSIRO Login Username Password Search Publications Advanced Search Browse Publications Selected Records () Mining the knowledge mine : the hot spot methodology for mining large real world data bases Description Select | OK Print Author: WILLIAMS, G; HUANG, Z Date of Publication: 1997 Publication Type: Conference Material Conference Name: Proc of the 10th Australian Joint Conference on Artificial Intelligence Conference Date: 1997 Conference Location: Perth WA Keywords: Mathematical and Information Sciences Identifier: procite:a307ce31-8040-4d1d-81f2-3f6baa70f26e Attribution Statement: WILLIAMS, G; HUANG, Z. Mining the knowledge mine : the hot spot methodology for …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Determining steelmaking aim chemistry utilizing an iterative and knowledge-based approach\n", "abstract": " Development of knowledge-based systems for material design is a complex task, due to the interelationship of many factors in the steelmaking process. In addition, design specifications vary frequently and materials design knowledge is held in a largely intuitive undefined format. This paper discusses the first stage of a material design system which deals with the determination of the steelmaking aim chemistry. If an attempt is made to design aim chemistry based on the mathematical approach of utilizing the empirical models between various design parameters it would result in an unrealistic design because relationships between various design parameters are not always linear. Therefore applying the knowledge-based approach along with the mathematical approach to deal with this complex task is inevitable. The approach put forward in this paper is a hybrid one, where the knowledge base is applied at every …", "num_citations": "3\n", "authors": ["834"]}
{"title": "Representing expectations in spatial information systems\n", "abstract": " Expectations are important in reasoning, providing a framework within which decisions can be made. This paper describes a spatial information system which couples a large object-oriented spatial database with a graphical user interface, and incorporates ideas from artificial intelligence research, allowing the representation and use of expectations. In particular, the decision support role of spatial information systems is enhanced by the incorporation of reasoning with justifications and truth maintenance. The resulting system facilitates the assimilation, handling, and access to large amounts of dynamic and static spatial data for decision support. Inferential information of an application can be recorded, monitored, and updated.", "num_citations": "3\n", "authors": ["834"]}
{"title": "The design of an expert system for environmental management\n", "abstract": " Davis, JR; Nanninga, PM; Williams, GJ. The design of an expert system for environmental management. In: In: Conacher, A (ed.). Readings in Australian Geography. Perth: Univ. of WA; 1988. pp. 325-330 24 refs. http://hdl. handle. net/102.100. 100/266047? index= 1", "num_citations": "3\n", "authors": ["834"]}
{"title": "Collision cascades and fractals\n", "abstract": " [en] The spatial and electronic structure of the damaged regions in solids created by ion collision cascades has been studied theoretically by introduction of the concept of fractals. Results permitted the recognition of a characteristic structure in the spatial distribution of the vacancies in the collision cascade and the description of the order in the electronic features due to cascade, as well. There is a meaningful dimensionality and structure to the damage cascade", "num_citations": "3\n", "authors": ["834"]}
{"title": "Knowledge elicitation for material design expert system\n", "abstract": " Knowledge elicitation including collection, analysis, and representation of knowledge is the most important stage, but also the principal bottleneck in the development of knowledge based systems. Due to the difficulties faced in the knowledge elicitation process, development of knowledge based system for material design in steel making industry is a complex task. An attempt is made in this paper to present a novel approach to deal with knowledge elicitation for material design problems which involves codification scheme for the customer special requirements and a new approach to collect knowledge from the experts utilising paper models along with structured and unstructured interviews This paper centres around the human aspects and the practical experience gained while developing a knowledg", "num_citations": "3\n", "authors": ["834"]}
{"title": "Evaluating the use of hypoxia sensitive markers for body fluid stain age prediction\n", "abstract": " To augment DNA profiling and body fluid identification techniques efforts are being made to increase the amount of information available from a crime scene stain, which includes efforts to identify externally visible characteristics through phenotypic analysis. A key question surrounding crime scene stains is the length of time between deposition of the stain and its subsequent recovery, in that is the stain recovered related to the incident in question or from a previously deposited stain number of weeks earlier? The inability to answer this fundamental question has a detrimental effect upon the successful completion of a criminal investigation. Once a body fluid leaves the body, the oxygen concentration in the environment changes; therefore, it may be that this change could cause a change in the expression of hypoxia-sensitive biomarkers. Here, a range of bloodstains, liquid saliva and liquid semen samples were …", "num_citations": "2\n", "authors": ["834"]}
{"title": "Time since deposition of biological fluids using RNA degradation\n", "abstract": " In criminal casework where sexual intercourse has taken place, body fluids are usually left behind. Body fluid identification (BFID) of the type and origin can provide important information regarding what has occurred and who from, however BFID struggles to determine time since deposition (TSD) of biological stains. According to the Crime Survey in England and Wales in 2017, it shows that the majority of sexual offences that occur are committed by people already known to the victims, roughly around 90%, with 56% of these being committed by partners or ex partners. In these cases, the defence is that their DNA will be present because they are in a relationship or were in a prior relationship. To challenge this defence, the degradation of RNA in semen stains could potentially provide information regarding when a stain was deposited. The degradation pattern of a few semen specific mRNA genes and housekeeping …", "num_citations": "2\n", "authors": ["834"]}
{"title": "Package ‘limSolve’\n", "abstract": " Description Functions that (1) find the minimum/maximum of a linear or quadratic function: min or max (f (x)), where f (x)=|| Ax-b||^ 2 or f (x)= sum (a_i* x_i) subject to equality constraints Ex= f and/or inequality constraints Gx>= h,(2) sample an underdeterminedor overdetermined system Ex= f subject to Gx>= h, and if applicable Ax~= b,(3) solve a linear system Ax= B for the unknown x. It includes banded and tridiagonal linear systems.", "num_citations": "2\n", "authors": ["834"]}
{"title": "Forensic textile damage analysis: recent advances\n", "abstract": " Textiles damage analysis is an invaluable tool in forensic investigations and can be used to help resolve cases of stabbings, shootings, and sexual assaults. It also has the potential to resolve arson attacks and “acid attacks”. Here, the literature is explored in order to review research relating to blunt force damage, stab and slash cuts, the phenomenon of falsification of evidence in sexual assaults, projectiles damage, and the effect of decomposition upon textiles damage, among others. It is clear that there is a paucity of research in the area, but where the research has been carried out, it has been informative and impactful. However, there are areas that need further work, including a better understanding of normal wear and tear, and the potential for chemicals to cause textiles damage. One area that is in a significant need of further work is the development of a robust interpretational framework.", "num_citations": "2\n", "authors": ["834"]}
{"title": "Effect of decomposition on clothing damage evidence: A preliminary study\n", "abstract": " Textiles are generally present when a crime takes place and, in some cases, may be directly linked to a crime. Due to changes that occur to fabric over time, there is a risk of clothing damage being misinterpreted, and vital evidence being missed. This study is the first of a number of studies exploring the effect of decomposition upon clothing damage evidence following a stabbing. Sections of porcine tissue were wrapped in fabric in which stab cuts had been created, and left exposed to the environment alongside negative controls. Images of the damage were taken before and after a period of decomposition over two weeks. When compared to the negative controls, these images clearly demonstrated that there was a significant amount of alteration to the clothing damage evidence e.g. loose and fraying yarns, following a period of decomposition. Quantification of the fraying to the damage showed a statistically …", "num_citations": "2\n", "authors": ["834"]}
{"title": "The TARANIS laser: A multi-terawatt system for laser plasma physics\n", "abstract": " The Terawatt Apparatus for Relativistic And Non-linear Interdisciplinary Science (TARANIS), installed in the Centre for Plasma Physics at the Queen's University Belfast, supports a wide ranging science program, including laser-driven particle acceleration, X-ray lasers and high energy density physics experiments. We present (1) an overview of the laser facility,(2) results of preliminary investigations on proton acceleration, laser action at 13.9 nm and K α sources and (3) speculation on future experiments using these extreme sources.", "num_citations": "2\n", "authors": ["834"]}
{"title": "New frontiers in applied data mining\n", "abstract": " Five high-quality workshops were held at the 13th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD 2009) in Bangkok, Thailand during April 27-30, 2009. There were 17, 6, 9, 4 and 5 accepted papers to be presented at the Pacific Asia Workshop on Intelligence and Security Informatics (PAISI 2009), the workshop on Advances and Issues in Biomedical Data Mining (AIBDM 2009), the workshop on Data Mining with Imbalanced Classes and Error Cost (ICEC 2009), the workshop on Open Source in Data Mining (OSDM 2009), and the workshop on Quality Issues, Measures of Interestingness and Evaluation of Data Mining Models (QIMIE 2009). One competition, PAKDD 2009 Data Mining Competition, and one local workshop, Thai Track Session, were arranged. From these workshops (except PAISI which published its works in separate LNCS proceedings), we selected two or three best …", "num_citations": "2\n", "authors": ["834"]}
{"title": "Building consensus through the application of a decision support tool for land managers\n", "abstract": " The economic and practical reality for local government and other land managers is the need to prioritise resources. Ku-ring-gai Council on Sydney's North Shore has improved transparency of funds allocation in planning recurrent and capital works projects through the application of a bushland priority rating tool. Council staff adapted the traditional 1971 Leopold matrix in a similar way to how the University of Western Sydney adapted it when examining the impact of tourism on the economy, community, and environment of Manly in 2007. The tool integrates technical knowledge acquired from multiple research projects and local community perceptions to rank the value and level of socio-environmental pressure exerted on each reserve. The outcome is a ranking system that dissolves bias, and accords equity amongst competing points of view to ensure the natural assets of greatest value receive adequate funding.", "num_citations": "2\n", "authors": ["834"]}
{"title": "Conceptual mining of large administrative health data\n", "abstract": " Health databases are characterised by large number of records, large number of attributes and mild density. This encourages data miners to use methodologies that are more sensitive to health undustry specifics. For conceptual mining, the classic pattern-growth methods are found limited due to their great resource consumption. As an alternative, we propose a pattern splitting technique which delivers as complete and compact knowledge about the data as the pattern-growth techniques, but is found to be more efficient.", "num_citations": "2\n", "authors": ["834"]}
{"title": "Chapter III and the Powers of Non-Judicial Tribunals: Breckler and Beyond\n", "abstract": " Open Research: Chapter III and the Powers of Non-Judicial Tribunals: Breckler and Beyond Skip navigation The Australian National University The Australian National University Open Research Library Search query Search Skip navigation Home About Contribute Publishing Policy Copyright Contact Statistics My Open Research close My Open Research Your list of unfinished submissions or submissions in the workflow. Edit Profile Receive email updates Statistics Login Menu Search Search query search scope Search Home About Contribute Publishing Policy Copyright Contact Search ANU web, staff & maps Search current site content Home » ANU Research » ANU Scholarly Output » ANU Research Publications » Chapter III and the Powers of Non-Judicial Tribunals: Breckler and Beyond Chapter III and the Powers of Non-Judicial Tribunals: Breckler and Beyond Statistics Export Reference to BibTeX Export …", "num_citations": "2\n", "authors": ["834"]}
{"title": "KDD for insurance risk assessment: A case study\n", "abstract": " Insurance is a business of risks. Identifying and understanding areas of risk is an important task performed by an insurer. An assessment of risk is used to set the appropriate premium for insurance policies. This paper describes a KDD exercise which uses decision tree techniques to identify significant areas of risk within an insurance portfolio. The real world dataset used contains information about policies and insurance claims on those policies. Decision trees can be constructed to identify and describe areas of high risk which are then evaluated, as a separate exercise, in terms of claim frequency and claim costs. The paper stresses the idea of interactive post-processing, or evaluation, of the patterns that are illuminated by traditional data mining tools.", "num_citations": "2\n", "authors": ["834"]}
{"title": "Modelling the KDD Process\n", "abstract": " Knowledge Discovery in Databases (KDD) is the process of extracting novel information and knowledge from large databases. This process consists of many interacting stages performing specific data manipulation and transformation operations with an information flow from one stage onto the next (and often back into previous stages). The process can be very complex and may exhibit much variety in the context of the variety tasks undertaken within KDD. In this paper we characterise our experiences of the KDD process and formalise its key elements in a model. A case study of insurance risk analysis for policy premium setting is used to illustrate the process and the model. The model provides a framework for comparing and differentiating various approaches to KDD.", "num_citations": "2\n", "authors": ["834"]}
{"title": "Knowledge-based system for metallurgical grade design\n", "abstract": " Knowledge-based system development for metallurgical grade design in steel making is a complex task, due to the difficulties faced in the knowledge elicitation process and due to the interrelationship of many factors in steel making process. This paper discusses the first stage of metallurgical grade design system which deals with the determination of the steel making aim chemistry. If an attempt is made to design aim chemistry based on the mathematical approach of utilizing the empirical models between various design parameters, it would result in unrealistic design because relationships between various design parameters are not always linear. Therefore it is inevitable to apply the knowledge based approach along with the mathematical approach to deal with this complex task. The approach put forward is a hybrid approach, where the knowledge base is applied at every stage of the design process to utilize …", "num_citations": "2\n", "authors": ["834"]}
{"title": "FrameUP: A\n", "abstract": " This paper presents an introduction to frames-based representation schemes for use in the construction of rulebased expert systems. The features that are relevant to such expert systems are discussed, followed by an exampler of the type of rule application mechanism that the system implements. Advantages of such a system are presented", "num_citations": "2\n", "authors": ["834"]}
{"title": "Fractal dimension of ion cascades in matter\n", "abstract": " [en] We present evidence that the dimension, δ, of ion collision cascades in solid matter, as studied by binary collision simulation methods, is fractal-like, with δ 1.40±0.06, roughly that of cluster-cluster diffusion limited aggregation in two dimensions. We further argue that the clusters of damage which remain after annealing may enhance diffusion, following de Gennes' termite model.(author)", "num_citations": "2\n", "authors": ["834"]}
{"title": "Energy losses of positive and negative high-energy channeled particles\n", "abstract": " The results of measurements of energy losses of 35-, 100-, and 250-GeV particles channeled through a 2-cm Ge crystal are reported. The energy losses are correlated with the incoming and outgoing particle angles, relative to the channel axis, and the results are compared with existing theories.", "num_citations": "2\n", "authors": ["834"]}
{"title": "The role of the editor in Australia\n", "abstract": " This article has been adapted by the author from a paper presented to the first technical communications seminar held at The New South Wales Institute of Technology in June 1974.Discussed are some elements and techniques of editing from the author's experiences as an editor in Australia and which may be applicable to other countries. Format, typography, printing, the duties of the editor, the instruction manual, and liaison are some of the topics discussed.", "num_citations": "2\n", "authors": ["834"]}
{"title": "Evaluating the viability of obtaining DNA profiles from DNA encapsulated between the layers of composite counterfeit banknotes\n", "abstract": " Banknote counterfeiting can potentially undermine the integrity of a currency, by eroding both public and retailer confidence in cash as a method of payment. To thwart such criminal counterfeiting activity, banknote issuing authorities employ a range of overt and covert technologies, most in the form of banknote security features.The development, selection and deployment of such features, is an ongoing process undertaken jointly between the manufacturers of security features, banknote printers and banknote issuing authorities, i.e. Central Banks. This ongoing process helps maintain the integrity of banknotes as a recognised, safe and secure means of payment. While some counterfeit banknotes are seized by police at the point of production or whilst in storage, others are removed from circulation during banknote sorting operations, as part of the ‘cash cycle’. Counterfeit banknotes which are removed from …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Density-functional-theory calculations of the optical properties of Al2O3: From solid-state to warm dense matter conditions\n", "abstract": " Aluminium oxide (Al2O3) in extreme conditions is present in many high energy density (HED) experiments, as well as in disintegrating extra-solar planets (exoplanets). Understanding the changes in the optical properties of Al2O3 in conditions of extreme temperatures is necessary for designing HED experiments, and the interpretation of astronomical observations. However, there are no calculations of the optical properties of HED Al2O3 in the literature. Here, we present density functional theory (DFT) calculations of the optical properties of Al2O3 for photon energies from 0 to 90 eV in conditions ranging from crystalline to warm dense matter conditions, at solid densities. Changes of the optical properties due to increasing temperature are explained in terms of the changing electronic structure and electron occupation. To benchmark the DFT approach adopted here, the calculations are compared to available …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Data Mining: 15th Australasian Conference, AusDM 2017, Melbourne, VIC, Australia, August 19-20, 2017, Revised Selected Papers\n", "abstract": " This book constitutes the refereed proceedings of the 15th Australasian Conference on Data Mining, AusDM 2017, held in Melbourne, VIC, Australia, in August 2017. The 17 revised full papers presented together with 11 research track papers and 6 application track papers were carefully reviewed and selected from 31 submissions. The papers are organized in topical sections on clustering and classification; big data; time series; outlier detection and applications; social media and applications.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Effecting change in local government: local authority chief executives as emotional actors\n", "abstract": " Most change management initiatives fail. Here, we explore data which emerged from a larger research study of local authority chief executives’ subjective experiences of New Labour’s modernisation programme and argue that the route to change so often taken by central government is detrimental to the successful embedding of change within local government because it ignores fundamental human reactions to coercion and control. We demonstrate that the seeds of failure are sown in the processes adopted as much as in the content of any programme of change. A contributory factor to such failures is the apparent reliance on the part of legislators that their policies and procedures will receive a neutral reaction. We show that the reality is that legislation is responded to and enacted by people who react in ways designed to defend their own positions, irrespective of the worth of those positions. Whether seen as …", "num_citations": "1\n", "authors": ["834"]}
{"title": "White House Confident FDA Diagnostic Oversight Won’t Inhibit Innovation\n", "abstract": " FDA, as part of the roll-out, announced it was launching a challenge incorporating the agency’s new precisionFDA—a cloud-based platform created to facilitate communication among industry, academia and the government on next generation sequencing (NGS) tests—to encourage improved quality standards in the genomics community and better accuracy of DNA testing.There will be no monetary award or prize for the challenge, FDA spokesman Eric Pahon said, but rather recognition that a company’s test is accurate and reliable.“Winners will be recognized on the precisionFDA website,” he said.“[W] e anticipate the opportunity to highlight proprietary technical advances will attract leaders in this field.” The White House also announced a new draft security framework for the initiative and the expansion of a similar cohort program within the veteran community.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Strategic Learning in English local authorities: the influence of Labour's modernisation agenda 1997–2010\n", "abstract": " This research explores the English local government modernisation agenda of the 1997–2010 Labour government with reference to its promotion of, and effects on, organisational learning. It does this by examining the concept of learning to learn, as constructed by local authority Chief Executives. A synthesised analytical framework is developed by exploring the commonalities of three approaches to the exchange of knowledge: organisational learning; policy transfer, and change management. Utilising this framework, local government modernisation is examined within the broader modernisation agenda and its historical context. This, and an examination of Best Value, the Beacon Council Scheme and the Comprehensive Performance and Area Assessments, exposes the links between modernisation and organisation learning that underpin a central contention of this research; that the success of local government modernisation relied on local authorities being better able to learn from each other. Analysis of the data unique to this research, obtained largely through interviews with local authority Chief Executives, illuminates the way in which they construct their views of learning, modernisation and central-local relations. The major conclusions concern the significance of networks, differences and trust and how views of each are constructed. Also important is trust within central-local relations. Modernisation consolidated the acceptance of other local authorities as sources of learning and enhanced particular characteristics conducive to learning. However, through the mechanisms utilised, modernisation also inhibited instances of learning and was …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Differentiating between monozygotic twins through methylation specific high resolution melt curve analysis\n", "abstract": " Whilst DNA profiling is an extremely powerful human identification tool, it is limited when it  comes to monozygotic (MZ) or identical twins, where in such cases they would exhibit the same DNA profile. This creates issues where the suspect is one of the twins. Currently, efforts are being made to resolve this through whole genome or next generation sequencing, which can be very expensive. This study explores the feasibility of using high resolution melt curve analysis to characterize  the DNA methylation status. DNA methylation can be altered by environmental factors, consequently  over the life of monozygotic twins; they can end up with differing DNA methylation patterns,  typically characterized by sequencing. Buccal swabs were collected from five sets of MZ twins of differing ages, as well as from a full  sibling (non-MZ). All samples underwent DNA extraction, bi-sulfite treatment, amplification and then underwent high resolution melt curve analysis using a 7500 Fast Real-Time PCR machine,  targeting a section of the Alu-SP region and the promoter region of the E2F3 gene. Significantly different melting temperatures (Tm) were obtained in four of the five MZ twins of the  alu- SP samples, as well as in the non-MZ full sibling samples, and all 5 twin sets of samples  analysing the E2F3 fragment; thus indicating that a relatively cheaper faster test could be used to  differentiate between MZ twins in a forensic context.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Evaluating an mRNA based body fluid identification test using SYBR green fluorescent dye and real-time PCR\n", "abstract": " The requirement to have more definitive and wider ranging body fluid identification (BFID) tests has resulted in a range of mRNA based real-time PCR BFI assays utilising Taqman fluorescent dye. An attempt to make a reliable and cost effective BFI test utilising the alternative SYBR Green fluorescent dye was carried out. RNA was extracted from blood and saliva stains from both male and female donors, this was then reverse transcribed using M-MLV and random hexamers. Using real-time PCR, relative quantitation of blood and saliva specific markers was carried out on the cDNA from the blood and saliva samples using the SYBR® Green fluorescent dye. Melting curve analysis was also performed immediately following PCR amplification. The relative quantitation values were calculated using the formula 2-ΔΔCT and all samples were normalised to reference gene 18s rRNA. The results revealed good specificity for a number of markers using this chemistry, however some markers were undetected. Blood markers NCF2, SPTB, PBDG and saliva specific markers HTN3, SPRR1A, KRT4 and KRT13 were investigated. In the SYBR green studies, the most specific markers were NCF2, KRT4, KRT13 and SPRR1A, showing reproducible results in a number of studies. Blood marker SPTB also appeared to be specific to blood however the melt curve data for this marker in each study was questionable given the low melting temperature for the amplified products. Blood specific marker PBGD, and saliva specific marker HTN3 were not detected using SYBR Green and saliva marker STATH was detected however in each case appeared to be non-specific in …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Forensic microRNA (miRNA) analysis of skin specific markers\n", "abstract": " Conventional body fluid identification methods are typically presumptive tests. These tests have a large number of false positives and because of this they are not confirmatory. Messenger RNA (mRNA) profiling was developed as a body fluid identification method as it was determined that mRNAs are expressed in a tissue-specific manner. Unfortunately, given mRNA’s size (~200-300 nucleotides), using this technique may not be ideal for compromised or degraded samples often encountered in forensic casework1. MicroRNAs (miRNA) are small, non-protein coding RNA molecules approximately 22 nucleotides in length. The first miRNA was discovered by Rosalind Lee et al. in 1993, whilst studying the lin-14 gene in C. elegans development2. miRNAs are believed to control gene expression involved in metastasis, proliferation, apoptosis and differentiation3. A large number of cellular pathways are affected by the regulatory function of miRNAs; the most notable of these pathways control oncogenic and developmental processes. It has also been found that miRNA processing defects can enhance tumorigenesis4. Many people argue that there is no need to test for the presence of a specific body fluid as the analysis of any DNA present can confirm a body fluid is present. This is true, DNA won’t be present if a biological material isn’t present, but the confirmation of the body fluid could prove crucial in the investigation of a case. There is a need to identify skin alongside other body fluids within forensic investigations, especially sexual offences. For example, it is not currently possible to distinguish between vaginal material and skin cells from, for …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Identification and resolution of capability gaps in forensic science\n", "abstract": " Although forensic biology is a powerful tool in criminal investigations, there are a number of capability gaps; namely, the interpretation of low-level DNA mixtures, associating the DNA profile with a body fluid, and the issue of consent in sexual offences. A research strategy was developed that utilises whole genome amplification (WGA), messenger RNA and microRNA analysis, DNA profiling, and clothing damage analysis. An evaluation of a WGA technique – multiple displacement amplification - with and without a macromolecular crowding agent, indicated that this may be of use for DNA samples containing certain mixing ratios; however, for this to be truly of use, knowledge of the nature of the sample preanalysis is required, which is not feasible in a forensic environment. A SYBR Greenbased mRNA gene expression test was developed that was capable of distinguishing between saliva and blood by using relative quantitation on real-time PCR. However, the low specificity of the SYBR Green meant that a higher number of controls were required for this to work at forensic standard. A single channel simultaneous analytical test for DNA and microRNA was also developed, which meant that it could be possible to definitively identify the body fluid origin of a DNA profile. This represented a significant step forward in improving forensic biology capability. Reconstruction studies were carried out in response to a sexual assault case where consent was an issue. This study demonstrated that it was possible to cause significant damage to a bra without causing damage to the hook and eye fastening; thus, negating a hypothesis offered by the defence. A …", "num_citations": "1\n", "authors": ["834"]}
{"title": "EVALUATING THE EFFECT OF MULTIPLE DISPLACEMENT AMPLFICATION UPON LOW-LEVEL MULTIPLE SOURCE DNA PROFILES\n", "abstract": " The interpretation of low-level DNA mixtures, where there is DNA present from more than one individual in a sample, is of great difficulty. This can be due to the low-level nature of the result and the complexity inherent in DNA results with multiple sources. These two elements in one sample only further compound the difficulty. Multiple displacement amplification (MDA) techniques, with or without a macromolecular crowding (MDAMC) agent, have been suggested as potential tools for improving these results. The aim of this study was to investigate whether the proposed techniques could be of use to forensic genetics casework. Buccal swabs underwent extraction, and then mixtures of samples were prepared with a range of known mixing ratios, from 1: 1 through to 50: 1. These samples were split into three prior to undergoing standard DNA analysis, MDA or MDA-MC. DNA quantification was carried out using real-time PCR and the Human DNA Quantifiler kit, and STR analysis was carried out using the AMPfSTR NGMSElect kit. For each set of results, the mean mixing ratio was calculated and compared with the actual mixing ratio. The incorporation of MDA and MDA-MC did not sufficiently improve the mixed DNA results for all mixing ratios. Although there were significant improvements at mixing ratios of 10: 1 and 50: 1, this is insufficient, as knowledge of the actual mixing ratio prior to analysis is required. Consequently, as it stands, MDA and MDA-MC is not suitable for forensic casework. However, despite a range of actual mixing ratios from 1: 1 through to 50: 1, no mixing ratios above~ 10: 1 could be obtained, suggesting that this is the threshold at …", "num_citations": "1\n", "authors": ["834"]}
{"title": "The Use of Forensic Messenger RNA (mRNA) Analysis to Determine Stain Age\n", "abstract": " After attending this presentation, attendees will understand the principles of forensic mRNA analysis and learn how it may be used as a method to determine the age of biological stains found at crime scenes.  This presentation will impact the forensic science community by proposing a novel method for determining the age of biological stains. The proposed method could prove crucial for forensic casework and could run parallel to the predominant DNA analysis method. Where DNA analysis is used to identify a suspect, mRNA analysis could be used to determine the age of biological stains, that in turn could place the suspect at the scene of a crime at a specific time. RNA has been presumed to be very unstable, as one of its features is that it degrades rapidly as it is broken down by ribonucleases. In previous literature however; it has been shown that RNA may be extracted from biological stains up to 16-years-old. For stain age determination, it has been suggested that using a decay rate ratio, derived from two endogenous controls differentially expressed within the body fluid stain, should eliminate the effect of any external decomposition factors. This should then be expressed as a linear change in mRNA expression over time.  The majority of previous research concentrates on determining the age of bloodstains. In this study, blood and saliva stains were used. The goal of the study was to try to determine the age of these biological stains by isolating mRNA and quantifying the expression of housekeeping genes 18s, GAPDH, and ACTB also known as β-Actin. This study aims to demonstrate proof of principle and explore any limitations to a decay …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Boosting\n", "abstract": " The Boosting meta-algorithm is an eficient, simple, and easy-touse approach to building models. The popular variant called AdaBoost (an abbreviation for adaptive boosting) has been described as the \\best off-the-shelf classifier in the world\" (attributed to Leo Breiman by Hastie et al. (2001, p. 302)).", "num_citations": "1\n", "authors": ["834"]}
{"title": "Transforming Data\n", "abstract": " An interesting issue with the delivery of a data mining project is that in reality we spend more of our time working on and with the data than we do building actual models, as we suggested in Chapter 1. In building models, we will often be looking to improve their performance. The answer is often to improve our data. This might entail sourcing some additional data, cleaning up the data, dealing with missing values in the data, transforming the data, and analysing the data to raise its effciency through a better choice of variables.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Association Analysis\n", "abstract": " Many years ago, a number of new Internet businesses were created to sell books on-line. Over time, they collected information about the books that each of their customers were buying. Using association analysis, they were able to identify groups of books that customers with similar interests seem to have been buying. Using this information, they were able to develop recommendation systems that informed their customers that other customers who purchased some book of interest also purchased other related books.", "num_citations": "1\n", "authors": ["834"]}
{"title": "The Rattle Package: Quick Start Guide\n", "abstract": " Rattle (Williams, 2009) is a package written in R providing a graphical user interface to very many other R packages that provide functionality for data mining. This quick start guide is under development. See", "num_citations": "1\n", "authors": ["834"]}
{"title": "Nano-, pico-and femtosecond laser machining of bioabsorbable polymers and biomedical composites\n", "abstract": " In this work, bioabsorbable polymers and biomedical composites were machined with three different lasers. Laser micromachining of grooves were studied using nanosecond, picosecond, and femtosecond lasers. Profile measurements, topography, surface roughness, microstructure and quality of the samples were studied.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Frequency-based Rare Events Mining in Administrative Health Data\n", "abstract": " The low occurrence rate of adverse drug reactions makes it difficult to identify risk factors from a straightforward application of association pattern discovery in large databases. In this paper, we are interested in developing a data mining approach that can use the information about rare events in sequence data in order to measure the multiple occurrences of patterns in the whole period of target and non-target data. To address this, we define an interestingness measure which exploits the difference between the frequency of patterns in target and non-target sequence data. The proposed approach guarantees the easy generation of candidate patterns from the target sequence data by applying existing association mining algorithms. These patterns can then be evaluated by comparing their frequency in the target and non-target data. We also propose a ranking algorithm that takes into account both the rank of the patterns as determined by the interestingness measure and their supports in the target population. This algorithm can prune the patterns greatly and highlight more interesting results. Experimental results of a case study on Angioedema show the usefulness of the proposed approach.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Structural pattern discovery in time series databases\n", "abstract": " This study proposes a temporal data mining method to discover qualitative and quantitative patterns in time series databases. The method performs discrete-valued time series (DIS) analysis on time series databases to search for any similarity and periodicity of patterns that are used for knowledge discovery. In our method there are three levels for mining patterns. At the first level, a structural search based on distance measure models is employed to find pattern structures; the second level performs a value-based search on the discovered patterns using a local polynomial analysis; the third level, based on hidden Markov models (HMMs), finds global patterns from a DTS set. As a result, similar and periodic patterns are successfully extracted. We demonstrate our method on the analysis of “Exchange Rate Patterns” between the U.S. dollar and Australian dollar.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Advances in Artificial Intelligence. PRICAI 2000 Workshop Reader: Four Workshops Held at PRICAI 2000, Melbourne, Australia, August 28-September 1, 2000. Revised Papers\n", "abstract": " ThePaci'cRimInternationalConferenceonArti'cialIntelligence (PRICAI) is theleadingconferenceinthePaci'cRimregionforthepresentationofresearch andthelatestdevelopmentsinArti'cialIntelligence, includingtheapplication of AI to problems of social and economic importance. PRICAI 2000 was the sixthinthebiennialseriesofconferencesandwasheldinMelbourne, Australia, August28-September1, 2000. ThePRICAI2000workshopsweredesignedtoprovideaforumforrese-chersandpractitionerstopresentandexchangethelatestdevelopmentsatthe AIfrontier. Workshopsaremorespecializedandonasmallerscalethancon-rencestofacilitateactiveinteractionamongtheattendees. TheyencourageAI theoriestomeetreality, AIresearcherstoworkwithpractitioners, andviceversa. Throughworkshops, bothsidesgetexposuretoevolvingresearchandtools, and tothepracticalproblemstowhichAIcanbeapplied. Asanexcellentindicator ofthecurrentlevelofactiveresearchanddevelopmentactivities, PRICAI2000 includedatotalofsevenworkshops: AIandtheInternet, IntelligentInfor-tionAgents, ApplicationsofAIinIndustry, Multi-AgentSystems, TextandWeb Mining, AIinE-Commerce, andTeamswithAdjustableAutonomy. The work from four of the seven workshops has formed this unique coll-tion of four parts. PartI reports on Applications of AI in Industry; PartII coversAIinE-Commerce; PartIII detailsIntelligentInformationAgents, and PartIV discussestheissuesofTeamworkandAdjustableAutonomyinAgents. Eachworkshoppaperwasacceptedafterreviewbyatleasttwoexperts. Further improvementswereincludedinmanypapersinpreparationforthiscollection. Readerscan …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Optimal use of nitrogen stabilization package in sugarcane production to increase producer economic returns.\n", "abstract": " see more details and optimize yield and economic returns. Urea and the nitrogen stabilization packages were applied in a 4× 3 factorial study design (N rates were 0, 67, 134, and 201 kg N/ha, and calcium rates from the N stabilization package were 0, 22, and 44 kg Ca/ha) to the variety CP 65-357 on a Baldwin silty clay soil for four years. The optimal fertilization level was evaluated at alternative raw sugar prices prices Subject Category: Properties", "num_citations": "1\n", "authors": ["834"]}
{"title": "Non-contact temperature measurement in the steel industry\n", "abstract": " Temperature measurement is becoming increasingly important in the steel industry and for practical reasons most applications require a non-contact approach. This paper introduces a number of technologies and highlights their comparative advantages and disadvantages. The current state of development of each technology is outlined, and where appropriate, examples of their application in the steel industry are presented.", "num_citations": "1\n", "authors": ["834"]}
{"title": "The Blackdiscjockey as a cultural hero\n", "abstract": " The radio disc jockey wakes us in the morning, puts us to sleep at night, and in between, his time, weather and music announcements take us through the day. But the black disc jockey has been more than an announcer. He has transcended his job as a radio station employee and becomes in many cases, a cultural hero, an individual admired and respected for his work in the black community, his concern for his fellow man, and his ability to effectuate changes in society. This study compares early black disc jockeys (1940-50) with those of a later period (1960-80) to illustrate the various roles each group has played in the community. The earlier group was characterized by the music its members played (mostly jazz, blues, and later rhythm and blues), their language patterns, and their personalities. Their styles developed from the clash of urban and rural cultures that helped define their lives. These early black disc jockeys appealed to the lower class southern migrants by speaking their language and reminding them of “down home.” Today's black disc jockeys generally do not enjoy the prestige and status that the early jockeys did. What are the reasons for their diminished roles? Are black disc jockeys the cultural heroes they once were?The development and widespread use of formats on today's radio stations has been singled out as the major reason that\" personality” radio is no longer popular. Consequently, black disc jockeys say their influence on thought and action in the community is weak and their role as purveyors of cultural symbols, especially regarding language styles and the black experience, is circumscribed by the strait jacket of the …", "num_citations": "1\n", "authors": ["834"]}
{"title": "Angular distributions of channeled pions and protons up to 250 GeV/c\n", "abstract": " Channeling phenomena are observed for positive particles of momentum up to 250 GeV/c in a germanium crystal. The polar angular distributions of the channeled particles are compared with theoretical predictions based on a diffusion model. The results indicate that at high particle energy there may be additional mechanisms besides those operative at low energy leading to dechanneling of the particles. In spite of this, channeling effects are observed for particles incident at up to several times the critical angle, in contrast with the results from low energy channeling. Statistical equilibrium in the azimuthal angular distribution has also been observed at all measured beam momenta to about twice the calculated channeling critical angle. The breakdown of statistical equilibrium for the 2 cm crystal used occurs at an incident angle 2–3 times smaller than predicted theoretically.", "num_citations": "1\n", "authors": ["834"]}
{"title": "Angular distributions of 250 GeV/c positive particles axially channeled in germanium crystal\n", "abstract": " Channeling phenomena are observed for charged particles of momentum up to 250 GeV/c in a germanium crystal. The angular distributions of the channeled particles are compared with theoretical predictions based on a diffusion model. The results indicate additional mechanisms leading to dechanneling of the particles although channeling effects are observed for particles incident at up to several times the critical angle, in contrast with the results from low energy channeling.", "num_citations": "1\n", "authors": ["834"]}