{"title": "Tracking technical debt—An exploratory case study\n", "abstract": " The technical debt metaphor is increasingly being used to describe the effect of delaying certain software maintenance tasks on software projects. Practitioners understand intuitively how technical debt can turn into a serious problem if it is left unattended. However, it remains unknown how serious the problem is and whether explicit measurement and management of technical debt is useful. In this paper, we explore the effect of technical debt by tracking a single delayed maintenance task in a real software project throughout its lifecycle and simulate how explicit technical debt management might have changed project outcomes. The results from this study demonstrate how and to what extent technical debt affects software projects. The study also sheds light on the research methodologies that can be used to investigate the technical debt management problem.", "num_citations": "116\n", "authors": ["1333"]}
{"title": "Managing technical debt in practice: An industrial report\n", "abstract": " The Technical Debt (TD) metaphor has been used as a way to manage and communicate long-term consequences that some decisions may cause. However the state of the art in TD has not culminated yet in rigorous analysis models for large-scale projects. This work analyses an industrial project, from the perspective of its decisions and related events, so that we can better characterize the existence of TD and show the evolution of its parameters. The project in study had a life cycle of six years (2005-2011) and its data for analysis was collected from emails, documents, CVS logs, code files and interviews with developers and project managers. From this analysis, we identified the factors that had influence on the project decisions and their impact on the system along the time. Furthermore, we were able to extract a set of lessons associated with the characterization of TD in projects of this port.", "num_citations": "24\n", "authors": ["1333"]}
{"title": "An extraction method to collect data on defects and effort evolution in a constantly modified system\n", "abstract": " This paper describes a data extraction method that was carried out on a set of historical development documentation, related to a commercial software system for mobile platform. This method is part of a major project, which aims to identify evidences of technical debt via the analysis of the defect evolution and effort estimation deviation, verifying if there are relations between these concepts and project decisions during the cycles of development. We intend that a future analysis of such data supports the identification of patterns regarding specific decisions and variations of the defect number/frequency and effort deviation. Thus, such patterns could assist project managers during future project decisions, mainly regarding the maintenance and evolution stages.", "num_citations": "6\n", "authors": ["1333"]}
{"title": "Technical debt management in the context of agile methods in software development\n", "abstract": " TONIN, GS Gerenciamento de Dívida Técnica no Contexto de Desenvolvimento de Software Ágil. Thesis (Doctorate Degree)-Instituto de Matemática e Estatística, Universidade de São Paulo, São Paulo, 2018.", "num_citations": "3\n", "authors": ["1333"]}