{"title": "Alexa vs. Siri vs. Cortana vs. Google Assistant: a comparison of speech-based natural user interfaces\n", "abstract": " Natural User Interfaces (NUI) are supposed to be used by humans in a very logic way. However, the run to deploy Speech-based NUIs by the industry has had a large impact on the naturality of such interfaces. This paper presents a usability test of the most prestigious and internationally used Speech-based NUI (i.e., Alexa, Siri, Cortana and Google’s). A comparison of the services that each one provides was also performed considering: access to music services, agenda, news, weather, To-Do lists and maps or directions, among others. The test was design by two Human Computer Interaction experts and executed by eight persons. Results show that even though there are many services available, there is a lot to do to improve the usability of these systems. Specially focused on separating the traditional use of computers (based on applications that require parameters to function) and to get closer to real NUIs.", "num_citations": "276\n", "authors": ["2240"]}
{"title": "Automatic recognition of the American sign language fingerspelling alphabet to assist people living with speech or hearing impairments\n", "abstract": " Sign languages are natural languages used mostly by deaf and hard of hearing people. Different development opportunities for people with these disabilities are limited because of communication problems. The advances in technology to recognize signs and gestures will make computer supported interpretation of sign languages possible. There are more than 137 different sign languages around the world; therefore, a system that interprets them could be beneficial to all, especially to the Deaf Community. This paper presents a system based on hand tracking devices (Leap Motion and Intel RealSense), used for signs recognition. The system uses a Support Vector Machine for sign classification. Different evaluations of the system were performed with over 50 individuals; and remarkable recognition accuracy was achieved with selected signs (100% accuracy was achieved recognizing some signs …", "num_citations": "46\n", "authors": ["2240"]}
{"title": "Awareness supporting technologies used in collaborative systems: a systematic literature review\n", "abstract": " Since the establishment of Computer Supported Collaborative Work as a research area, computer advances have change the paradigm of how technology is applied to improve the performance in collaborative scenarios. Notifications are an important part of this improvement. Technological systems have been applied in order to provide collaborators with the sufficient awareness to keep a task going. In this paper we present the protocol and results of a Systematic Literature Review that delves in the application of new technologies to provide awareness in collaborative systems. Moreover, we classify the collaborative systems found in literature using two traditional taxonomies for CSCW in order to understand which notification mechanisms are used to support which systems. Our review covers the last 10 years and classifies system prototypes based on the context in which they are applied, the notification and …", "num_citations": "34\n", "authors": ["2240"]}
{"title": "User experience comparison of intelligent personal assistants: Alexa, Google Assistant, Siri and Cortana\n", "abstract": " Natural user interfaces are becoming popular. One of the most common natural user interfaces nowadays are voice activated interfaces, particularly smart personal assistants such as Google Assistant, Alexa, Cortana, and Siri. This paper presents the results of an evaluation of these four smart personal assistants in two dimensions: the correctness of their answers and how natural the responses feel to users. Ninety-two participants conducted the evaluation. Results show that Alexa and Google Assistant are significantly better than Siri and Cortana. However, there is no statistically significant difference between Alexa and Google Assistant.", "num_citations": "33\n", "authors": ["2240"]}
{"title": "Standardized questionnaires for user experience evaluation: A systematic literature review\n", "abstract": " Standardized questionnaires are one of the methods used to evaluate User Experience (UX). Standardized questionnaires are composed of an invariable group of questions that users answer themselves after using a product or system. They are considered reliable and economical to apply. The standardized questionnaires most recognized for UX evaluation are AttrakDiff, UEQ, and meCUE. Although the structure, format, and content of each of the questionnaires are known in detail, there is no systematic literature review (SLR) that categorizes the uses of these questionnaires in primary studies. This SLR presents the eligibility protocol and the results obtained by reviewing 946 papers from four digital databases, of which 553 primary studies were analyzed in detail. Different characteristics of use were obtained, such as which questionnaire is used more extensively, in which geographical context, and the size of the sample used in each study, among others.", "num_citations": "28\n", "authors": ["2240"]}
{"title": "Sign language recognition using leap motion\n", "abstract": " Several million people around the world use signs as their main mean of communication. The advances in technologies to recognize such signs will make possible the computer supported interpretation of sign languages. There are more than 137 different sign language around the world; therefore, a system that interprets those languages could be beneficial to all, including the Deaf Community. This paper presents a system based on a hand tracking device called Leap Motion, used for signs recognition. The system uses a Support Vector Machine for sign classification. We performed three different evaluations of our system with over 24 people.", "num_citations": "18\n", "authors": ["2240"]}
{"title": "Human aspects of ubiquitous computing: a study addressing willingness to use it and privacy issues\n", "abstract": " Identifying the human aspects related to ubiquitous systems focused on people’s willingness to use them and privacy concerns was our goal. We selected two ubiquitous systems: a wearable system (Google Glass) and an embedded in context system (Smart Environments). An online survey, with more than 400 participants, which included questions about how people perceive privacy issues related to the use of these two different ubiquitous systems, was conducted. Results show that privacy is not the only factor defining predisposition or aversion towards using ubiquitous systems. Financial, risk, and convenience factors are the others. We discovered that the importance of these factors on the decision to use them or not depends on the system. Regarding privacy, Google Glass generates a higher degree of concern than the Smart Environments alternative. Female participants tend to be more worried than …", "num_citations": "17\n", "authors": ["2240"]}
{"title": "Smartness and technical readiness of Latin American Cities: A critical assessment\n", "abstract": " In almost every forum around the world, country leaders are discussing over the necessity of building smart cities. However, even the term “smart city”is diffuse nowadays. Some countries want their cities to become smarter, and others want to create smart cities from scratch. Several mappings have been developed around the world to locate the smartest cities. We believe that, since Latin American and Caribbean countries are exploring the possibility of creating smart cities, proper mappings and plans are necessary to assure that the efforts are not a waste. Using a literature review and a survey, we try to determine the state of smart cities development and its technical readiness in the region. The survey results convey that the perceived level of smartness of cities was low to average, and the potential benefits of becoming smart were evident. Despite perceptions being so positive about smart cities viability, some …", "num_citations": "11\n", "authors": ["2240"]}
{"title": "Smart cities in Latin America\n", "abstract": " In almost every forum around the world, country leaders are discussing the necessity of creating smart cities. However, even the term “smart city” is diffuse nowadays. Some countries want their cities to become smarter and others want to create smart cities from scratch. Several mappings have been developed around the world to locate the smartest cities. We believe that, since Latin American and Caribbean countries are exploring in the creation of smart cities, a proper mapping and plan is necessary to assure that the efforts in creating smart cities are not a waste. Using a literature review and a survey, we try to determine the state of smart cities development and its technical readiness in the Region.", "num_citations": "10\n", "authors": ["2240"]}
{"title": "A mobile application that allows children in the early childhood to program robots\n", "abstract": " Children born in the Information Age are digital natives; this characteristic should be exploited to improve the learning process through the use of technology. This paper addresses the design, construction, and evaluation process of TITIBOTS, a programming assistance tool for mobile devices that allows children in the early childhood to create programs and execute them using robots. We present the results of using TITIBOTS in different scenarios with children between 4 and 6 years old. The insight obtained in the development and evaluation of the tool could be useful when creating applications for children in the early childhood. The results were promising; children liked the application and were willing to continue using it to program robots to solve specific tasks, developing the skills of the 21st century.", "num_citations": "9\n", "authors": ["2240"]}
{"title": "Human–objects interaction: A framework for designing, developing and evaluating augmented objects\n", "abstract": " The processes to design, develop, and evaluate augmented objects are complex and should adhere to a Software Engineering methodology with a user-centered approach. This article presents a framework for creating augmented objects focused on the interaction of the final users with these objects. The article applies the framework in three cases of study: an augmented Post-it note for important e-mail notifications, an augmented pajama for capturing vital signs on infants, and an augmented door that is able to capture and send messages when the user is out of office.", "num_citations": "9\n", "authors": ["2240"]}
{"title": "Notifications for collaborative documents editing\n", "abstract": " In a collaborative writing session one of the most important activities is the notification to all the collaborators about changes in documents (data awareness). In this paper we propose the use of an augmented object as the mechanism to notify changes in shared documents. In this way, collaborators can be aware of modifications even if they are not in front of the computer. A prototype was implemented and evaluated. The augmented object prototype can be used with the Google Docs suite, which permits the collaborators to work in a distributed and asynchronous way.", "num_citations": "8\n", "authors": ["2240"]}
{"title": "Technical debt in Costa Rica: an InsighTD survey replication\n", "abstract": " InsighTD is a globally distributed family of industrial surveys on causes and effects of Technical Debt (TD). We are currently analyzing the data gathered from the independent replication of the questionnaire in Costa Rica. In total, 156 professionals from the Costa Rican software industry answered the survey. Initial results indicate that there is a broad familiarity with the concept of TD. For the examples reported, it seems that the type of TD were product of situations that could have been prevented. TD was monitored for slightly more than half of cases, and TD was not paid in most cases. In future articles, we will report causes and the effects of TD in Costa Rica.", "num_citations": "7\n", "authors": ["2240"]}
{"title": "Ubiquitous notification mechanism to provide user awareness\n", "abstract": " Awareness could be defined as the knowledge that the user has of a particular activity, either individual or collaborative. Good awareness mechanisms provide information to the user at the right time so that s/he can know what is required for her/him to do before s/he is required to do it. Notification mechanisms are a key factor to provide awareness. Ubiquitous technologies can change the paradigm in which notifications are delivered to users. This paper describes the concept and characteristics of awareness, and how researchers have applied different notification mechanisms to provide it. With the lessons learned from 4 project implementations, we propose a service-based plug-and-play framework that models different notification mechanisms that could be used to provide user awareness.", "num_citations": "7\n", "authors": ["2240"]}
{"title": "Design and implementation of a software testing training course\n", "abstract": " Design and Implementation of a Software Testing Training CoursePurpose & ContextThis paper presents the design and implementation of a software testing training course forsoftware developers with little or no background on software testing. The design of thistraining course is modular, so that it can be adapted to different industry needs. The firstmodule is a theoretical course that comprises the fundamentals of software testing andquality, as well as testing types, levels and design techniques. The second module is apractical hands-on workshop where students apply the theoretical concepts from the firstmodule using a specialized test tool that supports the entire testing process. Each of thesemodules consists of 18 hours, for a total of 36 training hours. The training was given to a small group of developers who work in a software developmentunit at our university. For the first module there were eigth participants and one instructor; for the second module there were nine participants and two instructors. Mandatoryattendance was required to successfully complete the training. Assessment MethodsOur design and implementation of the training course was assessed from three differentpoints of view: the trainer’s, the trainee’s, and the manager’s. The trainer’s perspective takesinto account the views of the three training instructors. A qualitative assessment of thetraining based on the observed strengths and limitations was performed, as well as anassessment of the importance (usefulness) of the main topics in the training. The trainee’sperspective includes a self assessment of the trainee’s capability (level of expertise acquired) in each of the …", "num_citations": "7\n", "authors": ["2240"]}
{"title": "Use of tangible interfaces to support a literacy system in children with intellectual disabilities\n", "abstract": " People with intellectual disabilities should develop reading and writing skills since children. Otherwise, they will have additional difficulties in their daily life activities, as buying in a store, taking medicaments or getting a job. In this paper we present a prototype that uses tangible interfaces and augmented objects to support a literacy method for children with intellectual disabilities. The prototype was evaluated and the preliminary results showed that the system can not only assists teachers in the classroom, but also helps to better manage the interaction with children and non-traditional interfaces.", "num_citations": "7\n", "authors": ["2240"]}
{"title": "Smart device-based notifications: A survey on user’s satisfaction of traditional notification mechanisms\n", "abstract": " Notifications represent a key element in smart devices. In fact, a device could be considered “smart” if it is able to provide different type of messages or notifications to the users. In this way, people who use smart devices receive a significant number of notifications daily. However, how many notifications can a user receive and attend daily? If the number of notifications increases a lot, it is possible that the user experience decrease. In this article, a study is carried out on the level of user’s satisfaction related to the number of notifications received in different smart devices. To achieve this goal, a survey was applied taking into consideration the following devices: smart speaker, smart fridge, smart TV, smart watch, smart phone, and car’s integrated computer system. The study comprises the participation of 439 people from 8 countries.", "num_citations": "6\n", "authors": ["2240"]}
{"title": "Designing tools that allows children in the early childhood to program robots\n", "abstract": " This paper describes the design and evaluation process of two mobile programming assistance tools that allow children in the early childhood to develop programs and execute them using robots. The tools are called TITIBOTS and TITIBOTS Colab which incorporates collaboration. The tools have icon-based interfaces and integrate visual programming, robotics, and mobile devices as one tool. The main issues and lessons learned during the design process are described. The methodology used in this project was User-Centered Design (UCD) process. The tools were developed and evaluated applying participatory-design, experience prototyping, and usability testing. The final product are two simple, intuitive, and easy to use tools, for children between 4 and 6 years old. The results were promising: children liked the applications and were willing to continue using it to program robots for solving specific …", "num_citations": "6\n", "authors": ["2240"]}
{"title": "An augmented object prototype for helping to prevent the sudden infant death syndrome\n", "abstract": " The Sudden Infant Death Syndrome causes unexpected death of infants. Some of the risk factors are related to the prone or side sleeping, ambient temperature and bedclothes overhead, among others. We state that some of these risk factors can be sensed using an augmented object in the bedclothes of the infants, and that the collected information can be sent to an adult through a mobile application. In this paper we present a prototype with sensor-base interfaces that can prevent the Sudden Infant Death Syndrome.", "num_citations": "6\n", "authors": ["2240"]}
{"title": "Designing a technical debt visualization tool to improve stakeholder communication in the decision-making process: A case study\n", "abstract": " Technical debt is the release of immature software to meet time to market. In large complex companies, technical dept drives IT decision, even when participants in the decision-making process do not realize it. In this paper, we propose technical debt visualizations that can serve as a communication platform between different stakeholders. We conducted a case study in a large multi-industry state-owned company that faces significant challenges due to global digital transformation, its rigid control structures, and external pressures for cost reduction and investment optimization. In this study, we designed and evaluated technical debt visualizations to get feedback concerning its usefulness and ease its future acceptance. The results from this case study show that technical debt visualizations were considered useful for decision-making processes associated with software life cycle, especially for executives …", "num_citations": "5\n", "authors": ["2240"]}
{"title": "Using non-traditional interfaces to support physical therapy for knee strengthening\n", "abstract": " Physical therapy consists mainly in the execution of rehabilitation processes that aim to help overcome injuries, as well as develop, maintain, or restore maximum body movement. Knee rehabilitation is one kind of physical therapy that requires daily exercises which could be considered monotonous and boring by the patients, discouraging their improvement. This is coupled with the fact that most physical therapists assess exercise performance through verbal and visual means with mostly manual measurements, making it difficult to constantly verify and validate if patients perform the exercises correctly. This article describes a physical therapy monitoring system that uses wearable technology to assess exercise performance and patient progress. This wearable device is able to measure and transfer the movement’s data from the patient’s limb to a mobile device. Moreover, the user interface is a game …", "num_citations": "5\n", "authors": ["2240"]}
{"title": "Troyoculus: An Augmented Reality System to Improve Reading Capabilities of Night-Blind People\n", "abstract": " Our goal in this project was to develop an augmented reality system, called Troyoculus, to help night-blind people improve their reading capabilities. We developed two prototypes, one based on Oculus Rift and other based on a smartphone. We tested both prototypes using three variables: distance between the subject and the reading target, amount of light in the reading area, and font size. Two subjects participated in the testing. Results show an average improvement of at least 6 % points in reading performance and a maximum improvement of 43 % points using Oculus Rift at 12 lux. Test results of both prototypes were better than when subjects were not using any device.", "num_citations": "5\n", "authors": ["2240"]}
{"title": "Software development practices in costa rica: A survey\n", "abstract": " In recent years, many studies have focused on software development practices around the world. The HELENA study is an international effort to gather quantitative data on software development practices and frameworks. In this paper, we present the Costa Rican results of the HELENA survey. We provide evidence of the practices and frameworks used in 51 different projects in Costa Rica. Participants in this survey represent companies ranging from 50 or fewer employees to companies with more than 2500 employees. Furthermore, the industries represented in the survey include software development, system development, IT consulting, research and development of IT services and software development for financial institutions. Results show that Scrum, Iterative Development, Kanban and Waterfall are the most used software development frameworks in Costa Rica. However, Scrum doubles the use of …", "num_citations": "4\n", "authors": ["2240"]}
{"title": "Smart device-based notifications to promote healthy behavior related to childhood obesity and overweight\n", "abstract": " Obesity is one of the most serious public health challenges of the 21st century and it is a threat to the life of people according to World Health Organization. In this scenario, family environment is important to establish healthy habits which help to reduce levels of obesity and control overweight in children. However, little efforts have been focused on helping parents to promote and have healthy lifestyles. In this paper, we present two smart device-based notification prototypes to promote healthy behavior with the aim of avoiding childhood overweight and obesity. The first prototype helps parents to follow a healthy snack routine, based on a nutritionist suggestion. Using a fridge magnet, parents receive graphical reminders of which snacks they and their children should consume. The second prototype provides a graphical reminder that prevents parents from forgetting the required equipment to practice sports. Prototypes were evaluated by nine nutritionists from three countries (Costa Rica, Mexico and Spain). Evaluations were based on anticipation of use and the ergonomics of human–system interaction according to the ISO 9241-210. Results show that the system is considered useful. Even though they might not be willing to use the system, they would recommend it to their patients. Based on the ISO 9241-210 the best ranked features were the system’s comprehensibility, the perceived effectiveness and clarity. The worst ranked features were the system’s suitability for learning and its discriminability. View Full-Text", "num_citations": "4\n", "authors": ["2240"]}
{"title": "Characterizing Ubiquitous Systems Privacy Issues by Gender and Age\n", "abstract": " Characterizing ubiquitous systems privacy issues by gender and age was our goal. We selected two ubiquitous systems: a wearable system (Google Glass) and an embedded in context system (Smart Office). An online survey, with 400+ participants, which included questions about how people perceive privacy issues related to the use of these two different ubiquitous systems, was conducted. Results show that Google Glass generates a higher degree of concern than the Smart Office. Female participants tend to be more worried than male, independently of the ubiquitous system considered. Finally, the youngest participants (16 to 25 years old) are the most concerned about privacy threats, which was unexpected.", "num_citations": "4\n", "authors": ["2240"]}
{"title": "Making the Physical Therapy Entertaining\n", "abstract": " In physical therapy, goniometers are used to measure limb movement during restoration exercises. These devices aren’t always readily available to therapists, and the exercises themselves are monotonous and offer little motivation for the patients. We have developed a low-cost device prototype we’ve tested in knee rehabilitation exercises, and developed a framework with which a mobile application can use gathered data from said device, such as is the case of an example game also addressed here, intended to increase patient motivation and commitment when exercising.", "num_citations": "4\n", "authors": ["2240"]}
{"title": "A gesture-based interaction approach for manipulating augmented objects using leap motion\n", "abstract": " Ambient Intelligence and Ubiquitous Computing are carrying the world to a reality where almost every object interacts with the environment, either via sensors or actuators, and users must learn how to interact with such systems. This paper presents a gesture-based interaction approach to manipulate such objects. We developed a prototype using a leap motion controller as a hand-tracking device, and a Support Vector Machine as a classifier to distinguish between gestures. Our system was evaluated by 12 users with over 10 commands. We also show a review on gesture-based interaction and compare other proposals with ours.", "num_citations": "4\n", "authors": ["2240"]}
{"title": "Cloud management platform selection: A case study in a university setting\n", "abstract": " Cloud Computing has gained importance in recent years. There are many implementations’ analyses and evaluations of Cloud Management Platforms (CMPs) in the literature. Moreover, the context and characteristics differ drastically between implementations, depending on the user requirements and usage context. This paper presents a case study of the process we followed to select a Cloud Computing management platform to be deployed in a University. Administrative and academic requirements were gathered and studied to define the most appropriate platforms. We present an overview of available CMPs. Moreover, we show a set of comparison criteria that could be used to determine which CMP adapts best to the cloud deployment scenario.", "num_citations": "4\n", "authors": ["2240"]}
{"title": "UX Evaluation with Standardized Questionnaires in Ubiquitous Computing and Ambient Intelligence: A Systematic Literature Review\n", "abstract": " Background. Standardized questionnaires are well-known, reliable, and inexpensive instruments to evaluate user experience (UX). Although the structure, content, and application procedure of the three most recognized questionnaires (AttrakDiff, UEQ, and meCUE) are known, there is no systematic literature review (SLR) that classifies how these questionnaires have been used in primary studies reported academically. This SLR seeks to answer five research questions (RQs), starting with identifying the uses of each questionnaire over the years and by geographic region (RQ1) and the median number of participants per study (how many participants is considered enough when evaluating UX?) (RQ2). This work also aims to establish whether these questionnaires are combined with other evaluation instruments and with which complementary instruments are they used more frequently (RQ3). In addition, this review intends to determine how the three questionnaires have been applied in the fields of ubiquitous computing and ambient intelligence (RQ4) and also in studies that incorporate nontraditional interfaces, such as haptic, gesture, or speech interfaces, to name a few (RQ5). Methods. A systematic literature review was conducted starting from 946 studies retrieved from four digital databases. The main inclusion criteria being the study describes a primary study reported academically, where the standardized questionnaire is used as a UX evaluation instrument in its original and complete form. In the first phase, 189 studies were discarded by screening the title, abstract, and keyword list. In the second phase, 757 studies were full-text reviewed …", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Technical debt in costa rica: An insightd survey replication\n", "abstract": " InsighTD is a globally distributed family of industrial surveys on causes and effects of Technical Debt (TD). We are currently analyzing the data gathered from the independent replication of the questionnaire in Costa Rica. In total, 156 professionals from the Costa Rican software industry answered the survey. Initial results indicate that there is a broad familiarity with the concept of TD. For the examples reported, it seems that the type of TD were product of situations that could have been prevented. TD was monitored for slightly more than half of cases, and TD was not paid in most cases. In future articles, we will report causes and the effects of TD in Costa Rica.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "User Experience Evaluation of Voice Interfaces: A Preliminary Study of Games for Seniors and the Elderly\n", "abstract": " Maintaining high cognitive activity is vital for the mental health of seniors. Taking part in leisure activities is an exciting and gratifying way to accomplish this, with video games having several advantages for this use. The present study is a work in progress to develop different digital games with natural voice interfaces that can be easily and pleasantly used by older adults to stimulate their cognitive needs. A Wizard of Oz with two different games was developed to evaluate the user experience perceived when using such applications. Positive results enhance the notion that using digital games powered by natural voice interfaces may appeal to the elderly, while stimulating their cognitive processes, thus fortifying their mental health.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Teaching Scrum Using Gamification\n", "abstract": " Teaching Scrum is a complex task in an academic setting. However, it is even more complex when it is taught in an industrial setting. This paper presents our experiences in the implementation of two different Scrum training workshop for workers. We have evaluated and improved these workshops over the past two years. More than 450 trainees with little or no background on Scrum receive the workshop. Furthermore, we present the implementation of three educational devices that automate activities in the context of this workshop. The automation aims to liberate some operative charge from the trainer to allow them to focus on the learning points and explanations of the activities rather than keeping track of the results of the participants.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Improving Packaging Design Using Virtual Reality in the Market Research Process\n", "abstract": " Market research is important because every company wants to stand out from their competitors. However, there are well-known weaknesses of traditional market research methods. This research presents a virtual reality system that aims to improve the quality of the data collected in marketing research. The system was designed and developed using Human–Computer Interaction techniques like iterative design, storyboards and prototypes. One hundred and twenty eight participants were involved in this research. Thirty five computer science graduate students, and twelve marketing professors validated the idea through a storyboard. Adjectives like innovative, useful and interesting were used by the participants to refer to the idea presented. Furthermore, eighty one marketing graduate students validated the prototype’s user experience and usability using the AttrakDiff survey. Unquestionably, 100% of the participants agreed that the prototype could help improve market studies of product packaging design. In addition, 99% of the participants said that they would use the prototype when executing market research of product packaging design.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Agile for newbies: A scrum workshop design and implementation process\n", "abstract": " “Scrum is simple to understand but difficult to master”. This paper describes our efforts in designing and testing a 16-h Scrum workshop that provides an overview of Scrum´s core concepts. The workshop is intended for participants with little or no background on Scrum. Designed by four certified scrum masters, this workshop combines different practices gathered from a series of training and day to day applications of Scrum. We have tested and improved the workshop described in this paper in 5 iterations over the past two years. Feedback from participants and improvements proposed by instructors were incorporated. The workshop combines theoretical knowledge and practical activities to help participants interiorize the theory. The design of this workshop is modular so that it can be adapted to different participant´s needs. Activities are designed to be developed in workshops with 15 participants.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Multiplatform career guidance system using IBM Watson, Google Home and Telegram\n", "abstract": " Even with the availability of several tests to provide clarity in choosing our career path, the decision remains a tough one to undertake. Most of the available tests are either monotonous, resulting in a tedious effort to go through them entirely, or are just plain boring. In this paper, however, we present a new and different approach to career guidance systems. We use Google home as a speech-based interface and Telegram as a text-based interface to generate a conversation between the users and a bot for career guidance. The idea is to provide an easy and friendly interface with an interactive user experience while gathering the required data to provide career guidance. To evaluate the system, we used the University of Costa Rica’s Computer Science and Informatics Department scenario. In this scenario, students must decide between three possible emphases: Software Engineering, Information …", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Developing a proxy service to bring naturality to amazon’s personal assistant “alexa”\n", "abstract": " Amazon’s Alexa is an intelligent personal assistant, developed to be used jointly with a Bluetooth Speaker and microphone hardware called Amazon Echo. Even though Alexa is supposed to be a natural user interface, its use is not very natural. As a user is intending to use Amazon’s Alexa system, they must follow a very tighten and structured way to provide the commands for the system to achieve its goal. In this paper, we propose a proxy service called “Plis”. This service was developed as a Skill to be used with the Amazon Echo. Therefore, a user can say: Alexa, “plis” and our functionality will start its job. Our skill determines from the natural way in which the user speaks what they are asking for. With that information, we create a query that would be further sent to other skills already providing the functionality required.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Building a Personalized Cancer Treatment System\n", "abstract": " This paper reports the process by which a personalized cancer treatment system was built, following a user-centered approach. We give some background on personalized cancer treatment, the particular tumor chemosensitivity assay supported by the system, as well as some quality and legal issues related to such health systems. We describe how Contextual Design was applied when building the system. Contextual design is a user-centered design technique involving seven steps. We also provide some details about the system implementation. Finally, we explain how the Think-Aloud protocol and Heuristic Evaluation methods were used to evaluate the system and report its results. A qualitative assessment from the users perspective is also provided. Results from the heuristic evaluation indicate that only one of ten heuristics was missing from the system, while five were partially covered and four were …", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Professional Career of Women Graduates in Computing in Costa Rica: a Generational Study\n", "abstract": " The evolution in women´s professional career in computing has been studied very little. In a previous study (LAWWCC 2016) we reported results of an exploratory study that aimed to characterize the professional development model of people that studied Computer Sciences in Costa Rica, in terms of roles and industrial sectors with which they began their professional career and in which they report are currently working.. Surprisingly, no important gender differences were depicted amongst men and women. As a result, some valid concerns were raised regarding the question: do the results represent the behavior of women in all professional career stages? As a result, in this study, results are now grouped by generations. The aim of this study is to determine whether there are differences in these variables in the professional career evolution for different generations. Results are obtained from an online survey responded by 166 women professionals in Computer Sciences. Women are grouped in four generational categories: baby boomers, generation X, young and mature millennials. The main finding of this research is that the professional evolution of women, with respect to the role and sector in which they perform, revel different behaviors for women of different generations.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Development and evaluation of augmented object prototypes for notifications in collaborative writing environments\n", "abstract": " In Ubiquitous Computing, augmented objects refer to those elements of the real world which have been provided with computational capabilities to meet a specific need. Meanwhile, Collaborative Writing Environments (CWE) allow groups of people to work together and increase the chances of success and share knowledge when they are working on shared documents. An extremely important aspect in CWEs is notification mechanisms as these are essential to provide users awareness about the collaborative work they are doing. In this paper, we describe a set of augmented objects created to support the notification in CWEs; these objects can improve the way in which the notifications are delivered to users, according to the writing strategy defined by the collaboration team.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Supporting phobia treatment with virtual reality: systematic desensitization using oculus rift\n", "abstract": " An irrational fear is called a phobia. Cognitive therapy teaches patients how to respond to triggering stimuli, by relaxing their mind and entering a state of reduced anxiety. Some of these methods depend on patient’s imagination, since putting them in the situation or the object that triggers the anxiety (airplanes, spiders, public speaking, and dinosaurs) might be difficult. Our project proposes an interactive virtual reality system that enhances both the visual and hearing parts of the therapy, putting the patient in a virtual world where they can learn the proper techniques to learn how to respond to the anxiety triggers. We call our system VRPhobia. A prototype was created and it was evaluated with the aid of Cognitive Psychology therapists. The system takes into account the techniques used by the therapists and the training that the patient goes through. It works as a tool that enhances the therapy process.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Towards smart notifications-an adaptive approach using smart devices\n", "abstract": " The use of smart devices is increasing rapidly; this trend is changing the paradigm in which notifications are delivered to users. Smart devices are important to provide user awareness. However, their use must be controlled and human perception should be considered to avoid information overload. In this paper, we present a dynamic mechanism to coordinate the distribution of notification across smart devices. This personalized notification mechanism uses an inference engine and a set of rules to generate notification alternatives and select the “best” one. A continuous refinement approach is also used to improve notification delivery. Our system was evaluated and the baseline rules were established by 11 expert users. The main results show that in some scenarios, the notification mechanism selection converged quickly and results are promising. However, further work is required to provide not only …", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Application of GQM+Strategies in a Multi-industry State-Owned Company\n", "abstract": " Technological applications have an increasingly important role in most companies. Investment in Information Technologies (IT) is also growing in most of them. The need to align IT-related goals with the company’s strategic goals becomes imperative. GQM+Strategies is an approach to align organizational goals, strategies, and measurements at different levels of an organization. This paper describes experiences learned from a GQM+Strategies implementation at a large multi-industry state-owned company. The implementation was conducted by an academic research team joined by representatives of the company. Results showed an improved alignment and integration of different goals. Moreover, a holistic goal visualization was achieved, even though the company works in two different industries. As a state-owned company, external pressures force continuous planning. Sometimes, inadvertently …", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Web Accessibility for People with Reduced Mobility: A Case Study Using Eye Tracking\n", "abstract": " Traditional web interfaces often rely on keyboard/mouse input to work. This characteristic forces people with reduced mobility to adapt or do not use the applications at all. This paper proposes a prototype to increase web accessibility for people with reduced mobility. Our prototype proposes an eye gaze based interaction between the user and web browsers displaying a web site (compliant with the web content accessibility guidelines proposed by the World Wide Web Consortium). We implemented a plug-in that adds functionality to allow user navigation, cursor control and text input.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Application of GQM+ Strategies in a small software development unit\n", "abstract": " GQM+Strategies is an extension of the Goal-Question-Metric method that focuses on filling the vertical gaps in organizations in order to facilitate the alignment of levels. In this case study, we applied GQM+Strategies in small software organization to define its metric program. We describe how a set of metrics was devised using this methodology and show the implementation results.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Use of Microsoft Testing Tools to Teach Software Testing: An Experience Report\n", "abstract": " Use of Microsoft Test Tools to Teach Software Testing: An Experience ReportPurpose & ContextThis paper reports our experience using Microsoft test tools in both graduate andundergraduate Software Testing courses for three semesters. Both are 4-credit-hour courses, with 64 hours of class time in a 16-week semester. The main objective of these courses is toprovide students with a practical introduction to software testing processes, techniques, andactivities within the context of quality assurance. In particular, the tools we used were Microsoft Visual Studio Ultimate 2010 (which includesMicrosoft Test Manager 2010) and Microsoft Team Foundation Server 2010. These toolswere chosen because they provide an integrated and comprehensive suite for the applicationlifecycle management, including test planning, authoring, automation, execution, tracking, monitoring and managing. Assessment Methods & FindingsOur approach of incorporating Microsoft test tools in the course was assessed from thestudents’ and teacher’s perspective. The students’ perspective was obtained from a survey. The teacher’s perspective consisted in a qualitative assessment of strengths and limitationsas well as a list of lessons learned. The main advantage of having such integrated tool suite to support a course is that studentsare able to put into practice the different concepts and facets of the testing process within asingle environment (IDE), with the consequent benefit of minimizing the learning curve andallowing full traceability from user stories to tasks to test cases to automation to bugs (whichwould be cumbersome if different tools were used for different facets of …", "num_citations": "3\n", "authors": ["2240"]}
{"title": "Development and evaluation of an augmented object for notifications of particular emails\n", "abstract": " Email is an essential tool for most of the people. However, the amount of messages, including spam, we receive every day complicates our ability to concentrate on messages we consider important. In this project we design and develop a prototype of an augmented object that notifies users when important mail arrives. The process of design, development and testing is described and discussed in this paper.", "num_citations": "3\n", "authors": ["2240"]}
{"title": "A conceptual framework for smart device-based notifications\n", "abstract": " The amount of information available for a person at a given time is growing at a disproportioned rate. Moreover, smart devices are becoming more and more popular. To avoid that human’s attention becomes a bottleneck and improve the number of notifications delivered to users, we believe that smart devices could serve as notifications mechanisms. This paper summarizes and concludes the efforts of a research project focusing on the use of smart devices as notification mechanisms. The goal of the framework is to assist researchers and developers in the conceptualization of smart device-based notifications. Furthermore, this paper presents the results of three evaluations. First, it describes the results of a survey on the need for novel notification mechanisms and the utility of smart devices as notification delivery mechanisms. Second, the results of a quantitative assessment on the impact of notifications delivered …", "num_citations": "2\n", "authors": ["2240"]}
{"title": "Smart Meeting Room Management System Based on Real-Time Occupancy\n", "abstract": " This paper proposes the creation of a smart meeting room through the incorporation of a PIR sensor and an AWS IoT button that allows the booking system to reflect a more precise availability of meeting rooms according to the actual occupancy status. The Internet of Things (IoT) devices are controlled using a Wi-Fi module that allows them to connect to the REST web service and to integrate with the open source Meeting Room Booking System (MRBS). In order to evaluate the system a storyboard evaluation was conducted with 47 participants. All participants filled out the User Experience Questionnaires (UEQ), described the product using three words and expressed their opinion through open comments. Finally, 19 participants took part in a real-life simulation of the smart meeting room and evaluated the system using the UEQ questionnaire. Based on the positive acceptance reflected in the evaluations, results …", "num_citations": "2\n", "authors": ["2240"]}
{"title": "Human factors affecting the development of smart device-based notifications\n", "abstract": " Ambient Intelligence (AmI) promotes a world in which almost every device has computational capabilities. Such devices will allow a natural user interaction with the digital world. In addition, in several contexts developers have used smart devices to gather information of the user and provide notifications. The system consists of three main modules: one for data collection, one for analysis and decision-making, and one information deploying. More importantly, we conducted a questionnaire and the used the results as basic rules for the decision-making module on the system. The questionnaire had 60 respondents.", "num_citations": "2\n", "authors": ["2240"]}
{"title": "Supporting User Awareness Using Smart Device-Based Notifications\n", "abstract": " This paper provides an overview of a doctoral research project which focuses in developing a framework to allow smart device-based notifications to provide user awareness. Notifications are mechanisms by which the user’s attention is driven to specific tasks or events. Notifications should provide a balance between intrusiveness and value in order to avoid annoyed users. The results reported in this paper include 50 % of the overall results expected for the project. The first step was to conduct a systematic literature review assessing the use of smart devices to deliver notifications, the second step was the development of a framework to allow notification coordination among smart devices and the third result is a laboratory case study assessing the framework. Future work includes two case studies in real scenarios and further analysis of usage patterns identified during this research.", "num_citations": "2\n", "authors": ["2240"]}
{"title": "Use of emerging 3D printing and modeling technologies in the health domain\n", "abstract": " Three-Dimensional (3D) technologies emerged from the technological advances in manufacturing required to produce physical versions of digital models. The most attractive feature of 3D technologies is that virtual models are easy to mold, and custom-made items can be physically produced. Health domains are areas in which 3D technologies have been applied, and several studies have been conducted assessing the usefulness of such technologies in those domains. In this paper we present the results of a Systematic Literature Review (SLR) on the applications of 3D technologies in the health domain. Discussion from the revision of 33 papers is presented. The main finding of this SLR is that none of the available research papers are focused on computer science related areas (i.e., all papers are published by doctors or researchers in Medicine). Moreover, all the included papers were published in …", "num_citations": "2\n", "authors": ["2240"]}
{"title": "GQM+Strategies and IDEAL: A Combination of Approaches to Achieve Continuous SPI\n", "abstract": " GQM+Strategies is an approach that aligns the business goals at each level of an organization to strategies and assesses the achievement of goals. The IDEAL model is an organizational improvement model. In this paper, we present our experiences applying the IDEAL model and GQM+Strategies to conduct continuous software process improvement (SPI) and establish a measurement program in a large multi-industry state-owned company. Our goal is to provide evidence of the use of these methods and models in such complex scenarios. The motivation for this paper was the lack of “from the trenches” perspectives on SPI in this kind of contexts. The main challenges faced during the experiences reported in this paper include: rigid control structures used to manage and monitor IT investment, inadequate or incomplete use of other measurement methods, and lack of continuous improvement culture (due …", "num_citations": "2\n", "authors": ["2240"]}
{"title": "Alternative and augmentative communication for people with disabilities and language problems: an eye gaze tracking approach\n", "abstract": " Alternative and augmentative communications encapsulates the use of technology to provide communication means for people with some sort of disability. In this paper, we present a prototype that provides both pictographic and alphabetic options to allow communication. Our system was originally designed for people that suffer physical disabilities and are not able to move their body. To allow interaction we provide an eye gazed based interaction. Our system was evaluated with an experienced test subject, because the system requires training to be used. However, evaluations results demonstrated that a skilled user requires less than two seconds (average) to select a pictogram or letter (i.e., in less than a minute, a 30 characters long phrase or up to two semantically correct sentences using pictograms can be produced).", "num_citations": "2\n", "authors": ["2240"]}
{"title": "Improving deaf people accessibility and communication through automatic sign language recognition using novel technologies\n", "abstract": " Communication is a key for human development. Nevertheless, deaf people have difficulty interacting with hearing and hard of hearing people. On the other hand, new technology allows gesture recognition. This work aims to promote the development of tools to take advantage of 3D camera technology for the benefit of the Deaf Community around the world. This research proposes a sign recognition model using 3d cameras (i.e. Leap Motion and Intel RealSense) and support vector machines (SVM). The goal is to support the communication process between deaf and hearing people. Furthermore, we conduct an experiment determining an appropriate amount of training sample signs to ensure satisfactory results using SVMs.", "num_citations": "2\n", "authors": ["2240"]}
{"title": "wearable sensor system prototype for SIDS prevention\n", "abstract": " Sudden Infant Death Syndrome (SIDS) causes unexpected death of infants; a variety of risk factors for SIDS have been detected through the years. A significant number of deaths occur when the children are being cared by non parental caregivers. We found that, using wearable systems some of those risk factors can be constantly monitored and the gathered information can be sent to the parents through a mobile application. In this paper, we present and evaluate a prototype of an augmented object and a mobile application that could help the prevention of SIDS. A wizard of Oz validation helped us determine the feasibility of developing and implementing the prototype. Testing results of the prototype showed positive parent reception to wide range monitoring and acceptable performance of the application.", "num_citations": "2\n", "authors": ["2240"]}
{"title": "Software Development Practices and Frameworks Used in Spain and Costa Rica: A Survey and Comparative Analysis\n", "abstract": " Software development has been impacted by the arrival of agile frameworks, especially in the last two decades. The HELENA Project (Hybrid dEveLopmENt Approaches in software systems development) was developed to identify the use of these frameworks in relation to more traditional ones. As part of this project, a survey was carried out in 55 countries, including Spain and Costa Rica. This paper presents the comparison of the results of these two countries, particularly in relation to two topics: the degree of agility of the activities of the software development life cycle and what are the most used methods and frameworks in each country. The results show similarities in both topics for the two countries, such as the fact that the most agile-oriented activities are Implementation/Coding and Integration/Testing, or the widespread use of agile frameworks with Scrum in the first place, followed by Iterative Development …", "num_citations": "1\n", "authors": ["2240"]}
{"title": "Generational Professional Career Evolution of Professionals in Computer Science in Costa Rica: A Gender Study\n", "abstract": " The career evolution of professionals in Computer Science has been studied very little, especially in Latin America. In a previous study (LAWWCC 2016) we reported results of an exploratory study that aimed to characterize the professional development model of people that studied Computer Sciences in Costa Rica. It reflects the roles and the industrial sectors with which they began their professional career and in which they report are currently working. No important gender differences were depicted in it amongst men and women, since they report similar choices regarding their professional evolution. As a result, some valid concerns were raised regarding the question: do these results represent the female (and male) behavior in all professional career stages? In this study, results, obtained from an online survey responded by 611 professionals in Computer Sciences, are now shown by generations. Professionals are grouped in four generational categories: Baby Boomers, Generation X, Young and Mature Millennials. The main finding is that the professional evolution, with respect to the role and sector in which they perform, revels different behaviors for professionals of different generations. It also reflects that male career evolution shows more role and industry changes than that of female professionals.", "num_citations": "1\n", "authors": ["2240"]}
{"title": "Evaluating the NAO robot in the role of personal assistant: The effect of gender in robot performance evaluation\n", "abstract": " By using techniques such as the Wizard of Oz (WoZ) and video capture, this paper evaluated the performance of the Nao Robot in the role of a personal assistant, which was valuated alongside the impact of the assigned gender (male/female) in the perceived performance of the robot assistant. Within a sample size of 39 computer sciences students, this study assessed criteria such as: perceived enjoyment, intention to use, perceived sociability, trust, intelligence, animacy, anthropomorphism, and sympathy, utilizing testing tools such as Unified Theory of Acceptance and Use of Technology (UTAUT) and Godspeed Questionnaire (GSQ). These methods identified a significant effect of the gender assigned to the robot in variables such as intelligence and sympathy.", "num_citations": "1\n", "authors": ["2240"]}
{"title": "Defining ‘Architecture’for Software Engineering–A Review of Terminology\n", "abstract": " There are many terms used in the industry that relate to similar topics. Architecture is one of them. In many companies, representatives develop Information Architectures even though this term was conceptualized to be used in the domains of Information Systems or Information Technology. Moreover, different consultant agencies, consortia or working groups create standards or guidelines that sometimes use these concepts interchangeably. In this paper, we want to provide a comprehensible definition of the most common (Architecture-related) concepts used by members of the information technology community into non-software development companies. In addition, a literature review is also conducted to determine the academic use of these terms, and a website based review is conducted to gather the most common definitions provided in articles that do not undergo peer reviews.", "num_citations": "1\n", "authors": ["2240"]}
{"title": "Visualizing IT Budget to Improve Stakeholder Communication in the Decision Making Process\n", "abstract": " Traditionally in large enterprises, budget cuts are a treat for IT departments. One way to guard IT budget is visualizing the impacts in IT services of such cuts. Data visualization tools are capable of bridging the gap between increased data availability and human cognitive capabilities. In this paper, we present a budget visualization tool that allows enterprise wide data-driven decision-making. Our proposal was developed in the context of a large multi-industry state-owned company, with rigid control structures and external pressures for cost reduction and investment optimization. Our tool promotes visualization as the main mechanism to justify IT budget requests and to defend from budget amendments and cuts. We propose a generic tool that might manage different perceptions from many parts of an organization. However, to evaluate our tool’s effectiveness we incorporated four stakeholder’s perspectives …", "num_citations": "1\n", "authors": ["2240"]}
{"title": "A Comparison between a Relational Database and a Graph Database in the context of a Personalized Cancer Treatment Application\n", "abstract": " This paper presents a performance comparison between a relational database (implemented in MySQL) and a graph database (implemented in Neo4j). Unlike traditional benchmarks, this comparison is made in the context of a real health application which was developed in Costa Rica. The comparison encompassed twelve queries and three data size configurations.The results of the comparison indicate that MySQL performs better than Neo4j in most cases, but has a poor performance when data size is large and the queries have multiple join operations.", "num_citations": "1\n", "authors": ["2240"]}
{"title": "Improving the Process for Developing Augmented Objects: An HCI Perspective\n", "abstract": " The process of designing and creating fine Augmented Objects is not an easy task. In this paper we state that Augmented Objects are just interfaces for specific software systems. In this way, the process of design, construction and testing of Augmented Objects should be part of a Software Engineering methodology, likewise Human Computer Interaction deals with software interfaces. A previously proposed methodology for creating Augmented Objects was evaluated. Three new augmented objects were created. Advantages and disadvantages for using this methodology for creating no-traditional interfaces are reported.", "num_citations": "1\n", "authors": ["2240"]}