{"title": "A study of hierarchical clustering algorithm\n", "abstract": " Clustering is the process of grouping the data into classes or clusters, so that objects within a cluster have high similarity in comparison to one another but these objects are very dissimilar to the objects that are in other clusters. Clustering methods are mainly divided into two groups: hierarchical and partitioning methods. Hierarchical clustering combine data objects into clusters, those clusters into larger clusters, and so forth, creating a hierarchy of clusters. In partitioning clustering methods various partitions are constructed and then evaluations of these partitions are performed by some criterion. This paper presents detailed discussion on some improved hierarchical clustering algorithms. In addition to this, author have given some criteria on the basis of which one can also determine the best among these mentioned algorithms.", "num_citations": "87\n", "authors": ["2207"]}
{"title": "Optimized image steganography using discrete wavelet transform (dwt)\n", "abstract": " Steganography is a term used for covered writing. Steganography can be applied on different file formats, such as audio, video, text, image etc. In image steganography, data in the form of image is hidden under some image by using transformations such as ztransformation, integer wavelet transformation, DWT etc and then sent to the destination. At the destination, the data is extracted from the cover image using the inverse transformation. This paper presents a new approach for image steganography using DWT. The cover image is divided into higher and lower frequency sub-bands and data is embedded into higher frequency sub-bands. Arnold Transformation is used to increase the security. The proposed approach is implemented in MATLAB 7.0 and evaluated on the basis of PSNR, capacity and correlation. The proposed approach results in high capacity image steganography as compared to existing approaches.", "num_citations": "30\n", "authors": ["2207"]}
{"title": "A comparative study of iterative thinning algorithms for BMP images\n", "abstract": " Thinning is a very important preprocessing step for the analysis and recognition of different types of images. Thinning is the process of minimizing the width of a line, in an image, from many pixels wide to just one pixel (Lam et al., 1992)[3]. Thus Correct and Reliable thinning of character patterns are essential to a variety of applications in the field of document analysis and recognition systems like pattern recognition; finger print recognition etc. Iterative parallel thinning algorithms which generate one-pixel-wide skeletons generally have difficulty in preserving the connectivity of an image. In present paper, four iterative parallel thinning algorithms namely the Fast Parallel Thinning Algorithm (FPTA), Guo & Hall’s parallel thinning Algorithm (GHPTA), Robust Parallel Thinning Algorithm for binary images (RPTA), and Preprocessing Thinning Algorithms for Handwritten Character Recognition (PPTA) have been implemented in C Language and evaluated. A comparison among these was made on the basis of following factors: quality of skeleton, convergence to unit width and data reduction rate. This study may help to compare or to select the best algorithm. The comparative results are included to support our findings.", "num_citations": "20\n", "authors": ["2207"]}
{"title": "Detection of Black Hole Attack on AODV in MANET Using Fuzzy Logic\n", "abstract": " MANET is a mobile ad-hoc network which dynamically set up temporary paths between mobile nodes which acts both as router and hosts to send and receive packets. As MANET has dynamic topology, no centralized monitoring and limited physical security so it is more vulnerable to attacks and one of them is Black Hole Attack. This attack can be easily implemented in AODV during the routing discovery process. In the Black Hole attack, a malicious node impersonates as destination node either by showing highest destination sequence number or by advertising itself as having the shortest path to destination node. Once the forged route has been established the malicious node is able to become a member of the active route and intercept all communication packets across that node. In this paper an intrusion detection system is introduced to detect Black Hole Attack on AODV in MANET using fuzzy logic. This IDS uses two factors that is forward packet ratio and destination sequence number. These factors are implemented using fuzzy logic in which fidelity level is checked and compared against threshold value and detected whether there is black hole attack or not. The proposed IDS have been tested using NS2 (Network Simulator 2).", "num_citations": "14\n", "authors": ["2207"]}
{"title": "Securing MANET against wormhole attack using neighbor node analysis\n", "abstract": " In mobile ad hoc networks (MANETs) security is of major concern because of its inherent liabilities. The characteristics of MANETs like infrastructure less network with dynamic topology pose a number of challenges to security design. There is an increasing threat of attacks in MANET. Wormhole attack is one of the security attacks on mobile ad hoc networks in which a pair of colluding nodes make a tunnel using a high speed network. This paper focuses on providing a solution for secure transmission through the network and proposes a neighbor node analysis approach to identify wormhole attack and removes wormhole link in MANET. The proposed work is simulated using NS-2 and is analyzed using certain parameters such as throughput, loss rate, delay rate.", "num_citations": "12\n", "authors": ["2207"]}
{"title": "Role of link expiration time to make reliable link between the nodes in manets: A review\n", "abstract": " Link Expiration is a main problem in already existing secure and non-secure routing protocols of mobile adhoc network (MANETs) and one of the most encouraging issues of research areas. Due to non reliable link, number of packet loss and other routing overhead increased. So, the requirement is both: reliable link and security. Secure communication in mobile adhoc networks is difficult because of mobility, availability of limited resource, changing topology of nodes and limited processing power. MANETs are highly prone to attacks namely, passive attacks and active attacks. Traditional routing protocols do not provide security. So, we need to concentrate on reliability and expiration time of links (LET). Link disconnection is another problem in mobile ad hoc network. Due to mobility of nodes link expires and the node has to find another route for sending the data. So, that route must be discovered from which the link does not expire before all the packets reach the destination. In this paper we have discussed the different types of routing protocols in MANET’s and their performance evaluation based on different parameters using Qualnet simulator.", "num_citations": "11\n", "authors": ["2207"]}
{"title": "Taxonomy of Distributed Consensus Algorithms\n", "abstract": " In distributed database computing transactions, group agreements of all the participating nodes is the crucial task. In such transactions, distributed algorithms are used for solving the problem of consensus. Distributed consensus algorithms are mainly of two types one is used in the case of link failures and second for process failures. For process failures, the algorithms used for solving the consensus problem are stopping, byzantine failures and commit protocols. The 2-phase commits (2-PC) and three-phase commit protocols (3-PC) are distributed algorithms that make all nodes in a distributed system agree to either commit or abort a transaction. The algorithms like FloodSet, EIGStop, EIGByz, PAXOS and E3PC are also used in last few years for solving this problem. This paper presents taxonomy of Distributed Consensus Algorithms. Different types of distributed algorithms for solving consensus problem in distributed database computing transactions are discussed here.", "num_citations": "8\n", "authors": ["2207"]}
{"title": "Association rule mining using Firefly algorithm\n", "abstract": " Data mining is the process of extracting previously unknown patterns from large amount of data. Association rule mining is one of very important data mining models. Swarm intelligence is a new subfield of artificial intelligence which studies the collective behavior of groups of simple agents. In this paper, a new efficient approach is proposed for exploring high-quality association rules. The proposed approach is based on firefly algorithm, which is an optimization algorithm used in swarm optimization. The proposed approach mines interesting and understandable association rules in single run without using the minimum support and the minimum confidence thresholds. The proposed approach was implemented using Microsoft Visual Studio 4.0 to prove its efficiency in terms of computation time.", "num_citations": "8\n", "authors": ["2207"]}
{"title": "Taxonomy of swarm optimization\n", "abstract": " Swarm intelligence is a relatively new subfield of artificial intelligence which studies the social behavior of simple agents. It can be seen in ants’ colonies, fireflies, flocks of birds, bee hives etc. The goal of this research paper is to describe the taxonomy of swarm optimization. In the beginning two main algorithms of swarm optimization are ant colony optimization and particle swarm optimization presented. In recent years, new swarm intelligence algorithms have come into light that are being presented in this paper.", "num_citations": "7\n", "authors": ["2207"]}
{"title": "License Plate Recognition System using Back Propagation Neural Network\n", "abstract": " Due to rapid development of technology and increasing use of vehicles, license plate recognition system has numerous applications. In present world, crimes are increasing day by day with a rapid speed and criminals use vehicles in crimes. When we go at a crowded place, we see that people does not follow traffic rules during driving due to which many road accidents occur. So we have designed a license plate recognition system to overcome these problems. Identifying the license plate of a vehicle involved in crimes can help to nab the criminals. In recent years, template matching was used for license plate recognition but it is sensitive to noise. So, neural networks are used for recognition. In this paper, Haar wavelet and back propagation neural network are used for license plate detection and feature extraction of license plate characters. The proposed system has been implemented in MATLAB.", "num_citations": "6\n", "authors": ["2207"]}
{"title": "Building Software Reuse Library with Efficient Keyword based Search Mechanism\n", "abstract": " Software reuse is the use of existing software components to build a software system. Effective storage and retrieval of software components is much essential in reuse process. The researchers have developed a number of software reuse techniques for storage and retrieval of components. No one technique is complete in its own; every technique has its own merits and demerits. This paper presents a new approach for building software reuse library based on keyword searching for storage and fast retrieval of software components. Keywords are matched with given query, character by character so that a fraction of match can also be given due weightage. To make this paper beneficial to new researchers, algorithms are explained in detail.", "num_citations": "5\n", "authors": ["2207"]}
{"title": "Implementation of fault attacks on elliptic curve cryptosystems\n", "abstract": " The main motivation behind Elliptic Curve Cryptography is to find a Public Key Family which provides the same level of security as Discrete Log Systems or RSA but with shorter operands. Through Fault Attacks, the adversary disturbs the computation of Cryptographic device to obtain information about Secret Key. This paper uses Elliptic Curve Point Multiplication Algorithm based on a binary sequence to build a Cryptographic algorithm and provides a way to retrieve the key by application of Fault Attacks on the Algorithm.", "num_citations": "4\n", "authors": ["2207"]}
{"title": "Applications of Swarm Intelligence in Data Clustering: A Comprehensive Review\n", "abstract": " Data mining is a growing area of research and development. Data mining is the process of identifying the hidden patterns and structures from massive volume of data. Data clustering is most important technique of data mining and widely used in various domains ie web, E-com, biology, machine learning. Data Clustering refers to the process in which data objects are grouped into clusters in such a way that objects within a cluster have high similarity in comparison to one another but are different from objects in different clusters. Due to large application area, we need effective and efficient clustering algorithms or methods which are scalable and can work on large databases, can handle complex shaped data. In recent years, many algorithms have been developed for solving clustering as well as numerical and combinatorial optimization problems. Swarm intelligence algorithms are most efficient in solution of such optimization problems. Swarm intelligence is an important area of Artificial intelligence. It is based on the collective or collaborative behaviour of self organized agents like ant’s colony, bird’s flocks, fish school, bee colony, bats, frogs, bacterium etc. Clustering using different swarm intelligence based metaheuristics is being used as an alternative to more conventional clustering techniques. If we consider ‘data clustering’as optimization problem, Data clustering with Swarm Intelligence algorithms are being used to generate better results in a wide variety of real-world data. In this paper, we present a comprehensive survey on applications of various swarm intelligence techniques in data clustering.", "num_citations": "3\n", "authors": ["2207"]}
{"title": "A Study of Sequential Pattern Mining Techniques\n", "abstract": " A lot of database is available in the world which is to be screened to find out various facts such as history of symptoms from which disease can be diagnosed, accessing data from Knowledge Data Discovery. If we try to filter these data manually, it can take hours or days or months. So we need some interesting tool to access or retrieve the data for which data mining is used to mine that data and to access that mined data we have several techniques and among them sequential pattern mining is better. This paper presents a study of sequential pattern techniques.", "num_citations": "2\n", "authors": ["2207"]}
{"title": "A Novel Expert System for PC Network Troubleshooting and Maintenance\n", "abstract": " In today’s world where information is knowledge and time is money, faster flow of information is the basic need of every organization. Hence, downtime of network can be a serious threat to win crucial competitions. Apparently most of the computer users are “layman” when it comes to troubleshooting and diagnosing network related problems. This situation requires the need of an expert system or network engineer to solve the respected issue and get the work back on track. However a faster and cost-effective solution can be deployment of an expert system for the same. This will not only omit the need of professional individual but will also enable PC users to handle these small yet significant issues on their own. Implementation of this expert system will reduce the downtime of a person and improve his/her efficiency resulting in better production and increased turnover of the organization. On the other hand, this expert system may also be used by PC users and home or small and medium scale enterprises. An expert system named “Network Expert System (NES)” is proposed in this paper to assist and advice new technician and novice users to diagnose and troubleshoot computer network issues in MS-Window based Personal Computers.", "num_citations": "2\n", "authors": ["2207"]}
{"title": "Secure routing in MANETs using three reliable matrices\n", "abstract": " Reliable LET Matrices has proposed to make secure routing in mobile ad hoc networks. Knapsack algorithm technique is used to find MaxLET, MinLET, and AvgLET. The node which sending packets first will calculate maximum LET (MaxLET), minimum LET (MinLET) and average LET (AvgLET). In the process of transmitting data, the sending node can be use either MaxLET or MinLET for sending the packets and each packet may travel the different routes for sending the packets at the same time. The number of packets send to the receiver node will depend on the available bandwidth. This procedure is repeated until all the packets reach the destination node. To verify whether the corrective data has received or not a Message Authentication Code (MAC) applied for authentication using LET. It is applied so that the receiver can verify that the LET has not been altered on the way.", "num_citations": "1\n", "authors": ["2207"]}
{"title": "LZW based Image Steganography using Kekre’s Algorithm\n", "abstract": " Steganography is a method in which secret message is embedded into a cover image to protect it from unauthorized access. The challenge of steganography technique is to maintain a rational balance between the quality of file and size of data that can be transferred. This paper presents a secured and robust steganography method capable of embedding high volume of information in digital cover image without incurring and perceptual distortion. This method is based compression and encryption. In this method the message to be transmitted first using Lempel-Ziv-Welch compression technique and is encrypted by using and hide compress data in image using kekre’s algorithm. The proposed method is tested with different images and text of various lengths.", "num_citations": "1\n", "authors": ["2207"]}
{"title": "Effect of FTP and FTP generic traffic generator on the performance of MANET routing protocols\n", "abstract": " A Mobile Ad-Hoc Network (MANET) is a collection of wireless mobile nodes that communicates with each other without using any existing infrastructure, access point or centralized administration. In this paper, an attempt has been made to evaluate the performance of two well known routing protocols AODV, DSR with two traffic Generators FTP and FTP/GENERIC by using two performance metrics such as packet delivery ratio, average throughput. The Performance evaluation has been done by using simulation tool GloMoSim (Global Mobile information systems Simulation) which is the main simulator.", "num_citations": "1\n", "authors": ["2207"]}
{"title": "A comparative analysis of WiMAX and Wi-Fi\n", "abstract": " WiMAX is Wireless interoperability For Microwave Access. This paper stands on the point about analyis of WiMAX and Wi-Fi technology. This is to analyze the implementation of both wireless technology and also shows which is more secure. This paper provides a general technical understanding of WiMAX and Wi-Fi technologies and their comparison. The main aim of this comparison is to show which technology is more secure. This paper analyses the technology concepts, implementation and security issues of both.", "num_citations": "1\n", "authors": ["2207"]}
{"title": "Analysis of Agile and Traditional Approach for Software Development\n", "abstract": " It has been seen that agile methodology are gaining ground worldwide. Earlier only few researches implemented the use of agile methodologies but nowadays agile processes have become more reliable. Therefore we decided to conduct our own survey. The research objective was to determine the rate of agile approaches usage and the rate of traditional approach usage and practical experience with these approaches in companies. The research was conducted in a Company environment. This paper presents the results of that research.", "num_citations": "1\n", "authors": ["2207"]}