{"title": "A Systematic Study on Agile Software Development Methodologies and Practices\n", "abstract": " Software engineering techniques have been employed for many years to create software products. The selections of appropriate software development methodologies for a given project, and tailoring the methodologies to a specific requirement have been a challenge since the establishment of software development as a discipline. In the late 1990’s, the general trend in software development techniques has changed from traditional waterfall approaches to more iterative incremental development approaches with different combination of old concepts, new concepts, and metamorphosed old concepts. Nowadays, the aim of most software companies is to produce software in short time period with minimal costs, and within unstable, changing environments that inspired the birth of Agile. Agile software development practice have caught the attention of software development teams and software engineering researchers worldwide during the last decade but scientific research and published outcomes still remains quite scarce. Every agile approach has its own development cycle that results in technological, managerial and environmental changes in the software companies. This paper explains the values and principles of ten agile practices that are becoming more and more dominant in the software development industry. Agile processes are not always beneficial, they have some limitations as well, and this paper also discusses the advantages and disadvantages of Agile processes.", "num_citations": "97\n", "authors": ["2252"]}
{"title": "Adopting an agile approach for the development of mobile applications\n", "abstract": " With the increasing popularity and demand for mobile applications, there has been a significant increase in the number of mobile application development projects. Highly volatile requirements of mobile applications require adaptive software development methods. The Agile approach is seen as a natural fit for mobile application and there is a need to explore various Agile methodologies for the development of mobile applications. This paper evaluates how adopting various Agile approaches improves the development of mobile applications and if they can be used in order to provide more tailor-made process improvements within an organization. A survey related to mobile application development process improvement was developed. The use of various Agile approaches for success in mobile application development were evaluated by determining the significance of the most used Agile engineering paradigms such as XP, Scrum, and Lean. The findings of the study show that these Agile methods have the potential to help deliver enhanced speed and quality for mobile application development.", "num_citations": "69\n", "authors": ["2252"]}
{"title": "An Investigation into Mobile Application Development Processes: Challenges and Best Practices\n", "abstract": " The mobile device market has witnessed swift industrial growth over the last decade. The quick expansion of this new computing platform has almost outpaced the software engineering processes customized to mobile application development. However, there is still lack of novel research initiatives around the mobile application development process. There remains a deficiency in development standards and best practices which expose the mobile device to potential attacks. This deficiency needs to be addressed promptly and requires further work.The objective of this research is to better understand the current methodologies adapted and to investigate challenges faced during the mobile application development processes that are different from traditional enterprise application. For this purpose, an online survey was conducted from the mobile research and development community. The survey questions covered the entire mobile application development lifecycle starting with requirements, and ending with bringing to life a complete mobile application. The study contributes towards a greater understanding of mobile application development process, examines real challenges confronted, and investigates the best practices that can be successfully implemented to enhance, evaluate, and improve the performance of the mobile application development process. These findings can also be considered as a possible research topic that indicates the breadth of research requirements and prospects in mobile computing.", "num_citations": "55\n", "authors": ["2252"]}
{"title": "Adopting an agile approach for the development of mobile applications\n", "abstract": " Software development is a very complex field with myriad variables impacting the system. Software systems therefore cannot be built with mathematical or physical certainty. The more prevalent software development methods however have been designed assuming software development to be a very precisely specified activity which can be carried out in a phased manner with each phase leading to the other, and without much need to revisit any of the completed phases. These techniques assume that most of the project requirements can be accurately gathered at the beginning of the project which is far from being true for almost all software systems. The intrinsic uncertainty and complexity in any software project therefore requires an iterative developmental plan to cope with uncertainty and a large number of unknown variables. The success of lean development method of the 1980s inducted a broad class of “iterative” software methods including the Unified Process, Evo, Spiral, and Agile methods [1].In recent years, with the rising competence of software market, researchers are seeking more flexible methods that can be used to adjust to dynamic situations where software system requirements are changing over time. The agile method [2] aims at facilitating software development processes where changes are acceptable at any stage [3], customers are treated individually as collaborators [4] and unavoidable evolutionary changes can be identified [5]. Agile methodologies provide a structure for highly collaborative software development. Commonly associated with ‘lean’engineering, agile software development closely follows the flow of …", "num_citations": "2\n", "authors": ["2252"]}