{"title": "Finding interesting patterns using user expectations\n", "abstract": " One of the major problems in the field of knowledge discovery (or data mining) is the interestingness problem. Past research and applications have found that, in practice, it is all too easy to discover a huge number of patterns in a database. Most of these patterns are actually useless or uninteresting to the user. But due to the huge number of patterns, it is difficult for the user to comprehend them and to identify those interesting to him/her. To prevent the user from being overwhelmed by the large number of patterns, techniques are needed to rank them according to their interestingness. In this paper, we propose such a technique, called the user-expectation method. In this technique, the user is first asked to provide his/her expected patterns according to his/her past knowledge or intuitive feelings. Given these expectations, the system uses a fuzzy matching technique to match the discovered patterns against the user's …", "num_citations": "233\n", "authors": ["2192"]}
{"title": "Open cirrus: A global cloud computing testbed\n", "abstract": " Open Cirrus is a cloud computing testbed that, unlike existing alternatives, federates distributed data centers. It aims to spur innovation in systems and applications research and catalyze development of an open source service stack for the cloud.", "num_citations": "212\n", "authors": ["2192"]}
{"title": "Open Cirrus™ Cloud Computing Testbed: Federated Data Centers for Open Source Systems and Services Research.\n", "abstract": " There are a number of important and useful testbeds, such as PlanetLab, EmuLab, IBM/Google cluster, and Amazon EC2/S3, that enable researchers to study different aspects of distributed computing. However, no single testbed supports research spanning systems, applications, services, open-source development, and datacenters. Towards this end, we have developed Open Cirrus, a cloud computing testbed for the research community that federates heterogeneous distributed data centers. Open Cirrus offers a cloud stack consisting of physical and virtual machines, and global services, such as sign-on, monitoring, storage, and job submission. By developing the testbed and making it available to the research community, we hope to help spur innovation in cloud computing and catalyze the development of an open source stack for the cloud.", "num_citations": "122\n", "authors": ["2192"]}
{"title": "Visualization support for data mining\n", "abstract": " WinViz uses parallel coordinates, a computational geometry method, to let users visually formulate queries and analyze results. When integrated with machine-learning algorithms, WinViz provides a powerful tool for data mining.", "num_citations": "88\n", "authors": ["2192"]}
{"title": "Some privacy issues in knowledge discovery: the OECD personal privacy guidelines\n", "abstract": " Several countries have generated principles to protect individuals from the potential invasion of privacy that data collection and retrieval poses. The Organization for Economic Cooperation and Development (OECD) has provided probably the best known set of guidelines. A number of countries have adopted these guidelines as statutory law, in whole or in part. The OECD has specific guidelines pertaining to data privacy that directly affect those performing knowledge discovery generally, and those who use so called \"personal data\" in particular. The article addresses such questions as: What are the implications of the existing privacy guidelines, especially those of the OECD, for knowledge discovery? What are the limitations of these guidelines? How do the restrictions on knowledge discovery about individuals affect knowledge discovery on groups? How do legal systems influence knowledge discovery?.< >", "num_citations": "74\n", "authors": ["2192"]}
{"title": "Exploiting Visualization in Knowledge Discovery.\n", "abstract": " Todate visualization has not been extensively harnessed in knowledge discovery in databases (KDD). In this paper, we show that a multidimensional visualization (MDV) technique can be used synergistically with a machine learning program like C4. 5 to uncover new knowledge. Used together, the two approaches span the KDD spectrum between complete automation on one hand and fully manual on the other. We introduce MDV, its implementation in a tool named WinViz, and show how WinViz supports the various tasks in KDD.", "num_citations": "39\n", "authors": ["2192"]}
{"title": "Acquiring software design schemas: a machine learning perspective\n", "abstract": " In this paper, we describe an approach based on machine learning that acquires software design schemas from design cases of existing applications. An overview of the technique, design representation, and acquisition system, is presented. The paper also addresses issues associated with generalizing common features such as biases. The generalization process is illustrated using an example.", "num_citations": "21\n", "authors": ["2192"]}
{"title": "Software report: Winviz: A visual data analysis tool\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "20\n", "authors": ["2192"]}
{"title": "A multi-dimensional data visualization tool for knowledge discovery in databases\n", "abstract": " The paper describes a multidimensional visualization (MDV) technique, a refined and improved form of a computational geometry method known as parallel coordinates, that has been realized by WinViz. It shows how MDV differs significantly from parallel coordinates as originally conceived by Alfred Inselberg (T. Chomut, 1987). The paper also discusses WinViz's underlying design considerations. A primary principle is known as \"seeing your data in a single picture\". The novel visualization interface of WinViz supports both the display of multidimensional data and the visual formulation of query interactively. In particular, we compare WinViz's query operators with those in SQL to highlight its salient features realized through the MDV interface. Applications of WinViz include exploratory data analysis and knowledge discovery of databases for a diverse range of domains.", "num_citations": "18\n", "authors": ["2192"]}
{"title": "A new visualisation technique for knowledge discovery in OLAP\n", "abstract": " Knowledge discovery in databases (KDD) has as its primary objective the uncovering of new and useful knowledge from huge masses of raw data. Our research in KDD has focused on how visualisation can be exploited in the dialectic process of knowledge discovery [6]. Our approach uses a multi-dimensional data visualisation (MDV) technique that builds upon a refined and improved method of parallel coordinates. We also explore how visualisation can be used synergistically with other techniques such as inductive learning (eg, C4. 5) and hierarchical clustering to harness their respective strengths in KDD. Our recent work investigates whether the requirements for visualisation would differ if the input to the knowledge discovery comprises aggregated data instead of raw unprocessed data. In particular, we concentrate on the multi-dimensional model, an emerging model for analysis, that underlies the on-line analytical processing (OLAP) concept [2]. The OLAP camp uses the two-dimensional cross-tabulation table as its visualisation tool. We argue that this is inadequate and that a modified MDV can provide superior results for KDD.", "num_citations": "13\n", "authors": ["2192"]}
{"title": "An analogy-based retrieval mechanism for software design reuse\n", "abstract": " Describes a knowledge-based retrieval mechanism for a hybrid software design system that promotes the reuse of design schemas and design cases. The retrieval relies on domain-specific knowledge whenever this is available; otherwise, it uses analogy to determine the degree of closeness of match using is-a lattices and similarity metrics.< >", "num_citations": "10\n", "authors": ["2192"]}
{"title": "Software engineering knowledge for software reuse\n", "abstract": " The types of knowledge that are brought to bear at every stage of the software development life cycle are identified. However, some knowledge, though used, is lost when it is not captured explicitly or embedded within a software artifact. The knowledge encoded in a software artifact as software concepts can be reused. A model is proposed to illustrate the various dimensions of software reuse, namely component granularity, component origin and abstraction levels. This model is related to software reuse in CASE tools, and the degree of knowledge reuse is indicated.", "num_citations": "7\n", "authors": ["2192"]}
{"title": "Automated acquisition and refinement of reusable software design components\n", "abstract": " The importance of reusing software components in new software developments has long been recognized. A reason for the current low level of software reuse stems from the difficulties of obtaining appropriate components for populating a reuse library.", "num_citations": "7\n", "authors": ["2192"]}
{"title": "Tuple-level analysis for identification of interesting patterns\n", "abstract": " One of the important issues in data mining is the \"interestingness\" problem. Past research and applications have shown that in many situations a huge number of patterns can be discovered from a database. Most of these patterns are actually useless or uninteresting to the user. But because of the huge number of patterns, it is difficult for the user to identify those interesting to him/her. In this project, we propose a new technique to help the user identify interesting patterns. The user is first asked to provide his/her expected patterns according to his/her past knowledge and/or intuitive feelings. Given these expectations, the system uses a tuple-level fuzzy matching technique to analyze and rank the discovered patterns according to a number of interestingness measures. With this technique, the user can quickly focus on a subset of the discovered patterns with the most application values.", "num_citations": "5\n", "authors": ["2192"]}
{"title": "Visual data exploration\n", "abstract": " Information Technology Institute 71 Science Park Drive Singapore 0511 Republic of Singapore {hingyan, hweeleng, karanbir}@ iti. gov. sg", "num_citations": "5\n", "authors": ["2192"]}
{"title": "Privacy & Knowledge Discovery: A Response to O'Leary\n", "abstract": " The development and deployment of Singapore’s IT2000 initiatives include establishing a National Information Infrastructure.’Consequently, this initiative will make a vast amount of information available. NII users will be concerned about protecting their privacy in the network, including their rights to protect data against unwanted intrusion and to control the use of information about themselves. It is crucial then to ensure that personal and confidential information is well guarded and protected from unwanted access. 2 The increasing reliance on knowledge discovery for pattern and relationship analysis has made privacy and security even more pertinent issues. The NII must establish sufficient safeguards to prevent misuses of the technology.Society needs rules to ensure individuals that they are entitled to information privacy, and that information providers have the responsibility of ensuring the integrity of information …", "num_citations": "5\n", "authors": ["2192"]}
{"title": "Identifying Interesting Missing Patterns\n", "abstract": " One of the important issues in data mining is the subjective “interestingness” problem. It has been shown that in many situations a huge number of patterns can be discovered from a database. Most of these patterns are actually useless or uninteresting to the user. But because of the huge number of patterns, it is difficult for the user to identify those patterns that are of interest to him/her. Past research proposed two main measures of subjective interestingness: unexpectedness and actionability. Both these measures focus on helping the user identify interesting discovered patterns. In this paper, we show that missing patterns (absence of some patterns) are interesting too. An approach has been proposed to identify the interesting missing patterns. The proposed approach is an extension of our previous work. In our previous work, we studied the subjective interestingness problem based on the concept of user’s expectations and fuzzy set theory. In that study, the discovered patterns are ranked in different ways according to their unexpectedness to the user. In this paper, we examine the extension to our previous work so as to identify the interesting missing patterns.", "num_citations": "4\n", "authors": ["2192"]}
{"title": "Tuple-Level Analysis for Identification of Interesting Rules\n", "abstract": " One of the important issues in data mining is the “interestingness” problem. Past research and applications have shown that in many situations a huge number of patterns can be discovered from a database. Most of these patterns are actually useless or uninteresting to the user. But because of the huge number of patterns, it is difficult for the user to identify those interesting to him/her. In this project, we propose a new technique to help the user identify interesting patterns. The user is first asked to provide his/her expected patterns according to his/her past knowledge and/or intuitive feelings. Given these expectations, the system uses a tuple-level fuzzy matching technique to analyze and rank the discovered patterns according to a number of interestingness measures. With this technique, the user can quickly focus on a subset of the discovered patterns with the most application values. 1.", "num_citations": "4\n", "authors": ["2192"]}
{"title": "Visual Data Exploration Using WinViz\n", "abstract": " This paper focuses on the use of graphical display of multidimensional data using an improved version of parallel coordinates. It shows how visualization can be used effectively for exploratory data analysis and describes WinViz, a tool that realizes it.", "num_citations": "4\n", "authors": ["2192"]}
{"title": "Machine Discovery of Static Software Reuse Potential Metrics\n", "abstract": " This paper reports a study to identify static software reuse potential metrics that can be used to classify C source code into reusable and non-reusable classes. The techniques used exploit a decision tree inductive machine learning and rough sets theory. The results we obtained show that the former technique, as implemented by C4. 5, produces a much more accurate set of classification rules than the latter technique, as implemented by DataLogic/R. The C4. 5 rules are also plausible as they support current understanding of how software metrics can be used to measure software reuse potental.", "num_citations": "4\n", "authors": ["2192"]}
{"title": "Data-as-a-Service: A Cloud-Based Federated Platform to Facilitate Discovery of Private Sector Datasets\n", "abstract": " Frequently described as the oil of the digital economy, data is today fervently sought after and its innovative use demonstrated in increasingly wide-ranging applications. To use data however, data users would first have to find them. In the realm of public / open data, there are often governmental and non-governmental agencies that consolidate and provide such data to users via centralized web portals. However, the equivalent is not available for datasets from the private sector, where data providers currently operate in highly-siloed environments. Data users seeking data but unfamiliar with the industry sector of interest have no straightforward mechanism to do so. This paper proposes Data-as-a-Service (DaaS) - a cloud-based, federated (peer-to-peer-like) dataset discovery platform based on open-source software, which allows for private sector data providers to increase visibility of their datasets to be discovered …", "num_citations": "3\n", "authors": ["2192"]}
{"title": "Overcoming shortcomings in schema-based software design systems\n", "abstract": " The paper describes a solution to the problem of acquiring reuseable design components for schema-based software design (SBD) systems. It also discusses some inherent shortcomings of the SBD approach that can be overcome by adopting a hybrid approach that incorporates the use of design cases. This discussion is made against the background of IDeA, an SBD system.<>", "num_citations": "3\n", "authors": ["2192"]}
{"title": "Instilling Trust and Confidence in a Data Driven Economy-Preliminary Design of a Data Certification Scheme\n", "abstract": " this paper presents the preliminary design of aData Certification scheme for data providers and users to betterunderstand the opportunities and restrictions possessed by openand commercial datasets. The proposed Data Certificationscheme employs a common language to describe different dataattributes such as accuracy, quality, the amount of support canreasonably expect from data providers, the legal restrictions onlicensing and rights, so the data users are able to distinguish theamount of efforts needed to process the dataset.", "num_citations": "2\n", "authors": ["2192"]}
{"title": "Some Interactive Aspects of a Software Design Schema Acquisition Tool\n", "abstract": " This paper describes a design schema acquisition tool which forms an important component of a hybrid software design system for reuse. The hybrid system incorporates both schema-based approaches in supporting software design reuse activities and is realized by extensions to the IDeA system. The paper also examines some of the interactive aspects that the tool requires with the domain analyst to accomplish its acquisition task.", "num_citations": "2\n", "authors": ["2192"]}
{"title": "MTCS for Healthcare\n", "abstract": " We have developed a multi-tiered cloud security framework to facilitate cloud users' need to match their security requirements with security provisions of cloud service providers (CSPs).Since the launch of Multi-Tiered Cloud Security Singapore standard (MTCS SS584) [1] in Oct 2013, the standard has been harmonized with several international security framework and standards [2] such as Cloud Security Alliance's Open Certification Framework [3] and ISO/IEC 27001 [4] to enable cross-certification for greater adoption. This paper reports on research that studies the gaps in bridging MTCS and Singapore's Healthcare IT Security Policy (HITSecP) so that CSPs who have been certified to MTCS, can know how well and best they could meet the security requirements of IT systems for healthcare industry in Singapore.", "num_citations": "1\n", "authors": ["2192"]}
{"title": "Certifying SaaS in the MTCS Framework\n", "abstract": " Security has always been highlighted as a key impediment to cloud adoption in many cloud conferences and surveys. However, tolerance to security risks varies from user to user. This leads to the development of the multi-tiered cloud security (MTCS) standards to meet different security needs of cloud users. Building on the tiered structure of MTCS, a unique framework of layered approach to certification of cloud services, in particular, certifying Software-as-a-Service hosted on MTCS-certified infrastructure service providers is described in details in this paper to shed lights on the implementation considerations.", "num_citations": "1\n", "authors": ["2192"]}
{"title": "A grid market framework\n", "abstract": " We outline a proposed framework for a grid market where grid resources can be supplied and acquired in Singapore. While several types of participants already exist, these and other roles that have been identified will evolve over time. The underlying building blocks are being developed to realize the Grid Exchange, which forms the heart of the grid market. We discuss the current version of the framework using the digital media industry as an example and prior work leading to its realization.", "num_citations": "1\n", "authors": ["2192"]}
{"title": "A KDD Experience in Pedestrian Accident Analysis\n", "abstract": " The literature has hitherto focused almost solely on the application of machine learning techniques to knowledge discovery in databases. In this paper, we show how the strengths of modern visualization techniques encompassing computer graphics, computational geometry, and query formulation, can be harnessed in combination with machine learning to make the knowledge discovery process more effective. We describe our multi-dimensional visualization tool (known as WinViz), its seamless integration with Quinlan's C4. 5, its use on a pedestrian accident dataset, and the findings.", "num_citations": "1\n", "authors": ["2192"]}