{"title": "A New Approach Towards Developing a Prescriptive Analytical Logic Model for Software Application Error Analysis\n", "abstract": " Software application is heavily being used by today’s business operations. However as of the fact, it is no software application in the market can guarantee that it has no software defect escaped during the release. Whenever software application error arises, it can be the cause happened either within the software application layer or any other factor outside the software application layer. The root cause analysis activity becomes more complex in such situation as the analysis activity involves multiple layers. Time consuming is increased to identify the valid error. It leads to the entire analysis duration which can be easily prolonged. This arises the problem statement that, the duration of root cause analysis on software application error carries crucial impact to the service restoration. The objective is to create a logic model to conduct decision making process. This process includes the identification of the root …", "num_citations": "10\n", "authors": ["1244"]}
{"title": "An Approach Towards Developing an Algorithm for Software  Application Error Analysis\n", "abstract": " The proposed algorithm is a conceptual guide which later helps as a guideline to build an independent software plug-in component sitting at the logic tier with human-like intelligent of analysis activities. This algorithm enables the capability on analyzing software application errors which pulls the software log data and other related data from various databases such as Configuration Database, Production Support Ticketing System Database, and Application and System Monitoring Database, and base on the yield data as input information to apply automated analysis action. In addition, based on the proposed algorithm, it can categorize the repeatably pattern of the software application errors in various categories and proactively apply resolution steps automatically to each category of software application errors. The analyzed information will be stored into a separate database catered for upcoming analysis and fine tuning the logic for better decision making in the near future.", "num_citations": "9\n", "authors": ["1244"]}
{"title": "A Prescriptive Logic Model for Software Application Root Cause Analysis\n", "abstract": " Software application stops functioning in the production environment can be due to the error either within the software application layer or any other factor outside the software application layer. With the complexity of an enterprise level of software application involving multiple tiers, it is has log file at each tier. The root cause analysis activity will easily prolong as more than one log file required for the root cause analysis activity. This would increase the total time taken on restoring the software application service back to the users. To identify the root cause of software application error in a more accurate manner, and shorten the duration of root cause analysis activity conducting on software application error. A Prescriptive Analytical Logic Model (PAL) incorporates with Analytic Hierarchy Process (AHP) is proposed. The logic model contributes a new knowledge in the area of log file analysis to shorten the total time spent on root cause analysis activity. At the same time it contributes the knowledge in AHP to close the knowledge gap.", "num_citations": "7\n", "authors": ["1244"]}
{"title": "A Business Operation Stability by Improving the Speed of Restoration on Software Application Service\n", "abstract": " Software application is still a heavy dependence for most of the business operation today. Whenever software application encounters error that causes downtime in the production environment, the root cause of the error can be either within the software application layer or any other factor outside the software application layer. To accurately identify the root cause is difficult whenever more than one log file is required for the root cause analysis activity. Due to such complexity, it leads to the entire duration on the root cause analysis activity became prolong. This will increase the total time taken on restoring the software application service back to the users. In order to identify the root cause of software application error in a more accurate manner, and shorten the duration of root cause analysis activity conducting on software application error, a Prescriptive Analytical Logic Model incorporates with Analytic Hierarchy Process (AHP) is proposed. The proposed Logic Model along with the algorithm will contribute a new knowledge in the area of log file analysis to shorten the total time spent on root cause analysis activity.", "num_citations": "6\n", "authors": ["1244"]}
{"title": "An Approach Towards Designing A Prescriptive Analytical Logic Model for Software Application Root Cause Analysis\n", "abstract": " Most of the business operations utilize software application heavily in today’s business world. Software application cannot afford to stop its functioning in the production environment during business hours. However, it is hard to restore the software application service without identifying the root cause. Software application error can occur either within the software application layer or any other factor outside the software application layer. With an enterprise level of software application, the complexity is high as it involves multiple tiers and many middleware are running in the environment. The root cause analysis of software application will be easily prolonged due to more than one log file required. The duration on restoring the software application service back to the users can be hard to determine whenever error is occurred. Therefore, the objective is to mitigate prolonging on conducting root cause analysis activity. Indeed to identify the root cause of software application error in a more accurate manner, and shorten the duration of root cause analysis activity conducting on software application error. A Prescriptive Analytical Logic Model incorporates with Analytic Hierarchy Process (AHP) is proposed. This logic model contributes a new knowledge in the area of log file analysis to shorten the total time spent on root cause analysis activity. At the same time it contributes the knowledge in AHP to close the knowledge gap.", "num_citations": "6\n", "authors": ["1244"]}
{"title": "A New Analysis Approach Incorporated with Analytic Hierarchy Process for The Software Application in A Multiple Tiers Environment\n", "abstract": " Software application becomes critical tool in a business operation today. Generally there is no management staff in the business operation can tolerate the software application downtime beyond the Service Level Agreement (SLA). The time duration spent on root cause analysis activity of software application error carries crucial impact to the business transaction. This is because business operation cannot afford if the software application downtime gets prolonged. Especially an enterprise level of software application is involving multiple tiers. There will be at least one or even more log files at each tier. Of course the root cause analysis activity will easily get prolonged as more than one log file are required for analysis activity. The research is not only to mitigate the time duration prolonging on root cause analysis activity. It is also to increase the accuracy of identifying the actual root cause during analysis activity. This is a necessity to have a proposed logic model sitting at the logic tier. The logic model can analyze the required log files, and then identify the root cause without creating any interruption to the existing software application executing in the production environment. Therefore, this is the strong reason for a Prescriptive Analytical Logic Model (PAL) incorporated with Analytic Hierarchy Process (AHP) proposed. The proposed logic model will contribute a new knowledge in the area of log file analysis. It aligns with the two research objectives,(1) to shorten the total time spent on root cause analysis activity by adopting the decision making process and technique of AHP,(2) to reduce the frequency of attempt by increasing the accuracy of …", "num_citations": "5\n", "authors": ["1244"]}
{"title": "The Root Cause Analysis Algorithm Design Incorporated with Analytic Hierarchy Process for Software Application Error\n", "abstract": " Software application normally comes along with its event logging feature today. However, with only the software application event log would be hard to determine the root cause if the error occurs beyond the software application boundary. In such circumstance, the time duration of conducting the root cause analysis activity will be easily prolonged. In order to identify the root cause more effectively, multiple event log files from different boundaries that are involved with software application such as Operating System, Networking, Middleware, Database Management System and etc are required. Therefore it will add additional complexity to the root cause analysis process. With such challenge, a new analysis approach is proposed. This new analysis approach is a logic model incorporated with Analytic Hierarchy Process (AHP). It will be sitting at the logic tier to conduct the analysis without interferes the existing software application. The objectives of the logic model is not only to mitigate the time duration prolonging on root cause analysis activity. It is also to increase the accuracy of identifying the actual root cause during analysis activity. Furthermore, this proposed logic model contributes the new knowledge of analysis approach which helps to close the existing knowledge gap in AHP, that can be applied for software application root cause analysis.", "num_citations": "4\n", "authors": ["1244"]}
{"title": "The Error Analysis for Enterprise Software Application Using Analytic Hierarchy Process and Supervised Learning: A Hybrid Approach on Root Cause Analysis\n", "abstract": " Many businesses today still very much depend on software application service to process the daily transactions. Under such heavy dependency, it is frustrated whenever the software application service is unavailable. For the errors which can cause the software application service malfunction, it can be possible to arise mostly in either within the software application layer, or other factors which are falling outside the software application layer. In this complex situation, a lot of time consume to identify the root cause is unavoidable. The objective is not seeing from the angle of only solving the problem. More importantly, it aims to reduce the total time spent on root cause analysis, and to decide the preferred resolution for the root cause. Indeed this is crucial to propose an approach toward to develop a logic model, that makes a precise decision on identifying the root cause, as well as on identifying the preferred …", "num_citations": "2\n", "authors": ["1244"]}
{"title": "A Prescriptive Analytical Logic Model Incorporated with Analytic Hierarchy Process for Software Application Error Analysis\n", "abstract": " Software application is still playing an important role in today’s business operation. However, the software application error can arise either within the software application layer or due to any other factor outside the software application layer. The root cause analysis activity becomes much more time consuming to identify the valid error. With that, it arises the problem statement that the duration of root cause analysis on software application error carries crucial impact to the service restoration. The objective of this proposed logic model is to conduct decision making process to identify the valid software application error. This logic model consists of the algorithm to carry various important processes include the identification of the root cause in a more accurate manner, and shorten the duration of root cause analysis activity. The design of Analytic Hierarchy Process (AHP) hierarchy will depend on the software …", "num_citations": "1\n", "authors": ["1244"]}