{"title": "CORBA Components Collocation Optimization Enhanced with Local ORB-Like Services Support\n", "abstract": " Some current implementations of CORBA Component Model (CCM) are flawed with unreasonable communication overheads when components are in the same address space and in the same container. Alternative approaches have introduced mechanisms for direct local communication of such components. In these approaches collocated components do not communicate through ORB and therefore cannot use ORB services such as events, naming and transactions locally, unless they are programmed explicitly. This paper presents a new approach for communication of collocated components with local ORB-like services support. A unit inside each container is responsible for handling communication between components within or outside the container. Local requests are passed to the local components without ORB involvement. Local or remoteness of a request is determined from the IOR of the called …", "num_citations": "48\n", "authors": ["1425"]}
{"title": "A new approach to task allocation in wireless sensor actor networks\n", "abstract": " Since wireless sensor actor networks (WSANs) interact with critical physical environments, one of the important issues of WSANs is real-time considerations. Existing WSANs suffer from the lack of a real-time task allocation in support of real-time communication and coordination. In this paper we present a two level task allocation mechanism. We first break end-to-end periodic tasks into real-time jobs, and then use appropriate algorithms for sensing tasks and acting tasks. To formally state our approach, we propose a model for WSANs using graph transformation systems. Using this formalism we analyze the correctness of our algorithms. We show that the proposed algorithms guarantee that the tasks complete their activities before their deadlines expire. To show the efficiency of our algorithms we have simulated the model. Simulation results showed an improvement of 65 percent in deadline hit ratio comparing our …", "num_citations": "33\n", "authors": ["1425"]}
{"title": "Task allocation to actors in wireless sensor actor networks: an energy and time aware technique\n", "abstract": " Task allocation is a critical issue in proper engineering of cooperative applications in embedded systems with latency and energy constraints, as in wireless sensor and actor networks (WSANs). Existing task allocation algorithms are mostly concerned with energy savings and ignore time constraints and thus increase the makespan of tasks in the network as well as the probability of malfunctioning of the network. In this paper we take both energy awareness and reduction of actor tasks’ times to completion in WSANs into account and propose a two-phase task allocation technique based on Queuing theory. In the first phase, tasks are equally assigned to actors just to measure the capability of each actor to perform the assigned tasks. Tasks are then allocated to actors according to their measured capabilities in such a way to reduce the total completion times of all tasks in the network. The results of simulations on …", "num_citations": "28\n", "authors": ["1425"]}
{"title": "Binary black holes algorithm\n", "abstract": " In this paper we adapt black holes optimization algorithms for binary search spaces by applying a sigmoid transformation to the gravity and electrical forces. Black holes algorithm is a Swarm Algorithm inspired of Black Holes for Optimization Problems. We supposes each solution of problem as a binary black hole and after calculating the gravity and electrical forces use a mapping function for set it. The proposed method is verified using several benchmark problems used in the area of optimization. The experimental results on different benchmarks show that the performance of the proposed algorithm is better than BPSO (Binary Particle Swarms Optimization), BAFS (Binary Artificial Fish Swarm Algorithm) and GA (Genetic Algorithm).", "num_citations": "17\n", "authors": ["1425"]}
{"title": "How to realize self-healing operating systems?\n", "abstract": " Operating systems serve as executing platforms and resource managers for applications. With the development of more complex computer systems and applications, the required operating systems become complex too. But the proper management of such complex operating systems by human beings has shown to be impractical. Nowadays, self managing concepts provide the basis for developing appropriate mechanisms to handle complex systems with less human interventions. Although the implications of deploying self managing and autonomic attributes and concepts at the application levels have been studied, their deployment at system software level such as in operating systems have not been fully studied. Self managed applications may not enjoy the whole benefit of self management if the platform on which they run, specially its operating system, is not self managed. Given this requirement, this paper …", "num_citations": "10\n", "authors": ["1425"]}
{"title": "Aspect-Oriented Software Maintainability Assessment Using Adaptive Neuro Fuzzy Inference System (ANFIS)\n", "abstract": " Aspect-oriented development is a relatively new approach that emphasizes dealing with crosscutting concerns. In aspect-oriented programming, concern networks and requirement networks are independent and can easily be added to or removed from a model of system; therefore maintenance and modifying in aspect-oriented system models are easier than object-oriented ones. Software maintenance is an important activity in software development and one of the most expensive activities. Also, its vagueness in prediction at early stage of development makes the process more complex. Researchers and developers are working on devising various techniques/algorithms for better prediction. The aim of the paper is to show that ANFIS can more accurately predict maintainability as compared to other models such as Fuzzy Logic. For this we selected four metrics and used them for training, testing and validation.", "num_citations": "9\n", "authors": ["1425"]}
{"title": "Black holes algorithm with fuzzy Hawking radiation\n", "abstract": " In this paper we improved efficiency of black holes algorithm with using of fuzzy Hawking radiation. A black hole is a region of space-time whose gravitational field is so strong that nothing which enters it, not even light, can escape. In the black holes algorithm there is a phase with name Hawking radiation. In this phase the position of the some black hole changes a little. This phase as equal mutation in genetic algorithm. We proposed a fuzzy Hawking radiation for these phase. The experimental results on different benchmarks show that the performance of the proposed algorithm is better than basic Black holes Algorithm (BLA) and firefly algorithm (FA).", "num_citations": "8\n", "authors": ["1425"]}
{"title": "Distributed assignment of real-time tasks in wireless sensor actor networks\n", "abstract": " To achieve more cost-effective assignment of real-time tasks to actors in wireless sensor actor networks we propose a distributed auction-based protocol that uses tasks’ deadlines, actors’ energies, actors’ loads and actors’ distances from event area as a cumulative cost metric. The protocol chooses actors closest to event area with lowest loads and highest remaining energies to minimize the response time of tasks, balance loads on actors and maximize total remaining energy of actors. Simulations show higher deadline meet-ratio and remaining energies of actors, and more balanced loads on actors, compared to SAP and SAAP task-assignment protocols.", "num_citations": "8\n", "authors": ["1425"]}
{"title": "Service requirements for actor-actor coordination through sensor nodes in wireless sensor actor networks\n", "abstract": " Wireless sensor actor networks are a new challenging type of network in which sensor and actor nodes must coordinate to achieve network goals. But in some situations actors cannot directly communicate with each other. The wide extent of environment, obstacles in the environment and bad communication conditions are some of the reasons. One solution is to exploit accessible sensor nodes to indirectly route packets between actors. To do so, sensor nodes must know the locations of actors because actors can move. In this paper we propose a minimal set of services that actors need to coordinate. The services are finding an actor, finding multiple actors, finding the nearest actor and finding n-nearest actors. The services are exemplified and further partly simulated.", "num_citations": "7\n", "authors": ["1425"]}
{"title": "A Neuro-Fuzzy based Approach to Software Quality Requirements Prioritization\n", "abstract": " Requirements engineering is one of the important topics in software engineering and correct understanding of requirements can affect the total quality of the whole software system. Lack of considering or wrong identification of requirements not only leads to customers’ dissatisfaction, but also leads to the software failure and increases the costs of development. Requirement prioritizing plays an important role in decision making process in subsequent phases and eliminates the complexities resulting from vague requirements. The aim is to find the right order of main requirements. Neuro-fuzzy system combines the ability of human reasoning (logic) through predetermined laws with the learning ability of neural networks and can apply the human expertise to find the total output value by using a set of laws stored in knowledge base. In this paper, we propose an effective approach to prioritizing software quality requirements based on neuro-fuzzy system. This paper shows that our proposed approach is more efficient in terms of both the time consumption and the learning ability compared to related approach.", "num_citations": "6\n", "authors": ["1425"]}
{"title": "Energy-aware task allocation in wireless sensor actor networks\n", "abstract": " Wireless sensor actor networks (WSANs) are emerging a new generation of real-time embedded systems. Real-timeliness is an important issue in WSANs to guarantee that tasks of an application are distributed based on limited computation and communication resources in the network in such a way to meet their deadline. In this paper we present an energy-aware task allocation mechanism on WSANs. We propose appropriate algorithms for sensing tasks and acting tasks. According to tuple space communication architecture, our algorithms know energy of sensor and actor nodes. We show that the proposed algorithms guarantee that the tasks complete their activities before their deadlines expire.", "num_citations": "6\n", "authors": ["1425"]}
{"title": "Assessment of Effective Risk in Software Projects based on Wallace's Classification Using Fuzzy Logic.\n", "abstract": " Software development always faces unexpected events such as technology changes, environmental changes, changing user needs. These changes will increase the risk in software projects. We need to risk management to deal with software risks. Risk assessment is one of the most important factors in risk and project management of software projects. In this paper, we use Wallace’s work and five factors to present an efficient method to measure software risk using fuzzy logic. Team, Planning, Complexity, Requirements and User are factors that we use in this paper. Results of experiments shows that our framework is more efficient than other frameworks and approaches for risk assessment in software projects.", "num_citations": "5\n", "authors": ["1425"]}
{"title": "A Graph Transformation-based Approach to Task Allocation in Wireless Sensor Actor Networks.\n", "abstract": " Existing WSANs suffer from the lack of a real-time task allocation in support of real-time communication and coordination. In this paper we present a graph transformation-based approach to allocate the tasks to the sensor and actor nodes in support of real-time application. For each action in the designed scenarios we define one or more graph rules to implement the proposed model. Using this formalism we analyze the correctness of our algorithms. We show that the proposed approach guarantee that the tasks complete their activities before their deadlines expire. To show the efficiency of our approach we have simulated the model. Simulation results showed an improvement of 65 percent in deadline hit ratio comparing our approach to FIFO algorithm.", "num_citations": "5\n", "authors": ["1425"]}
{"title": "A Hybrid Meta-heuristic Approach to Cope with State Space Explosion in Model Checking Technique for Deadlock Freeness\n", "abstract": " Model checking is an automatic technique for software verification through which all reachable states are generated from an initial state to finding errors and desirable patterns. In the model checking approach, the behavior and structure of system should be modeled. Graph transformation system is a graphical formal modeling language to specify and model the system. However, modeling of large systems with the graph transformation system suffers from the state space explosion problem which usually requires huge amounts of computational resources. In this paper, we propose a hybrid meta-heuristic approach to deal with this searching problem in the graph transformation system because meta-heuristic algorithms are efficient solutions to traverse the graph of large systems. Our approach, using Artificial Bee Colony and Simulated Annealing, replaces a full state space generation, only by producing part of it checking the safety, and finding errors (e.g., deadlock). The experimental results show that our proposed approach is more efficient and accurate compared to other approaches.", "num_citations": "3\n", "authors": ["1425"]}
{"title": "QoS-aware Scientific Application Scheduling Algorithm in Cloud Environment\n", "abstract": " Many complex scientific applications are modeled in the form of workflows to carry out large-scale experiments. Because of complexity of scientific processes, scientific workflows need intensive computation and data requirements. Clouds make opportunity for scientific that need high performance computing infrastructure. So scientific can run their application on cloud by their desired QoS. We propose an algorithm that able scientific to select execute plan based on their preference QoS, like time and cost. Proposed algorithm ranks the tasks in workflow and then use UPFF function for select accurate resource, based on user’s QoS. We compared our proposed algorithm with the same work by several scenarios and results show proposed algorithm has better efficiency.", "num_citations": "3\n", "authors": ["1425"]}
{"title": "An Energy-aware Real-time Task Scheduling Approach in a Cloud Computing Environment\n", "abstract": " Interest in cloud computing has grown considerably over recent years, primarily due to scalable virtualized resources. So, cloud computing has contributed to the advancement of real-time applications such as signal processing, environment surveillance and weather forecast where time and energy considerations to perform the tasks are critical. In real-time applications, missing the deadlines for the tasks will cause catastrophic consequences; thus, real-time task scheduling in cloud computing environment is an important and essential issue. Furthermore, energy-saving in cloud data center, regarding the benefits such as reduction of system operating costs and environmental protection is an important concern that is considered during recent years and is reducible with appropriate task scheduling. In this paper, we present an energy-aware task scheduling approach, namely EaRTs for real-time applications. We employ the virtualization and consolidation technique subject to minimizing the energy consumptions, improve resource utilization and meeting the deadlines of tasks. In the consolidation technique, scale up and scale down of virtualized resources could improve the performance of task execution. The proposed approach comprises four algorithms, namely Energy-aware Task Scheduling in Cloud Computing(ETC), Vertical VM Scale Up(V2S), Horizontal VM Scale up(HVS) and Physical Machine Scale Down(PSD). We present the formal model of the proposed approach using Timed Automata to prove precisely the schedulability feature and correctness of EaRTs. We show that our proposed approach is more efficient in terms of deadline …", "num_citations": "2\n", "authors": ["1425"]}
{"title": "A Context-Aware Task Distribution Approach for Wireless Sensor Actor Networks.\n", "abstract": " Abstract Wireless Sensor Actor Networks (WSANs) have contributed to the advancement of ubiquitous computing wherein time and energy considerations to perform the tasks of ubiquitous applications are critical. Therefore, real-timeliness and energy-awareness are amongst the grand challenges of WSANs. In this paper, we present a context-aware task distribution approach for assigning real-time tasks to cost-effective actors and for scheduling these tasks at actor level subject to minimizing the energy consumptions of actors and meeting the deadlines of tasks. The proposed approach comprises of three protocols, namely a Market-based Task Assignment Protocol (MaTAP), an Energy Calculation Protocol (ECaP), and a Context-aware Task Scheduling Protocol (CaTSP). We present the formal models of the proposed protocols using Timed Automata and prove their soundness to validate the correctness of the …", "num_citations": "2\n", "authors": ["1425"]}
{"title": "Measuring the Failure Rate in Service Oriented Architecture Using Fuzzy Logic\n", "abstract": " Service-Oriented architecture is a developing method to creating distributed programs for flexible and dynamic architecture and is highly suitable for expanding the distributing systems. The use of this architecture has increased the design of software systems. Reliability is the main challenge of this architecture. The fault tolerance mechanism is one of the existing mechanisms for creating reliable services and failure rate measurement of the system is a challenge for fault tolerance. In this paper we propose a method named Service-Oriented SysFailRate Measurement for measuring the failure rate of the system in service-oriented architecture using fuzzy logic. In this system we used incomplete description of a service, lack of integration, incorrect format, and being out of the pre-determined time out factors to measuring the failure rate. Testing rests demonstrated that this approach is promising to significantly improve measuring the failure rate in Service-Oriented architecture.", "num_citations": "2\n", "authors": ["1425"]}
{"title": "A mathematical approach to reduce the mean number of waiting tasks in wireless sensor actor networks\n", "abstract": " In this paper, we present a mathematical approach based on queuing theory to minimize the average number of allocated tasks to actors that have not been dispatched to actors yet for execution by the singleton network sink node in wireless sensor actor networks with semi-automated architecture. We calculate the best rate of dispatching of tasks by the network sink to allocated actors through a steady state analysis of our proposed model to solve equations and inequalities. We show that this dispatching rate reduces the overall completion time of all tasks in the network too. Experimental results on typical scenarios have shown 53% improvement in reducing the number of waiting tasks and 40% improvement in reducing the network makespan compared to stochastic allocation of tasks to actors. We also show that this makespan improvement results in more power savings in actors.[PUBLICATION ABSTRACT]", "num_citations": "2\n", "authors": ["1425"]}
{"title": "The comparison of visual acuity and induced astigmatism after phacoemulsification and extracapsular cataract extraction\n", "abstract": " Background and Aim: There are three methods for cataract extraction, extracapsular, intracapsular and phacoemulsification. The purpose of this study is determination of visual acuity and astigmatism before and after phaco and ECCE method and comparison of these two methods. Materials and Methods: In this cross-sectional study, the all of cataract surgery records investigated that were belong to one surgeon in 2006-2007. They were 100 phacoemulsification and 34 extra capsular cataract extraction. The data were analyzed in SPSS 14 using independent and paired t-test. Results: The mean of visual acuity before and after phaco and ECCE showed a considerable difference (P< 0.001). The mean of astigmatism before and after phaco did not show any difference (P= 0.7), But for ECCE did (P< 0.001). The comparison of astigmatism and visual acuity after phaco and ECCE showed a considerable statistical difference (P< 0.001). Conclusions: The result of this study showed that recovery rate of visual acuity was faster in phaco than ECCE and induced astigmatism after surgery had been lower for phaco than ECCE technique.", "num_citations": "2\n", "authors": ["1425"]}
{"title": "Efficient Web Services Composition with Fuzzy–Genetic Approach\n", "abstract": " Abstract owadays, Service-oriented architecture is known as a hopeful and effective solution for making the applications organizations which of business operations support as a set of welldefined service. Web services selection and composition are key activities which are done in of the various phases in the life cycle of service-oriented architecture. Selection a valuable web services due to existing many services and also having variety of criteria in the production process automatically and is difficult the selection work. Automatically production and selection web service is one of the important key activities in the implementation a successful service-oriented projects. Identify existing approaches are frequently prescriptive and experience-based architect. Thus it is possible lead to be non-suitable designs, reduce resulting performance, reducing of scalability and complex dependence between services. In this paper, we present an automatically method for identify business services. Using genetic algorithm and fuzzy logic can be production automated web service based on qualitative and quantitative characteristics. In this paper, architect can use metrics to measure characteristics of web services then is assured the abstraction level of web services. Genetic algorithm is for the automatic identification of web services and improved role of architect. Fuzzy logic selects web services based on user preferences. The user view has direct effect in rank for composition of service. Therefore user selected good composition of web service with our ideas. This approach in web services selection and composition compare to previous approaches have upper …", "num_citations": "1\n", "authors": ["1425"]}