{"title": "Algorithm and hardware implementation for visual perception system in autonomous vehicle: A survey\n", "abstract": " This paper briefly surveys the recent progress on visual perception algorithms and their corresponding hardware implementations for the emerging application of autonomous driving. In particular, vehicle and pedestrian detection, lane detection and drivable surface detection are presented as three important applications for visual perception. On the other hand, CPU, GPU, FPGA and ASIC are discussed as the major components to form an efficient hardware platform for real-time operation. Finally, several technical challenges are presented to motivate future research and development in the field.", "num_citations": "96\n", "authors": ["2269"]}
{"title": "Polychronous Controller Synthesis from MARTE CCSL Timing Specifications\n", "abstract": " The UML Profile for Modeling and Analysis of Real-Time and Embedded systems (MARTE) defines a mathematically expressive model of time, the Clock Constraint Specification Language (CCSL), to specify timed annotations on UML diagrams and thus provides them with formally defined timed interpretations. Thanks to its expressive capability, the CCSL allows for the specification of static and dynamic properties, of deterministic and non-deterministic behaviors, or of systems with multiple clock domains. Code generation from such multi-clocked specifications (for the purpose of synthesizing a simulator, for instance) is known to be a difficult issue. We address it by using the approach of controller synthesis. In our framework, a timed CCSL specification is regarded as a property whose satisfaction should be enforced for any UML diagram carrying it as annotation. To do so, CCSL statements are first translated into …", "num_citations": "45\n", "authors": ["2269"]}
{"title": "System-level Co-simulation of Integrated Avionics Using Polychrony\n", "abstract": " The design of embedded systems from multiple views and heterogeneous models is ubiquitous in avionics as, in particular, different high-level modeling standards are adopted for specifying the structure, hardware and software components of a system. The system-level simulation of such composite models is necessary but difficult task, allowing to validate global design choices as early as possible in the system design flow. This paper presents an approach to the issue of composing, integrating and simulating heterogeneous models in a system co-design flow. First, the functional behavior of an application is modeled with synchronous data-flow and statechart diagrams using Simulink/Gene-Auto. The system architecture is modeled in the AADL standard. These highlevel, synchronous and asynchronous, models are then translated into a common model, based on a polychronous model of computation, allowing …", "num_citations": "34\n", "authors": ["2269"]}
{"title": "Targeting Reconfigurable FPGA Based SoCs Using the UML MARTE Profile: from High Abstraction Levels to Code Generation\n", "abstract": " As SoC design complexity is escalating to new heights, there is a critical need to find adequate approaches and tools for handling SoC co-design aspects. Additionally, modern reconfigurable SoCs offer advantages over classical SoCs as they integrate adaptivity features to cope with mutable design requirements and environment needs. This paper presents a novel approach for addressing system adaptivity and reconfigurability. A generic model of reactive control is presented in a SoC co-design framework: Gaspard2. Afterwards, control integration at different levels of the framework is illustrated for both functional specification and FPGA synthesis. The presented works are based on model-driven engineering and the UML MARTE profile proposed by object management group, for modelling and analysis of real-time embedded systems. Our contributions thus relate to presenting a complete design flow to move …", "num_citations": "32\n", "authors": ["2269"]}
{"title": "A Case Study on Controller Synthesis for Data-Intensive Embedded Systems\n", "abstract": " This paper presents an approach for the safe design of data-intensive embedded systems. A multimedia application module of last generation cellular phones is considered as a case study. The OMG standard profile MARTE is used to adequately model the application. The resulting model is then transformed into a synchronous program from which a controller is synthesized by using a formal technique, in order to enforce the safe behavior of the modeled application while meeting quality of service requirements. The whole study is carried out in a design framework, GASPARD, dedicated to high-performance embedded systems.", "num_citations": "30\n", "authors": ["2269"]}
{"title": "Synchronous modeling and analysis of data intensive applications\n", "abstract": " We present the modeling of data-intensive parallel applications following the synchronous approach. We consider the GASPARD environment, which is dedicated to high-performance system-on-chip (SoC) codesign. Our motivation is to bridge the gap between the GASPARD design approach and the formal validation techniques provided by the synchronous technology. First, we define a synchronous dataflow equational model of GASPARD models. The modeling formalism adopted in GASPARD consists of an extension of the domain-specific language Array-OL. Then, we address correctness issues (e.g., causality and synchronizability analyses) about GASPARD models via their corresponding synchronous descriptions in order to formally validate the original system descriptions.", "num_citations": "29\n", "authors": ["2269"]}
{"title": "Next generation automotive architecture modeling and exploration for autonomous driving\n", "abstract": " To support emerging applications in autonomous and semi-autonomous driving, next-generation automotive systems will be equipped with an increasing number of heterogeneous components (sensors, actuators and computation units connected through various buses), and have to process a high volume of data to percept the environment accurately and efficiently. Challenges for such systems include system integration, prediction, verification and validation. In this work, we propose an architecture modeling and exploration framework for evaluating various software and hardware architecture options. The framework will facilitate system integration and optimization, and enable validation of various design metrics such as timing, reliability, security and performance.", "num_citations": "27\n", "authors": ["2269"]}
{"title": "Toward Polychronous Analysis and Validation for Timed Software Architectures in AADL\n", "abstract": " High-level architecture modeling languages, such as Architecture Analysis & Design Language (AADL), are gradually adopted in the design of embedded systems so that design choice verification, architecture exploration, and system property checking are carried out as early as possible. This paper presents our recent contributions to cope with clock-based timing analysis and validation of software architectures specified in AADL. In order to avoid semantics ambiguities of AADL, we mainly consider the AADL features related to real-time and logical time properties. We endue them with a semantics in the polychronous model of computation; this semantics is quickly reviewed. The semantics enables timing analysis, formal verification and simulation. In addition, thread-level scheduling, based on affine clock relations is also briefly presented here. A tutorial avionic case study, provided by C-S, has been adopted to …", "num_citations": "27\n", "authors": ["2269"]}
{"title": "System Synthesis from AADL Using Polychrony\n", "abstract": " The increasing system complexity and time to market constraints are great challenges in current electronic system design. Raising the level of abstraction in the design and performing fast yet efficient high-level analysis, validation and synthesis has been widely advocated and considered as a promising solution. Motivated by the same approach, our work on system-level synthesis is presented in this paper: use the high-level modeling, domain-specific, language AADL for system-level co-design; use the formal framework Polychrony, based on the synchronous language Signal, for analysis, validation and synthesis. According to SIGNAL's polychronous model of computation, we propose a model for AADL, which takes both software, hardware and allocation into account. This model enables an early phase timing analysis and synthesis via tools associated with Polychrony.", "num_citations": "24\n", "authors": ["2269"]}
{"title": "Safety guard: Runtime enforcement for safety-critical cyber-physical systems\n", "abstract": " Due to their safety-critical nature, cyber-physical systems (CPS) must tolerate faults and security attacks to remain fail-operational. However, conventional techniques for improving safety, such as testing and validation, do not meet this requirement, as shown by many of the real-world system failures in recent years, often with major economic and public-safety implications. We aim to improve the safety of critical CPS through synthesis of runtime enforcers, named safety guards, which are reactive components attached to the original systems to protect them against catastrophic failures. That is, even if the system occasionally malfunctions due to unknown defects, transient errors, or malicious attacks, the guard always reacts instantaneously to ensure that the combined system satisfies a predefined set of safety properties, and the deviation from the original system is kept at minimum. We illustrate the main ideas of this …", "num_citations": "22\n", "authors": ["2269"]}
{"title": "Safe Design of High-Performance Embedded Systems in an MDE Framework\n", "abstract": " In this paper, we use the UML MARTE profile to model high-performance embedded systems (HPES) in the GASPARD2 framework. We address the design correctness issue on the UML model by using the formal validation tools associated with synchronous languages, i.e., the SIGALI model checker, etc. This modeling and validation approach benefits from the advantages of UML as a standard, and from the number of validation tools built around synchronous languages. In our context, model transformations act as a bridge between UML and the chosen validation technologies. They are implemented according to a model-driven engineering approach. The modeling and validation are illustrated using the multimedia functionality of a new-generation cellular phone.", "num_citations": "22\n", "authors": ["2269"]}
{"title": "CONVINCE: A cross-layer modeling, exploration and validation framework for next-generation connected vehicles\n", "abstract": " Next-generation autonomous and semi-autonomous vehicles will not only precept the environment with their own sensors, but also communicate with other vehicles and surrounding infrastructures for vehicle safety and transportation efficiency. The design, analysis and validation of various vehicle-to-vehicle (V2V) and vehicle-to-infrastructure (V2I) applications involve multiple layers, from V2V/V2I communication networks down to software and hardware of individual vehicles, and concern with stringent requirements on multiple metrics such as timing, security, reliability and fault tolerance. To cope with these challenges, we have been developing CONVINCE, a cross-layer modeling, exploration and validation framework for connected vehicles. The framework includes mathematical models, synthesis and validation algorithms, and a heterogeneous simulator for inter-vehicle communications and intra-vehicle …", "num_citations": "21\n", "authors": ["2269"]}
{"title": "Timed behavioural modelling and affine scheduling of embedded software architectures in the AADL using Polychrony\n", "abstract": " High-level modelling languages and standards, such as Simulink, UML, SysML, MARTE and AADL (Architecture Analysis & Design Language), meet increasing adoption in the design of embedded systems in order to carry out system-level analysis, verification and validation (V&V) and architecture exploration, as early as possible. These analysis, V&V, architecture exploration techniques rely on mathematical foundations and formal methods in order to avoid semantics ambiguities in the design of safety-critical systems.In order to support integration validation, it is necessary to define a formal framework of virtual prototyping to integrate, verify, exercise and analyse the application code generated by modelling tools as early as possible and virtually integrate it with simulators of third-party middleware and hardware. Such a virtual prototyping platform makes it possible to validate the expected behaviour of the final …", "num_citations": "21\n", "authors": ["2269"]}
{"title": "The Challenge of Interoperability: Model-Based Integration for Automotive Control Software\n", "abstract": " Model-Based Engineering (MBE) is a promising approach to cope with the challenges of designing the next-generation automotive systems. The increasing complexity of automotive electronics, the platform, distributed real-time embedded software, and the need for continuous evolution from one generation to the next has necessitated highly productive design approaches. However, heterogeneity, interoperability, and the lack of formal semantic underpinning in modeling, integration, validation and optimization make design automation a big challenge, which becomes a hindrance to the wider application of MBE in the industry. This paper briefly presents the interoperability challenges in the context of MBE and summarizes our current contribution to address these challenges with regard to automotive control software systems. A novel model-based formal integration framework is being developed to enable …", "num_citations": "20\n", "authors": ["2269"]}
{"title": "A model for the mixed-design of data-intensive and control-oriented embedded systems\n", "abstract": " This paper presents a model and its semantics for the design of embedded systems that contain data-intensive parts such as multimedia applications, and require adaptivity w.r.t. criteria such as platform resources or quality of service (QoS). The proposed solution relies on a combination of: i) the repetitive model of computation dedicated to the design of high-performance embedded systems and ii) reactive control features based on finite state machines and modes. It is defined within a framework, called Gaspard, that implements automatic transformations that lead to various target languages, e.g., synchronous languages, SystemC, VHDL. The new model offers the adequate expressive power to describe complex behaviors of high-performance embedded systems. It also reconciles execution models dedicated to regular computations and control-oriented models that rather lead to irregular computations.", "num_citations": "18\n", "authors": ["2269"]}
{"title": "Polychronous Modeling, Analysis, Verification and Simulation for Timed Software Architectures\n", "abstract": " High-level modeling languages and standards, such as Simulink, SysML, MARTE and AADL (Architecture Analysis & Design Language), are increasingly adopted in the design of embedded systems so that system-level analysis, verification and validation (V&V) and architecture exploration are carried out as early as possible. This paper presents our main contribution in this aim by considering embedded systems architectural modeling in AADL and functional modeling in Simulink; an original clock-based timing analysis and validation of the overall system is achieved via a formal polychronous/multi-clock model of computation. In order to avoid semantics ambiguities of AADL and Simulink, their features related to real-time and logical time properties are first studied. We then endue them with a semantics in the polychronous model of computation. We use this model of computation to jointly analyze the non …", "num_citations": "17\n", "authors": ["2269"]}
{"title": "A MARTE Based Reactive Model for Data-Parallel Intensive Processing: Transformation toward the Synchronous Model\n", "abstract": " The work presented in this dissertation is carried out in the context of System-on-Chip (SoC) and embedded system design, particularly dedicated to data-parallel intensive processing applications (DIPs). Examples of such applications are found in multimedia processing and signal processing. On the one hand, safe design of DIPs is considered to be important due to the need of Quality of Service, safety criticality, etc., in these applications. However, the complexity of current embedded systems makes it difficult to meet this requirement. On the other hand, high-level safe and verifiable control, is highly demanded in order to ensure the correctness and strengthen the flexibility and adaptivity of DIPs. As an answer to this issue, we propose to take advantage of synchronous languages to assist safe DIPs design. First, a synchronous modeling bridges the gap between the Gaspard framework, which is dedicated to SoC design for DIPs, and synchronous languages that act as a model of computation enabling formal validation. The latter, together with their tools, enable high-level validation of Gaspard specifications. Secondly, a reactive extension and improvement to a previous control proposition in Gaspard, is also addressed. This extension is based on mode automata and contributes to conferring safe and verifiable features onto the previous proposition. As a result, model checking and discrete controller synthesis can be applied for the purpose of correctness verification. Finally, a Model-Driven Engineering (MDE) approach is adopted in order to implement and validate our proposition, as well as benefit from the advantages of MDE to address …", "num_citations": "17\n", "authors": ["2269"]}
{"title": "Exploring system architectures in AADL via Polychrony and SynDEx\n", "abstract": " Architecture analysis & design language (AADL) has been increasingly adopted in the design of embedded systems, and corresponding scheduling and formal verification have been well studied. However, little work takes code distribution and architecture exploration into account, particularly considering clock constraints, for distributed multi-processor systems. In this paper, we present an overview of our approach to handle these concerns, together with the associated toolchain, AADL-Polychrony-SynDEx. First, in order to avoid semantic ambiguities of AADL, the polychronous/multiclock semantics of AADL, based on a polychronous model of computation, is considered. Clock synthesis is then carried out in Polychrony, which bridges the gap between the polychronous semantics and the synchronous semantics of SynDEx. The same timing semantics is always preserved in order to ensure the correctness …", "num_citations": "14\n", "authors": ["2269"]}
{"title": "Cyber-physical system design from an architecture analysis viewpoint\n", "abstract": " The term cyber-physical system (CPS) was introduced by Helen Gill at the NSF referring to the integration of computation and physical processes. In CPS, embedded computers and networks monitor and control the physical processes, usually with feedback loops where physical processes affect computations and vice versa. The principal challenges in system design lie in this perpetual interaction of software, hardware, and physics.CPS safety is often critical for society in many applications such as transportations, whether automotive, trains or airplanes, power distribution, medical equipment, or tele-medicine. Whether or not life is threatened, failures may have huge economic impact. Developing reliable CPS has become a critical issue for the industry and society. Safety and security requirements must be ensured by means of strong validation tools. Satisfying such requirements including quality of service implies …", "num_citations": "11\n", "authors": ["2269"]}
{"title": "Cooperation or competition? Coexistence of safety and security in next-generation Ethernet-based automotive networks\n", "abstract": " Safety is traditionally the most relevant property for automotive systems, and it is further enhanced by Advanced Driver Assistance Systems (ADAS) in modern automotive systems. To support ADAS and other advanced autonomous functions, automotive electronic systems become more distributed and connected than ever, with in-vehicle architecture or Vehicle-to-X (V2X) communication. These connections create a variety of interfaces which become breeding grounds for security attacks. Accordingly, security becomes a rising issue for automotive systems. In this paper, we address safety and security together, especially their interactions, in Ethernet-based automotive networks which are believed to be the next-generation automotive networks since they are able to provide high bandwidths, certain timing guarantees, and well-developed technologies. We discuss the interactions between safety and security in three …", "num_citations": "11\n", "authors": ["2269"]}
{"title": "Gaspard2 UML profile documentation\n", "abstract": " This document describes the current UML profile of Gaspard2. This profile extends the UML semantics to allow the user to describe a SoC (System-on-Chip) in three steps: the application (behavior of the Soc), the hardware architecture, and the association of the application to the hardware architecture. The application is represented following a data flow model, but additional mechanisms permit the usage of control flow on those applications. In addition to those notions, the profile contains a package introducing factorization mechanisms to enable the compact description of massively parallel and repetitive systems.", "num_citations": "11\n", "authors": ["2269"]}
{"title": "Security concerns for automotive communication and software architecture\n", "abstract": " Cyber security concerns in the automotive industry have been constantly increasing as automobiles are more computerized and networked. Recent successful hacks of modern vehicles demonstrate the big security concerns for automotive systems. However it is still very hard and even impossible to predict what kinds of security issues will happen. In this paper, we present the automotive security concerns from several different and fundamental points of view: communication, system and software architecture. We first discuss different security concerns related to communication media and protocols, such as CAN bus and Ethernet. We then consider concerns for automotive architecture: general system architecture and AUTOSAR-based architecture. For each view, we summarize the open questions and challenges in the design of secured automotive systems. In spite of addressing security concerns with very …", "num_citations": "10\n", "authors": ["2269"]}
{"title": "Polychronous Analysis of Timing Constraints in UML MARTE\n", "abstract": " The UML Profile for Modeling and Analysis of Real-Time and Embedded systems (MARTE) defines a broadly expressive Time Model to provide a generic timed interpretation for UML models. As a part of MARTE, Clock Constraint Specification Language (CCSL) allows the specification of systems with multiple clock domains as well as nondeterminism. In this paper, we propose to take advantage of Polychrony clock calculus, named hierarchization, to analyze timed systems specified in CCSL, and to generate code for simulation considering determinism. Hierarchization enables to identify the endochrony property in a system that allows code generation ensuring determinism. The presented work is being integrated into the TimeSquare environment dedicated to the simulation of MARTE timed systems.", "num_citations": "10\n", "authors": ["2269"]}
{"title": "Compositional verification for autonomous systems with deep learning components\n", "abstract": " As autonomy becomes prevalent in many applications, ranging from recommendation systems to fully autonomous vehicles, there is an increased need to provide safety guarantees for such systems. The problem is difficult, as these are large, complex systems which operate in uncertain environments, requiring data-driven machine-learning components. However, learning techniques such as Deep Neural Networks, widely used today, are inherently unpredictable and lack the theoretical foundations to provide strong assurance guarantees. We present a compositional approach for the scalable, formal verification of autonomous systems that contain Deep Neural Network components. The approach uses assume-guarantee reasoning whereby contracts, encoding the input–output behavior of individual components, allow the designer to model and incorporate the behavior of the learning-enabled …", "num_citations": "8\n", "authors": ["2269"]}
{"title": "Model-Driven Engineering and Formal Validation of High-Performance Embedded Systems\n", "abstract": " The study presented in this paper concerns the safe design of high-performance embedded systems, specifically dedicated to intensive data-parallel processing as found, for instance, in modern multimedia applications or radar/sonar signal processing. Among the important requirements of such systems are the efficient execution, reliability and quality of service. Unfortunately, the complexity of modern embedded systems makes it difficult to meet all these requirements. As an answer to this issue, this paper proposes a combination of two models of computation (MoCs) within a framework, called Gaspard, in order to deal with the design and validation of high-performance embedded systems. On the one hand, the repetitive MoC offers a powerful expression of the parallelism available in both system functionality and architecture. On the other hand, the synchronous MoC serves as a formal model on which a trustworthy verification can be applied. Here, the high-level models specified with the repetitive MoC are translated into an equational model in the synchronous MoC so as to be able to formally analyze different properties of the modeled systems. As an example, a clock synchronizability analysis is illustrated on a multimedia system in order to guarantee a correct interaction between its components. For the implementation and validation of our proposition, a Model-Driven Engineering (MDE) approach is adopted. MDE is well-suited to deal with design complexity and productivity issues. In our case, the OMG standard MARTE profile is used to model embedded systems. Then, automatic transformations are applied to these models to produce the …", "num_citations": "8\n", "authors": ["2269"]}
{"title": "Model Transformations from a Data Parallel Formalism towards Synchronous Languages\n", "abstract": " The increasing complexity of embedded system designs calls for highlevel specification formalisms and for automated transformations towards lowerlevel descriptions. In this paper, a metamodel and a transformation chain are defined from a high-level modeling framework, Gaspard, for data-parallel systems towards a formalism of synchronous equations. These equations are translated in synchronous data-flow languages, such as Lustre, which provide designers with formal techniques and tools for validation. In order to benefit from the methodological advantages of re-usability and platform-independence, a Model-Driven Engineering approach is applied.", "num_citations": "8\n", "authors": ["2269"]}
{"title": "Targeting Reconfigurable FPGA based SoCs using the MARTE UML profile: from high abstraction levels to code generation\n", "abstract": " As SoC design complexity is escalating to new heights, there is a critical need to find adequate approaches and tools to handle SoC co-design aspects. Additionally, modern reconfigurable SoCs offer advantages over classical SoCs as they integrate adaptivity features to cope with mutable design requirements and environment needs. This paper presents a novel approach to address system adaptivity and reconfigurability. A generic model of reactive control is presented in a SoC codesign framework: Gaspard. Afterwards, control integration at different levels of the framework is illustrated for both functional specification and FPGA synthesis. The presented work is based on Model-Driven Engineering and the UML MARTE profile proposed by Object Management Group, for modeling and analysis of real-time embedded systems. The paper thus presents a complete design flow to move from high level MARTE models to code generation, for implementation of dynamically reconfigurable SoCs.", "num_citations": "7\n", "authors": ["2269"]}
{"title": "2007.\n", "abstract": " private research center archive ouverte pluridisciplinaire hal franc ai ou trangers sci-entific research document research institution destine au multi-disciplinary open access archive ech er ch ou non document scientifiques", "num_citations": "5\n", "authors": ["2269"]}
{"title": "Safe, Autonomous and Intelligent Vehicles\n", "abstract": " An autonomous and intelligent system generally refers to a system that can automatically sense and adapt to dynamically varying environment. The term broadly covers numerous emerging and critical applications including self-driving vehicles, unmanned aircraft systems, and autonomous ships. A broad application of modern artificial intelligence and machine learning technologies is featured in these systems.The design, modeling, verification, and validation of today’s autonomous and intelligent systems have become increasingly challenging with growing functional complexity in scale and features, the integration of new artificial intelligence and machine learning technologies, the adoption of more distributed and networked architectural platforms, and stringent demands on various design constraints imposed by performance, fault tolerance, reliability, extensibility, and security. The aforementioned trend on …", "num_citations": "4\n", "authors": ["2269"]}
{"title": "Mapping Functional Behavior onto Architectural Model in a Model Driven Embedded System Design\n", "abstract": " The ever-increasing complexity in embedded systems especially in the automobile industry in the recent years has necessitated model-driven engineering. In this paper, we consider the problem of mapping functional behavior onto an architectural model captured in AADL in order to optimize end-to-end delay in executing a distributed function on the specified platform architecture. Our work presupposes that an architectural platform model is fixed due to existing hardware platform that the designers have to work with, whereas a specific functional feature is being designed in software, and implemented on the given platform. We therefore, consider the problem as a behavior modeling followed by mapping of behavioral components including computation, and communication. This mapping requires both spatial mapping as well as temporal mapping. Spatial mapping means binding of computational nodes in the …", "num_citations": "4\n", "authors": ["2269"]}
{"title": "Modeling and Formal Validation of High-Performance Embedded Systems\n", "abstract": " This paper presents an approach for the modeling and formal validation of high-performance systems. The approach relies on the repetitive model of computation used to express the parallelism of such systems within the Gaspard framework, which is dedicated to the codesign of high-performance system-on-chip. The system descriptions obtained with this model are then projected on the synchronous model of computation. The result of this projection consists of an equational model that allows one to formally analyze clock synchronizability issues so as to guarantee the reliable deployment of systems on platforms.", "num_citations": "4\n", "authors": ["2269"]}
{"title": "Efficient statistical validation of autonomous driving systems\n", "abstract": " Today’s automotive vehicles are often equipped with powerful data processing systems for driver assistance and/or autonomous driving. To meet the rigorous safety standard, ensuring extremely small failure probability over all possible operation conditions is one of the critical tasks for an autonomous driving system. In this chapter, we describe a novel methodology to validate vision-based autonomous driving systems over different circuit corners with consideration of temperature variation and circuit aging. Our approach seamlessly integrates the image data recorded under nominal conditions with comprehensive statistical circuit models to synthetically generate the critical corner cases for which an autonomous driving system is likely to fail. As such, a given automotive system can be robustly validated for these worst-case scenarios that cannot be easily captured by physical experiments. To efficiently …", "num_citations": "3\n", "authors": ["2269"]}
{"title": "Compositional Verification for Autonomous Systems with Deep Learning Components\n", "abstract": " As autonomy becomes prevalent in many applications, ranging from recommendation systems to fully autonomous vehicles, there is an increased need to provide safety guarantees for such systems. The problem is difficult, as these are large, complex systems which operate in uncertain environments, requiring data-driven machine-learning components. However, learning techniques such as Deep Neural Networks, widely used today, are inherently unpredictable and lack the theoretical foundations to provide strong assurance guarantees. We present a compositional approach for the scalable, formal verification of autonomous systems that contain Deep Neural Network components. The approach uses assume-guarantee reasoning whereby {\\em contracts}, encoding the input-output behavior of individual components, allow the designer to model and incorporate the behavior of the learning-enabled components working side-by-side with the other components. We illustrate the approach on an example taken from the autonomous vehicles domain.", "num_citations": "3\n", "authors": ["2269"]}
{"title": "Compatibility module to support an automotive system upgrade\n", "abstract": " The disclosure includes a system and method for removing an incompatibility between an adaptive sensor system and an adaptive engine control unit system. The method may include detecting an update to one or more of an adaptive sensor system and an adaptive engine control unit system. The method may include identifying an incompatibility between the adaptive sensor system and the adaptive engine control unit system created by the update. The method may include determining one or more modifications for one or more of the first compatibility module and the second compatibility module. The modifications may be configured to remove the incompatibility. The method may include modifying one or more of the first compatibility module and the second compatibility module so that the incompatibility is removed.", "num_citations": "3\n", "authors": ["2269"]}
{"title": "Towards an Architecture-Centric Approach dedicated to Model-Based Virtual Integration for Embedded Software Systems\n", "abstract": " Current embedded systems are increasingly more complex and heterogeneous, but they are expected to be more safe, reliable and adaptive. In consideration of all these aspects, their design is always a great challenge. Developing these systems with conventional design approaches and programming methods turns out to be difficult. In this paper, we mainly present the informative background and the general idea of an ongoing yet young research project, including the modelbased design and an architecture-centric approach, to address previous challenges. Our idea adopts a formal-methods-based model integration approach, dedicated to architecture-centric virtual integration for embedded software systems, in an early design phase. We thus expect to improve and enhance Correct By Construction in the design. The considered formal methods consist of timing specification, design by contracts, and semantics interoperability for models to be integrated in the system. The application domains of our approach include automotive and avionic systems.", "num_citations": "3\n", "authors": ["2269"]}
{"title": "Decentralized Air Traffic Management for Advanced Air Mobility\n", "abstract": " Leading proposals for Advanced Air Mobility (AAM) recognize the need for strategic and tactical airspace deconfliction, where the need for coordination appears in different forms and nuances. One recurring element is the use of pre-defined airways or corridors, a natural way to create order, with proven success from the conventional, manned, Air Traffic Management (ATM). But, while ATM is evolving to 4D Trajectory-Based Operations, when we apply the ATM principles to very dense and potentially more complex operations such as AAM, we have to consider their limitations in such demanding new environment. The requirement of following circulation corridors most often increase flight distance and inevitably create bottlenecks, hence we explore the hypothesis of not using corridors, testing such option via a simple and scalable simulation model.Other motivations for comparing different forms of traffic …", "num_citations": "2\n", "authors": ["2269"]}
{"title": "Model-based integration for automotive control software\n", "abstract": " Model-Based Engineering (MBE) is a promising approach to cope with the challenges of designing the next-generation automotive systems. The increasing complexity of automo- tive electronics, the platform, distributed real-time embed- ded software, and the need for continuous evolution from one generation to the next has necessitated highly productive design approaches. However, heterogeneity, interoperabil- ity, and the lack of formal semantic underpinning in mod- eling, integration, validation and optimization make design automation a big challenge, which becomes a hindrance to the wider application of MBE in the industry. This paper briefly presents the interoperability challenges in the context of MBE and summarizes our current contribution to address these challenges with regard to automotive software control systems. A novel model-based formal integration framework is being developed to enable …", "num_citations": "2\n", "authors": ["2269"]}
{"title": "A Flexible Method to Tolerate Value Sensor Failures\n", "abstract": " Tolerating the value failures of sensors is an important problem in automated control processes and plants. In this paper, we address this problem in a theoretical framework in order to demonstrate the feasibility of an automatic method based on discrete controller synthesis. We consider a fault-intolerant program whose job is to control an automated process, here a liquid tank equipped with level sensors that can be subject to value faults. This fault-intolerant program is modeled as a finite labeled transition system. We then specify formally a fault hypothesis, i.e., how many sensors can fail simultaneously. We use discrete controller synthesis to obtain automatically a program, having the same behavior as the initial fault-intolerant one, and satisfying the fault tolerance requirements under the fault hypothesis. We advocate that, thanks to the use of discrete controller synthesis, our method offers flexibility, reliability …", "num_citations": "2\n", "authors": ["2269"]}
{"title": "Assured Integration of Machine Learning-based Autonomy on Aviation Platforms\n", "abstract": " Dynamic assurance cases (DACs) are a novel concept for the provision of assurance—both during development and, subsequently, continuously in operation—that can be usefully applied to machine learning (ML)-based autonomous systems. We describe the application of a DAC for dependability assurance of an aviation system that integrates ML-based perception to provide an autonomous taxiing capability. Specifically, we present how we: i) formulate and capture risk-based safety and performance objectives, ii) model architectural mechanisms for risk reduction, iii) record the rationale that justifies relying upon autonomy, itself underpinned by heterogeneous items of verification and validation evidence, and iv) develop and integrate a computable notion of confidence that enables a run-time risk assessment and, in turn, dynamic assurance. We also describe our evaluation efforts, currently based on a hardware …", "num_citations": "1\n", "authors": ["2269"]}
{"title": "Adaptivity in high-performance embedded systems: a reactive control model for reliable and flexible design\n", "abstract": " System adaptivity is increasingly demanded in high-performance embedded systems, particularly in multimedia system-on-chip (SoC), owing to growing quality-of-service requirements. This paper presents a reactive control model that has been introduced in Gaspard, our framework dedicated to SoC hardware/software co-design. This model aims at expressing adaptivity as well as reconfigurability in systems performing data-intensive computations. It is generic enough to be used for description in the different parts of an embedded system, for example, specification of how different data-intensive algorithms can be chosen according to some computation modes at the functional level; and expression of how hardware components can be selected via the usage of a library of intellectual properties according to execution performances. The transformation of this model toward synchronous languages is also presented …", "num_citations": "1\n", "authors": ["2269"]}
{"title": "Vers des Transformations d'Applications à Parallélisme de Données en Equations Synchrones\n", "abstract": " Ce papier présente les premiers résultats d'une étude concernant la transformation d'applications à parallélisme de données en équations synchrones. Les applications considérées sont exprimées à l'aide du métamodèle GASPARD qui étend le langage ARRAY-OL, dédié aux applications de traitement de données intensives. Le principe général des transformations envisagées est exposé ainsi que les idées de mise en oeuvre. Les modèles synchrones résultants permettent d'aborder plusieurs questions liées à la validation formelle, par exemple, vérification de propriétés de synchronisabilité, de latence, etc, en utilisant les outils et techniques formels offerts par la technologie synchrone. Ils permettent ainsi l'accès à des fonctionnalités complémentaires avec celles de l'environnement associé à GASPARD, qui propose uneméthodologie de conception conjointe matériel/logiciel de systèmes intégrés sur puce. Les transformations suivront une approche d'Ingénierie dirigée par les modèles (IDM/MDE). Des perspectives sont mentionnées concernant l'introduction d'automates de contrôle au sein des modèles obtenus.", "num_citations": "1\n", "authors": ["2269"]}