{"title": "Software process improvement as emergent change: A structurational analysis\n", "abstract": " This paper presents a framework that draws on Structuration theory and dialectical hermeneutics to explicate the dynamics of software process improvement (SPI) in a packaged software organisation. Adding to the growing body of qualitative research, this approach overcomes some of the criticisms of interpretive studies, especially the need for the research to be reflexive in nature.Our longitudinal analysis of the case study shows SPI to be an emergent rather than a deterministic activity: the design and action of the change process are shown to be intertwined and shaped by their context. This understanding is based upon a structurational perspective that highlights how the unfolding/realisation of the process improvement (intent) are enabled and constrained by their context. The work builds on the recognition that the improvements can be understood from an organisational learning perspective. Fresh insights to …", "num_citations": "98\n", "authors": ["383"]}
{"title": "Cloud computing: Adoption issues for sub‐saharan African SMEs\n", "abstract": " This paper explores the emergence and adoption of cloud computing by small and medium‐sized enterprises (SMEs) and points towards its implications for developing countries in sub‐Saharan Africa. Several studies have shown the importance of technologies to SMEs and the potentials of SMEs for economic growth. Using qualitative techniques we obtained and analysed data from ten SMEs that have adopted cloud computing as an IT strategy. These SMEs span across various sectors including finance, information and communication technology (ICT), and manufacturing in Nigeria, a developing country in sub‐Saharan Africa. We found that, contrary to the literature on cloud computing adoption in the global north, these SMEs are less concerned with challenges like security, privacy and data loss rather; they continue to show optimism in using the potential opportunities that cloud computing presents to them …", "num_citations": "83\n", "authors": ["383"]}
{"title": "Organizational factors shaping software process improvement in small-medium sized software teams: A multi-case analysis\n", "abstract": " Previous work looking at software process improvement (SPI) in small organizations has highlighted difficulties faced by small organizations in implementing SPI successfully, but there is little analysis to understand why this is from an organization theory perspective. This paper presents an analysis of SPI across six software teams in the UK using a framework based on Giddens' Structuration Theory. Using a structurational perspective helps to draw out how the process improvements are enabled and constrained by their context. By comparing these across the six situations the key similarities and differences across the cases are highlighted. This work extends the existing literature by helping to identify the areas of risk that need managing in small SPI initiatives. The study shows the issues as pertained to the six contexts and actions in each case. The paper highlights how the context influences the outcome.", "num_citations": "48\n", "authors": ["383"]}
{"title": "Executive information systems: An evaluation of current UK practice\n", "abstract": " Executive information systems (EIS) have become an established part of the information systems infrastructure for large organizations. A review of how UK organizations have applied EIS was undertaken, the results from the study are presented and discussed. The findings show many successes in the implementation of EIS, such as the accessibility to managers of the organization's information resources. The monitoring of internal activity by middle management was identified as the principle application of EIS. However, to deliver their full potential, EIS need to be used by senior management to analyse the organization's strategic goals. By comparing the development methods in the study with the theoretical and experiential approaches shown in the literature, the paper shows how the techniques currently utilized could be improved to provide executives with better technological support.", "num_citations": "36\n", "authors": ["383"]}
{"title": "Situation awareness in context-aware case-based decision support\n", "abstract": " Humans naturally reuse recalled knowledge to solve problems and this includes understanding the context i.e. the information that identifies or characterizes these problems. For problems in complex and dynamic environments, providing effective solutions by operators requires their understanding of the situation of the environment together with the context. Context-aware case-based reasoning (CBR) applications uses the context of users to provide solutions to problems. The combination of a context-aware CBR with general domain knowledge has been shown to improve similarity assessment, solving domain specific problems and problems of uncertain knowledge. Whilst these CBR approaches in context awareness address problems of incomplete data and domain specific problems, future problems that are situation-dependent cannot be anticipated due to lack of the facility to predict the state of the …", "num_citations": "27\n", "authors": ["383"]}
{"title": "A virtual learning environment for introductory programming.\n", "abstract": " Teaching of initial programming is a significant pedagogical problem for computing departments. It is shown that by understanding the changing characteristics of computing students helps to identify their learning approaches and requirements. These findings are used to explain the rationale for the development and use of a virtual learning environment to support the learning of introductory programming.", "num_citations": "27\n", "authors": ["383"]}
{"title": "Information systems professional development: a work-based learning model\n", "abstract": " The information systems profession faces a skills shortage which needs to be addressed if organisations are to take on advanced technology and current information management thinking. Companies need to encourage their staff to enhance and maintain their skills through ongoing development. A model is described showing how higher education can support the development of information systems professionals. The model ensures that the learning is not limited to the classroom but is work-based. The active nature of the learning ensures that relevant technology and techniques are applied directly into the key areas of the company. Experience of using learning contracts for individual work-based post-graduate degrees is reported. This experience is used to show how the model can be developed to deliver a broader scheme to support wider participation.", "num_citations": "25\n", "authors": ["383"]}
{"title": "Cloud‐computing: Adoption issues for Ethiopian public and private enterprises\n", "abstract": " This paper explores the emergence and adoption of cloud computing by enterprises in sub‐Saharan Africa. Several studies have shown the benefits of cloud technologies for enterprises. Using qualitative techniques we obtained and analyzed data from nine enterprises regarding the adoption of cloud computing as an IT strategy. These enterprises span the finance, information and communication technology (ICT) training, research, construction and manufacturing sectors in Ethiopia. We found that, contrary to the literature on cloud computing adoption in the global north, these enterprises are yet to adopt cloud computing as an IT provisioning method and they lack awareness of the advantages and disadvantages of adopting the cloud. The enterprises are concerned with challenges like security, privacy and trust issues as well as government telecommunications infrastructure policies and cloud technology skills …", "num_citations": "19\n", "authors": ["383"]}
{"title": "Migrating software products to the cloud: an adaptive STS perspective.\n", "abstract": " Cloud computing, as a disruptive innovation, has the potential to adversely affect companies. The effects can be particularly extreme for small and medium sized enterprises (SMEs). Subsequently, considerations of organisational resilience should be made when integrating with disruptive innovations like cloud computing. This paper reports of a longitudinal study investigating how a set of SME high-value software vendors are migrating their software products to the cloud. Adaptive socio-technical systems (ASTSs) concepts are used to provide a framework for understanding the adoption process. This study draws out a set of macro and micro themes relating to key phases of strategy development, the migration process and the impact on customer perceptions. From the findings, more systemic and holistic approaches are identified to address key tensions through the adoption life cycle while considering …", "num_citations": "19\n", "authors": ["383"]}
{"title": "Agile method tailoring in a CMMI level 5 organization\n", "abstract": " We investigate the use and tailoring of agile methods in a highly disciplined CMMI Level 5 organization. We explore gaps between traditional agile practices and those required for enhanced levels of governance required by CMMI appraisal. We conducted a case study with recorded interviews from practitioners at NIIT Technology Ltd. The interviews were iteratively analysed and coded. Our findings show that agile methods must be supplemented with pre-sprint planning, evidence recording, project metrics, team self-organization, process standardization, and process base-lining to support the CMMI appraisal. There are challenges around Agile compliance with CMMI Level 4 processes and misconceptions about agile methods precluding documentation of the rationale for design decisions. This research contributes data to the tailoring of agile methods in a high-maturity CMMI context and will be useful for agile …", "num_citations": "19\n", "authors": ["383"]}
{"title": "Case-based situation awareness\n", "abstract": " Situation-aware case-based decision support (SACBDS) systems comprise two distinct parts: situation awareness (SA) and case-based reasoning (CBR). The SA part keeps a finite history of the time space information of the domain and uses rules to interpret cues from the environment with respect to an individual user's context, and then anticipates future situations by performing statistical inference over historical data. The CBR part is the part that seeks to accomplish a particular task with knowledge of the environment from the SA component. This paper discusses the fusion of the CBR model and the SA model into a case-based situation awareness (CBSA) model for situation awareness based on experience rather than rule, similarity assessment and problem solving prediction. The CBSA system perceives the users' context and the environment and uses them to understand the current situation by retrieving …", "num_citations": "19\n", "authors": ["383"]}
{"title": "Towards an agile approach to software process improvement: addressing the changing needs of software products.\n", "abstract": " This paper highlights the need for greater agility and flexibility in the process improvement activity. The ideas presented here relate to aspects that have arisen from a case study of a global software product organisation. A model of how software process improvement can be agile in nature is proposed. This model is intended as indicative of the issues that need consideration by IS management. The model highlights the need to learn to improve through situated practice within an organisational framework that supports the needs of the business.", "num_citations": "19\n", "authors": ["383"]}
{"title": "User interface design for situation-aware decision support systems\n", "abstract": " Information recall about general situations incurs memory and cognitive loads on operators. Recognition of information for specific situations identified with users' context and the state of the world is helpful to operators in performing tasks in complex environments. The emergence of ubiquitous, ambient, and pervasive technologies is increasingly providing methods to help operators to perform their tasks in smart and intelligent ways. Existing user interface design does not solve the problem of drawing together the information required for situation-aware decision support systems in a way that minimises cognitive load. This paper discusses a framework for user interface design of situation-aware systems that exploit inputs from users and the environment to provide information tailored to the user's tasks in specific situations. The user interface can reconfigure automatically in order to adapt to the current situation. The …", "num_citations": "17\n", "authors": ["383"]}
{"title": "ODYSSEY: Software development life cycle ontology\n", "abstract": " With the omnipresence of softwares in our Society from Information Technology (IT) services to autonomous agents, their systematic and efficient development is crucial for software developers. Hence, in this paper, we present an approach to assist intelligent agents (IA), whatever human beings or artificial systems, in theirs task to develop and configure softwares. The proposed method is an ontological, developer-centred approach aiding a software developer in decision making and interoperable information sharing through the use of the ODYSSEY ontology we developed for the software development life cycle (SDLC) domain. This ODYSSEY ontology has been designed following the Enterprise Ontology (EO) methodology and coded in Descriptive Logic (DL). Its implementation in OWL has been evaluated for case studies, showing promising results.", "num_citations": "13\n", "authors": ["383"]}
{"title": "Design and Test (D & T) of an in-flight entertainment system with camera modification\n", "abstract": " In-flight entertainment (IFE) systems are human-machine systems which allow (i) the communication between the crew and passengers about flight information, and (ii) the interaction of a passenger with the multimedia content available on board, e.g. films, music, etc., usually using a touchscreen. In this paper, we present the robust design and development of a new in-flight entertainment system presenting a camera modification (IFECaM) to allow further functionalities to an IFE system such as (iii) the cooperation between passengers. The design of the IFECaM has followed the Design and Test (D&T) approach and has incorporated DO-178C and DO-331 aerospace norms. Tests have been carried out according to the standards and have demonstrated the excellent performance of our interactive, multimedia in-flight entertainment system.", "num_citations": "11\n", "authors": ["383"]}
{"title": "Managing change in SPI: a framework for addressing resistance\n", "abstract": " 6. SPI first steps SPI first steps is the name given for internal training on SPI practices (CMMI/ISO 15504/other). This training session is given to the core team. During the training, each area is assessed by team members to increase awareness of the gap between what is practiced in the field and what the SPI practice requires. Even if the organization is just starting the project, this personal and team gap analysis creates the necessary urgency to push through the initial doubts of the project.", "num_citations": "10\n", "authors": ["383"]}
{"title": "Overcoming structural resistance in SPI with change management\n", "abstract": " SPI initiatives can be seen as change programmes. Previous work has identified that such programmes are subject to resistance. A key challenge in the area is to understand the political issues in SPI change. However, at present there is little existing work in SPI related to the politics of improving. By adopting a view of politics as central to contemporary organizations, this paper reviews how we might understand resistance, how and why resistance occurs, and the implications of resistance for SPI. We provide a more detailed understanding of change management models (Katter's 8 steps and Prosci's Change Management Model) and their use in addressing resistance in SPI. It is argued that change management models can be used to accommodate the human factor of change in SPI. The paper explains the activities that help the successes of SPI initiatives and their relationship with the change management …", "num_citations": "10\n", "authors": ["383"]}
{"title": "Utilising buffer management to manage uncertainty and focus improvement\n", "abstract": " Production planning and control (PP&C) systems hold two conflicting requirements in tension; on the one hand achieving an optimal plan and on the other ensuring reliable execution of that plan. Demand and process variability underlie this tension and drive the need to protect the plan through the use of buffering in the form of inventory, capacity and forward load. Simplified Drum-Buffer-Rope (SDBR) is a PP&C methodology that attempts to resolve this conflict by integrating the planning process with buffer management. This paper describes buffer management in the context of SDBR and how it has been applied within a fresh food processing company (FCF). The paper concludes that the approach is well suited to companies such as FCF where the market demands short reliable lead times in the context of high levels of variation and uncertainty. The results of this action research are discussed together with the wider issues surrounding the need to manage buffers in the context of PP&C systems.", "num_citations": "8\n", "authors": ["383"]}
{"title": "Learning to improve software processes: Making sense of practice\n", "abstract": " Software Process Improvement (SPI) programs are frequently considered to be planned in nature. However, there is recent evidence to suggest that SPI can be understood as a form of learning. Drawing on the organizational learning literature, this paper proposes an active learning perspective of improvements in processes. This view recognizes the various actors in the project to be reflective in their actions, making sense of the current context and thus designing their use of the process to best suit their needs at the time. The changes in the processes emerge through ongoing adjustments, experimentation and improvisation as developers and managers seek to improve their product development.", "num_citations": "7\n", "authors": ["383"]}
{"title": "Disentangling the impact of social disadvantage on ‘becoming employable’: evidence from STEM student university-to-work transitions\n", "abstract": " This article aims to examine alternative explanations of social disadvantage on the university-to-work transition experiences of science, technology, engineering and mathematics (STEM) students. ‘Becoming employable’ during the university-to-work transition is reflected in three ways: students’ cognition/patterns of thinking (i.e. perceived employability); affect/emotion (i.e. anxiety); and career-related behaviour (i.e. job search and networking). To understand how social disadvantage affects ‘becoming employable’, we examine three potential explanations: students’ social background, type of higher education institution attended and individual financial strain. A cross-sectional survey design targeted at final year students in two UK Higher Education Institutions provided 288 survey responses. Findings show support for an institutional explanation to ‘becoming employable’. The study contributes to our understanding …", "num_citations": "6\n", "authors": ["383"]}
{"title": "Assembling cloud-based geographic information systems: A pragmatic approach using off-the-shelf components\n", "abstract": " In this chapter, we present a novel systematic way of building a web-based geographic information system (GIS) running on cloud services. The proposed architecture aims to provide a design pattern for building a cloud-based GIS using simple and readily available low-cost tools with great overall system efficiency. The result of running the GIS using this paradigm is arguably reliable and available at low cost and with some platform independence. It has required significantly less time and effort to deploy when compared with standard cloud development. We present a case study based on road accidents using Microsoft Windows Azure and Amazon Web Services. In this case study, a GIS was created that helped in improvements of road conditions by identifying road accident hot spots in real time and", "num_citations": "6\n", "authors": ["383"]}
{"title": "Automated software quality visualisation using fuzzy logic techniques.\n", "abstract": " In the past decade there has been a concerted effort by the software industry to improve the quality of its products. This has led to the inception of various techniques with which to control and measure the process involved in software development. Methods like the Capability Maturity Model have introduced processes and strategies that require measurement in the form of software metrics. With the ever increasing number of software metrics being introduced by capability based processes, software development organisations are finding it more difficult to understand and interpret metric scores. This is particularly problematic for senior management and project managers where analysis of the actual data is not feasible. This paper proposes a method with which to visually represent metric scores so that managers can easily see how their organisation is performing relative to quality goals set for each type of metric …", "num_citations": "5\n", "authors": ["383"]}
{"title": "Privacy through security: Policy and practice in a small-medium enterprise\n", "abstract": " The chapter discusses how one small business planned for, and implemented, the security of its data in a new enterprise-wide system. The company’s data was perceived as sensitive, and any breach of privacy as commercially critical. From this perspective, the chapter outlines the organizational and technical facets of the policies and practices evidenced. Lessons for other businesses can be drawn from the case by recognizing the need for investments to be made that will address threats in business critical areas. By highlighting the need for organizations to understand the nature of the risk and the probability of an event occurring, the security approaches highlight the need to address both the threats and actions in the event of an incident to reduce the risk to privacy.", "num_citations": "4\n", "authors": ["383"]}
{"title": "Towards a change leadership framework: Assessing capabilities within an IT service organization\n", "abstract": " There are many change initiatives reported today that are failing to deliver the expected results. The reasons for failure include the lack of leadership, lack of direction, no clear strategy, employee resistance and an inability to sustain changes in the long term. This paper investigates IT leaders’ capabilities and the impact their role has within the change cycle. It explores what makes a successful change leader while uncovering some of the behavioral issues that people display during change. This paper argues that by adopting the right change approach as a team collective and developing strategies for managing resistance, communication, speed and sustainability along with a framework model should create the right conditions for change to flourish thereby improving the chance of future success. The research assesses the change capability of an IT services business leadership team about to embark upon a …", "num_citations": "3\n", "authors": ["383"]}
{"title": "Migrating software products to the cloud\n", "abstract": " Cloud computing, as a disruptive innovation, has the potential to adversely affect companies. The effects can be particularly extreme for small and medium sized enterprises (SMEs). Subsequently, considerations of organisational resilience should be made when integrating with disruptive innovations like cloud computing. This paper reports of a longitudinal study investigating how a set of SME high-value software vendors are migrating their software products to the cloud. Adaptive socio-technical systems (ASTSs) concepts are used to provide a framework for understanding the adoption process. This study draws out a set of macro and micro themes relating to key phases of strategy development, the migration process and the impact on customer perceptions. From the findings, more systemic and holistic approaches are identified to address key tensions through the adoption life cycle while considering …", "num_citations": "3\n", "authors": ["383"]}
{"title": "Software process improvement: towards an emergent perspective\n", "abstract": " Software process improvement: towards an emergent perspective - IRep - Nottingham Trent University Current students | NOW | Staff login Nottingham Trent University Study with us International Services for business Research Alumni NTU > IRep IRep Software process improvement: towards an emergent perspective Tools + Tools Allison, I. and Merali, Y., 2003. Software process improvement: towards an emergent perspective. In: Proceedings of 8th Conference of the UK Academy of Information Systems, University of Warwick. Full text not available from this repository. Item Type: Conference contribution Creators: Allison, I. and Merali, Y. Contributors: Name Role ORCID Levi, M. UNSPECIFIED UNSPECIFIED Martin, A. UNSPECIFIED UNSPECIFIED Schweighart, C. UNSPECIFIED UNSPECIFIED Date: 2003 Divisions: Schools > School of Science and Technology Record created by: EPrints Services Date Added: 09 …", "num_citations": "3\n", "authors": ["383"]}
{"title": "Intra-team softwear process emergence: resilience through improvisation\n", "abstract": " Intra-team softwear process emergence: resilience through improvisation - IRep - Nottingham Trent University Current students | NOW | Staff login Nottingham Trent University Study with us International Services for business Research Alumni NTU > IRep IRep Intra-team softwear process emergence: resilience through improvisation Tools + Tools Allison, I. and Merali, Y., 2006. Intra-team softwear process emergence: resilience through improvisation. In: Proceedings of the 11th UKAIS conference. University of Gloucestershire. ISBN 1861741766 Full text not available from this repository. Official URL: http://www.ukais2006.org/ Item Type: Chapter in book Creators: Allison, I. and Merali, Y. Publisher: University of Gloucestershire Date: 2006 ISBN: 1861741766 Divisions: Schools > School of Science and Technology Record created by: EPrints Services Date Added: 09 Oct 2015 09:46 Last Modified: 19 Oct 2015 14:22 : ://…", "num_citations": "2\n", "authors": ["383"]}
{"title": "Modelling Case-Based Reasoning in Situation-Aware Disaster Management\n", "abstract": " Situation-aware disaster management (SADIM) is a continuous decision-making and action taking process. This process requires prior knowledge of the ongoing environment and context. SADIM comprises two major processes: situation awareness (SA)-a cognitive process that assesses current situations and anticipate future situations in the environment; and, disaster management (DM) which is a decision-making process preventing, preparing, responding, and recovering for and from a disaster. One of the decision-making technologies used in current SADIM is case-based reasoning (CBR) CBR is used for the disaster management element only. Situation awareness process in current SADIM is carried out using domain rules, statistical reasoning and other methods. This paper therefore presents a method of using CBR to carry out both situation assessment and disaster management decision-making processes in SADIM, building on previous work focusing in SA alone. Using CBR for both processes provides the capability of using past experiences to understand the state of the environment and also solve specific disaster problems. The paper evaluates the method through implementation in disaster prevention in the petroleum drilling domain for early kick detection to prevent a blowout disaster. The results show a clear improvement in similarity assessment and problem solving prediction to prevent blowout.", "num_citations": "1\n", "authors": ["383"]}