{"title": "Referenciais de Formação para os Cursos de Graduação em Computação\n", "abstract": " Todos os itens no Repositório da PUCRS estão protegidos por copyright, com todos os direitos reservados, e estão licenciados com uma Licença Creative Commons-Atribuição-NãoComercial 4.0 Internacional. Saiba mais.", "num_citations": "62\n", "authors": ["207"]}
{"title": "The UbiBus project: Using context and ubiquitous computing to build advanced public transportation systems to support bus passengers\n", "abstract": " Urban mobility is a problem that affects all cities. Providing real time information that can assist citizens on planning their trips by choosing times and itineraries more appropriate to their needs are essential on smart cities. Our project, named UbiBus, investigates how Computational Context and Ubiquitous Computing can be applied to Intelligent Transportation Systems to aid bus passengers mobility on cities, since dynamic real-time factors can affect transportation means. This paper describes the overall ideas concerning the UbiBus Project and presents some of the applications under development with their preliminary results.", "num_citations": "23\n", "authors": ["207"]}
{"title": "Social networks and collective intelligence applied to public transportation systems: A survey\n", "abstract": " Road traffic in big cities is becoming increasingly chaotic. The use of public transportation is an alternative to improve this scenario, since it diminishes the number of private vehicles on the roads. However, to improve its quality is important to understand the problems people are facing when using this kind of transportation. This paper presents the results of a survey conducted with public transportation users which investigates how collaborative systems based on social networks and collective intelligence can support sharing information with the passengers. The results show that there is a scarcity of ways to obtain real-time information related to public transportation and that the use of social network applications and collective intelligence is an interesting way to share and obtain this kind of information.", "num_citations": "19\n", "authors": ["207"]}
{"title": "The inconvenient side of software bots on pull requests\n", "abstract": " Software bots are applications that integrate their work with humans' tasks, serving as conduits between users and other tools. Due to their ability to automate tasks, bots have been widely adopted by Open Source Software (OSS) projects hosted on GitHub. Commonly, OSS projects use bots to automate a variety of routine tasks to save time from maintainers and contributors. Although bots can be useful for supporting maintainers' work, sometimes their comments are seen as spams, and are quickly ignored by contributors. In fact, the way that these bots interact on pull requests can be disruptive and perceived as unwelcoming. In this paper, we propose the concept of a meta-bot to deal with current problems on the human-bot interaction on pull requests. Besides providing additional value to this interaction, meta-bot will reduce interruptions and help maintainers and contributors stay aware of important information.", "num_citations": "17\n", "authors": ["207"]}
{"title": "What attracts newcomers to onboard on oss projects? tl; dr: Popularity\n", "abstract": " Voluntary contributions play an important role in maintaining Open Source Software (OSS) projects active. New volunteers feel motivated to contribute to OSS projects based on a set of motivations. In this study, we aim to understand which factors OSS projects usually maintain that might influence their new contributors’ onboarding. Using a set of 450 repositories, we investigated mixed factors, such as the project age, the number of stars, the programming language used, or the presence of text files that aid contributors (e.g., templates for pull-requests or license files). We used a K-Spectral Centroid (KSC) clustering algorithm to investigated the newcomers’ growth rate for the analyzed projects. We could found three common patterns: a logarithmic, an exponential, and a linear growth pattern. Based on these patterns, we used a Random Forest classifier to understand how each factor could explain the growth …", "num_citations": "16\n", "authors": ["207"]}
{"title": "Who gets a patch accepted first? comparing the contributions of employees and volunteers\n", "abstract": " Although many software companies have recently embraced Open Source Software (OSS) initiatives, volunteers (i.e., developers who contribute to OSS in their spare time) still represent a wealthy workforce that have the potential of driving many non-trivial open source projects. Such volunteers face well-known barriers when attempting to contribute to OSS projects. However, what is still unclear is how the problems that volunteers face transcend to the problems that employees (i.e., developers hired by a software company to work on OSS projects) face. In this paper we aim to investigate the differences on the acceptance of patches submitted by volunteers and employees to company-owned OSS projects. We explore different characteristics of the patches submitted to company-owned OSS project, including: the frequency of acceptance and rejection; the total time to review and process a patch, and; whether the …", "num_citations": "16\n", "authors": ["207"]}
{"title": "Hidden figures: Roles and pathways of successful oss contributors\n", "abstract": " Open Source Software (OSS) development is a collaborative endeavor where expert developers, distributed around the globe create software solutions. Given this characteristic, OSS communities have been studied as technical communities, where stakeholders join and evolve in their careers based on their (often voluntary) code contributions to the project. However, the OSS landscape is slowly changing with more people and companies getting involved in OSS. This means that projects now need people in non-technical roles and activities to keep the project sustainable and evolving. In this paper, we focus on understanding the roles and activities that are part of the current OSS landscape and the different career pathways in OSS. By conducting and analyzing 17 interviews with OSS contributors who are well known in the community, we provide empirical evidence of the existence and importance of community …", "num_citations": "15\n", "authors": ["207"]}
{"title": "Ten simple rules for helping newcomers become contributors to open projects\n", "abstract": " To survive and thrive, a community must attract new members, retain them, and help them be productive [1]. As openness becomes the norm in research, software development, and education, knowing how to do this has become an essential skill for principal investigators and community managers alike. A growing body of knowledge in sociology, anthropology, education, and software engineering can guide decisions about how to facilitate this. What exactly do we mean by\" community\"? In the case of open source and open science, the most usual meaning is a\" community of practice.\" As defined by Lave and Wenger [2, 3], groups as diverse as knitting circles, oncology researchers, and web designers share three key characteristics:", "num_citations": "15\n", "authors": ["207"]}
{"title": "Competence, collaboration, and time management: Barriers and recommendations for crowdworkers\n", "abstract": " Software crowdsourcing development requires a continuous influx of crowdworkers for their continuity. Crowdworkers should be encouraged to play an important role in the online communities by being active members, but they face difficulties when attempting to participate. For this reason, in this paper, we investigated the difficulties that crowdworkers face in crowdsourcing software development platforms. To achieve this, we conducted a study relying on multiple data sources and research methods including literature review, peer review, field study, and procedures of grounded theory. We observed that crowdworkers face many barriers - related to competence, collaboration, and time management - when making their contributions in software crowdsourcing development, which can result in dropouts. The main contributions of this paper are: a) empirical identification of barriers faced by crowdsourcing software …", "num_citations": "13\n", "authors": ["207"]}
{"title": "Supporting newcomers to overcome the barriers to contribute to open source software projects\n", "abstract": " Community-based Open Source Software (OSS) projects are generally self-organized and dynamic, receiving contributions from volunteers spread across the globe. These communities survival, long-term success, and continuity demand a constant influx of newcomers. However, newcomers face many barriers when making their first contribution to an OSS project, leading in many cases to dropouts. Therefore, a major challenge for OSS projects is to provide ways to support newcomers during their first contribution. In this thesis, our goal was to identify and understand the barriers newcomers face and provide appropriate strategies to lower these barriers. Toward this end, we conducted multiple studies, using multiple research methods. To identify the barriers, we used data collected from: semi-structured interviews with 35 developers from 13 different projects; 24 answers to an open questionnaire conducted with OSS developers; feedback from 9 graduate and undergraduate students after they tried to join OSS projects; and 20 primary studies gathered via a systematic literature review. The data was analyzed using Grounded Theory procedures: namely, open and axial coding. Subsequently, the analysis resulted in a preliminary conceptual model composed of 58 barriers grouped into six categories: cultural differences, newcomers characteristics, reception issues, newcomers orientation, technical hurdles, and documentation problems. Based on the conceptual model, we developed FLOSScoach, a portal to support newcomers making their first OSS project contribution. To assess the portal, we conducted a study with undergraduate students …", "num_citations": "10\n", "authors": ["207"]}
{"title": "Um aplicativo baseado em inteligência coletiva para compartilhamento de rotas em redes sociais\n", "abstract": " ALVES, Luiz Philipe Serrano. Um aplicativo baseado em inteligência coletiva para o compartilhamento de rotas em redes sociais. 2011. 48 f. Trabalho de Conclusão de Curso (Graduação)–Curso Superior de Tecnologia em Sistemas para Internet. Universidade Tecnológica Federal do Paraná. Campo Mourão, 2011.Este trabalho apresenta um aplicativo para rede social que permite a criação de rotas em mapas, que possam ser editadas colaborativamente e compartilhadas. A colaboração em mapas é um fruto da inteligência coletiva, que une a sabedoria de várias pessoas para cumprir um objetivo. O trabalho apresenta uma abordagem dos conceitos de inteligência coletiva, mapas colaborativos e redes sociais, que foram aplicados na criação do aplicativo para interação colaborativa. A criação do aplicativo é discutida e detalhada, assim como a utilização do produto final. Há uma discussão sobre os pontos fortes e fracos das funcionalidades do aplicativo, de acordo com a opinião de usuários que realizaram uma prova de conceito.", "num_citations": "10\n", "authors": ["207"]}
{"title": "An empirical study on task documentation in software crowdsourcing on topcoder\n", "abstract": " In the Software Crowdsourcingcompetitive model, crowd members seek for tasks in a platform and submit their solutions seeking rewards. In this model, the task description is important to support the choice and the execution of a task. Despite its importance, little is known about the role of task description as support for these processes. To fill this gap, this paper presents a study that explores the role of documentation on TopCoder platform, focusing on the task selection and execution. We conducted a two-phased study with professionals that had no prior contact with TopCoder. Based on data collected with questionnaires, diaries, and a retrospective session, we could understand how people choose and perform the tasks, and the role of documentation in the platform. We could find that poorly specified or incomplete tasks lead developers to look for supplementary material or invest more time and effort than initially …", "num_citations": "8\n", "authors": ["207"]}
{"title": "Um aplicativo para dispositivos móveis voltado para usuários de transporte público\n", "abstract": " LUCIO, Diego Rafael. Um aplicativo para dispositivos móveis voltados para usuários de transporte público. 2011. 56 f. Trabalho de Conclusão de Curso (Graduação)–Curso Superior de Tecnologia em Sistemas para Internet. Universidade Tecnológica Federal do Paraná. Campo Mourão, 2011.Este trabalho teve como objetivo realizar estudos sobre, sistemas de transporte inteligentes, inteligência coletiva, crowdsourcing, e o uso da inteligência coletiva combinado com dispositivos móveis. Com base nos estudos realizados, pode-se observar que há uma necessidade de manter os usuários do transporte público como bem informados. A partir da necessidade identificada uma aplicação para dispositivos móveis Android baseada em inteligência coletiva foi desenvolvida, permitindo aos passageiros enviar uma mensagem para uma rede social relatando acontecimentos que podem gerar atrasos nas linhas de ônibus utilizadas. A vantagem da ferramenta é permitir que informações sejam fornecidas em tempo real, no momento do incidente. O foco é melhorar a informação oferecida aos usuários do transporte público, com base em informações fornecidas por outros indivíduos.", "num_citations": "5\n", "authors": ["207"]}
{"title": "A Context Conceptual Model for a Distributed Software Development Environment\n", "abstract": " Organizations seeking lower costs, quality software and specialized resources started to use an approach called Global Software Development (GSD). However, this approach also brought some drawbas imposed by the physical distribution, including issues related to communication, cooperation and coordination. There is a need to improve user awareness related to the process and the context in which collaborative artifacts are generated. In this context, conceptual modeling is relevant since conceptual specifications can be used to support understanding, problem-solving, and communication among stakeholders about a given subject domain. This paper presents a conceptual model focused on contextual information for DiSEN, a distributed software engineering environment. Main contributions found on the paper are:(i) the identification of a set of information that compose environment entities context; and (ii) the definition of a model that facilitates domain semantics comprehension, reducing communication gaps.", "num_citations": "5\n", "authors": ["207"]}
{"title": "Characterizing the hyperspecialists in the context of crowdsourcing software development\n", "abstract": " Companies around the world use crowdsourcing platforms to complete simple tasks, collect product ideas, and launch advertising campaigns. Recently, crowdsourcing has also been used for software development to run tests, fix small defects, or perform small coding tasks. Among the pillars upholding the crowdsourcing business model are the platform participants, as they are responsible for accomplishing the requested tasks. Since successful crowdsourcing heavily relies on attracting and retaining participants, it is essential to understand how they behave. This exploratory study aims to understand a specific contributor profile: hyperspecialists. We analyzed developers’ participation on challenges in two ways. First, we analyzed the type of challenge that 664 Topcoder platform developers participated in during the first 18 months of their participation. Second, we focused on the profile of users who had more collaborations in the development challenges. After quantitative analysis, we observed that, in general, users who do not stop participating have behavioral traits that indicate hyper-specialization, since they participate in the majority of the same types of challenge. An interesting, though troubling, finding was the high dropout rate on the platform: 66% of participants discontinued their participation during the study period. The results also showed that hyperspecialization can be observed in terms of technologies required in the development challenges. We found that 60% of the 2,086 developers analyzed participated in at least 75% of challenges that required the same technology. We found hyperspecialists and non-specialists significantly …", "num_citations": "3\n", "authors": ["207"]}
{"title": "A gamification proposal to support the onboarding of newcomers in the flosscoach portal\n", "abstract": " Several Open Source Software projects depend on volunteers' contributions and need a continuous influx of newcomers for their sustainability. However, newcomers face many barriers when making their first contribution. In a previous work, a web-based portal called FLOSScoach was proposed to support the first contribution of newcomers to Open Source Software Projects. The preliminary evaluation indicated that FLOSScoach has played an important role in guiding newcomers and in lowering barriers related to the orientation and the contribution process. Gamification has been widely used to engage and motivate people to accomplish tasks and improve their performance. Therefore, the goal of this study is to present the FLOSScoach gamification proposal, which is illustrated in the form of the high-fidelity prototypes as a step to support on the decision of the game elements. We also report on insights gathered …", "num_citations": "2\n", "authors": ["207"]}
{"title": "Filtragem colaborativa de rotas de ônibus usando dados sobre a acessibilidade das vias urbanas\n", "abstract": " Big cities still facing serious problems related to urban traffic. This fact highlights the need for new solutions aiming to improve the efficiency of the public transportation systems. Based on this, researchers have been developing systems to improve the experience of using public transportation. However, there is still an unexplored gap related to the use of these systems by visually impaired people. The goal of this study is presenting a technological solution that relies on data obtained from the crowds to recommend routes according to the bus stop accessibility level to support visually impaired users to use public transportation system with autonomy and safety.", "num_citations": "2\n", "authors": ["207"]}
{"title": "Uso do GeoGebra no Ensino de Matemática: Avaliação de Usabilidade e de Aprendizado\n", "abstract": " Software educacionais são implementados visando à utilização no processo de ensino-aprendizagem em diversas áreas da educação. A tecnologia tornou-se uma ferramenta importante no trabalho de professores em sala de aula, sobretudo na disciplina de matemática, que tem suas dificuldades em ambiente escolar devido à grande utilização de abstrações e aspectos formais. Este trabalho apresenta uma avaliação de usabilidade do software matemático GeoGebra realizada por professores utilizando o Ergolist. Este trabalho ainda relaciona a avaliação da aprendizagem de alunos com o software usando a Taxonomia Revisada de Bloom adaptada ao ensino da Matemática. Os resultados apresentam uma relação entre o processo de ensino-aprendizagem e a usabilidade do software GeoGebra.", "num_citations": "2\n", "authors": ["207"]}
{"title": "GeCA: Uma Ferramenta de Engenharia Reversa e Geração Automática de Código\n", "abstract": " Alterações durante o ciclo de vida de um software são inevitáveis. Isto pode trazer problemas quando a documentação é inexistente ou quando da necessidade de realização de constantes manutenções no sistema. Neste artigo propõe-se a ferramenta GeCA (Gerador de Códigos Auxiliares) que visa permitir aos analistas e desenvolvedores realizarem engenharia reversa e executar a manutenção dos sistemas de maneira facilitada. A ferramenta apresenta várias maneiras de obter os dados e a possibilidade de geração automática de artefatos: códigos fonte, estruturas de bancos de dados, diagramas UML e artefatos diversos (hibernate, formulários, xml).", "num_citations": "2\n", "authors": ["207"]}
{"title": "Extensão da UML para modelagem orientada a aspectos baseada em aspectj\n", "abstract": " A Programação Orientada a Aspectos (AOP) visa reduzir algumas limitações encontradas na orientação a objetos, como o espalhamento e entrelaçamento de código. Isto é feito através do encapsulamento das preocupações ortogonais (crosscutting concerns) em módulos chamados aspectos. O uso de um modelo gráfico traria as facilidades da AOP para a fase de modelagem, além de, é claro, facilitar a fase de implementação. A proposta deste trabalho é estender o diagrama de classes da UML para apoiar o desenvolvimento de sistemas orientados a aspectos, com base na linguagem AspectJ.", "num_citations": "2\n", "authors": ["207"]}
{"title": "Estudo de Princípios para Modelagem Orientada a Aspectos\n", "abstract": " Linguagens procedimentais e orientadas a objetos não são suficientemente claras para implementar algumas decisões de projeto. Essas linguagens não representam de maneira eficiente estas decisões, consequentemente, dificultam o desenvolvimento e manutenção do software. A necessidade de técnicas que possam apoiar o programador na atividade de separar objetos e aspectos, originou a Programação Orientada a Aspectos (AOP–Aspect Oriented Programming). Aspectos são justamente as propriedades do sistema que se espalham por seus vários componentes (crosscut). Exemplos dessas propriedades são: logging, tratamentos de erros, políticas de sincronização e rastreamento (tracing). Com a introdução de aspectos, faz-se necessária uma posterior composição com os componentes sobre os quais eles influenciarão. Um conceito importante no processo de composição são os pontos de combinação, propriedades comuns aos componentes do sistema através dos quais os aspectos se coordenam. A identificação e estruturação de componentes, aspectos, pontos de combinação e relacionamentos, assim como a captura de conflitos potenciais, requerem um método de modelagem apropriado, além das ferramentas de implementação. Um ponto de grande complexidade na orientação a aspectos é a existência de dois níveis de decomposição (componentes e aspectos). Para abordar este problema, necessita-se de uma modelagem que possa fornecer um conjunto de diretivas, auxiliando o desenvolvedor na identificação e composição de aspectos e componentes. Esta modelagem seria como uma extensão do modelo …", "num_citations": "2\n", "authors": ["207"]}
{"title": "A portal for cataloging worked examples extracted from open source software\n", "abstract": " Finding real examples that follow the evolution of Software Engineering is not an easy task for instructors in the field. Open Source Software (OSS) projects have been an alternative to support education in Software Engineering, as they allow contact with real development projects and environments. However, the adoption of these projects in the classroom presents some obstacles, such as choosing the appropriate project, and the time and effort needed to prepare the classes and get used to the open source environment. In order to reduce the difficulties faced by instructors, we are working on developing a portal to catalog worked examples extracted from OSS projects to assist instructors. In this paper, we present the first steps towards creating this catalog, which is creating a pattern for guiding the structuring the worked examples. We are applying the Design Science Research paradigm. The activities reported in …", "num_citations": "1\n", "authors": ["207"]}
{"title": "An empirical study on task documentation in software crowdsourcing: the case of the TopCoder platform\n", "abstract": " Software Crowdsourcing, the act of outsourcing software development tasks to a crowd in the form of an open call, happens mediated by a platform and is based on tasks. In the competitive model, the members of the crowd seek for tasks and submit solutions attempting to receive financial rewards In this context, task description plays a relevant role since its understanding supports the choice and development of a task. Little is known about the role of task description as support for these processes. In order to contribute to fill this gap, this paper presents an empirical study exploring the role of documentation when developers select and develop tasks in software crowdsourcing. The TopCoder platform was studied in two stages: a case study with newcomers to crowdsourcing (in the classroom); and a study based on interviews with industry professionals. We identified that the documentation quality influences task …", "num_citations": "1\n", "authors": ["207"]}
{"title": "A collective intelligence based system for visualizing problems in public roads\n", "abstract": " The emergence of Web 2.0 made knowledge sharing via Internet an easy task. Collective intelligence leverages this knowledge shared to solve problems. Using collective intelligence along with IT (Information Technology) techniques in transportation systems can make them more secure, efficient and reliable without changing existing physical structures. The products generated by this combination are known as ITS (Intelligent Transportation Systems). This paper presents an application that uses the concept of ITS and collective intelligence to enable users to visualize possible problems on bus lines due to traffic conditions. The application is part of the project UbiBus, which focuses on bringing solutions together to improve services provided to public transportation users in Brazil.", "num_citations": "1\n", "authors": ["207"]}
{"title": "Task Anticipation: a quantitative analysis using workflow process simulation\n", "abstract": " Traditional Workflow Management Systems (WfMS) are too rigid, posing problems when cooperation and human behavior are important factors. Under these circumstances, there is a need for a relaxation of the end-begin dependency. Task anticipation can provide this, relaxing the flow of control and dataflow among tasks, allowing exchange of results among sequential tasks even before the conclusion of the former task. This anticipation promotes a better cooperation and augments the performance in terms of process execution time. This paper presents some ways to use task anticipation in WfMS, simulating its behavior and comparing its performance to traditional process execution. Simulation results show that using anticipation is statistically better than the traditional approach (presenting profits of up to 33%). Taking into account possible additional effort anticipation shows better performance when initiated before 40% of the predecessors’ execution.", "num_citations": "1\n", "authors": ["207"]}
{"title": "Um Simulador para Avaliação da Antecipação de Tarefas em Sistemas Gerenciadores de Workflow\n", "abstract": " A fim de flexibilizar o fluxo de controle e o fluxo de dados em Sistemas Gerenciadores de Workflow (SGWf), permitir que tarefas possam ser disparadas antes da conclusão de suas antecessoras, surge a antecipação de tarefas. A antecipação implica no aumento da cooperação entre tarefas e em melhor desempenho com relação ao tempo de execução dos processos. A fim de quantificar o melhor desempenho oferecido pela utilização da antecipação, foi implementado um simulador de processos de workflows utilizando software livre. A tecnologia utilizada para o desenvolvimento emprega PHP, MySQL e linguagens baseadas em XML.", "num_citations": "1\n", "authors": ["207"]}
{"title": "Estudo e análise de desempenho da antecipação de tarefas em sistemas gerenciadores de workflow\n", "abstract": " Sistemas Gerenciadores de Workflow (SGWf) têm atraído muita atenção nos últimos anos, por serem baseados em um modelo simples que permite definir, executar e monitorar a execução de processos. Mas este esquema é um tanto quanto rígido e inflexível, apresentando alguns problemas quando da necessidade de sua utilização no controle de processos com características cooperativas, em que o comportamento humano deve ser levado em conta. Este tipo de processo deve apresentar uma certa flexibilidade de forma a possibilitar a troca de resultados entre tarefas, acabando com a dependência fim-início existente entre tarefas seqüenciais nos SGWfs tradicionais. A fim de possibilitar este tipo de comportamento, surge a antecipação de tarefas, que tem por objetivo oferecer meios de flexibilizar o fluxo de controle e o fluxo de dados para permitir que tarefas possam ser disparadas antes mesmo da conclusão de suas antecessoras. A antecipação implica no aumento da cooperação entre tarefas e em melhor desempenho com relação ao tempo de execução dos processos. O aumento na cooperação está relacionado diretamente à troca de resultados, permitindo que duas ou mais tarefas trabalhem sobre instâncias de um determinado dado que ainda está sendo produzido. O melhor desempenho deve-se ao paralelismo (parcial) criado entre tarefas que deveriam executar de maneira estritamente seqüencial, devido ao disparo das tarefas antes do previsto. Este trabalho então, apresenta um estudo das abordagens de flexibilização de SGWfs, visando encontrar maneiras de prover antecipação de tarefas. O principal objetivo do …", "num_citations": "1\n", "authors": ["207"]}
{"title": "Everware & Summware: Um Sistema de Gerência de Hiperdocumentos Adaptativos para Dispositivos Móveis\n", "abstract": " Este trabalho apresenta uma solução para o problema de operações em modo desconectado e de adaptatividade, comum em dispositivos móveis. A solução reúne diferentes técnicas encontradas na literatura e está voltada para facilitar o acesso a aplicações Web. A proposta consiste em dois módulos que inter-operam: Everware, que resolve o problema de operações em modo desconectado; e Summware, que resolve o problema de adaptatividade.", "num_citations": "1\n", "authors": ["207"]}