{"title": "Learning under concept drift: an overview\n", "abstract": " Concept drift refers to a non stationary learning problem over time. The training and the application data often mismatch in real life problems. In this report we present a context of concept drift problem 1. We focus on the issues relevant to adaptive training set formation. We present the framework and terminology, and formulate a global picture of concept drift learners design. We start with formalizing the framework for the concept drifting data in Section 1. In Section 2 we discuss the adaptivity mechanisms of the concept drift learners. In Section 3 we overview the principle mechanisms of concept drift learners. In this chapter we give a general picture of the available algorithms and categorize them based on their properties. Section 5 discusses the related research fields and Section 5 groups and presents major concept drift applications. This report is intended to give a bird's view of concept drift research field, provide a context of the research and position it within broad spectrum of research fields and applications.", "num_citations": "501\n", "authors": ["1071"]}
{"title": "An overview of concept drift applications\n", "abstract": " In most challenging data analysis applications, data evolve over time and must be analyzed in near real time. Patterns and relations in such data often evolve over time, thus, models built for analyzing such data quickly become obsolete over time. In machine learning and data mining this phenomenon is referred to as concept drift. The objective is to deploy models that would diagnose themselves and adapt to changing data over time. This chapter provides an application oriented view towards concept drift research, with a focus on supervised learning tasks. First we overview and categorize application tasks for which the problem of concept drift is particularly relevant. Then we construct a reference framework for positioning application tasks within a spectrum of problems related to concept drift. Finally, we discuss some promising research directions from the application perspective, and present …", "num_citations": "262\n", "authors": ["1071"]}
{"title": "Handling concept drift in process mining\n", "abstract": " Operational processes need to change to adapt to changing circumstances, e.g., new legislation, extreme variations in supply and demand, seasonal effects, etc. While the topic of flexibility is well-researched in the BPM domain, contemporary process mining approaches assume the process to be in steady state. When discovering a process model from event logs, it is assumed that the process at the beginning of the recorded period is the same as the process at the end of the recorded period. Obviously, this is often not the case due to the phenomenon known as concept drift. While cases are being handled, the process itself may be changing. This paper presents an approach to analyze such second-order dynamics. The approach has been implemented in ProM and evaluated by analyzing an evolving process.", "num_citations": "227\n", "authors": ["1071"]}
{"title": "Dealing with concept drifts in process mining\n", "abstract": " Although most business processes change over time, contemporary process mining techniques tend to analyze these processes as if they are in a steady state. Processes may change suddenly or gradually. The drift may be periodic (e.g., because of seasonal influences) or one-of-a-kind (e.g., the effects of new legislation). For the process management, it is crucial to discover and understand such concept drifts in processes. This paper presents a generic framework and specific techniques to detect when a process changes and to localize the parts of the process that have changed. Different features are proposed to characterize relationships among activities. These features are used to discover differences between successive populations. The approach has been implemented as a plug-in of the ProM process mining framework and has been evaluated using both simulated event data exhibiting controlled concept …", "num_citations": "172\n", "authors": ["1071"]}
{"title": "Measuring discrimination in algorithmic decision making\n", "abstract": " Society is increasingly relying on data-driven predictive models for automated decision making. This is not by design, but due to the nature and noisiness of observational data, such models may systematically disadvantage people belonging to certain categories or groups, instead of relying solely on individual merits. This may happen even if the computing process is fair and well-intentioned. Discrimination-aware data mining studies of how to make predictive models free from discrimination, when the historical data, on which they are built, may be biased, incomplete, or even contain past discriminatory decisions. Discrimination-aware data mining is an emerging research discipline, and there is no firm consensus yet of how to measure the performance of algorithms. The goal of this survey is to review various discrimination measures that have been used, analytically and computationally analyze their …", "num_citations": "168\n", "authors": ["1071"]}
{"title": "A survey on measuring indirect discrimination in machine learning\n", "abstract": " Nowadays, many decisions are made using predictive models built on historical data.Predictive models may systematically discriminate groups of people even if the computing process is fair and well-intentioned. Discrimination-aware data mining studies how to make predictive models free from discrimination, when historical data, on which they are built, may be biased, incomplete, or even contain past discriminatory decisions. Discrimination refers to disadvantageous treatment of a person based on belonging to a category rather than on individual merit. In this survey we review and organize various discrimination measures that have been used for measuring discrimination in data, as well as in evaluating performance of discrimination-aware predictive models. We also discuss related measures from other disciplines, which have not been used for measuring discrimination, but potentially could be suitable for this purpose. We computationally analyze properties of selected measures. We also review and discuss measuring procedures, and present recommendations for practitioners. The primary target audience is data mining, machine learning, pattern recognition, statistical modeling researchers developing new methods for non-discriminatory predictive modeling. In addition, practitioners and policy makers would use the survey for diagnosing potential discrimination by predictive models.", "num_citations": "136\n", "authors": ["1071"]}
{"title": "Handling conditional discrimination\n", "abstract": " Historical data used for supervised learning may contain discrimination. We study how to train classifiers on such data, so that they are discrimination free with respect to a given sensitive attribute, e.g., gender. Existing techniques that deal with this problem aim at removing all discrimination and do not take into account that part of the discrimination may be explainable by other attributes, such as, e.g., education level. In this context, we introduce and analyze the issue of conditional non-discrimination in classifier design. We show that some of the differences in decisions across the sensitive groups can be explainable and hence tolerable. We observe that in such cases, the existing discrimination aware techniques will introduce a reverse discrimination, which is undesirable as well. Therefore, we develop local techniques for handling conditional discrimination when one of the attributes is considered to be …", "num_citations": "133\n", "authors": ["1071"]}
{"title": "Why unbiased computational processes can lead to discriminative decision procedures\n", "abstract": " Nowadays, more and more decision procedures are supported or even guided by automated processes. An important technique in this automation is data mining. In this chapter we study how such automatically generated decision support models may exhibit discriminatory behavior towards certain groups based upon, e.g., gender or ethnicity. Surprisingly, such behavior may even be observed when sensitive information is removed or suppressed and the whole procedure is guided by neutral arguments such as predictive accuracy only. The reason for this phenomenon is that most data mining methods are based upon assumptions that are not always satisfied in reality, namely, that the data is correct and represents the population well. In this chapter we discuss the implicit modeling assumptions made by most data mining algorithms and show situations in which they are not satisfied. Then we outline three …", "num_citations": "132\n", "authors": ["1071"]}
{"title": "On the relation between accuracy and fairness in binary classification\n", "abstract": " Our study revisits the problem of accuracy-fairness tradeoff in binary classification. We argue that comparison of non-discriminatory classifiers needs to account for different rates of positive predictions, otherwise conclusions about performance may be misleading, because accuracy and discrimination of naive baselines on the same dataset vary with different rates of positive predictions. We provide methodological recommendations for sound comparison of non-discriminatory classifiers, and present a brief theoretical and empirical analysis of tradeoffs between accuracy and non-discrimination.", "num_citations": "113\n", "authors": ["1071"]}
{"title": "Using sensitive personal data may be necessary for avoiding discrimination in data-driven decision models\n", "abstract": " Increasing numbers of decisions about everyday life are made using algorithms. By algorithms we mean predictive models (decision rules) captured from historical data using data mining. Such models often decide prices we pay, select ads we see and news we read online, match job descriptions and candidate CVs, decide who gets a loan, who goes through an extra airport security check, or who gets released on parole. Yet growing evidence suggests that decision making by algorithms may discriminate people, even if the computing process is fair and well-intentioned. This happens due to biased or non-representative learning data in combination with inadvertent modeling procedures. From the regulatory perspective there are two tendencies in relation to this issue: (1) to ensure that data-driven decision making is not discriminatory, and (2) to restrict overall collecting and storing of private data to a …", "num_citations": "96\n", "authors": ["1071"]}
{"title": "Quantifying explainable discrimination and removing illegal discrimination in automated decision making\n", "abstract": " Recently, the following discrimination-aware classification problem was introduced. Historical data used for supervised learning may contain discrimination, for instance, with respect to gender. The question addressed by discrimination-aware techniques is, given sensitive attribute, how to train discrimination-free classifiers on such historical data that are discriminative, with respect to the given sensitive attribute. Existing techniques that deal with this problem aim at removing all discrimination and do not take into account that part of the discrimination may be explainable by other attributes. For example, in a job application, the education level of a job candidate could be such an explainable attribute. If the data contain many highly educated male candidates and only few highly educated women, a difference in acceptance rates between woman and man does not necessarily reflect gender discrimination, as it …", "num_citations": "94\n", "authors": ["1071"]}
{"title": "Change with delayed labeling: When is it detectable?\n", "abstract": " Handling changes over time in supervised learning (concept drift) lately has received a great deal of attention, a number of adaptive learning strategies have been developed. Most of them make an optimistic assumption that the new labels become available immediately. In real sequential classification tasks it is often unrealistic due to task specific delayed labeling or associated labeling costs. We address the problem of change detectability, given, that the new labels are not available. In this analytical study we look at the space of changes from probabilistic perspective to analyze, what changes are detectable without seeing the labels and what are not. We conduct a range of experiments with real life data with simulated and natural changes to explore this detectability issue. We propose a computationally friendly detection technique, which monitors a stream of classifier outputs. We demonstrate analytically and …", "num_citations": "77\n", "authors": ["1071"]}
{"title": "On the window size for classification in changing environments\n", "abstract": " Classification in changing environments (commonly known as concept drift) requires adaptation of the classifier to accommodate the changes. One approach is to keep a moving window on the streaming data and constantly update the classifier on it. Here we consider an abrupt change scenario where one set of probability distributions of the classes is instantly replaced with another. For a fixed'transition period'around the change, we derive a generic relationship between the size of the moving window and the classification error rate. We derive expressions for the error in the transition period and for the optimal window size for the case of two Gaussian classes where the concept change is a geometrical displacement of the whole class configuration in the space. A simple window resize strategy based on the derived relationship is proposed and compared with fixed-size windows on a real benchmark data set data …", "num_citations": "75\n", "authors": ["1071"]}
{"title": "Adaptive preprocessing for streaming data\n", "abstract": " Many supervised learning approaches that adapt to changes in data distribution over time (e.g., concept drift) have been developed. The majority of them assume that the data comes already preprocessed or that preprocessing is an integral part of a learning algorithm. In real-application tasks, data that comes from, e.g., sensor readings, is typically noisy, contain missing values, redundant features, and a very large part of model development efforts is devoted to data preprocessing. As data is evolving over time, learning models need to be able to adapt to changes automatically. From a practical perspective, automating a predictor makes little sense if preprocessing requires manual adjustment over time. Nevertheless, adaptation of preprocessing has been largely overlooked in research. In this paper, we introduce and address the problem of adaptive preprocessing. We analyze when and under what circumstances …", "num_citations": "67\n", "authors": ["1071"]}
{"title": "An ecometric analysis of the fossil mammal record of the Turkana Basin\n", "abstract": " Although ecometric methods have been used to analyse fossil mammal faunas and environments of Eurasia and North America, such methods have not yet been applied to the rich fossil mammal record of eastern Africa. Here we report results from analysis of a combined dataset spanning east and west Turkana from Kenya between 7 and 1 million years ago (Ma). We provide temporally and spatially resolved estimates of temperature and precipitation and discuss their relationship to patterns of faunal change, and propose a new hypothesis to explain the lack of a temperature trend. We suggest that the regionally arid Turkana Basin may between 4 and 2 Ma have acted as a ‘species factory’, generating ecological adaptations in advance of the global trend. We show a persistent difference between the eastern and western sides of the Turkana Basin and suggest that the wetlands of the shallow eastern side could …", "num_citations": "66\n", "authors": ["1071"]}
{"title": "Online mass flow prediction in CFB boilers with explicit detection of sudden concept drift\n", "abstract": " Fuel feeding and inhomogeneity of fuel typically cause fluctuations in the circulating fluidized bed (CFB) process. If control systems fail to compensate the fluctuations, the whole plant will suffer from dynamics that is reinforced by the closed-loop controls. This phenomenon causes reducing efficiency and the lifetime of process components. In this paper we address the problem of online mass flow prediction, which is a part of control. Particularly, we consider the problem of learning an accurate predictor with explicit detection of abrupt concept drift and noise handling mechanisms. We emphasize the importance of having domain knowledge concerning the considered case and constructing the ground truth for facilitating the quantitative evaluation of different approaches. We demonstrate the performance of change detection methods and show their effect on the accuracy of the online mass flow prediction with real …", "num_citations": "53\n", "authors": ["1071"]}
{"title": "Combining similarity in time and space for training set formation under concept drift\n", "abstract": " Concept drift is a challenge in supervised learning for sequential data. It describes a phenomenon when the data distributions change over time. In such a case accuracy of a classifier benefits from the selective sampling for training. We develop a method for training set selection, particularly relevant when the expected drift is gradual. Training set selection at each time step is based on the distance to the target instance. The distance function combines similarity in space and in time. The method determines an optimal training set size online at every time step using cross validation. It is a wrapper approach, it can be used plugging in different base classifiers. The proposed method shows the best accuracy in the peer group on the real and artificial drifting data. The method complexity is reasonable for the field applications.", "num_citations": "52\n", "authors": ["1071"]}
{"title": "Beating the baseline prediction in food sales: How intelligent an intelligent predictor is?\n", "abstract": " Sales prediction is an essential part of stock planning for the wholesales and retail business. It is a complex task because of the large number of factors affecting the demand. Designing an intelligent predictor that would beat a simple moving average baseline across a number of products appears to be a non-trivial task. We present an intelligent two level sales prediction approach that switches the predictors depending on the properties of the historical sales. First, we learn how to categorize the sales time series into ‘predictable’ and ‘random’ based on structural, shape and relational features related to the products and the environment using meta learning approach. We introduce a set of novel meta features to capture behavior, shape and relational properties of the sales time series. Next, for the products identified as ‘predictable’ we apply an intelligent base predictor, while for ‘random’ we use a moving average …", "num_citations": "48\n", "authors": ["1071"]}
{"title": "The rise and fall of the Old World savannah fauna and the origins of the African savannah biome\n", "abstract": " Despite much interest in the ecology and origins of the extensive grassland ecosystems of the modern world, the biogeographic relationships of savannah palaeobiomes of Africa, India and mainland Eurasia have remained unclear. Here we assemble the most recent data from the Neogene mammal fossil record in order to map the biogeographic development of Old World mammalian faunas in relation to palaeoenvironmental conditions. Using genus-level faunal similarity and mean ordinated hypsodonty in combination with palaeoclimate modelling, we show that savannah faunas developed as a spatially and temporally connected entity that we term the Old World savannah palaeobiome. The Old World savannah palaeobiome flourished under the influence of middle and late Miocene global cooling and aridification, which resulted in the spread of open habitats across vast continental areas. This extensive biome …", "num_citations": "47\n", "authors": ["1071"]}
{"title": "Reconciling taxon senescence with the Red Queen’s hypothesis\n", "abstract": " In the fossil record, taxa exhibit a regular pattern of waxing and waning of occupancy, range or diversity between their origin and extinction. This pattern appears to contradict the law of constant extinction 1, which states that the probability of extinction in a given taxon is independent of that taxon’s age. It is nevertheless well established for species, genera and higher taxa of terrestrial mammals 2, 3, 4, marine invertebrates 5, 6, 7, marine microorganisms 8, and recent Hawaiian clades of animals and plants 9. Here we show that the apparent contradiction between a stochastically constant extinction rate and the seemingly deterministic waxing and waning pattern of taxa disappears when we consider their peak of expansion rather than their final extinction. To a first approximation, we find that biotic drivers of evolution pertain mainly to the peak of taxon expansion, whereas abiotic drivers mainly apply to taxon …", "num_citations": "46\n", "authors": ["1071"]}
{"title": "How good is the electricity benchmark for evaluating concept drift adaptation\n", "abstract": " In this correspondence, we will point out a problem with testing adaptive classifiers on autocorrelated data. In such a case random change alarms may boost the accuracy figures. Hence, we cannot be sure if the adaptation is working well.", "num_citations": "43\n", "authors": ["1071"]}
{"title": "Combining time and space similarity for small size learning under concept drift\n", "abstract": " We present concept drift responsive method for classifier training for sequential data. Relevant instance selection for training is based on similarity to the target observation. Similarity in space and in time is combined. The algorithm determines an optimal training set size. It can be used plugging in different base classifiers. The proposed algorithm shows the best accuracy in the peer group. The algorithm complexity is reasonable for the field applications.", "num_citations": "42\n", "authors": ["1071"]}
{"title": "Towards cost-sensitive adaptation: When is it worth updating your predictive model?\n", "abstract": " Our digital universe is rapidly expanding, more and more daily activities are digitally recorded, data arrives in streams, it needs to be analyzed in real time and may evolve over time. In the last decade many adaptive learning algorithms and prediction systems, which can automatically update themselves with the new incoming data, have been developed. The majority of those algorithms focus on improving the predictive performance and assume that model update is always desired as soon as possible and as frequently as possible. In this study we consider potential model update as an investment decision, which, as in the financial markets, should be taken only if a certain return on investment is expected. We introduce and motivate a new research problem for data streams – cost-sensitive adaptation. We propose a reference framework for analyzing adaptation strategies in terms of costs and benefits. Our …", "num_citations": "41\n", "authors": ["1071"]}
{"title": "Predictive handling of asynchronous concept drifts in distributed environments\n", "abstract": " In a distributed computing environment, peers collaboratively learn to classify concepts of interest from each other. When external changes happen and their concepts drift, the peers should adapt to avoid increase in misclassification errors. The problem of adaptation becomes more difficult when the changes are asynchronous, i.e., when peers experience drifts at different times. We address this problem by developing an ensemble approach, PINE, that combines reactive adaptation via drift detection, and proactive handling of upcoming changes via early warning and adaptation across the peers. With empirical study on simulated and real-world data sets, we show that PINE handles asynchronous concept drifts better and faster than current state-of-the-art approaches, which have been designed to work in less challenging environments. In addition, PINE is parameter insensitive and incurs less communication cost …", "num_citations": "32\n", "authors": ["1071"]}
{"title": "Herbivore teeth predict climatic limits in Kenyan ecosystems\n", "abstract": " A major focus in evolutionary biology is to understand how the evolution of organisms relates to changes in their physical environment. In the terrestrial realm, the interrelationships among climate, vegetation, and herbivores lie at the heart of this question. Here we introduce and test a scoring scheme for functional traits present on the worn surfaces of large mammalian herbivore teeth to capture their relationship to environmental conditions. We modeled local precipitation, temperature, primary productivity, and vegetation index as functions of dental traits of large mammal species in 13 national parks in Kenya over the past 60 y. We found that these dental traits can accurately estimate local climate and environment, even at small spatial scales within areas of relatively uniform climate (within two ecoregions), and that they predict limiting conditions better than average conditions. These findings demonstrate that the …", "num_citations": "29\n", "authors": ["1071"]}
{"title": "Determining the training window for small sample size classification with concept drift\n", "abstract": " We consider classification of sequential data in the presence of frequent and abrupt concept changes. The current practice is to use the data after the change to train a new classifier. However, if the window with the new data is too small, the classifier will be undertrained and hence less accurate that the \"old'' classifier. Here we propose a method (called WR*) for resizing the training window after detecting a concept change. Experiments with synthetic and real data demonstrate the advantages of WR* over other window resizing methods.", "num_citations": "28\n", "authors": ["1071"]}
{"title": "Optimizing regression models for data streams with missing values\n", "abstract": " Automated data acquisition systems, such as wireless sensor networks, surveillance systems, or any system that records data in operating logs, are becoming increasingly common, and provide opportunities for making decision on data in real or nearly real time. In these systems, data is generated continuously resulting in a stream of data, and predictive models need to be built and updated online with the incoming data. In addition, the predictive models need to be able to output predictions continuously, and without delays. Automated data acquisition systems are prone to occasional failures. As a result, missing values may often occur. Nevertheless, predictions need to be made continuously. Hence, predictive models need to have mechanisms for dealing with missing data in such a way that the loss in accuracy due to occasionally missing values would be minimal. In this paper, we theoretically analyze …", "num_citations": "26\n", "authors": ["1071"]}
{"title": "Ecosystem evolution and hominin paleobiology at East Turkana, northern Kenya between 2.0 and 1.4 Ma\n", "abstract": " Over the past five decades, fossil deposits within the Upper Burgi, KBS and Okote members at East Turkana in northern Kenya have provided many important insights into hominin behavior and ecology during a critical period in hominin evolution between 2.0 and 1.4 Ma. In this study, we use a large compilation of faunal abundance data from paleontological and archaeological collections at East Turkana dating to this time interval to investigate temporal patterns in large mammal taxa, ecosystem evolution and hominin ecology. Our analyses indicate that although portions of the ecosystem were dominated by mesic grasslands, the relative proportion of mesic and arid grassland environments varied though time. We document a major transition in the family Suidae with an increase in the abundance of fossils attributed to the Metridiochoerus lineage coeval with the local extinction of the Notochoerus lineage and …", "num_citations": "25\n", "authors": ["1071"]}
{"title": "Towards context aware food sales prediction\n", "abstract": " Sales prediction is a complex task because of a large number of factors affecting the demand. We present a context aware sales prediction approach, which selects the base predictor depending on the structural properties of the historical sales. In the experimental part we show that there exist product subsets on which, using this strategy, it is possible to outperform naive methods. We also show the dependencies between product categorization accuracies and sales prediction accuracies. A case study of a food wholesaler indicates that moving average prediction can be outperformed by intelligent methods, if proper categorization is in place, which appears to be a difficult task.", "num_citations": "24\n", "authors": ["1071"]}
{"title": "High density-focused uncertainty sampling for active learning over evolving stream data\n", "abstract": " Data labeling is an expensive and time-consuming task, hence carefully choosing which labels to use for training a model is becoming increasingly important. In the active learning setting, a classifier is trained by querying labels from a small representative fraction of data. While many approaches exist for non-streaming scenarios, few works consider the challenges of the data stream setting. We propose a new active learning method for evolving data streams based on a combination of density and prediction uncertainty (DBALStream). Our approach decides to label an instance or not, considering whether it lies in an high density partition of the data space. This allows focusing labelling efforts in the instance space where more data is concentrated; hence, the benefits of learning a more accurate classifier are expected to be higher. Instance density is approximated in an online manner by a sliding window mechanism, a standard technique for data streams. We compare our method with state-of-the-art active learning strategies over benchmark datasets. The experimental analysis demonstrates good predictive performance of the new approach.", "num_citations": "23\n", "authors": ["1071"]}
{"title": "Handling outliers and concept drift in online mass flow prediction in CFB boilers\n", "abstract": " In this paper we consider an application of data mining technology to the analysis of time series data from a pilot circulating fluidized bed (CFB) reactor. We focus on the problem of the online mass prediction in CFB boilers. We present a framework based on switching regression models depending on perceived changes in the data. We analyze three alternatives for change detection. Additionally, a noise canceling and a state determination and windowing mechanisms are used for improving the robustness of online prediction. We validate our ideas on real data collected from the pilot CFB boiler.", "num_citations": "20\n", "authors": ["1071"]}
{"title": "Regression models tolerant to massively missing data: a case study in solar-radiation nowcasting\n", "abstract": " Statistical models for environmental monitoring strongly rely on automatic data acquisition systems that use various physical sensors. Often, sensor readings are missing for extended periods of time, while model outputs need to be continuously available in real time. With a case study in solar-radiation nowcasting, we investigate how to deal with massively missing data (around 50% of the time some data are unavailable) in such situations. Our goal is to analyze characteristics of missing data and recommend a strategy for deploying regression models which would be robust to missing data in situations where data are massively missing. We are after one model that performs well at all times, with and without data gaps. Due to the need to provide instantaneous outputs with minimum energy consumption for computing in the data streaming setting, we dismiss computationally demanding data imputation methods and resort to a mean replacement, accompanied with a robust regression model. We use an established strategy for assessing different regression models and for determining how many missing sensor readings can be tolerated before model outputs become obsolete. We experimentally analyze the accuracies and robustness to missing data of seven linear regression models. We recommend using the regularized PCA regression with our established guideline in training regression models, which themselves are robust to missing data.", "num_citations": "19\n", "authors": ["1071"]}
{"title": "Context-aware personal route recognition\n", "abstract": " Personal route recognition is an important element of intelligent transportation systems. The results may be used for providing personal information about location-specific events, services, emergency or disaster situations, for location-specific advertising and more. Existing real-time route recognition systems often compare the current driving trajectory against the trajectories observed in past and select the most similar route as the most likely. The problem is that such systems are inaccurate in the beginning of a trip, as typically several different routes start at the same departure point (e.g. home). In such situations the beginnings of trajectories overlap and the trajectory alone is insufficient to recognize the route. This drawback limits the utilization of route prediction systems, since accurate predictions are needed as early as possible, not at the end of the trip. To solve this problem we incorporate external …", "num_citations": "18\n", "authors": ["1071"]}
{"title": "The multi-agent system for prediction of financial time series\n", "abstract": " To take into account different character of distinct segments of non-stationary financial time series the multi-agent system based forecasting algorithm is suggested. The primary goal of present paper is to introduce methodological findings that could help to reduce one step ahead forecasting error. In contrast to previous investigation [6], instead of single prediction rule we use a system of several adaptive forecasting agents. The agents evolve, compete among themselves. Final decision is made by a collective of the most successive agents and present time moment. New multi-agent forecasting system allows utilizing shorter training sequences and results in more accurate forecasts than employing single prediction algorithm.", "num_citations": "18\n", "authors": ["1071"]}
{"title": "Explainable and non-explainable discrimination in classification\n", "abstract": " Nowadays more and more decisions in lending, recruitment, grant or study applications are partially being automated based on computational models (classifiers) premised on historical data. If the historical data was discriminating towards socially and legally protected groups, a model learnt over this data will make discriminatory decisions in the future. As a solution, most of the discrimination free modeling techniques force the treatment of the sensitive groups to be equal and do not take into account that some differences may be explained by other factors and thus justified. For example, disproportional recruitment rates for males and females may be explainable by the fact that more males have higher education; treating males and females equally will introduce reverse discrimination, which may be undesirable as well. Given that the law or domain experts specify which factors are discriminatory (e.g …", "num_citations": "16\n", "authors": ["1071"]}
{"title": "Controlled permutations for testing adaptive learning models\n", "abstract": " We study evaluation of supervised learning models that adapt to changing data distribution over time (concept drift). The standard testing procedure that simulates online arrival of data (test-then-train) may not be sufficient to generalize about the performance, since that single test concludes how well a model adapts to this fixed configuration of changes, while the ultimate goal is to assess the adaptation to changes that happen unexpectedly. We propose a methodology for obtaining datasets for multiple tests by permuting the order of the original data. A random permutation is not suitable, as it makes the data distribution uniform over time and destroys the adaptive learning task. Therefore, we propose three controlled permutation techniques that make it possible to acquire new datasets by introducing restricted variations in the order of examples. The control mechanisms with theoretical guarantees of …", "num_citations": "15\n", "authors": ["1071"]}
{"title": "From sensor readings to predictions: On the process of developing practical soft sensors\n", "abstract": " Automatic data acquisition systems provide large amounts of streaming data generated by physical sensors. This data forms an input to computational models (soft sensors) routinely used for monitoring and control of industrial processes, traffic patterns, environment and natural hazards, and many more. The majority of these models assume that the data comes in a cleaned and pre-processed form, ready to be fed directly into a predictive model. In practice, to ensure appropriate data quality, most of the modelling efforts concentrate on preparing data from raw sensor readings to be used as model inputs. This study analyzes the process of data preparation for predictive models with streaming sensor data. We present the challenges of data preparation as a four-step process, identify the key challenges in each step, and provide recommendations for handling these issues. The discussion is focused on the …", "num_citations": "14\n", "authors": ["1071"]}
{"title": "Dental ecometrics of tropical Africa: linking vegetation types and communities of large plant-eating mammals\n", "abstract": " Background: The dental characteristics of large plant-eating mammals, such as hypsodonty, quite accurately describe present and past climatic conditions worldwide. However, several peculiar regions give systematically higher predictions of primary productivity than the local average environmental conditions should support. We call these ‘anomalies’. Anomalies are prominent in areas dominated by pastoralism, such as the Sahel in Africa, suggesting humancompetitive pressure against the wild animal communities. Question: What might explain such dental ecometric anomalies? Data: Occurrence of large, plant-eating mammals worldwide; quantitative characteristics of their teeth; global net primary productivity derived from temperature and precipitation relationships.Analyses: We analyse dental ecometrics of present-day Africa, with the aim to understand the ecology behind such anomalies. By identifying dental traits that are differentially sensitive to human activities, we can develop tailored models for accurate reconstruction of tropical habitats while taking human activities into account. Results: A combination of dental crown height and reinforcement of cusps helps to distinguish continuous, moist forests from patchy forest fragments within arid grasslands. We demonstrate how dental traits that have different sensitivity to competition with livestock can capture anthropogenic effects on wild animal communities in climatically sensitive zones. We produce a methodology for understanding the present and guiding the future of terrestrial ecosystems.", "num_citations": "13\n", "authors": ["1071"]}
{"title": "Learning with actionable attributes: Attention--boundary cases!\n", "abstract": " Traditional supervised learning assumes that instances are described by observable attributes. The goal is to learn to predict the labels for unseen instances. In many real world applications the values of some attributes are not only observable, but can be proactively chosen by a decision maker. Furthermore, in some of such applications the decision maker is interested not only to generate accurate predictions, but to maximize the probability of the desired outcome. For example, a direct marketing manager can choose the color of an envelope (actionable attribute), in which the offer is sent to a client, hoping that the right choice will result in a positive response with a higher probability. We study how to learn to choose the value of an actionable attribute in order to maximize the probability of a desired outcome in supervised learning settings. We emphasize that not all instances are equally sensitive to change in …", "num_citations": "12\n", "authors": ["1071"]}
{"title": "Heart failure hospitalization prediction in remote patient management systems\n", "abstract": " Healthcare systems are shifting from patient care in hospitals to monitored care at home. It is expected to improve the quality of care without exploding the costs. Remote patient management (RPM) systems offer a great potential in monitoring patients with chronic diseases, like heart failure or diabetes. Patient modeling in RPM systems opens opportunities in two broad directions: personalizing information services, and alerting medical personnel about the changing conditions of a patient. In this study we focus on heart failure hospitalization (HFH) prediction, which is a particular problem of patient modeling for alerting. We formulate a short term HFH prediction problem and show how to address it with a data mining approach. We emphasize challenges related to the heterogeneity, different types and periodicity of the data available in RPM systems. We present an experimental study on HFH prediction using, which …", "num_citations": "11\n", "authors": ["1071"]}
{"title": "Computational biomes: The ecometrics of large mammal teeth\n", "abstract": " As organisms are adapted to their environments, assemblages of taxa can be used to describe environments in the present and in the past. Here, we use a data mining method, namely redescription mining, to discover and analyze patterns of association between large herbivorous mammals and their environments via their functional traits. We focus on functional properties of animal teeth, characterized using a recently developed dental trait scoring scheme. The teeth of herbivorous mammals serve as an interface to obtain energy from food, and are therefore expected to match the types of plant food available in their environment. Hence, dental traits are expected to carry a signal of environmental conditions. We analyze a global compilation of occurrences of large herbivorous mammals and of bioclimatic conditions. We identify common patterns of association between dental traits distributions and bioclimatic conditions and discuss their implications. Each pattern can be considered as a computational biome. Our analysis distinguishes three global zones, which we refer to as the boreal-temperate moist zone, the tropical moist zone and the tropical-subtropical dry zone. The boreal-temperate moist zone is mainly characterized by seasonal cold temperatures, a lack of hypsodonty and a high share of species with obtuse lophs. The tropical moist zone is mainly characterized by high temperatures, high isothermality, abundant precipitation and a high share of species with acute rather than obtuse lophs. Finally, the tropical dry zone is mainly characterized by a high seasonality of temperatures and precipitation, as well as high hypsodonty and …", "num_citations": "10\n", "authors": ["1071"]}
{"title": "Relative abundances and palaeoecology of four suid genera in the Turkana Basin, Kenya, during the late Miocene to Pleistocene\n", "abstract": " Most suids (Mammalia: Suidae, pigs) worldwide are omnivores living in closed environments, but the African warthog (Phacochoerus) has special adaptations for grazing in open environments. Similar specializations have been recorded from Plio-Pleistocene African suids. Four genera, Nyanzachoerus, Notochoerus, Kolpochoerus, and Metridiochoerus, have been discovered in late Miocene to middle Pleistocene locations around the Turkana Basin.We analyse the relative abundances of these four suid genera compared to other mammals, from approximately 8–0.7 Ma. The dataset includes most of the mammal specimens collected from locations around the Kenyan side of the Turkana Basin. Species of genus Nyanzachoerus were dominant before 4 Ma, but their relative abundance decreases through time thereafter. At the same time, Notochoerus increases in relative abundance, followed by Kolpochoerus, and …", "num_citations": "10\n", "authors": ["1071"]}
{"title": "Predicting respiratory motion for real-time tumour tracking in radiotherapy\n", "abstract": " Radiation therapy is a local treatment aimed at killing cells in and around a tumor. Accurate predictions of lung tumor motion help to improve the precision of radiation treatment by controlling the position of a patient during radiation treatment. Our goal is to develop an algorithmic solution for predicting the position of a target in 3D in real time. In addition to prediction accuracy and low fluctuation of the prediction signal (jitter) we aim for minimum calibration time each patient at the beginning of the procedure. Our solution is based on a model form from the family of exponential smoothing. Performance is evaluated on clinical datasets capturing different behavior (quiet, talking, laughing), and validated in real-time on a prototype with respiratory motion imitation. Proposed solution (ExSmi) achieves good accuracy of prediction (error 4-9 mm/s) with tolerable jitter values (5-7 mm/s). The solution performs well to be …", "num_citations": "10\n", "authors": ["1071"]}
{"title": "Online detection of shutdown periods in chemical plants: A case study\n", "abstract": " In process industry, chemical processes are controlled and monitored by using readings from multiple physical sensors across the plants. Such physical sensors are also supplemented by soft sensors, i.e. adaptive predictive models, which are often used for computing hard-to-measure variables of the process. For soft sensors to work well and adapt to changing operating conditions they need to be provided with relevant data. As production plants are regularly stopped, data instances generated during shutdown periods have to be identified to avoid updating these predictive models with wrong data. We present a case study concerned with a large chemical plant operation over a 2 years period. The task is to robustly and accurately identify the shutdown periods even in case of multiple sensor failures. State-of-the-art methods were evaluated using the first half of the dataset for calibration purposes and the other half …", "num_citations": "10\n", "authors": ["1071"]}
{"title": "Controlled permutations for testing adaptive classifiers\n", "abstract": " We study evaluation of online classifiers that are designed to adapt to changes in data distribution over time (concept drift). A standard procedure to evaluate such classifiers is the test-then-train, which iteratively uses the incoming instances for testing and then for updating a classifier. Comparing classifiers based on such a test risks to give biased results, since a dataset is processed only once in a fixed sequential order. Such a test concludes how well classifiers adapt when changes happen at fixed time points, while the ultimate goal is to assess how well they would adapt when changes of a similar type happen unexpectedly. To reduce the risk of biased evaluation we propose to run multiple tests with permuted data. A random permutation is not suitable, as it makes the data distribution uniform over time and destroys the adaptive learning problem. We develop three permutation techniques with theoretical …", "num_citations": "10\n", "authors": ["1071"]}
{"title": "Prediction of commodity prices in rapidly changing environments\n", "abstract": " In dynamic financial time series prediction, neural network training based on short data sequences results to more accurate predictions as using lengthy historical data. Optimal training set size is determined theoretically and experimentally. To reduce generalization error we: a) perform dimensionality reduction by mapping input data into low dimensional space using the multilayer perceptron, b) train the single layer perceptron classifier with short sequences of low-dimensional input data series, c) each time initialize the perceptron with weight vector obtained after training with previous portion of the data sequence, d) make use of useful preceding historical information accumulated in the financial time series data by the early stopping procedure.", "num_citations": "10\n", "authors": ["1071"]}
{"title": "A Humboldtian approach to life and climate of the geological past: estimating palaeotemperature from dental traits of mammalian communities\n", "abstract": " Aim The links between geo‐ and biodiversity, postulated by Humboldt, can now be made quantitative. Species are adapted to their environments and interact with their environments by having pertinent functional traits. We aim to improve global ecometric models using functional traits for estimating palaeoclimate and apply models to Pleistocene fauna for palaeoclimate interpretation.   Location Global at present day, Pleistocene of Europe for fossil data analysis.   Taxa Artiodactyla, Perissodactyla, Proboscidea and Primates.   Methods We quantify functional traits of large mammal communities and develop statistical models linking trait distributions to local climate at present day. We apply these models to the fossil record, survey functional traits, and quantitatively estimate climates of the past. This approach to analysing functional relationships between faunal communities and their environments is called …", "num_citations": "9\n", "authors": ["1071"]}
{"title": "The phylogenetic signal in tooth wear: What does it mean?\n", "abstract": " A new study by Fraser et al (2018) urges the use of phylogenetic comparative methods, whenever possible, in analyses of mammalian tooth wear. We are concerned about this for two reasons. First, this recommendation may mislead the research community into thinking that phylogenetic signal is an artifact of some sort rather than a fundamental outcome of the evolutionary process. Secondly, this recommendation may set a precedent for editors and reviewers to enforce phylogenetic adjustment where it may unnecessarily weaken or even directionally alter the results, shifting the emphasis of analysis from common patterns manifested by large clades to rare cases.", "num_citations": "9\n", "authors": ["1071"]}
{"title": "Labeling sensing data for mobility modeling\n", "abstract": " In urban environments, sensory data can be used to create personalized models for predicting efficient routes and schedules on a daily basis; and also at the city level to manage and plan more efficient transport, and schedule maintenance and events. Raw sensory data is typically collected as time-stamped sequences of records, with additional activity annotations by a human, but in machine learning, predictive models view data as labeled instances, and depend upon reliable labels for learning. In real-world sensor applications, human annotations are inherently sparse and noisy. This paper presents a methodology for preprocessing sensory data for predictive modeling in particular with respect to creating reliable labeled instances. We analyze real-world scenarios and the specific problems they entail, and experiment with different approaches, showing that a relatively simple framework can ensure quality …", "num_citations": "9\n", "authors": ["1071"]}
{"title": "Identifying hidden contexts in classification\n", "abstract": " In this study we investigate how to identify hidden contexts from the data in classification tasks. Contexts are artifacts in the data, which do not predict the class label directly. For instance, in speech recognition task speakers might have different accents, which do not directly discriminate between the spoken words. Identifying hidden contexts is considered as data preprocessing task, which can help to build more accurate classifiers, tailored for particular contexts and give an insight into the data structure. We present three techniques to identify hidden contexts, which hide class label information from the input data and partition it using clustering techniques. We form a collection of performance measures to ensure that the resulting contexts are valid. We evaluate the performance of the proposed techniques on thirty real datasets. We present a case study illustrating how the identified contexts can be used to …", "num_citations": "9\n", "authors": ["1071"]}
{"title": "Fairness-aware machine learning: a perspective\n", "abstract": " Algorithms learned from data are increasingly used for deciding many aspects in our life: from movies we see, to prices we pay, or medicine we get. Yet there is growing evidence that decision making by inappropriately trained algorithms may unintentionally discriminate people. For example, in automated matching of candidate CVs with job descriptions, algorithms may capture and propagate ethnicity related biases. Several repairs for selected algorithms have already been proposed, but the underlying mechanisms how such discrimination happens from the computational perspective are not yet scientifically understood. We need to develop theoretical understanding how algorithms may become discriminatory, and establish fundamental machine learning principles for prevention. We need to analyze machine learning process as a whole to systematically explain the roots of discrimination occurrence, which will allow to devise global machine learning optimization criteria for guaranteed prevention, as opposed to pushing empirical constraints into existing algorithms case-by-case. As a result, the state-of-the-art will advance from heuristic repairing, to proactive and theoretically supported prevention. This is needed not only because law requires to protect vulnerable people. Penetration of big data initiatives will only increase, and computer science needs to provide solid explanations and accountability to the public, before public concerns lead to unnecessarily restrictive regulations against machine learning.", "num_citations": "8\n", "authors": ["1071"]}
{"title": "OMFP: An approach for online mass flow prediction in CFB boilers\n", "abstract": " Fuel feeding and inhomogeneity of fuel typically cause process fluctuations in the circulating fluidized bed (CFB) boilers. If control systems fail to compensate the fluctuations, the whole plant will suffer from fluctuations that are reinforced by the closed-loop controls. Accurate estimates of fuel consumption among other factors are needed for control systems operation. In this paper we address a problem of online mass flow prediction. Particularly, we consider the problems of (1) constructing the ground truth, (2) handling noise and abrupt concept drift, and (3) learning an accurate predictor. Last but not least we emphasize the importance of having the domain knowledge concerning the considered case. We demonstrate the performance of OMPF using real data sets collected from the experimental CFB boiler.", "num_citations": "8\n", "authors": ["1071"]}
{"title": "A survey of evaluation methods for personal route and destination prediction from mobility traces\n", "abstract": " Personal mobility data can nowadays be easily collected by personal mobile phones and used for analytical modeling. To assist in such an analysis, a variety of computational approaches have been developed. The goal is to extract mobility patterns in order to provide traveling assistance, information, recommendations or on‐demand services. While various computational techniques are being developed, research literature on destination and route prediction lacks consistency in evaluation methods for such approaches. This study presents a review and categorization of evaluation criteria and terminology used in assessing the performance of such methods. The review is complemented by experimental analysis of selected evaluation criteria, to highlight the nuances existing between the evaluation measures. The experimental study uses previously unpublished mobility data of 15 users collected over a period of …", "num_citations": "7\n", "authors": ["1071"]}
{"title": "Mobile sensing data for urban mobility analysis: A case study in preprocessing\n", "abstract": " Pervasiveness of mobile phones and the fact that the phones have sensors make them ideal as personal sensors. Smart phones are equipped with a wide range of motion, location and environment sensors, that allow us to analyze, model and predict mobility in urban areas. Raw sensory data is being collected as time-stamped sequences of records, and this data needs to be preprocessed and aggregated before any predictive modeling can be done. This paper presents a case study in preprocessing such data, collected by one person over six months period. Our goal with this exploratory pilot study is to discuss data aggregation challenges from machine learning point of view, and identify relevant directions for future research in preprocessing mobile sensing data for human mobility analysis.", "num_citations": "6\n", "authors": ["1071"]}
{"title": "Predicting multi-class customer profiles based on transactions: a case study in food sales\n", "abstract": " Predicting the class of customer profiles is a key task in marketing, which enables businesses to approach the customers in a right way to satisfy the customer’s evolving needs. However, due to costs, privacy and/or data protection, only the business’ owned transactional data is typically available for constructing customer profiles. We present a new approach that is designed to efficiently and accurately handle the multi-class classification of customer profiles built using sparse and skewed transactional data. Our approach first bins the customer profiles on the basis of the number of items transacted. The discovered bins are then partitioned and prototypes within each of the discovered bins selected to build the multi-class classifier models. The results obtained from using four multi-class classifiers on real-world transactional data consistently show the critical numbers of items at which the predictive …", "num_citations": "6\n", "authors": ["1071"]}
{"title": "The case of the grass‐eating suids in the Plio‐Pleistocene Turkana Basin: 3D dental topography in relation to diet in extant and fossil pigs\n", "abstract": " Two separate subfamilies of Plio‐Pleistocene African pigs (suids) consecutively evolved hypsodont and horizodont molars with flat occlusal surfaces, commonly interpreted as an adaptive trait to a grazing diet, similar to that of the present warthogs (Phacochoerus spp.). To investigate this in detail, we studied the 3D‐dental topography of fossil specimens from the Turkana Basin, using geographic information systems‐based methods. To establish baselines for interpretation of the Turkana Basin suids, topography of third molars of extant suids with known diets were analyzed: grazing warthog (Phacochoerus africanus), herbivorous mixed‐feeder forest hog (Hylochoerus meinertzhageni), omnivorous generalist wild boar (Sus scrofa), omnivorous fruit and tuber eater bush pig (Potamochoerus spp.), and omnivorous fruit eater babirusa (Babyrousa spp.) In addition, we analyzed supposedly browsing Miocene suids …", "num_citations": "5\n", "authors": ["1071"]}
{"title": "Modelling recurrent events for improving online change detection\n", "abstract": " The task of online change point detection in sensor data streams is often complicated due to presence of noise that can be mistaken for real changes and therefore affecting performance of change detectors. Most of the existing change detection methods assume that changes are independent from each other and occur at random in time. In this paper we study how performance of detectors can be improved in case of recurrent changes. We analytically demonstrate under which conditions and for how long recurrence information is useful for improving the detection accuracy. We propose a simple computationally efficient message passing procedure for calculating a predictive probability distribution of change occurrence in the future. We demonstrate two straightforward ways to apply the proposed procedure to existing change detection algorithms. Our experimental analysis illustrates the effectiveness of these …", "num_citations": "5\n", "authors": ["1071"]}
{"title": "Accessibility by public transport predicts residential real estate prices: A case study in helsinki region\n", "abstract": " This pilot study investigates how considering accessibility could help to model prices of residential real estate more accurately. We introduce two novelties from the price modeling point of view (1) defining accessibility as travel time by public transport, in addition to geographic distance, and (2) considering dynamic points of interest from check-ins into social networks, in addition to fixed location community centers. Our case study focuses on the Helsinki region. We model price per square meter as a linear function of apartment characteristics, and characteristics of the neighborhood, including accessibility by public transport and social activities. The resulting models show good predictive performance, as compared to baselines not taking accessibility into account. We discover that apartment price relates to the geographical distance from the city center, but accessibility by public transport to local centers of interest is more informative than just the geographical distance to those centers.", "num_citations": "5\n", "authors": ["1071"]}
{"title": "Indirect tracking of functional target for respiration compensation in radiotherapy\n", "abstract": " The main goal of radiotherapy is to destroy the tumor while minimizing harm to nearby healthy tissue. In order to achieve an effective and accurate treatment, motion of the target, caused by respiration, should be taken into account when positioning the beam. This paper presents a work-in-progress on computational techniques for identifying tumor position from an external marker during treatment session.", "num_citations": "5\n", "authors": ["1071"]}
{"title": "Expected classification error of the euclidean linear classifier under sudden concept drift\n", "abstract": " We look at binary online classification in the light of sudden concept drift (data exhibits non-stationarity). The accuracy of the classifier trained on a mixture of old and new data is compared to the accuracy of the classifier trained only on new data, assuming known point of concept drift. We employ a simplified model of concept drift and derive theoretical generalization error for the Euclidean linear classifier. Right after concept drift the retrained classifier is more accurate than the new classifier, especially in cases when the data is complex (high dimensionality, low separability). The new classifier should be preferred when the extent of drift is very large.", "num_citations": "5\n", "authors": ["1071"]}
{"title": "Blpa: Bayesian learn-predict-adjust method for online detection of recurrent changepoints\n", "abstract": " Online changepoint detection is an important task for machine learning in changing environments, as it signals when the learning model needs to be updated. Presence of noise that can be mistaken for real changes makes it difficult to develop an effective approach that would have a low false alarm rate and being able to detect all the changes with a minimal delay. In this paper we study how performance of popular Bayesian online detectors can be improved in case of recurrent changes. Modelling recurrence allows us to anticipate future changepoints and predict their locations in time. We propose an approach for inducing and integrating recurrence information in the streaming settings, and demonstrate its effectiveness on synthetic and realworld human activity datasets.", "num_citations": "4\n", "authors": ["1071"]}
{"title": "Towards hardware-driven design of low-energy algorithms for data analysis\n", "abstract": " In the era of \"big\" data, data analysis algorithms need to be efficient. Traditionally researchers would tackle this problem by considering \"small\" data algorithms, and investigating how to make them computationally more efficient for big data applications. The main means to achieve computational efficiency would be to revise the necessity and order of subroutines, or to approximate calculations. This paper presents a viewpoint that in order to be able to cope with the new challenges of the growing digital universe, research needs to take a combined view towards data analysis algorithm design and hardware design, and discusses a potential research direction in taking an intreated approach in terms of algorithm design and hardware design. Analyzing how data mining algorithms operate at the elementary operations level can help do design more specialized and dedicated hardware, that, for instance, would be …", "num_citations": "4\n", "authors": ["1071"]}
{"title": "Fault tolerant regression for sensor data\n", "abstract": " Many systems rely on predictive models using sensor data, with sensors being prone to occasional failures. From the operational point of view predictions need to be tolerant to sensor failures such that the loss in accuracy due to temporary missing sensor readings would be minimal. In this paper, we theoretically and empirically analyze robustness of linear predictive models to temporary missing data. We demonstrate that if the input sensors are correlated the mean imputation of missing values may lead to a very rapid deterioration of the prediction accuracy. Based on the theoretical results we introduce a quantitative measure that allows to assess how robust is a given linear regression model to sensor failures. We propose a practical strategy for building and operating robust linear models in situations when temporal sensor failures are expected. Experiments on six sensory datasets and a case study in …", "num_citations": "4\n", "authors": ["1071"]}
{"title": "Pliocene to Middle Pleistocene climate history in the Guadix-Baza Basin, and the environmental conditions of early Homo dispersal in Europe\n", "abstract": " The Guadix-Baza Basin (GBB) in Andalucía, Spain, comprises palaeontological and archaeological sites dating from the Early Pliocene to the Middle Pleistocene, including some of the earliest sites with evidence for the presence of early humans (Homo sp.) in Europe. Thus, the history of climate and environments in this basin contributes significantly to our understanding of the conditions under which early humans spread into Europe during the Early Pleistocene. Here we present estimates of precipitation and primary productivity in the GBB from the Pliocene to the Middle Pleistocene based on dental ecometrics in fossil communities of large herbivorous mammals, and perform an ecometrics-based distribution modelling to analyse the environmental conditions of Early and Middle Pleistocene human sites in Europe. Our results show that Early Pleistocene humans generally occupied on average relatively diverse …", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Revise rules on conflicts of interest\n", "abstract": " For example, many potential reviewers are disqualified under current rules on co-authorship. However, research papers now have increasing numbers of co-authors and their interaction may be little more than episodic, with no genuine COI in practice. The judgement of an author who, say, contributed a data set to a paper is unlikely to be corrupted when reviewing a new paper from former co-authors. In our editorial experience, co-authors typically have a sound understanding of each other’s work and provide frank and constructive feedback. Using them as reviewers avoids settling for candidates who may be too far removed from the topic or not sufficiently senior in the field. We suggest that only longrunning co-authorship should be counted as a COI in peer review. Other potential COIs should include supervisor–student relationships, shared institutional affiliations and collaborators working on the same project, with an expiry date if appropriate.", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Optimal estimates for short horizon travel time prediction in urban areas\n", "abstract": " Increasing popularity of mobile route planning applications based on GPS technology provides opportunities for collecting traffic data in urban environments. One of the main challenges for travel time estimation and prediction in such a setting is how to aggregate data from vehicles that have followed different routes, and predict travel time for new routes of interest. One approach is to predict travel times for route segments, and sum those estimates to obtain a prediction for the whole route. We study how to obtain optimal predictions in this scenario. It appears that the optimal way to estimate travel times to minimize the expected mean absolute error is to combine the mean and the median times on individual segments, where the combination function depends on the number of segments in the route of interest. We present a methodology for obtaining such estimates, and demonstrate its performance on a case study …", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Regression models tolerant to massively missing data: a case study in solar radiation nowcasting\n", "abstract": " Regression models tolerant to massively missing data: a case study in solar radiation nowcasting — Aalto University's research portal Skip to main navigation Skip to search Skip to main content Aalto University's research portal Logo Accessibility statement English Suomi Home Profiles Research output Datasets Projects Prizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name or affiliation Regression models tolerant to massively missing data: a case study in solar radiation nowcasting Indre Zliobaite, Jaakko Hollmén, Heikki Junninen Research output: Contribution to journal › Article › Scientific › peer-review 9 Citations (Scopus) Overview Original language English Pages (from-to) 7137-7174 Journal ATMOSPHERIC MEASUREMENT TECHNIQUES DISCUSSIONS Volume 7 Issue number 7 Publication status Published - 2014 MoE publication type A1 Journal article-refereed …", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Introduction to the special issue on handling concept drift in adaptive information systems\n", "abstract": " Modern information systems collect data from multiple sources, process it, extract information and use it for decision support or decision making. Predictive modeling is an important component of an information system that makes the system intelligent. This special issue focuses on adaptive information systems that can adjust their behavior relying on additional mechanisms continuously monitoring the operational setting and/or the performance of predictive models. Adaptive information systems have become ubiquitous in various application areas including online businesses, personal information access, industry, medicine, education, defence, and in which predictive analytics is an important decision making or decision support component. In the real world data is often non stationary. In predictive analytics, machine learning and data mining the phenomenon of unexpected change in underlying data over time is …", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Dealing with concept drifts in process mining: A case study in a Dutch municipality\n", "abstract": " Although most business processes change over time, contemporary process mining techniques tend to analyze these processes as if they are in steady-state. Processes may change suddenly or gradually. The drift may be periodic (eg due to seasonal influences) or one-of-akind (eg, the effects of new legislation). For process management it is crucial to discover and understand such concept drifts in processes. In this paper, we present a case study of analyzing concept drifts in three different processes within a large Dutch municipality.", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Correlation of external markers and functional targets for respiration compensation in radiotherapy\n", "abstract": " The goal of radiation therapy is to give as intensive treatment dose as possible to the exact location of a tumor (target) and at the same time minimising a potential harm to the healthy tissues. Advances in the computer-based control have enabled planning and providing accurate treatments. However, current technology does not allow compensating for respiratory motion in the lungs and abdomen area. As the target moves due to respiratory motion, healthy tissues are affected. This paper presents a work-in-progress, which aims at developing algorithmic techniques for estimating correlation of external markers and functional targets. These techniques will enable tracking tumours during radiotherapy sessions an dynamically adjusting for respiratory movements", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Three data partitioning strategies for building local classifiers\n", "abstract": " Divide-and-conquer approach has been recognized in multiple classifier systems aiming to utilize local expertise of individual classifiers. In this study we experimentally investigate three strategies for building local classifiers that are based on different routines of sampling data for training. The first two strategies are based on clustering the training data and building an individual classifier for each cluster or a combination. The third strategy divides the training set based on a selected feature and trains a separate classifier for each subset. Experiments are carried out on simulated and real datasets. We report improvement in the final classification accuracy as a result of combining the three strategies.", "num_citations": "3\n", "authors": ["1071"]}
{"title": "Concept drift over geological times: predictive modeling baselines for analyzing the mammalian fossil record\n", "abstract": " Fossils are the remains organisms from earlier geological periods preserved in sedimentary rock. The global fossil record documents and characterizes the evidence about organisms that existed at different times and places during the Earth’s history. One of the major directions in computational analysis of such data is to reconstruct environmental conditions and track climate changes over millions of years. Distribution of fossil animals in space and time make informative features for such modeling, yet concept drift presents one of the main computational challenges. As species continuously go extinct and new species originate, animal communities today are different from the communities of the past, and the communities at different times in the past are different from each other. The fossil record is continuously increasing as new fossils and localities are being discovered, but it is not possible to observe or …", "num_citations": "2\n", "authors": ["1071"]}
{"title": "The nature of the Old World savannah palaeobiome\n", "abstract": " To the Editor—Writing in Nature Ecology & Evolution in 2018, we argued that there existed during the later Miocene of the Old World (ca. 15–5 million years ago)“a single cohesive Old-World savannah palaeobiome of which the modern African savannah fauna is the surviving branch” 1. Subsequently, Denk et al. 2 have taken issue with this interpretation and argued, using palaeobotanical data, that no such cohesive biome existed and that a more compelling reconstruction has mixed trees and shrublands dominant at that time. In addition to defending our original interpretation, we will clarify some terms used in our paper, as we feel that much of the apparent discrepancy may actually reflect differences in terminology.We used the term savannah in a broad sense, common in Neogene and Quaternary palaeoecology 3, meaning a woodland to grassland biome characterized by co-dominance of trees and grasses 4 …", "num_citations": "2\n", "authors": ["1071"]}
{"title": "A 5.3 pJ/op approximate TTA VLIW tailored for machine learning\n", "abstract": " To achieve energy efficiency in the Internet-of-Things (IoT), more intelligence is required in the wireless IoT nodes. Otherwise, the energy required by the wireless communication of raw sensor data will prohibit battery lifetime, the backbone of IoT. One option to achive this intelligence is to implement a variety of machine learning algorithms on the IoT sensor instead of the cloud. Shown here is sub-milliwatt machine learning accelerator operating at the Ultra-Low Voltage Minimum-Energy Point. The accelerator is a Transport Triggered Architecture (TTA) Application-Specific Instruction-Set Processor (ASIP) targeted for running various Machine Learning algorithms. The ASIP is implemented in 28 nm FDSOI (Fully Depleted Silicon On Insulator) CMOS process, with an operating voltage of 0.35 V, and is capable of 5.3pJ/cycle and 1.8nJ/iteration when performing conventional machine learning algorithms. The ASIP also …", "num_citations": "2\n", "authors": ["1071"]}
{"title": "Improving adaptation through evolution and learning: a response to Watson and Szathmáry\n", "abstract": " Improving Adaptation Through Evolution and Learning: A Response to Watson and Szathmáry Improving Adaptation Through Evolution and Learning: A Response to Watson and Szathmáry Trends Ecol Evol. 2016 Dec;31(12):892-893. doi: 10.1016/j.tree.2016.10.007. Epub 2016 Oct 25. Authors Indrė Žliobaitė 1 , Nils Chr Stenseth 2 Affiliations 1 Department of Geosciences and Geography, University of Helsinki, PO Box 64, FI-00014, Helsinki, Finland, and Helsinki Institute for Information Technology HIIT, Aalto University, PO Box 15400, FI-00076 Aalto, Finland. Electronic address: indre.zliobaite@helsinki.fi. 2 Centre for Ecological and Evolutionary Synthesis (CEES), Department of Biosciences, University of Oslo, PO Box 1066, Blindern, NO-0316, Oslo, Norway. Electronic address: ncstenseth@ibv.uio.no. PMID: 27793462 DOI: 10.1016/j.tree..Publication types Letter Comment MeSH terms Acclimatization Adaptation, …", "num_citations": "2\n", "authors": ["1071"]}
{"title": "Advanced topics on data stream mining\n", "abstract": " Assistant Professor at the Department of Computer Science, Eindhoven University of Technology, the Netherlands. He has broad research interests in data mining and its application to various (adaptive) information systems serving industry, commerse, medicine and education. He has been organizing several workshops and conferences in these areas.", "num_citations": "2\n", "authors": ["1071"]}
{"title": "Handling concept drift in medical applications: Importance, challenges and solutions\n", "abstract": " In the real world data is often non stationary. In supervised learning, concept drift means that the statistical properties of the target variable, which the model aims to predict, change over time unexpectedly. This causes problems because the predictions might become less accurate as the time passes or opportunities to improve the accuracy might be missed. With the proposed tutorial we intend to reach the following goals: 1) highlight the importance of concept drift handling mechanisms in medical applications; 2) overview existing approaches for handling different types of drift in supervised learning, emphasizing the underlying assumptions that these approaches implicitly or explicitly make about the nature and causes of changes; 3) discuss practical aspects of applying drift handling mechanisms to a wide range of medical applications and present a foreseen development in this field.", "num_citations": "2\n", "authors": ["1071"]}
{"title": "Linear Discriminant Classifier (LDC) for Streaming Data with Concept Drift.\n", "abstract": " Untitled Page 1 Page 2 Linear Discriminant Classifier (LDC) for Streaming Data with Concept Drift Ludmila I Kuncheva School of Computer Science Bangor University, Wales, UK Indre Zliobaite Faculty of Mathematics and Informatics Vilnius University, Lithuania Page 3 B 1 B 2 B 3 B 4 Streaming data Instance or batch data one batch at a time one instance at a time Page 4 Examples of Streaming data with changing concept Filtering spam e-mail: • spam today may not be spam tomorrow (holiday deals) • spammers learn new tricks • the same message may be spam for user A but not for user B Approving bank loans: • social and demographic circumstances of the clients change (eg, younger people are applying for loans, university degree is declining in value) • financial market changes (eg, inflation, unforeseen disruptions of domestic and global economy) Page 5 What is concept change ? after before after common …", "num_citations": "2\n", "authors": ["1071"]}
{"title": "Did the Australopithecus anamensis-Australopithecus afarensis lineage wax and wane? A commentary to Du et al.(2020).\n", "abstract": " Did the Australopithecus anamensis-Australopithecus afarensis lineage wax and wane? A commentary to Du et al. (2020). - Abstract - Europe PMC Sign in or create an account https://orcid.org Europe PMC Menu About About Europe PMC Preprints in Europe PMC Funders Joining Europe PMC Governance Roadmap Outreach Tools Tools overview ORCID article claiming Journal list Grant finder External links service RSS feeds Annotations Annotations submission service Developers Developer resources Articles RESTful API Grants RESTful API API use cases SOAP web service Annotations API OAI service Bulk downloads Developers Forum Help Help using Europe PMC Search syntax reference Contact us Contact us Helpdesk Feedback Twitter Blog Tech blog Developer Forum Europe PMC plus Search worldwide, life-sciences literature Search Advanced Search Recent history Saved searches Abstract Full text …", "num_citations": "1\n", "authors": ["1071"]}
{"title": "AI minds need to think about energy constraints\n", "abstract": " PENGUIN: 2019. 320 PP.£ 23.99 Possible Minds: 25 Ways Looking at AI is a collection of essays communicated by leading experts who speculate about the future of artificial intelligence and human society. The editor John Brockman, a highly accomplished literary agent, has mingled with the elites of the arts and sciences since the 1960s, gathering news and views, sharing gossip and highlighting unanswered questions. The essays are sequenced and interleaved by intros and various anecdotes from the editor, such that the collection almost reads like a monograph. The themes stream from machines, via human minds, to forms of dissidence and control in society, and then back to AI and the future of civilization. The book stays clear from discussing anthropomorphic cyborgs or ever-advancing hardware solutions; it is essentially about how the mind works, artificial or real, and makes for an enjoyable read. Many of …", "num_citations": "1\n", "authors": ["1071"]}
{"title": "Dental functional morphology predicts the scaling of chewing rate in mammals\n", "abstract": " How food intake and mastication scale to satisfy the metabolic needs of mammals has been the subject of considerable scientific debate. Existing theory suggests that the negative allometric scaling of metabolic rate with body mass is compensated by a matching allometric scaling of the chewing rate. Why empirical studies have found that the scaling coefficients of the chewing rate seem to be systematically smaller than expected from theory remains unknown. Here we explain this imparity by decoupling the functional surface area of teeth from overall surface area. The functional surface area is relatively reduced in forms emphasizing linear edges (e.g., lophodont) compared with forms lacking linear structures (e.g., bunodont). In forms with reduced relative functional surface, the deficit in food processed per chew appears to be compensated for by increased chewing rate, such that the metabolic requirements are …", "num_citations": "1\n", "authors": ["1071"]}
{"title": "A survey of computational methods for fossil data analysis\n", "abstract": " Aim: to survey and organize computational approaches to fossil data analysis into a methodological framework; to highlight what kind of research questions about evolutionary and environmental change can be answered by applying computational algorithms to mammal fossil data to better understand past ecosystems and climates.Questions: What kind of models have been used for what research questions? What is their scope of application? What are their potential limitations?Search methods: The literature selection is based on our personal knowledge, as well as keyword-based searches. Papers are considered relevant if data-driven computational methods are used for analyzing relationships between organisms and their environments at evolutionary time scales.Conclusions: We demonstrate that different research questions may be answered with the same computational algorithm, and different algorithms may be needed to answer the same question in different contexts. Our position is that in order to move forward we need to match knowledge of methods with knowledge of the fossil record in a research question-driven way. Figure 2 presents a proposed workflow. Following this framework, we survey existing work and highlight what research questions can potentially be answered with which methods, some of which may not have been reported in the evolutionary paleontology literature yet. The outcome of this survey is a proposal for a research agenda in computational fossil data analysis.", "num_citations": "1\n", "authors": ["1071"]}
{"title": "A note on adjusting  for using with cross-validation\n", "abstract": " We show how to adjust the coefficient of determination () when used for measuring predictive accuracy via leave-one-out cross-validation.", "num_citations": "1\n", "authors": ["1071"]}
{"title": "Environmental control of growth variation in a boreal Scots pine stand–a data-driven approach\n", "abstract": " Despite the numerous studies on year-to-year variation of tree growth, the physiological mechanisms controlling annual variation in growth are still not understood in detail. We studied the applicability of data-driven approach ie different regression models in analysing high-dimensional data set including continuous and comprehensive measurements over meteorology, ecosystemscale water and carbon fluxes and the annual variation in the growth of app. 50-year-old Scots pine stand in southern Finland. Even though our dataset covered only 16 years, it is the most extensive collection of interactions between a Scots pine ecosystem and atmosphere. The analysis revealed that height growth was favoured by high water potential of the tree and carbon gain during the bud forming period and high water potential during the elongation period. Diameter growth seemed to be favoured by a winter with high precipitation and deep snow cover and a spring with high carbon gain. The obtained models had low generalization performance and they would require more evaluation and iterative validation to achieve credibility perhaps as a mixture of data-driven and first principle modeling approaches.", "num_citations": "1\n", "authors": ["1071"]}
{"title": "Predicting Position of a Functional Target from an External Marker in Radiotherapy.\n", "abstract": " The main goal of radiotherapy is to destroy the tumor while minimizing harm to nearby healthy tissue. Advances in the digital control have enabled planning and performing accurate treatments. However, todays technology is unable to compensate respiration induced motion, and therefore, ensure sufficient precision. One of the tasks in compensating respiratory motion is predicting position of the functional target (tumor) from an external marker during fraction. Performance of techniques, such as Pearson correlation, Gaussian filters, Fourries transformation, cross correlation, linear interpolation and partial-least squares, still leave plenty space for the improvement. We reports results of work in progress, ie experiments of applying different types of regressions to predict motion of functional target from different external markers. Results seem to be promising in most of the cases.", "num_citations": "1\n", "authors": ["1071"]}
{"title": "Guest Editors introduction: special issue of the ECMLPKDD 2015 journal track\n", "abstract": " ECMLPKDD launched its journal track in the current format in 2013. The journal track initiative had large adherence from the community. It was organized again in 2014 and 2015, and will continue in 2016. Two reference journals are involved:“Machine Learning” and “Data Mining and Knowledge Discovery”. In addition to being published in the respective journal, papers were presented as regular papers in the conference. Thus, all papers of this special issue were also presented by their authors at the ECMLPKDD 2015 conference in Porto, Portugal, from September 7th to 11th, 2015. In the journal track of this conference we look for high-quality submissions that present original and mature work in the areas of data mining and machine learning. However, given the special nature of a conference journal track, only papers that naturally lend themselves to being presented were considered. These requirements …", "num_citations": "1\n", "authors": ["1071"]}
{"title": "Application of multiple linear regression for indirect tracking of functional target for respiratory compensation in radiotherapy\n", "abstract": " The main goal of radiotherapy is to eliminate cancerous tumors from the patient body while limiting damage to healthy tissue. Current technologies allow rather precise and effective treatment. However, respiratory motion management still remains a considerable issue. A number of different solutions, such as gating or restricted breathing, can be used for addressing this issue, but the majority of them compensate for respiratory motion only partially, while considerably extending the treatment time. In this paper we investigate multiple linear regression as a tool for predicting the position of the functional target (tumor) from an external marker. This study extends our previous work, where a standard linear regression, and a linear regression with first-order autoregressive errors were analyzed. Our computational analysis suggests that using the proposed approach for prediction of lung tumor motion is expected to …", "num_citations": "1\n", "authors": ["1071"]}
{"title": "Predictive user modeling with actionable attributes\n", "abstract": " Different machine learning techniques have been proposed and used for modeling individual and group user needs, interests and preferences. In the traditional predictive modeling instances are described by observable variables, called attributes. The goal is to learn a model for predicting the target variable for unseen instances. For example, for marketing purposes a company consider profiling a new user based on her observed web browsing behavior, referral keywords or other relevant information. In many real world applications the values of some attributes are not only observable, but can be actively decided by a decision maker. Furthermore, in some of such applications the decision maker is interested not only to generate accurate predictions, but to maximize the probability of the desired outcome. For example, a direct marketing manager can choose which type of a special offer to send to a client (actionable attribute), hoping that the right choice will result in a positive response with a higher probability. We study how to learn to choose the value of an actionable attribute in order to maximize the probability of a desired outcome in predictive modeling. We emphasize that not all instances are equally sensitive to changes in actions. Accurate choice of an action is critical for those instances, which are on the borderline (e.g. users who do not have a strong opinion one way or the other). We formulate three supervised learning approaches for learning to select the value of an actionable attribute at an instance level. We also introduce a focused training procedure which puts more emphasis on the situations where varying the action is the most …", "num_citations": "1\n", "authors": ["1071"]}