{"title": "The effect of scaffolding students’ context-generating cognitive activity in technology-enhanced case-based learning\n", "abstract": " This study investigates the hypothesis that students’ learning and problem-solving performance in ill-structured domains can be improved, if elaborative question prompts are used to activate students’ context-generating cognitive processes, during case study. Two groups of students used a web-based learning environment to criss-cross and study case-based material in the software project management domain. The experimental group was additionally prompted to consistently answer a set of questions based on a model of context-generating processes, meant to engage students in deeper processing of information presented in cases. Students were also classified as having either “complex” or “simple” EB profile (based on their epistemological beliefs record), thereby establishing a 2 × 2 factorial design. Results indicated that scaffolding treatment had a significant main effect on students’ performance, with the …", "num_citations": "171\n", "authors": ["892"]}
{"title": "Software engineering research for computer games: A systematic review\n", "abstract": " ContextCurrently, computer game development is one of the fastest growing industries in the worldwide economy. In addition to that, computer games are rapidly evolving in the sense that newer game versions arrive in a very short interval. Thus, software engineering techniques are needed for game development in order to achieve greater flexibility and maintainability, less cost and effort, better design, etc. In addition, games present several characteristics that differentiate their development from classical software development.ObjectiveThis study aims to assess the state of the art on research concerning software engineering for computer games and discuss possible important areas for future research.MethodWe employed a standard methodology for systematic literature reviews using four well known digital libraries.ResultsSoftware engineering for computer games is a research domain that has doubled its …", "num_citations": "137\n", "authors": ["892"]}
{"title": "Research state of the art on GoF design patterns: A mapping study\n", "abstract": " Design patterns are used in software development to provide reusable and documented solutions to common design problems. Although many studies have explored various aspects of design patterns, no research summarizing the state of research related to design patterns existed up to now. This paper presents the results of a mapping study of about 120 primary studies, to provide an overview of the research efforts on Gang of Four (GoF) design patterns. The research questions of this study deal with (a) if design pattern research can be further categorized in research subtopics, (b) which of the above subtopics are the most active ones and (c) what is the reported effect of GoF patterns on software quality attributes. The results suggest that design pattern research can be further categorized to research on GoF patterns formalization, detection and application and on the effect of GoF patterns on software quality …", "num_citations": "95\n", "authors": ["892"]}
{"title": "Quality, productivity, and learning in framework-based development: an exploratory case study\n", "abstract": " This paper presents an empirical study in an industrial context on the production of software using a framework. Frameworks are semicomplete applications, usually implemented as a hierarchy of classes. The framework is developed first, then several applications are derived from it. Frameworks are a reuse technique that supports the engineering of product lines. In the study, we compare quality (in the sense of rework effort) and productivity in traditional and framework-based software production. We observe that the latter is characterized by better productivity and quality, as well as a massive increase in productivity over time, that we attribute to the effect of learning the framework. Although we cannot extrapolate the results outside the local environment, enough evidence has been accumulated to stimulate future research work.", "num_citations": "81\n", "authors": ["892"]}
{"title": "Evaluating children performance with graphical and tangible robot programming tools\n", "abstract": " This paper presents a cross-age study exploring children’s performance on robot introductory programming activities with one tangible and one isomorphic graphical system. Both subsystems are parts of an innovative system, namely the PROTEAS kit. The tangible subsystem consists of cube-shaped blocks that represent simple and more advanced programming structures. Users may interconnect the cubic-shaped commands and so create the robot programming code. The graphical subsystem presents onscreen an isomorphic to the tangible programming space. Children (N = 109) of five different aged groups were let to interact in pairs with the two operationally equivalent programming subsystems with the scope to program a NXT Lego robot. Three variables associated with children performance upon tasks and four variables related with performance during free interaction were studied. Data analysis …", "num_citations": "75\n", "authors": ["892"]}
{"title": "A methodology to assess the impact of design patterns on software quality\n", "abstract": " ContextSoftware quality is considered to be one of the most important concerns of software production teams. Additionally, design patterns are documented solutions to common design problems that are expected to enhance software quality. Until now, the results on the effect of design patterns on software quality are controversial.AimsThis study aims to propose a methodology for comparing design patterns to alternative designs with an analytical method. Additionally, the study illustrates the methodology by comparing three design patterns with two alternative solutions, with respect to several quality attributes.MethodThe paper introduces a theoretical/analytical methodology to compare sets of “canonical” solutions to design problems. The study is theoretical in the sense that the solutions are disconnected from real systems, even though they stem from concrete problems. The study is analytical in the sense that …", "num_citations": "75\n", "authors": ["892"]}
{"title": "Agile software development quality assurance\n", "abstract": " Agile methods are a collection of different techniques and practices that share the same values and basic principles. Agile Software Development Quality Assurance provides in-depth coverage of the most important concepts, issues, trends, and technologies in agile software. This Premier Reference Source presents the research and instruction used to develop and implement software quickly, in small iteration cycles, and in close cooperation with the customer in an adaptive way. It is a comprehensive guide that helps researchers and practitioners in the agile software development process avoid risks and project failures that are frequently encountered in traditional software projects.", "num_citations": "75\n", "authors": ["892"]}
{"title": "ESSE: an expert system for software evaluation\n", "abstract": " Solving software evaluation problems is a particularly difficult software engineering process and many different—often contradictory—criteria must be considered in order to reach a decision. This paper presents ESSE, a prototype expert system for software evaluation that embodies various aspects of the Multiple-Criteria Decision Aid (MCDA) methodology. Its main features are the flexibility in problem modeling and the built-in knowledge about software problem solving and software attribute assessment. Evaluation problems are modeled around top-level software attributes, such as quality and cost. Expert assistants guide the evaluator in feeding values to the decision model. ESSE covers all important dimensions of software evaluation through the integration of different technologies.", "num_citations": "72\n", "authors": ["892"]}
{"title": "Empirical studies on quality in agile practices: A systematic literature review\n", "abstract": " Nowadays one key question for most organizations is which of the agile practices should be implemented to improve product quality. This systematic literature review surveys studies published up to and including 2009 and attempts to present and evaluate the empirical findings regarding quality in agile practices. The studies were classified into three groups: test driven or test first development, pair programming, and miscellaneous agile practices and methods. The findings of most studies suggest that agile practices can improve quality if they are implemented correctly. The significant findings of this study, in conjunction with previous research, could be used as guidelines for practitioners on their own settings and situations.", "num_citations": "67\n", "authors": ["892"]}
{"title": "Knowledge based evaluation of software systems: a case study\n", "abstract": " Solving software evaluation problems is a particularly difficult software engineering process and many contradictory criteria must be considered to reach a decision. Nowadays, the way that decision support techniques are applied suffers from a number of severe problems, such as naive interpretation of sophisticated methods and generation of counter-intuitive, and therefore most probably erroneous, results. In this paper we identify some common flaws in decision support for software evaluations. Subsequently, we discuss an integrated solution through which significant improvement may be achieved, based on the Multiple Criteria Decision Aid methodology and the exploitation of packaged software evaluation expertise in the form of an intelligent system. Both common mistakes and the way they are overcome are explained through a real world example.", "num_citations": "64\n", "authors": ["892"]}
{"title": "Software project management anti-patterns\n", "abstract": " This paper explores the area of bad practices, namely anti-patterns, and their consequences in software project management (SPM). The paper surveys the multitude of anti-patterns that have been reported and documented up to now and stresses the need for tools to formally represent SPM anti-patterns, proposing specific formalisms for such purpose, namely Bayesian Belief Networks, Ontologies and Social Networks. It is also explained how the Web can provide an opportunity for capturing, storing, disseminating and ultimately avoiding SPM anti-patterns. As a consequence, anti-patterns may provide an excellent tool for educating active and future software managers. Finally, conclusions and future research trends are given.", "num_citations": "60\n", "authors": ["892"]}
{"title": "Software evaluation problem situations\n", "abstract": " Evaluating software is a complex decision aiding activity which requires the recognition of the problem situation in which the evaluation is requested, the establishment of a set of problem formulations which represent the client’s “problems” and, for a specific problem formulation, the construction of an evaluation model which indicates how such an evaluation will be performed.In this paper the first two aspects of such a process are discussed, providing a partial list of software evaluation problem situations, how they are characterised and what problem formulations they allow. Moreover two real case studies, concerning software evaluation, are briefly presented and discussed under this point of view (how the problem is perceived and formulated).", "num_citations": "57\n", "authors": ["892"]}
{"title": "The value of writing-to-learn when using question prompts to support web-based learning in ill-structured domains\n", "abstract": " This study investigates the effectiveness of two variants of a prompting strategy that guides students to focus on important issues when learning in an ill-structured domain. Students in three groups studied individually Software Project Management (SPM) cases for a week, using a web-based learning environment designed especially for this purpose. The first group (control) studied the cases without any prompting. The second group (“writing mode”) studied the same cases, while prompted to provide written answers to a set of knowledge integration prompts meant to engage students in deeper processing of the material. The third group (“thinking mode”) studied the cases, while prompted only to think of possible answers to the same question prompts. Results indicated that students in the writing condition group outperformed the others in both domain knowledge acquisition and knowledge transfer post-test …", "num_citations": "53\n", "authors": ["892"]}
{"title": "Measuring functionality and productivity in Web-based applications: A case study\n", "abstract": " We explore the variation of the cost of writing code when object oriented framework based development of Web applications is encountered for the first time. Managers need such information to justify their investments in innovative development strategies. Size measurements are essential in this task and a number of metrics, namely: lines of code, classical function points, and object oriented function points, are employed. It is argued that lines of code and object oriented function points are more suitable in this case. Data analysis reveals that learning influences mainly the cost of writing new code, consisting of continuous calls to components provided by the framework. We also explore the applicability of an already proposed effort prediction model that is based on different reuse types. A cost estimation model is the by-product of this study, providing a helpful tool for managing the first projects in which the framework …", "num_citations": "53\n", "authors": ["892"]}
{"title": "Building and mining a repository of design pattern instances: Practical and research benefits\n", "abstract": " Design patterns are well-known design solutions that are reported to produce substantial benefits with respect to software quality. However, to our knowledge there are no scientific efforts on gathering information on software projects that use design patterns. This paper introduces a web repository of design patterns instances that have been used in open source projects. The usefulness of such a repository lies in the provision of a base of knowledge, where developers can identify reusable components and researchers can find a mined data set. Currently, 141 open source projects have been considered and more than 4500 pattern instances have been found and recorded in the database of the repository. The evaluation of the repository has been performed from an academic and a practical point of view. The results suggest that the repository can be useful for both experienced and inexperienced users. However …", "num_citations": "46\n", "authors": ["892"]}
{"title": "SPARSE: A symptom-based antipattern retrieval knowledge-based system using Semantic Web technologies\n", "abstract": " Antipatterns provide information on commonly occurring solutions to problems that generate negative consequences. The number of software project management antipatterns that appears in the literature and the Web increases to the extent that makes using antipatterns problematic. Furthermore, antipatterns are usually inter-related and rarely appear in isolation. As a result, detecting which antipatterns exist in a software project is a challenging task which requires expert knowledge. This paper proposes SPARSE, an OWL ontology based knowledge-based system that aims to assist software project managers in the antipattern detection process. The antipattern ontology documents antipatterns and how they are related with other antipatterns through their causes, symptoms and consequences. The semantic relationships that derive from the antipattern definitions are determined using the Pellet DL reasoner and …", "num_citations": "35\n", "authors": ["892"]}
{"title": "Involving software engineering students in open source software projects: Experiences from a pilot study\n", "abstract": " Anecdotal and research evidences show that the Free and Open Source Software (F/OSS) development model has produced a paradigm shift in the way we develop, support, and distribute software. This shift is not only redefining the software industry but also the way we teach and learn in our software engineering (SE) courses. But for many universities F/OSS is seen as an optional low cost technology to support the IT infrastructure and administrational duties. Few see F/OSS as an opportunity for students to learn the SE concepts and skills we teach. Furthermore, it is still an open question as to whether the F/OSS methodology can be effectively used to teach SE courses within the formally structured curriculwn in most universities. This paper discusses F/OSS projects as bazaars of learning that offer a meaningful learning context. The discussion is centered on a pilot study in which students were involved in software testing in F/OSS projects. We present the teaching and learning framework we used in the pilot study and report on our experiences, lessons learned, and some practical problems we encountered. Our grading and evaluation approach show that the students did relatively well as bug hunters and reporters. Results from two online surveys indicate that students are motivated in participating in software testing in the bazaar, and they are willing to participate in project activities long after their graduation. The study reveals one possible way SE educators can teach and integrate F/OSS into their formal curricular structure.", "num_citations": "34\n", "authors": ["892"]}
{"title": "Prompting students’ context-generating cognitive activity in ill-structured domains: does the prompting mode affect learning?\n", "abstract": " This study was designed to investigate the impact of question prompts that guide students to focus on context-related issues when learning through cases in an ill-structured domain. Three groups of undergraduate students studied cases during a lab-session time period using a web-based environment. The first group studied without any question prompts. The second group studied the same material while prompted to provide written answers to embedded questions in the cases. The third group studied while having only to think of possible answers for the question prompts. In this study, we explored how the questioning intervention affected students’ conceptual knowledge of the domain and their problem-solving ability. Post-tests did not reveal significant statistical differences in the groups’ performance, indicating that under specific study conditions the prompting impact is not traceable in the learning …", "num_citations": "29\n", "authors": ["892"]}
{"title": "A framework for teaching software testing using F/OSS methodology\n", "abstract": " In this paper we discuss a framework for teaching software testing to undergraduate students’ volunteers. The framework uses open source software development methodology and was implemented in the “Introduction to Software Engineering” course at the department of Informatics, Aristotle University, Greece. The framework is in three phases, each describing a teaching and learning context in which students get involved in real software projects activities. We report on our teaching experiences, lessons learned and some practical problems we encountered. Results from preliminary evaluation shows that students did well as bug hunters in the bazaar and are willing to participate in their projects long after graduation.", "num_citations": "27\n", "authors": ["892"]}
{"title": "Teaching software engineering with free/libre open source projects\n", "abstract": " One of the major problems in software engineering education is the involvement of students in real world software projects. Industry projects are a solution, but in many cases they are hard to find and student participation can be problematic due to cultural, familiarization and other practical reasons. The abundance of Free/Libre Open Source Software (FLOSS) projects is a neat solution, offering multi-lingual, multicultural environments in virtually every application domain, at different levels of project size, maturity, organization etc. The paper analyzes how acquisition of practical experience on several basic and advanced software engineering topics can be achieved by working in a FLOSS project. The kind of skills that can be acquired are those requested by the Overview Report for Computing Curricula by ACM and topics examined are those of the Software Engineering Body of Knowledge, by IEEE. Also software …", "num_citations": "26\n", "authors": ["892"]}
{"title": "Critical success factors and barriers for lightweight software process improvement in agile development: A literature review\n", "abstract": " The majority of software development companies are significantly benefitted by adopting software process improvement (SPI). This has been extensively addressed both in terms of research and established standards. In particular, the need for SPI in the context of Small and Medium-sized Enterprises (SMEs) led a lot of researchers to focus on this area. SMEs struggle daily to survive in a very competitive environment and their distinguishing characteristics such as the small number of employees, the flat and small organizational structure and the flexibility that governs them make it hard for them to adopt and implement SPI. On the same spirit, their distinguishing characteristics are also those that make SMEs an ideal environment for the adoption of agile methodologies. The agility that governs SMEs allows flexibility in every process they apply and, thus, promotes lightweight SPI approaches in order to remain on the …", "num_citations": "25\n", "authors": ["892"]}
{"title": "Product line variability with elastic components and test-driven development\n", "abstract": " In this work we present a systematic approach for the creation of new variant software components via customization of existing core assets of a software product line. We consider both functional and quality variants and address the issue of a controlled creation of variants which considers the reference architecture and its co-evolution with a number of other artifacts including components and functional and quality test suites. Furthermore we discuss the relationship between the popular agile practice of test-driven development (TDD) and how it can be used to assist the evolution of software components of a software product line.", "num_citations": "25\n", "authors": ["892"]}
{"title": "Data collection and analysis of GitHub repositories and users\n", "abstract": " In this paper, we present the collection and mining of GitHub data, aiming to understand GitHub user behavior and project success factors. We collected information about approximately 100K projects and 10K GitHub users//owners of these projects, via GitHub API. Subsequently, we statistically analyzed such data, discretized values of features via k-means algorithm, and finally we applied apriori algorithm via weka in order to find out association rules. Having assumed that project success could be measured by the cardinality of downloads we kept only the rules which had as right par a download cardinality higher than a threshold of 1000 downloads. The results provide intersting insight in the GitHub ecosystem and seven success rules for GitHub projects.", "num_citations": "24\n", "authors": ["892"]}
{"title": "Enhancing software engineering education through open source projects: Four years of students’ perspectives\n", "abstract": " This paper presents the results after four years of running of an instructional method that utilizes free/libre open source software (FLOSS) projects as tools for teaching software engineering in formal education. In the last four academic years, a total of 408 juniors majoring in Informatics (in a 4-year program) participated in the study, assuming the roles of requirements engineers, testers, developers, and designers/analysts. Students appreciated the benefits gained by the method and identified aspects that require further improvement. In the paper, we present (a) the details of our method, (b) students’ opinions as recorded through a questionnaire including both closed and open ended questions, and (c) conclusions on how the use of FLOSS projects can be applied, and be beneficial for the students.", "num_citations": "24\n", "authors": ["892"]}
{"title": "A new method to evaluate software artifacts against predefined profiles\n", "abstract": " Software artifacts are characterised by many attributes, each one in its turn can be measured by one or more measures. In several cases the software artifact has to be evaluated as a whole, thus raising the problem of aggregating measures to give an overall, single view on the artifact. This paper presents a method to aggregate measures, that works comparing the artifact with predefined, ideal artifacts, or profiles. Profiles are defined starting fromranges of values on measures of attributes. The method is based on two main phases, namely definition of the evaluation model and application of the evaluation model, and is presented in a simplified case study that deals with evaluating the level of quality of an asset to decide if accepting it in a reuse repository. The advantages of the method are that it allows using ordinal scales, while it deals explicitly with preferences expressed, implicitly or explicitly, by the evaluator.", "num_citations": "22\n", "authors": ["892"]}
{"title": "Quality and effectiveness of enterprise resource planning-customer relationship management systems: Implications for information systems marketing strategies\n", "abstract": " The present research examines the success of Enterprise Resource Planning (ERP) systems in Greece, employing Delone and McLean’s model. The questionnaires of the study were e-mailed to the 1,049 largest organizations based on turnover and assets. The final research sample consists of 105 Greek enterprises. The list of organizations was compiled by using the Index of Companies and Products Directory (ICAP). Results show that users have more positive attitude towards system quality and information quality and less positive attitude towards service quality. Moreover, users believe that ERP systems enhance their performance and can contribute to the control of management. Furthermore, present paper proved that D&M model constitutes a causal model with the exception of the variable of system use that is only related to user satisfaction, and ERP system quality. The findings of this research trigger many theoretical and managerial implications and create lots of potential for future research in the fields of Information Systems, Management, and Marketing.", "num_citations": "18\n", "authors": ["892"]}
{"title": "Global optimization of analogy-based software cost estimation with genetic algorithms\n", "abstract": " Estimation by Analogy is a popular method in the field of software cost estimation. A number of research approaches focus on optimizing the parameters of the method. This paper proposes an optimal global setup for determining empirically the best method parameter configuration based on genetic algorithms. We describe how such search can be performed, and in particular how spaces whose dimensions are of different type can be explored. We report results on two datasets and compare with approaches that explore partially the search space. Results provide evidence that our method produces similar or better accuracy figures with respect to other approaches.", "num_citations": "16\n", "authors": ["892"]}
{"title": "Towards a dynamic ontology based software project management antipattern intelligent system\n", "abstract": " The Software Project Management Antipattern Intelligent System (PROMAISE) is proposed as a Web-enabled knowledge-base framework that uses antipattern OWL ontologies in order to provide intelligent and up to date advice to software project managers regarding the selection of appropriate antipatterns in a software project. Antipatterns provide information on commonly occurring solutions to problems that generate negative consequences. These mechanisms are documented using informal paper based structures that do not readily support knowledge sharing and reuse. Antipattern OWL ontologies can be used to build a dynamic antipattern knowledge base, which can update itself automatically. This will allow the accessibility and transferability of up-to-date computer-mediated software project management knowledge to software project managers by encoding antipatterns into computer understandable …", "num_citations": "16\n", "authors": ["892"]}
{"title": "Using Ontologies to Represent Software Project Management Antipatterns.\n", "abstract": " In spite of numerous knowledge sharing and reuse mechanisms, the provision of intelligent advice to software project managers still remains an open issue. Antipatterns provide information on commonly occurring solutions to problems that generate negative consequences. These mechanisms are documented using informal structures that do not readily support knowledge sharing and reuse. For this, we need better-structured representations. The formalism of Bayesian Networks (BN’s) has been proposed to capture and model software project management antipattern uncertainty manually or automatically, through an antipattern knowledge base. The antipattern ontology proposed in this paper, specifies the conceptual structure of the antipattern knowledge base, encodes tacit software project management knowledge into computer understandable form and will allow the sharing and reuse of this knowledge by software tools. Furthermore, the issue of capturing and quantifying uncertainty in the antipattern ontology is addressed by including the concepts of antipattern BN models and their corresponding OWL ontology in the design of the generic antipattern ontology.", "num_citations": "16\n", "authors": ["892"]}
{"title": "A constructivist view of knowledge management in open source virtual communities\n", "abstract": " This chapter addresses a learning environment that is manifested in the domain offree/open source software development. It provides the base for the emergence, development, interactions, and management of a novel learning environment bytaking a constructivist view of knowledge management. The learning activities ofan online collaborative effort of a loosely and geographically disperse communityof individuals is explored by looking at the interactions between members of thecommunity, the tools used to communicate, and the interactions between the mem-bers of the community and the virtual learning context. The learning context asenvisaged here refers to the free/open source software development environment inwhich learning actually takes place. The main focus is on the resources and pur-poseful activities that promote collaborative learning in this context, as well as thetransfer of learning from the …", "num_citations": "16\n", "authors": ["892"]}
{"title": "Who is producing more technical debt? A personalized assessment of TD principal\n", "abstract": " Technical debt (TD) impedes software projects by reducing the velocity of development teams during software evolution. Although TD is usually assessed on either the entire system or on individual software artifacts, it is the actual craftsmanship of developers that causes the accumulation of TD. In the light of extremely high maintenance costs, efficient software project management cannot occur without recognizing the relation between developer characteristics and the tendency to evoke violations that lead to TD. In this paper, we investigate three research questions related to the distribution of TD among the developers of a software project, the types of violations caused by each developer and the relation between developers' maturity and the tendency to accumulate TD. The study has been performed on four widely employed PHP open-source projects. All developers' personal characteristics have been …", "num_citations": "15\n", "authors": ["892"]}
{"title": "Analyzing the role of students' self-organization in a case of scripted collaboration\n", "abstract": " This work analyzes a case of computer-supported scripted collaboration, focusing on how students' self-organization affected the actual collaboration script during script run- time. Two groups of students studied learning material using a web environment designed for supporting case-based learning. The first group followed a non-scaffolded individual mode of study while students in the second group were guided by a collaboration script to work (in dyads) on the case material. Statistical analysis indicated no significant differences in the learning outcomes of the two groups. Qualitative analysis (based on students' interviews and field observations) revealed that students' self-organization resulted to a broad range of actual script implementation ranging from full conformance to partial violation of the script guidelines. The paper discusses the socio-cognitive role of students' self-organization during scripted collaboration and presents suggestions for the teacher and CSCL designer in order to enhance the engagement of collaborating students to productive learning interactions.", "num_citations": "15\n", "authors": ["892"]}
{"title": "Reflection on knowledge sharing in F/OSS projects\n", "abstract": " Knowledge sharing between software project participants simplifies a range of decision-making processes and helps improve the way software is being developed, distributed, and supported. However, research in this area has traditionally been very difficult because the source of knowledge, the code, has been a guarded secret and software developers and users inhabit different worlds. F/OSS projects have changed the way we perceive and understand knowledge sharing in distributed software development. This short paper presents our current understanding, and what needs to be done in terms of empirical research in knowledge sharing in F/OSS projects.", "num_citations": "15\n", "authors": ["892"]}
{"title": "Software product and process assessment through profile-based evaluation\n", "abstract": " Software entities (software products or processes) are characterized by many  attributes, each one in its turn can be measured by one or more measures. In  several cases the software entities have to be evaluated as a whole, thus  raising the problem of aggregating measures to give an overall, single view  on the software entity. This paper presents a method to aggregate measures,  which works by comparing the product/process with predefined, ideal entities,  or profiles. Profiles are defined starting from ranges of values on measures  of attributes. The method is based on two main phases, namely definition of  the evaluation model and application of the evaluation model. It is  presented through a simplified case study that deals with evaluating the  level of quality of an asset to decide whether to accept it in a reuse  repository. A plausible way of how the method could be applied to process  maturity assessment is …", "num_citations": "14\n", "authors": ["892"]}
{"title": "A methodology on extracting reusable software candidate components from open source games\n", "abstract": " Component-Based Software Engineering (CBSE) focuses on the development of reusable components in order to enable their reuse in more systems, rather than only to be used to the original ones for which they have been implemented in the first place (ie development for reuse) and the development of new systems with reusable components (ie development with reuse). This paper aims at introducing a methodology for the extraction of candidate reusable software components from open source games. The extracted components have been empirically evaluated through a case study. Additionally, the component candidates that have been extracted are available for reuse through a web service.", "num_citations": "13\n", "authors": ["892"]}
{"title": "Non-functional requirements that influence gaming experience: A survey on gamers satisfaction factors\n", "abstract": " Requirements engineering is an extremely crucial phase in the software development lifecycle, because mishaps in this stage are usually expensive to fix in later development phases. In the domain of computer games, requirements engineering is a heavily studied research field (39.3% of published papers are dealing with requirements [1]), since it is considered substantially different from traditional software requirements engineering (see [1] and [14]). The main point of differentiation is that almost all computer games share a common key-driver as requirement, ie user satisfaction. In this paper, we investigate the most important user satisfaction factors from computer games, though a survey on regular gamers. The results of the study suggest that, user satisfaction factors are not uniform across different types of games (game genres), but are heavily dependent on them. Therefore, this study underlines the most …", "num_citations": "12\n", "authors": ["892"]}
{"title": "Design Pattern Alternatives: What to do when a GoF pattern fails\n", "abstract": " Design patterns have been introduced in the field of software engineering in the middle of 90s as common solutions to common design problems. Until now, the effect of design patterns on software quality attributes has been studied by many researchers. However, the results are not the expected ones, in the sense that several studies suggest that there are cases when a design pattern is not the optimum way of designing a system. In this paper, we present the findings of a systematic literature review that aims at cataloging published design solutions, referenced as alternative design solutions, which are equivalent to design patterns and can be used when a design pattern instance is not the optimum design solution for a specific design problem.", "num_citations": "12\n", "authors": ["892"]}
{"title": "Tangible user interfaces for programming and education: A new field for innovation and entrepreneurship\n", "abstract": " It is well known that education is one of the most thriving industries worldwide. A great number of companies deal with education related business areas, either delivering educational services or selling educational tools, be it hardware or software. Within this area, Tangible User Interfaces (TUIs) have a prominent position for two major reasons:(a) their ability to incorporate novel technologies and (b) their ability to provide intuitive computer interfaces for youngsters. In particular infants and children of nursery school age are more used to tangible objects than to software elements. A consequence of the above is that innovation in the TUI arena produces interesting prototypes that very often evolve into commercial products. Therefore, an analysis of TUI innovation ideas and their implementations, combined with attempts to use them in commercial activities related to children fun and education, will show how modern …", "num_citations": "11\n", "authors": ["892"]}
{"title": "Transforming the supply-chain management and industry logistics with blockchain smart contracts\n", "abstract": " Blockchain technology back in 2009 was mainly used for finance use cases due to the cryptocurrency support of the Bitcoin and the Ethereum networks. Nowadays with the emergence of business oriented distributed ledger frameworks we can find blockchain (BC) in almost every aspect of our everyday real-life transactions. Starting with supply chain, BC has been used to support and secure education, e-government, real estate, insurance, healthcare and other business cases. Regarding blockchain in supply chain, examples as the Walmart and IBM partnership shows that smart contracts (SC) and cryptocurrencies can disrupt the way suppliers, shippers, retailers and customers trust each other and interact. This paper describes how we applied BC technology in two real-life supply chain scenarios. The first one is for logging and tracing products, showing how we can use SCs to identify the ingredients of food …", "num_citations": "10\n", "authors": ["892"]}
{"title": "Process mining applied on library information systems: A case study\n", "abstract": " Process mining techniques have already been studied in a wide range of sectors, revealing useful information on the processes. In this study, a five-step methodology is applied to an integrated library system (ILS) for the first time. Given two event logs from two different organizations the ILS, a process mining tool is used for process discovery and data analysis. The findings reveal that although both of the organizations were using the same system, there were differences in the activities, sequences, and approaches followed by each one in daily tasks. The results of this kind of analysis can be used to highlight best practices and improve processes. In addition process model comparisons can then be made across various systems and organizations.", "num_citations": "10\n", "authors": ["892"]}
{"title": "Students' perspectives on learning software engineering with open source projects: lessons learnt after three years of program operation\n", "abstract": " This paper presents the results after three years of running of an instructional method that utilizes free/libre open source software (FLOSS) projects as tools for teaching software engineering in formal education. In the last three academic years, a total of 268 juniors majoring in Informatics (in a 4-year program) participated in study, assuming the roles of testers, developers, and requirements engineers. Students appreciated the benefits gained by the method and identified aspects that require further improvement. In the following, we present (a) the details of our method,(b) students' opinions as recorded through a questionnaire including both closed and open ended questions, and (c) conclusions on how the use of FLOSS projects can be applied and proved beneficial for the students.", "num_citations": "10\n", "authors": ["892"]}
{"title": "Teaching software project management through management antipatterns\n", "abstract": " Technological development and social progress are bound to affect fundamentally the business environments and therefore the people who work in them. The new conditions create unexpected difficulties and expectations that often limit the performance of the employees and consequently of the software projects, which often fail to meet their goals. The integrated education of future administrators - managers becomes a dynamic challenge to the new environments, which can be achieved by proposing new concepts such as Management Antipatterns. In this work, important conclusions and suggestions are made about the importance of effective and innovative education of future managers and their IT projects.", "num_citations": "10\n", "authors": ["892"]}
{"title": "Component Certification as a Prerequisite forWidespread OSS Reuse\n", "abstract": " Open source software is the product of a community process that in a single project may employ different development techniques and volunteers with diverse skills, interests and hardware. Reuse of OSS software in systems that will have to guarantee certain product properties is still complicated. The main reason is the many different levels of trust that can be placed on the various OSS sources and the lack of information for the impact that a reused OSS component can have on the system properties. A prerequisite for promoting widespread reuse of OSS software is certification at the component level in an affordable cost. This work addresses the main technical issues behind OSS component certification by formal and semiformal techniques, as well as the incentives that raised the need for the OPEN-SME European funded project. OPEN-SME introduces an OSS software reuse service for SMEs, in order to address the problem that OSS evolves by volunteers that follow different development processes. We discuss the requirements relating to OSS software reuse based on the findings of a survey. Then we present the OPEN-SME tool-set and approach for OSS reuse and finally we show how the provision of verifiable certificates can provide assurance that an OSS component conforms to one or more anticipated requirements, necessary for reusing it in a system.", "num_citations": "10\n", "authors": ["892"]}
{"title": "Online case-based learning: Design and preliminary evaluation of the eCASE environment\n", "abstract": " Case-based learning is expected to enhance students' awareness of the various contextual factors, which affect problem solving in ill structured domains. An interesting question is always how to engage students in efficient processing of the case-based learning material. In this paper, we present the design and preliminary evaluation results of the eCASE environment, a generic Web-based environment for supporting case-based instruction. eCASE allows instructors to develop appropriate study paths for students to criss-cross the case-based information landscape. Furthermore, it supports students' study by providing scripts, which scaffold them when processing the learning material. A script in eCASE models the cognitive processes related to context awareness and guides students to focus on important events, recall relative cases and reach useful conclusions. First evaluation results indicate that students …", "num_citations": "10\n", "authors": ["892"]}
{"title": "A comparative study on the effectiveness of patterns in software libraries and standalone applications\n", "abstract": " The existence of design pattern instances is often regarded as an indication of elaborate software design, since patterns have been reported in many studies as techniques that improve software quality properties. Driven by the widespread belief that software libraries excel in terms of design quality compared to standalone applications, this study investigates first whether this claim is confirmed and second whether the improved quality can be attributed to the use of patterns. In particular we examine: (a) whether libraries exhibit improved design quality in terms of metrics compared to standalone applications, (b) the intensity of use of design patterns in the two software categories and (c) whether there is any correlation of design patterns usage and design quality at system level. The results of the study suggest that, some of the quality properties are improved in library software although no significant difference in the …", "num_citations": "9\n", "authors": ["892"]}
{"title": "Detecting antipatterns using a Web-based collaborative antipattern ontology knowledge base\n", "abstract": " The enrichment of the antipattern ontology that acts as the lexicon of terms to communicate antipatterns between people and software tools, is a labor intensive task. Existing work has implemented SPARSE, an ontology based intelligent system that uses a symptom based approach in order to semantically detect and retrieve inter-related antipatterns that exist in a software project. In this paper, we propose a Web-based environment that uses the Protege platform, in order to allow collaborative ontology editing as well as annotation and voting of both ontology components and ontology changes. This technology allows multiple users to edit and enrich the antipattern ontology simultaneously. Preliminary results on SPARSE show the effectiveness of the antipattern detection process during the research and development of a software project.", "num_citations": "9\n", "authors": ["892"]}
{"title": "Case-based instruction on the web for teaching software project management\n", "abstract": " Software project management (SPM) is an ill-structured domain, where past experiences of project management can become valuable learning resources for novices. To support instruction in the domain, we have developed the eCASE-SPM Web environment, for engaging students in case-based instruction and help them develop SPM related problem solving skills. This work presents major design issues of the environment and initial research results regarding (a) a student-based evaluation, connecting also students' attitudes to their learning styles, and (b) the learning effectiveness of the environment, investigating the use of embedded question prompts as students' cognitive scaffolds. Results so far reveal interesting interactions between students' learning styles and their attitudes towards learning in the eCASE-SPM environment. Furthermore, there is strong indication that using question prompts may have …", "num_citations": "9\n", "authors": ["892"]}
{"title": "Investigating the use of object-oriented design patterns in open-source software: A case study\n", "abstract": " During the last decade open source software communities are thriving. Nowadays, several open source projects are so popular that are considered as a standard in their domain. Additionally, the amount of source code that is freely available to developers, offer great reuse opportunities. One of the main concerns of the reuser is the quality of the code that is being reused. Design patterns are well known solutions that are expected to enhance software quality. In this paper we investigate the extent to which object-oriented design patterns are used in open-source software, across domains.", "num_citations": "8\n", "authors": ["892"]}
{"title": "Elastic components: Addressing variance of quality properties in components\n", "abstract": " The quality properties of a software component, although verified by the component developer and even certified by a trusted third-party, might very well be inappropriate for the requirements of a new system. This is what we call the quality mismatch problem: the mismatch between the quality requirements of a new system with the quality properties exhibited by the components that we want to use for its development. This work contributes to the understanding of the quality mismatch problem between component properties and component-based systems requirements. To solve this problem we introduce the concept of elastic components. An elastic component is an open-ended hierarchy of the same pure component with variants that differ between them to the quality properties that they exhibit. We present a quality-driven design approach that can be effectively applied for the design and implementation of elastic …", "num_citations": "8\n", "authors": ["892"]}
{"title": "Detecting associative shift faults in predicate testing\n", "abstract": " Fault-based predicate testing is a promising strategy for generating effective software test data. The test target is faults that may appear in predicates found in the specification or implementation of a computer program. A hierarchy of fault classes has been recently established, identifying associative shift faults (ASFs) as one of the strongest fault classes in predicate testing. The upto date proposed approaches resolve adequately the issue of test generation for weaker fault classes but do not guarantee the detection of all ASFs. In this paper we define a suitable fault model to represent this type of faults and propose a heuristic test strategy, while trying to keep low the number of required tests by fault simulation. Empirical results of the algorithm application on the TCAS-II expression suite are encouraging and suggest that it is easy to detect a significant subset of ASFs by considering only few additional tests.", "num_citations": "8\n", "authors": ["892"]}
{"title": "An adaptable framework for educational software evaluation\n", "abstract": " This paper proposes a framework for educational software evaluation based on the Multiple Criteria Decision Aid methodology. Evaluating educational software products is a twofold process: both the educational and the technical aspect of the evaluated products have to be considered. As far as the product educational effectiveness is concerned, we propose a set of attributes covering both the general educational features and the content of the product. From the technical point of view, a software attribute set based on the ISO/IEC 9126 standard has been chosen together with the accompanying measurement guidelines. Finally, an evaluation example involving three commercial educational software packages for mechanics is presented.", "num_citations": "8\n", "authors": ["892"]}
{"title": "Securing emission data of smart vehicles with blockchain and self-sovereign identities\n", "abstract": " Modern Internet of Things (IoT) networks including vehicle networks face an increased demand for security and access control with respect to privacy for sensitive data. Data manipulation and tampering of emissions values due to the economic incentives and environmental and health issues require a tamper-proof solution with the use of blockchain (BC) where the integrity of data is ensured. In this paper, we propose the integration of a public permissioned Self-Sovereign Identities (SSI) framework with a permissioned consortium BC based architecture. This innovatively supports the decentralization of the authentication and authorization processes to overcome the single point of failure problems and the use of SSI to assign identities to IoT devices. Additionally, it gives full control to the holders for their identities, whether they are humans, organizations or smart vehicles. With the practice of advanced zero …", "num_citations": "7\n", "authors": ["892"]}
{"title": "Management and coordination of free/open source projects\n", "abstract": " Developing software in the free/open source software (F/OSS) way is fundamentally different from the conventional, closed, team-based, single-owner software project. As a consequence, managing a F/OSS project is done in a quite different way, emphasizing on people and community coordination and organization. Management organization may take extremely distant forms: absolute monarchies, oligarchies, or open source democracies, with community members voting to decide project evolution. On the other hand, not all F/OSS projects are based on pure voluntarism. Many such projects are sponsored by firms and are managed in their own way. In addition, certain extreme project transformations, such as forking, occur frequently in F/OSS. Human resource management (e.g., team building) and decision making (e.g., project cancellation) are also done in a completely different way. This chapter focuses …", "num_citations": "7\n", "authors": ["892"]}
{"title": "Features for suitable problems: IT professionals’ and IT students’ opinions\n", "abstract": " One cannot be a problem solver without deep understanding of what constitutes a problem. Failing to recognise and define problems presents obstacles in constructing and applying knowledge in problem solving. This has been the motivation for the authors to re-examine in the context of IT (Information Technology) the concept, nature and types of a problem. The most and least important features of a problem are scrutinized, considering the problem-based learning experts’ opinions and a collection of IT students’ viewpoints. The authors (i) identify and critically comment on the features of a problem that are still needed in problem-based learning, and (ii) provide insights and guidelines on the position and use of problems for IT curriculum designers and IT professionals in problem-focused higher education.", "num_citations": "7\n", "authors": ["892"]}
{"title": "The impact of prompting in technology-enhanced learning as moderated by students’ motivation and metacognitive skills\n", "abstract": " This work explores the role of students’ motivation and metacognitive skills as moderating factors that influence the impact of an instructional method in the ill-structured domain of Software Project Management (SPM). In order to teach aspects of the SPM domain, we developed a web environment for case-based learning and implemented additionally a questioning strategy to help students focus on important parts of the case material. The paper presents the results from three studies revealing how students’ motivation and metacognitive awareness influenced their engagement in the cognitively challenging situations induced by the method. The implication for instructors and designers is that implementing a promising method, to help students efficiently process the complex material in an ill-structured domain, might not always lead to the desired learning outcomes. Students’ motivation and metacognitive …", "num_citations": "7\n", "authors": ["892"]}
{"title": "A genetic algorithm approach to global optimization of software cost estimation by analogy\n", "abstract": " Estimation by Analogy is a popular method in the field of software cost estimation. However, the configuration of the method affects estimation accuracy, which has a great effect on project management decisions. This paper proposes an optimal global setup for determining empirically the best parameter configuration based on genetic algorithms. Those parameters involve the definition of project similarity, the number of analogies and the way of adjusting the analogies used. We describe how such a search can be performed in the parameter space spanned by these parameters, which are essentially of different type. We report results on two datasets and compare with approaches that explore partially the search space. Results provide evidence that our method produces similar or better accuracy figures with respect to other approaches.", "num_citations": "6\n", "authors": ["892"]}
{"title": "Resolving complexity and interdependence in software project management antipatterns using the dependency structure matrix\n", "abstract": " Software project management antipatterns are usually related to other antipatterns and rarely appear in isolation. This fact introduces inevitable interdependence and complexity that can not be addressed using existing formalisms. To reduce this complexity and interdependence, this paper proposes the Dependency Structure Matrix (DSM) as a method that visualizes and analyzes the dependencies between related attributes of software project management antipatterns. Furthermore, DSM provides a methodology that can be used to visualize three different configurations that characterize antipatterns and resolve cyclic dependencies that are formed between interdependent antipattern attributes. The proposed framework can be used by software project managers in order to resolve antipatterns that occur in a software project in a timely manner. The approach is exemplified through a DSM of 25 attributes of …", "num_citations": "6\n", "authors": ["892"]}
{"title": "Framework based software development: learning as an investment factor\n", "abstract": " We present a model for learning in framework based software development, based on a case study in framework based development. A framework is developed, then several applications are derived by customizing and extending the framework. We investigate the investments required, both in developing the framework and in allowing programmers to learn high level design and code to become proficient with it. The experiment shows an impressive variation in programmer’s productivity before and after learning. An existing model is adapted to take learning investment into account.", "num_citations": "6\n", "authors": ["892"]}
{"title": "Process mining for process conformance checking in an oss project: An empirical research\n", "abstract": " With almost 20 years of research, Process Mining can now be considered to be in a mature phase allowing its application to a variety of sectors. In this article, the bug closure process that is followed by a community of an open source software project is investigated in order to perform process conformance checking. Actual data that reveal the process steps have been extracted from the project’s Bugzilla database and have been used as input in Disco process mining tool. The data includes extracted information for more than 19,000 bugs for the past 15 years in a csv form, formatted appropriately to construct an event log suitable for process mining. The extracted models have been compared to the process described in the project’s blogs and wikis by the community. The same models are also compared to the bug closure process that Bugzilla suggests to be used by the projects using this software for bug …", "num_citations": "5\n", "authors": ["892"]}
{"title": "FPGA acceleration of spark applications in a Pynq cluster\n", "abstract": " In this paper we present a framework for the seamlessly utilization of hardware accelerators in heterogeneous SoCs that are used to speedup the processing of Spark data analytics applications.", "num_citations": "5\n", "authors": ["892"]}
{"title": "SPynq: Acceleration of machine learning applications over Spark on Pynq\n", "abstract": " Spark is one of the most widely used frameworks for data analytics that offers fast development of applications like machine learning and graph computations in distributed systems. In this paper, we present SPynq: A framework for the efficient utilization of hardware accelerators over the Spark framework on heterogeneous MPSoC FPGAs, such as Zynq. Spark has been mapped to the Pynq platform and the proposed framework allows the seamlessly utilization of the programmable logic for the hardware acceleration of computational intensive Spark kernels. We have also developed the required libraries in Spark that hides the accelerator's details to minimize the design effort to utilize the accelerators. A cluster of 4 nodes (workers) based on the all-programmable MPSoCs has been implemented and the proposed platform is evaluated in a typical machine learning application based on logistic regression. The …", "num_citations": "5\n", "authors": ["892"]}
{"title": "A comprehensive approach for implementing an open source ERP in a Greek industry\n", "abstract": " Enterprise Resource Planning Systems (ERPs) are used as an automated solution for the company's operations in order to provide information to all levels of the organization. But the more businesses are obliged to implement an information system to cope with competition, the less viable is the cost of acquisition and maintenance of the ERP cause of the unfavorable economic conditions. One solution is provided by the Open Source Software (OSS) for the transparency of software and the less expensive implementation. We have conducted an exploratory study about implementing an OSS ERP in a developing anonymous Greek industry. It included recording of the processes of the industry as well as interviews and meetings with company managers in order to elicit the system requirements. Overall, we found that the combination of the industry's ISO related information, the manager's interviews and the cost …", "num_citations": "5\n", "authors": ["892"]}
{"title": "Performance and energy evaluation of spark applications on low-power SoCs\n", "abstract": " Microservers have recently gained attention as low-cost, low power, reduced footprint servers that are mainly based on energy efficient processors such as the ones used in embedded systems. Microservers based on low-power embedded processors are mainly targeting lightweight applications or parallel applications that benefit most from individual low-power servers with sufficient I/O between nodes rather than high performance processors. In this paper we evaluate the mapping of Apache Spark on low-power SoC-based processors. Apache Spark is one of the most widely framework in cloud computing for batch and streaming data analytics. We evaluate the energy efficiency of low-power SoCs that are used in embedded system for the execution of several Spark applications. The performance evaluation shows that low-power SoCs have the potential to offer up to 3x higher energy efficiency compared to high …", "num_citations": "5\n", "authors": ["892"]}
{"title": "Process mining in software events of open source software projects\n", "abstract": " Process Mining has only been extensively studied for the past few years and yet it has already helped to better understand the way systems work and made possible the extraction of knowledge that can be used to improve processes of a system. In this paper, the focus of process mining is on Open Source Software projects and software events. The use of data that are publicly available on the web with the application of process mining algorithms can lead to useful conclusions on characteristics of successful projects and ways to help those who appear to be risky. This can be achieved by analyzing the event logs in order to extract process models but also in order to identify social networks within the community of a project. In addition, with further research and analysis a general process specification could be created to help Open Source Software projects reengineer their processes and improve their activities in order to succeed. In this paper there is an attempt to extract a process model from an Open Source Software project and compare it with the process that the development team should follow. More specific, the effort is focused on the bug handling process and thus, the extraction of the followed process model could help improve the way tasks are shared and bugs are closed.", "num_citations": "5\n", "authors": ["892"]}
{"title": "Component recycling for agile methods\n", "abstract": " Given the increasing size and complexity of today's systems, reusability is an important quality aspect. In this work we consider development and reuse of reusable components in the context of agile methods. To distinguish the proposed approach from the more established systematic reuse approaches we call our proposal component recycling instead of component reuse. For the development of recyclable components we show how inherent characteristics of agile methods, particularly the provision of useful and complete partial components during the lifecycle, can be used constructively for the development of components. These components are placed in a component repository for later recycling. The requirements implemented at each iteration serve as the design rationale for the components and distinguish earlier components from their later versions providing tracing.", "num_citations": "5\n", "authors": ["892"]}
{"title": "The effect of prompting to students with different learning styles\n", "abstract": " Purpose – The purpose of this paper is to explore the impact of question prompts on student learning in relation to their learning styles. The context of the study is technology‐enhanced learning in an ill‐structured domain.Design/methodology/approach – The study conditions were the same for all the students in the four learning style groups. Student learning style was the independent variable, while students' attitudes and task performance were the dependent variables of the study. Pre‐test treatment post‐test method was used. Students studied in a web‐based learning environment during treatment.Findings – The integration of question prompts as student supporting tool in technology‐enhanced learning environments might not improve learning for all students alike independent of their learning styles.Research limitations/implications – Small uneven groups because the researcher has no control over the …", "num_citations": "5\n", "authors": ["892"]}
{"title": "An Empirical Study on Design Pattern Usage on Open-Source Software.\n", "abstract": " Currently, open source software communities are thriving and the number of projects that are available through well known code repositories is rapidly increasing over the years. The amount of code that is freely available to developers facilitates high reuse opportunities. One of the major concerns of developers when reusing code is the quality of the code that is going to be reused. Design patterns are well known solutions that are reported to produce substantial benefits with respect to software quality. In this paper, we investigate the extent to which design patterns are employed in open source software. More specifically, this study reports empirical results based on the number and type of design patterns retrieved from open source software projects. Up to now, one hundred and eight (108) open source software projects of various characteristics have been considered. The results of the study suggest that several patterns are more frequently used in open source software than others, that some patterns are more applicable in some categories than others and that program size, number of downloads, days of project activity and the number of developers are crucial factors that influence the use of design patterns in open source software project.", "num_citations": "5\n", "authors": ["892"]}
{"title": "Blockchain 3.0 smart contracts in E-government 3.0 applications\n", "abstract": " The adoption of Information Communication Technologies (ICT) and Web 3.0 contributes to the e-government sector by transforming how public administrations provide advanced and innovative services to interact with citizens. Blockchain (BC) and Artificial Intelligence (AI) disruptive technologies will reshape how we live, work, and interact with government sectors and industries. This paper presents how Blockchain 3.0 and Artificial Intelligence enhance robust, secure, scalable, and authenticity provenance solutions. Two validation scenarios are analyzed to present how blockchain smart contracts and AI agents support energy and health-oriented e-government services.", "num_citations": "4\n", "authors": ["892"]}
{"title": "Management anti-patterns in IT innovation projects\n", "abstract": " The main aim of this pilot study is to investigate management anti-patterns encountered in IT innovation projects, in the long run. A quantitative research methodology was chosen. A group of software project managers in industrial innovation projects were requested to fill in a questionnaire. The collected data revealed anti-patterns, which were compared and contrasted to the anti-patterns mostly found in traditional software projects. Some anti-patterns encountered in conventional software projects were also identified in innovation projects. Additionally, a new possible anti-pattern was identified and further investigated. The new anti-pattern regards the management of team creativity and is considered as an anti-pattern, because it can be an obstacle in teamwork progress, having negative consequences. A remedy solution is recommended as a re-factoring and recovering management strategy. Overall, this pilot …", "num_citations": "4\n", "authors": ["892"]}
{"title": "Selecting refactorings: an option based approach\n", "abstract": " Refactoring, aims to improve the design of existing code to cope with foreseen software architecture evolution. The selection of the optimum refactoring strategy can be a daunting task involving the identification of refactoring candidates, the determination of which refactorings to apply and the assessment of the refactoring impact on software product quality characteristics. As such, the benefits from refactorings are measured from the quality advancements achieved through the application of state of the art structural quality assessments on refactored code. Perceiving refactoring trough the lens of value creation, the optimum strategy should be the one that maximizes the endurance of the architecture in future imposed changes. We argue that an alternative measurement and examination of the refactoring success is possible, one, that focuses on the balance between effort spent and anticipated cost minimization. In …", "num_citations": "4\n", "authors": ["892"]}
{"title": "Agents, clusters and components: A synergistic approach to the GSP\n", "abstract": " Grids provide access to a vast amount of computational resources for the execution of demanding computations. These resources are geographically distributed, owned by different organizations and are vastly heterogeneous. The aforementioned factors introduce uncertainty in all phases of a Grid Scheduling Process (GSP). This work describes a synergistic multidisciplinary approach which aims at addressing this uncertainty. It proposes a network of resource representatives (RRs), which maintain the more or less static characteristics of available workers they represent. Clustering techniques are used for the efficient searching in the network of RRs by client agents. After the discovery of possibly suitable resources, client agents and resource agents negotiate directly for the selection of the best available resource set. Finally, according to the characteristics of the selected resource set and its current state, we …", "num_citations": "4\n", "authors": ["892"]}
{"title": "Detecting similarities in antipattern ontologies using semantic social networks: implications for software project management\n", "abstract": " Ontology has been recently proposed as an appropriate formalism to model software project management antipatterns, in order to encode antipatterns in a computer understandable form and introduce antipatterns to the Semantic Web. However, given two antipattern ontologies, the same entity can be described using different terminology. Therefore, the detection of similar antipattern ontologies is a difficult task. In this paper, we introduce a three-layered antipattern semantic social network, which involves the social network, the antipattern ontology network and the concept network. Social Network Analysis (SNA) techniques can be used to assist software project managers in finding similar antipattern ontologies. For this purpose, SNA measures are extracted from one layer of the semantic social network to another and this knowledge is used to infer new links between antipattern ontologies. The level of uncertainty …", "num_citations": "4\n", "authors": ["892"]}
{"title": "FLOSSCom-Using the principles of informal learning environments of FLOSS communities to improve ict supported formal education\n", "abstract": " Software can be allocated to two very different domains. The first one is determined by socalled proprietary software. Proprietary software is distributed on the basis of licenses that keep the property of the software to the software company that produced it. The user has to accept the software as it is sold by the producer and its vendors and to pay license fees for using it. The buyer and user of a proprietary software product is thus not allowed and not capable to read and change the source code of the program. 1 If the user wants to customize functionalities of a proprietary software system to his needs he relies on the producer's willingness to take his demand into account when the next release of the software program is created. The world market for desktop operating systems, for instance, is dominated by proprietary software, as 84% of all desktop operating systems are Microsoft Windows XP. 2The other software domain is Free/Libre and Open Source Software (FLOSS) 3. In contrast to proprietary software, FLOSS is distributed on the basis of licenses that entitle the users to read and modify the source code and that do not require the user to pay license fees for using FLOSS systems. Well-known examples of FLOSS are the Linux operating system or the Apache web server. 4", "num_citations": "4\n", "authors": ["892"]}
{"title": "Decision making based on past problem cases\n", "abstract": " This paper deals with the generation of an evaluation model to be used for decision making. The paper proposes the automated selection of past problem cases and the automated synthesis of a new evaluation model, based on the cumulative experience stored in a knowledge base. In order to select the most promising past evaluation cases we propose the use of two metrics: their proximity to the new case and the degree of success. To add flexibility, we allow the user to express his preference on these two factors. After having selected a group of the most promising past evaluation cases, a method for deriving a new evaluation model, i.e. the weights and the scales of the attributes, is presented. The method covers both numerical and nominal attributes. The derived model can be used as a starting point for an interactive evaluation session. The overall process is illustrated through a real world situation …", "num_citations": "4\n", "authors": ["892"]}
{"title": "A metric suite for evaluating interactive scenarios in video games: An empirical validation\n", "abstract": " Game development is one of the fastest growing industries. Since games' success is mostly related to users' enjoyment, one of the cornerstones of their quality assessment is the evaluation from the user perspective. According to literature, game scenario constitutes a key-factor that leads to users' enjoyment. Despite their importance, scenarios are currently evaluated through heuristics in a subjective way. The aim of this paper is to develop an objective model (ie, a set of quality attributes and metrics) for evaluating game scenarios with respect to users' satisfaction. The proposed model can be applied to flow charts and character models (ie, common game scenario representation mechanisms). To achieve this goal, we:(a) gathered game scenario characteristics that are related to users' satisfaction,(b) proposed several metrics for quantifying these characteristics, and (c) performed a case study on three interactive …", "num_citations": "3\n", "authors": ["892"]}
{"title": "A Novel Framework for the Seamless Integration of FPGA Accelerators with Big Data Analytics Frameworks in Heterogeneous Data Centers\n", "abstract": " To face the increased network traffic in the cloud, data center operators have started adopting an heterogeneous approach in their infrastructures. Heterogeneous infrastructures, e.g. based on FPGAs, can provide higher performance and better energy-efficiency compared to the contemporary processors. However, FPGAs lack of an easy-to-use framework for the efficient deployment from high-level programming frameworks. In this paper, we present a novel framework that allows the seamless integration of FPGAs from high-level programming languages, like Java and Scala. The proposed approach provides all the required APIs for the utilization of FPGAs from these languages. The proposed scheme has been mapped on Amazon AWS f1 infrastructure and a performance evaluation is presented for two widely used machine learning algorithms.", "num_citations": "3\n", "authors": ["892"]}
{"title": "Process management in the Greek public sector: a case study in the municipality of Kalamaria\n", "abstract": " Before initiating a Business Process Re-engineering and Business Process Automation project an organization needs to understand the concept of Business Process Management and the problems that may arise. This usually requires a team of experts to help, evaluate and perform such tasks. The purpose of this paper is to present the overall approach and the specific steps that were taken by the authors to record, manage, re-engineer and automate a few selected processes from the Municipality of Kalamaria.", "num_citations": "3\n", "authors": ["892"]}
{"title": "Extracting components from open source: The component adaptation environment (COPE) approach\n", "abstract": " Open Source Software (OSS) represents an extremely valuable resource that is reused systematically almost in every software project. The reuse of OSS components however is restricted to ready-made components and developers who want to reuse code that exists in OSS projects but is not offered as a black-box component often resort to copying existing code and adapting it in their projects. OPEN-SME is a European research project which aims at providing ready-to-use OSS components that originate from existing OSS projects but are not necessarily provided as such. In this work we describe the Component Adaptation Environment (COPE) tool that was developed in the context of the OPEN-SME project and enables software experts, called reuse engineers, to extract components from OSS projects, test them and provide test documentation, validate them with Model-Based Testing techniques, package them …", "num_citations": "3\n", "authors": ["892"]}
{"title": "On the Approximation of the Substitution Costs for Free/Libre Open Source Software\n", "abstract": " In this paper we describe our work in progress towards approximating the substitution costs for FLOSS. Substitution cost is the monetary value of the effort necessary for implementing a FLOSS application from scratch in a software company. We describe our approach for estimating substitution cost, based on building generic estimation models for the modern software industry. For this purpose we use the latest version of ISBSG, and apply our models on a subset of projects from a Debian distribution. This yields an approximation of the total substitution costs for this collection of FLOSS applications. We report on various problems, limitations and issues related to the data, the model precision, and the currently available FLOSS project data. However, the anticipated arrival of more coherent FLOSS databases is expected to alleviate many of these issues, and more precise calculations will become feasible, using the …", "num_citations": "3\n", "authors": ["892"]}
{"title": "Real options as tool enhancing rationale of OSS components selection\n", "abstract": " Selecting suitable software entities to adopt in a software project can be a challenging task, as along with the desired characteristics, come risks associated with the inherent quality. Despite source transparency in the Open Source Software (OSS) realm, the vast number of available components hinder the component selection process. To overcome this, various software evaluation methods have been proposed, offering assistance in measuring various qualities and aspects of software components. However, these methods fail to take into consideration the profit generated due to selected quality characteristics, and thus, to provide an additional value-based view to decision makers. Real Options Theory has been proposed as a tool to enhance decision making, where alternatives are treated as ldquooptionsrdquo of an exercised value. This paper proposes Real Options as a tool assisting the componentspsila …", "num_citations": "3\n", "authors": ["892"]}
{"title": "AKM in open source communities\n", "abstract": " Previous chapters in this book have dealt with Architecture Knowledge Management in traditional Closed Source Software (CSS) projects. This chapterwill attempt to examine the ways that knowledge is shared among participants in Free Libre Open Source Software (FLOSS                             1) projects and how architectural knowledge is managed w.r.t. CSS. FLOSS projects are organized and developed in a fundamentally different way than CSS projects. FLOSS projects simply do not develop code as CSS projects do. As a consequence, their knowledge management mechanisms are also based on different concepts and tools.", "num_citations": "3\n", "authors": ["892"]}
{"title": "A unified approach for software process representation and analysis.\n", "abstract": " This paper presents a unified approach for software process management which combines object-oriented (OO) structures with formal models based on (high-level timed) Petri nets. This pairing may be proved beneficial not only for the integrated representation of software development processes, human resources and work products, but also in analysing properties and detecting errors of a software process specification, before the process is put to actual use. The use of OO models provides the advantages of graphical abstraction, highlevel of understanding and manageable representation of software process classes and instances. Resulted OO models are mechanically transformed into a high-level timed Petri net representation to derive a model for formally proving process properties as well as applying managerial analysis. We demonstrate the applicability of our approach by addressing a simple software process modelling example problem used in the literature to exercise various software process modelling notations.", "num_citations": "3\n", "authors": ["892"]}
{"title": "Using mcda and bayesian belief networks to aid decision making based on software project management antipatterns\n", "abstract": " Antipatterns in software project management are mechanisms that describe commonly occurring solutions to problems that generate negative consequences. The Bayesian Belief Network (BBN) approach has been recently proposed for modelling software project management antipatterns. BBNs provide a solution for software project managers, who would like to model the cause-effect relationship that underlies antipatterns by considering their inherent uncertainty. Although a BBN model can be used to aid decisions by observing the effect of uncertainty on a specific attribute of interest (such as software quality), in many circumstances decisions based on multiple criteria need to be made. Multi-criteria decision aid (MCDA) can be applied to improve the effectiveness of management decisions. A BBN model ignores the multiple, and often conflicting, criteria that surround a managerial decision (such as development time and total collaboration costs). In this paper such an approach is exemplified through a specific BBN model of an antipattern complemented by MCDA. The final resulted model is helpful in evaluating the impact of developer personalities and temperaments on communication, collaboration viability and effectiveness in pair programming.", "num_citations": "3\n", "authors": ["892"]}
{"title": "Permissioned Blockchains and Smart Contracts into Agile Software Processes\n", "abstract": " Since 2009 when Bitcoin was introduced, followed by the evolution of permissioned and permissionless blockchain networks as we know of them today, the technology of distributed ledgers is continuously changing to satisfy the markets interest into them. Alongside, software development methodologies are also evolving in order to incorporate the businesses and users demands. The broad use of internet in everyday tasks and services such as Backend as a Service, Database as a Service, Infrastructure as a Service, Platform as a Service and Software as a Service have formed the software processes that are adopted to produce the final product. Blockchain changes drastically the way software is developed and companies producing software must adapt quickly by changing their software processes accordingly to avoid obstacles and pitfalls coming of that, in order to incorporate this new technology but …", "num_citations": "2\n", "authors": ["892"]}
{"title": "Seamless FPGA deployment over spark in cloud computing: A use case on machine learning hardware acceleration\n", "abstract": " Emerging cloud applications like machine learning and data analytics need to process huge amount of data. Typical processor architecture cannot achieve efficient processing of the vast amount of data without consuming excessive amount of energy. Therefore, novel architectures have to be adopted in the future data centers in order to face the increased amount of data that needs to be processed. In this paper, we present a novel scheme for the seamless deployment of FPGAs in the data centers under the Spark framework. The proposed scheme, developed in the VINEYARD project, allows the efficient utilization of FPGAs without the need to change the applications. The performance evaluation is based on the KMeans ML algorithm that is widely used in clustering applications. The proposed scheme has been evaluated in a cluster of heterogeneous MPSoCs. The performance evaluation shows that the …", "num_citations": "2\n", "authors": ["892"]}
{"title": "Using open source projects in higher education: A two-way certification framework\n", "abstract": " The paper proposes a framework for the certification of free/libre open source software (FLOSS) projects. The process is two-fold and is based on our experience over the last four years of using FLOSS for teaching software engineering in Aristotle University of Thessaloniki. The premise of the paper is that students’ engagement with real open source projects, and more specifically with the respective open source communities, can be an effective instructional method for skill development. We argue that through such a process, the students are able to get familiar with tools and technologies used in FLOSS and receive certification as FLOSS participants. On the other hand, the students can also review and evaluate the FLOSS project they use during the learning activity from different perspectives. In more advanced learning activities, this evaluation can be based on certification standards, providing in that …", "num_citations": "2\n", "authors": ["892"]}
{"title": "Open source migration in Greek public sector: A feasibility study\n", "abstract": " Open Source software has been recently recognized by governments as a viable and cost effective solution. However, transition to open source is not a plug-and-play process but one that requires deep knowledge of open source dynamics and of organization’s operations, budgetary constraints, capacities, ethics and political agenda. As with any IT transition, there are uncertainties and risks that need to be handled in order to maximize the gains for the organization and for the society through the provided services. In this paper we present a feasibility study conducted in 15 Greek public sector organizations with the aim to discover the value this transition brings to a typical public sector organization.", "num_citations": "2\n", "authors": ["892"]}
{"title": "1st international workshop on:‘designing for participatory Learning’Building from open source success to develop free ways to share and learn\n", "abstract": " The Open Source world shows how volunteer collaboration can lead to great products and to great learning. We want to further explore at this workshop what happens using approaches from that community to break barriers between teachers and learners for today’s Internet-savvy young people to design and co-construct sites for participatory learning. The aim of this workshop is to explore the barriers for this type of learning in higher education settings. Content creation, knowledge exchange, community dynamics, and the impact on the boundary between formal and informal education are key subjects of this workshop.", "num_citations": "2\n", "authors": ["892"]}
{"title": "Computer music interface evaluation\n", "abstract": " One of the most intriguing fields of human-computer interaction (HCI) involves the communication aspects of computer music interfaces. Music is a rich communication medium, and computer music is the amalgam of interface science and musical praxis forming a dynamic subset of HCI. There are structural similarities between the job of a music composer and that of a user interface designer (although their objectives may be different). While sound has been used in general purpose interfaces as an object, its use has been deteriorated at a primary level, that of a signal-processing approach. However, music composition and performance are highly abstract human activities involving a semantic and a symbolic mechanism of human intellectual activity. This article analyzes the unique problems posed by the use of computers by composers and performers of music. It presents the HCI predicates involved in the chain of …", "num_citations": "2\n", "authors": ["892"]}
{"title": "Improving Quality by Exploiting Human Dynamics in Agile Methods\n", "abstract": " Theory and experience have shown that human factors are critical for the success of software engineering practices. Agile methods are even more sensitive in such factors because they rely heavily on personal efforts with limited guidance from process manuals, allowing freedom in choosing solutions, interpersonal communications, etc. This fact raises important issues for the management of software engineers that are expected to apply agile methods effectively. One such issue at the agile organization executive level is human resource management, which should take into account agile development peculiarities, work competencies needed, agile workforce planning, etc. Another issue at the micro-management level is agile workforce management within the development process (eg, team planning for a specific task or project) where individual human features will undoubtedly affect delivered quality and …", "num_citations": "2\n", "authors": ["892"]}
{"title": "Formal experimentation for agile formal methods\n", "abstract": " The field of knowledge known as Empirical Software Engineering suggests the application of experimental methods in order to discover and describe characteristics of the process and results derived from new methodologies, such as agile formal methods. In this paper we present the methodology needed for conducting formal experiments and we review related work done in the field of the agile formal methods. At the end of the paper, we report on our experimentation work up to now and our suggestions on future work in this important field of research.", "num_citations": "2\n", "authors": ["892"]}
{"title": "Automating the evaluation of educational software\n", "abstract": " This paper proposes a framework for educational software evaluation based on the Multiple Criteria Decision Aid methodology, supported by ESSE, an Expert System for Software Evaluation. An evaluation example is presented that illustrates the overall evaluation process. Evaluating educational software products is a twofold process: both the technical and the educational aspect of the evaluated products have to be considered. As far as the product’s educational effectiveness is concerned, the flexibility of ESSE in problem modeling allows the development and the use of a set of criteria, which clearly describe the context, and the educational setting in which the software products are to be used. From the technical point of view, a software attribute set based on the ISO/IEC 9126 standard has been chosen together with the accompanying measurement guidelines.", "num_citations": "2\n", "authors": ["892"]}
{"title": "Elastic-DF: Scaling Performance of DNN Inference in FPGA Clouds through Automatic Partitioning\n", "abstract": " Customized compute acceleration in the datacenter is key to the wider roll-out of applications based on deep neural network (DNN) inference. In this article, we investigate how to maximize the performance and scalability of field-programmable gate array (FPGA)-based pipeline dataflow DNN inference accelerators (DFAs) automatically on computing infrastructures consisting of multi-die, network-connected FPGAs. We present Elastic-DF, a novel resource partitioning tool and associated FPGA runtime infrastructure that integrates with the DNN compiler FINN. Elastic-DF allocates FPGA resources to DNN layers and layers to individual FPGA dies to maximize the total performance of the multi-FPGA system. In the resulting Elastic-DF mapping, the accelerator may be instantiated multiple times, and each instance may be segmented across multiple FPGAs transparently, whereby the segments communicate peer-to …", "num_citations": "1\n", "authors": ["892"]}
{"title": "Towards a Software System for Facilitating the Reuse of Business Processes\n", "abstract": " Business processes are the driving force of organizations regardless of their size, type or age. There are some processes that are explicit, formal and well documented and others that are in tacit and informal form. Processes are usually complex and require deep knowledge to understand them. For this reason, Business Process Management is a priority for organizations worldwide. Domain Specific Languages are programming languages that are designed to be implemented in specific fields. This paper introduces an open source toolset that will facilitate the reuse of processes in both the public and private sector through a Domain Specific Language and an Integrated Development Environment with a dedicated graphical tool for users that have no previous experience in modeling processes.", "num_citations": "1\n", "authors": ["892"]}
{"title": "Entrepreneurship and Education: The “InnoEntre” Project\n", "abstract": " Purpose À The current study addresses an entrepreneurial program offered by a Greek Higher Education Institution À Aristotle University of Thessaloniki À to Information and Communication Technology undergraduate students and examines its effect on participants’ attitudes and perceptions towards entrepreneurship, within the wider context of entrepreneurship and education.Methodology/approach À The program is part of a wider pilot project called “InnoEntre.” The particular pilot program is provided in cooperation with Aarhus University of Denmark. The objective was for Danish and Greek students attending the particular course to interact, come up with a novel idea, and transform it through a business plan, into a valuecreating outcome, while presenting the steps, actions, experiences, and insight through the pilot program.", "num_citations": "1\n", "authors": ["892"]}
{"title": "Information Technology and Open Source: Applications for Education, Innovation, and Sustainability\n", "abstract": " This volume contains the proceedings of the three satellite events of the 10th International Conference on Software Engineering and Formal Methods (SEFM 2012), which was held during October 1–5, 2012, in Thessaloniki, Greece:", "num_citations": "1\n", "authors": ["892"]}
{"title": "Software quality and agile practices: A systematic literature review\n", "abstract": " Pair programming, already used with success in both industry and academia, has been exhaustively researched in recent years.", "num_citations": "1\n", "authors": ["892"]}
{"title": "Elastic Component Characterization with respect to Quality Properties: An intuitionistic fuzzy-based approach\n", "abstract": " Component selection based on quality properties is a fuzzy process because measurable component attributes cannot be attributed with certainty to high-level quality properties such as the ones proposed by the ISO/IEC 9126 quality model and other similar models. In addition, measurable component quality attributes can be characterized differently for different application domains (e.g., a total execution time value can be considered very satisfactory for one application domain and extremely unsatisfactory for another). In this paper we demonstrate the usage of an intuitionistic fuzzy approach in selecting components originating from an elastic component repository. Elastic components are the output of a quality-driven process for component development that results in component variants based on quality discrimination. During reuse, utilization of intuitionistic fuzzy sets can be proven an efficient solution to derive …", "num_citations": "1\n", "authors": ["892"]}
{"title": "Cost/effort estimation study (for libre software projects)\n", "abstract": " A wealth of successful software applications has been brought forward by Free/Libre Open Source Software (FLOSS); the new software development paradigm based on volunteer participation and open development processes. FLOSS plays an increasingly important role in the ICT sector in particular, and the world economy in general. It is therefore interesting to attempt to estimate the economic impact of FLOSS.In this paper we report our efforts on providing an informed estimate ([1]) of the substitution costs for a large portion of a Free/Libre Open Source Software code base. Substitution costs refer to how much it would have cost to build the same software from scratch entirely within a single firm in a proprietary software development model. Calculating the substitution costs for a given set of FLOSS applications is one way of assigning a Euro value to the production and effort represented by these applications.", "num_citations": "1\n", "authors": ["892"]}
{"title": "A tactic-driven process for developing reusable components\n", "abstract": " True reusability of components assumes that they not only offer the functionality prescribed by their APIs, but also that they conform to a well-defined set of quality attributes so that we know if a component can be successfully reused in a new software product. One of the problems with quality attributes however is that it is hard to identify the characteristics of components that contribute to their emergence. End-user quality attributes are versatile and difficult to predict but their occurrence is not of an accidental nature. In this paper we propose a methodology for the exploration of candidate architectural tactics during component analysis and design for the achievement of desirable quality effects. Our approach is based on executable specifications of components that are augmented with the required tactic-related parameters to form a testbed for quality-driven experimentation. We believe that the proposed …", "num_citations": "1\n", "authors": ["892"]}
{"title": "Identification of Knowledge Brokers in OSS Projects Mailing Lists through Social and Collaborative Networks\n", "abstract": " Open Source Software development signifies collaborative software development where the mobilisation of volunteered expertise is a measure of project success. As the initial hype surrounding open source software settles down, it is becoming ever harder for projects to identify and engage the interests of project participants. Much research has concentrated on the ‘recruitment’of professional software developers or coders and little attention has been paid to behind the scene individuals who spend valuable time in lists helping project participants on some mundane yet vital project activities. This paper utilises social networks as a knowledge discovery approach to identify key knowledge brokers in F/OSS projects’ mailing lists, analyse how lists participants interact, and the consequences of such collaboration for the success of F/OSS projects. Three Debian mailing lists are used as a case study. We discuss how to …", "num_citations": "1\n", "authors": ["892"]}