{"title": "Conducting on-line surveys in software engineering\n", "abstract": " One purpose of empirical software engineering is to enable an understanding of factors that influence software development. Surveys are an appropriate empirical strategy to gather data from a large population (e.g., about methods, tools, developers, companies) and to achieve an understanding of that population. Although surveys are quite often performed, for example, in social sciences and marketing research, they are underrepresented in empirical software engineering research, which most often uses controlled experiments and case studies. Consequently, also the methodological support how to perform such studies in software engineering is rather low. However, with the increasing pervasion of the Internet it is possible to perform surveys easily and cost-effectively over Internet pages (i.e., on-line), while at the same time the interest in performing surveys is growing. The purpose of this paper is twofold. First …", "num_citations": "218\n", "authors": ["1532"]}
{"title": "Tailoring use cases for product line modeling\n", "abstract": " Use cases are used for single system requirements engineering to capture requirements from an external point of view. When utilizing use cases for product line modeling they cannot be used as is but they have to be extended with a variability mechanism. Stereotypes can be used as this variability mechanism for use case diagrams and tags can be used for textual use cases. In this paper we describe how to tailor use cases for product line modeling, describe in which situations the approach can be applied and illustrate the use case approach by an example.", "num_citations": "89\n", "authors": ["1532"]}
{"title": "A decade of scoping: a survey\n", "abstract": " Scoping can be defined as the process of deciding in which parts of an organization's products, features and domains systematic reuse is economically useful. It generally is the first phase in product line engineering. For a decade now scoping has been recognized as a discipline of it's own in product line engineering. So it's time to look at what has been done in scoping in the last years and what is still to be done. In this survey, we identify and characterize existing scoping approaches with the main goal to derive open areas and research questions for further research in scoping. We analyze and compare existing approaches and derive open and partially addressed research questions that can be tackled by researchers in product line engineering in the next years.", "num_citations": "80\n", "authors": ["1532"]}
{"title": "A practical guide to product line scoping\n", "abstract": " Over the last years scoping has been established as the initial activity for starting product line engineering. To be successful in defining the right scope for more than 5 years in industrial projects, we always had to customize our generic scoping process to the organizational context, projects constraints, available artifacts, and resources. In this paper, we present an update of the scoping process that explicitly integrates 21 customization factors. In our experience customization of scoping is crucial to the overall product line success, since the scope is the basis for all further product line activities", "num_citations": "67\n", "authors": ["1532"]}
{"title": "Definition of reference architectures based on existing systems\n", "abstract": " Migration from single system development to product family engineering is a challenging task. The success of a product family depends greatly on the quality of its reference architecture, one of the central artifacts in product family engineering. Therefore, it is important to leverage the experience embodied in successful, existing systems coming from the same domains or from the same development organization in order to achieve high-quality reference architectures.Despite the importance of leveraging existing knowledge, the literature provides limited guidance on how to mine prior, related systems for this specific purpose. This report addresses this issue by introducing the PuLSE™-DSSA1 approach that explicitly takes information from existing systems into account and gives guidance for migrating it into a product family. PuLSE™-DSSA is a method that combines forward engineering design activities together with reverse engineering tasks.", "num_citations": "55\n", "authors": ["1532"]}
{"title": "Experiences with product line development of embedded systems at testo ag\n", "abstract": " Product line practices are increasingly becoming popular in the domain of embedded software systems. This paper presents results of assessing success, consistency, and quality of Testo's product line of climate and flue gas measurement devices after its construction and the delivery of three commercial products. The results of the assessment showed that the incremental introduction of architecture-centric product line development can be considered successful even though there is no quantifiable reduction of time-to-market as well as development and maintenance costs so far. The success is mainly shown by the ability of Testo to develop more complex products and the satisfaction of the involved developers. A major issue encountered is ensuring the quality of reusable components and the conformance of the products to the architecture during development and maintenance", "num_citations": "43\n", "authors": ["1532"]}
{"title": "Elicitation of requirements from user documentation\n", "abstract": " This paper describes an approach for elicitation of requirements based on existing user documentation. The approach we describe in this paper supports capturing of the information found in user documentation of legacy systems, eg, user manuals, and the specification of this information in requirements specifications, using, eg, Use Cases. We propose a conceptual model describing the transition from user documentation to requirements artifacts describing common and variable elements of a product line model or requirements specification. We present heuristics that allow an easy identification of text elements in user documents that are then used to create a significant part of the requirements specification and product line model, respectively.", "num_citations": "34\n", "authors": ["1532"]}
{"title": "Product line modeling with generic use cases\n", "abstract": " Use cases are used for single system requirements engineering to capture requirements from an customer/user point of view. When utilizing use cases for product line modeling they have to be extended with a variability mechanism. Stereotypes can be used as this variability mechanism for use case diagrams and textual use cases. This early and explicit variability in the product line lifecycle supports the domain experts in establishing a variability mindset and supports explicit instantiation during application analysis", "num_citations": "33\n", "authors": ["1532"]}
{"title": "Capturing product line information from legacy user documentation\n", "abstract": " The development of a software product line is seldom a green field task. Legacy systems exist that serve as an information source or that should be integrated into a product line. The information needed is usually elicited interactively with high involvement by the domain experts of the application domain. As domain experts have a high workload and are often unavailable, relying primarily on high expert involvement is a risk for the successful introduction of a product line engineering approach into an organization. This chapter presents an approach for the extraction of requirements from user documentation, which gives guidance", "num_citations": "31\n", "authors": ["1532"]}
{"title": "Using requirements management tools in software product line engineering: the state of the practice\n", "abstract": " A software product line oriented approach to developing systems has an impact on the development process as a whole. Although the basic idea of product lines is simple, systematic implementation of the approach is a challenging task. In fact, today's software product lines have such complex variability that their handling must be supported by tools, otherwise a systematic approach would not be possible. The same holds for requirements management of product lines. On the basis of specific industrial scenarios the paper derives important requirements that have to be observed if requirements management tools are to be usefully applied to product lines. Current requirements management tools are evaluated on the basis of these requirements in their daily industrial use. The presented requirements can indicate the future direction of tool development and method research.", "num_citations": "26\n", "authors": ["1532"]}
{"title": "Using documentation for product line scoping\n", "abstract": " The introduction of product line engineering must be well planned. This planning phase, where the product line's characteristics are determined, is called scoping. Product line scoping is the process of identifying and delimiting capabilities (products and features) and areas (subdomains and existing assets) of the product line where investment into reuse would be economical and beneficial to product development. It aims to dispel doubts and uncertainty in decisions about which products will become part of the product line and whether to invest into reuse. Scoping is based heavily on expert knowledge and information from meetings and workshops.", "num_citations": "24\n", "authors": ["1532"]}
{"title": "Efficient and systematic software evolution through domain analysis\n", "abstract": " The goal of any domain analysis approach is to identify and document requirements on a set of systems in the same application domain in order to make development and maintenance activities more efficient. Experience in domain analysis often reports on valuable results with respect to requirements on a company's system family but, on the other hand, it is seen as an effort-intensive approach, which may consequently be seen as not economically useful for software development today. We describe experience with an approach towards domain analysis that tries to overcome this general problem by systematically coordinating domain analysis effort and necessary product (family) evolution activities. The result was the realization of a Web interface to an existing system family as well as a significant improvement of the existing software's usability, flexibility, and maintainability.", "num_citations": "17\n", "authors": ["1532"]}
{"title": "Modeling variability with use cases\n", "abstract": " Use cases are used for single system requirements engineering to capture requirements from an external point of view. When utilizing use cases for product line modeling they cannot be used as is but they have to be extended with a variability mechanism. Stereotypes can be used as this variability mechanism for use case diagrams and tags can be used for textual use cases. In this report we describe how to tailor use cases for product line modeling, describe in which situations the approach can be applied and illustrate the use case approach by an example.", "num_citations": "14\n", "authors": ["1532"]}
{"title": "Integrating legacy documentation assets into a product line\n", "abstract": " When introducing product line engineering into an organization there normally exist systems that have already been developed in the domain of the product line. There are legacy assets in different forms which should be integrated into the product line. In this paper we describe the role of legacy documents in the product line engineering life cycle and especially for domain analysis. We propose some basic techniques for eliciting knowledge which is relevant to the product line and can increase domain understanding. Those techniques can be used for the elicitation of commonalities and variabilities from legacy documentations and produce candidates for elements of a domain model which can be proposed to the domain experts during domain analysis.", "num_citations": "13\n", "authors": ["1532"]}
{"title": "Knowledge-based document analysis\n", "abstract": " The performance of document analysis systems significantly depends on knowledge about the application domain that can be exploited in the analysis process. Typically one has to deal with different sources of knowledge like syntactic knowledge, semantic knowledge or strategic knowledge guiding the analysis process. We present a knowledge based document analysis system based on tasks. It allows to model and to interpret structural knowledge about documents and knowledge about the analysis process declaratively in a common framework.", "num_citations": "13\n", "authors": ["1532"]}
{"title": "Evaluation of a method for proactively managing the evolving scope of a software product line\n", "abstract": " [Context and motivation]PLEvo-Scoping is a method intended to help Product Line (PL) scoping teams anticipate emergent features and distinguish unstable from stable features, with the aim of preparing their PL for likely future adaptation needs. [Question/problem]This paper describes a quasi-experiment performed to characterize PLEvo-Scoping in terms of adequacy and feasibility. [Principal ideas/results] This quasi-experiment was performed by two scoping teams in charge of scoping the same PL, where one scoping team applied first an existing PL scoping approach and then PLEvo-Scoping, while the other scoping team interweaved activities from both. The two approaches achieved similar results: The method could be applied in just one day, and it was considered adequate and feasible. [Contribution] Ideas on how to improve the method and its tool support have been obtained, and …", "num_citations": "12\n", "authors": ["1532"]}
{"title": "How Can Computer Science Faculties Increase the Proportion of Women in Computer Science by Using Robots?\n", "abstract": " As women belong to a minority in computer science, this work aims to provide possible K-12 STEM education initiatives how computer science faculties can contribute to increasing the proportion of women in computer science by using robots. Through applying these initiatives, faculties can help to reduce the gender imbalance, increase diversity and the amount of computer science specialists, who are requested immensely. Based on the results of conducted requirements elicitation a concept for programming an application with the NAO robot which trains vocabularies, as well as a concept with the Cozmo robot which piles up cubes, were developed. First tests were performed with female and male high school students. Either concept consists of an introduction of possible robotics application fields, a presentation explaining the Python program code of the concept as well as corresponding exercises with the robot …", "num_citations": "9\n", "authors": ["1532"]}
{"title": "Separation of Variability Dimension and Development Dimension.\n", "abstract": " Controlling and managing variability across all life cycle stages is the key practice area that distinguishes product line engineering from single system development. Therefore, product line researchers have proposed many approaches and techniques for addressing variability management. There is, however, no standard or standardized framework yet that organizes and structures the different approaches in a clear and comparable way. This paper uses the concept of a variability dimension to clearly separate variability-related issues from all other aspects related to development artifacts. Along the variability dimension, the paper then presents the variability philosophy used by Fraunhofer PuLSE (Product Line Software and System Engineering) 1 that manages all kinds of variabilities (ie, from problem to solution space, from specification to runtime) in a unified way.", "num_citations": "9\n", "authors": ["1532"]}
{"title": "Extracting product line model elements from user documentation\n", "abstract": " This report describes an approach for extraction of product line requirements based on existing user documentation. The approach we describe in this report supports capturing of the information found in user documentation of legacy systems, eg, user manuals, and the specification of this information in product line models, using, eg, Use Cases. We propose a conceptual model describing the transition from user documentation to product line artifacts describing common and variable elements of a product line model. We present extraction patterns that allow an easy identification of text elements in user documents that are then used to create a significant part of the requirements specification and product line model, respectively and we present an extraction process that guides the user in using the pattern. We show the application of our approach for two case studies, one from the embedded/mobile phone domain …", "num_citations": "6\n", "authors": ["1532"]}
{"title": "Pattern-based documentation analysis for software product lines\n", "abstract": " Introducing product line engineering is an investment that has to be planned for. This investment also comprises an investment into the scoping activities. Scoping, also called product line planning can be defined as the process of deciding in which parts of an organisation's products, features and domains systematic reuse is economically useful. The basis of scoping is the domain knowledge of domain experts. In existing product line engineering approaches, the scoping information is elicited interactively from domain experts, which is an effort intensive task due to the large number of experts that are involved and the time needed for workshops and interviews.", "num_citations": "5\n", "authors": ["1532"]}
{"title": "Überblick Stand der Technik\n", "abstract": " Zur Begriffsbildung setzen wir uns zunächst in diesem Abschnitt mit den charakterisierenden Eigenschaften von Webanwendungen auseinander. Dabei gehen wir in zwei Schritten vor: Zuerst legen wir den Begriff „Webanwendung “für dieses Dokument fest und schließen einen Abriss der historische Entwicklung von Webanwendungen an.", "num_citations": "5\n", "authors": ["1532"]}
{"title": "Motivating Female Students for Computer Science by Means of Robot Workshops.\n", "abstract": " As women belong to a minority in computer science, this work aims to provide possible STEM education initiatives for middle to high school students. These initiatives are designed for institutions to contribute to increasing the proportion of women in computer science by using robots. Through applying these initiatives, institutions such as computer science faculties can help to reduce the gender imbalance, increase diversity and the amount of computer science specialists, who are requested immensely. Based on the results of conducted requirements elicitation a concept for programming an application with the NAO robot which trains vocabularies, as well as a concept with the Cozmo robot which piles up cubes, were developed. First tests were performed with female and male high school students. Either concept consists of an introduction of possible robotics application fields, a presentation explaining the Python …", "num_citations": "4\n", "authors": ["1532"]}
{"title": "Efficient scoping with cave: A case study\n", "abstract": " Introducing product line engineering is a major investment that has to be planned for. This investment comprises also an investment into the scoping activities (Boeckle et al. 2004). Scoping (Schmid 2003) builds a solid basis for the decision about where and what to invest in reuse. Scoping, as we propose it in our product line engineering methodology Fraunhofer PuLSE™*(Bayer et al. 1999; John et al. 2006) but also in other approaches, is a very knowledge-intensive activity. The basis of scoping is the domain knowledge of domain experts. This is supported by the fact that one of the key practices in SEI’s Product Line Practice framework (Clements and Northrop 2001) is the understanding of relevant domains. Scoping plans for the product line investment by deciding which features the products of the product line should have and by finding out about reuse potential in different subdomains of the product line. But …", "num_citations": "4\n", "authors": ["1532"]}
{"title": "UseLine: Process Description and Case-Study\n", "abstract": " In this report we describe the results of the UseLine Project, a project that was funded by the „Stiftung Rheinland Pfalz für Innovation “under grant number 0621.In this project, the interplay between the two Software Engineering disciplines Usability Engineering on the one hand and Product Line Engineering on the other hand is investigated. Although both disciplines seem to contain contradictory elements–eg Usability Engineering focuses on the individual user whereas Product Line engineering concentrates on reuse and commonality between products an integrated approach that focuses on both aspects has advantages. Especially for small and medium enterprises who traditionally have a strong customer focus and do often not have the time and money to introduce both–Product Line engineering and Usability engineering–an integrated approach can help to achieve a large market advantage–a usable …", "num_citations": "4\n", "authors": ["1532"]}
{"title": "The state of the practice of systematic software development/product line development in Germany\n", "abstract": " This report has presented the results of a survey to investigate product line potential in Germany. The survey was performed within the VSEK project and has been answered by 129 people belonging to industry contacts of the Fraunhofer IESE and the VSEK project.", "num_citations": "4\n", "authors": ["1532"]}
{"title": "Qualifikation von kleinen und mittleren unternehmen (kmu) im bereich software variantenbildung\n", "abstract": " Kaiserslautern eV) unter der Federführung des IESE, mit Beteiligung der Universität Kaiserslautern und mit zunächst sieben KMUs aus der Region gegründet. Der STI eV soll in besonderer Weise auf die Bedürfnisse von KMUs eingehen, bedarfsgerechte Leistungen kostengünstig für KMUs anbieten und darüber hinaus als Diskussionsforum für die Mitglieder und interessierte KMUs dienen. Die effektive Verwendung von Fördermittel wird am besten verdeutlicht, wenn man sich vor Augen führt, daß die Schaffung eines Arbeitsplatzes im Durchschnitt mit DM 23.250 erreicht wurde. Inzwischen sind etwa 100 Arbeitsplätze im IESE und benachbarten KMUs entstanden.", "num_citations": "4\n", "authors": ["1532"]}
{"title": "Extraktion von Produktfamilienanforderungen aus Benutzerdokumentation\n", "abstract": " Existierende Software wird oft von Dokumentation wie beispielsweise Benutzerhandbüchern begleitet. Diese Dokumentation ist eine wichtige Quelle für eine neue Produktfamilie. Durch das gezielte Nutzen von existierender Dokumentation können Experten entlastet und existierende Systeme reibungsloser integriert werden. Dieses Kapitel beschreibt eine Methode zur strukturierten Extraktion von Anforderungen an eine Produktfamilie aus der Benutzerdokumentation existierender Altsysteme. Mit Hilfe der Methode können strukturiert Features, Use Cases und andere Anforderungen in Dokumentationen existierender System gefunden und als Anforderungen an eine neue Produktfamilie integriert werden.", "num_citations": "3\n", "authors": ["1532"]}
{"title": "Evolutionary product line requirements engineering\n", "abstract": " Product line engineering has a widespread use in industry now. Therefore there is a high need for customizable, adaptable, and also for mature methods. Scoping and product line analysis are a unique and integral part of product line engineering. In these phases we determine where to reuse and what to reuse, establishing the basis for all technical, managerial, and investment decisions in the product line to come. Furthermore, these early phases are highly context dependant. In this tutorial we will give an introduction on how to analyze an environment with the purpose of planning a product line and its future evolution. We focus on product line requirements engineering methods, comprising product line scoping, analysis, and planning for evolution.", "num_citations": "2\n", "authors": ["1532"]}
{"title": "Report of the GI Work Group\" Requirements Management Tools for Product Line Engineering\"\n", "abstract": " 1.1 BackgroundWhy should we pay more attention to a product line requirements management process than to a single project environment and why is requirements management for product lines very much more difficult than for a single project environment?The question is easy to answer. As time goes by, customer requirements change, and so the product itself will change as well to satisfy the customer’s needs. A feature that was revolutionary a few years ago is now standard and may become obsolete in the future.", "num_citations": "2\n", "authors": ["1532"]}
{"title": "Key Challenges in Industrial Product Line Engineering.\n", "abstract": " abstract This paper summarizes the results of the\" Gesellschaft für Informatik\"(GI) working group on\" Requirements Engineering for Software Product Lines\" which is part of the requirements engineering group within in the GI. This work group met regularly to identify the key problems in product line engineering practice with potential (and proven) solutions. While this started originally as an effort focused purely on requirements engineering issues, we soon understood that we had to take a broader perspective due to the tight interconnection of requirements engineering with other issues in a product line context. We will provide a characterization of the different organizations that participated in this effort. This will demonstrate that overall a good coverage of different types of software organizations has been achieved. We will then provide an overview of the main problems in product line development. Based on both …", "num_citations": "2\n", "authors": ["1532"]}
{"title": "A support vector machine approach to model urban growth in the greater Tirana region, Albania\n", "abstract": " Spatially explicit land use modelling can give new insights on past patterns and processes and may provide information on likely future developments to support decision-making. This is of particular importance in regions where rapid and frequently unregulated urban development as well as short-term changes in demography and migration patterns have led to a dramatic increase of urban area and population such as in the greater Tirana region, Albania. Several modelling techniques have been developed within recent years such as cellular automata, agent-based, system dynamics, neural networks, and logistic regressions (Verburg et al. 2006; Lakes et al. 2009). Among these approaches machine learning techniques seem promising particularly in studies with little knowledge about the land use change process under investigation and data problems regarding quality, availability and comparability. Support vector machines (SVM) are a supervised learning approach for classification or regression of a multidimensional feature space and have been successfully applied for classification of remote sensing data (van der Linden et al. 2008; Burges 1998). The aim of this paper is to test a support vector machine approach for modelling urban land dynamics in the greater Tirana region, Albania.", "num_citations": "1\n", "authors": ["1532"]}
{"title": "SPLYR–The First Software Product Lines Young Researchers Workshop\n", "abstract": " The Software Product Lines Young Researchers (SPLYR) workshop addresses research activities in the field of software product lines (SPLs). Topics of interest include all aspects of developing, managing, evaluating, reusing, and maintaining SPLs. The peculiarity of this workshop is that it is specifically addressed to young researchers having original ideas and initiatives in the SPL field. We address mainly PhD work in progress but also encourage the submission of other work in progress such as master’s or diploma theses. Another characteristic of this workshop is that it will not involve blind reviews. Instead, each young researcher will be assigned one panelist/reviewer whose name will be disclosed as part of the review report. This provides a unique opportunity for the participating young researchers to get in contact with their reviewers and to receive valuable input for their work and presentations …", "num_citations": "1\n", "authors": ["1532"]}
{"title": "Software Evolution in Practice: Adding Web Functionality to a Legacy System\n", "abstract": " Software evolution requires an intelligent planning of evolution and maintenance activities in an organization. Intelligent planning means integrating the long-term strategy of a product’s evolution with short-term maintenance activities. This paper describes a successful example of software evolution in the context of the applied-research project APPLICATION2WEB. The paper describes experience in transferring technology into a small company to realize web services based on a legacy system. The project covered all necessary activities including reverse engineering, domain analysis, architecture analysis, and middleware integration.", "num_citations": "1\n", "authors": ["1532"]}
{"title": "Building Domain Models from Legacy Documentation Assets\n", "abstract": " Product Line Engineering is an approach for planned, structured and product-centred reuse of code and non-code artifacts. Having a broad expertise and a certain domain understanding in the domain of the product line is one of the key factors and practice areas in Product Line Engineering [CN99]. Basis of domain understanding are usually legacy systems with many existing legacy assets in different forms like code, documentation etc. which should not be ignored from an economical and quality perspective, when starting to develop a product line. Those assets are a rich source of knowledge and offer easily available information, which already exists and is specific to the domain.", "num_citations": "1\n", "authors": ["1532"]}
{"title": "Knowledge-based interpretation of business letters\n", "abstract": " The performance of document analysis systems significantly depends on knowledge about the application domain that can be exploited in the analysis process. Typically, one has to deal with different sources of knowledge like syntactic knowledge, semantic knowledge or strategic knowledge guiding the analysis process.", "num_citations": "1\n", "authors": ["1532"]}