{"title": "A New Approach for Software Cost Estimation with Hybrid Genetic Algorithm and Ant Colony Optimization\n", "abstract": " One of the most important effective factors the software companies face is the Software Cost Estimation (SCE) in software development process time. SCE is one of the subjects which have been considered in late decades in many researches. The real estimation in software development needs effort and cost factors which are done by use of the algorithmic and Artificial Intelligence (AI) models. Boehm used the COCOMO model which is an algorithmic model in 1981 for SCE. The low accuracy and non-reliable structures of the algorithmic models led to high risks of software projects. So, it is needed to estimate the cost of the project annually and compare it to the other techniques. The Meta-Heuristic algorithms have been developed well lately in software fields and SCE. Meta-heuristic and Genetic Algorithms (GA) and Ant Colony Optimization (ACO) solve the problems according to the optimization of the problems and are very efficient in optimizing the algorithmic models and the effective factors in cost estimation. In this paper we have proposed a hybrid model based on GA and ACO for optimization of the effective factors’ weight in NASA dataset software projects. The results of the experiments show that the proposed model is more efficient than COCOMO model in software projects cost estimation and holds less Magnitude of Relative Error (MRE) in comparison to COCOMO model.", "num_citations": "54\n", "authors": ["421"]}
{"title": "A new approach in bloggers classification with hybrid of k-nearest neighbor and artificial neural network algorithms\n", "abstract": " Blogs are one of the effective tools of web2 which are considered as one of the major module and of social and interactive capabilities in making IT world wonderful for the cyber and virtual living. Two methods were used in this paper: K-Nearest Neighbor (KNN) and Artificial Neural Networks (ANNs). These methods are classified based on Kohkiloye and Boyer Ahmad province bloggers dataset considering input features of each blogger to the other methods and previously provided algorithms as more optimal. Our simulation and experiments not only provide hopeful results but also higher anticipation and classification rate.", "num_citations": "49\n", "authors": ["421"]}
{"title": "A Novel Particle Swarm Optimization Approach for Software Effort Estimation\n", "abstract": " Software Effort Estimation (SEE) is one of the main activities in development of the software projects. Effort estimation in primary stages of development of the software is one of the important challenges the software projects manager faces. One of the common models of SEE is the Constructive Cost Model (COCOMO) model. In this model, the effort for development of the software projects is a function of the Kilo Line of Code (KLOC). The use of KLOC is a very applicable factor for effort estimation in COCOMO model. Also, Artificial intelligence techniques have been applied in effort estimation very much. In this paper, we have presented a new effort estimation model for software projects using Particle Swarm Optimization (PSO) and have studied the effective parameters on effort estimation using the PSO algorithm. The results of the paper show that the proposed model gives better estimation in comparison to the COCOMO model for effort.", "num_citations": "32\n", "authors": ["421"]}
{"title": "Data Mining Algorithms Application in Diabetes Diseases Diagnosis: A Case Study\n", "abstract": " Suitable diagnosis and selection of appropriate ways of treatment for people who are afflicted with diabetes are of great importance since ignorance in remedying diabetes can cause other organs to be defected and also can lead to death. Nowadays, there are many different ways for curing this disease, but choosing the appropriate way which has not only lower degree of damaging people but also has good output is a hard task to do. Usually, the effective way for curing it is diagnosing it right on cues. Therefore, designing a system for diagnosing diabetes can help doctors in choosing the remedy on time. Thus, we try to diagnose diabetes in this paper using the algorithms of the data which are crucial in diagnosis and prediction. Data mining on medicinal data is really important and designing prediction systems for helping doctors in diagnosing the type of disease and choosing the kind of cure can contribute a great deal to saving the lives of people. Data mining has various algorithms, but for diagnosing diabetes we have used Support Vector Machine (SVM), K Nearest Neighbors (KNN), Naïve Bayes, ID3, C4. 5, C5. 0, and CART. Evaluation and conclusion of data mining algorithms which contain 768 records of different patients have been carried out on Pima dataset. Results have shown that the degree of Accuracy in SVM algorithm is equals to 81.77.", "num_citations": "31\n", "authors": ["421"]}
{"title": "New Approach for Solving Dynamic Traveling Salesman Problem with Hybrid Genetic Algorithms and Ant Colony Optimization\n", "abstract": " Dynamic travelling salesman problem (DTSP) is one of the optimization issues which it is not solvable with classical methods. To solve this problem, various solutions in the literature can be seen that each has advantages and disadvantages. Genetic Algorithm (GA) and Ant Colony Optimization (ACO) have been good to solve the DTSP. In this paper, we highlight a new algorithm by combining genetic and ACO which gives us a better solution for DTSP. In hybrid algorithm, suitability of algorithm and travelled distance for DTSP has been considered. Obtained results suggest that Hybrid algorithm does not establish easily in the local optimum and possesses a good speed in convergence for comprehensive answer.", "num_citations": "29\n", "authors": ["421"]}
{"title": "Hybrid Approach of Firefly and Genetic Algorithms in Software Cost Estimation\n", "abstract": " Precise cost estimation of software projects is an important topic for software companies. Precise estimation of required efforts, delivery time and project cost are considered as a major challenge for project managers. The purpose of Software Cost Estimation (SCE) is to increase the possibility of project success and to identify and evaluate systematic efforts and costs in software projects. The first model presented for SCE was the COCOMO model. According to the investigations, it can be said that the error value of effort and cost in software projects is high in this model. Therefore, in order to improve the performance of evaluation criteria of software projects, we exploited meta-heuristic algorithms. In this paper, a novel hybrid model based on Genetic Algorithm (GA) and Firefly Algorithm (FA) is presented. The performance of the hybrid model was evaluated on NASA93 software project database. The evaluation of the results show that the hybrid model has decreased the error of Mean Magnitude of Relative Error (MMRE) criterion and increased the accuracy of Evaluation Function (EF) criterion by% 2.88 comparing to COCOMO model.", "num_citations": "24\n", "authors": ["421"]}
{"title": "Using hybrid model of artificial bee colony and genetic algorithms in software cost estimation\n", "abstract": " The Software Cost Estimation (SCE) is one of most important issues in the cycle of development, management decision, and in the quality of software project. In the case of the lack of certainty of the exact cost for software projects' development, companies encounter with numerous challenges. Also, due to inaccurate cost estimates, making wrong decisions by project managers make irreparable damage. To reach this propos, the effective factors for developing software projects should be evaluated to ensure of the projects success. COCOMO model is the main model for SCE which acts based on criteria and quantities such as number of Line of Code (LOC) or the Function Point Analysis (FPA). Research in recent years has shown that COCOMO model has not a good performance in the SCE. In this paper, we studied SCE by using a hybrid of Genetic Algorithm (GA) and Artificial Bee Colony (ABC) which are Meta …", "num_citations": "17\n", "authors": ["421"]}
{"title": "A New Optimization Method for Dynamic Travelling Salesman Problem with Hybrid Ant Colony Optimization Algorithm and Particle Swarm Optimization\n", "abstract": " In recent decades, with the introduction of optimization problems, new methods of was optimizing developed. The most important group of optimization techniques is meta-heuristic method. That is able to solve the problems of combination optimizing. The major problems in the combination optimizing such as Dynamic Travelling Salesman Problem (DTSP) is a kind of problems that is close answer to the optimum will introduce in them. So using of the meta-heuristic methods in this kind of problems was the case of concentration in the current years. In this paper a new algorithm based on Particle Swarm Optimization (PSO) and Ant Colony Optimization (ACO) as the name of ACO-PSO is proposed which of PSO algorithm for tuning parameters of ACO and establishing a balance between global search and local search is used. Experimental results show that the proposed method has good performance.", "num_citations": "15\n", "authors": ["421"]}
{"title": "Analysis of Use Case Points Models for Software Cost Estimation\n", "abstract": " Software projects development is inherently complex and in the project implementation process large resources must already be estimated. Also, many software companies try to increase software project quality and to lower software development costs. The most influential factors in Software Cost Estimation (SCE) are time, working environment, risk, size, and complexity of software and manpower resources in the project. Software projects are of sophisticated software engineering products that contain a lot of resources and the amount of each of them must be exact so that the project do not fails. So SCE as an important part of software engineering is considered in the success of software development projects. Use Cases consider SCE factors with respect to the smallest details. Use Case is one of the best ways of software modeling before production and development which does not describe the software process but will provide the exact knowledge of the software. In this paper, we review the software effort and cost estimation based on Use Case Points (UCP) that is used as a method to estimate the project cost.", "num_citations": "14\n", "authors": ["421"]}
{"title": "A Novel Multilayer Perceptron Artificial Neural Network based Recognition for Kurdish Manuscript\n", "abstract": " Alphabetic recognition is one of the most interesting and successful research fields in artificial intelligence and pattern recognition. The different writing structures of the languages and the presence of different approaches in diagnosis of letters of the different languages has been a challenge in alphabetic recognition. All these challenges have made many researches switch this research area. Of the different approaches in alphabetic recognition, the neural artificial networks could have been successful according to the capability of parallel process and learning capability for a special application like recognition pattern. So, it is a suitable approach in alphabet recognition. The Kurdish language holds two manuscripts according to Latin and Arabic alphabets. In this paper the Multilayer Perceptron (MLP) artificial neural networks are studied by the back-propagation algorithm to recognize the Kurdish-Latin manuscript. The proposed method is also applicative for diagnosis of all letters of the other Latin languages like English, Italian and etc. In this paper the MLP artificial neural networks are implemented in MATLAB environment. The efficiency factor for recognition of the Kurdish letters is to maximize the recognition accuracy of the Kurdish letters in training and testing the MLP artificial neural networks. This accuracy is 85.1535% in training stage and 81.2677% in testing stage.", "num_citations": "14\n", "authors": ["421"]}
{"title": "Artificial bee colony based constructive cost model for software cost estimation\n", "abstract": " With rapid changes in technology, software projects' development and production should be of greater operational speed in order to adjust and prepare the possibility of competition against rival companies. Hence, Software Cost Estimation (SCE) for projects is extremely vital. Nowadays, in most of large and small software companies, managers are facing with numerous challenges in allocating resources. In models such as COCOMO algorithm, due to the linearity, there is no possibility to test and train the factors of the current project with the former project. Therefore, in order to reduce cost and time and increase the quality of the projects, algorithmic models such as COCOMO the SCE must be changed to Artificial Intelligence (AI) models in order to meet performance of project during its lifecycle. In this paper, with using Artificial Bee Colony (ABC) algorithm the dependence between factors of COCOMO model has been measured and the best value to estimate the cost and effort of projects has been provided. The results show that compared with COCOMO, COCOMO-ABC model has less MMRE value and increased the accuracy of PRED (30) to about 1.77 times.", "num_citations": "13\n", "authors": ["421"]}
{"title": "Evaluation the Efficiency of Artificial Bee Colony and the Firefly Algorithm in Solving the Continuous Optimization Problem\n", "abstract": " Now the Meta-Heuristic algorithms have been used vastly in solving the problem of continuous optimization. In this paper the Artificial Bee Colony (ABC) algorithm and the Firefly Algorithm (FA) are valuated. And for presenting the efficiency of the algorithms and also for more analysis of them, the continuous optimization problems which are of the type of the problems of vast limit of answer and the close optimized points are tested. So, in this paper the efficiency of the ABC algorithm and FA are presented for solving the continuous optimization problems and also the said algorithms are studied from the accuracy in reaching the optimized solution and the resulting time and the reliability of the optimized answer points of view.", "num_citations": "13\n", "authors": ["421"]}
{"title": "Mobile Cloud Computing: Security Challenges for Threats Reduction\n", "abstract": " Nowadays, with the remarkable advances in information technology, mobile cloud computing with the security challenges and with factors privacy and trust is faced. MCC, in cloud computing technology for mobile devices is important. In MCC technology considering the hardware limitations of the device such as mobile phones, tablets and smart phones can be connected to a cloud environment and the opportunities that this environment provided benefit. To provide secure and reliable services in cloud computing environment is one of the most important issues in this technology. MCC is emerging as a new phenomenon in the world of information technology and business is considered highly, so that the promise to deliver and provide a wide range of advantages to their followed. In this paper, we study mobile technology and MCC security challenges facing this technology have discussed. And with respect to services provided in cloud environment, we propose a new MCC to provide security.", "num_citations": "13\n", "authors": ["421"]}
{"title": "A Novel Hybrid Model of Scatter Search and Genetic Algorithms for Software Cost Estimation\n", "abstract": " Software Cost Estimation (SCE) is on the challenging issues in software project management to avoid project failure. The most exact and accurate estimation of costs and efforts in software projects is the one which based on it; the development team can complete the project with specified resources within specified timing. All models of SCE try to do an estimation of the costs and efforts close to the real one with lowest error. COCOMO model is the most common linear model for SCE. In this model which utilizes a simple linear formula, all factors of the project are not fully taken into consideration so those models should be preferred that use training and testing patterns for real estimation. Meta-heuristic algorithms are suitable for SCE due to their nature of diversity and fitness. On conducting the present study we have used a hybrid model of Scatter Search (SS) and Genetic Algorithm (GA) for SCE. Using the proposed model, NASA60 and NASA93 data sets with lower Mean Magnitude of Relative Error (MMRE) in comparison to COCOMO model were obtained.", "num_citations": "10\n", "authors": ["421"]}
{"title": "A New Radial Basis Function Artificial Neural Network based Recognition for Kurdish Manuscript\n", "abstract": " During recent decades, recognizing letters was a considerable discussion for artificial intelligence researchers and recognize letters due to the variety of languages and different approaches have many challenges. The Artificial Neural Networks (ANNs) are framed based on particular application such as recognition pattern and data classification through learning process is configured. So, it is a proper approach to recognize letters. Kurdish language has two popular handwritings based on Arabic and Latin. In this paper, Radial Basis Function (RBF) of ANNs is used to recognize Kurdish-Latin manuscripts. Although, the authors' proposed method is also used to recognize the letters of all Latin languages which include English, Turkish and etc. are used. The authors implement RBF of ANNs in MATLAB environment. In this paper, the efficiency criteria is supposed to minimize the Mean Square Error (MSE) to recognize …", "num_citations": "9\n", "authors": ["421"]}
{"title": "Artificial Neural Networks Based Analysis of Software Cost Estimation Models\n", "abstract": " Managers required administering software development projects with accurate estimates of the resources. So accurate estimates can increase the speed of the effort for developing software projects, and prevent probabilistic failure consequently. Therefore, in the process of software development estimate must be taken in order to reduce cost and time schedule and the existence of probabilistic risks. The implementation of software projects developmental process in large organizations with hundreds of experts and professionals often is a complicated action and needs to be estimated. Estimation cost, time and manpower depends to factors such as the performance of software groups and the complexity of software project. Different models have been proposed for the Software Cost Estimation (SCE) that COCOMO model is the most common model for SCE. This model was used in 1981 by Boehm. This model is a high risk and threat for software projects due to its low accuracy and lack of reliability. Therefore, there is a need to evaluate and estimate SCE using Artificial Intelligence (AI) models. One of the best models of AI for SCE is Artificial Neural Networks (ANNs). ANNs try to assess and evaluate the data with minimal error using instruction and learning techniques. In this paper, the performance of Multi-Layer Perceptron (MLP), Radial Basis Function (RBF), Wavelet Neural Network (WNN), Functional Link Artificial Neural Network (FLANN) and Generalized Regression Neural Network (GRNN) models have been discussed in SCE.", "num_citations": "8\n", "authors": ["421"]}
{"title": "Analysis of Scheduling Algorithms in Grid Computing Environment\n", "abstract": " Grid Computing is the technology of dividing computer networks with different and heterogeneous resources based on distribution computing. Grid computing has no limitation due to its geographical domain and the type of undercover resources. Generally, a grid network can be considered as a series of several big branches, different kinds of microprocessors, thousands of PC computers and workstations in all over the world. The goal of grid computing is to apply available computing resources easily for complicated calculations vie sites which are distributed geographically. In another words, the least cost for many users is to support parallelism, minimize the time of task operation and so on in scientific, trade and industrial contexts. To reach the goal, it is necessary to use an efficient scheduling system as a vital part for grid environment. Generally, scheduling plays very important role in grid networks. So, selecting the type of scheduling algorithm has an important role in optimizing the reply and waiting time which involve as two important factors. As providing scheduling algorithms which can minimize tasks runtime and increase operational power has remarkable importance in these categories. In this paper, we discuss about scheduling algorithms which involve independent algorithms such as Minimum Execution Time, Minimum Completion Time, Min-min, Max-min and XSuffrage.", "num_citations": "8\n", "authors": ["421"]}
{"title": "A novel hybrid artificial immune system with genetic algorithm for software cost estimation\n", "abstract": " Inaccurate estimation of software projects is of the important and obvious causes of project failures. Studying the related literature we notice that different models have been proposed for Software Cost Estimation (SCE) among which COCOMO model is the most prevalent and common one. Lack of a unique standard for measuring the software development costs and heterogeneous estimations are considered two problematic challenges in software industry. Since Meta-heuristic algorithms are among the most widespread algorithms in solving complicated and optimization problems, we have utilized a combination of Genetic Algorithm (GA) and Artificial Immune System (AIS) in evaluating metrics and software criteria in SCE. The present study has used the NASA60 dataset to evaluate the results. PRED, Magnitude of Relative Error (MRE) and Mean MRE (MMRE) assessment indices were used to compare the results of hybrid model. The findings revealed that the hybrid model outperformed the other models regarding estimation accuracy.", "num_citations": "7\n", "authors": ["421"]}
{"title": "Object Oriented Software Engineering Models in Software Industry\n", "abstract": " Object Oriented Software Engineering Models in Software Industry - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Object Oriented Software Engineering Models in Software Industry SoleimanianGharehchopogh, Farhad ; Jodati Gourabi, Saman ; Maleki, Isa Abstract Publication: International Journal of Computer Applications Pub Date: June 2014 DOI: 10.5120/16573-6258 Bibcode: 2014IJCA...95c..13S full text sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian Privacy Notice Smithsonian Terms of Use NASA …", "num_citations": "5\n", "authors": ["421"]}
{"title": "A New Solution for Dynamic Travelling Salesman Problem with Hybrid Ant Colony Optimization Algorithm ‎and Chaos Theory\n", "abstract": " In this paper, a new method of optimization is proposed based on the combination of Ant Colony Optimization (ACO) and Chaos Theory to solve Dynamic Travelling Salesman Problem (DTSP). ACO algorithm has been modified in a way by using chaos theory to obtain an optimal solution to solve DTSP. By combination of both chaos theory and ACO algorithm, a hybrid algorithm is created which provided a better net to solve DTSP. In hybrid algorithm, pheromone updating rule is performed by using Logistic Map function and is non-linear which can prevent premature convergence. Features such as high precision and good convergence rate to reach best results indicate our proposed hybrid algorithm is better.", "num_citations": "5\n", "authors": ["421"]}
{"title": "A new approach for inter process communication with hybrid of message passing mechanism and event based software architecture\n", "abstract": " In this paper, we use software architecture style based on event-driven and message passing communication method and determine a framework for interaction among practicable processes on Operating System (OS). In the proposed method, the required data are sent to the process or other processes in a standard message frame and with determined structure to the OS, then, the OS distributes the received message considering its recipient processes in the system, rather a process communicates directly with other specific process. The major features of the proposed method include the synchronization among the processes, the simplicity of implementation, easy extensibility, remote access which finally can improve the interaction between the OS and processes. Along with producing the systems based on an integrated frame, we obtain a determined standard in Inter Process Communication (IPC) by mediating an OS.", "num_citations": "4\n", "authors": ["421"]}
{"title": "A New Approach in Dynamic Traveling Salesman Problem: A Hybrid of Ant Colony Optimization and ‎Descending Gradients\n", "abstract": " Nowadays swarm intelligence-based algorithms are being used widely to optimize the dynamic traveling salesman problem (DTSP). In this paper, we have used mixed method of Ant Colony Optimization (AOC) and gradient descent to optimize DTSP which differs with ACO algorithm in evaporation rate and innovative data. This approach prevents premature convergence and scape from local optimum spots and also makes it possible to find better solutions for algorithm. In this paper, we're going to offer gradient descent and ACO algorithm which in comparison to some former methods it shows that algorithm has significantly improved routes optimization.[PUBLICATION ABSTRACT]", "num_citations": "4\n", "authors": ["421"]}
{"title": "Analysis of the Fractal Koch Method in Computer Games Development\n", "abstract": " Lately according to the software and hardware progress, the development of the computer games has been so‎ much. As the development of the computer games is one of the most favorite projects of computer sciences. A requirement‎ for development of the computer games is the computer graphics programming science and the mathematical calculations. A‎ calculation method is fractal Koch which uses the selfsimilarity specifications of itself. Formation of fractals takes place by the‎ repetitions, so it is possible to transform a simple geometric shape to a more complex one and use the fractal capabilities to‎ develop and produce the computer games. So, we have tried to use the OpenGL graphic functions in VC++ 6.0 and review the‎ application of fractal Koch in development of the computer games.‎", "num_citations": "3\n", "authors": ["421"]}
{"title": "AFRP: A New Approach in Page Replacement Algorithm with Hybrid Aging and Mamdani Fuzzy Interface Algorithms\n", "abstract": " One of the applicable ways to solve memory shortage is to use virtual memory. In virtual memory technology, Operating System (OS) the less used processes are removed from memory, parts of main memory become free and it is provided entry context of new process in it. One of the main factors to increase the efficiency of virtual memory is to use page replacement algorithms. Page replacement algorithm which is operated in virtual memory techniques let the processes are performed without the need to place completely in the main memory. The major advantage of this method is that it allows processing to be larger than system main memory. By using this method, each process can be occupied less physical memory and consequently more processes can be operated simultaneously. In this paper, we propose a new hybrid algorithm based on Mamdani fuzzy inference and ageing algorithms called AFRP (Aging Fuzzy Replacement Page) in which hybrid algorithm has considerable increase in the number of inferences to disc and number of page faults.", "num_citations": "2\n", "authors": ["421"]}
{"title": "Security in Routing Protocols of Ad-Hoc Networks: A Review\n", "abstract": " The Ad-Hoc networks include wireless hosts which can be mobile, too. Necessarily, it doesn’t be used any prefabricated structure in these networks. It means that there is no substructure such as central station, router, switch and/or any other things which are used in network structure. There are only several wireless nodes which connect non-neighbour nodes using adjacent nodes. Security in Ad-Hoc networks is of high particular importance. As there are not only a lot of problems in wired networks but also security problems such as easy listening and change the information being transferred, the possibility of identity theft, lack of participation and/or destroying routing operations, inability to use encrypted key distribution infrastructures and so on are available problems. One of the main security problems is providing a secure routing protocol in these networks. In recent years, it has been done considerable effort to provide a secure routing protocol in these networks. So, we in this paper, will discuss about routing protocols which have remarkable effect on Ad-Hoc networks security to recognize security problems in routing Ad-Hoc networks using different kinds of routing protocols such as Flooding, DSR, AODV, ARAN, Ariadne, SAODV and SEAD and determine the best routing protocol in security of case protocol.", "num_citations": "2\n", "authors": ["421"]}
{"title": "Application of Hidden Markov Model in Question Answering Systems\n", "abstract": " By the increase of the volume of the saved information on web, Question Answering (QA) systems have been very important for Information Retrieval (IR). QA systems are a specialized form of information retrieval. Given a collection of documents, a Question Answering system attempts to retrieve correct answers to questions posed in natural language. Web QA system is a sample of QA systems that in this system answers retrieval from web‎ environment doing. In contrast to the databases, the saved information on web does not follow a distinct structure and are not generally defined. Web QA systems is the task of automatically answering a question posed in Natural Language Processing (NLP). NLP techniques are used in applications that make queries to databases, extract information from text, retrieve relevant documents from a collection, translate from one language to another, generate text responses, or recognize spoken words converting them into text. To find the needed information on a mass of the non-structured information we have to use techniques in which the accuracy and retrieval factors are implemented well. In this paper in order to well IR in web environment, The QA system in designed and also implemented based on the Hidden Markov Model (HMM)", "num_citations": "1\n", "authors": ["421"]}