{"title": "Racial and ethnic achievement gap trends: Reversing the progress toward equity?\n", "abstract": " Racial and ethnic achievement gaps narrowed substantially in the 1970s and 1980s. As some of the gaps widened in the 1990s, there were some setbacks in the progress the nation made toward racial and ethnic equity. This article offers a look below the surface at Black-White and Hispanic-White achievement gap trends over the past 30 years. The literature review and data analysis identify the key factors that seem to have contributed to bifurcated patterns in achievement gaps. The conventional measures of socioeconomic and family conditions, youth culture and student behavior, and schooling conditions and practices might account for some of the achievement gap trends for a limited time period or for a particular racial and ethnic group. However, they do not fully capture the variations. This preliminary analysis of covariations in racial and ethnic gap patterns across several large data sets has implications for …", "num_citations": "1255\n", "authors": ["1045"]}
{"title": "Tracking achievement gaps and assessing the impact of NCLB on the gaps\n", "abstract": " The author is very grateful to numerous individuals for their assistance with this report. Special thanks go to Gail Sunderman and Gary Orfield who contributed greatly to reviewing and editing this report. I am also very grateful to external reviewers, Doug Harris, Gene Glass, and Robert Linn who provided invaluable comments and suggestions on an earlier draft. I would also like to thank members of the Civil Rights Project’s administrative team, including Jennifer Blatz and Lori Kelley who helped with the production of the report. Finally, I would like to acknowledge the contributions of research assistants, Jie Wang and Jeff Fox, for their help with data collection and analysis.", "num_citations": "550\n", "authors": ["1045"]}
{"title": "The impact of accountability on racial and socioeconomic equity: Considering both school resources and achievement outcomes\n", "abstract": " This article examines whether performance-driven educational accountability policy enhances or hinders equity. Combining data from state policy surveys, F-33, SASS, and NAEP, the article shows that during the 1990s, the states did not address racial and socioeconomic disparities in school resources and failed to narrow the achievement gaps among racial and socioeconomic groups. The distributions of school expenditures, class size, qualified teachers, and mathematics achievement remained largely unchanged in strong accountability states. Although the accountability policy of the 1990s neither produced adverse effects nor brought about significant setbacks in equity, this article suggests that racial and socioeconomic equity were not at the center of accountability reforms and that performance-driven accountability policies alone cannot move us forward toward equity.", "num_citations": "361\n", "authors": ["1045"]}
{"title": "Revisiting the impact of NCLB high-stakes school accountability, capacity, and resources: State NAEP 1990–2009 reading and math achievement gaps and trends\n", "abstract": " This study examines the impact of high-stakes school accountability, capacity, and resources under NCLB on reading and math achievement outcomes through comparative interrupted time-series analyses of 1990–2009 NAEP state assessment data. Through hierarchical linear modeling latent variable regression with inverse probability of treatment weighting, the study addresses pre-NCLB differences in state characteristics and trends to account for variations in post-NCLB gains. While the states’ progress was uneven among different grades, subjects, and subgroups, NCLB did not yet evidence sustainable and generalizable high-stakes accountability policy effects. Improving average achievement as well as narrowing achievement gaps was associated with long-term statewide instructional capacity and teacher resources rather than short-term NCLB implementation fidelity, rigor of standards, and state agency’s …", "num_citations": "277\n", "authors": ["1045"]}
{"title": "Is test-driven external accountability effective? Synthesizing the evidence from cross-state causal-comparative and correlational studies\n", "abstract": " In the midst of keen controversies on the impact of high-stakes testing and test-driven external accountability policy, the more balanced and careful selection, interpretation, and use of scientific research evidence are crucial. This article offers a critical synthesis of cross-state causal-comparative and correlational studies that explored the effects of test-driven external accountability policies on reading and math achievement. A meta-analysis of 76 effect-size estimates from 14 selected studies showed a modestly positive effect on average but no significant effect on the racial achievement gap. Nevertheless, this review calls for further evidence on the policy-outcome linkage, revealing limitations, uncertainties, and inconsistencies in many findings. The author explores variations among the studies in terms of independent and dependent variables, analytical samples and methods, and the reporting of statistical and …", "num_citations": "232\n", "authors": ["1045"]}
{"title": "Multiple facets of inequity in racial and ethnic achievement gaps\n", "abstract": " This article provides a critical look into national trends of the achievement gaps between Whites and Blacks and between Whites and Hispanics over the last 3 decades based on the National Assessment of Educational Progress mathematics assessments. It examines multiple facets of inequity underlying the racial and ethnic achievement gaps from 3 perspectives: equality, adequacy, and reciprocity. Although the Black-White and Hispanic-White mathematics achievement gaps narrowed significantly over the last 3 decades, there was some setback in the national progress during the last decade and the achievement gaps remain substantially large. The study finds that the racial and ethnic achievement gaps are highly inequitable, as it turns out that schools do not measure up to essential conditions of equity: Minority students do not (a) get fairly equal educational opportunities, (b) achieve minimally adequate level …", "num_citations": "191\n", "authors": ["1045"]}
{"title": "College for all: Gaps between desirable and actual P–12 math achievement trajectories for college readiness\n", "abstract": " This study addresses missing links in “college for all” debates by investigating gaps between actual and desirable math achievement trajectories for students’ college readiness. Linking multiple national data sets across P–16 education levels, the study estimates college readiness benchmarks separately for two-year and four-year college entrance and completion. The goals of the study are to compare performance standards, benchmarks, and norms for college readiness and to assess college readiness gaps among all students as well as gaps among racial and social subgroups. The results suggest that entrance into and completion of two-year versus four-year colleges require substantially different levels of math achievement in earlier education periods and that meeting national versus state proficiency standards leads to differences in postsecondary education outcomes and can mean the difference between …", "num_citations": "164\n", "authors": ["1045"]}
{"title": "Two worlds of private tutoring: The prevalence and causes of after-school mathematics tutoring in Korea and the United States\n", "abstract": " Objective:The objective of this study is to describe variations in the prevalence and causes of private tutoring around the world and to understand the differences between Korea and the United States in terms of their unique needs for private tutoring and policy responses. It helps better understand the phenomenon of private tutoring more broadly as both an individual and a collective choice by accounting for its variations within and between countries.Research Design:This study draws on secondary analysis of the 1995 Third International Math and Science Study (TIMSS) eighth-grade student and teacher survey databases that provide information on participation in after-school math private tutoring from 41 countries, including Korea and the United States. In addition, data from United Nations Educational, Scientific and Cultural Organization (UNESCO) yearbook are analyzed for information on the status of public …", "num_citations": "106\n", "authors": ["1045"]}
{"title": "Tripartite growth trajectories of reading and math achievement: Tracking national academic progress at primary, middle, and high school levels\n", "abstract": " This study examines trends in American students’ growth trajectories in reading and math achievement over the past three decades. Drawing upon multiple sources of national assessment data, cohort analyses provide new evidence on the stability and change of national academic growth curves. The emerging trends imply a tripartite pattern where American students are gaining ground at the pre/early primary school level, holding ground at the middle school level, and losing ground at the high school level. National progress in reading and math achievement at the pre/early primary school level appears to be offset by declines at the high school level. The study discusses the limitations and challenges of tracking academic growth trajectories across all different levels of education over the long term. It also calls for national P-16 education policy and research efforts toward sustainable academic growth and …", "num_citations": "104\n", "authors": ["1045"]}
{"title": "Interstate variation in the mathematics achievement of rural and nonrural students\n", "abstract": " This study challenges our monolithic view of rural education through a systematic analysis comparing'rura! and nonrural student achievement and schooling conditions in the nation and states participating in the 1992 and 1996 NAEP eighth grade mathematics assessments. The results show that while rural and nonrural students had comparable levels of math achievement in 1992, by 1996 rural students overall had begun to outperform their nonrural counterparts. However, the achievement gaps varied considerablyfrom state to state, with rural students performing significantly better in some states and significantly poorer in others. The differences and gains appear to be explained by variance in a broad range ofschoolingfactors (instructional resources, advanced course offerings, progressive instruction, professional training, safe/orderly climate, collective support). The results have important implications for comprehensive school reform efforts as we attempt to improve education for all our students, particularly those in our rural schools.Rural student achievement provides one important barometer for monitoring national progress in public education. Rural education often has been discussed as a deficit model ofinstruction from which relatively low outcomes can be expected (Edington & Koehler, 1987). While this perspective has been reinforced by some local studies, it is not supported by national data (Fan & Chen, 1999; Lee & McIntire, 1999; Stem, 1994). National Assessment ofEducational Progress (NAEP) assessment scores for students in\" Extreme Rural\" settings have risen in the last decade, and they approximate national means (NCES …", "num_citations": "98\n", "authors": ["1045"]}
{"title": "Policy Variation among Japan, Korea, England and the United States\n", "abstract": " School reform initiatives during the last two decades in Japan, Korea, England, and the United States can be understood as balancing acts. Because policymakers in England and the United States saw their school systems fragmented and student outcomes mediocre, they focused reform efforts on raising educational standards, tightening curriculum and assessment, and improving academic achievement. In contrast, policymakers in Japan and Korea, who saw their school systems overstandardized and educational processes deficient, focused their reform efforts on deregulating schools, diversifying curriculum and assessment, and enhancing whole-person education. While school reform policies were formulated and adopted in response to each countrys unique problems, they also were driven by globalization forces that fostered an international perspective. If implemented successfully, such cross-cultural policy …", "num_citations": "73\n", "authors": ["1045"]}
{"title": "Educational equity and adequacy for disadvantaged minority students: School and teacher resource gaps toward national mathematics proficiency standard\n", "abstract": " This study addresses the issue of educational inadequacy and inequity for disadvantaged minority students. It estimates desired national standards and examines interrelated gaps in key school–teacher resources and mathematics achievement by linking national education data sets (National Assessment of Educational Progress [NAEP], Common Core of Data, and Schools and Staffing Survey). Although poor minority students’ chances to meet the national mathematics proficiency standard are undermined by the lack of their access to qualified teachers and adequate school funding, it turns out that the adequacy-based (absolute) gaps are much larger than the equity-based (relative) gaps. Meeting the NAEP Grade 8 mathematics proficiency standard requires substantial increases in per-pupil education spending (from $6,493 to $7,197 in year 2000 dollars) and in-field mathematics teaching rate (from 49% to 91 …", "num_citations": "65\n", "authors": ["1045"]}
{"title": "Trick or treat: New ecology of education accountability system in the USA\n", "abstract": " This study tracks American states’ policy choices under the No Child Left Behind Act and explores their consequences for student achievement. Using the path analysis of relationships among state‐level policy input, context, and outcome variables, the study portrays a Halloween‐like ‘trick‐or‐treating’ game between the federal and state governments in the new ecology of the test‐driven education accountability system. States that chose the ‘trick’ path with a calculative policy negotiation and manipulation strategy made significant gains on their own state assessments but not on the national assessment. In contrast, states that followed the ‘treat’ path with a faithful policy implementation for funding strategy have not yet brought about significant gains on either the national or state assessments. The first‐generation accountability states with a prior history of high‐stakes testing tended to employ both strategies at the …", "num_citations": "61\n", "authors": ["1045"]}
{"title": "State policy correlates of the achievement gap among racial and social groups\n", "abstract": " The 1980s have been characterized as a period of state education reform in the United States (Fuhrman, 1988; Murphy, 1990). As an increasing number of states have enacted policies that promote high standards for all students, a tension has arisen between the belief that all students should have access to a set of core curricula, and the challenge of responding to differences among students and their schools by providing them with different resources. On the one hand, states’ inability to accommodate student differences in readiness for learning as well as school differences in instructional capacity could widen rather than narrow the existing learning gaps. On the other hand, such accommodation, if made improperly, could itself result in substantially unequal opportunities for disadvantaged minority students and their schools. Thus, a major policy question is whether state education policies can address inequity …", "num_citations": "61\n", "authors": ["1045"]}
{"title": "How feasible is adequate yearly progress (AYP)? Simulations of school AYP\" uniform averaging\" and\" safe harbor\" under the No Child Left Behind Act\n", "abstract": " The No Child Left Behind Act of 2001 (NCLB) requires that schools make “adequate yearly progress”(AYP) towards the goal of having 100 percent of their students become proficient by year 2013-14. Through simulation analyses of Maine and Kentucky school performance data collected during the 1990s, this study investigates how feasible schools would have met the AYP targets if the mandate had been applied in the past with “uniform averaging (rolling averages)” and “safe harbor” options that have potential to help reduce the number of schools needing improvement or corrective action. Contrary to some expectations, the applications of both options would do little to reduce the risk of massive school failure due to unreasonably high AYP targets for all student groups. Implications of the results for the NCLB school accountability system and possible ways to make the current AYP more feasible and fair are …", "num_citations": "57\n", "authors": ["1045"]}
{"title": "Interstate variations in rural student achievement and schooling conditions\n", "abstract": " DIGEST Educational Resources Information Center ural student achievement provides one important barometer for monitoring national progress in public education. Rural education often has been discussed as a deficit model of instruction from which relatively low outcomes can be expected (Edington & Koehler, 1987). While this perspective has been reinforced by some local studies, it is not supported by national data (Fan & Chen, 1999; Lee & McIntire, 1999; Stern, 1994). At the same time, aggregate national data conceal that the achievement of rural students varies significantly from state to state (Lee & McIntire, 2001). This Digest reviews research on the status of rural student achievement and schooling conditions and describes their variations across the nation and the states. It examines (1) national trends and interstate variations in rural student achievement,(2) rural schooling conditions affecting achievement,(3) interstate variations in rural school conditions, and (4) the challenge of determining “what works” in rural schooling.", "num_citations": "53\n", "authors": ["1045"]}
{"title": "Understanding Rural Student Achievement: Identifying Instructional and Organizational Differences between Rural and Nonrural Schools.\n", "abstract": " National math assessment data from 3,112 eighth-grade students in 123 schools were used to determine whether location (rural versus nonrural) affects student achievement when related student and school-level factors are taken into account. Findings indicate that rural schools outperformed nonrural schools in math achievement and that the competitive edge of rural schools arose from school effects beyond the influences of school composition and individual student characteristics. Rural schools tended to have a better organizational context (teacher training, safe/orderly climate, collective support) conducive to higher performance, but suffered from poor instructional conditions (in terms of classroom resources, advanced courses, and progressive instruction), which balanced out achievement gains. Rural schools should capitalize on existing organizational and contextual strengths and also focus more effort on improving curricular and instructional weaknesses. Given that many rural students are poor and attend schools whose instructional resources and course offerings are limited, the level of their academic performance relative to their nonrural counterparts is encouraging. This study shows that rural schools can provide a model of strength worth studying and emulating. Contains 20 references and hierarchical linear regression formulas.(Author/TD)", "num_citations": "53\n", "authors": ["1045"]}
{"title": "Is the Common Core racing America to the top? Tracking changes in state standards, school practices, and student achievement\n", "abstract": " This study examines the trends of the US states’ reading and math proficiency standards before and after the adoption of the Common Core State Standards (CCSS) and explores their impact on school practices and student achievement. Drawing on the 2003-15 National Assessment of Educational Progress (NAEP) grades 4 and 8 assessment and survey datasets, the study gives new insights into the CCSS policy challenges and outcomes. The states that adopted CCSS raised the rigor of proficiency standards for their student assessments, reversing ‘race to the bottom’trend during the earlier period of the No Child Left Behind Act (NCLB). However, the CCSS states failed to improve schools’ alignment of ELA and math programs with state/district assessments and also failed to improve students’ reading and math achievement more than the non-CCSS counterparts. The Common Core has helped America race to …", "num_citations": "48\n", "authors": ["1045"]}
{"title": "The Testing Gap: Scientific Trials of TestDriven School Accountability Systems for Excellence and Equity\n", "abstract": " The objective of this book is to advance our understanding of the design, implementation and evaluation of testdriven external accountability policies for improving both academic excellence and equity. This book provides new insights into debates about the efficacy of highstakes testing through critical synthesis of previous studies and through systematic analysis of the achievement gap trends over the past 15 years. The core findings have implications for contemporary national and state policy efforts, as mandated by NCLB, to close the achievement gap. The book alerts readers to scientific, institutional and technical threats to the current testdriven school accountability system, and possible consequences if we fail to counteract those threats and continue the current policy course with underfunded mandates and an overreliance on testing and sanctions.", "num_citations": "45\n", "authors": ["1045"]}
{"title": "State activism in education reform: Applying the Rasch model to measure trends and examine policy coherence\n", "abstract": " Given state activism in education reform during the 1980s, the central questions are whether the reform movement changed over time and how each state responded differently to education policy issues. This study not only attempts to examine empirical regularities in state education policy-making using the Rasch measurement method, but also to explain interstate variation in reform activism. Measuring 50 states and calibrating 43 policies show a change in the picture of state leadership and a generalized pattern of policy-making among the states. It sheds light on the possibility of applying item response theory to policy analysis.", "num_citations": "41\n", "authors": ["1045"]}
{"title": "Growth rates in running speed and vertical jumping by boys and girls ages 11–13\n", "abstract": " This study examined growth rates in running speed and vertical jump among middle school children. 45 boys and 31 girls ages 11–13 years were tested on running speed and vertical jump three times (September, February, and May) during the school year. Hierarchical linear modeling was used to estimate initial status and growth rates for the entire sample (base model) and the association of running and vertical jump with height, weight, and sex (conditional model). Positive overall growth rates were found for both running speed and vertical jump. Increased height and weight at the time of measurement were not significantly associated with growth rate for running. The growth rate for vertical jump was positively associated with height but unrelated to increased weight. Boys showed steeper growth rates than girls in jumping. No sex differences were found in running speed for either initial status or growth rate …", "num_citations": "37\n", "authors": ["1045"]}
{"title": "Input-guarantee versus performance-guarantee approaches to school accountability: Cross-state comparisons of policies, resources, and outcomes\n", "abstract": " States' policy approaches to accountability tend to divide between a primary emphasis on input guarantees and a primary emphasis on performance guarantees. In the midst of keen controversies about the impact of high-stakes testing under the No Child Left Behind Act, this article examines separate and joint effects of input-guarantee versus performance-guarantee policies on reading and math achievement. Combining data from state policy surveys, the School District Finance Survey (F-33), and the Schools and Staffing Survey, the study examines 50 states' activism in test-driven external accountability policies and their support for key school resources (per-pupil spending, class size, in-field teaching). The school resources factor is not correlated with the accountability policy factor at the state level, implying that high-stakes testing pressure was not balanced with school support. Further, hierarchical linear growth …", "num_citations": "36\n", "authors": ["1045"]}
{"title": "Multilevel Linkages Between State Standards, Teacher Standards, and Student Achievement: Testing External Versus Internal Standards-Based Education Models\n", "abstract": " Drawing on national and state assessment datasets in reading and math, this study tested “external” versus “internal” standards-based education models. The goal was to understand whether and how student performance standards work in multilayered school systems under No Child Left Behind Act of 2001 (NCLB). Under the “external” model, states’ common standards shape teachers’ standards which, in turn, affect student achievement. Under the “internal” model, teacher standards are insulated from state standards but instead influenced by prior student achievement and background characteristics in classrooms. The study employed multilevel analysis and instrumental variable analysis with fixed effects. Findings provided support for the internal as opposed to the external model. The linkage between state standards and teacher standards was tenuous, whereas the linkage between teacher standards and …", "num_citations": "35\n", "authors": ["1045"]}
{"title": "Bringing together reading and writing: An experimental study of writing intensive reading comprehension in low‐performing urban elementary schools\n", "abstract": " This study examined the hypothesis that assisted writing during reading improves reading comprehension. The hypothesis was derived from sociocognitive and constructivist theory and research and implemented in the form of a curricular intervention called Writing Intensive Reading Comprehension after its main feature of bringing together reading comprehension and writing. The study used instruction with interactive thinksheets to provide sustained, focused, and assisted writing experiences to help students in low‐performing urban schools construct understandings of their reading. The study used a cluster randomized trial design. Results support the hypothesis that bringing together reading and writing through instruction using thinksheets produces levels of reading comprehension superior to traditional instruction. Hierarchical linear modeling analyses of pretest and posttest data from 1,062 fourth‐ and fifth …", "num_citations": "34\n", "authors": ["1045"]}
{"title": "The anatomy of achievement gaps: Why and how American education is losing (but can still win) the war on underachievement\n", "abstract": " The Anatomy of Achievement Gaps offers a critical analysis of underachievement problems in American education from interdisciplinary, international, and systems perspectives. The book has several aims: to build a new model of achievement gap research and policy; to provide evidence on the state and alterability of achievement gaps; to synthesize separate lines of domestic and international achievement gap research; and to evaluate and inform American P-16 (pre-school through college) education policies. In light of socioeconomic changes and educational paradigm shifts, Jaekyung Lee extends the scope of analysis from a K-12 to a P-16 education pipeline and from domestic racial/social groups to international groups, with focus on the case of South Korea. Through multilevel and longitudinal analyses of US national and international datasets, The Anatomy of Achievement Gaps provides new evidence on the status and trends of achievement gaps, causes of these gaps, and the effects of policy interventions. In an effort to evaluate the nation's strengths and weaknesses across the P-16 education pipeline, it draws upon a wide range of educational data sources and indicators. Featuring cross-cultural perspectives beyond the US, Lee reframes achievement gap and educational accountability issues.", "num_citations": "30\n", "authors": ["1045"]}
{"title": "Evaluating the impact of NCLB school interventions in New York State: Does one size fit all?\n", "abstract": " This study examines the efficacy and moderators of New York State interventions for schools in need of improvement under NCLB, including:(1) school transfer,(2) supplementary education service (3) corrective action,(4) planning for restructuring, and (5) restructuring. Despite the fact that schools in increasingly aggressive treatment groups had higher performance gains relative to schools in good standing, propensity score matching analysis results reveal negative or null effects of the interventions. There are indications of treatment effect heterogeneity and the effects varied by the year of implementation and the propensity of treatment assignment (schooling conditions prior to interventions). The findings of our study have implications for both theory of action and program implementation.", "num_citations": "29\n", "authors": ["1045"]}
{"title": "Do American and Korean education systems converge? Tracking school reform policies and outcomes in Korea and the USA\n", "abstract": " This study examines key school reform policies and outcomes of the USA and Korea over the past three decades from comparative perspectives. Since the two nations’ unique educational problems brought divergent educational reform paths—standardization versus differentiation, high-stakes testing versus individualized assessment, and centralization versus decentralization—the study tracks international policy benchmarking efforts and potential impact on educational convergence. The study employs mixed methods, including the content analysis of research and media documents and the trend analysis of TIMSS and PISA datasets. The results indicate that, despite significant changes in policy discourse, the gaps between Korea and the USA in student math achievement and school climates did not narrow. The policy lessons from these cases and the issues of international education benchmarking …", "num_citations": "28\n", "authors": ["1045"]}
{"title": "Which type of high school maximizes students’ college match? Unequal pathways to postsecondary destinations for students from varying high school settings\n", "abstract": " Through multilevel analyses of Educational Longitudinal Study and National Center for Education Statistics (NCES)-Barron’s data sets, this study examined unequal chances for college enrollment for students from different high school types and locations. The study shows that students from more privileged high school sectors are able to maximize attendance at better academically matched colleges and that the structural type and location of high school both as hierarchically ranked and as providing varied opportunities and norms are key factors in college matching. The problem of undermatching is more prevalent among students in urban public open schools, suburban disadvantaged public schools, and rural schools. In contrast, students in urban magnet test-in schools, suburban advantaged public schools, Catholic schools, and independent private schools exhibit markedly better patterns of college matching …", "num_citations": "26\n", "authors": ["1045"]}
{"title": "International and interstate gaps in value-added math achievement: Multilevel instrumental variable analysis of age effect and grade effect\n", "abstract": " Merging National Assessment of Educational Progress and Trends in International Math and Science Study math data, this study examines the extent and sources of variation in value-added academic growth patterns among different nations and U.S. states. Applying hierarchical linear models with an instrumental variable method, the study disentangles age effect and grade effect on growth and accounts for both international and interstate variations. Math achievement gains between grades 4 and 8 are significant with positive age and grade effects and negative age-by-grade interaction. The study finds convergence of the age effect and divergence of the grade effect among the nations and states. While the Unites States lags further behind East Asian nations in math achievement during middle school years, a few of the U.S. states match East Asian gains. The initial or widening gap between the U.S. states and …", "num_citations": "26\n", "authors": ["1045"]}
{"title": "Do national and state assessments converge for educational accountability? A meta-analytic synthesis of multiple measures in Maine and Kentucky\n", "abstract": " Given the policy imperative of using multiple measures for state education accountability under the No Child Left Behind Act (NCLB), this study examines similarities and discrepancies between the National Assessment of Educational Progress (NAEP) and the states' own math assessment results in Kentucky and Maine, with a focus on 3 major academic performance indicators: proficiency level, achievement gap, and achievement gain. Using meta-analytic techniques, the study synthesizes multiple measures from the two states over the periods of 1992–1996 and 2000–2003. It pinpoints the areas and degrees of the discrepancies and explores contributing factors. It also reports emerging convergence of the NAEP and state assessments under the NCLB.", "num_citations": "26\n", "authors": ["1045"]}
{"title": "Should America be more like them? Cross-national high school achievement and US policy\n", "abstract": " The modern comprehensive American high school, since its inception in the early twentieth century, has been considered alternately an organizational blessing and a bane on educational progress. Welcomed as an organizational advance through which the hodgepodge of schools in urban America could be made into an orderly pedagogical and administrative pyramid, the early modern high school was seen as an educa tional institution meeting the social and economic challenges of an increas ingly diverse industrial-urban society. 1 The image of a rational, bureau cratic, large, and robust comprehensive high school was pushed forward through the middle of the twentieth century as a progressive and moderniz ing model for the entire nation. 2 However, by the second half of the century, as evidence of social decline, persistent poverty, racial disparities, and edu cational failure in urban communities became …", "num_citations": "26\n", "authors": ["1045"]}
{"title": "College readiness and engagement gaps between domestic and international students: Re-envisioning educational diversity and equity for global campus\n", "abstract": " This study examines undergraduate students’ college readiness and educational engagement gaps in a US public research university. The study reveals the heterogeneity of domestic (American) and international student groups. While typical international students may have disadvantages in college readiness and engagement, English speakers and American high schoolers among international students perform even better than domestic peers. In contrast, English learners and foreign high schoolers among domestic students, such as recent immigrants face the same challenges as typical international peers lacking adequate language and cultural preparation for college success. The study re-envisions educational diversity and equity for global campus where an integrated system of academic and sociocultural support enables transnational students to succeed.", "num_citations": "23\n", "authors": ["1045"]}
{"title": "Dual standards of school performance and funding? Empirical searches of school funding adequacy in Kentucky and Maine\n", "abstract": " This study examines potential consequences of the discrepancies between national and state performance standards for school funding in Kentucky and Maine. Applying the successful schools observation method and cost function analysis method to integrated data‐sets that match schools’ eight‐grade mathematics test performance measures to district funding, this study conducts empirical searches for adequate instructional expenditures per pupil to meet desired proficiency targets on national versus state assessments. While Kentucky (high‐stakes testing state) had a lower performance standard than Maine (low‐stakes testing state), this study reveals a relatively lower level of school funding adequacy and a weaker relationship between school expenditures and performance for Kentucky than for Maine. The study suggests that state educational accountability systems and policies may influence the level of …", "num_citations": "20\n", "authors": ["1045"]}
{"title": "Evaluating rural progress in mathematics achievement: Threats to the validity of “Adequate Yearly Progress.”\n", "abstract": " This article examines major threats to the I'alidil.\\'u/Adeljlwte Yeurfl'Pmgl'l.'. u (AYP/in the context ofrural schools. Although I1I1'al students and their schools made, iKlIIfinml academic progress ill thera. ft Oil national andstate a sscssmems. the C/lrrellt ROlli ofAYPIUrn, 0/11 to be highfv unrealisticfor them unlessstates setJill'lower achievement levels than those ofthe nationalassessment,, V,.. fEr The curre llt estimate ofschool A YP I1lt'tl.\\'ure. 1 also furn. I'out to he highf.'unreliable [ar. m\"'''. rurulschuals, and/Ising (III uniform (l\\'eraj.! inK procedure with mlliliple years ofdata would han'ol/f\\\" limited ef-fects on stabilizing the measures. Filil/lfl', the current AYP/ilrmll/\" that. W!/. S a uniform performance! tuXt'tfort'1'e,:\\-'school regardless ofits initial performance status can unduiv overtdentifv disadvantaged r ural schools ill fln, d ofimprovement Poticv implications ofthefindings andpossible ways to control those threats tin'discussed, The No Child Left RehindAct (NCLlI) req uires standards-based accountability for school districts and schools receiving Title I funds. The intent of this law is to assure that all public schools accomplish academ ic excellence for all students. One major component of this accountability policy is to evaluate whether the districts and schools in each state are making\" adequate yearly progress\"(AYP) based on academi c performance goals set by the state, This requirement app lies to not only the entire body of stude nts in each school but also to every subgroup of its studen ts as broken down by their major demographic characteristics such as racc/cthnicity and poverty What makes rural schools unique for evaluating their AYP? Research …", "num_citations": "20\n", "authors": ["1045"]}
{"title": "Missing Links in International Education Studies: Can We Compare the US with East Asian Countries in the TIMSS? 3 (18)\n", "abstract": " The initial findings from the TIMSS strongly suggest that substantial differences in the quality of curriculum and instruction account for the learning gap between the US and East Asian countries, particularly Japan. First of all, the exclusive focus on formal schooling may ignore the supplementary function of informal education. At the same time, the exclusive attention to national comparisons may obscure the size of local variation in different countries. Finally, the exclusive concern with the current status of educational practices and outcomes may detract our attention from an examination of dynamic changes in each country. Implications for international education studies and policies are discussed.", "num_citations": "18\n", "authors": ["1045"]}
{"title": "Two takes on the impact of NCLB on academic improvement: Tracking state proficiency trends through NAEP versus state assessments\n", "abstract": " The No Child Left Behind (NCLB) Act of 2001 requires yearly progress of all groups of students toward the goal of 100 percent proﬁciency by 2014. To understand whether NCLB is working as intended to improve student achievement in reading and math, this chapter compares pre-NCLB", "num_citations": "17\n", "authors": ["1045"]}
{"title": "Is “whole child” education obsolete? Public school principals’ educational goal priorities in the era of accountability\n", "abstract": " Objectives: Working under the constraints of external accountability policy, public school principals are faced with challenges in prioritizing educational goals. Using the Schools and Staffing Survey (SASS) data sets, this study examined the nature and sources of changes in principals’ educational goal priorities in the era of accountability, including the No Child Left Behind Act (NCLB). Method: Difference-in-differences method was used to compare the national average trends of educational goal priorities between public and private schools during 1991–2012 period. Comparative interrupted time series method was also used to explore the impact of NCLB accountability policy on those trends across 50 states. At the school level, logistic regression was applied to examine the effect of NCLB Adequate Yearly Progress status on principals’ educational priorities. Results: While academic goals gained traction over the …", "num_citations": "14\n", "authors": ["1045"]}
{"title": "Does the Asian Catch-Up Model of World-Class Universities Work? Revisiting the Zero-Sum Game of Global University Rankings and Government Policies.\n", "abstract": " This study examines international brain race for world-class universities as measured by the QS World University Rankings (QS) and the Academic Ranking of World Universities, particularly in the context of Asian nations' institutional competition and benchmarking against American counterparts. Applying mixed methods with statistical analysis of time-series data from 59 nations and case study of four selected nations, the study examines the cross-national trends of global university rankings and the roles of government policies during the era of performance-driven accountability in higher education. Tracking the zero-sum game of global university rankings over the past decade, the study accounts for key driving factors that produced divergent trajectories among the nations: how and why the USA as established leader and Japan as early catch-up leader become losers, whereas China and Korea as fast followers become winners? Although the Asian catch-up model of world-class university development, high-stakes institutional competitions and targeted funding with STEM priorities contributed to their rapid growth of research productivity and rankings, it reveals major limitations and problems. Drawing cross-national lessons and implications, we discuss new directions of higher education policies and global university ranking measures.", "num_citations": "13\n", "authors": ["1045"]}
{"title": "Using multiple measures to evaluate the performance of students and schools: Learning from the cases of Kentucky and Maine\n", "abstract": " Evaluation of systemic school reform requires a systemic approach to data collection and analysis. The National Science Foundation’s Statewide Systemic Initiatives (SSI), comprehensive state policies aimed at broad student populations, consider the effects of change on the total school system over a sufficient period of time, and thus are distinctive in terms of the scale and nature of programs. We need to identify and fill the gaps between currently available data and methods and desired ones in assessing and understanding the performance of SSI states. We selected two SSI states, Kentucky and Maine, to explore two research questions:First, what information is available on the academic performance of state education systems? While there are several ways to measure academic performance, we chose to focus on student achievement in mathematics. We examined whether and how the current national and …", "num_citations": "12\n", "authors": ["1045"]}
{"title": "The impact of content-driven state education reform on instruction\n", "abstract": " This study analyzes survey-based information on state policies and school practices together to explore the impact of content-driven state education reform on instruction in middle grade mathematics. Content-driven reform focuses on developing challenging curriculum frameworks and linking student assessments and textbook selection to the frameworks. At the same time, student-centered instructional practices with a strong emphasis on higher-order thinking skills are considered positive signs of the policy implementation. The study finds that content-driven state policies have great influences on instruction at the school level, and are associated with desired instructional practices at the classroom level. Further, the cases of California and Minnesota indicate that content-driven reform brings about greater impact on instruction than does outcome-based reform. But current state curriculum frameworks remain to be …", "num_citations": "11\n", "authors": ["1045"]}
{"title": "Time-indexed effect size for educational research and evaluation: Reinterpreting program effects and achievement gaps in K–12 reading and math\n", "abstract": " Through a synthesis of test publisher norms and national longitudinal data sets, this study provides new national norms of academic growth in K–12 reading and math to help reinterpret conventional effect sizes in time units. We propose d΄, a time-indexed–effect-size metric to estimate how long it would take for an “untreated” control group to reach the treatment group outcome in terms familiar to educators—years/months of schooling. It serves as a supplement to conventional effect-size metrics, such as Cohen's d, by taking into account different amounts of time needed for learning at different ages or grade levels. Through applications to Project STAR small class effects and NAEP racial achievement gaps, we demonstrate how to interpret and use d΄. It is expected to provide a more developmentally appropriate context for interpreting the size of an effect, a step toward bridging the gap between educational research …", "num_citations": "10\n", "authors": ["1045"]}
{"title": "Can Reducing School Segregation Close the Achievement Gap?\n", "abstract": " One of the often debated arguments regarding desegregated schools has been how racially diverse schools affect student achievement (see Hawley, in this volume). There has been much less attention paid to how segregation within schools might also affect student achievement (see Mickelson, 2005). At a time when school resegregation threatens to reduce the number of racially diverse schools, demonstrating the academic benefits—as well as other benefits—that accrue to students in racially heterogeneous schools and classrooms is a likely prerequisite to devising policies to stem this resegregating trend. Thus, at a time when many educational policies are focused on trying to narrow the racial achievement gap, it is worth analyzing the relationship between school and classroom racial composition and the achievement gap.Racial desegregation and equalization efforts since Brown v. Board of Education of Topeka (1954) can be grouped into three general categories (W. E Tate, Ladson-Billings, & Grant, 1996; Weiler, 1998). The first efforts were to eliminate physical segregation of Blacks and Whites between schools; these have seen some success, particularly in the South, where school systems were required to eliminate the vestiges of prior legal segregation. However, there have been recent setbacks in that progress, along with increasing resegregation (Boger & G. Orfield, 2005; Frankenberg, C. Lee, & G. Orfield, 2003; G. Orfield & Yun, 1999). The second category of efforts, the elimination of inequities within schools, has been slow to occur. In mixed-race schools, students of color are often placed", "num_citations": "10\n", "authors": ["1045"]}
{"title": "Evaluating the effectiveness of instructional resource allocation and use: IRT and HLM analysis of NAEP teacher survey and student assessment data\n", "abstract": " A large body of research, conducted over three decades following the Coleman report (1966), has failed to find a systematic relationship between school resources and student achievement (Hanushek, 1997). The so-called\" education production function\" studies, relied on readily measurable indicators of school resources (ie, per pupil expenditures, teacher salary, library resources) but failed to account fully for key aspects of schooling processes that affect student outcomes. On the other hand, another branch of research, ie, the so-called\" effective schools\" studies, found that desirable instructional practices (ie, clear goals and high expectations, opportunity to learn, monitoring student progress) enhance student achievement (Lee, Bryk, & Smith, 1993; Purkey & Smith, 1983). These case-studies sought to identify elusive aspects of effective school context and process but failed to provide generalizable information on required resources as a sufficient base for policy making (Monk, 1992). Needs for filling the knowledge gap concerning educational production function become more pressing as more state policymakers consider and adopt outcome-based school funding. While concerns in school finance reform shifted from equity to adequacy (Clune, 1994; Ladd, Chalk, & Hansen, 1999), it is not clear how states will accomplish this new goal. This necessitates an empirical search for what is an\" adequate\" level of instructional resources and practices. While several different methods have been proposed to set adequacy benchmarks for school funding and resource measures, every approach has limitations and thus the results should be interpreted …", "num_citations": "10\n", "authors": ["1045"]}
{"title": "Missing Links in International Education Studies: Comparing the US with East Asian Countries in TIMSS.\n", "abstract": " ABSTRACT The Third International Mathematics and Science Study (TIMSS) is the largest, most comprehensive, and most rigorous international comparison of education ever undertaken. TIMSS findings show similarities and differences in the processes and outcomes of schooling between the United States and East Asian countries, particularly Japan. This report reviews the initial findings from the TIMSS eighth-grade report, with a special focus on the United States and Japan, and discusses missing or incomplete links in international education studies. The initial findings highlight similarities between students' learning experiences at home and critical differences between those at school. These patterns imply that Japanese and US students do not differ in out-of-school learning experiences, but there are differences neglected in TIMSS highlights, such as private tutoring. On the other hand, TIMSS researchers found substantial differences in the content and process of instruction at school and differences in instructional organization. While initial TIMSS findings show that the United States is still far from achieving the national goal of being first in the world in mathematics and science, these aggregate national patterns ignore the enormous local variation in the US It is not clear whether federated countries like the United States are really comparable to other countries. For a valid comparison of the United States with highly centralized East Asian countries, it is suggested that the American states be treated as comparable national units. For a reliable comparison of the countries over time, it is suggested that current practices and outcomes be …", "num_citations": "9\n", "authors": ["1045"]}
{"title": "Throwing development by children in grades K-8: A multi-cohort longitudinal study\n", "abstract": " It has long been evident that child development is subject to the pull of both biological and environmental forces. However recent secular trends in biological maturation have lowered the age of onset of the adolescent growth spurt to 9 for girls and 11 for boys. This critical biological trend alongside recent civil rights initiatives (eg, Title IX) and the exponential growth in youth sports suggests a need to re-examine sources of variability in development of key fundamental movement skills. The purpose of this study was to examine developmental changes associated with mature throwing by children in grades k-8. Specifically, the study addressed the following research questions: 1) what are the characteristics of individual differences in throwing over time? And 2) are differences in developmental growth trajectories of mature throwing systematically related to age, sex, and/or sports participation? In keeping with the spirit of Schaie's General Developmental Model, we employed a sequential design that included cross-sectional, longitudinal, and time-lag components. This design allowed us to examine the influence of age, sex, and sport participation while reducing cohort effects. Following a pilot study to examine inter-rater reliability, we tested children on mature throwing using the Ohio State University Scale of Intra Gross Motor Assessment (OSU SIGMA). Specifically we tested four cohorts of boys and girls grades k-8 (N= 1,045) over nine years (1992= k-8, 1994= 2-8, 1996= 4-8, 1998= 6-8; in'00 we again tested the original kindergarten cohort. The method of analysis was latent variable growth curve modeling. Essentially this technique uses intercepts …", "num_citations": "7\n", "authors": ["1045"]}
{"title": "Using National and State Assessments To Inform the Performance of Education Systems.\n", "abstract": " 1. Research ObjectivesGiven statewide systemic reform efforts for academic excellence and equity, we need to know what information is available on the performance of state education systems. While the National Assessment of Educational Progress (NAEP) and individual state student assessments have been used to inform us of state-level performance, problems exist. On one hand, states are having difficulty in realigning their student assessment systems and tracking student achievement (CPRE, 1995). Moreover, most states use their statewide assessments for several purposes, some of which are incompatible (Bond, Braskamp, & Roeber, 1996). On the other hand, the NAEP state assessments provide highly comparable information on student achievement across the states, but they are not specifically aligned with the policies and standards of any given state. Thus, we need to examine whether and how the current NAEP and states' own student assessments can be used to inform us of systemwide academic performance. We also need to examine if the national and state assessments produce consistent results on the proficiency levels of students and their academic growth.In light of these concerns, I conducted a systematic analysis of currently available systemwide student assessments, that is, the NAEP and states' own assessments, and addressed the issue of the quality of data available for assessing and understanding the performance of states. The objective of this study is to identify and fill the gaps between currently available data and more desirable data in light of statewide systemic school reforms.", "num_citations": "7\n", "authors": ["1045"]}
{"title": "Effects of testing\n", "abstract": " This entry focuses on testing designed to measure and monitor students’ academic achievement in school settings. Although there are controversies about whether testing enhances student learning and achievement, it is critical to understand not only the effectiveness of testing, but also how, when, and why it works. To answer this, a consideration of testing attributes and conditions such as teacher-developed formative assessments versus standardized summative assessments must be examined. While an evaluation of testing effects call for scientifically based evidence, derived from experimental and correlational studies, it is also necessary to understand both the social and educational context of testing in which the research has been embedded. The origin of public testing dates as far back as the 2nd century bce when civil service exams were used during the Han dynasty of China (206 bce–220 ce) to select elite government officials. Over time, modern external examinations have grown as instruments of control over educational systems in many countries (Eckstein & Noah, 1993); the history of educational testing and assessment reveals underlying assumptions and beliefs about human learning and teaching (Madaus & O’Dwyer, 1999; Shepard, 1991). While teacher-made tests, assignments, or observations remain a dominant form of classroom assessment, standardized testing with reliance on short multiple-choice questions has facilitated objective, reliable, and efficient evaluation on a large scale.It is critical to differentiate between formative and summative assessments due to their different testing functions, effects, and causal …", "num_citations": "6\n", "authors": ["1045"]}
{"title": "Asian Americans and the gender gap in science and technology\n", "abstract": " It is well known that Asian Americans are extraordinary educational achievers with higher levels of educational attainment and achievement than other racial groups (Flynn, 1991; Kao, 1995; Sue & Okazaki, 1990). While this phenomenon is often generalized to all Asian Americans regardless of their gender and attributed to home-related factors (eg, childrearing and socialization practices), very little is known about an Asian American gender gap that may arise from social stereotyping and institutional discrimination as well as differential parental expectations and family support for boys versus girls at home. Clearly, there is a gender gap across the board in traditionally male fields such as science and technology, where male and female students tend to show markedly different levels of academic interest, engagement, and achievement while in school, and ultimately different occupational choices after graduation …", "num_citations": "6\n", "authors": ["1045"]}
{"title": "Multilevel Linkages of State Education Reform to Instructional Practices.\n", "abstract": " Content-driven systemic school reform emerged in recent years as a major policy alternative in the United States. Major reforms include the establishment of state curriculum frameworks, the development of student assessments, and the adoption of new textbooks tied to the curriculum frameworks. Because successful implementation of content-driven reform depends on the linkages between state-level policymaking and school-level policy implementation, the central question is how state policies have changed the ways in which classroom activitieg are organized and managed by teachers. This paper presents findings of a study that investigated the multilevel linkages of state education reform to instructional practices in mathematics. Four stages of empirical analyses were conducted with a combination of the following survey data: the 1992 Council of Chief State School Officers (CCSSO) state survey, the 1990 and 1992 National Assessment of Educational Progress Trial State Assessment (NAEP TSA) eighth-grade school survey, and the 1990-91 Schools and Staffing Survey (SASS) public school administrator survey. The data suggest that current state curriculum frameworks need to be aligned with instructional materials as well as with student assessments. The. findings also imply that policy implementation is a dynamic organizational process of interactions between policy characteristics and the institutional setting in a multilayered school system. Thus, systemic school reform needs to formulate desired connections between organizational levels in normative, structural, and functional arenas. The findings further suggest that the impacts of …", "num_citations": "6\n", "authors": ["1045"]}
{"title": "Time-Indexed Effect Size for P-12 Reading and Math Program Evaluation.\n", "abstract": " Our current capacity to understand or provide a context for interpreting the size of an effect in education program evaluation is limited. To address the problem, this study proposes a timeindexed effect size metric (d΄) to estimate how long it would take for an―untreated‖ control group to reach the treatment group outcome in terms familiar to educators—years/months of schooling. This study extends prior work on K-12 academic growth norms to preschool level. Through applications of the time-indexed effect size to selected examples of experimental or quasi-experimental research (eg, What Works Clearinghouse reviews), the study demonstrates that it could provide a developmentally appropriate context for interpretations of educational program effects at different levels of schooling. It is a step toward bridging the gap between educational research and practice.", "num_citations": "5\n", "authors": ["1045"]}
{"title": "A litmus test of school accountability policy effects in Korea: cross-validating high-stakes test results for academic excellence and equity\n", "abstract": " This study challenges prior evidence on the impact of Korea’s high-stakes school accountability policy as a tool to improve overall achievement and close achievement gaps. Applying difference-in-differences method, the study compares Korean high school students’ reading and math test score trends before and after the policy based on the National Assessment of Educational Achievement (NAEA) vs the Programme for International Student Assessment (PISA). Under the “No Student Below Basic” policy, achievement gains were only evident on NAEA as high-stakes test but not on PISA as low-stake test that emphasizes real-world applications. The achievement gaps between high-performing and low-performing schools narrowed on NAEA but widened on PISA. Through cross-national comparison with the US “No Child Left Behind” policy features and outcomes, the study offers critical insights on the risks of test …", "num_citations": "4\n", "authors": ["1045"]}
{"title": "International and interstate analyses of student-and schooltargeted accountability policy effects\n", "abstract": " METHODSIn this chapter, we employ a comparative interrupted time-series design to explore the impact of test-driven school accountability policy on student math achievement outcomes, and achievement gaps at both the state level (among 50 states in the US) and the national level (among 28 OECD countries and 37 TIMSS countries). For the interstate analysis, we use the National Assessment of Student Progress (NAEP) state-level aggregate eighth grade public school students’ math achievement results during the 1990–2009 period.For the international comparison, we use Programme for International Student Assessment (PISA) national aggregate 15-year-old students’ math achievement results during the 2000–2009 period and TIMSS 8th grade students’ math achievement during the 1995–2007 period. Hierarchical linear modeling (HLM) was used to track US states’ and individual nations’ changes in math achievement average and achievement gaps to examine interstate or international variations in the growth patterns (Raudenbush & Bryk, 2002). Separate HLM analysis of each dataset was conducted to explore the effect of high-stakes accountability policy, using similar models with control for time-varying and time-invariant covariates (see Appendix for information on the policy variable in each dataset). To address potential selection bias in drawing causal inferences about the impact of accountability policy based on observational data, we apply statistical matching of nations or states based on the covariates of demographics and school resource variables available in the dataset and also control for initial status differences in …", "num_citations": "4\n", "authors": ["1045"]}
{"title": "Educational testing: Measuring and remedying achievement gaps\n", "abstract": " Achievement gaps, as measured by standardized tests, are inextricably related to educational goals, standards, norms, and benchmarks for student learning outcomes. I revisit conventional approaches to educational testing to measure achievement gaps—norm-referenced, criterion-referenced, and potential-referenced tests. I explore and discuss a paradigm shift from “passive” tests to “responsive” tests that promotes the diagnosis and remediation of achievement gaps. Particularly, I propose an environment-referenced approach to testing with the specification of desired learning opportunities and environment conditions that enable students to meet upgraded achievement norms, standards, and benchmarks.", "num_citations": "4\n", "authors": ["1045"]}
{"title": "Imperative or Choice? Multi-Level and Multi-Measure Analysis of Student Assessment Data for Evaluation of Systemic School Reform.\n", "abstract": " ABSTRACT A systematic analysis of student assessment data from Maine and Kentucky, using National Assessment of Educational Progress (NAEP) data and state and local assessment results, was conducted to address issues of measurement and attribution involved in evaluating systemic school reform. This paper (1) examines ways to cope with the challenges of considering measures of school systems from multiple sources and combining multiple measures of student achievement data using state and local data from Maine;(2) examines ways to tackle the challenges of considering multiple levels of influences on student achievement and attributing achievement results to school effects using NAEP data from Maine and Kentucky; and (3) discusses the usefulness and limitations of multi-level and multi-measure approaches to the evaluation of systemic school reform. Results suggest that it is not necessary to weight each measure before forming an achievement composite to classify student performance. This is particularly true when measures are highly intercorrelated. Results also point to the possible hazards of classifying student achievement based on a single measure. Three different models of estimating school effects were tested, and reasons for their use are discussed. The estimation of school effects requires that\" school effects\" be defined so that an explicit model of these effects can be formulated. The model should be fully specified, with all variables representing school input, practice, context, and student background measured.(Contains 14 tables and 17 references.)(SLD)", "num_citations": "4\n", "authors": ["1045"]}
{"title": "School Reforms in England, Japan, Korea and the US: Policy Variation and Educational Convergence.\n", "abstract": " Education reform during the last 2 decades has been shaped by the forces of growing public distrust of educational bureaucracies in a climate of rapid political change and growing international competition in the context of a global economy. Major school reforms in foui selected industrial countries that differ significantly in terms of educational institutions and cultures are examined using school reform literature, related government reports, and newspaper articles. Japan and Korea have highly centralized school governance systems and homogeneous educational values. Conversely, in the United States and England, education governance is decentralized, and educational values are relatively heterogeneous. In the latter two countries lack of focus and accountability were identified as major deficiencies of their educational systems, and efforts were made to standardize curriculum, tighten assessment practices, and introduce market-like competition. Similar political and economic challenges in Japan and Korea, on the other hand, resulted in policies to differentiate curriculum, diversify assessment, decentralize school governance, and make the system more diverse and democratic--enhancing whole-person education.(Contains 33 references.)(DFR)", "num_citations": "4\n", "authors": ["1045"]}
{"title": "Assessing the Performance of Public Education in Maine: Factors Influencing School Differences\n", "abstract": " This study is a research-based attempt to attack school effectiveness issues and improve school performance in Maine by systematically analyzing existing national or state databases on school performance and identifying school factors that produce high performance. It is designed to provide Maine education policymakers and practitioners with research-based information on how to assess and improve school performance. In the midst of standards-based school reform and public demands for school accountability, the findings are relevant as we implement challenging learning goals for all students and pinpoint where more resources, money and energy are needed for systemic school improvement.", "num_citations": "4\n", "authors": ["1045"]}
{"title": "Moving to Educational Accountability System 2.0: Socioemotional Learning Standards and Protective Environments for Whole Children. Education Policy.\n", "abstract": " 4 c. Such research, and opportunities under new federal policies such as ESSA, have sparked several states to adopt SEL standards as part of, or in conjunction with, existing or revised academic learning standards. d. State SEL standards have a common emphasis on intrapersonal, interpersonal, and decision-making skills. They are often scattered and lack connections to academic standards, however, and data are rarely collected in a way that informs school accountability for progress in these areas. e. State SEL standards tend to focus narrowly on specific skills and competencies, but fail to address learning environment gaps for whole child development. To counteract the effects of poverty and other risk factors, it is crucial to build a protective environment, such as safe and supportive schools, families, and neighborhoods for disadvantaged students. f. New York State has recently developed K-12 SEL benchmarks for voluntary adoption by school districts, trailing early statewide adopters which use SEL standards for school improvement and accountability. New York State also lags behind other state leaders in terms of creating protective environments and advancing child well-being. g. Policymakers can take steps to enact meaningful SEL standards and ensure their effective implementation. These steps include: reenvisioning the school accountability policy for whole child development; well-balanced integration of academic and socioemotional learning standards and measures; investment in school/teacher capacity-building and a protective environment for child wellbeing; and effective partnership between schools, families, and …", "num_citations": "3\n", "authors": ["1045"]}
{"title": "Immigrant and international college students’ learning gaps: Improving academic and sociocultural readiness for career and graduate/professional education\n", "abstract": " The learning gaps of immigrant and international student groups on the increase in American college campuses raise the challenges of ensuring educational equity and inclusion for minoritized students. This mixed-methods study is based on transformative education and asset model, challenging conventional deficit views about immigrant and international student groups marginalized as aliens in American colleges and universities. Quantitative analysis of the U.S. national longitudinal data reveals diverse patterns of learning gaps among these groups in which high-impact practices (HIPs) influence the chances of 4-year college degree completion with full-time job employment and graduate/professional school enrollment. Qualitative analysis of interview cases offers further insights into ecological challenges, opportunities, and strategies for recognizing immigrant and international students as assets and …", "num_citations": "2\n", "authors": ["1045"]}
{"title": "NEPC review: The effects of the Florida tax credit scholarship program on college enrollment and graduation: An update\n", "abstract": " This Urban Institute research report is aimed at assessing the impact of the Florida Tax Credit (FTC) scholarship program on college enrollment and graduation. Through matched comparisons, the study finds consistently positive effects of the program for both two-year and four-year colleges, with relatively stronger effects for four-year private college enrollment and for students who stayed in the program longer. This review acknowledges the study’s contributions, using expanded data tracking to inform school voucher policy debates, but the review also raises three critical questions about the validity of some methods, findings and conclusions. First is the problem of selection bias. The study’s attempt to match FTC and non-FTC students resulted in the non-FTC comparison group having two to three times more students receiving reduced-price lunch. This is on top of the acknowledged problem that choosers could …", "num_citations": "2\n", "authors": ["1045"]}
{"title": "Review of\" Do High Flyers Maintain Their Altitude?\".\n", "abstract": " This Fordham/North West Evaluation Association research report raises concerns about the performance trends of high-achieving students. The central question (and title of the report) is: Do High Flyers Maintain Their Altitude? or, in plain language,―Do highachieving students maintain their high academic ranking?‖ The motivation for this study is stated in the foreword to the report:If America is to remain internationally competitive with other advanced nations, we need to maximize the potential of our top students. Yet many analysts worry that various policies and programs, including the federal No Child Left Behind Act (NCLB), tend to―level‖ student achievement by focusing on the lowest-achieving students and ignoring—or, worse, driving resources away from—our strongest students (p. 1). 1", "num_citations": "2\n", "authors": ["1045"]}
{"title": "SAT Wars: The Case for Test-Optional College Admissions ed. by Joseph A. Soares\n", "abstract": " Admissions, edited by Joseph Soares, compiles 12 separate chapters to collectively make a case against the use of traditional standardized tests such as the Scholastic Aptitude Tests for college admissions and to build support for test-optional policies and alternative testing models. SAT Wars can be useful for both researchers and administrators in higher education with interests in fairness and diversity issues in undergraduate admissions testing. This book makes clear that, despite mounting evidence that the SAT is a poor predictor of college success, it remains a major social, cultural, and political force in the world of US higher education. Overall, SAT Wars delivers a much-needed critical examination of the (a) purpose and history of the SAT,(b) alternative forms of testing and findings of the SAT’s insignificant correlation with college success, and (c) effects of existing test-optional policies on several different …", "num_citations": "1\n", "authors": ["1045"]}
{"title": "Time-Indexed Effect Size Metric for K-12 Reading and Math Education Evaluation.\n", "abstract": " Through a synthesis of test publisher norms and national longitudinal datasets, this study provides new national norms of academic growth in K-12 reading and math that can be used to reinterpret conventional effect sizes in time units. We propose d΄, a time-indexed effect size metric to estimate how long it would take for an “untreated” control group to reach the treatment group outcome in terms familiar to educators—years/months of schooling. It serves as a supplement to conventional effect size metrics such as Cohen’s d by taking into account different amounts of time needed for learning at different age or grade levels. Through applications to Project STAR small class effects and NAEP racial achievement gaps, we demonstrate how to interpret and use d΄. It is expected to provide a more developmentally appropriate context for interpreting the size of an effect, a step toward bridging the gap between educational research and practice.", "num_citations": "1\n", "authors": ["1045"]}
{"title": "ARE PRIVATE HIGH SCHOOLS BETTER ACADEMICALLY THAN PUBLIC HIGH SCHOOLS?\n", "abstract": " School choice remains one of the most controversial issues in educational policy. The original idea of school vouchers was proposed in 1955 by Milton Friedman as a solution to the public schools’ perceived monopolistic control over schooling. 1 Debates over such vouchers often engage the question of whether private schools are more effective in educating students, a question which is the subject of two reports recently issued by think tanks.", "num_citations": "1\n", "authors": ["1045"]}
{"title": "Bringing Together Reading and Writing for the Purpose of Enhancing Reading Comprehension\n", "abstract": " This symposium summarizes the progress and findings of the first year of the Writing Intensive Reading Comprehension (WIRC) study funded by the Institute of Education Sciences, US Department of Education 1. It reports on progress made during Year I toward achieving the study’s two major goals:(1) A new integrated reading-writing curriculum entitled Writing Intensive Reading Comprehension for enhancing reading comprehension and writing performance by teaching reading and writing simultaneously and interactively, and (2) A set of empirical data which speaks to the effectiveness of WIRC compared to the teaching of reading comprehension and writing separately. In the first paper I will discuss the theoretical underpinnings for integrating reading and writing in the WIRC study. In the second paper Tim Madigan will describe thinksheets, the curriculum component at the heart of the WIRC intervention, and he …", "num_citations": "1\n", "authors": ["1045"]}
{"title": "Exploring data and methods to assess and understand the performance of SSI states: Learning from the cases of Kentucky and Maine\n", "abstract": " This study examined two major questions. Do national and state assessments provide consistent information on the performance of state education systems? What accounts for discrepancies between national and state assessment results if they are found?", "num_citations": "1\n", "authors": ["1045"]}
{"title": "How Adequate Are Adequate Yearly Progress (AYP) Measures? Regression Artifacts and School AYP.\n", "abstract": " This study explored the extent to which current adequate yearly progress (AYP) indices reflect real change or a statistical artifact. The objective, in more specific terms, was to investigate regression artifacts in evaluating schools' academic progress and explore methods to overcome their effects in developing AYP measures. Schools in Kentucky and Maine were studied, using eighth-grade achievement data from the two states' student assessments, the Kentucky Instructional Results Information System and the Maine Educational Assessment. Three different types of school achievement gain estimates were computed:(1) the 1-year gain measure;(2) a 2-year gain measure; and (3) a 3-year gain measure. Time-reversed analyses were conducted to determine whether gain score really was a regression artifact. Findings for both states show that higher performing schools tend to gain less while lower performing schools gain more. This illustrates the well-known regression to the mean status phenomenon. Results also reveal regression to the mean growth phenomenon. Schools that gained more in the past tend to gain relatively less. The first force tends to make higher and lower performing schools appear convergent in their status, and the latter force may make more and less improving schools appear convergent in their growth. These two forces as statistical artifacts may confound AYP measures and need to be addressed.(Contains 4 figures, 11 tables, and 9 references.)", "num_citations": "1\n", "authors": ["1045"]}
{"title": "Assessing the Effectiveness of Instructional Resource Allocation and Use.\n", "abstract": " This paper reports on a 1992 study of mathematics-assessment data by measuring key instructional resources and practices and by investigating the ways in which the resources and practices affect student learning in a multilayered, complex school system. The study examined research methods that assess the effectiveness of instructional resource allocation. The results encourage the possibility of applying objective measurement and multilevel analysis methods to survey and test data for assessing the effectiveness of instructional resource allocation and use. Findings show that the availability of both human and physical resources is positively associated with the level of desired instructional practices across states. Generally, the effect of human resources is greater than the effect of physical resources. Furthermore, the level of desired instructional practices is positively related to the level of academic achievement across states, although the relationship between instructional resources and practices varied from state to state. Setting desired levels of standards of instructional resources and practices may be tailored to individual states' unique status of resource allocation and use. States that are more effective in using physical resources than in using human resources should set standards for physical resources at higher levels than for human resources.(Contains 17 references.)(RJM)", "num_citations": "1\n", "authors": ["1045"]}
{"title": "State and Local Policy Choices and Fiscal Effort for Education: Exploratory Analysis of the Distributive Effects of State Education Reform.\n", "abstract": " Given state activism in education reform during the 1980s, a major concern in the development of education policy is whether reform states have increased their financial support for education in order to achieve desired objectives. This paper describes findings of a study that explored the distributive nature of state and local policy choices in education through comparative analyses of their long-term fiscal effort for three distinctive public services--welfare, highways, and police. The study built upon the unitary model of taxation and expenditure policies. The findings imply that policy shifts may have led to changes in educational expenditure patterns. Providing the general structures of state-level distributive effects, multilevel analyses suggest that the first wave of state reform affected not only fiscal effort for education but also distributive tendencies in education expenditures. While state reform appeared to increase the level of resources allocated to public education versus other social services, the distributive effects of state education reform tend to vary among states with different racial compositions. Redistributive tendencies in education expenditures tend to be accompanied by a low level of fiscal effort for education. In addition, developmental versus redistributive tendencies in education expenditures tend to be highly conflicting. One figure, 5 tables, and 13 endnotes are included.(Contains 36 references.)(LMI)", "num_citations": "1\n", "authors": ["1045"]}