{"title": "Designing towards emotional usability in customer interfaces—trustworthiness of cyber-banking system interfaces\n", "abstract": " In this research we investigate the possibility of designing a user interface for electronic commerce systems that will evoke target feelings in the customer. The focus is on the impact of visual design factors on the feeling of trustworthiness because of its significant effect upon the behavior of customers using electronic commerce systems. Four empirical studies were conducted in the domain of cyber-banking systems. The subjects were cyber-banking system developers, bank personnel and potential customers of cyber-banking systems in Korea ranging in age from late teens to early forties. The first study was directed at developing the self-report questionnaire that faithfully reflects the emotional factors related to cyber-banking systems. The resulting questionnaire consisted of the forty bipolar emotive differential scales representative of the emotions most important in interacting with cyber-banking systems, e.g …", "num_citations": "634\n", "authors": ["902"]}
{"title": "Essence of distributed work\n", "abstract": " This chapter provides a historical account from three different perspectives of how the Linux operating system kernel was developed. Each focuses on different critical factors in its success at the individual, group, and community levels. The technical and management decisions of Linus Torvalds were critical in laying the groundwork for a collaborative software development project that has lasted almost a decade. The contributions of volunteer programmers distributed worldwide enabled the development of an operating system on a par with proprietary operating systems. The Linux electronic community was the organizing structure that coordinated the efforts of the individual programmers. The chapter concludes by summarizing the factors important in the successful distributed development of the Linux kernel and the implications for organizationally managed distributed work arrangements.Complex tasks plus a global economy have impelled the creation of many distributed engineering and development groups supported by information and communication technologies. Distributed groups range in duration from weeks to years, they range in size from fewer than ten people to more than a thousand, and they may have members located in two locations or many locations. Distributed engineering and development depends on careful planning, coordination, and supervision. Careful does not necessarily imply micromanagement. Contributors who are geographically distant from one another inevitably operate under some degree of autonomy. The management challenge is to ensure that members of geographically distributed engineering and …", "num_citations": "498\n", "authors": ["902"]}
{"title": "Understanding the behavior of mobile data services consumers\n", "abstract": " Due to rapid advances in the Internet and wireless technologies, a ubiquitous computing world is becoming a reality in the form of mobile computing. At the center of this phenomenon is mobile data services which arise from the convergence of advanced mobile communication technologies with data services. Despite the rapid growth in mobile data services, research into consumers’ usage behavior is scarce. This study attempts to identify and empirically assess the factors that drive consumers’ acceptance of mobile data services. A research model based on the decomposed theory of planned behavior and incorporating factors that represent personal needs and motivations in using mobile data services is presented. The model is tested via an online survey of 811 consumers of four categories of mobile data services (i.e., communications, information content, entertainment, and commercial transactions …", "num_citations": "366\n", "authors": ["902"]}
{"title": "What makes Internet users visit cyber stores again? Key design factors for customer loyalty\n", "abstract": " Retaining customer loyalty is crucial in electronic commerce because the value of an Internet store is largely determined by the number of its loyal customers. This paper proposes a multi-phased model of customer loyalty for Internet shopping, which fully takes the characteristics of the Internet and cyber shopping into consideration. In order to validate the model, we conducted a web-based survey of the customers of various Internet stores, and the data was processed using structural equation analysis. The results indicate that several factors can effectively increase customer loyalty towards an Internet store and that the relative importance of the identified factors varies according to the level of involvement with the product purchased through the store. We suggest several managerial implications in developing Internet stores for higher customer loyalty based on these results.", "num_citations": "288\n", "authors": ["902"]}
{"title": "The role of feedback in managing the Internet-based volunteer work force\n", "abstract": " This paper explores a new phenomenon at the intersection of digital networks and organizations—the Internet-based volunteer work force—people who use Internet applications to pursue a personal interest through volunteering contributions of time and talent that may create value for organizations and their customers or members. This work force is not centrally organized, managed, or measured. It is an emergent phenomenon resulting from discretionary small actions taken by large numbers of people, enabled by technology and human initiative. This paper proposes a general framework for understanding the phenomenon and offers an empirical investigation of one component of it—the role of feedback in producing and sustaining high-quality contributions from this work force. In a comparative study of Internet-based voluntary technical support groups for software problems, we found that in groups who …", "num_citations": "194\n", "authors": ["902"]}
{"title": "Prosocial behavior on the net\n", "abstract": " Volunteers and charitable organizations contribute significantly to community welfare through their prosocial behavior: that is, discretionary behavior such as assisting, comforting, sharing, and cooperating intended to help worthy beneficiaries. This essay focuses on prosocial behavior on the Internet. It describes how offline charitable organizations are using the Net to become more efficient and effective. It also considers entirely new models of Net-based volunteer behavior directed at creating socially beneficial information goods and services. After exploring the scope and diversity of online prosocial behavior, the essay focuses on ways to encourage this kind of behavior through appropriate task and social structures, motivational signals, and trust indicators. It concludes by asking how local offline communities ultimately could be diminished or strengthened as prosocial behavior increases online.", "num_citations": "141\n", "authors": ["902"]}
{"title": "Turning love into money: How some firms may profit from voluntary electronic customer communities\n", "abstract": " In this chapter we examine the potential value to firms of voluntary activities of electronic customer communities. Participants in these communities help each other in the use of products ranging from software programs (eg, Microsoft Word) to toy building blocks (eg, LEGO®). They reinforce the value of the product in their lives through shared passions and experiences. We examine the factors that motivate people to participate voluntarily in such electronic customer communities and the dynamics that ensure continued participation of a critical mass of members. The chapter concludes by discussing appropriate response strategies of companies to the activities of volunteer customer communities that depart from the conventional controlling role of companies in direct-to-consumer communications but which nonetheless can be valuable for firms in the long run.", "num_citations": "53\n", "authors": ["902"]}
{"title": "Calling for a shared understanding of the\" sharing economy\"\n", "abstract": " Advances in IT platforms coupled with movements towards sustainable consumerism through resource sharing have fueled the growth of the\" sharing economy\". Businesses have sprung up around not only tangible products, such as housing and car rides, but also intangible assets, such as talent, knowledge, time, and experience. The\" sharing economy\" concept emerged first in the context of\" non-monetary\" transactions. The current leading sharing economy platforms such as Airbnb, Uber, and Zipcar however, enable economic transactions. Regulating the novel modes of business transactions is murky. As these platforms blur industry boundaries, regulators face the challenge of clearly defining sharing economy businesses. The confusion around the sharing economy's boundaries and those of regulations for different industries may derail plans for the global expansion of various sharing economy platforms. This …", "num_citations": "44\n", "authors": ["902"]}
{"title": "Emotional usability of customer interfaces: Focusing on cyber banking system interfaces\n", "abstract": " Emotions play a major role in the social interaction process with electronic commerce systems. This paper describes our attempts to design customer interfaces that can induce target emotions for cyber banking systems. Four experiments were conducted to identify the important emotive factors and design factors, and to establish and verify causal relations between the factors. Results indicate that it is possible to design customer interfaces that will elicit target emotions for the systems (eg, trustworthiness).", "num_citations": "37\n", "authors": ["902"]}
{"title": "Broadband penetration and participatory politics: South Korea case\n", "abstract": " This paper examines the potential impact of the Internet on the political process in a young democracy. Roh Moo-hyun's dramatic victory on December 19, 2002 represents a major watershed in modern day South Korean politics. The Internet enabled this upset victory. The Internet made available alternative sources of political information unfiltered by the conservative and often biased mass media. Citizens distributed worldwide could express their support for Roh Moo-hyun in the public forums on his official site and many other news and discussion sites. Rohsamo, a group of people who support Roh Moo-hyun, became the focal organizing structure around which the efforts of individual supporters were coordinated. In this paper, we draw on primary and secondary data sources and relate broadband penetration to political participation. We suggest that Roh's election would not have been possible had it not been …", "num_citations": "35\n", "authors": ["902"]}
{"title": "Content versus structure in information environments: A longitudinal analysis of Website preferences\n", "abstract": " From the prospective traveler surfing the web for cheap vacations to executives analyzing market trends with a data warehouse, at home and at work, people are confronted with increasingly richer information environments. This study is an attempt at modeling the behavior over time of the “information consumer”(web surfer or executive) in such environments. The objective is to gain a better understanding of how to design the technologies that support and enhance the interaction with these information environments. Two key design variables for information environments are examined: content quality and structural quality. Drawing on research in human-computer interaction and ecological psychology, a behavioral model is developed in which it is postulated that the importance of structural quality will diminish with time, whereas content quality will increaseinimportance. Atwo-stagemethodologyisemployedwhichcombinesalongitudinalexperimentwith a cross-sectional survey. Both the survey and experiment are conducted in the context of informational websites. The experiment provided 178 undergraduates with repeated exposure over several weeks to eight custom-built websites, manipulated to vary in content quality and structural quality for which their preferences (and associated rationales) were elicited at three time points over the course of the experiment. Additionally, 163 of the undergraduates also completed a survey providing data about the effect of content and structure on usage behavior for sites for which they had mature experience. Preliminary results of the experimental data support the hypotheses. The research has potentially …", "num_citations": "24\n", "authors": ["902"]}
{"title": "An AHP & survey for selecting workflow management systems\n", "abstract": " The aim of this study was to establish the important criteria to be considered in selecting the workflow solution for a particular organization’s business process reengineering project. The success of a BPR project depends on the attainment of a subtle balance between two conflicting goals—control of the core work processes and empowerment of the individual employees. This balance in turn must differ from industry to industry, due to the difference in the core processes and the organizational structure. In this study, functions of the workflow management system that were considered important for reengineering an organization were structured as an attribute hierarchy according to the analytic hierarchy process model to facilitate the choice between conflicting functions. The attribute hierarchy was evaluated through a survey conducted on representatives of South Korean firms from different industries, the results of …", "num_citations": "21\n", "authors": ["902"]}
{"title": "The kindness of strangers: Prosocial behavior on the Internet\n", "abstract": " I have found many people who are struggling with similar issues banding together to help each other. It is the best place in the world, and i couldn’t think of another place to go to meet so many lovely people...(MDJunction Scheuermann’s Disease support group.) Dear Volunteers,... Your feedback gave me an objective and learned viewpoint that we knew was needed, but didn’t understand how to evaluate internet media.... We are remedying that gap NOW via each of your expertise. It has been enlightening... You all made for a SUPER ADVISORY team effort. We were impressed and got so much more then we anticipated. THANK YOU! We’re giving Gerard C another AWARD because his efforts were outstanding and helpful in very specific ways that benefited our ability to act upon everyone else’s feedback.(Sparked, December 17, 2011; Antakarana Co-Creation Learning Project, http://www. sparked. com/ask/Our-Website-Needs-the-Wisdom-of-an-External-Eye.)I can speak Hindi, Urdu, English, Sanskrit and Moroccan. But I can’t read what’s on my computer screen. Being blind online means I have to listen to all the text–including ads... Instead of ads, Wikipedia has a community of millions of volunteer editors double-checking every word and citation. I’m so grateful for them–their work makes learning online possible. The philosophy of Wikipedia is to make a sea from drops. And it applies to everyone who contributes, whether a few edits or a few dollars. Thank you, Aniruddha Kumar, Wikipedia Author.(https://wikimediafoundation. org, December 17, 2011.)", "num_citations": "20\n", "authors": ["902"]}
{"title": "When seeing helps believing: the interactive effects of previews and reviews on E-book purchases\n", "abstract": " Online reviews offer consumers the indirect experience of products through others’ consumption evaluations, whereas previews afford them direct experience through product trials. Although conceptual and empirical studies on the business ramifications of online reviews abound, little is known about how online previews moderate the effects of online reviews on sales. To cast light on this issue, the current research investigated the interactive effects of exposure to online previews and reviews on individual purchase decisions. We analyzed a unique two-month panel data set on 270,260 sessions that comprise clickstream data on consumers’ exposure to previews and reviews and data on their subsequent purchase behaviors. On the basis of analyses underlain by a two-stage hierarchical Bayesian framework, we found that online previews positively influence individual purchase decisions. More importantly …", "num_citations": "19\n", "authors": ["902"]}
{"title": "Seek or provide: Comparative effects of online information sharing on seniors’ quality of life\n", "abstract": " Seniors’ social activities are critical in assuring their quality of life, and seniors’ quality of life (QoL) declines with the deterioration of their social activity. Social support from online social relationships has been considered to be important determinants of QoL, and is an important goal of the design of online health communities to support patient-centered e-health initiatives. In this study, we find that, rather than attempting to improve seniors’ quality of life through interventions and online community platforms that are designed directly to increase social interactions and focus on social relationship formation, it is more effective for such online health communities to be designed to facilitate information sharing. Information sharing may be an easy way for seniors to become familiar with the online environment and pave the way for subsequent online social relationships. This study investigated seniors’ online information sharing behaviors and the impacts on their quality of life. Survey data from 130 seniors was used to test our research model. Seniors’ online information seeking and provision indirectly affect their quality of life, and the relative importance of information seeking and information provision varies depending on the seniors’ perceived subjective age, ie, cognitive age.", "num_citations": "18\n", "authors": ["902"]}
{"title": "The influence of mortality focus on guilt advertising effectiveness\n", "abstract": " The current research examines the influence of mortality focus on the effectiveness of guilt advertising via two experiments. Mortality focus and type of guilt advertising appeal interacted such that directing the focus of mortality on one's own death (versus other) facilitated effectiveness of guilt-lessening (versus guilt-magnifying) appeals. The mediators of the influences were the motivation to boost self-confidence (versus manage impression). The findings offer practical implications for guilt advertising management and contribute to the literature on consumer guilt, mortality salience, and defensive processing.", "num_citations": "16\n", "authors": ["902"]}
{"title": "The Internet as an Agent of Political Change: The case of\" Rohsamo\" in the South Korean Presidential Campaign of 2002\n", "abstract": " Roh Moo-hyun’s victory on December 19, 2002, represents a major watershed in modern day South Korean politics. In this exploratory case study, we draw on historical research on the impact of the printing press on the Protestant Reformation and on the literature on the mass media and the Internet in politics to explain how the Internet influenced this presidential election outcome. Both the Internet and the Gutenberg printing press technologies dramatically changed how information was communicated. The printing press broke the control held by the Catholic Church over religious information in Europe; the Internet significantly changed how political information was communicated in South Korea where broadband access rates are four times higher than in the US, providing an effective alternative medium for the exchange of political information. The Church was suspicious of the quality of publications through the …", "num_citations": "13\n", "authors": ["902"]}
{"title": "Understanding Citizen Participation in Governmental Social Media: a Case Study of the Indonesian Regional Police.\n", "abstract": " Governments increasingly leverage social media to deliver better services to the public. Web 2.0 technologies enable people to interact and collaborate with one another efficiently and effectively. The use of web 2.0 technologies by government–government 2.0–enables citizen to interact and collaborate with government in the delivery of public services. This exploratory study examines the use of social media in Indonesia. The focus is on examining the potential of social media in improving the effectiveness and efficiency of public service delivery, and how social media might boost the relationship between government and the public. We focus in particular on the use of social media by regional police action–Traffic Management Center Polda Metro Jaya in the Jakarta region which has been recognized as a social media best practice within the Indonesian government. We find that social media has contributed to information dissemination among the public. Furthermore, social media use results in improved public image and enables citizen participation in government service delivery.", "num_citations": "10\n", "authors": ["902"]}
{"title": "Understanding continuous use of virtual communities: A comparison of four theoretical perspectives\n", "abstract": " The value of virtual communities can be attained only when the members are willing to stay and actively exchange their knowledge or information with other members. Therefore, the aim of this study was to find the model that best explains members' continued use intention in virtual communities. Eight major variables were identified and four alternative models were formulated: 1) Information Systems (IS) continuance model as a base model, 2) IS continuance model with Technology Acceptance Model (TAM) as the first competing model, 3) IS continuance model with social capital theory as the second competing model, and 4) IS continuance model with TAM and social capital theory as the third competing model. The four models were compared with LISREL 8.7 using survey data collected from virtual community users in Korea. The findings indicated that the second competing model built on the IS continuance …", "num_citations": "8\n", "authors": ["902"]}
{"title": "Does age matter in mobile user experience? Impact of age on relative importance of antecedents of mobile user experience\n", "abstract": " Interest in user experience (UX) has grown as both academics and practitioners perceive that focusing on functional usability provides only a limited understanding of human computer interaction. UX is a comprehensive concept that goes beyond usability and utilitarian aspects of technology use, to include the non-utilitarian, aesthetic, emotional and experiential aspects. A growing body of research based on Hassenzahl’s basic UX model has examined the impact of hedonic and pragmatic product attributes on user perceptions of beauty and goodness of the technology, and their subsequent impact on satisfaction. However, the influence of age on these relationships has largely been ignored. We conducted a survey of children, young adults and the elderly’s mobile phone UX, and conducted a multi-group analysis of the UX model. We found that age really matters in mobile phone user experience. While prior research has focused on young adults, the important determinants of UX for children and the elderly differed significantly. In accordance with the UX model, young adults’ UX evaluation was influenced by both pragmatic and hedonic qualities. Children and the elderly on the other hand focused on hedonic qualities. Our study has implications for the study and practice of UX design.", "num_citations": "6\n", "authors": ["902"]}
{"title": "A social capital perspective of participant contribution in open source communities: The case of linux\n", "abstract": " Drawing upon a perspective of social capital, we investigate the extent to which several key dimensions of social capital accumulated during the growing stage of thread evolution influence both the quantitative and qualitative aspects of participant contribution in open source software development communities. To validate our hypotheses, we collected data from 223 Linux kernel threads, in which intensive intellectual and social interactions occur among the participants. The results suggest that the structural dimension of network capital (network centralization) is significantly associated with contribution quality, but not with contribution quantity. In contrast, the relational (network strength) and the dynamic (network growing speed) dimensions of network capital are significantly associated with contribution quantity, but not with contribution quality. The governance dimension (administrator participation) of network …", "num_citations": "6\n", "authors": ["902"]}
{"title": "Reconceptualization of SNS use in organizations\n", "abstract": " Enterprise social media play increasingly important roles for communication, collaboration and knowledge management in organizations. Prior studies have examined the impact of enterprise SNS use on performance. However, the conventional measures--of usage frequency and duration--do not capture the variety of enterprise SNS features implemented across different organizations, nor do they distinguish between subtle differences in usage patterns. We examine the definition and features of enterprise SNS in detail and propose an integrative framework for measuring their use. We adopt a network perspective to propose measures of enterprise SNS use, based on both a search of relevant literature and interviews with enterprise SNS users.", "num_citations": "4\n", "authors": ["902"]}
{"title": "Identification processes in distributed electronic groups: a study of voluntary technical support groups on the net\n", "abstract": " Prior to widespread access to the Net, people who needed help with their computing problems relied mostly on contract-based support from technology vendors or on intra-organizational end-user computing support. Today the Net affords an additional venue for support: technical support groups in which users voluntarily help one another solve technical problems. This dissertation draws on social identity theory and self-categorization theory to investigate how participants in a voluntary electronic group offering technical support develop identification with that group, and how these social identity processes can lead to high-quality technical support. It also examines how recognition mechanisms designed to motivate quality contributions affect these naturally-occurring social identity processes. Archival analyses of participant exchanges in four voluntary technical support groups discussing different technologies and …", "num_citations": "4\n", "authors": ["902"]}
{"title": "The economics of all-you-can-read pricing: Tariff choice, contract renewal, and switching for e-book purchases\n", "abstract": " E-book markets are currently moving through a period of disequilibrium as new pricing structures (ie, flat-fee subscriptions) are rapidly embraced by major vendors. On the basis of a novel dataset, we investigate how the availability of “all-you-can-read” pricing programs influences consumers’ tariff choice, contract renewal, and switching behaviors. Consistent with the rational choice framework, the findings suggest that most e-book consumers significantly gain from subscription-based tariffs. However, we also find some other intriguing results. Among the three subscription designs examined, the 1-week plan affords consumers more economic benefits than do 1-day or 1-month programs. The economic gains derived from subscription-based tariffs diminish as consumers renew their subscriptions under the same contract duration. Consumers who switch to other plans also suffer from reduced savings. Finally, iOS users are more inclined to select subscription models than are Android users because of the absence of in-app purchase functionalities for the former.", "num_citations": "3\n", "authors": ["902"]}
{"title": "Essence of distributed work: The case of the Linux kernel (originally published in Volume 5, Number 11, November 2000)\n", "abstract": " This paper provides a historical account of how the Linux operating system kernel was developed from three different perspectives. Each focuses on different critical factors in its success at the individual, group, and community levels. The technical and management decisions of Linus Torvalds the individual were critical in laying the groundwork for a collaborative software development project that has lasted almost a decade. The contributions of volunteer programmers distributed worldwide enabled the development of an operating system on the par with proprietary operating systems. The Linux electronic community was the organizing structure that coordinated the efforts of the individual programmers. The paper concludes by summarizing the factors important in the successful distributed development of the Linux kernel, and the implications for organizationally managed distributed work arrangements.", "num_citations": "3\n", "authors": ["902"]}
{"title": "An Analysis of Cognitive Ability and Technology Acceptance Behavior for the Elderly: Towards the Use of Wearable Healthcare Devices\n", "abstract": " This study starts from the question,\" Are people of the age 60 and over equally'old?'\" As the aging population has rapidly become a global issue, it is a timely question to think about whether it is appropriate to classify people aged 60 and over as senior citizens monolithically based on their chronological age. Thanks to the advancement of medical technology and ever-increasing life expectancy, there may be more differences than we thought in terms of cognitive and behavioral patterns among the elderly population. In order to further investigate this question, this study focuses on technology acceptance behavior of 132 participants over the age of 60 towards a wearable healthcare device. The results show that there were interesting behavioral differences among participants depending on their cognitive capabilities. More specifically, participants with high cognitive capability (Superagers) consider the usefulness and the social aspects (social norm and image) of using wearable healthcare technology. Whereas for those with relatively low cognitive capability (non-Superagers), usefulness of using the technology was not a significant factor, and they mainly considered social norm and image. Our findings imply that the current monolithic application of chronological age to classify the elderly population should be carefully reconsidered because people aged over 60 years old may not always share homogeneous cognitive and behavioral patterns.", "num_citations": "2\n", "authors": ["902"]}
{"title": "Diffusion of Open Access: Why are some disciplines more successful than others?\n", "abstract": " Since the first international statement on open access–the Budapest Open Access Initiative in February 2002, a growing number of open access publishing outlets have become available, and several policies in the European Union and the US have been introduced to mandate the open access archiving of publicly funded research. In spite of these strides, research practices today are still far from completely embracing the open access movement. In this research in progress, we draw on models of the diffusion of changes in institutional practices across networks in order to understand how open source practices of unrestricted access to information and ideas have spread in the academic and research disciplines–in short, the diffusion of open access models of research dissemination across disciplines.", "num_citations": "2\n", "authors": ["902"]}
{"title": "Emergence of new project teams from open source software developer networks: Impact of prior collaboration ties\n", "abstract": " Software development has traditionally been regarded as an activity that can only be effectively conducted and managed within a firm setting. However, contrary to such assertions, the open source software development (OSSD) approach, in which software developers in digital social networks coordinate to voluntarily contribute programming code, has recently emerged as a promising alternative. Although many high profile cases of successful OSSD projects exist, the harsh reality is that the vast majority of OSS projects fail to take off and become abandoned. A commonly cited reason for the failure of OSS projects is the inability of the software project to bring together a critical mass of developers. This paper empirically examines the role of prior collaborative ties on how OSSD project teams are formed. Using software project data from real world OSSD projects, we find that the existence and the amount of prior collaborative relations in the developer network do increase the probability that an OSS project will attract more developers and that a developer’s prior relationships with a project initiator do increase the likelihood that a developer will join a project initiated by a past collaborator. We also explore the performance implications of early team formation behaviors.", "num_citations": "2\n", "authors": ["902"]}
{"title": "What Makes People Visit Internet Stores Again? Customer Loyalty for Purchase Involvements for Electronic Commerce\n", "abstract": " Retaining customer loyalty is crucial in electronic commerce because the value of an Internet store is largely determined by the number of its loyal customers. This paper proposes a multi-phased model of customer loyalty for Internet shopping, which takes the characteristics of the Internet and cyber shopping into consideration. In order to validate the model, we conducted a web-based survey of the customers of various Internet stores, and the data was processed using structural equation modeling analysis. The results indicate that several factors can effectively increase customer loyalty towards an Internet store and that the relative importance of the identified factors varies according to the level of involvement with the product purchased through the store. We suggest several managerial implications in developing Internet stores for higher customer loyalty based on these results.", "num_citations": "2\n", "authors": ["902"]}
{"title": "Reading Minds from Reading Patterns: A Field Experiment on the Effectiveness of Consumption-based Targeting in E-Book Markets\n", "abstract": " To examine the effectiveness of consumption-based targeted promotion strategies in the e-book context, we established a field study with 11,000 participants in cooperation with a major e-book company. As opposed to purchase-transaction data that are commonly leveraged in retail environments, consumption patterns may provide novel and deep insights into consumers’ value consciousness, preferences, and other personal usage traits. The general findings obtained from the study revealed that consumers with low completion rates are more receptive to coupon promotions than those with high completion rates. Likewise, consumers who exhibit concentrated reading patterns are more likely to redeem coupons than customers who display distracted reading behaviors. Consumers who register low completion rates and engage in concentrated reading have the highest response likelihood among the groups with varying consumption patterns. Conversely, book readers with high completion rates and strong propensities for distracted reading are the least likely to redeem promotional coupons.", "num_citations": "1\n", "authors": ["902"]}
{"title": "Incentivizing User Contributions in Idea Crowdsourcing through Quantitative and Qualitative Feedback: A Field Experiment\n", "abstract": " Crowdsourcing is a popular tool for firms to harness external knowledge and resources. One variation of crowdsourcing entails the use of corporate channels in social network services (SNS) such as Twitter to hold public idea competitions. This study examined the role of feedback interaction between participants of idea competitions. More specifically, the study examined the impact of incentives to provide feedback on other participants' ideas. We found that idea competitions where explicit incentives were introduced to elicit crowdsourced feedback in the form of qualitative comments resulted in improved idea generation performance-with more ideas generated overall, and more ideas generated through participant collaborations, through increased comment-posting activities. Based on the findings, implications for theory and practice are discussed.", "num_citations": "1\n", "authors": ["902"]}
{"title": "Exploring the role of visual design in IT acceptance: A study of blog websites\n", "abstract": " Most studies on the adoption of information technology (IT) in work settings have investigated the evaluation of system designs that focus on system functions for improving business performance. However, the use of IT has shifted from maximizing job performance within organizations to performing various daily tasks. In this ubiquitous IT environment, the conditions required to satisfy the demands of diverse user groups are more complicated than those for traditional task-oriented IT professionals. Visual design is an important factor in the adoption decision of users because appearance imbues an emotional value. Thus, the current study focuses on the effect of visual design factors, such as color and layout, in determining the revisit intention of users regarding a blog or website. The findings of this study suggest the necessity of discovering new factors that would help extend understanding of IT usage behavior in …", "num_citations": "1\n", "authors": ["902"]}
{"title": "Electronic Commerce Inter-face lift: Applying Emotive Interface Engineering to Cyber Banking Systems\n", "abstract": " Researchers of emotion have long since established the principle that emotions are indispensable for rational decision making. In this article, we propose an Emotive Interface Engineering methodology that addresses the possibility of applying this to the design of human com-puter interfaces. EIE establishes the interrelation between the design factors and the emotions elicited by a computer interface from the user's perspective. The methodology was employed to evaluate existing cyber banking interfaces. The results support the proposition that certain design factors are more relevant than others for the elicitation of certain emotions. Results also indi-cate that computer interfaces elicit universally common feelings in a majority of users.", "num_citations": "1\n", "authors": ["902"]}