{"title": "Human-centered aspects\n", "abstract": " Humans have remarkable perceptual capabilities. These capabilities are heavily underestimated in current visualizations [759]. Often, this is due to the lack of an in-depth user study to set the requirements for optimal visualizations. The designer does not understand what kind of information should be visualized, how it should be presented or what kind of interactions should be supported. The key elements of successful information visualization are the correct data using the best visualization technique and the best interaction techniques with respect to users. If one of these elements is ignored, people might interpret the data in the wrong way and thus might not understand the underlying information or a pattern.               In order to design effective interactive visualizations, it is important to take into account the limitations of human perception, context of use, and the goals and activities that are to be performed …", "num_citations": "81\n", "authors": ["931"]}
{"title": "Pedagogical effectiveness of engagement levels–a survey of successful experiences\n", "abstract": " In this paper we survey experiments with program and algorithm visualizations (PAVs) where learning improvements have been detected. We analyze these experiments based on the student's level of engagement with the visualizations. There are some features present in most of these, successful, experiments. Therefore they should be taken into account as important factors affecting pedagogical effectiveness of PAVs, these features are: narrative and textual contents, feedback to students' answers and a student centered approach when designing PAV construction kits.", "num_citations": "25\n", "authors": ["931"]}
{"title": "Development of xml-based tools to support user interaction with algorithm visualization\n", "abstract": " As a report of a working group at ITiCSE 2005, this paper represents a vision of the use of XML specifications and tools in algorithm visualization, particularly with regard to supporting user interaction. A detailed description is given of how an interesting event to be visualized is decomposed, combined with interactive questions, narratives, control flow code and metadata, and finally rendered into graphical primitive and transformation specifications. The heart of the paper is our discussion of XML specifications for content generation (the object being visualized), interactive questions, and graphical primitives and transformations, with briefer discussions of narratives and metadata. Examples are provided for each in an appendix, with fuller details to be published on an associated website that we hope will become a source of future standards in this area. In conclusion, the approach of the working group is discussed …", "num_citations": "21\n", "authors": ["931"]}
{"title": "Investigating the effect of realistic projects on students' motivation, the case of Human-Computer interaction course\n", "abstract": " The aim of this study is to test the effect of a concrete way to use practical exercises in a human-computer interaction course. Our approach is focused on lab sessions, replacing typical concrete exercises with realistic projects based on collaborative work, long term duration (the whole course instead of concrete labs) and multidisciplinary design interacting with real end-users. The realistic projects approach supports the practice of theoretical concepts together with professional skills development, e.g. social skills needed to interact with end-user without technical background. In order to assess this approach we have conducted a comparative study with three different groups involving 133 students. Two groups followed the realistic projects approach, the difference between them was end-users recruitment. End-users were recruited by teachers in one group and by the students in the other. The third group followed …", "num_citations": "20\n", "authors": ["931"]}
{"title": "ClipIt: Supporting social reflective learning through student-made educational videos\n", "abstract": " ClipIt is an online social learning platform focused on reflective learning using videos created by students. ClipIt does not follow a fixed methodology, nor is classroom based or teacher-led. Instead it responds to the online distance education paradigm, promoting both social and collaborative interaction and inducing to follow activity steps with subtle guidance which allows for maximum flexibility for the teacher. This paper presents the ClipIt platform and supporting a student-driven reflective learning process, specially focusing on social and collaborative interaction.", "num_citations": "20\n", "authors": ["931"]}
{"title": "VAST: Visualization of abstract syntax trees within language processors courses\n", "abstract": " In this poster we present VAST, a visualization tool to support teaching language processors. On the one hand, VAST provides an API that allows generating visualizations of abstract syntax trees (AST). This process is independent of the parser generator. On the other hand, VAST provides an advanced interface to animate the AST construction process and to cope with huge ones.", "num_citations": "17\n", "authors": ["931"]}
{"title": "Effortless construction and management of program animations on the web\n", "abstract": " We describe an extension of a programming environment to generate web-based program animations. Emphasis is put on requiring little effort from the instructor that handles the system. User interaction is reduced to a minimum, mostly for customizing the animations. Both construction and maintenance are considered in order to guarantee low effort in an actual educational scenario. We describe several aspects of a program animation: the different kinds of information that compose it, its construction process, alternative graphical designs for web publishing, and its implementation as a package. In general, the instructor will wish to use the system to construct and handle a collection of animations for one or several courses. Therefore, we also consider the creation and management of collections of animations in a effortless way. Finally, we describe our experience as well as related work.", "num_citations": "15\n", "authors": ["931"]}
{"title": "SOTA: a visualization tool for symbol tables\n", "abstract": " SOTA stands for SymbOl Table Animator. It is an educational tool that allows visualizing the structure of the symbol table during the compilation of a program. SOTA allows the user to view simultaneously the source code of the program, the graphical representation of the symbol table and a list of actions performed on the symbol table by dividing respectively the interface into three areas: the program area, the state area and the messages area (see Figure 1). In the program area, the last token processed is always highlighted; it is synchronized with the state area, where the current state of the symbol table is graphically displayed, and with the messages area where all the operations done until the moment are listed. Also if an operation is selected in the messages area, the related token is highlighted in the program area.The state of the symbol table is displayed graphically as a tree. Nodes represent environments …", "num_citations": "15\n", "authors": ["931"]}
{"title": "A novel group engagement score for virtual learning environments\n", "abstract": " STEM (Science, Technology, Engineering, and Math) education is currently receiving much attention from governments and educational institutions. Our work is based on active learning and video-based learning approaches to support STEM education. Here, we aimed to increase student's engagement through reflective processes that embrace video film-making, and subsequent on-line discussion and evaluation of those videos. We propose a group engagement score that takes into account both individual activity and similarity of participation, thus allowing corrective actions to be taken when unengaged students or groups are identified. We tested these ideas using our own social learning platform that combines the principal features of Social Networks with tools that facilitate collaborative learning design. This platform stimulates students' learning by means of two main reflective processes: participatory …", "num_citations": "14\n", "authors": ["931"]}
{"title": "A gentle introduction to mutual recursion\n", "abstract": " Recursion is an important topic in computer science curricula. It is related to the acquisition of competences regarding problem decomposition, functional abstraction and the concept of induction. In comparison with direct recursion, mutual recursion is considered to be more complex. Consequently, it is generally addressed superficially in CS1/2 programming courses and textbooks. We show that, when a problem is approached appropriately, not only can mutual recursion be a powerful tool, but it can also be easy to understand and fun. This paper provides several intuitive and attractive algorithms that rely on mutual recursion, and which have been designed to help strengthen students' ability to decompose problems and apply induction. Furthermore, we show that a solution based on mutual recursion may be easier to design, prove and comprehend than other solutions based on direct recursion. We have …", "num_citations": "14\n", "authors": ["931"]}
{"title": "A framework for the automatic generation of algorithm animations based on design techniques\n", "abstract": " A novel approach to algorithm animation consists in displaying algorithms based on their design technique. In this paper, we describe a framework to generate these animations without effort from the instructor. We describe a preprocessing phase that modifies the source code of the algorithm to visualize. When the transformed code is executed, a trace is stored and then used to generate an animation. We also describe the architecture of the animation subsystem. Finally, we outline the main features of SRec, a system that we have built to illustrate the feasibility of this approach. It is aimed at visualizing multiple views of recursion, namely traces, the control stack and activation trees.", "num_citations": "14\n", "authors": ["931"]}
{"title": "R-ZOOM: A visualization technique for algorithm animation construction.\n", "abstract": " In this paper a new visualization technique to deal with large sets of items is described. We call it R-Zoom, which stands for Row-splitting Zoom. This technique is applied to the construction of algorithm animations. Discrete animations are built from a sequence of snapshots, which are the stages of the execution of the algorithm. The user has to select which ones will be in the animation, and R-Zoom assists the user in this task. R-Zoom accumulates the time saving feature of zoom interfaces with context information facilities of focus+ context interfaces.", "num_citations": "14\n", "authors": ["931"]}
{"title": "Syntax trees visualization in language processing courses\n", "abstract": " This paper describes the educational tool VAST. We designed VAST to be used in compiler and language processing courses. The current version allows generating and visualizing syntax trees and their construction process. The main advantages of VAST follow: it is designed to be as independent from the parser generator as possible, it allows students to visualize the behaviour of parsers they develop, and it has an interface designed to easily handle huge syntax trees. We describe different ways of using VAST in educational settings as well as a usability evaluation.", "num_citations": "12\n", "authors": ["931"]}
{"title": "Engaging students in creative learning tasks with social networks and video-based learning\n", "abstract": " Video-based learning is a widely used approach for teaching. This paper investigates how this approach could be improved with other well known methodology: computer supported collaborative learning (CSCL). The integration of both approaches results in a creative and engaging educational activity, collaborative film-making. This task is supported by a platform developed as a social network During the design of the platform, opinions of teachers and students were taken into account. Both, teachers and students, agreed that this approach helps students to understand threshold concepts. In addition, students identified useful facilities in the platform like group-private workspaces or commenting tools. Students' satisfaction was high, in fact they recommend the use of this approach in more subjects.", "num_citations": "11\n", "authors": ["931"]}
{"title": "Multiple usability evaluations of a program animation tool\n", "abstract": " SRec (System for RECursion animation) is an educational software tool that allows creating animated interactive visualizations of recursive algorithms written in the Java language. In this paper, we present the results of four usability evaluation sessions held with our students. Usability was mainly evaluated with respect to easiness of use, adequacy to the task, quality, and if the user liked it. This untypical sequence of usability evaluations also has resulted in some interesting lessons on the development of educational software.", "num_citations": "10\n", "authors": ["931"]}
{"title": "An instructor’s guide to design web-based algorithm animations\n", "abstract": " Much research effort was directed in last years to address two key issues in Web-based algorithm animations: lack of evidence of their educational benefit, and the considerable effort put on the part of instructors to construct animations. Consequently, there is a valuable corpus of lessons learnt to design effective algorithm animations, but these recommendations are very general. The designer of an animation has no guide for fine-grain decisions, which often are the basis of a successful animation. The goal of this study is to deepen in these issues by identifying good choices for the number of animations, structure and size of an animation, and size and value of input data. We describe the problem, our hypothesis and our findings, written as an instructor’s guide for the design of educationally effective animations.", "num_citations": "10\n", "authors": ["931"]}
{"title": "Visualizing the symbol table\n", "abstract": " Visualization has been widely used in computer science educational environments. In the field of language processors, visualization has mostly been applied to lexical and syntactic analysis. We have not found any educational tool dedicated to the symbol table. Thus, we have developed a visualization tool for teaching the symbol table concepts called SOTA [1](SymbOl Table Animator).This tool allows the user to view simultaneously the source code of the program, the graphical representation of the symbol table and a list of actions performed on the symbol table. These three views are synchronized. The state of the symbol table is displayed graphically as a tree, enriched with a color code. Nodes represent scopes of the program and arcs represent bindings between each scope and its parent. Animations are built based on the different states of the symbol table during the analysis of a program; they can be …", "num_citations": "10\n", "authors": ["931"]}
{"title": "Empirical evaluation of usability of animations in a functional programming environment\n", "abstract": " Algorithm animations have been used for teaching computer programming since the birth of the field in the late seventies. One of the most notable obstacles to their adoption is the considerable effort that the production of program animations represents for the instructor. To foster the use of animations among students, we have extended the integrated programming environment (IDE) WinHIPE with visualization and animation capabilities [1]. The environment has been used for teaching functional programming at the Universidad Rey Juan Carlos in the last two years.    In the academic year 2001/2002, an experiment was made [2] to compare two versions of the same IDE: TurboHIPE (a textual IDE) and WinHIPE 1.0 (a graphical IDE). Results showed that students who used WinHIPE were enthusiastic with animations but they did not learn more than those who used TurboHIPE.    We have conducted an experiment to obtain empirical evidence about whether WinHIPE 2.0 allows building animations easily and with minimal workload. We have also analyzed whether animations are easy to use and whether they are perceived by the students as an aid for other tasks. We describe in this report the experiment in detail, as well as its results.", "num_citations": "10\n", "authors": ["931"]}
{"title": "Comparing the effectiveness of different educational uses of program animations\n", "abstract": " In this paper we study two different approaches to using program animations with educational aims: their construction by students-a constructivist and active approach-and their vision-a less active approach. In addition, we compare both approaches to a traditional teaching methodology where animations are not used. We have conducted an experiment with functional program animations using an existing IDE with visualization features called WinHIPE. We have analyzed the results in terms of Bloom's Taxonomy and the complexity of the topics covered. We have detected learning improvements in high levels of Bloom's Taxonomy, namely analysis and synthesis. Moreover, our results show that program animations are unnecessary for simple topics, support the joint use of vision and construction tasks in medium-complexity topics, and recommend vision tasks together with the typical methodology but without the …", "num_citations": "7\n", "authors": ["931"]}
{"title": "Assessing the usability of a cookies-based access monitoring tool for a CMS\n", "abstract": " We have developed several tools to allow instructors analyze students' interactions in a Course Management System. In this paper we describe a Systematic Usability Evaluation designed to test the usability of one of these tools. The evaluations were based on task analysis and follow-up studies. We have assessed effectiveness, efficiency, usefulness, ease of use, learnability, and user's satisfaction of the tool. In addition to regular observation and questionnaires, 3- scope video recording was used to provide the evaluator with more information about interactions. The use of this technology helped us in identifying functions and features that need improvement. We describe the three-step method that we have developed and the satisfactory results it has provided us.", "num_citations": "7\n", "authors": ["931"]}
{"title": "A long-term evaluation of educational animations of functional programs\n", "abstract": " In this paper we study two different approaches to using program animations with educational aims: their construction by students -a constructivist and active approach- and their vision -a less active approach. In addition, we compare both approaches to a traditional teaching methodology where animations are not used. We have conducted a long-term evaluation with functional program animations using an existing IDE with visualization features called WinHIPE. Our results are mixed. Students have a positive opinion about the animations, either viewing or constructing them. While the viewing approach improves some aspect of knowledge acquisition, both approaches decrease the fail-rate. Finally, the construction approach improves the students' attitude towards the subject. Therefore, both uses of program animations should be integrated in the teaching methodology.", "num_citations": "6\n", "authors": ["931"]}
{"title": "Student activity and profile datasets from an online video‐based collaborative learning experience\n", "abstract": " This paper describes two datasets extracted from a video‐based educational experience using a social and collaborative platform. The length of the trial was 3 months. It involved 111 students from two different courses. Twenty‐nine came from Computer Engineering (CE) course and 82 from Media and Communication (M&C) course. They were organised into nine interdisciplinary groups. Each group included three or four CE students and eight or nine M&C students. An additional group filmed the making of. This group has only M&C students. Four teachers supervised the trial. The total number of meaningful events was 2984.", "num_citations": "5\n", "authors": ["931"]}
{"title": "¡ Estudiantes creativos! Creación de vídeos educativos en redes sociales educativas\n", "abstract": " Este capítulo se centra en un proceso reflexivo de creación de vídeos educativos donde los alumnos son los autores de los mismos. La metodología de trabajo se centra en trabajar un concepto umbral en formato audiovisual y discutirlo con los propios compañeros a través de una red social educativa. Tanto la creación del vídeo como el proceso de discusión aportan un aprendizaje significativo al alumno quien toma un rol totalmente activo en su proceso de aprendizaje. Con el objetivo de ilustrar el proceso completo se han incluido distintos vídeos creados por alumnos de diferentes asignaturas así como imágenes correspondientes al proceso de discusión y reflexión que se lleva a cabo en la plataforma y donde gracias a la revisión por pares supervisada por el profesor, los alumnos van aprendiendo de sus compañeros en un entorno activo y colaborativo seguro.", "num_citations": "5\n", "authors": ["931"]}
{"title": "Trending Breakthroughs in Human-Computer Interaction J. UCS Special Issue\n", "abstract": " There has been an increasing role of computers and machines in society over the last years. This has motivated Human-Computer Interaction (HCI) to become an important field for both industry and academy. In fact, there is currently an especial interest in the design, development and implementation of applications highlighting user-friendly interfaces.This special issue aims at a full discussion on new trends in Human-Computer Interaction, bringing together trending papers and breakthroughs in this field. In particular, we invited authors of best papers presented at the XIV International Conference on Human-Computer Interaction (Interacción 2013) to submit thoroughly revised versions of their contributions to this special issue. Interacción Conference provides an annual forum for disseminating the results of innovative research in Human-Computer Interaction concerning usability, accessibility, evaluation of …", "num_citations": "5\n", "authors": ["931"]}
{"title": "Generación semiautomática de animaciones de programas funcionales con fines educativos\n", "abstract": " En esta tesis doctoral presentamos un modelo para la generación de animaciones de programas funcionales. Los puntos clave de este modelo son su simplicidad, el poco esfuerzo que los usuarios deben dedicar a la construcción de las animaciones y las ventajas de su uso educativo.  Las animaciones de programas son visualizaciones dinámicas de su comportamiento. Una de las ventajas más importantes que aportan las tecnologías de visualización es ayudar a la formación de modelos mentales, más aún si lo que se visualiza es un concepto abstracto. Los conceptos que los alumnos deben aprender sobre programación funcional son totalmente abstractos; por lo tanto, las animaciones de programas funcionales ayudarán a los estudiantes a comprender su funcionamiento, facilitando su aprendizaje.  El modelo de construcción propuesto se compone de un conjunto de tareas, unas automatizables y otras manuales, por ello es un proceso semiautomático. Su simplicidad y el poco esfuerzo necesario se consiguen automatizando al máximo el proceso, y haciendo que las tareas donde se necesita la intervención del usuario sean lo más sencillas posibles.  La visualización de programas y algoritmos no es un campo nuevo, tiene más 35 años. Sin embargo, el uso educativo de las visualizaciones se ha basado durante bastante tiempo en la creencia, sin respaldo empírico, de su eficacia como herramientas pedagógicas. Actualmente, existen resultados que muestran beneficios pedagógicos en el uso de las animaciones en situaciones concretas. Desde un punto de vista general, coge fuerza la idea de que las animaciones ayudan en el …", "num_citations": "5\n", "authors": ["931"]}
{"title": "Improving students' performance with visualization of error recovery strategies in syntax analysis\n", "abstract": " Visualization technologies can be used to enhance teaching materials. This work is focused on a complex aspect of syntax analysis, syntax error recovery strategies. Compiler visualization is not a new research field, but the authors have not found any visualization tool dealing with this topic. We have enhanced a parser visualization tool called VAST to produce educational visualizations regarding syntax error recovery strategies. We have evaluated the enhanced version of VAST and its visualizations about syntax error recovery strategies. We have detected that students who used the enhanced tool improved their performance developing syntax specifications with error recovery. Consequently, these students significantly improved their learning outcomes regarding error recovery exercises.", "num_citations": "4\n", "authors": ["931"]}
{"title": "Building LL (1) grammars and parsers using VAST and ANTLR\n", "abstract": " This evaluation tests the educational e ectiveness after us- ing VAST to design LL grammars and parsers with a punctual use. The results shows that with just one session there are not signi cant di er- ences in using or not VAST. However, we can see how the students get used easily to the tool and likes it.", "num_citations": "4\n", "authors": ["931"]}
{"title": "Improving compilers education through symbol tables animations\n", "abstract": " This paper presents the evaluation of an educational tool focused on the visualization of the symbol table in the context of a compiler course. In a first evaluation we used simulation exercises and tested basic concepts of symbol tables. We detected efficiency improvements, students who used the tool completed the exercises with the same grading and significantly faster than the students who did not use the tool. In addition students' opinion was positive. In a second evaluation we used more active tasks, and tested students' skills on writing parser specifications regarding symbol table management. We have detected significant improvements. Students who used the tool outperformed those who did not use the tool in a 22%.", "num_citations": "4\n", "authors": ["931"]}
{"title": "Educational visualizations of syntax error recovery\n", "abstract": " This work is focused on the syntax error recovery visualization within the compilation process. We have observed that none of the existing tools, which display some views of the compilation, give a solution to this aspect. We present an educational tool called VAST which allows to visualize the different views of the compilation process. Besides, VAST allows to display different syntax error recovery strategies.", "num_citations": "4\n", "authors": ["931"]}
{"title": "Vast: a visualization-based educational tool for language processors courses\n", "abstract": " In this demonstration we present VAST, a visualization tool to support teaching language processors. On the one hand, VAST provides an API that allows generating visualizations of syntax trees independently of the parser generator. On the other hand, VAST provides a GUI with multiple views: the source code, the stack and the syntax tree.", "num_citations": "4\n", "authors": ["931"]}
{"title": "Interactive visualization of recursion with SRec\n", "abstract": " SRec is an animation system of recursion intended to assist in algorithm courses. We present the main contributions of version 1.1. First, SRec fully supports any kind of recursion. Second, it provides three additional graphical representations for divide-and-conquer algorithms. Finally, it is highly interactive to promote an exploratory style of learning.", "num_citations": "4\n", "authors": ["931"]}
{"title": "Software educativo en Procesadores de Lenguajes: del enfoque genérico al enfoque centrado en el estudiante\n", "abstract": " La ensenanza de asignaturas como Procesadores de Lenguajes o Compiladores se ha visto apoyada por herramientas profesionales y educativas, principalemnet basadas en tecnologıas de visualización. Ambas carecen de un enfoque genérico, ya que o tratan parcialmente algunos conceptos de las asignaturas o son totalmente dependientes de alguna herramienta profesional. En esta comunicación describimos VAST, una herramienta educativa de visualización que trata de cubrir las carencias antes mencionadas. Tras evaluarla, hemos detectado una falta de enfoque centrado en el estudiante, provocado por el requisito de generalidad. A continuación proponemos dos integraciones que acercan el enfoque genérico original a un enfoque más centrado en el estudiante. Tras evaluar la integración concluimos que la nueva versión de VAST tiene la misma capacidad de generalización mejorando respecto de los estudiantes la facilidad de uso, la ayuda al aprendizaje, la satisfacción y la calidad.", "num_citations": "4\n", "authors": ["931"]}
{"title": "Educational Impact of Syntax Directed Translation Visualization, a Preliminary Study\n", "abstract": " This work studies the effect of using software visualization to teach syntax directed translation, a complex topic within compiler subjects. A trial was conducted with 34 students using LISA as the visualization tool. It was divided in two phases. Firstly, student's experience during compilers construction labs was studied, comparing LISA versus CUP. All participants used both tools and answered a questionnaire. LISA was scored as more motivational and easier to use. Moreover, key theoretical concepts were better identified with LISA. Secondly, a typical lecture (control group) was compared against a lecture using LISA (treatment group). Students were randomly distributed between both groups and answered a knowledge test following the lectures. Results showed that the treatment group significantly outperformed the control group. However, areas for improvement have been detected even in the treatment group …", "num_citations": "3\n", "authors": ["931"]}
{"title": "A social platform supporting learning through video creation by students\n", "abstract": " This courseware contribution describes the work done based on a social networking platform for educational purposes. The main task of the students will be creating videos related to concepts of inheritance. One of the main roles of the platform is to facilitate communication and discussion among students during the video creation process. Students thought that private discussion forums and video rating were the most useful tools. In addition students are satisfied with the learning experience.", "num_citations": "3\n", "authors": ["931"]}
{"title": "LITE (Laboratory of Information Technologies in Education), URJC\n", "abstract": " The research group LITE (Laboratory of Information Technologies in Education), at the URJC, is presented. Its main research lines are: software visualization, educational systems based on educational taxonomies, CSCL, systems based on mobile devices, eLearning/bLearning, and adaptive interfaces. In parallel, we have proposed and evaluated several innovations for programming education.", "num_citations": "3\n", "authors": ["931"]}
{"title": "Design and evaluation of R-Zoom, a new focus+ context visualization technique\n", "abstract": " The paper presents the design and evaluation of R-Zoom, a focus+context information visualization technique. R-Zoom was designed to deal with large sets of items with specific structural properties (sequential order, heterogeneous sizes), and behavior requirements (flexible interaction, maximizing screen space, minimizing changes in screen). It was evaluated and compared to an overview+detail interface with 43 participants. Experienced users of R-Zoom completed tasks faster and with fewer errors than users of the overview+detail interface. Furthermore, a satisfaction questionnaire showed that users felt more comfortable with R-Zoom.", "num_citations": "3\n", "authors": ["931"]}
{"title": "SOTA, una herramienta educativa para la enseñanza de la tabla de símbolos\n", "abstract": " Se presenta una herramienta educativa para el aprendizaje de la tabla de símbolos, dentro del marco de una asignatura de enseñanza de compiladores. La herramienta muestra de forma visual el funcionamiento de una tabla de símbolos durante el proceso de análisis de un código fuente. Planteamos también una propuesta de evaluación de la herramienta que se llevará a cabo en el segundo semestre del presente curso académico dentro de la asignatura de Procesadores de Lenguajes de la titulación de Ingeniería Informática en la Universidad Rey Juan Carlos.", "num_citations": "3\n", "authors": ["931"]}
{"title": "An approach to the use and automatic generation of web-based learning materials\n", "abstract": " This paper presents an approach to the automatic generation and use of web-based learning materials (WLMs). It consists in three phases: contents creation, division and browsing. The use of XML in the creation phase allows achieving independence between contents and their presentation, in addition to contents reuse. The splitting phase is an automatic process whose output can be used as WLMs for different user interfaces. In the browsing phase, the interfaces are generated; we have implemented two: a user-adaptative interface and a non-adaptative one. The main features of our approach enables users to create learning contents without XML technical knowledge and also enables to effectively navigate the material to their needs.", "num_citations": "3\n", "authors": ["931"]}
{"title": "Reduction and flip-zooming in comprehension-preserving miniatures of program visualizations\n", "abstract": " REDUCTION AND FLIP-ZOOMING IN COMPREHENSION-PRESERVING MINIATURES OF PROGRAM VISUALIZATIONS Francisco Gortázar-Bellas, Jaime Urquiza-Fuentes and J. Ángel Velázquez-Iturbide Depto. de Informática, Estadística y Telemática Universidad Rey Juan Carlos C/ Tulipán s/n 28933 Móstoles, Madrid Spain Abstract One of the main problems to widely adopt animations in programming education is the difficulty of their production. We have developed a framework for program animation that reduces the user workload to a minimum. A key element of our framework is the simultaneous display of reductions of program visualizations (ie miniatures) so that the user can choose those most relevant to form an animation. The main problem, to preserve their comprehensibility, has been faced from several approaches. In this paper, we present two of them in their final form. Firstly, we present an algorithm …", "num_citations": "3\n", "authors": ["931"]}
{"title": "Increasing students’ responsibility and learning outcomes using partial Flipped Classroom in a Language Processors course\n", "abstract": " More than twenty years have passed since the term Flipped Classroom was coined. Despite of the increasing interest in this teaching methodology, fields like Computer Science still need more research in order to judge the impact of this methodology in the learning process. This work presents a comparative study between traditional lectures and a partial application of the Flipped Classroom methodology in the subject Language Processors of a Computer Science degree. The study involved 158 students during two weeks and focused on practical contents of the subject. The results show that students in the Flipped Classroom group were more responsible of their learning process, consequently they got significant better learning outcomes either during or at the end of the learning process. Students' satisfaction was highly positive as well. This work increases the amount of experiments about Flipped Classroom …", "num_citations": "2\n", "authors": ["931"]}
{"title": "Building LR (1) grammars and parsers using VAST and Cup\n", "abstract": " In this document we describe an evaluation performed with VAST to build LR (1) parsers and grammars. The results of the evalua- tion are satisfactory, so although we did not  nd any statistics signi cant di erences, we noticed that students could  nish the exercises faster. Be- sides the number of deliveries was higher in the treatment group than in the control one.", "num_citations": "2\n", "authors": ["931"]}
{"title": "Preliminary evaluation of the syntax error recovery visualization using VAST\n", "abstract": " This document describes the preliminary evaluation of the syntax's error recovery visualization using VAST. This evaluation was performed after implementing this new functionality into VAST. As we can read in the document, results are satisfactory, so we obtain tips of how to continue the development of VAST.", "num_citations": "2\n", "authors": ["931"]}
{"title": "Evaluación de Niveles de Implicación de los Estudiantes con Animaciones de Programas Funcionales\n", "abstract": " En este capítulo analizamos los distintos niveles de implicación de los estudiantes con las animaciones de programas, en el marco de la enseñanza de la programación funcional. La evaluación tuvo lugar a lo largo de un curso de programación funcional, dividimos a los estudiantes en tres grupos: los que  no usaron animaciones, los que las usaron como material de consulta, y los que se dedicaron a construirlas. Comparando la opinión de los estudiantes, los datos de presentación al examen y las calificaciones obtenidas, concluimos que: el uso de animaciones, ya sea construyéndolas o como herramienta de consulta, mejora significativamente el aprendizaje de los conceptos estudiados, además la opinión de los alumnos coincide con este resultado; sin embargo, la construcción de las animaciones motiva significativamente más a los estudiantes, mejorando su interés por la asignatura.", "num_citations": "2\n", "authors": ["931"]}
{"title": "An evaluation of a symbol table visualization tool\n", "abstract": " This paper presents the evaluation of SOTA, an educational tool for the visualization of symbol tables in compiler courses. A controlled experiment was conducted where pedagogical efficiency and the students’ opinion were evaluated. Students (n= 45) were asked to answer three tests on symbol table concepts and a questionnaire on the tool. The evaluation indicates that SOTA fosters students to use it. They feel comfortable with it because they believe that: it has good quality, it is easy to use and useful, and it helps them in studying symbol table concepts. More importantly, SOTA facilitates learning, in the sense that it reinforces their trust in the knowledge acquired. Students who used the tool solved the problems correctly and significantly faster than students who did not use the tool.", "num_citations": "2\n", "authors": ["931"]}
{"title": "Revisión de herramientas de visualización de la Traducción Dirigida por Sintaxis\n", "abstract": " La enseñanza de la asignatura de Compiladores se ha convertido en un verdadero reto debido a la existencia de conceptos abstractos que no se comprenden inmediatamente. Pensando que la visualización ayudará a esta comprensión, este estudio analizará las soluciones publicadas para la visualización de la traducción dirigida por la sintaxis. Tras buscar en la bibliografía se identificaron las herramientas LISA, CUPV, VCOCO y EvDebugger. De estas se analizaron parámetros como el ámbito de uso, aspectos visualizados o la concordancia que existe entre la visualización y la especificación del traductor. El resultado más sorprendente es que la herramienta no diseñada para el ámbito educativo, LISA, presenta mayor concordancia entre la visualización y la especificación. Aparte de esto cabe destacar: la coherencia con la asignatura y concordancia entre especificación y visualización de EvDebugger, las posibilidades interactivas de LISA y el uso de notaciones estándar en LISA, CUPV y VCOCO.", "num_citations": "1\n", "authors": ["931"]}
{"title": "Plataforma social para el aprendizaje basado en vídeos creados por los estudiantes\n", "abstract": " Esta contribución describe el trabajo realizado sobre una plataforma basada en redes sociales con fines educativos. La tarea principal de los alumnos será la creación de vídeos relacionados con conceptos de herencia en Java. Uno de los papeles principales de la plataforma es facilitar la comunicación y discusión entre los estudiantes durante el proceso de creación del vídeo. De todas las herramientas disponibles, las más valoradas fueron los foros privados y las valoraciones de los vídeos. Además los estudiantes están satisfechos con la experiencia, creyéndola de utilidad para otras asignaturas.", "num_citations": "1\n", "authors": ["931"]}
{"title": "Visualization of the syntax error recovery within the compilation process\n", "abstract": " This work is focused on syntax error recovery, a complex aspect of syntax analysis. We have enhanced a parser visualization tool called VAST to produce educational visualizations of this topic. Compiler visualization is not a new research field, but the authors have not found any visualization tool dealing with this topic. We have evaluated the enhanced version of VAST and its visualizations about syntax error recovery strategies. We have detected that students who used the enhanced tool improved their performance developing syntax specifications with error recovery. Consequently, these students significantly improved their learning outcomes regarding error recovery exercises.", "num_citations": "1\n", "authors": ["931"]}
{"title": "Syntax error recovery visualization. Evaluation using VAST and Cup\n", "abstract": " In this document we describe the evaluation of the syntax error recovery using VAST and Cup. In this case we performed a com- plete evaluation of the panic error recovery strategy. The results of the evaluation are satisfactory, so the numbers of deliveries and marks are higher in the treatment group than in the control one", "num_citations": "1\n", "authors": ["931"]}
{"title": "Building LL (1) parsers with VAST. Second usability and educational evaluation\n", "abstract": " VAST is an educational tool to use in subjects as compilers and language processors which allows to display the syntax tree. Its main feature is that can be used independent from the generation tool used to build the parser. This makes possible to visualize and animate the syntax tree generated by the parser. In this work we describe the second usability and educational evaluation using VAST comparing the results with ANTLR and ANTLRworks", "num_citations": "1\n", "authors": ["931"]}
{"title": "VAST. Evaluation of the execution-visualization functional integration\n", "abstract": " This document describe an observational and usability evalu- ation of VAST in the course 2008-2009. This evaluation was performed af- ter implementing the  rst functional integration called execution-visualization. The results of this evaluation show that students like VAST but it is necessary to add new features as the second functional integration, annotation-generation-compilation.", "num_citations": "1\n", "authors": ["931"]}
{"title": "Reorganización de las prácticas de compiladores para mejorar el aprendizaje de los estudiantes\n", "abstract": " La parte práctica de asignaturas como Compiladores o Procesadores de Lenguajes (las trataremos como la misma en el resto de la comunicación) suele ser bastante costosa, ya que requiere cierto grado de planificación y continuidad en el trabajo de los estudiantes y las herramientas utilizadas no tienen una conexión clara con los fundamentos teóricos. Nuestra propuesta estructura estas sesiones prácticas en tres tipos: las que se encargan de enlazar teoría y práctica, las que introducen a los estudiantes las herramientas de generación de compiladores y la final donde se desarrolla un compilador de cierta complejidad. Con este enfoque hemos mejorado el porcentaje de éxito en la parte práctica hasta un 86%.", "num_citations": "1\n", "authors": ["931"]}
{"title": "Evaluación educativa de VAST con analizadores LR (1). Visualización vs no visualización.\n", "abstract": " VAST es una herramienta educativa para compiladores y  procesadores del lenguaje que permite visualizar el árbol sintáctico. Su  principal característica es que puede utilizarse independientemente de la  herramienta de generación utilizada, permitiendo la visualización y animación  del árbol generado por el analizador. Tras la realización de una evaluación de  larga duración comparando  el uso de VAST con una metodología clásica sin  uso de visualizaciones, se obtuvieron resultados satisfactorios  tanto en eficacia  educativa como en usabilidad.", "num_citations": "1\n", "authors": ["931"]}
{"title": "Improving a zoom+ pan interface with overview+ detail or focus+ context features: a comparative evaluation\n", "abstract": " We present an evaluation of adding Focus+Context vs. Overview+Deatil features to a Zoom+Pan interface. The framework of the evaluation is an interface to deal with large sets of items with specific structural properties (sequential order, heterogeneous sizes), and behavior requirements (flexible interaction, maximizing screen space, minimizing changes in screen). The evaluation involved 43 participants. We studied the effect of three factors (namely, experience with the tasks, size of the sets, and tasks performed with the same set) on effectiveness, efficiency and user’s satisfaction. The results show that experienced users of the interface enhanced with the Focus+Context features obtained the best results on effectiveness and efficiency. Furthermore, a satisfaction questionnaire showed that users felt more comfortable with the Focus+Context approach.", "num_citations": "1\n", "authors": ["931"]}
{"title": "Experimental report–Evaluation of SOTA, a symbol table visualization tool\n", "abstract": " This report describes the evaluation of SOTA (SymbOl Table Animation), an educational tool for the symbol table [1, 2, 3]. Also, SOTA is a visualization tool, its main features are:", "num_citations": "1\n", "authors": ["931"]}