{"title": "Reuse readiness levels as a measure of software reusability\n", "abstract": " The reuse of software and related artifacts offers the potential for cost savings in various industries and has contributed to the development of the cyberinfrastructure that is used by the Earth science community. Developing measures that enable the assessment of software in terms of its potential reusability can contribute to efforts of both developers and reusers of software. Draft Reuse Readiness Levels (RRLs) have been developed as an instrument for assessing the maturity of software products for potential reuse. The process employed to develop the draft RRLs is described, and the initial summary of topic areas defined for each level is presented. Based on recommendations from the community of Earth science data systems software developers, areas for improving the precision of the draft RRLs have been identified and an approach for identifying enhancements is described.", "num_citations": "19\n", "authors": ["2216"]}
{"title": "A new apsidal motion determination for DI Herculis\n", "abstract": " Burns (1993), and Lacy and Fox (1994) were combined with only the more accurate photoelectric timings that have been tabulated by Guinan and Maloney (1985) and Reisenberger and Guinan (1989). Linear least squares fits were made independently to the", "num_citations": "18\n", "authors": ["2216"]}
{"title": "The software reuse working group: A case study in fostering reuse\n", "abstract": " Packaging software assets for reuse can improve the potential for others to adopt the software. Packaging the software with appropriate documentation and other resources can facilitate decision-making by those considering adoption and can enable them to implement the software more efficiently. Software that can be easily integrated is more likely to be shared with others and reused by the recipients. The NASA Earth Science Data Systems (ESDS) Software Reuse Working Group has been chartered to oversee the process that will maximize the reuse of potential software components. As part of this work, a portal Web site was created to support reuse practices within the Earth science community. This portal also serves as an example of reuse practices, both as a recipient and as a contributor to reuse. This paper describes the assets that were reused to develop the software reuse portal. For each asset reused …", "num_citations": "14\n", "authors": ["2216"]}
{"title": "New Apsidal Motion Determination of the Eccentric Eclipsing Binary V1143 Cygni\n", "abstract": " (1983) and Gimenez and Margrave (1985); they are in good agreement, Khaliullin observing an apsidal motion rate of~ 3? 49/lOOyr+ 0? 38/lOOyr while Gimenez and Margrave observe ci’~~~= 3? 36/lOOyr+ 0? 19/lOOyr. However, Andersen et al.(1987) calculate", "num_citations": "11\n", "authors": ["2216"]}
{"title": "Dellingr: Reliability lessons learned from on-orbit\n", "abstract": " Dellingr, NASA Goddard Space Flight Center’s (GSFC) first 6U CubeSat, was deployed from the International Space Station (ISS) on November 20, 2017. The primary objective of the mission was to apply and appropriately tailor GSFC knowledge and capability to design and build a CubeSat that increased resiliency and capability, while containing costs. The Dellingr spacecraft is a mixture of COTS and in-house components and includes two science instruments–an advanced gated time-of-flight ion-neutral mass spectrometer (INMS) and a boom mounted fluxgate. While a traditional GSFC spacecraft approach includes detailed analysis, design, testing, and extensive reviews, the Dellingr team adopted a “build, test, fix” approach to identify and correct potential mission ending issues. Yet, despite extensive testing, Dellingr immediately experienced unexpected major anomalies once on orbit. Using a flatsat and the insight gained from extensive on-orbit engineering data, the team was able to alleviate some of these anomalies and recover some of the lost functionality. The extensive set of lessons-learned is driving changes to our systems architecture, flight software, and testing approaches, and has provided valuable insight into what is required to produce a NASA CubeSat science mission with a moderate assurance of mission success, while containing resource requirements.", "num_citations": "10\n", "authors": ["2216"]}
{"title": "Software reuse within the earth science community\n", "abstract": " Scientific missions in the Earth sciences frequently require cost-effective, highly reliable, and easy-to-use software, which can be a challenge for software developers to provide. The NASA Earth science community spends a significant amount of resources developing software components and other software development artifacts that may also be of value if reused in other projects requiring similar functionality. In general, software reuse is often defined as utilizing existing software artifacts. Software reuse can improve productivity and quality while decreasing the cost of software development, as documented by case studies in the literature. Since large software systems are often the results of the integration of many smaller and sometimes reusable components, ensuring reusability of such software components becomes a necessity. Indeed, designing software components with reusability as a requirement can …", "num_citations": "10\n", "authors": ["2216"]}
{"title": "Software reuse methods to improve technological infrastructure for e-Science\n", "abstract": " Social computing has the potential to contribute to scientific research. Ongoing developments in information and communications technology improve capabilities for enabling scientific research, including research fostered by social computing capabilities. The recent emergence of e-Science practices has demonstrated the benefits from improvements in the technological infrastructure, or cyberinfrastructure, that has been developed to support science. Cloud computing is one example of this e-Science trend. Our own work in the area of software reuse offers methods that can be used to improve new technological development, including cloud computing capabilities, to support scientific research practices. In this paper, we focus on software reuse and its potential to contribute to the development and evaluation of information systems and related services designed to support new capabilities for conducting scientific …", "num_citations": "8\n", "authors": ["2216"]}
{"title": "Software reuse to support earth science\n", "abstract": " –The WG was started in 2004 to facilitate reuse of software assets within the NASA Earth science community.–Membership is limited to NASA-funded projects and investigators, though there have been many contributions from the general Earth science community.–The WG has been working to establish a “marketplace” for reusable Earth science software artifacts by working to increase the supply and availability of reusable assets.", "num_citations": "8\n", "authors": ["2216"]}
{"title": "A proposal on using reuse readiness levels to measure software reusability\n", "abstract": " The use of scientific data is becoming increasingly dependent on the software that fosters such use. As the ability to reuse software contributes to capabilities for reusing software-dependent data, instruments for measuring software reusability contribute to the reuse of software and related data. The development and current state of a proposed set of Reuse Readiness Levels (RRLs) are summarized, and potential uses of the software reusability measures are described, along with proposed use cases to support sponsorship of software projects, software production, software adoption, and data stewardship during the systems development lifecycle and the data lifecycle.", "num_citations": "7\n", "authors": ["2216"]}
{"title": "Reuse of software assets for the NASA Earth science decadal survey missions\n", "abstract": " Software assets from existing Earth science missions can be reused for the new decadal survey missions that are being planned by NASA in response to the 2007 Earth Science National Research Council (NRC) Study. The new missions will require the development of software to curate, process, and disseminate the data to science users of interest and to the broader NASA mission community. In this paper, we discuss new tools and a blossoming community that are being developed by the Earth Science Data System (ESDS) Software Reuse Working Group (SRWG) to improve capabilities for reusing NASA software assets.", "num_citations": "6\n", "authors": ["2216"]}
{"title": "Relevance of software reuse in building advanced scientific data processing systems\n", "abstract": " Reuse of software and related components can contribute to the development of systems for processing scientific data. The reuse of components, which can be from any stage of the development life cycle, provides opportunities to realize benefits such as reduced costs and learning curves. However, the reuse of existing components also comes with risks that must be recognized in order to be mitigated. The National Aeronautics and Space Administration established the Earth Science Data Systems Software Reuse Working Group to support software reuse among members of the community of Earth science data systems developers. This is done through a variety of activities, including research, education, and public outreach, which are conducted to help encourage and enable reuse within the community. Considerations for realizing the benefits of software reuse and minimizing risks are presented along …", "num_citations": "5\n", "authors": ["2216"]}
{"title": "Building the next generation of aerospace data processing systems by reusing existing software components\n", "abstract": " Software is a key ingredient when developing any aerospace system. It is used in embedded electronics, in flight dynamics, in ground and space data processing, and in the current generation of data products. For example, the National Aeronautics and Space Administration (NASA) Goddard Space Flight Center’s Innovative Partnerships Program Office offers licensing opportunities for software and technologies from a variety of areas relevant to the hardware and software requirements of Earth and space science missions and projects: aerospace/aeronautics, computer software, data processing/analysis, electromechanical devices, electronics, manufacturing equipment, mechanical technologies, nanotechnology, optics and photonics, sensor and detector technologies, subassemblies and components, telecommunications and internet, and test and measurement (IPP Office, 2009). Reuse of existing experience and artifacts eliminates having to “reinvent the wheel” and is a key element to achieving progress in many areas of complex aerospace system development.Originally, in the absence of vendor-provided solutions and commercial off-the-shelf software components, many data and information systems were designed and built as custom applications. However, as the practice of systems and applications development has matured, facilitating reuse of software and reusing previously developed software have been recognized as beneficial for meeting the challenges of developing and maintaining complex systems. Some of the challenges commonly faced by system developers can include dealing with very large quantities of data (eg …", "num_citations": "5\n", "authors": ["2216"]}
{"title": "Progress towards a nasa earth science reuse enablement system (RES)\n", "abstract": " A Reuse Enablement System (RES) allows developers of Earth science software to contribute software for reuse by others and for users to find, select, and obtain software for reuse in their own systems. This paper describes work that the NASA Earth Science Data Systems (ESDS) Software Reuse Working Group has completed to date in the development of an RES for NASA.", "num_citations": "4\n", "authors": ["2216"]}
{"title": "A Community-Developed Measurement of the Reusability of Software Through Reuse Readiness Levels\n", "abstract": " When software is developed with reuse purposes in mind from the start, the resulting product will often be more mature, in a reuse sense, than products which are modified for reuse purposes after they have been developed. But it can be difficult to assess the maturity level of a software product due to the variety of factors that influence its reusability. If these factors could be measured, assessed, and combined into a single scale measuring the maturity of the software in terms of reusability, it would be of great benefit to developers. They will more easily be able to determine how ready the software is for their purposes, and how much modification may be necessary before it can fill their needs. The NASA Earth Science Data Systems (ESDS) Software Reuse Working Group is in the process of developing a set of Reuse Readiness Levels (RRLs) for the purpose of determining the reuse maturity of software assets. These …", "num_citations": "4\n", "authors": ["2216"]}
{"title": "Reuse Readiness Levels (RRLs)\n", "abstract": " ObjectiveRecognizing the need to measure the maturity of software for reuse, the NASA Earth Science Data Systems (ESDS) Software Reuse Working Group (WG) proposes a set of Reuse Readiness Levels (RRLs). The maturity of a particular technology can be measured in various ways, one common method being with Technology Readiness Levels (TRLs) or other similar measurements. However, the ability or readiness of a particular technology to be reused is generally not considered, or plays only a small role if it is considered.", "num_citations": "3\n", "authors": ["2216"]}
{"title": "Reusing software to build data processing systems: NPP science data segment case study\n", "abstract": " Over the years, numerous large and complex information systems have been created to store, process, and disseminate vast volumes of remotely-sensed Earth science data. These systems have the potential to be reused to process similar data from other missions or instruments, reducing risk, schedule, and associated development cost for future projects.", "num_citations": "3\n", "authors": ["2216"]}
{"title": "The Rise and Fall and Final Fall of Supernova SN 1993J in M 81\n", "abstract": " In the figure below the absolute visual magnitudes ofSN 1993J are plotted on the same scale with the LMC supernova SN 1987A. Our observations of SN 1993J have been combined with all the available photometric", "num_citations": "3\n", "authors": ["2216"]}
{"title": "The Software Reuse Portal: A Case Study in Packaging Software to Contribute to Reuse Practices\n", "abstract": " The packaging of software assets can improve the possibility of software reuse. If a software asset is packaged with appropriate documentation and necessary resources to support its reuse, the software asset can be utilized more efficiently. Easily integrable software is, in turn, more likely to be shared with others and reused by the recipients. The NASA Earth Science Data Systems (ESDS) Software Reuse Working Group has developed a website to serve as a portal to support reuse practices within the Earth science community. In addition, the ESDS Software Reuse portal also serves as an example of software reuse practices, both as a recipient and as a contributor to reuse. The portal is built on reusable software and also has been offered as a reusable asset. As a recipient of reuse, the software reuse portal utilizes open source software and has been designed and developed using ideas received from members …", "num_citations": "2\n", "authors": ["2216"]}
{"title": "Measuring Software Reusability for Scientific Data Systems\n", "abstract": " Reusing existing software components and related artifacts offers the potential to reduce costs and to improve the quality of systems and applications that support Earth science and other scientific disciplines. Capabilities to measure the reusability of software artifacts can have benefits for developers and adopters of information systems. Reuse Readiness Levels (RRLs) are being developed to facilitate the measurement of software reusability. The RRLs are described along with the kinds of tools and uses that they offer for supporting the potential reuse of software and components for scientific systems.", "num_citations": "1\n", "authors": ["2216"]}
{"title": "Earth Science Software Reuse Enablement Systems\n", "abstract": " An important part of promoting software reuse is to ensure that reusable software assets are readily available to the software developers who want to use them. This can be done by placing the assets into a software catalog or repository system. The NASA Earth Science Software Reuse Working Group has worked with the Earth science community and has discovered the lack of a centralized software repository whose major role is to provide reusable Earth science software assets. Through continued dialogue with the community, we have identified several major success criteria for an effective software repository. In light of these criteria, we examined the capabilities of NASA and non-NASA software catalogs and repositories. The shortcomings of the existing systems include the following: they do not meet enough of the critical functional criteria, they do not focus on the Earth science domain, they do not target …", "num_citations": "1\n", "authors": ["2216"]}