{"title": "The safety case, its development and use in the United Kingdom\n", "abstract": " In 1974 the United Kingdom adopted new legislation to govern the health and safety of people in the workplace and those that may be affected by workplace activities. The legislation recognises that good safety management is a matter of balancing the benefits from undertaking an activity and protecting those that might be affected directly or third parties. The legislation requires that the risk of harm be reduced'so far as is reasonably practicable'and that those managing the risks demonstrate their understanding and adequate management of that risk. It has given rise to a recognised means of assessing risk and demonstrating that there is satisfactory management in place, through the presentation and maintenance of a safety case. This paper shows how different UK industries have developed and adapted the concept and principles of the Safety Case to demonstrate their understanding and management of risks within their business.", "num_citations": "29\n", "authors": ["2277"]}
{"title": "Improving the Analysis of Data in Safety-Related Systems\n", "abstract": " The behaviour of many complex systems is based not only on their static design but also on configurable data used by the system. In order to assess the safety of such a system, it is necessary to have an understanding about the types of problem such use of data may cause, through a process of safety analysis. This report reviews current guidance and best practice for treatment of data in safety analysis. It finds that while advice exists on how to manage the safety impact of data use after a potential hazard has been identified, there is a lack of tools and guidance for the initial task of hazard identification for safety-related data. A taxonomy of types of data fault is proposed that can be used as a checklist to aid in the hazard identification process. The taxonomy is then validated using accident investigation reports, to determine whether it is capable of classifying the data-related issues seen in real life.", "num_citations": "4\n", "authors": ["2277"]}
{"title": "Safe Data: Recognising the Issue\n", "abstract": " Over the years, several commentators have raised concerns about unsafe data (including Neil Storey in this publication [7]). They pointed out that despite the potentially harmful effects of bad data, the issue was covered poorly in mainstream standards, with little guidance available about how to manage the risks that could arise from them. Systems can use data to describe the environment that they interact with, or their own physical configuration. Data can also be used to direct how systems behave, in a manner similar to software. When data determines some of the behaviour of a system, that data may affect safety at the system level. Data can be bad for a number of reasons. It may be generated incorrectly, with bad values or formatting; it may be corrupted in transmission or storage, or it may become stale through changes in the real-world values it represents. Just as design flaws in software can make a system behave unsafely without any hardware fault, bad data can cause unsafe behaviour without any fault in either the hardware or software. And, as with software, the overall system can often be too complicated for safety to be shown through testing alone.Is this a real issue? Aside from the humorous anecdotes about drivers being led astray by their satnav systems, errors in in-car navigation databases have led to fatal consequences [2]. Similarly, problems with air navigation data have been a factor in several passenger aircraft crashes, such as that of American Airways Flight 965 near Cali in Colombia [1]. The self-destruction of Ariane 5 Flight 501 involved diagnostic data being interpreted as flight data [5]. Just as software modules are …", "num_citations": "2\n", "authors": ["2277"]}
{"title": "End-to-End Reviews: A New Approach to Providing Assurance that a Complex Organisation is Effectively Managing Safety\n", "abstract": " Audits have long been used as a tool for checking that safety management processes are being followed and system safety principles applied, to provide senior managers with assurance that safe outcomes occur by design and not by luck. In a complex hierarchical organisation, the tendency is for audits to concentrate on safety management systems based on individual units within the hierarchy, rather than the activity of the organisation as a whole. In the UK Ministry of Defence, a new approach to assurance is being tested that looks at the effectiveness of safety management processes end-to-end across the Ministry's shipping activities. This paper describes the end-to-end assurance review framework and the results that have been obtained thus far and argues that the end-to-end framework provides a better basis for provision of assurance than the audit system.", "num_citations": "1\n", "authors": ["2277"]}