{"title": "From control to drift: the dynamics of corporate information infastructures\n", "abstract": " Firms are investing considerable resources to create large information infrastructures able to fulfil their varied information-processing and communication needs. The more the drive towards globalization, the more such infrastructures become crucial. The'wiring'of the corporation should be done in a way that is aligned with its corporate strategy-it is global and generates value. This book presents six in-depth case studies of large corporations-AstraZeneca, IBM, Norsk Hydro, Roche, SKF, and Statoil-which offer a rich picture of the main issues involved in information infrastructure implementation and management. Far from being a linear process, the use of the information infrastructure is in fact an open-ended process, in many cases out of control. Current management models and consulting advice do not seem to be able to cope with such a business landscape. This book provides the reader with interpretations and theories that can foster a different understanding and approach.", "num_citations": "1575\n", "authors": ["850"]}
{"title": "The Power of Gifts: organizing social relationships in open source communities\n", "abstract": " In writings on the open source software development model, it is often argued that it is successful as a result of the gift economy that embraces activities in online communities. However, the theoretical foundations for this argument are seldom discussed and empirically tested. Starting with the ‘classic’ theories of gift giving, we discuss how they need to be developed in order to explain gift‐giving practices in digital domains. In this paper, we argue that the gift economy is important, not only because it creates openness, but also because it organizes relationships between people in a certain way. Open source software development relies on gift giving as a way of getting new ideas and prototypes out into circulation. This also implies that the giver gets power from giving away. This power is used as a way of guaranteeing the quality of the code. We relate this practice to how gifts, in the form of new scientific knowledge …", "num_citations": "707\n", "authors": ["850"]}
{"title": "Open source movements as a model for organising\n", "abstract": " Open source software such as the operating system Linux has in a few years created much attention as an alternative way to develop and distribute software. Open source is to let anyone have access to the source code, so that they can modify it. Open source can be seen as a movement, where communities of highly skilled programmers collectively develop software, often of a quality that outperforms commercial proprietary software. These movements are based on virtual networking on the Internet and the web. They are loosely coupled communities kept together by strong common values related to hacker culture. Work seems to be totally distributed, delegated and loosely coupled. The highly skilled members contribute to the collective effort of free software development. In this paper the open source phenomenon is investigated from different perspectives. It is claimed that the open source movement is one key …", "num_citations": "304\n", "authors": ["850"]}
{"title": "Rethinking competence systems for knowledge-based organizations\n", "abstract": " Existing competence systems are based on a rationalistic view of competence. While these competence systems might work in job-based organizations, we argue that in more dynamic settings, such as in knowledge-based organizations, the interest-informed actions that capture the emergent competencies of tomorrow require different types of information technology support. The main objective of this paper is to elaborate on the possibilities and implications of using interest-activated technology as a design rationale for competence systems. This paper is based on an action case study of an implemented interest-activated Intranet recommender system prototype at Volvo Information Technology AB in Gothenburg, Sweden. On the basis of how organizational members used this prototype to find information they were interested in, our research team was able to inquire into how personal interest, embodied in …", "num_citations": "128\n", "authors": ["850"]}
{"title": "Open innovation, generativity and the supplier as peer: The case of iphone and android\n", "abstract": " The diffusion of various forms of digital technologies has acted as a disrupting force in several industries, promoting open and distributed innovation processes. In this paper we argue that the supplier in open innovation networks tends to get a more active role as a creative peer producer, rather than merely a contractual deliverer. A comparative case study of the mobile phone platforms iPhone and Android is used to analyze this shift in innovative value creation. The notion of generative capacity is introduced to the research on open innovation, suggesting that it is generativity rather than openness that drives the platforms’ aggregated wealth. The two cases from the mobile phone industry illustrate that innovation initiatives can successfully approach generativity in different ways and that both openness and control are important to facilitate supplier contributions.", "num_citations": "107\n", "authors": ["850"]}
{"title": "Open source in the firm: Opening up professional practices of software development\n", "abstract": " Opening up firms to open source has changed professional programmers’ work in software development. In their work practice they must cope with two modes of software production: one based on proprietary, closed work situations, the other built around open source community ways of cooperation and knowledge sharing. In this article we present a study of how programmers cope with the co-existence of an industrial/commercial and a community/commons based mode of production. We analyze how they develop strategies to handle tensions that arise from contradictions between these two modes, and how it changes programmers’ approach towards open source software development in the company. The study covers proprietary companies that have gradually incorporated open source software (hybrid companies) and SMEs entirely built around open source business concepts (pure-play companies). Four …", "num_citations": "100\n", "authors": ["850"]}
{"title": "Speech acts on trial\n", "abstract": " In this chapter we discuss the applicability of speech act theory as a theoretical foundation for the design of information technology (IT). We pay special attention to the adaptation speech act theory has undergone when applied to the IT field. One question we address is what happens when we import passive descriptive theories from other disciplines and use them as a basis for active design. We find that speech act theory may be useful, but only if we are aware of its shortcomings. By surveying various criticisms of speech-act-based design along with extensions and alternative approaches, we attempt to pinpoint these shortcomings. To identify breakdowns of speech-act-based methods and discuss the need for further adaptation, we use a framework, which is described in this chapter.", "num_citations": "83\n", "authors": ["850"]}
{"title": "Genres in action: Negotiating genres in practice\n", "abstract": " Presents the initial findings of a genre-based case study at a large Swedish company, with a record of early use of internal e-mail (1982). The design of the particular e-mail system was closely mapped to the organizational hierarchy. One of our informants kept one week of incoming e-mail messages. We then asked questions about each message and how it related to the work of the informant and to the organization. Based on the messages and the interviews, we clustered the messages into different genres. Most of the literature on genres of organizational communication has focused on the genres themselves, e.g. e-mail messages constituting different instances of genres. We found, however, that many messages, rather than being instances of genres, were part of informal conversations. In these conversations, however, it was common to discuss and negotiate which genres were appropriate to use in different …", "num_citations": "55\n", "authors": ["850"]}
{"title": "Practising peer review in organizations: a qualifier for knowledge dissemination and legitimization\n", "abstract": " A key issue in many organizations is how to disseminate information in an effective way and, more importantly, how to make use of this information in order to create new knowledge. One way of addressing this problem is to focus on how information is socially transformed into knowledge. This includes how knowledge is handled in practice and how the knowledge produced is qualified as being something worth knowing and acting upon. Two well-established practices for doing this are the refereeing system and the peer review process. These are used in scientific communities as a means of validating and legitimating knowledge, for example by reviewing journal papers before publishing or project proposals before granting funds, etc. This paper argues that peer review is a useful concept when looking at knowledge creation and legitimization in organizations. The social meaning of peer review is to legitimize …", "num_citations": "41\n", "authors": ["850"]}
{"title": "From workflow to conversation\n", "abstract": " This thesis is about designing information technology to support communicative work. The thesis has a theoretical focus, informed by two empirical studies, but the aim is not to formulate a grand theory, but rather to find new concepts and patterns of thought useful for design. It is based on five papers dealing with the phenomena work, organization, communication and design of information technology. Departure is taken in the view that the role of language is central in the postmodern arena, both as work (i.e. work is communication) and in constituting organizations. While there is research based on this assumption, there is still a great need to find new concepts and new metaphors when designing information technology to support communication and communicative work. The thesis examines, criticizes and elaborates communication models such as speech act theory, conversation analysis and genre theory as a foundation for design In doing this, there is a number of classical issues in industrial work design applicable to communicative work as well, e.g. deskilling versus learning, rule following versus empowerment, local or global control, routinization versus flexibility, workplace democracy, participation in design, etc. These classical questions of work organization and potential effects of information technology on individuals, and organizations are addressed as well.", "num_citations": "31\n", "authors": ["850"]}
{"title": "Multi-discourse conversations\n", "abstract": " The role of speech act theory as a foundation for design of information technology has been vividly discussed and criticized in the CSCW-area. In this paper we extend the speech act approach with ideas from conversation analysis, in order to overcome some of the criticisms. The discourse concept in the tradition of discourse analysis is used to denote routinized and procedural activities in organisations, ie, as a set of coherent speech acts for which there exist strict organizational rules regarding their sequence, who may perform them, under which circumstances etc. The conversation concept in the tradition of conversation analysis denotes a contingent, situated activity, where the language user is viewed as a competent and autonomous agent, guided by the existing social rules and conventions. The problems with IT-design are interpreted in terms of striving for a balance between efficiency, routinization and global control on the one hand, and empowerment, skill and flexibility for the individual, on the other. Finally we introduce a set of metaphors to illustrate the role played by information technology as a mediator of social rules and conventions.", "num_citations": "28\n", "authors": ["850"]}
{"title": "22 High Noon at OS Corral: Duels and Shoot-Outs in Open Source Discourse\n", "abstract": " The open source software (OSS) movement can be related to the societal changes that started in the late 1960s: the rise of a network society supported by new information and communication technologies and the rise of new forms of collective actions, which also have been referred to as “new social movements”(see Touraine 1981; Melucci 1996; Thörn 1997). The emergence of these movements has been explained by changes in the relations between the economic, political, and cultural powers and institutions that have supported a transition from a modern to a late modern or postindustrial society and lately been linked to an understanding of the importance of the rise of a global network society and new forms of communication (Castells 1996; Giddens 1990). The emergence of a network society, or information society, has involved new conflicts regarding the control over information, knowledge, symbolic capital, and social relationships. These are conflicts closely connected to unequal or transformed power relations between different social positions in the new global society. According to both Thörn (1997) and Melucci (1996), it is in this social climate of opposition, ambivalence, and conflict that new forms of collective actions have emerged.American contemporary movements of the 1960s gave rise, as Castells (1996) has shown, to an intellectual climate that contributed to and inspired the march of technical innovations and the “culture of IT”. However, the rise of information technology also gave birth to conflicting ideas about how the tools to create and bring forth information should be developed, and what they should look like. When large …", "num_citations": "26\n", "authors": ["850"]}
{"title": "Social media as management fashion-a discourse perspective\n", "abstract": " Social media platforms and services have rapidly grown into an important societal phenomenon, lately also with increased impact on business. The relative novelty of its occurrence in a business context, the lack of well-grounded best practice and the scarcity of research, result in organizational decision-makers having to rely on vendor descriptions and trade press articles to make sense of social media. By using management fashion theory and discourse analysis, we examine how a management fashion discourse on social media unfolds and enacts social media as a disruptive force that managers must consider in the form of eg strategies, normative guidelines and policies. Our analysis shows that social media discourse differs somewhat from how previous IT fashions have developed, primarily due to the fact that social media discourse is propelled by forces outside the company. We analyze the discourse …", "num_citations": "25\n", "authors": ["850"]}
{"title": "Rethinking competence systems for innovative organizations\n", "abstract": " Information technology (IT) support for managing competence is based on a rationalistic view of competence. While these competence systems might work in rationalistic organizations, we argue that in more dynamic settings, such as in innovative organizations, the interest-informed actions that capture the emergent competencies of tomorrow require different types of IT support. We theorize about these two separate forms of organizations and use them as a means to interpret and classify empirical findings from an action case study of an implemented interest-activated recommender system prototype. The interviews show that competence is perceived as complex and multifaceted and three categories emerge: competence as a formal merit; interest as a complementary aspect of competence; and interest as something that transcends competence. The findings offer an empirical platform for rethinking competence …", "num_citations": "20\n", "authors": ["850"]}
{"title": "A historical account of the value of free and open source software: From software commune to commercial commons\n", "abstract": " Free and open source software has transformed from what has been characterized as a resistance movement against proprietary software to become a commercially viable form of software development, integrated in various forms with proprietary software business. In this paper we explain this development as a dependence on historical formations, shaped by different ways of justifying the use of open source during different periods of time. These formations are described as arrangements of different justificatory logics within a certain time frame or a certain group of actors motivating the use of free and open source software by referring to different potentialities. The justificatory arrangements change over time, and tracing these changes makes it easier to understand how the cultural, economic and social practices of open source movements are currently being absorbed and adopted in a commercial context.", "num_citations": "19\n", "authors": ["850"]}
{"title": "Enacting hard and soft product offerings in mature industries: Moving towards servitisation in volvo\n", "abstract": " The purpose of the paper is to give an in-depth account of how Volvo Group is working with enabling open services innovation in the organization. It shows that implementing servitization and open innovation within an engineering-based industry such as heavy vehicles manufacturing, is a matter of substantial 'groundwork' on several levels. This 'groundwork' involves substantial analytical work as well as vast mobilizing of internal organizational support. The paper also empirically connects the notions of open innovation and servitization in a theoretical discussion. The article contributes to the emerging field of open innovation by providing an empirical case from a multinational corporation acting within a 'traditional' industry. It highlights the strong efforts organizations are facing when enacting servitization and open innovation strategies within established practices.", "num_citations": "18\n", "authors": ["850"]}
{"title": "Masculine domination and gender subtexts: The role of female professionals in the renewal of the Swedish video game industry\n", "abstract": " The video game industry is a showcase industry in the entrepreneurial, knowledge-intensive, and technology-based economy. Despite recent technological shifts rendering digital media portable in the form of smartphones, tablets, and laptops, attracting new categories of gamers, most notably women above the age of 35, the video game industry is struggling to handle its masculine domination, prescribing specific and gendered divisions of labor in terms of lowering thresholds for female video game developers. This article reports on empirical material based on interviews from the burgeoning Swedish video game industry and suggests that female professionals entering the industry encounter inherited gendered beliefs and ways of organizing work which locate women in specific, and not always desirable, roles within the industry. In this regime of masculine domination, the study concludes, female video game …", "num_citations": "15\n", "authors": ["850"]}
{"title": "From e-government to e-governance: Social media and public authorities legitimacy work\n", "abstract": " Social media increasingly condition how public authorities build legitimacy when engaging with citizens. In this paper we report on a study of the increasing use of and exposure to social media and social networking platforms in two Swedish public authorities, the Social Insurance Agency (SIA) and the police force. Although formally grounded on the same civic principles, the two authorities have significantly different approaches to social media as a way to generate internal and external legitimacy. SIA has mainly implemented an e-government approach to rationalize services to become more efficient and customer oriented, by using social media as one of several media channels. The police force, however, adopted an e-governance approach to build legitimacy through interaction and reflexive discussion between government and citizens as a way to create transparency and nuance citizens’ attitude towards the police force. Building on a two-dimensional public government/governance framework, we reflect on how the two studied authorities’ social media practices shape and are shaped by different governing practices in their legitimacy work.", "num_citations": "13\n", "authors": ["850"]}
{"title": "The playful police: The role of social media in public institutions’ legitimacy work\n", "abstract": " Public authorities are rarely associated with creativity and playfulness. Rather, it can be threatening civic legitimacy. With the introduction of social media, a new channel opens possibilities for officers to meet the public and interact in more personal and creative ways than previously. Social media platforms like Facebook, Instagram and Twitter, have become important in people’s everyday lives as well as for organizational use. These technologies encourage self-expression, and allow users to create and share content, to comment and show appreciation or dislike of content. It also makes social networks visible. For public authorities, social media is a double-edged sword. It is a promising technology for dialogue with the citizens, but it may also facilitate the mobilization and coordination of criticism from the public. This is due to the dynamics and disruption afforded by the social media platforms. With the Swedish police officers’ Facebook interaction as empirical setting, the aim of this paper is to discuss how the increased use of social media affects the police’s legitimacy work. The study contributes with a deeper understanding of the interplay between social media and competing value logics in the context of public authorities, as it highlights the institutional tensions between official authority and playfulness. The empirical example of the police is used to show how social media creates new possibilities for creativity and playfulness.", "num_citations": "11\n", "authors": ["850"]}
{"title": "Justifying the value of open source\n", "abstract": " Over the last decade, free and open source software (FOSS) has gradually become recognized by different actors in society outside the FOSS communities and increasingly incorporated in corporate software development contexts, challenging proprietary software practices. Most literature describing this transition is focusing on the value of using FOSS as an efficient alternative to established models for software development. This focus on efficiency and economic value of FOSS is not sufficient if we want to gain a deeper understanding of the many aspects of FOSS values in the intersection of corporations and movements In order to articulate these different values, we propose a theoretical framework of justificatory logics including a civic, domestic, inspirational, popular, market and industrial logic. First we make an analysis of the history of FOSS, identifying how these logics have developed over time. We argue that this development forms the backbone of an emerging configuration of these logics, manifesting a new spirit of FOSS in terms of the adoption of free and open source software, methods and practices in corporations today. This new spirit is then analyzed based on interviews with programmers employed by firms engaging in FOSS. By understanding how these justificatory logics come to play and interplay, corporations that want to adopt FOSS can gain strategic advantages beyond efficiency.", "num_citations": "11\n", "authors": ["850"]}
{"title": "Information technology and organizational effects: Supporting the sales process with workflow technology\n", "abstract": " This paper explores the Language/Action approach by reflecting on an explorative case study from a small Swedish company in the IT-sector. The company is using Lotus Notesm in combination with Action WorkflowTM to increase the efficiency of the sales processes. This includes communication with customers as well as intraorganizational communication between people involved in the sales process. We address some of the issues raised in the debate about the Language/Action perspective. Does application of the Language/Action perspective automatically lead to control and routinization of work tasks, or could we find other implications? We propose a framework, identifying important characteristics of technology and work, which can be used in discussing effects of introducing new technology to improve efficiency in processes.", "num_citations": "10\n", "authors": ["850"]}
{"title": "Organizations and conversation\n", "abstract": " In this paper it is claimed that organizations are mainly constituted by communication, and that work is becoming inherently communicative. The question is how we could articulate this view in IT-design. Theories of communication and organization are aimed at understanding and interpreting organizations, and seldom address design issues. The theories of organization and organizational communication most exploited for design are characterized by an instrumental/rationalistic perspective on communication. In this paper I argue that one of the potentially most beneficial concepts to introduce in organizational communication, is a design oriented analysis of genre. Genres of intranets are discussed to exemplify.", "num_citations": "10\n", "authors": ["850"]}
{"title": "Forming a value network-analyzing the negotiations between actors in the e-newspaper case\n", "abstract": " We have studied a two-year project aiming at exploring the potentials of the e-newspaper, i.e. a news service published with e-paper technology. Different actors have interests in this process, e.g. newspaper publishers, device producers, readers and advertisers. These actors are forming value networks by negotiations of interests and positions. The contribution of the paper is twofold: firstly we show how the value network created around e-newspaper is dependent on the convergence of different actors and their interests; secondly our theoretical contribution is to show how actor network theory (ANT) can be used in combination with other theories - in this case genre theory - to analyze emergent value networks. ANT captures the general process of how the value network takes form, while genre theory captures the domain specific context of e-newspapers, and how this structures negotiations between different …", "num_citations": "9\n", "authors": ["850"]}
{"title": "Platformization of a Cloud Service\n", "abstract": " The digital platform has in a few years emerged as a key concept to depict a new kind of business model, organizational form and technical architecture. The transformational power of platforms is manifested by the notion of “platformization”, referring to the drive towards the platform as a dominant infrastructural and economic model. In this paper, we analyze the nature of platformization processes and platform dynamics. We do this by applying a historical case study approach to the evolution of one digital platform, Microsoft Azure. By presenting three narratives we show how Microsoft Azure, has evolved from being mainly an efficient cloud computing and storage service to become a cloud platform, enabling digital capabilities and innovation at an unprecedented scale. We then discuss how this transformation towards a platform, was shaped by both the evolving digital materiality of the artefacts especially in terms of convergence and generativity, and the discursive work conducted by Microsoft through their official Microsoft Azure blog. We contribute with increased knowledge of innovative cloud platforms more specifically, and platform dynamics and platformization processes more generally.", "num_citations": "8\n", "authors": ["850"]}
{"title": "Encountering camera surveillance and accountability at work-case study of the Swedish police.\n", "abstract": " Today’s mobile cameras mean that anyone may easily be filmed and exposed to a wider audience meanwhile conducting their daily work. Police officers belong to an occupation that most frequently have to encounter this development. As state representatives, entitled to make use of violence at work, they end up being held accountable by a variety of actors capturing police initiatives on film. Police authorities around the world therefore have started to use body-worn cameras, aiming to enhance trust and transparency, but also as a means to control their work environment. On the one hand, cameras are described as a tool ensuring legal security and public trust in the police, on the other hand cameras are also associated with concern for surveillance and integrity. We intend, in this recently started study, to investigate what consequences this technology have on individual officers organising their own practices, and …", "num_citations": "8\n", "authors": ["850"]}
{"title": "Combining Actor Network Theory and genre theory to understand the evolution of digital genres\n", "abstract": " In this paper we argue that a combination of Actor-Network Theory (ANT) and Genre Theory can constitute a theoretical framework for understanding how digital genres evolve. Genre theory states that genres evolve over time through reciprocal interaction between institutionalized practices and individual action; that they develop from actorsâ responses to recurrent situations, and are shaped around characteristics as content, form, functionality and purpose. Genres emerge out of practice and at the same time they shape that practice. While genre theory can describe the characteristics of a genre, it cannot handle the process of how a genre is formed and what powers and forces are involved in this shaping process. In order to address this problem, several authors have incorporated structuration theory into genre analysis. However, structuration theory can only catch these constitutional processes of genre in a very broad manner. As a genre is evolving and stabilizing over time in interplay with different actors, it goes beyond what is possible to explain only by means of structuration theory. Instead, ANT could work as a tool to capture the process of how a genre takes form in negotiations with different stakeholders. In this paper we discuss how genre theory and ANT can be combined in a framework for analyzing emerging genres. We apply this theoretical framework on an e-newspaper project that embodies a new genre in the making. We will here show how evolving genre characteristics are developed, formed and stabilized in a negotiation and struggle between the involved actors when they translate their interests in ways that finally are …", "num_citations": "8\n", "authors": ["850"]}
{"title": "Corporate Communities on an Intranet\n", "abstract": " This paper gives a rich description of a small virtual community (VC)–Gamma Developers Guild–of consultants supported by a portal developed within a consulting firm. We describe the history of the community and how it has developed and transformed during a period of 12 months. We discuss the results mainly from three points of view: codification of knowledge as narratives in the form of a collaborative book, the knowledge sharing practices in a debate forum; and the sense of community established by the portal and its role to promote knowledge sharing. We argue that intranet portals like Gamma Developers Guild, represents a form of corporate community building which can be seen as a result of Internet technology and culture being adopted in corporate context.", "num_citations": "8\n", "authors": ["850"]}
{"title": "Entrepreneurship in the Digital Society\n", "abstract": " Innovation and entrepreneurship are tightly coupled. Schumpeter put forward a view where entrepreneurship, performed either by individual persons or large firms, is perceived as the driving force of innovation. Entrepreneurial activity revolves around the identification and exploitation of opportunities in order to create value and capture a substantial share of that value. Over the last years a growing discourse on digital innovation has emerged, while the digital entrepreneur has been more rarely addressed. In this conceptual paper, we discuss the nature of digital entrepreneurship based on a theoretical framework rooted in the discourse on digital innovation and the characteristics of digital artefacts. We argue that it makes more sense to talk about entrepreneurship in a digital society, than the digital entrepreneur as a new species. By applying the framework on examples, we discuss four key dimensions of entrepreneurship–the nature of opportunities, personal traits of the entrepreneur, risk and uncertainty, and replicative or innovative entrepreneurship. We contribute by problematizing digital entrepreneurship in relation to these dimensions.", "num_citations": "7\n", "authors": ["850"]}
{"title": "Open source programmer's strategies to cope with ideological tensions\n", "abstract": " In this paper we analyse how the increased use of open source software in companies affect employed programmers’ work, which we theorize as part of a larger secularisation process. We have studied both companies based on a more traditional proprietary model who are becoming open source oriented, and SMEs built around open source business concepts. This change results in a need for professional programmers to re-interpret open source within a new business oriented context. We study what kind of strategies programmers develop to cope with these contradictory systems and how it changes work roles and programmers’ approaches towards open source community work.", "num_citations": "7\n", "authors": ["850"]}
{"title": "Exploration Vs. Exploitation And How Video Game Developers Are Able To Combine The Two\n", "abstract": " This paper reports an in-depth qualitative study about innovation work in the Swedish video game industry. More specifically, it focuses on how video game developers are building ambidextrous capabilities to simultaneously addressing explorative and exploitative activities. The Swedish video game industry is a particularly suitable case to analyze ambidexterity, due to it’s extreme market success and continuous ability to adapt to shifts in technologies and demands. Based on the empirical data, three ambidextrous capabilities are pointed out as particularly valuable for video game developers; (1) the ability to separate between a creative work climate and the effectiveness in project organizing; (2) the balancing of inward and outward ideation influences, and (3) the diversity in operational means and knowledge paired with shared goals and motivations, derived from the love of video games and video game …", "num_citations": "4\n", "authors": ["850"]}
{"title": "The (missing?) value of IT in public organizations-The case of the Swedish rescue services\n", "abstract": " \"The (missing?) value of IT in public organizations - The case of the S\" by Jane Frisk and Jan Ljungberg Home Search Browse All Content My Account About DC Network Digital Commons Network™ Skip to main content AIS Electronic Library (AISeL) Association for Information Systems eLibrary Login FAQ About Home < Previous Next > Home > Conferences > ECIS Proceedings > ECIS2009 > 394 ECIS 2009 Proceedings Title The (missing?) value of IT in public organizations - The case of the Swedish rescue services Authors Jane Frisk, Goeteborg UniversityFollow Jan Ljungberg, Gothenburg UniversityFollow Abstract To actually gain organizational value from investments in Information technology (IT) is a widely known problem that many businesses today struggle with. This paper presents an interpretative case study of three public fire rescue service organizations in Sweden. The aim of the study is to investigate …", "num_citations": "3\n", "authors": ["850"]}
{"title": "Panel: Governance in Open Source Projects and Communities.\n", "abstract": " “Although considerable research has been devoted to the growth and expansion of open source communities and the comparison between the efficiency of corporate structures and community structures in the field of software development, rather less attention has been paid to their governance structures (control, monitoring, supervision)”(Lattemann and Stieglitz 2005). The call for the identification and the description of a set of effective governance mechanisms in OSS development projects and community is still open and actual (Grandori 2000, de Laat 2007). The panel aims to discuss and to develop the recent ideas and contributions related to the governance structures inside OSS communities. Organizational, sociological, technical and psychological aspects will be considered as components of the same issue.The main aim of the panel is to encourage discussion and exchange of ideas from different …", "num_citations": "3\n", "authors": ["850"]}
{"title": "Sociala medier\n", "abstract": " SwePub - Sociala medier ↓ Direkt till sidans innehåll ↓ Direkt till sidans sekundära innehåll (sidomenyn) SwePub Om SwePub In English Placeholders Sökhistorik/mina poster Rensa historik Sök i LIBRIS databas Utökad sökning onr:\"swepub:oai:gup.ub.gu.se/276357\" Sökning: onr:\"swepub:oai:gup.ub.gu.se/276357\" > Sociala medier 1 av 1 Föregående post Nästa post Till träfflistan Översikt Detaljer Sociala medier Ljungberg, Jan, 1956 (författare) Gothenburg University,Göteborgs universitet,Institutionen för tillämpad informationsteknologi (GU),Department of Applied Information Technology (GU) (creator_code:org_t) visa fler... visa färre... Lund : Studentlitteratur, 2018 2018 Svenska. Ingår i: Digitalisering och styrning. - Lund : Studentlitteratur. - 9789144117447 ; , s. 295-314 Relaterad länk: https://gup.ub.gu.se... Bokkapitel (refereegranskat) Ämnesord Stäng Ämnesord TEKNIK OCH TEKNOLOGIER -- Elektroteknik …", "num_citations": "2\n", "authors": ["850"]}
{"title": "Generativity and Innovation in Smartphone Ecosystems\n", "abstract": " Advances in science and technology have created promising new opportunities for industries and economies to create value, which have also made them more complex as innovations can contain specialized knowledge from various disciplines. Under these conditions, firms are said to benefit from acting more openly (Chesbrough, 2003) within cross-organizational innovation systems (Cooke, 2001), clusters (Porter, 1998), or ecosystems (Moore, 1995) rather than as sole competitors. New relations emerge as companies strive to meet the challenges of increased user demands, higher research and development (R&D) costs, and shorter product life cycles, which put the organization’s capacity to adapt and innovate into focus (Teece, 2007). Such complexities cause liaisons that form more or less viable ecosystems for R&D and innovation (Rohrbeck et al., 2009). These relations emerge in order to jointly manage certain innovation challenges, explicitly linking the", "num_citations": "2\n", "authors": ["850"]}
{"title": "High noon at OS Corral\n", "abstract": " Since the late 60’s, there’s been a rise in the number and visability of collective actions in society, which have been referred to as\" new social movements.\" Examples include environmental-, peace-and women's rights movements, and also an increasing number of transnational networks of nongovernmental organizations (NGO’s). The emergence of these movements has been explained by changes in the relations between the economic, political and cultural powers and institutions that have supported a transition from a modern to a postmodern or postindustrial society. These changes have lately been linked to an understanding of the importance of the rise of a networked society and new forms of communication, which has led to an increased level of mobility, flexibility and a greater complexity and reflexivity within contemporary social institutions (see Castells 1996, Giddens 1990). The British sociologist Anthony Giddens describes this intensification of transnational relations as “worldwide social relations which link distinct localities in such a way that local happenings are shaped by events occurring miles away and vice versa”(Giddens 1990: 64). The emergence of a network society, or information society, has also involved new conflicts regarding the control over information, knowledge, symbolic capital and social relationships. These are conflicts closely connected to unequal or transformed power relations between different social positions in the new global society. It is in this social climate of opposition, ambivalence and conflict that new forms of movements have emerged (Thörn, 1997). Melucci argues that social movements' actions\" …", "num_citations": "2\n", "authors": ["850"]}
{"title": "Driving Change with Narratives\n", "abstract": " Change is a central concept in business and management. It is addressed under different names, such as organizational restructuring, transformation and development. It is a vital part of most theories, methods and approaches dealing with organizational development, even if change and change management is not always addressed explicitly. Despite this interest for developing knowledge, methods and approaches for change, more than 70% of organizational change programs fail or get stalled (Boonstra, 2004).", "num_citations": "2\n", "authors": ["850"]}
{"title": "Learning, Innovation and IT-Usage-A Research Approach to Regional Development.\n", "abstract": " Regional clusters of companies are becoming an increasingly important focus of government industrial policy makers and researchers. A cluster is a network of companies in an industrial sector where suppliers, customers, consultants, etc. interact together with regional policymakers and universities. Sometimes the individual firms compete, and sometimes they collaborate. The delimited characteristics of a cluster to a regional area and an industrial sector, makes it possible to view the cluster as an arena or laboratory. The concept of regions as laboratories, which is the base for the present paper, does not have a policy orientation. Instead, it stresses the interactive and cooperative aspects, which emerge organically in a regional cluster. The paper presents the formation of a research arena in cooperation between the University College of Borås and the industry organization of Swedish mail order companies for studies of learning and innovations in IT usage within the cluster. The strategy to establish the arena, formulation of research questions and initial experiences are presented.", "num_citations": "2\n", "authors": ["850"]}
{"title": "A Narrative Mode of Change Management\n", "abstract": " Change projects put a high demand on people’s ability to change mindset. It requires motivation and commitment to take on another perspective than the existing one. Common methods like BPR, and TQM, tend to fail in motivating and engaging people sufficiently to reach the goals. In this paper we outline an alternative method for driving change management. We propose the use of myths, tales, and stories as triggers in change projects in order to create a creative and dynamic atmosphere in which change can be achieved. Even though there is by now a rather substantial literature on narratives in organization theory, very little research has focused on narrative as a vehicle for change and organizational development. Myths are interesting because they serve as a tool for formulating and recapturing a worldview; they integrate people into organizational culture and they can guide people in their individual psychological development.", "num_citations": "2\n", "authors": ["850"]}
{"title": "Being filmed at work: How police perceive citizens' use of cameras to conduct sousveillance\n", "abstract": " Today’s widespread use of camera-equipped smartphones means that anyone may easily be filmed in public, and-through social media-exposed to a large audience whilst conducting their daily work. Police officers belong to an occupation that frequently has to encounter this situation. The police is a public authority with a broad societal mission aimed at reducing crime and increasing security in society, but is also entitled to make use of force at work. The latter is a fact that places high demands on them to organize and conduct their work in accordance with applicable laws and guidelines to ensure legal security for citizens, and to provide transparency and accountability. We intend to investigate what consequences citizens’ use of this wearable technology with built in cameras have on police officers’ individual practices. This research in progress paper will therefore address the question: How do police perceive citizens’ use of cameras to document them while conducting work? To answer the question, we conducted a qualitative study using the Swedish Police as a case, where in-depth interviews with police officers constitute the main data source. Theoretically, we draw upon on research on technological affordances, accountability, surveillance and sousveillance.", "num_citations": "1\n", "authors": ["850"]}
{"title": "Like, Share and Follow: A Conceptualisation of Social Buttons on the Web\n", "abstract": " In this theoretical and argumentative paper we analyse the implications of social buttons as used on social networking sites (SNSs). Although social buttons have been around for many years, there is still a scarcity of research on their effects despite their pivotal functions for the success of SNSs. We conceptualise these buttons as Like buttons, Share buttons and Follow buttons and analyse them and their associated actions through the lens of social capital theory. Our analysis shows how the clicker and the clickee are affected differently through these social buttons, and in the process, we also propose seven concepts to describe the social implications of these buttons. Having discussed these concepts, we conclude the paper by offering three contributions; (a) the distinguishing between the clicker and the clickee; (b) the subtle but yet distinct differences between buttons, and; (c) a set of ways through which …", "num_citations": "1\n", "authors": ["850"]}
{"title": "Issues in Achieving Value of IT Investments-A Case Study of the Swedish Fire Rescue Services\n", "abstract": " To actually gain value from investments in Information technology (IT) is a widely known problem that many businesses today struggle with. This paper presents an interpretative case study of the Swedish Fire Rescue Services where problematic issues are identified concerning perceived value of IT-investments among different stakeholders groups. We discuss what implications these findings will have on the concept value of IT and evaluation of IT.", "num_citations": "1\n", "authors": ["850"]}
{"title": "Storytelling and knowledge sharing on an Internet\n", "abstract": " STORYTELLING AND KNOWLEDGE SHARING ON AN INTRANET Magnus Bergquist & Jan Ljungberg magnus@viktoria.se, janl@viktoria.se Dept. of Informatics Gothenburg University, Box 620 405 30 Gothenburg Sweden Abstract This paper gives a rich description of a small virtual community (VC) – Gamma Developers Guild – of consultants supported by a portal developed within a consulting firm. We describe the history of the community and how it has developed and transformed during a period of 12 months. We discuss the results mainly from how knowledge is codified and communicated in the form of narratives in a collaborative book on the intranet and the sense of community established by the portal and its role to promote knowledge sharing. We argue that intranet portals like Gamma Developers Guild, represents a form of corporate community building which can be seen as a result of Internet technology …", "num_citations": "1\n", "authors": ["850"]}
{"title": "Combining multiple abstraction mechanisms in communication modeling\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "1\n", "authors": ["850"]}
{"title": "Structures that Imprison and Structures that Free\n", "abstract": " In this paper we argue there is a need to renew the discussion of the 70s regarding the effect information technology (IT) has on skill requirements, responsibilities and learning in work life. We also argue, however, that these issues need to be formulated differently today. In its first decades, computerization strengthened rationalization efforts in industry. IT was claimed to increase Taylorism and alienation. As we move into the postindustrial society, the situation is almost the reverse. People no longer discuss “deskilling” and “dequalification of work”. Instead we encounter expressions like “user empowerment” and “the good IT-society”. We now need to reflect on how and when these concerns can co-exist, and how IT can be an enabling factor for their co-existence. By considering three cases, we want to throw light upon what important social and ethical", "num_citations": "1\n", "authors": ["850"]}
{"title": "Brute facts vs. institutional facts of language as a foundation for IR\n", "abstract": " Searle made a distinction between brute facts and institutional facts of language. While brute facts concern the frequencies of word occurences, type-token ratios of specific words and other kind of statistical models of word occurences and relations among words, institutional facts presuppose the existence of certain human institutions, ie systems of constitutive rules. In this paper we argue that information retrieval mostly has been focussing on the brute facts of language. When information retrieval and document management systems are to be designed in organizational settings, we need to take the institutional facts of language into account. We propose a way of combining statistical techniques of treating brute facts with pragmatically oriented methods of using institutional facts as the foundation for design of information retrieval systems.", "num_citations": "1\n", "authors": ["850"]}