{"title": "Cyberguide: A mobile context‐aware tour guide\n", "abstract": " Future computing environments will free the user from the constraints of the desktop. Applications for a mobile environment should take advantage of contextual information, such as position, to offer greater services to the user. In this paper, we present the Cyberguide project, in which we are building prototypes of a mobile context‐aware tour guide. Knowledge of the user's current location, as well as a history of past locations, are used to provide more of the kind of services that we come to expect from a real tour guide. We describe the architecture and features of a variety of Cyberguide prototypes developed for indoor and outdoor use on a number of different hand‐held platforms. We also discuss the general research issues that have emerged in our context‐aware applications development in a mobile environment.", "num_citations": "2281\n", "authors": ["1171"]}
{"title": "Cantina: a content-based approach to detecting phishing web sites\n", "abstract": " Phishing is a significant problem involving fraudulent email and web sites that trick unsuspecting users into revealing private information. In this paper, we present the design, implementation, and evaluation of CANTINA, a novel, content-based approach to detecting phishing web sites, based on the TF-IDF information retrieval algorithm. We also discuss the design and evaluation of several heuristics we developed to reduce false positives. Our experiments show that CANTINA is good at detecting phishing sites, correctly labeling approximately 95% of phishing sites.", "num_citations": "1003\n", "authors": ["1171"]}
{"title": "The design of sites: patterns, principles, and processes for crafting a customer-centered Web experience\n", "abstract": " Based upon extensive, ground-breaking research, The Design of Sites introduces a comprehensive, pattern-based approach to making web sites truly customer-centered. Using the 101 patterns presented here, Web and business professionals can learn from the industry's experience and best practices, and dramatically improve customer satisfaction and retention. The authors have chronicled visitors' behavior to find the patterns that emerge from experiences ranging from navigation to e-shopping, and to discover how individual site visits fit into users' larger goals of finding information and making purchasing decisions. Drawing on this research, The Design of Sites introduces proven principles, processes, and patterns for building customer-centered Web sites. Their patterns encompass virtually every key issue, including: creating powerful home pages; managing content; simplifying layouts and navigation; optimizing performance, and much more. For all Web designers, developers and decision-makers seeking to maximize the business value of their Web sites.", "num_citations": "926\n", "authors": ["1171"]}
{"title": "An Architecture for Privacy-Sensitive Ubiquitous Computing\n", "abstract": " Privacy is the most often-cited criticism of ubiquitous computing, and may be the greatest barrier to its long-term success. However, developers currently have little support in designing software architectures and in creating interactions that are effective in helping end-users manage their privacy. To address this problem, we present Confab, a toolkit for facilitating the development of privacy-sensitive ubiquitous computing applications. The requirements for Confab were gathered through an analysis of privacy needs for both end-users and application developers. Confab provides basic support for building ubiquitous computing applications, providing a framework as well as several customizable privacy mechanisms. Confab also comes with extensions for managing location privacy. Combined, these features allow application developers and end-users to support a spectrum of trust levels and privacy needs.", "num_citations": "847\n", "authors": ["1171"]}
{"title": "The livehoods project: Utilizing social media to understand the dynamics of a city\n", "abstract": " Studying the social dynamics of a city on a large scale has tra-ditionally been a challenging endeavor, requiring long hours of observation and interviews, usually resulting in only a par-tial depiction of reality. At the same time, the boundaries of municipal organizational units, such as neighborhoods and districts, are largely statically defined by the city government and do not always reflect the character of life in these ar-eas. To address both difficulties, we introduce a clustering model and research methodology for studying the structure and composition of a city based on the social media its res-idents generate. We use data from approximately 18 million check-ins collected from users of a location-based online so-cial network. The resulting clusters, which we call Livehoods, are representations of the dynamic urban areas that comprise the city. We take an interdisciplinary approach to validating these clusters, interviewing 27 residents of Pittsburgh, PA, to see how their perceptions of the city project onto our findings there. Our results provide strong support for the discovered clusters, showing how Livehoods reveal the distinctly charac-terized areas of the city and the forces that shape them.", "num_citations": "760\n", "authors": ["1171"]}
{"title": "You've been warned: an empirical study of the effectiveness of web browser phishing warnings\n", "abstract": " Many popular web browsers are now including active phishing warnings after previous research has shown that passive warnings are often ignored. In this laboratory study we examine the effectiveness of these warnings and examine if, how, and why they fail users. We simulated a spear phishing attack to expose users to browser warnings. We found that 97% of our sixty participants fell for at least one of the phishing messages that we sent them. However, we also found that when presented with the active warnings, 79% of participants heeded them, which was not the case for the passive warning that we tested---where only one participant heeded the warnings. Using a model from the warning sciences we analyzed how users perceive warning messages and offer suggestions for creating more effective warning messages within the phishing context.", "num_citations": "730\n", "authors": ["1171"]}
{"title": "DENIM: Finding a tighter fit between tools and practice for web site design\n", "abstract": " Through a study of web site design practice, we observed that web site designers design sites at different levels of refinement—site map, storyboard, and individual page—and that designers sketch at all levels during the early stages of design. However, existing web design tools do not support these tasks very well. Informed by these observations, we created DENIM, a system that helps web site designers in the early stages of design. DENIM supports sketching input, allows design at different refinement levels, and unifies the levels through zooming. We performed an informal evaluation with seven professional designers and found that they reacted positively to the concept and were interested in using such a system in their work.", "num_citations": "709\n", "authors": ["1171"]}
{"title": "A framework of energy efficient mobile sensing for automatic user state recognition\n", "abstract": " Urban sensing, participatory sensing, and user activity recognition can provide rich contextual information for mobile applications such as social networking and location-based services. However, continuously capturing this contextual information on mobile devices consumes huge amount of energy. In this paper, we present a novel design framework for an Energy Efficient Mobile Sensing System (EEMSS). EEMSS uses hierarchical sensor management strategy to recognize user states as well as to detect state transitions. By powering only a minimum set of sensors and using appropriate sensor duty cycles EEMSS significantly improves device battery life. We present the design, implementation, and evaluation of EEMSS that automatically recognizes a set of users' daily activities in real time using sensors on an off-the-shelf high-end smart phone. Evaluation of EEMSS with 10 users over one week shows that our …", "num_citations": "604\n", "authors": ["1171"]}
{"title": "Anti-phishing phil: the design and evaluation of a game that teaches people not to fall for phish\n", "abstract": " In this paper we describe the design and evaluation of Anti-Phishing Phil, an online game that teaches users good habits to help them avoid phishing attacks. We used learning science principles to design and iteratively refine the game. We evaluated the game through a user study: participants were tested on their ability to identify fraudulent web sites before and after spending 15 minutes engaged in one of three anti-phishing training activities (playing the game, reading an anti-phishing tutorial we created based on the game, or reading existing online training materials). We found that the participants who played the game were better able to identify fraudulent web sites compared to the participants in other conditions. We attribute these effects to both the content of the training messages presented in the game as well as the presentation of these materials in an interactive game format. Our results confirm that …", "num_citations": "602\n", "authors": ["1171"]}
{"title": "The state of phishing attacks\n", "abstract": " Looking past the systems people use, they target the people using the systems.", "num_citations": "581\n", "authors": ["1171"]}
{"title": "An infrastructure approach to context-aware computing\n", "abstract": " The Context Toolkit (Dey, Abowd, and Salber, 2001 [this special issue]) is only one of many possible architectures for supporting context-aware applications. In this essay, we look at the tradeoffs involved with a service infrastructure approach to context-aware computing. We describe the advantages that a service infrastructure for context awareness has over other approaches, outline some of the core technical challenges that must be addressed before such an infrastructure can be built, and point out promising research directions for overcoming these challenges.", "num_citations": "567\n", "authors": ["1171"]}
{"title": "I'm the mayor of my house: examining why people use foursquare-a social-driven location sharing application\n", "abstract": " There have been many location sharing systems developed over the past two decades, and only recently have they started to be adopted by consumers. In this paper, we present the results of three studies focusing on the foursquare check-in system. We conducted interviews and two surveys to understand, both qualitatively and quantitatively, how and why people use location sharing applications, as well as how they manage their privacy. We also document surprising uses of foursquare, and discuss implications for design of mobile social services.", "num_citations": "553\n", "authors": ["1171"]}
{"title": "Expectation and purpose: understanding users' mental models of mobile app privacy through crowdsourcing\n", "abstract": " Smartphone security research has produced many useful tools to analyze the privacy-related behaviors of mobile apps. However, these automated tools cannot assess people's perceptions of whether a given action is legitimate, or how that action makes them feel with respect to privacy. For example, automated tools might detect that a blackjack game and a map app both use one's location information, but people would likely view the map's use of that data as more legitimate than the game. Our work introduces a new model for privacy, namely privacy as expectations. We report on the results of using crowdsourcing to capture users' expectations of what sensitive resources mobile apps use. We also report on a new privacy summary interface that prioritizes and highlights places where mobile apps break people's expectations. We conclude with a discussion of implications for employing crowdsourcing as a privacy …", "num_citations": "537\n", "authors": ["1171"]}
{"title": "Cantina+ a feature-rich machine learning framework for detecting phishing web sites\n", "abstract": " Phishing is a plague in cyberspace. Typically, phish detection methods either use human-verified URL blacklists or exploit Web page features via machine learning techniques. However, the former is frail in terms of new phish, and the latter suffers from the scarcity of effective features and the high false positive rate (FP). To alleviate those problems, we propose a layered anti-phishing solution that aims at (1) exploiting the expressiveness of a rich set of features with machine learning to achieve a high true positive rate (TP) on novel phish, and (2) limiting the FP to a low level via filtering algorithms. Specifically, we proposed CANTINA+, the most comprehensive feature-based approach in the literature including eight novel features, which exploits the HTML Document Object Model (DOM), search engines and third party services with machine learning techniques to detect phish. Moreover, we designed two filters to …", "num_citations": "463\n", "authors": ["1171"]}
{"title": "Understanding and capturing people's privacy policies in a mobile social networking application\n", "abstract": " A number of mobile applications have emerged that allow users to locate one another. However, people have expressed concerns about the privacy implications associated with this class of software, suggesting that broad adoption may only happen to the extent that these concerns are adequately addressed. In this article, we report on our work on PeopleFinder, an application that enables cell phone and laptop users to selectively share their locations with others (e.g. friends, family, and colleagues). The objective of our work has been to better understand people’s attitudes and behaviors towards privacy as they interact with such an application, and to explore technologies that empower users to more effectively and efficiently specify their privacy preferences (or “policies”). These technologies include user interfaces for specifying rules and auditing disclosures, as well as machine learning techniques to …", "num_citations": "456\n", "authors": ["1171"]}
{"title": "Making mashups with marmite: towards end-user programming for the web\n", "abstract": " There is a tremendous amount of web content available today, but it is not always in a form that supports end-users' needs. In many cases, all of the data and services needed to accomplish a goal already exist, but are not in a form amenable to an end-user. To address this problem, we have developed an end-user programming tool called Marmite, which lets end-users create so-called mashups that re-purpose and combine existing web content and services. In this paper, we present the design, implementation, and evaluation of Marmite. An informal user study found that programmers and some spreadsheet users had little difficulty using the system.", "num_citations": "456\n", "authors": ["1171"]}
{"title": "Why people hate your app: Making sense of user feedback in a mobile app store\n", "abstract": " User review is a crucial component of open mobile app markets such as the Google Play Store. How do we automatically summarize millions of user reviews and make sense out of them? Unfortunately, beyond simple summaries such as histograms of user ratings, there are few analytic tools that can provide insights into user reviews. In this paper, we propose Wiscom, a system that can analyze tens of millions user ratings and comments in mobile app markets at three different levels of detail. Our system is able to (a) discover inconsistencies in reviews;(b) identify reasons why users like or dislike a given app, and provide an interactive, zoomable view of how users' reviews evolve over time; and (c) provide valuable insights into the entire app market, identifying users' major concerns and preferences of different types of apps. Results using our techniques are reported on a 32GB dataset consisting of over 13 million …", "num_citations": "435\n", "authors": ["1171"]}
{"title": "An empirical analysis of phishing blacklists\n", "abstract": " In this paper, we study the effectiveness of phishing blacklists. We used 191 fresh phish that were less than 30 minutes old to conduct two tests on eight anti-phishing toolbars. We found that 63% of the phishing campaigns in our dataset lasted less than two hours. Blacklists were ineffective when protecting users initially, as most of them caught less than 20% of phish at hour zero. We also found that blacklists were updated at different speeds, and varied in coverage, as 47% - 83% of phish appeared on blacklists 12 hours from the initial test. We found that two tools using heuristics to complement blacklists caught significantly more phish initially than those using only blacklists. However, it took a long time for phish detected by heuristics to appear on blacklists. Finally, we tested the toolbars on a set of 15,345 legitimate URLs for false positives, and did not find any instance of mislabeling for either blacklists or heuristics. We present these findings and discuss ways in which anti-phishing tools can be improved.", "num_citations": "424\n", "authors": ["1171"]}
{"title": "Teaching Johnny not to fall for phish\n", "abstract": " Phishing attacks, in which criminals lure Internet users to Web sites that spoof legitimate Web sites, are occurring with increasing frequency and are causing considerable harm to victims. While a great deal of effort has been devoted to solving the phishing problem by prevention and detection of phishing emails and phishing Web sites, little research has been done in the area of training users to recognize those attacks. Our research focuses on educating users about phishing and helping them make better trust decisions. We identified a number of challenges for end-user security education in general and anti-phishing education in particular: users are not motivated to learn about security; for most users, security is a secondary task; it is difficult to teach people to identify security threats without also increasing their tendency to misjudge nonthreats as threats. Keeping these challenges in mind, we developed an email …", "num_citations": "412\n", "authors": ["1171"]}
{"title": "Phinding phish: Evaluating anti-phishing tools\n", "abstract": " There are currently dozens of freely available tools to combat phishing and other web-based scams, many of which are web browser extensions that warn users when they are browsing a suspected phishing site. We developed an automated test bed for testing antiphishing tools. We used 200 verified phishing URLs from two sources and 516 legitimate URLs to test the effectiveness of 10 popular anti-phishing tools. Only one tool was able to consistently identify more than 90% of phishing URLs correctly; however, it also incorrectly identified 42% of legitimate URLs as phish. The performance of the other tools varied considerably depending on the source of the phishing URLs. Of these remaining tools, only one correctly identified over 60% of phishing URLs from both sources. Performance also changed significantly depending on the freshness of the phishing URLs tested. Thus we demonstrate that the source of phishing URLs and the freshness of the URLs tested can significantly impact the results of anti-phishing tool testing. We also demonstrate that many of the tools we tested were vulnerable to simple exploits. In this paper we describe our anti-phishing tool test bed, summarize our findings, and offer observations about the effectiveness of these tools as well as ways they might be improved.", "num_citations": "412\n", "authors": ["1171"]}
{"title": "Protecting people from phishing: the design and evaluation of an embedded training email system\n", "abstract": " Phishing attacks, in which criminals lure Internet users to websites that impersonate legitimate sites, are occurring with increasing frequency and are causing considerable harm to victims. In this paper we describe the design and evaluation of an embedded training email system that teaches people about phishing during their normal use of email. We conducted lab experiments contrasting the effectiveness of standard security notices about phishing with two embedded training designs we developed. We found that embedded training works better than the current practice of sending security notices. We also derived sound design principles for embedded training systems.", "num_citations": "396\n", "authors": ["1171"]}
{"title": "Personal privacy through understanding and action: five pitfalls for designers\n", "abstract": " To participate in meaningful privacy practice in the context of technical systems, people require opportunities to understand the extent of the systems’ alignment with relevant practice and to conduct discernible social action through intuitive or sensible engagement with the system. It is a significant challenge to design for such understanding and action through the feedback and control mechanisms of today’s devices. To help designers meet this challenge, we describe five pitfalls to beware when designing interactive systems—on or off the desktop—with personal privacy implications. These pitfalls are: (1) obscuring potential information flow, (2) obscuring actual information flow, (3) emphasizing configuration over action, (4) lacking coarse-grained control, and (5) inhibiting existing practice. They are based on a review of the literature, on analyses of existing privacy-affecting systems, and on our own …", "num_citations": "378\n", "authors": ["1171"]}
{"title": "Privacy risk models for designing privacy-sensitive ubiquitous computing systems\n", "abstract": " Privacy is a difficult design issue that is becoming increasingly important as we push into ubiquitous computing environments. While there is a fair amount of theoretical work on designing for privacy, there are few practical methods for helping designers create applications that provide end-users with a reasonable level of privacy protection that is commensurate with the domain, with the community of users, and with the risks and benefits to all stakeholders in the intended system. Towards this end, we propose privacy risk models as a general method for refining privacy from an abstract concept into concrete issues for specific applications and prioritizing those issues. In this paper, we introduce a privacy risk model we have developed specifically for ubiquitous computing, and outline two case studies describing our use of this privacy risk model in the design of two ubiquitous computing applications.", "num_citations": "330\n", "authors": ["1171"]}
{"title": "School of phish: a real-world evaluation of anti-phishing training\n", "abstract": " PhishGuru is an embedded training system that teaches users to avoid falling for phishing attacks by delivering a training message when the user clicks on the URL in a simulated phishing email. In previous lab and real-world experiments, we validated the effectiveness of this approach. Here, we extend our previous work with a 515-participant, real-world study in which we focus on long-term retention and the effect of two training messages. We also investigate demographic factors that influence training and general phishing susceptibility. Results of this study show that (1) users trained with PhishGuru retain knowledge even after 28 days;(2) adding a second training message to reinforce the original training decreases the likelihood of people giving information to phishing websites; and (3) training does not decrease users' willingness to click on links in legitimate messages. We found no significant difference …", "num_citations": "317\n", "authors": ["1171"]}
{"title": "End-user privacy in human-computer interaction\n", "abstract": " End-User Privacy in Human-Computer Interaction surveys the rich and diverse landscape of privacy in Human-Computer Interaction (HCI) and Computer Supported Cooperative Work (CSCW), describing some of the legal foundations and historical aspects of privacy, sketching out an overview of the body of knowledge with respect to designing, implementing, and evaluating privacy-affecting systems, and charting many directions for future work. The authors first summarize the research that has been done on the topic over the past three decades, outlining current approaches, results, and trends. They proceed to chart future research trends and point out areas of research that are timely but lagging. In summarizing thirty years of privacy research in HCI and CSCW, End-User Privacy in Human-Computer Interaction helps to shed light on many of the salient issues and will help practitioners and researchers alike explore these complex issues in a more informed and conscious way.", "num_citations": "295\n", "authors": ["1171"]}
{"title": "Modeling users’ mobile app privacy preferences: Restoring usability in a sea of permission settings\n", "abstract": " In this paper, we investigate the feasibility of identifying a small set of privacy profiles as a way of helping users manage their mobile app privacy preferences. Our analysis does not limit itself to looking at permissions people feel comfortable granting to an app. Instead it relies on static code analysis to determine the purpose for which an app requests each of its permissions, distinguishing for instance between apps relying on particular permissions to deliver their core functionality and apps requesting these permissions to share information with advertising networks or social networks. Using privacy preferences that reflect people’s comfort with the purpose for which different apps request their permissions, we use clustering techniques to identify privacy profiles. A major contribution of this work is to show that, while people’s mobile app privacy preferences are diverse, it is possible to identify a small number of privacy profiles that collectively do a good job at capturing these diverse preferences.", "num_citations": "282\n", "authors": ["1171"]}
{"title": "Challenge: ubiquitous location-aware computing and the\" place lab\" initiative\n", "abstract": " To be widely adopted, location-aware computing must be as effortless, familiar and rewarding as web search tools like Google. We envisage the global scale Place Lab, consisting of an open software base and a community building activity as a way to bootstrap the broad adoption of location-aware computing. The initiative is a laboratory because it will also be a vehicle for research and instruction, especially in the formative stages. The authors draw on their experiences with campus and building-scale location systems to identify the technological and social barriers to a truly ubiquitous deployment. With a grasp of these\" barriers to adoption,\" we present a usage scenario, the problems in realizing this scenario, and how these problems will be addressed. We conclude with a sketch of the multi-organization cooperative being formed to move this effort forward.", "num_citations": "260\n", "authors": ["1171"]}
{"title": "Detecting offensive tweets via topical feature discovery over a large scale twitter corpus\n", "abstract": " In this paper, we propose a novel semi-supervised approach for detecting profanity-related offensive content in Twitter. Our approach exploits linguistic regularities in profane language via statistical topic modeling on a huge Twitter corpus, and detects offensive tweets using automatically these generated features. Our approach performs competitively with a variety of machine learning (ML) algorithms. For instance, our approach achieves a true positive rate (TP) of 75.1% over 4029 testing tweets using Logistic Regression, significantly outperforming the popular keyword matching baseline, which has a TP of 69.7%, while keeping the false positive rate (FP) at the same level as the baseline at about 3.77%. Our approach provides an alternative to large scale hand annotation efforts required by fully supervised learning approaches.", "num_citations": "256\n", "authors": ["1171"]}
{"title": "Who's viewed you? The impact of feedback in a mobile location-sharing application\n", "abstract": " Feedback is viewed as an essential element of ubiquitous computing systems in the HCI literature for helping people manage their privacy. However, the success of online social networks and existing commercial systems for mobile location sharing which do not incorporate feedback would seem to call the importance of feedback into question. We investigated this issue in the context of a mobile location sharing system. Specifically, we report on the findings of a field de-ployment of Locyoution, a mobile location sharing system. In our study of 56 users, one group was given feedback in the form of a history of location requests, and a second group was given no feedback at all. Our major contribution has been to show that feedback is an important contributing factor towards improving user comfort levels and allaying privacy concerns. Participants' privacy concerns were reduced after using the mobile location sharing …", "num_citations": "248\n", "authors": ["1171"]}
{"title": "\" Hey Alexa, What's Up?\" A Mixed-Methods Studies of In-Home Conversational Agent Usage\n", "abstract": " In-home, place-based, conversational agents have exploded in popularity over the past three years. In particular, Amazon's conversational agent, Alexa, now dominates the market and is in millions of homes. This paper presents two complementary studies investigating the experience of households living with a conversational agent over an extended period of time. First, we gathered the history logs of 75 Alexa participants and quantitatively analyzed over 278,000 commands. Second, we performed seven in-home, contextual interviews of Alexa owners focusing on how their household interacts with Alexa. Our findings give the first glimpse of how households integrate Alexa into their lives. We found interesting behaviors around purchasing and acclimating to Alexa, in the number and physical placement of devices, and in daily use patterns. Participants also uniformly described interactions between children and …", "num_citations": "240\n", "authors": ["1171"]}
{"title": "Development and evaluation of emerging design patterns for ubiquitous computing\n", "abstract": " Design patterns are a format for capturing and sharing design knowledge. In this paper, we look at a new domain for design patterns, namely ubiquitous computing. The overall goal of this work is to aid practice by speeding up the diffusion of new interaction techniques and evaluation results from researchers, presenting the information in a form more usable to practicing designers. Towards this end, we have developed an initial and emerging pattern language for ubiquitous computing, consisting of 45 pre-patterns describing application genres, physical-virtual spaces, interaction and systems techniques for managing privacy, and techniques for fluid interactions. We evaluated the effectiveness of our pre-patterns with 16 pairs of designers in helping them design location-enhanced applications. We observed that our pre-patterns helped new and experienced designers unfamiliar with ubiquitous computing in …", "num_citations": "233\n", "authors": ["1171"]}
{"title": "Toss'n'turn: smartphone as sleep and sleep quality detector\n", "abstract": " The rapid adoption of smartphones along with a growing habit for using these devices as alarm clocks presents an opportunity to use this device as a sleep detector. This adds value to UbiComp and personal informatics in terms of user context and new performance data to collect and visualize, and it benefits healthcare as sleep is correlated with many health issues. To assess this opportunity, we collected one month of phone sensor and sleep diary entries from 27 people who have a variety of sleep contexts. We used this data to construct models that detect sleep and wake states, daily sleep quality, and global sleep quality. Our system classifies sleep state with 93.06% accuracy, daily sleep quality with 83.97% accuracy, and overall sleep quality with 81.48% accuracy. Individual models performed better than generally trained models, where the individual models require 3 days of ground truth data and 3 weeks of …", "num_citations": "217\n", "authors": ["1171"]}
{"title": "Approximate information flows: Socially-based modeling of privacy in ubiquitous computing\n", "abstract": " In this paper, we propose a framework for supporting socially-compatible privacy objectives in ubiquitous computing settings. Drawing on social science research, we have developed a key objective called the Principle of Minimum Asymmetry, which seeks to minimize the imbalance between the people about whom data is being collected, and the systems and people that collect and use that data. We have also developed Approximate Information Flow (AIF), a model describing the interaction between the various actors and personal data. AIF effectively supports varying degrees of asymmetry for ubicomp systems, suggests new privacy protection mechanisms, and provides a foundation for inspecting privacy-friendliness of ubicomp systems.", "num_citations": "217\n", "authors": ["1171"]}
{"title": "Method and apparatus for dynamically delivering service profiles to clients\n", "abstract": " One embodiment of the present invention provides a system that facilitates dynamic delivery of service profiles to a client. During operation, the system performs a discovery operation to allow the client to discover new services on a network. If a new service is discovered for which the client does not possess a service profile, the client to obtains the service profile from the new service and subsequently installs it, thereby enabling the client to interact with the new service.", "num_citations": "208\n", "authors": ["1171"]}
{"title": "Rethinking location sharing: exploring the implications of social-driven vs. purpose-driven location sharing\n", "abstract": " The popularity of micro-blogging has made general-purpose information sharing a pervasive phenomenon. This trend is now impacting location sharing applications (LSAs) such that users are sharing their location data with a much wider and more diverse audience. In this paper, we describe this as social-driven sharing, distinguishing it from past examples of what we refer to as purpose-driven location sharing. We explore the differences between these two types of sharing by conducting a comparative two-week study with nine participants. We found significant differences in terms of users' decisions about what location information to share, their privacy concerns, and how privacy-preserving their disclosures were. Based on these results, we provide design implications for future LSAs.", "num_citations": "207\n", "authors": ["1171"]}
{"title": "Empirical models of privacy in location sharing\n", "abstract": " The rapid adoption of location tracking and mobile social networking technologies raises significant privacy challenges. Today our understanding of people's location sharing privacy preferences remains very limited, including how these preferences are impacted by the type of location tracking device or the nature of the locations visited. To address this gap, we deployed Locaccino, a mobile location sharing system, in a four week long field study, where we examined the behavior of study participants (n= 28) who shared their location with their acquaintances (n= 373.) Our results show that users appear more comfortable sharing their presence at locations visited by a large and diverse set of people. Our study also indicates that people who visit a wider number of places tend to also be the subject of a greater number of requests for their locations. Over time these same people tend to also evolve more sophisticated …", "num_citations": "206\n", "authors": ["1171"]}
{"title": "Topiary: a tool for prototyping location-enhanced applications\n", "abstract": " Location-enhanced applications use the location of people, places, and things to augment or streamline interaction. Location-enhanced applications are just starting to emerge in several different domains, and many people believe that this type of application will experience tremendous growth in the near future. However, it currently requires a high level of technical expertise to build location-enhanced applications, making it hard to iterate on designs. To address this problem we introduce Topiary, a tool for rapidly prototyping location-enhanced applications. Topiary lets designers create a map that models the location of people, places, and things; use this active map to demonstrate scenarios depicting location contexts; use these scenarios in creating storyboards that describe interaction sequences; and then run these storyboards on mobile devices, with a wizard updating the location of people and things on a …", "num_citations": "205\n", "authors": ["1171"]}
{"title": "Siren: Context-aware computing for firefighting\n", "abstract": " Based on an extensive field study of current firefighting practices, we have developed a system called Siren to support tacit communication between firefighters with multiple levels of redundancy in both communication and user alerts. Siren provides a foundation for gathering, integrating, and distributing contextual data, such as location and temperature. It also simplifies the development of firefighting applications using a peer-to-peer network of embedded devices through a uniform programming interface based on the information space abstraction. As a proof of concept, we have developed a prototype context-aware messaging application in the firefighting domain. We have evaluated this application with firefighters and they have found it to be useful for improving many aspects of their current work practices.", "num_citations": "204\n", "authors": ["1171"]}
{"title": "WebQuilt: A proxy-based approach to remote web usability testing\n", "abstract": " WebQuilt is a web logging and visualization system that helps web design teams run usability tests (both local and remote) and analyze the collected data. Logging is done through a proxy, overcoming many of the problems with server-side and client-side logging. Captured usage traces can be aggregated and visualized in a zooming interface that shows the web pages people viewed. The visualization also shows the most common paths taken through the web site for a given task, as well as the optimal path for that task, as designated by the designer. This paper discusses the architecture of WebQuilt and describes how it can be extended for new kinds of analyses and visualizations.", "num_citations": "199\n", "authors": ["1171"]}
{"title": "Getting users to pay attention to anti-phishing education: evaluation of retention and transfer\n", "abstract": " Educational materials designed to teach users not to fall for phishing attacks are widely available but are often ignored by users. In this paper, we extend an embedded training methodology using learning science principles in which phishing education is made part of a primary task for users. The goal is to motivate users to pay attention to the training materials. In embedded training, users are sent simulated phishing attacks and trained after they fall for the attacks. Prior studies tested users immediately after training and demonstrated that embedded training improved users' ability to identify phishing emails and websites. In the present study, we tested users to determine how well they retained knowledge gained through embedded training and how well they transferred this knowledge to identify other types of phishing emails. We also compared the effectiveness of the same training materials delivered via …", "num_citations": "193\n", "authors": ["1171"]}
{"title": "Casa: context-aware scalable authentication\n", "abstract": " We introduce context-aware scalable authentication (CASA) as a way of balancing security and usability for authentication. Our core idea is to choose an appropriate form of active authentication (eg, typing a PIN) based on the combination of multiple passive factors (eg, a user's current location) for authentication. We provide a probabilistic framework for dynamically selecting an active authentication scheme that satisfies a specified security requirement given passive factors. We also present the results of three user studies evaluating the feasibility and users' receptiveness of our concept. Our results suggest that location data has good potential as a passive factor, and that users can reduce up to 68% of active authentications when using an implementation of CASA, compared to always using fixed active authentication. Furthermore, our participants, including those who do not using any security mechanisms on …", "num_citations": "187\n", "authors": ["1171"]}
{"title": "Wireless location privacy protection\n", "abstract": " After more than two decades of hype, computing and communication technologies are finally converging. Java-enabled cell phones run a host of powerful applications including mobile Internet access, while many notebook computers offer high-speed wireless connectivity as a standard feature. The big decision when purchasing a PDA is whether to get integrated cellular service or Wi-Fi capability. Location-based services are emerging as the next killer app in personal wireless devices, but there are few safeguards on location privacy. In fact, the demand for improved public safety is pushing regulation in the opposite direction. Today, when a person reports an emergency from a landline phone by dialing 911 in the United States or 112 in Europe, the system displays the caller's phone number and address to the dispatcher. The US Federal Communications Commission has mandated that, by December 2005, all …", "num_citations": "185\n", "authors": ["1171"]}
{"title": "Are you close with me? Are you nearby? Investigating social groups, closeness, and willingness to share\n", "abstract": " As ubiquitous computing becomes increasingly mobile and social, personal information sharing will likely increase in frequency, the variety of friends to share with, and range of information that can be shared. Past work has identified that whom you share with is important for choosing whether or not to share, but little work has explored which features of interpersonal relationships influence sharing. We present the results of a study of 42 participants, who self-report aspects of their relationships with 70 of their friends, including frequency of collocation and communication, closeness, and social group. Participants rated their willingness to share in 21 different scenarios based on information a UbiComp system could provide. Our findings show that (a) self-reported closeness is the strongest indicator of willingness to share,(b) individuals are more likely to share in scenarios with common information (eg we are within …", "num_citations": "183\n", "authors": ["1171"]}
{"title": "Method and system for controlling context-aware cybersecurity training\n", "abstract": " A context-aware training system senses a user action that may expose the user to a threat, such as a cybersecurity threat. The system selects a training action from a collection of available training actions and causes the training action to be delivered to the user or a group of users. The system includes an administrator interface that enables an administrator to select, customize and/or assign constraints to the training action that will be delivered to the user (s).", "num_citations": "177\n", "authors": ["1171"]}
{"title": "Designing for serendipity: supporting end-user configuration of ubiquitous computing environments\n", "abstract": " The future world of ubiquitous computing is one in which we will be surrounded by an ever-richer set of networked devices and services. In such a world, we cannot expect to have available to us specific applications that allow us to accomplish every conceivable combination of devices that we might wish. Instead, we believe that many of our interactions will be through highly generic tools that allow enduser discovery, configuration, interconnection, and control of the devices around us. This paper presents a design study of such an environment, intended to support serendipitous, opportunistic use of discovered network resources. We present an examination of a generic browser-style application built on top of an infrastructure developed to support arbitrary recombination of devices and services, as well as a number of challenges we believe to be inherent in such settings.", "num_citations": "177\n", "authors": ["1171"]}
{"title": "Ubiquitous computing for firefighters: Field studies and prototypes of large displays for incident command\n", "abstract": " In this paper, we demonstrate how field studies, interviews, and low-fidelity prototypes can be used to inform the design of ubiquitous computing systems for firefighters. We describe the artifacts and processes used by firefighters to assess, plan, and communicate during emergency situations, showing how accountability affects these decisions, how their current Incident Command System supports these tasks, and some drawbacks of existing solutions. These factors informed the design of a large electronic display for supporting the incident commander, the person who coordinates the overall response strategy in an emergency. Although our focus was on firefighters, our results are applicable for other aspects of emergency response as well, due to common procedures and training.", "num_citations": "172\n", "authors": ["1171"]}
{"title": "WebQuilt: a framework for capturing and visualizing the web experience\n", "abstract": " WebQuilt is a web logging and visualization system that helps web design teams run usability tests (both local and remote) and analyze the collected data. Logging is done through a proxy, overcoming many of the problems with server-side and client-side logging. Captured usage traces can be aggregated and visualized in a zooming interface that shows the web pages people viewed. The visualization also shows the most common paths taken through the website for a given task, as well as the optimal path for that task as designated by the designer. This paper discusses the architecture of WebQuilt and also describes how it can be extended for new kinds of analyses and visualizations.", "num_citations": "170\n", "authors": ["1171"]}
{"title": "Computational support for sketching in design: a review\n", "abstract": " Computational support for sketching has a long and interesting history dating back to the early days of computing. Computational Support for Sketching in Design: A Review takes a brief look at the origins and history of the subject before going on to survey the literature from a wide variety of sources on modern sketch based design tools. It first describes the practical basis of sketching-why people sketch, what significance it has in design and problem solving, and the cognitive activities it supports. It goes on to survey computational support for sketching, including methods for performing sketch recognition and managing ambiguity, techniques for modeling recognizable elements, and human-computer interaction techniques for working with sketches. It concludes by proposing challenges and opportunities for future advances in this field. Computational Support for Sketching in Design: A Review is an ideal reference for researchers from the many disciplines-human-computer interaction, cognitive science, design research, computer science, artificial intelligence, and engineering design-that have contributed to the knowledge about sketching and computational techniques for supporting it, or are interested in getting up to speed on the topic.", "num_citations": "157\n", "authors": ["1171"]}
{"title": "A hybrid phish detection approach by identity discovery and keywords retrieval\n", "abstract": " Phishing is a significant security threat to the Internet, which causes tremendous economic loss every year. In this paper, we proposed a novel hybrid phish detection method based on information extraction (IE) and information retrieval (IR) techniques. The identity-based component of our method detects phishing webpages by directly discovering the inconsistency between their identity and the identity they are imitating. The keywords-retrieval component utilizes IR algorithms exploiting the power of search engines to identify phish. Our method requires no training data, no prior knowledge of phishing signatures and specific implementations, and thus is able to adapt quickly to constantly appearing new phishing patterns. Comprehensive experiments over a diverse spectrum of data sources with 11449 pages show that both components have a low false positive rate and the stacked approach achieves a true …", "num_citations": "155\n", "authors": ["1171"]}
{"title": "The privacy and security behaviors of smartphone app developers\n", "abstract": " Smartphone app developers have to make many privacy-related decisions about what data to collect about endusers, and how that data is used. We explore how app developers make decisions about privacy and security. Additionally, we examine whether any privacy and security behaviors are related to characteristics of the app development companies. We conduct a series of interviews with 13 app developers to obtain rich qualitative information about privacy and security decision-making. We use an online survey of 228 app developers to quantify behaviors and test our hypotheses about the relationship between privacy and security behaviors and company characteristics. We find that smaller companies are less likely to demonstrate positive privacy and security behaviors. Additionally, although third-party tools for ads and analytics are pervasive, developers aren’t aware of the data collected by these tools. We suggest tools and opportunities to reduce the barriers for app developers to implement privacy and security best practices.", "num_citations": "150\n", "authors": ["1171"]}
{"title": "Mock attack cybersecurity training system and methods\n", "abstract": " A training system senses a user action that may expose the user to a threat, such as a cybersecurity threat. The user action may be in response to a mock attack delivered via a messaging service, a wireless communication service, a fake malware application or another device, service, system or mechanism. The system selects a training action from a collection of available training actions and causes the training action to be delivered to the user.", "num_citations": "143\n", "authors": ["1171"]}
{"title": "A diary study of password usage in daily life\n", "abstract": " While past work has examined password usage on a specific computer, web site, or organization, there is little work examining overall password usage in daily life. Through a diary study, we examine all usage of passwords, and offer some new findings based on quantitative analyses regarding how often people log in, where they log in, and how frequently people use foreign computers. Our analysis also confirms or updates existing statistics about password usage patterns. We also discuss some implications for design as well as security education.", "num_citations": "141\n", "authors": ["1171"]}
{"title": "Context-aware training systems, apparatuses, and methods\n", "abstract": " Context-aware training systems, apparatuses and systems. The context-aware training systems, apparatuses and systems are computer-implemented and include sensing a user action and, based on a training needs model, estimating a cost or benefit to exposing the user to a training action, selecting a training action from a collection of available training actions and delivering the training action to the user if the user action indicates a need for the user to be trained and the cost or benefit to exposing the user to the training action indicates user exposure to the training action is warranted.", "num_citations": "131\n", "authors": ["1171"]}
{"title": "Lessons from a real world evaluation of anti-phishing training\n", "abstract": " Prior laboratory studies have shown that PhishGuru, an embedded training system, is an effective way to teach users to identify phishing scams. PhishGuru users are sent simulated phishing attacks and trained after they fall for the attacks. In this current study, we extend the PhishGuru methodology to train users about spear phishing and test it in a real world setting with employees of a Portuguese company. Our results demonstrate that the findings of PhishGuru laboratory studies do indeed hold up in a real world deployment. Specifically, the results from the field study showed that a large percentage of people who clicked on links in simulated emails proceeded to give some form of personal information to fake phishing websites, and that participants who received PhishGuru training were significantly less likely to fall for subsequent simulated phishing attacks one week later. This paper also presents some …", "num_citations": "130\n", "authors": ["1171"]}
{"title": "Phinding Phish: An Evaluation of Anti-Phishing Toolbars\n", "abstract": " There are currently dozens of freely available tools to help combat phishing and other web-based scams. Many of these tools come in the form of web browser extensions that warn users when they are browsing a suspected phishing site. We used verified phishing URLs and legitimate URLs to test the effectiveness of 10 popular antiphishing toolbars. Overall, we found that the anti-phishing toolbars that were examined in this study left a lot to be desired. SpoofGuard did a very good job at identifying fraudulent sites, but it also incorrectly identified a large fraction of legitimate sites as fraudulent. EarthLink, Google, Netcraft, Cloudmark, and Internet Explorer 7 identified most fraudulent sites correctly and had few, if any, false positives, but they still missed more than 15% of fraudulent sites. The TrustWatch, eBay, and Netscape 8 toolbars could correctly identify less than half the fraudulent sites, and McAfee SiteAdvisor did not correctly identify any fraudulent sites. Many of the toolbars we tested were vulnerable to some simple exploits as well. In this paper we describe the anti-phishing toolbar test bed we developed, summarize our findings, and offer observations about the usability and overall effectiveness of these toolbars. Finally, we suggest ways to improve anti-phishing toolbars.", "num_citations": "117\n", "authors": ["1171"]}
{"title": "Putting people in their place: an anonymous and privacy-sensitive approach to collecting sensed data in location-based applications\n", "abstract": " The emergence of location-based computing promises new and compelling applications, but raises very real privacy risks. Existing approaches to privacy generally treat people as the entity of interest, often using a fidelity tradeoff to manage the costs and benefits of revealing a person's location. However, these approaches cannot be applied in some applications, as a reduction in precision can render location information useless. This is true of a category of applications that use location data collected from multiple people to infer such information as whether there is a traffic jam on a bridge, whether there are seats available in a nearby coffee shop, when the next bus will arrive, or if a particular conference room is currently empty. We present hitchhiking, a new approach that treats locations as the primary entity of interest. Hitchhiking removes the fidelity tradeoff by preserving the anonymity of reports without reducing …", "num_citations": "114\n", "authors": ["1171"]}
{"title": "What do we \"mashup\" when we make mashups\n", "abstract": " This paper describes preliminary work in the uncovering of mashup patterns in order to find new directions for the design of mashup tools. We conducted a qualitative survey of high-quality mashups, as nominated in two popular mashup directories, and examined how the mashups made use of existing websites or improved upon them, how data from multiple websites were combined, and what kinds of user tasks these mashups might be suitable for. We describe a set of patterns what we found in our sample of mashups.", "num_citations": "113\n", "authors": ["1171"]}
{"title": "The context fabric: an infrastructure for context-aware computing\n", "abstract": " Despite many sensor, hardware, networking, and software advances, it is still quite difficult to build effective and reliable context-aware applications. We propose to build a context infrastructure that provides three things to simplify the task of building context-aware applications: a context data store for modeling, storing, and distributing context data; a context specification language for declaratively stating and processing context needs; and protection mechanisms for safeguarding privacy needs.", "num_citations": "102\n", "authors": ["1171"]}
{"title": "Caché: caching location-enhanced content to improve user privacy\n", "abstract": " We present the design, implementation, and evaluation of Caché, a system that offers location privacy for certain classes of location-based applications. The core idea in Caché is to periodically pre-fetch potentially useful location-enhanced content well in advance. Applications then retrieve content from a local cache on the mobile device when it is needed. This approach allows an end-user to make use of location-enhanced content while only revealing to third-party content providers a large geographic region rather than a precise location. In this paper, we present an analysis that examines tradeoffs in terms of storage, bandwidth, and freshness of data. We then discuss the design and implementation of an Android service embodying these ideas. Finally, we provide two evaluations of Caché. One measures the performance of our approach with respect to privacy and mobile content availability using real-world …", "num_citations": "97\n", "authors": ["1171"]}
{"title": "Context-aware training systems, apparatuses, and methods\n", "abstract": " A context-aware training system senses sensing a user action that may expose the user's computer to a cybersecurity threat. The system selects training action from a collection of available training actions and causes the training action to be selected to the user.", "num_citations": "96\n", "authors": ["1171"]}
{"title": "The Effect of Social Influence on Security Sensitivity\n", "abstract": " Despite an impressive effort at raising the general populace’s security sensitivity—the awareness of, motivation to use, and knowledge of how to use security and privacy tools—much security advice is ignored and many security tools remain underutilized. Part of the problem may be that we do not yet understand the social processes underlying people’s decisions to (1) disseminate information about security and privacy and (2) actually modify their security behaviors (eg, adopt a new security tool or practice). To that end, we report on a retrospective interview study examining the role of social influence—or, our ability to affect the behaviors and perceptions of others with our own words and actions—in people’s decisions to change their security behaviors, as well as the nature of and reasons for their discussions about security. We found that social processes played a major role in a large number of privacy and security-related behavior changes reported by our sample, probably because these processes were effective at raising security sensitivity. We also found that conversations about security were most often driven by the desire to warn or protect others from immediate novel threats observed or experienced, or to gather information about solving an experienced problem. Furthermore, the observability of security feature usage was a key enabler of socially triggered behavior change—both in encouraging the spread of positive behaviors and in discouraging negative behaviors.", "num_citations": "95\n", "authors": ["1171"]}
{"title": "User-controllable security and privacy for pervasive computing\n", "abstract": " We describe our current work in developing novel mechanisms for managing security and privacy in pervasive computing environments. More specifically, we have developed and evaluated three different applications, including a contextual instant messenger, a people finder application, and a phone-based application for access control. We also draw out some themes we have learned thus far for user-controllable security and privacy.", "num_citations": "92\n", "authors": ["1171"]}
{"title": "Mining smartphone data to classify life-facets of social relationships\n", "abstract": " People engage with many overlapping social networks and enact diverse social roles across different facets of their lives. Unfortunately, many online social networking services reduce most people's contacts to\" friend\". A richer computational model of relationships would be useful for a number of applications such as managing privacy settings and organizing communications. In this paper, we take a step towards a richer computational model by using call and text message logs from mobile phones to classifying contacts according to life facet (family, work, and social). We extract various features such as communication intensity, regularity, medium, and temporal tendency, and classify the relationships using machine-learning techniques. Our experimental results on 40 users showed that we could classify life facets with up to 90.5% accuracy. The most relevant features include call duration, channel selection, and …", "num_citations": "91\n", "authors": ["1171"]}
{"title": "Privacy patterns for online interactions\n", "abstract": " A proper security architecture is an essential part of implementing robust and reliable networked applications. Security patterns have shown how reoccurring problems can be best solved with proven solutions. However, while they are critical for ensuring the confidentiality, integrity and availability of computing systems, security patterns do not specifically (or necessarily) address the privacy of individuals. Building on existing privacy pattern work, we identify three privacy patterns for web-based activity: INFORMED CONSENT FOR WEB-BASED TRANSACTIONS, MASKED ONLINE TRAFFIC, and MINIMAL INFORMATION ASYMMETRY. The first pattern addresses a system architecture issue and draws on Friedman's model for informed consent. The second and third patterns provide support for end users and extend Jiang's' Principle of Minimum Asymmetry.'These patterns describe how users can protect their privacy …", "num_citations": "88\n", "authors": ["1171"]}
{"title": "Modeling people's place naming preferences in location sharing\n", "abstract": " Most location sharing applications display people's locations on a map. However, people use a rich variety of terms to refer to their locations, such as\" home,\"\" Starbucks,\" or\" the bus stop near my house.\" Our long-term goal is to create a system that can automatically generate appropriate place names based on real-time context and user preferences. As a first step, we analyze data from a two-week study involving 26 participants in two different cities, focusing on how people refer to places in location sharing. We derive a taxonomy of different place naming methods, and show that factors such as a person's perceived familiarity with a place and the entropy of that place (ie the variety of people who visit it) strongly influence the way people refer to it when interacting with others. We also present a machine learning model for predicting how people name places. Using our data, this model is able to predict the place …", "num_citations": "80\n", "authors": ["1171"]}
{"title": "Field Deployment of IMBuddy: A Study of Privacy Control and Feedback Mechanisms for Contextual IM\n", "abstract": " We describe the design of privacy controls and feedback mechanisms for contextual IM, an instant messaging service for disclosing contextual information. We tested our designs on IMBuddy, a contextual IM service we developed that discloses contextual information, including interruptibility, location, and the current window in focus (a proxy for the current task). We deployed our initial design of IMBuddy’s privacy mechanisms for two weeks with ten IM users. We then evaluated a redesigned version for four weeks with fifteen users. Our evaluation indicated that users found our group-level rule-based privacy control intuitive and easy to use. Furthermore, the set of feedback mechanisms provided users with a good awareness of what was disclosed.", "num_citations": "80\n", "authors": ["1171"]}
{"title": "\" You Never Call, You Never Write\" Call and SMS Logs Do Not Always Indicate Tie Strength\n", "abstract": " How effective are call and SMS logs in modeling tie strength? Frequency and duration of communication has long been cited as a major aspect of tie strength. Intuitively, this makes sense: people communicate with those that they feel close to. Highly cited research papers have pushed this idea further, using communication as a direct proxy for tie strength. However, this operationalization has not been validated. Our work evaluates this assumption. We collected call and SMS logs and ground truth relationship data from 36 participants. Consistent with theory, we found that frequent or long-duration communication likely indicates a strong tie. However, the use of call and SMS logs produced many errors in separating strong and weak ties, suggesting this approach is incomplete. Follow-up interviews indicate fundamental challenges for inferring tie strength from communication logs.", "num_citations": "79\n", "authors": ["1171"]}
{"title": "Considering privacy issues in the context of Google glass\n", "abstract": " The Communications Web site, http://cacm.acm.org, features more than a dozen bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish selected posts or excerpts.twitterFollow us on Twitter at http://twitter.com/blogCACMhttp://cacm.acm.org/blogs/blog-cacmJason Hong ponders why there has been so much negative press coverage of Google Glass with regard to privacy, considering the issue from two different perspectives.", "num_citations": "78\n", "authors": ["1171"]}
{"title": "What did they do? understanding clickstreams with the webquilt visualization system\n", "abstract": " This paper describes the visual analysis tool WebQuilt, a web usability logging and visualization system that helps web design teams record and analyze usability tests. The logging portion of WebQuilt unobtrusively gathers clickstream data as users complete specified tasks. This data is then aggregated and presented as an interactive graph, where nodes of the graph are images of the web pages visited, and arrows are the transitions between pages. To aid analysis of the gathered usability test data, the WebQuilt visualization provides filtering capabilities and semantic zooming, allowing the designer to understand the test results at the gestalt view of the entire graph, and then drill down to sub-paths and single pages. The visualization highlights important usability issues, such as pages where users spent a lot of time, pages where users get off track during the task, navigation patterns, and exit pages, all within the …", "num_citations": "78\n", "authors": ["1171"]}
{"title": "SWAMI: a framework for collaborative filtering algorithm development and evaluation\n", "abstract": " We present a Java-based framework, SWAMI (Shared Wisdom through the Amalgamation of Many Interpretations) for building and studying collaborative filtering systems. SWAMI consists of three components: a prediction engine, an evaluation system, and a visualization component. The prediction engine provides a common interface for implementing different prediction algorithms. The evaluation system provides a standardized testing methodology and metrics for analyzing the accuracy and run-time performance of prediction algorithms. The visualization component suggests how graphical representations can inform the development and analysis of prediction algorithms. We demonstrate SWAMI on the Each Movie data set by comparing three prediction algorithms: a traditional Pearson correlation-based method, support vector machines, and a new accurate and scalable correlation-based method based on …", "num_citations": "78\n", "authors": ["1171"]}
{"title": "Contextual web history: using visual and contextual cues to improve web browser history\n", "abstract": " While most modern web browsers offer history functionality, few people use it to revisit previously viewed web pages. In this paper, we present the design and evaluation of Contextual Web History (CWH), a novel browser history implementation which improves the visibility of the history feature and helps people find previously visited web pages. We present the results of a formative user study to understand what factors helped people in finding past web pages. From this, we developed CWH to be more visible to users, and supported search, browsing, thumbnails, and metadata. Combined, these relatively simple features outperformed Mozilla Firefox 3's built-in browser history function, and greatly reduced the time and effort required to find and revisit a web page.", "num_citations": "73\n", "authors": ["1171"]}
{"title": "Increasing security sensitivity with social proof: A large-scale experimental confirmation\n", "abstract": " One of the largest outstanding problems in computer security is the need for higher awareness and use of available security tools. One promising but largely unexplored approach is to use social proof: by showing people that their friends use security features, they may be more inclined to explore those features, too. To explore the efficacy of this approach, we showed 50,000 people who use Facebook one of 8 security announcements'7 variations of social proof and 1 non-social control-to increase the exploration and adoption of three security features: Login Notifications, Login Approvals, and Trusted Contacts. Our results indicated that simply showing people the number of their friends that used security features was most effective, and drove 37% more viewers to explore the promoted security features compared to the non-social announcement (thus, raising awareness). In turn, as social announcements drove …", "num_citations": "72\n", "authors": ["1171"]}
{"title": "mFerio: the design and evaluation of a peer-to-peer mobile payment system\n", "abstract": " In this paper, we present the design and evaluation of a near-field communication-based mobile p2p payment application, called mFerio, that is designed to replace cash-based transactions. We first identify design criteria that payment systems should satisfy and then explain how mFerio, relative to those criteria, improves on the limitations of cash-based systems. We next describe mFerio's implementation and user interface design, focusing on the balance between usability and security. Finally, we present the results of a two-phase user study, involving a total of 104 people, that shows that mFerio has low cognitive load and is also fast, accurate, and easy to use-even outperforming cash in terms of speed and cognitive load in common payment situations.", "num_citations": "68\n", "authors": ["1171"]}
{"title": "Locaccino: a privacy-centric location sharing application\n", "abstract": " Locaccino is a location sharing application designed to empower users to effectively control their privacy. It has been piloted by close to 2000 users and has been used by researchers as an experimental platform for conducting research on location-based social networks. Featured technologies include expressive privacy rule creation, detailed feedback mechanisms that help users understand their privacy, algorithms for analyzing privacy preferences, and clients for mobile computers and smartphone devices. In addition, variations of Locaccino are also being piloted as part of research on user-controllable policy learning, learning usable privacy personas and reconciling expressiveness and user burden. The purpose of this demo is to introduce participants to the features of Locaccino, so that they can try out the Locaccino smartphone and laptop applications on their own devices, locate their friends and colleagues …", "num_citations": "66\n", "authors": ["1171"]}
{"title": "Graphite: A visual query system for large graphs\n", "abstract": " We present Graphite, a system that allows the user to visually construct a query pattern, finds both its exact and approximate matching subgraphs in large attributed graphs, and visualizes the matches. For example, in a social network where a person's occupation is an attribute, the user can draw a 'star' query for \"finding a CEO who has interacted with a Secretary, a Manager, and an Accountant, or a structure very similar to this\". Graphite uses the G-Ray algorithm to run the query against a user-chosen data graph, gaining all of its benefits, namely its high speed, scalability, and its ability to find both exact and near matches. Therefore, for the example above, Graphite tolerates indirect paths between, say, the CEO and the Accountant, when no direct path exists. Graphite uses fast algorithms to estimate node proximities when finding matches, enabling it to scale well with the graph database size.We demonstrate …", "num_citations": "66\n", "authors": ["1171"]}
{"title": "Using text mining to infer the purpose of permission use in mobile apps\n", "abstract": " Understanding the purpose of why sensitive data is used could help improve privacy as well as enable new kinds of access control. In this paper, we introduce a new technique for inferring the purpose of sensitive data usage in the context of Android smartphone apps. We extract multiple kinds of features from decompiled code, focusing on app-specific features and text-based features. These features are then used to train a machine learning classifier. We have evaluated our approach in the context of two sensitive permissions, namely ACCESS_FINE_LOCATION and READ_CONTACT_LIST, and achieved an accuracy of about 85% and 94% respectively in inferring purposes. We have also found that text-based features alone are highly effective in inferring purposes.", "num_citations": "65\n", "authors": ["1171"]}
{"title": "The role of social influence in security feature adoption\n", "abstract": " Social influence is key in technology adoption, but its role in security-feature adoption is unique and remains unclear. Here, we analyzed how three Facebook security features' Login Approvals, Login Notifications, and Trusted Contacts-diffused through the social networks of 1.5 million people. Our results suggest that social influence affects one's likelihood to adopt a security feature, but its effect varies based on the observability of the feature, the current feature adoption rate among a potential adopter's friends, and the number of distinct social circles from which those feature-adopting friends originate. Curiously, there may be a threshold higher than which having more security feature adopting friends predicts for higher adoption likelihood, but below which having more feature-adopting friends predicts for lower adoption likelihood. Furthermore, the magnitude of this threshold is modulated by the attributes of a …", "num_citations": "65\n", "authors": ["1171"]}
{"title": "Does this App Really Need My Location? Context-Aware Privacy Management for Smartphones\n", "abstract": " The enormous popularity of smartphones, their rich sensing capabilities, and the data they have about their users have lead to millions of apps being developed and used. However, these capabilities have also led to numerous privacy concerns. Platform manufacturers, as well as researchers, have proposed numerous ways of mitigating these concerns, primarily by providing fine-grained visibility and privacy controls to the user on a per-app basis. In this paper, we show that this per-app permission approach is suboptimal for many apps, primarily because most data accesses occur due to a small set of popular third-party libraries which are common across multiple apps. To address this problem, we present the design and implementation of ProtectMyPrivacy (PmP) for Android, which can detect critical contextual information at runtime when privacy-sensitive data accesses occur. In particular, PmP infers the purpose …", "num_citations": "62\n", "authors": ["1171"]}
{"title": "A Supervised Approach to Predict Company Acquisition with Factual and Topic Features Using Profiles and News Articles on TechCrunch\n", "abstract": " Merger and Acquisition (M&A) prediction has been an interesting and challenging research topic in the past a few decades. However, past work has only adopted numerical features in building models, and yet the valuable textual information from the great variety of social media sites has not been touched at all. To fully explore this information, we used the profiles and news articles for companies and people on TechCrunch, the leading and largest public database for the tech world, which anybody can edit. Specifically, we explored topic features via topic modeling techniques, as well as a set of other novel features of our design within a machine learning framework. We conducted experiments of the largest scale in the literature, and achieved a high true positive rate (TP) between 60% to 79.8% with a false positive rate (FP) mostly between 0% and 8.3% over company categories with a small number of missing attributes in the CrunchBase profiles.", "num_citations": "58\n", "authors": ["1171"]}
{"title": "liquid: Context-aware distributed queries\n", "abstract": " As low-level architectural support for context-aware computing matures, we are ready to explore more general and powerful means of accessing context data. Information required by a context-aware application may be partitioned by any number of physical, organizational, or privacy boundaries. This suggests the need for mechanisms by which applications can issue context-sensitive queries without having to explicitly manage the complex storage layout and access policies of the underlying data. To address this need, we have developed liquid, a prototype query service that supports distributed, continuous query processing of context data. This paper articulates the current need for such systems, describes the design of the liquidsystem, and presents both a room-awareness application and notification service demonstrating its functionality.", "num_citations": "58\n", "authors": ["1171"]}
{"title": "Context-aware cybersecurity training systems, apparatuses, and methods\n", "abstract": " A system assesses the susceptibility of an electronic device user to a cybersecurity threat by sensing a user action with respect to the electronic device. The system maps the sensed data to a training needs model to determine whether the sensed data corresponds to a pattern associated with a threat scenario in the training needs model. When the system determines that the sensed data corresponds to a pattern associated with a threat scenario in the training needs model, identify a cybersecurity threat scenario for which the user is at risk, and use the training needs model to estimate susceptibility of the user to the cybersecurity threat scenario.", "num_citations": "56\n", "authors": ["1171"]}
{"title": "Detection of behavior change in people with depression\n", "abstract": " Major Depressive Disorder (MDD) is the most common mental health disorder and remains a leading cause of disability and lost productivity with huge costs for society. MDD has high rates of relapse and recurrence, and it has strong correlations with feelings of low social support and disrupted sleep. However, MDD is also commonly misdiagnosed by primary care providers, which leads to delayed treatment and unnecessary suffering. Changes in technology now make it possible to cheaply and effectively monitor social and sleep behaviors, offering the potential of early detection of the onset of MDD. We report on the design of Big Black Dog, a smartphone-based system for gathering data about social and sleep behaviors. We also report on the results of a pilot evaluation to understand the feasibility of gathering and using data from smartphones for inferring the onset of depression.", "num_citations": "56\n", "authors": ["1171"]}
{"title": "Undistracted driving: A mobile phone that doesn't distract\n", "abstract": " Distracted driving is a major problem that leads to unnecessary accidents and human casualties everywhere in the world. The ubiquity of mobile phones is one cause of distracted driving. In United States alone, operating mobile phones while driving has been cited as a factor in crashes that have led to 995 deaths and 24,000 injuries in 2009. To mitigate the problem of distracted driving caused by mobile phones, we propose using context-awareness to implement burden-shifting, time-shifting, and activity-based sharing. Although the first two concepts have been introduced before in the research literature and the latter two are novel, none of these concepts have yet been explored in the context of mobile phones and driving. We present our initial interaction designs for these concepts on the Android platform.", "num_citations": "53\n", "authors": ["1171"]}
{"title": "Wave to me: user identification using body lengths and natural gestures\n", "abstract": " We introduce a body-based identification system that leverages individual differences in body segment lengths and hand waving gesture patterns. The system identifies users based on a two-second hand waving gesture captured by a Microsoft Kinect. To evaluate our system, we collected 8640 gesture measurements from 75 participants through two lab studies and a field study. In the first lab study, we evaluated the feasibility of our concept and basic properties of features to narrow down the design space. In the second lab study, our system achieved a 1% equal error rate in user identification among seven registered users after two weeks following initial registration. We also found that our system was robust even when lower body segments could not be measured because of occlusions. In the field study, our system achieved 0.5 to 1.6% equal error rates, demonstrating that the system also works well in …", "num_citations": "52\n", "authors": ["1171"]}
{"title": "System and method for controlling communication\n", "abstract": " Methods and systems for enabling arbitrary components to control communications, such as data transfers, without having or requiring prior knowledge of each other. The system includes a component that creates controller objects for a communication, such as a data transfer involving several components. Further, the component associates the controller objects with a communication session object of the data transfer, such as a data transfer session object. One or more of the components involved in the data transfer obtain the controller objects through the data transfer session object and execute source-specific instructions included in the obtained controller objects to generate user interfaces. The user interfaces enable the components to control aspects of the communication, such as the data transfer.", "num_citations": "52\n", "authors": ["1171"]}
{"title": "State of the geotags: Motivations and recent changes\n", "abstract": " The widespread adoption of smartphones has made it possible for large numbers of people to geotag their social media posts. Past work has studied the reasons people tag their location and the ways they do so on location-based social networks like Foursquare. But it is unclear how well these findings generalize to other social media not centered on location, such as Twitter or Flickr. Through an analysis of public data and two surveys, we investigate why people geotag their photos, tweets, and other non-location-based social media. We found that their reasons are similar to those in location-based social networks. We also found several surprises due to the different nature of these platforms and the changes since location-based social networks were introduced. For example, people usually consciously geotag, though a significant portion geotags unintentionally; coordinate geotagging is changing to placetagging; and job-posting bots constitute a growing portion of public geotags.", "num_citations": "51\n", "authors": ["1171"]}
{"title": "DENIM: an informal tool for early stage web site design\n", "abstract": " DENIM is a system that helps web site designers in the early stages of design. DENIM supports sketching input; allows design at different refinement levels--site map, storyboard, and individual page; and unifies the levels through zooming. The design of DENIM was informed by a study of web site design practice, in which we observed that web site designers design sites at the levels of refinement mentioned above and that designers sketch at all levels during the early stages of design.", "num_citations": "51\n", "authors": ["1171"]}
{"title": "An explorative study of the mobile app ecosystem from app developers' perspective\n", "abstract": " With the prevalence of smartphones, app markets such as Apple App Store and Google Play has become the center stage in the mobile app ecosystem, with millions of apps developed by tens of thousands of app developers in each major market. This paper presents a study of the mobile app ecosystem from the perspective of app developers. Based on over one million Android apps and 320,000 developers from Google Play, we analyzed the Android app ecosystem from different aspects. Our analysis shows that while over half of the developers have released only one app in the market, many of them have released hundreds of apps. We classified developers into different groups based on the number of apps they have released, and compared their characteristics. Specially, we have analyzed the group of aggressive developers who have released more than 50 apps, trying to understand how and why they …", "num_citations": "50\n", "authors": ["1171"]}
{"title": "Design challenges and principles for Wizard of Oz testing of location-enhanced applications\n", "abstract": " Using Wizard of Oz techniques, designers can efficiently test location-enhanced application prototypes during the early stages of design, without building a full-fledged application or deploying a sensing infrastructure. Location-enhanced applications adapt their behavior to or provide information about the location of people, places, and things. Such location-enhanced applications are the most widely adopted type of ubicomp application; analysts predict that their use will grow tremendously in the near future.", "num_citations": "49\n", "authors": ["1171"]}
{"title": "Using social media data to understand cities\n", "abstract": " Understanding urban dynamics is crucial for a number of domains, but it can be expensive and time consuming to gather necessary data. The rapid rise of social media has given us a new and massive source of geotagged data that can be transformative in terms of how we understand our cities. In this position paper, we describe three opportunities in using geotagged social media data: to help city planners, to help small businesses, and to help individuals adapt to their city better. We also sketch some possible research projects to help map out the design space, as well as discuss some limitations and challenges in using this kind of data.", "num_citations": "48\n", "authors": ["1171"]}
{"title": "Towards wearable everyday body-frame tracking using passive RFIDs\n", "abstract": " We introduce RF-Wear, an accurate and wearable solution to track movements of a user's body using passive RFIDs embedded in their clothing. RF-Wear processes wireless signals reflected off these tags to a compact single-antenna RFID reader in the user's pocket. In doing so, RF-Wear enables a first-of-its-kind body-frame tracking mechanism that is lightweight and convenient for day-to-day use, without relying on external infrastructure. At the heart of RF-Wear is a novel primitive that computes angles between different parts of the user's body using the RFID tags attached to them. RF-Wear achieves this by treating groups of RFID tags as an array of antennas whose orientation can be computed accurately relative to the handheld reader. By computing the orientation of individual body parts, we demonstrate how RF-Wear reconstructs the real-time posture of the user's entire body frame. Our solution overcomes …", "num_citations": "46\n", "authors": ["1171"]}
{"title": "Exploring capturable everyday memory for autobiographical authentication\n", "abstract": " We explore how well the intersection between our own everyday memories and those captured by our smartphones can be used for what we call autobiographical authentication-a challenge-response authentication system that queries users about day-to-day experiences. Through three studies-two on MTurk and one field study-we found that users are good, but make systematic errors at answering autobiographical questions. Using Bayesian modeling to account for these systematic response errors, we derived a formula for computing a confidence rating that the attempting authenticator is the user from a sequence of question-answer responses. We tested our formula against five simulated adversaries based on plausible real-life counterparts. Our simulations indicate that our model of autobiographical authentication generally performs well in assigning high confidence estimates to the user and low confidence …", "num_citations": "45\n", "authors": ["1171"]}
{"title": "Understanding the purpose of permission use in mobile apps\n", "abstract": " Mobile apps frequently request access to sensitive data, such as location and contacts. Understanding the purpose of why sensitive data is accessed could help improve privacy as well as enable new kinds of access control. In this article, we propose a text mining based method to infer the purpose of sensitive data access by Android apps. The key idea we propose is to extract multiple features from app code and then use those features to train a machine learning classifier for purpose inference. We present the design, implementation, and evaluation of two complementary approaches to infer the purpose of permission use, first using purely static analysis, and then using primarily dynamic analysis. We also discuss the pros and cons of both approaches and the trade-offs involved.", "num_citations": "42\n", "authors": ["1171"]}
{"title": "The implications of offering more disclosure choices for social location sharing\n", "abstract": " We compared two privacy configuration styles for specifying rules for social sharing one's past locations. Our findings suggest that location-sharing applications (LSAs) which support varying levels of location granularities are associated with sharing rules that are less convoluted, are less likely to be negatively phrased, and can lead to more open sharing; users are also more comfortable with these rules. These findings can help inform LSA privacy designs.", "num_citations": "42\n", "authors": ["1171"]}
{"title": "A context/communication information agent\n", "abstract": " We are developing a Context/Communication Information Agent (CIA), an autonomous software agent that proactively searches for the right information at the right time. Our goal is to design and evaluate a system that leverages what people naturally do, using this knowledge to retrieve information, and presenting it with a minimal cost of disruption to the users. In this paper, we describe the results a low-fidelity prototype performed in a meeting situation, the design space for such an application, and our plans for continued investigation.", "num_citations": "42\n", "authors": ["1171"]}
{"title": "Generating default privacy policies for online social networks\n", "abstract": " Default privacy policies have a significant impact on the overall dynamics and success of online social networks, as users tend to keep their initial privacy policies. In this work-in-progress, we present a new method for suggesting privacy policies for new users by exploring knowledge of existing policies. The defaults generation process performs a collaborative analysis of the policies, finding personalized and representative suggestions. We show how the process can be extended to a wide range of domains, and present results based on 543 privacy policies obtained from a live location-based social network. Finally, we present a user interaction model that lets the user retain control over the default policies, allowing the user to make knowledgeable decisions regarding which default policy to take.", "num_citations": "41\n", "authors": ["1171"]}
{"title": "A comparative study of location-sharing privacy preferences in the United States and China\n", "abstract": " While prior studies have provided us with an initial understanding of people’s location-sharing privacy preferences, they have been limited to Western countries and have not investigated the impact of the granularity of location disclosures on people’s privacy preferences. We report findings of a 3-week comparative study collecting location traces and location-sharing preferences from two comparable groups in the United States and China. Results of the study shed further light on the complexity of people’s location-sharing privacy preferences and key attributes influencing willingness to disclose locations to others and to advertisers. While our findings reveal many similarities between US and Chinese participants, they also show interesting differences, such as differences in willingness to share location at “home” and at “work” and differences in the granularity of disclosures people feel comfortable with. We …", "num_citations": "39\n", "authors": ["1171"]}
{"title": "End-user perceptions of formal and informal representations of Web sites\n", "abstract": " Web site designers have expressed concerns that formal, cleaned-up representations of early ideas cause end-users to focus on inappropriate details. It is believed that the high-fidelity of formal representations cause end-users to believe a design is more complete and therefore not amenable to high-level changes and suggestions. In this paper we present an experiment comparing end-user perceptions of formal and informal electronic representations of web site designs. We found that end-users do in fact believe formal representations are finished and unchanging, but that this does not seem to influence the level of detail in their suggestions. However, it appears that informal designs presented in an electronic medium raises user expectations such that lower-level suggestions about the visual aspects were made.", "num_citations": "39\n", "authors": ["1171"]}
{"title": "Marmite: end-user programming for the web\n", "abstract": " A tremendous amount of semi-structured data is available today on the web but is not necessarily in a form which is suitable for a user's tasks. For example, a website may show a listing of local events but a user wants to filter out those which are too far from him. To address this problem, we are developing a tool called Marmite that helps users extract data from web pages and create new applications using a dataflow architecture in a manner similar to Unix pipes. In this paper, we describe formative user studies, some evaluations of low-fidelity prototypes, and a set of design recommendations for this tool.", "num_citations": "37\n", "authors": ["1171"]}
{"title": "Identifying and analyzing the privacy of apps for kids\n", "abstract": " One aspect of privacy that has not been well explored is privacy for children. We present the design and evaluation of a machine learning model for predicting whether a mobile app is designed for children, which is an important step in helping to enforce the Children's Online Privacy Protection Act (COPPA). We evaluated our model on 1,728 apps from Google Play and achieved 95% accuracy. We also applied our model on a set of nearly 1 million free apps from Google Play, and identified almost 68,000 apps for kids. We then conducted a privacy analysis of the usage of third-party libraries for each app, which can help us understand some of the app's privacy-related behaviors. We believe this list can serve as a good start point for further fine-grained privacy analysis on mobile apps for children.", "num_citations": "36\n", "authors": ["1171"]}
{"title": "PrivacyStreams: Enabling Transparency in Personal Data Processing for Mobile Apps\n", "abstract": " Smartphone app developers often access and use privacy-sensitive data to create apps with rich and meaningful interactions. However, it can be challenging for auditors and end-users to know what granularity of data is being used and how, thereby hindering assessment of potential risks. Furthermore, developers lack easy ways of offering transparency to users regarding how personal data is processed, even if their intentions are to make their apps more privacy friendly. To address these challenges, we introduce PrivacyStreams, a functional programming model for accessing and processing personal data as a stream. PrivacyStreams is designed to make it easy for developers to make use of personal data while simultaneously making it easier to analyze how that personal data is processed and what granularity of data is actually used. We present the design and implementation of PrivacyStreams, as well as …", "num_citations": "35\n", "authors": ["1171"]}
{"title": "Recommender systems with personality\n", "abstract": " We believe that in the future, the most common form of recommender systems will be present in a personal assistant. We claim that such an intelligent agent must be personal, ie, know its user's preferences and recommend relevant content, a dynamic learner, instructable, supportive and affable. We describe the current state of the art and the challenges which should be addressed in each of these agent properties and provide examples of how we expect future personal agents to convey these properties.", "num_citations": "35\n", "authors": ["1171"]}
{"title": "Sketch it, make it: sketching precise drawings for laser cutting\n", "abstract": " Sketch It, Make It (SIMI) is a modeling tool that enables non-experts to design items for fabrication with laser cutters. SIMI recognizes rough, freehand input as a user iteratively edits a structured vector drawing. The tool combines the strengths of sketch-based interaction with the power of constraint-based modeling. Several interaction techniques are combined to present a coherent system that makes it easier to make precise designs for laser cutters.", "num_citations": "35\n", "authors": ["1171"]}
{"title": "Security through a different kind of obscurity: evaluating distortion in graphical authentication schemes\n", "abstract": " While a large body of research on image-based authentication has focused on memorability, comparatively less attention has been paid to the new security challenges these schemes may introduce. Because images can convey more information than text, image-based authentication may be more vulnerable to educated guess attacks than passwords. In this paper, we evaluate the resilience of a recognition-based graphical authentication scheme using distorted images against two types of educated guess attacks through two user studies.", "num_citations": "35\n", "authors": ["1171"]}
{"title": "Smartening the Crowds: Computational Techniques for Improving Human Verification to Fight Phishing Scams\n", "abstract": " Phishing is an ongoing kind of semantic attack that tricks victims into inadvertently sharing sensitive information. In this paper, we explore novel techniques for combating the phishing problem using computational techniques to improve human effort. Using tasks posted to the Amazon Mechanical Turk human effort market, we measure the accuracy of minimally trained humans in identifying potential phish, and consider methods for best taking advantage of individual contributions. Furthermore, we present our experiments using clustering techniques and vote weighting to improve the results of human effort in fighting phishing. We found that these techniques could increase coverage over and were significantly faster than existing blacklists used today.", "num_citations": "34\n", "authors": ["1171"]}
{"title": "Understanding how visual representations of location feeds affect end-user privacy concerns\n", "abstract": " While past work has looked extensively at how to design privacy configuration UIs for sharing current location, there has not yet been work done to examine how visual representations of historical locations can influence end-user privacy. We present results for a study examining three visualization types (text-, map-, and time-based) for social sharing of past locations. Our results reveal that there are important design implications for location sharing applications, as certain visual elements led to more privacy concerns and inaccurate perceptions of privacy control.", "num_citations": "33\n", "authors": ["1171"]}
{"title": "Researchers' Big Data Crisis; Understanding Design and Functionality\n", "abstract": " The Communications Web site, http://cacm.acm.org, features more than a dozen bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish selected posts or excerpts.twitterFollow us on Twitter at http://twitter.com/blogCACMhttp://cacm.acm.org/blogs/blog-cacmMichael Stonebraker issues a call to arms about research groups' data-management problems. Jason Hong discusses the nature of functionality with respect to design.", "num_citations": "31\n", "authors": ["1171"]}
{"title": "Sketch recognizers from the end-user’s, the designer’s, and the programmer’s perspective\n", "abstract": " Although the accuracy and robustness of sketch recognizers have been steadily improving, there are still many issues involved in using them in applications. This paper details our experiences with using sketch recognizers from three different perspectives—end-users, user interface designers, and programmers—and describes some of the open research problems in each of these areas.", "num_citations": "31\n", "authors": ["1171"]}
{"title": "A hierarchical adaptive probabilistic approach for zero hour phish detection\n", "abstract": " Phishing attacks are a significant threat to users of the Internet, causing tremendous economic loss every year. In combating phish, industry relies heavily on manual verification to achieve a low false positive rate, which, however, tends to be slow in responding to the huge volume of unique phishing URLs created by toolkits. Our goal here is to combine the best aspects of human verified blacklists and heuristic-based methods, i.e., the low false positive rate of the former and the broad and fast coverage of the latter. To this end, we present the design and evaluation of a hierarchical blacklist-enhanced phish detection framework. The key insight behind our detection algorithm is to leverage existing human-verified blacklists and apply the shingling technique, a popular near-duplicate detection algorithm used by search engines, to detect phish in a probabilistic fashion with very high accuracy. To achieve an …", "num_citations": "29\n", "authors": ["1171"]}
{"title": "Decentralized is not risk-free: Understanding public perceptions of privacy-utility trade-offs in COVID-19 contact-tracing apps\n", "abstract": " Contact-tracing apps have potential benefits in helping health authorities to act swiftly to halt the spread of COVID-19. However, their effectiveness is heavily dependent on their installation rate, which may be influenced by people's perceptions of the utility of these apps and any potential privacy risks due to the collection and releasing of sensitive user data (e.g., user identity and location). In this paper, we present a survey study that examined people's willingness to install six different contact-tracing apps after informing them of the risks and benefits of each design option (with a U.S.-only sample on Amazon Mechanical Turk, ). The six app designs covered two major design dimensions (centralized vs decentralized, basic contact tracing vs. also providing hotspot information), grounded in our analysis of existing contact-tracing app proposals. Contrary to assumptions of some prior work, we found that the majority of people in our sample preferred to install apps that use a centralized server for contact tracing, as they are more willing to allow a centralized authority to access the identity of app users rather than allowing tech-savvy users to infer the identity of diagnosed users. We also found that the majority of our sample preferred to install apps that share diagnosed users' recent locations in public places to show hotspots of infection. Our results suggest that apps using a centralized architecture with strong security protection to do basic contact tracing and providing users with other useful information such as hotspots of infection in public places may achieve a high adoption rate in the U.S.", "num_citations": "28\n", "authors": ["1171"]}
{"title": "Wish: Towards a wireless shape-aware world using passive rfids\n", "abstract": " This paper presents WiSh, a solution that makes ordinary surfaces shape-aware, relaying their real-time geometry directly to a user's handheld device. WiSh achieves this using inexpensive, light-weight and battery-free RFID tags attached to these surfaces tracked from a compact single-antenna RFID reader. In doing so, WiSh enables several novel applications: shape-aware clothing that can detect a user's posture, interactive shape-aware toys or even shape-aware bridges that report their structural health.", "num_citations": "28\n", "authors": ["1171"]}
{"title": "Improving phishing countermeasures: An analysis of expert interviews\n", "abstract": " In this paper, we present data from 31 semi-structured interviews with anti-phishing experts from academia, law enforcement, and industry. Our analysis led to eight key findings and 18 recommendations to improve phishing countermeasures. Our findings describe the evolving phishing threat, stakeholder incentives to devote resources to anti-phishing efforts, what stakeholders should do to most effectively address the problem, and the role of education and law enforcement.", "num_citations": "28\n", "authors": ["1171"]}
{"title": "Breaking! A Typology of Security and Privacy News and How It's Shared\n", "abstract": " News coverage of security and privacy (S&P) events is pervasive and may affect the salience of S&P threats to the public. To better understand this coverage and its effects, we asked: What types of S&P news come into people's awareness? How do people hear about and share this news? Over two years, we recruited 1999 participants to fill out a survey on emergent S&P news events. We identified four types of S&P news: financial data breaches, corporate personal data breaches, high sensitivity systems breaches, and politicized/activist cybersecurity. These event types strongly correlated with how people shared S&P news-eg, financial data breaches were shared most (42%), while politicized/activist cybersecurity events were shared least (21%). Furthermore, participants' age, gender and security behavioral intention strongly correlated with how they heard about and shared S&P news-eg, males more often felt a …", "num_citations": "27\n", "authors": ["1171"]}
{"title": "Why are they collecting my data? Inferring the purposes of network traffic in mobile Apps\n", "abstract": " Many smartphone apps collect potentially sensitive personal data and send it to cloud servers. However, most mobile users have a poor understanding of why their data is being collected. We present MobiPurpose, a novel technique that can take a network request made by an Android app and then classify the data collection purposes, as one step towards making it possible to explain to non-experts the data disclosure contexts. Our purpose inference works by leveraging two observations: 1) developer naming conventions (e.g., URL paths) of ten offer hints as to data collection purposes, and 2) external knowledge, such as app metadata and information about the domain name, are meaningful cues that can be used to infer the behavior of different traffic requests. MobiPurpose parses each traffic request body into key-value pairs, and infers the data type and data collection purpose of each key-value pair using a …", "num_citations": "26\n", "authors": ["1171"]}
{"title": "WebTicket: Account management using printable tokens\n", "abstract": " Passwords are the most common authentication scheme today. However, it is difficult for people to memorize strong passwords, such as random sequences of characters. Additionally, passwords do not provide protection against phishing attacks. This paper introduces WebTicket, a low cost, easy-to-use and reliable web account management system that uses\" tickets\", which are tokens that contain a two-dimensional barcode that can be printed or stored on smartphones. Users can log into accounts by presenting the barcodes to webcams connected to computers. Through two lab studies and one field study consisting of 59 participants in total, we found that WebTicket can provide reliable authentication and phishing resilience.", "num_citations": "26\n", "authors": ["1171"]}
{"title": "Understanding and capturing people's privacy policies in a people finder application\n", "abstract": " Over the past few years, a number of mobile applications have emerged that allow users to locate one another. Some of these applications are driven by a desire from enterprises to increase the productivity of their employees. Others are geared towards supporting social networking scenarios or security-oriented scenarios. The growing number of cell phones sold with location tracking technologies such as GPS or A-GPS along with the emergence of WiFi-based location tracking solutions could lead to mainstream adoption of some of these applications. At the same time, however, a number of people have expressed concerns about the privacy implications associated with this class of software, suggesting that broad adoption may only happen to the extent that these concerns are adequately addressed. In this article, we report on work conducted at Carnegie Mellon University in the context of PEOPLEFINDER, an application that enables cell phone and laptop users to selectively share their locations with others (eg friends, family, and colleagues). The objective of our work has been to better understand people’s attitudes and behaviors towards privacy as they interact with such an application, and to explore technologies that empower users to more effectively and efficiently specify their privacy preferences (or “policies”).", "num_citations": "26\n", "authors": ["1171"]}
{"title": "Methods, apparatus, and program products for abstract applications/components in a ubiquitous computing environment\n", "abstract": " Methods, apparatus and program products for using historical contextual data in a ubiquitous computing environment. The historical contextual data can be dispersed among components in an environment or logging services as well as stored on a particular component or logging service. The historical contextual data can be used to help create or re-create component configurations within the relevant environment through the use of abstract applications and abstract components. Abstract applications can be specified to create connections with specific components. Abstract applications can also be generalized so that they need not create connections with specific components, but can create component connections that perform a desired function by determining which components to use from the available components, and how to connect the selected components to perform the function.", "num_citations": "25\n", "authors": ["1171"]}
{"title": "Evolving the ecosystem of personal behavioral data\n", "abstract": " Everyday, people generate lots of personal data. Driven by the increasing use of online services and widespread adoption of smartphones (owned by 68% of U.S. residents; Anderson, 2015), personal data take many forms, including communications (e.g., e-mail, SMS, Facebook), plans and coordination (e.g., calendars, TripIt, to-do lists), entertainment consumption (e.g., YouTube, Spotify, Netflix), finances (e.g., banking, Amazon, eBay), activities (e.g., steps, runs, check-ins), and even health care (e.g., doctor visits, medications, heart rate). Collectively, these data provide a highly detailed description of an individual. Personal data afford the opportunity for many new kinds of applications that might improve people’s lives through deep personalization, tools to manage personal well-being, and services that support identity construction. However, developers currently encounter challenges working with personal data …", "num_citations": "24\n", "authors": ["1171"]}
{"title": "Thumprint: Socially-inclusive local group authentication through shared secret knocks\n", "abstract": " Small, local groups who share protected resources (eg, families, work teams, student organizations) have unmet authentication needs. For these groups, existing authentication strategies either create unnecessary social divisions (eg, biometrics), do not identify individuals (eg, shared passwords), do not equitably distribute security responsibility (eg, individual passwords), or make it difficult to share or revoke access (eg, physical keys). To explore an alternative, we designed Thumprint: inclusive group authentication with a shared secret knock. All group members share one secret knock, but individual expressions of the secret are discernible. We evaluated the usability and security of our concept through two user studies with 30 participants. Our results suggest that (1) individuals who enter the same shared thumprint are distinguishable from one another,(2) that people can enter thumprints consistently over time …", "num_citations": "24\n", "authors": ["1171"]}
{"title": "A self-report measure of end-user security attitudes (SA-6)\n", "abstract": " We present SA-6, a six-item scale for assessing people’s security attitudes that we developed by following standardized processes for scale development. We identify six scale items based on theoretical and empirical research with sufficient response variance, reliability, and validity in a combined sample (N= 478) from Amazon Mechanical Turk and a university-based study pool. We validate the resulting measure with a US Census-tailored Qualtrics panel (N= 209). SA-6 significantly associates with self-report measures of behavior intention and recent secure behaviors. Our work contributes a lightweight method for (1) quantifying and comparing people’s attitudes toward using recommended security tools and practices, and (2) improving predictive modeling of who will adopt security behaviors.", "num_citations": "23\n", "authors": ["1171"]}
{"title": "Styx: Privacy risk communication for the Android smartphone platform based on apps' data-access behavior patterns\n", "abstract": " Modern smartphone platforms offer a multitude of useful features to their users but at the same time they are highly privacy affecting. However, smartphone platforms are not effective in properly communicating privacy risks to their users. Furthermore, common privacy risk communication approaches in smartphone app ecosystems do not consider the actual data-access behavior of individual apps in their risk assessments. Beyond privacy risks such as the leakage of single information (first-order privacy risk), we argue that privacy risk assessments and risk communication should also consider threats to user privacy coming from user-profiling and data-mining capabilities based on the long-term data-access behavior of apps (second-order privacy risk). In this paper, we introduce Styx, a novel privacy risk communication system for Android that provides users with privacy risk information based on the second-order …", "num_citations": "23\n", "authors": ["1171"]}
{"title": "Coconut: An IDE plugin for developing privacy-friendly apps\n", "abstract": " Although app developers are responsible for protecting users' privacy, this task can be very challenging. In this paper, we present Coconut, an Android Studio plugin that helps developers handle privacy requirements by engaging developers to think about privacy during the development process and providing real-time feedback on potential privacy issues. We start by presenting new findings based on a series of semi-structured interviews with Android developers, probing into the difficulties with privacy that developers face when building apps. Based on these findings, we implemented a proof-of-concept prototype of Coconut and evaluated it in a controlled lab study with 18 Android developers (including eight professional developers). Our study results suggest that apps developed with Coconut handled privacy concerns better, and the developers that used Coconut had a better understanding of their code's …", "num_citations": "22\n", "authors": ["1171"]}
{"title": "Towards scalable evaluation of mobile applications through crowdsourcing and automation\n", "abstract": " With the widespread adoption of smartphones, mobile applications have gained mainstream popularity. However, the potential privacy and security risks associated with using mobile apps are quite high, as smartphones become increasingly integrated with our lives, being able to access our email, social networking accounts, financial information, personal photos, and even our cars and homes. To address this problem, we introduce AppScanner, an automated cloud-based service based on crowdsourcing and traditional security approaches to analyze mobile applications. Considering the large and growing number of mobile applications, our envisioned service builds on crowdsourcing, virtualization, and automation to enable large-scale analysis of apps. AppScanner provides end-users with more understandable information regarding what mobile apps are really doing on their devices. This paper offers an overview of our vision for building AppScanner, as well as work to date in specific components, including automated traversal and monitoring of mobile applications, and interactive visual presentation of app traversal results. Armed with transparent and descriptive information regarding app behavior, users can make better decisions when installing and running apps.", "num_citations": "22\n", "authors": ["1171"]}
{"title": "Towards everyday privacy for ubiquitous computing\n", "abstract": " The goal of everyday privacy is to make it easy for endusers to share information with the right people at the right level of detail in ubiquitous computing environments. In this paper, we describe a conceptual model we have developed for everyday privacy, consisting of control over and feedback about disclosure. We also describe a prototype we have created for helping end-users manage their personal privacy, an evaluation of that prototype, and a revised prototype based on feedback from the evaluation.", "num_citations": "22\n", "authors": ["1171"]}
{"title": "Share and Share Alike: An Exploration of Secure Behaviors in Romantic Relationships\n", "abstract": " Security design choices often fail to take into account users' social context. Our work is among the first to examine security behavior in romantic relationships. We surveyed 195 people on Amazon Mechanical Turk about their relationship status and account sharing behavior for a cross-section of popular websites and apps (eg, Netflix, Amazon Prime). We examine differences in account sharing behavior at different stages in a relationship and for people in different age groups and income levels. We also present a taxonomy of sharing motivations and behaviors based on the iterative coding of open-ended responses. Based on this taxonomy, we present design recommendations to support end users in three relationship stages: when they start sharing access with romantic partners; when they are maintaining that sharing; and when they decide to stop. Our findings contribute to the field of usable privacy and security by enhancing our understanding of security and privacy behaviors and needs in intimate social relationships.", "num_citations": "21\n", "authors": ["1171"]}
{"title": "The privacy landscape of pervasive computing\n", "abstract": " This roadmap for privacy research in ubiquitous and pervasive computing for the next decade highlights some key challenges and opportunities. The work is organized using two different lenses. The first looks at privacy from the perspective of devices, characterizing privacy based on different tiers of devices. The second examines privacy from the perspective of different entities involved with privacy, mapping out an ecosystem for privacy. The author argues that, today, too much of the burden of privacy is on users. To achieve a sustainable ecosystem, we need to develop new ways of shifting this burden to other entities, such as developers, service providers, governments, and third parties. This article is part of a special issue on pervasive computing revisited.", "num_citations": "21\n", "authors": ["1171"]}
{"title": "Understanding user economic behavior in the city using large-scale geotagged and crowdsourced data\n", "abstract": " The pervasiveness of mobile technologies today have facilitated the creation of massive crowdsourced and geotagged data from individual users in real time and at different locations in the city. Such ubiquitous user-generated data allow us to infer various patterns of human behavior, which help us understand the interactions between humans and cities. In this study, we focus on understanding users economic behavior in the city by examining the economic value from crowdsourced and geotaggged data. Specifically, we extract multiple traffic and human mobility features from publicly available data sources using NLP and geo-mapping techniques, and examine the effects of both static and dynamic features on economic outcome of local businesses. Our study is instantiated on a unique dataset of restaurant bookings from OpenTable for 3,187 restaurants in New York City from November 2013 to March 2014. Our …", "num_citations": "21\n", "authors": ["1171"]}
{"title": "Mobile application evaluation using automation and crowdsourcing\n", "abstract": " With the widespread adoption of smartphones, mobile applications have gained mainstream popularity. However, the potential privacy and security risks associated with using mobile apps are quite high, as smartphones become increasingly integrated with our lives, being able to access our email, social networking accounts, financial information, personal photos, and even our cars and homes. To address this problem, we introduce AppScanner, an automated cloud-based service based on crowdsourcing and traditional security approaches to analyze mobile applications. Considering the large and growing number of mobile applications, our envisioned service builds on crowdsourcing, virtualization, and automation to enable large-scale analysis of apps. AppScanner provides end-users with more understandable information regarding what mobile apps are really doing on their devices. Armed with transparent and descriptive information regarding app behavior, users can make better decisions when installing and running apps.", "num_citations": "20\n", "authors": ["1171"]}
{"title": "Relationgram: Tie-strength visualization for user-controlled online identity authentication\n", "abstract": " We consider the specific problem of how users can securely authenticate online identities (e.g., associate a Facebook ID with its owner). Based on prior social science research demonstrating that the social tie strength is a useful indicator of trust in many real-world relationships, we explore how tie strength can be visualized using well-defined and measurable parameters. We then apply the visualization in the context of online friend invitations and propose a protocol for secure online identity authentication. We also present an implementation on a popular online social network (i.e., Facebook). We find that tie strength visualization is a useful primitive for online identity authentication.", "num_citations": "20\n", "authors": ["1171"]}
{"title": "Wii want to write: an accelerometer based gesture recognition system\n", "abstract": " The popular adoption of accelerometers in entertainment and mobile communication devices allows the use of physical gestures as an additional source of input. In particular, the successful adoption of accelerometer technology in the iPhone and the Wiimote (a controller for the Nintendo Wii gaming console) reveals the untapped potential of physical gestures as an intuitive form of user input. As a result, the necessity to accurately recognize acceleration data is becoming increasingly relevant. In this paper, we present a gesture recognition algorithm that recognizes user's gestures based on input signals from a 3-axis Analog Device ADXL330 accelerometer in the Wiimote. We explored the use of Dynamic Time Warping (DTW) as a means to classify accelerometer data. In a study comparing our DTW classifier with the Hidden Markov Model (HMM) and the feature based classifier on recorded gestures, we found that …", "num_citations": "20\n", "authors": ["1171"]}
{"title": "Informal puis: No recognition required\n", "abstract": " The limitations of graphical user interfaces have slowed the spread of computer usage to the entire population. Perceptual user interfaces are one approach that can overcome many of these limitations. Adding perceptual capabilities, such as speech, sketching, and vision, is the key to making interfaces more effective. We argue that informal user interfaces, which do little or no up-front recognition of the perceptual input, have important applications and should not be forgotten by perceptual user interface researchers.", "num_citations": "20\n", "authors": ["1171"]}
{"title": "The use of java as an introductory programming language\n", "abstract": " During the fall of 1996, the Georgia Insitute of Technology initiated the transition from teaching procedural programming to teaching object-oriented programming at the introductory level. Our main goal was to produce an introductory class that taught solid programming and design skills, using Java as the programming language. We will look at some of the problems we encountered, as well as some of the issues involved in using Java to teach students object oriented programming at the introductory level.Our introductory programming curriculum is divided into two consecutive courses. The first class, Introduction to Computing, deals with such fundamental concepts in computing as abstraction, modularity, algorithms, dynamic data structures, and complexity theory. Implementation is done in a formalized pseudocode only, with no compilation at all. The idea behind only using pseudocode is to allow students to …", "num_citations": "20\n", "authors": ["1171"]}
{"title": "What makes people install a COVID-19 contact-tracing app? Understanding the influence of app design and individual difference on contact-tracing app adoption intention\n", "abstract": " Smartphone-based contact-tracing apps are a promising solution to help scale up the conventional contact-tracing process. However, low adoption rates is a major issue that prevents these apps from achieving their full potential. In this paper, we present a national-scale survey experiment (N= 1963) in the US to investigate the effects of app design choices and individual differences on COVID-19 contact-tracing app adoption intentions. We found that individual differences such as prosocialness, COVID-19 risk perceptions, general privacy concerns, technology readiness, and demographic factors played a more important role than app design choices such as decentralized design vs. centralized design, location use, app providers, and the presentation of security risks. Certain app designs could exacerbate the different preferences in different sub-populations which may lead to an inequality of acceptance to certain …", "num_citations": "19\n", "authors": ["1171"]}
{"title": "Detecting camouflaged applications on mobile application markets\n", "abstract": " Application plagiarism or application cloning is an emerging threat in mobile application markets. It reduces profits of original developers and sometimes even harms the security and privacy of users. In this paper, we introduce a new concept, called camouflaged applications, where external features of mobile applications, such as icons, screenshots, application names or descriptions, are copied. We then propose a scalable detection framework, which can find these suspiciously similar camouflaged applications. To accomplish this, we apply text-based retrieval methods and content-based image retrieval methods in our framework. Our framework is implemented and tested with 30,625 Android applications from the official Google Play market. The experiment results show that even the official market is comprised of 477 potential camouflaged victims, which cover 1.56 % of tested samples. Our paper …", "num_citations": "19\n", "authors": ["1171"]}
{"title": "I'm All Eyes and Ears: Exploring Effective Locators for Privacy Awareness in IoT Scenarios\n", "abstract": " With the proliferation of IoT devices, there are growing concerns about being sensed or monitored by these devices unawares, especially in places perceived as private. We explore the design space of IoT locators to help people physically find nearby IoT devices. We first conducted a survey to understand people's willingness, current practices, and challenges in finding IoT devices. Our survey findings motivated us to design and implement low-cost locators (visual, auditory, and contextualized pictures) to help people find nearby devices. Through an iterative design process and two rounds of experiments, we found that these locators greatly reduced people's search time over a baseline of no locators. Many participants found the visual and auditory locators enjoyable. Some participants also appropriated the use of our system for other purposes, eg, to learn about new IoT devices, instead of for privacy awareness.", "num_citations": "18\n", "authors": ["1171"]}
{"title": "Privacyproxy: Leveraging crowdsourcing and in situ traffic analysis to detect and mitigate information leakage\n", "abstract": " Many smartphone apps transmit personally identifiable information (PII), often without the users knowledge. To address this issue, we present PrivacyProxy, a system that monitors outbound network traffic and generates app-specific signatures to represent sensitive data being shared. PrivacyProxy uses a crowd-based approach to detect likely PII in an adaptive and scalable manner by anonymously combining signatures from different users of the same app. Furthermore, we do not observe users network traffic and instead rely on hashed signatures. We present the design and implementation of PrivacyProxy and evaluate it with a lab study, a field deployment, a user survey, and a comparison against prior work. Our field study shows PrivacyProxy can automatically detect PII with an F1 score of 0.885. PrivacyProxy also achieves an F1 score of 0.759 in our controlled experiment for the 500 most popular apps. The F1 score also improves to 0.866 with additional training data for 40 apps that initially had the most false positives. We also show performance overhead of using PrivacyProxy is between 8.6% to 14.2%, slightly more than using a standard unmodified VPN, and most users report no perceptible impact on battery life or the network.", "num_citations": "18\n", "authors": ["1171"]}
{"title": "Passwords getting painful, computing still blissful\n", "abstract": " The Communications Web site, http://cacm.acm.org, features more than a dozen bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish selected posts or excerpts.twitterFollow us on Twitter at http://twitter.com/blogCACMhttp://cacm.acm.org/blogs/blog-cacmJason Hong wonders how anyone can follow the mounting complexity of password rules, and Daniel Reed ponders the attractions of computing.", "num_citations": "18\n", "authors": ["1171"]}
{"title": "ContextMap: modeling scenes of the real world for context-aware computing\n", "abstract": " We present a scenegraph-based schema, the ContextMap, to model context information. Locations with hierarchical relations are the skeleton of the ContextMap where nodes of people, objects and activities can be attached. Context information can be collected by traversing the ContextMap. The ContextMap provides a uniform method to represent physical and social semantics for context-aware computing. In addition, context ambiguity can be modeled as well.", "num_citations": "18\n", "authors": ["1171"]}
{"title": "A typology of perceived triggers for end-user security and privacy behaviors\n", "abstract": " What triggers end-user security and privacy (S&P) behaviors? How do those triggers vary across individuals? When and how do people share their S&P behavior changes? Prior work, in usable security and persuasive design, suggests that answering these questions is critical if we are to design systems that encourage pro-S&P behaviors. Accordingly, we asked 852 online survey respondents about their most recent S&P behaviors (n= 1947), what led up to those behaviors, and if they shared those behaviors. We found that social “triggers”, where people interacted with or observed others, were most common, followed by proactive triggers, where people acted absent of an external stimulus, and lastly by forced triggers, where people were forced to act. People from different age groups, nationalities, and levels of security behavioral intention (SBI) all varied in which triggers were dominant. Most importantly, people with low-to-medium SBI most commonly reported social triggers. Furthermore, participants were four times more likely to share their behavior changes with others when they, themselves, reported a social trigger.", "num_citations": "17\n", "authors": ["1171"]}
{"title": "Using user-generated content to understand cities\n", "abstract": " Understanding urban dynamics is crucial for a number of domains, but it can be expensive and time consuming to gather necessary data. The rapid rise of social media has given us a new and massive source of geotagged data that can be transformative in terms of how we understand our cities. In this position paper, we describe three opportunities in using geotagged social media data: to help city planners, to help small businesses, and to help individuals adapt to their city better. We also sketch some possible research projects to help map out the design space, as well as discuss some limitations and challenges in using this kind of data.", "num_citations": "17\n", "authors": ["1171"]}
{"title": "Styx: Design and evaluation of a new privacy risk communication method for smartphones\n", "abstract": " Modern smartphone platforms are highly privacy-affecting but not effective in properly communicating their privacy impacts to its users. Particularly, actual data-access behavior of apps is not considered in current privacy risk communication approaches. We argue that factors such as frequency of access to sensitive information is significantly affecting the privacy-invasiveness of applications. We introduce Styx, a novel privacy risk communication system that provides the user with more meaningful privacy information based on the actual behavior of apps. In a proof-of-concept study we evaluate the effectiveness of Styx. Our results show that more meaningful privacy warnings can increase user trust into smartphone platforms and also reduce privacy concerns.", "num_citations": "17\n", "authors": ["1171"]}
{"title": "Quiltview: a crowd-sourced video response system\n", "abstract": " Effortless one-touch capture of video is a unique capability of wearable devices such as Google Glass. We use this capability to create a new type of crowd-sourced system in which users receive queries relevant to their current location and opt-in preferences. In response, they can send back live video snippets of their surroundings. A system of result caching, geolocation and query similarity detection shields users from being overwhelmed by a flood of queries.", "num_citations": "17\n", "authors": ["1171"]}
{"title": "The feasibility of a three-dimensional charting interface for general dentistry\n", "abstract": " BackgroundMost current paper- and computer-based formats for patient documentation use a two-dimensional dental chart, a design that originated almost 150 years ago in the United States. No studies have investigated the inclusion of a three-dimensional (3-D) charting interface in a general dental record.MethodsA multidisciplinary research team with expertise in human-computer interaction, dental informatics and computer science conducted a 14-week project to develop and evaluate a proof of concept for a 3-D dental record. Through several iterations of paper- and computer-based prototypes, the project produced a high-fidelity (hi-fi) prototype that was evaluated by two dentists and two dental students.ResultsThe project implemented a prototypical patient record built around a 3-D model of a patient's maxillofacial structures. Novel features include automatic retrieval of images and radiographs; a flexible …", "num_citations": "17\n", "authors": ["1171"]}
{"title": "Context fabric: Infrastructure support for context aware systems\n", "abstract": " Context-aware systems are ones that have a greater awareness of the physical and social worlds we live in. Such systems make use of sensing technologies, recognition algorithms, and wireless networking to enhance human safety, add convenience, improve efficiency, and augment how we find and remember information. However, context-aware systems are currently very difficult to build. Presently, there is little support for building such context-aware systems in a robust and reliable manner. As a result, developers must deal with a wide range of systems issues incidental to the construction of context-aware applications before even simple context-aware applications can be built. These issues include specifying context needs, discovering available sensors that can address these context needs, acquiring data from these sensors, applying fusion algorithms to improve the reliability of sensor data, employing recognition algorithms to transform low-level sensor data into higher-level context data, and routing the context data to the application. Because of the advanced expertise required, very few context-aware applications have been built, and even fewer have been realistically evaluated. In this thesis proposal, I will argue that a set of core infrastructure services coupled with a", "num_citations": "16\n", "authors": ["1171"]}
{"title": "Matters of design\n", "abstract": " http://cacm.acm.org/blogs/blog-cacmThe Communications Web site, http://cacm.acm.org, features more than a dozen bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish selected posts or excerpts.twitterFollow us on Twitter at http://twitter.com/blogCACMJason Hong considers how software companies could effectively incorporate first-rate design into their products.", "num_citations": "15\n", "authors": ["1171"]}
{"title": "Methods, apparatus, and program products for configuring components in networked computing environments\n", "abstract": " Methods, systems, apparatus and program products for gathering contextual history from components in an environment and applying an operation on the gathered history to assist a user in selecting which components to use in the environment.", "num_citations": "15\n", "authors": ["1171"]}
{"title": "What is user-centered design?\n", "abstract": " Creation of conceptual design. During conceptual design, the team members develop a high-level concept of how a new system could support users in doing their jobs. During this phase, team members create “personae,” prototypical users of the proposed system who behave as would real users (for instance,“Dan, periodontist with little computer experience beyond sending e-mail”). The developers create storyboards or paper sketches of the application to support typical tasks that the personae might want to perform. Representative users then evaluate those designs and sketches.", "num_citations": "15\n", "authors": ["1171"]}
{"title": "Our house, in the middle of our tweets\n", "abstract": " Twitter, Flickr, Instagram, and other public social media sites have inspired lots of analysis of public geotagged posts. In order to understand these posts, it is important to know where their authors live. Based on a study of 195 prolific Twitter users in the Pittsburgh area, and their ground truth home locations, we show that simple algorithms can find about 80% of people’s home addresses within 1 kilometer. We show why this is near the upper bound of feasibility, show that studying as few as 10 tweets can achieve almost the same results, and discuss implications for future social media analyses.", "num_citations": "14\n", "authors": ["1171"]}
{"title": "OTO: Online trust oracle for user-centric trust establishment\n", "abstract": " Malware continues to thrive on the Internet. Besides automated mechanisms for detecting malware, we provide users with trust evidence information to enable them to make informed trust decisions. To scope the problem, we study the challenge of assisting users with judging the trustworthiness of software downloaded from the Internet.", "num_citations": "13\n", "authors": ["1171"]}
{"title": "Saying good-bye to DBMSs, designing effective interfaces\n", "abstract": " The Communications Web site, http://cacm.acm.org, features 13 bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish excerpts from selected posts, plus readers' comments.Michael Stonebraker discusses the problems with relational database management systems and possible solutions, and Jason Hong writes about interfaces and usable privacy and security.", "num_citations": "13\n", "authors": ["1171"]}
{"title": "Rfid tattoo: A wireless platform for speech recognition\n", "abstract": " This paper presents an RF-based assistive technology for voice impairments (i.e., dysphonia), which occurs in an estimated 1% of the global population. We specifically focus on acquired voice disorders where users continue to be able to make facial and lip gestures associated with speech. Despite the rich literature on assistive technologies in this space, there remains a gap for a solution that neither requires external infrastructure in the environment, battery-powered sensors on skin or body-worn manual input devices. We present RFTattoo, which to our knowledge is the first wireless speech recognition system for voice impairments using batteryless and flexible RFID tattoos. We design specialized wafer-thin tattoos attached around the user's face and easily hidden by makeup. We build models that process signal variations from these tattoos to a portable RFID reader to recognize various facial gestures …", "num_citations": "12\n", "authors": ["1171"]}
{"title": "MessageOnTap: a suggestive interface to facilitate messaging-related tasks\n", "abstract": " Text messages are sometimes prompts that lead to information related tasks, eg checking one's schedule, creating reminders, or sharing content. We introduce MessageOnTap, a suggestive inter-face for smartphones that uses the text in a conversation to suggest task shortcuts that can streamline likely next actions. When activated, MessageOnTap uses word embeddings to rank relevant external apps, and parameterizes associated task shortcuts using key phrases mentioned in the conversation, such as times, persons, or events. MessageOnTap also tailors the auto-complete dictionary based on text in the conversation, to streamline any text input. We first conducted a month-long study of messaging behaviors (N= 22) that informed our design. We then conducted a lab study to evaluate the effectiveness of MessageOnTap's suggestive interface, and found that participants can complete tasks 3.1 x faster …", "num_citations": "12\n", "authors": ["1171"]}
{"title": "Minimizing security risks in ubicomp systems\n", "abstract": " In the Internet's early days, few people foresaw the emergence of spam, phishing schemes, and malware such as viruses, worms, Trojan horses, spyware, and key loggers that plague users today. It's safe to assume that ubicomp technologies will suffer from the same sorts of unforeseen vulnerabilities that have plagued the Internet. We can't account for every possible security and privacy risk in ubiquitous computing systems. We can, however, design such systems to reduce the burden on users as well as develop better security models and interaction techniques to prevent and minimize foreseeable threats.", "num_citations": "12\n", "authors": ["1171"]}
{"title": "Challenges and opportunities in data mining contact lists for inferring relationships\n", "abstract": " The smartphone contact list has the potential to be a valuable source of data about personal relationships. To understand how we might data mine the information that people store in their contact lists, we collected the contact lists of 54 participants. Initially we found that the majority of contact list features were unused. However, a further examination of the\" name\" field revealed a broad variety of contact-naming behaviors. We observed contact\" name\" fields that included affiliations, relationship role labels, multiple names, phone types, and references to companies/services/places. People's appropriation and usage of contact lists have implications for automated attempts to merge or mine contact lists that assume people use the features and structure of the contact list tool as intended. They also offer new opportunities for data mining to better describe relationships between users and their contacts.", "num_citations": "11\n", "authors": ["1171"]}
{"title": "Assessing call and SMS logs as an indication of tie strength\n", "abstract": " How effective are call and SMS logs in modeling tie strength? Frequency and duration of communication has long been cited as a major aspect of tie strength. Intuitively, this makes sense: people communicate with those that they feel close to. Many highly cited research papers have pushed this idea further, using communication as a direct proxy for tie strength. However, this operationalization has not been validated. Our work evaluates this assumption. We collected call and SMS logs and ground truth relationship data from 40 participants. Consistent with theory, we found that frequent or long-duration communication likely indicates a strong tie. However, little or no communication does not necessarily indicate a weak tie. Follow-up interviews revealed several explanations and indicate fundamental challenges for inferring tie strength from communication logs.", "num_citations": "11\n", "authors": ["1171"]}
{"title": "Wearable Computing from Jewels to Joules [Guest editors' introduction]\n", "abstract": " Wearables have been with us for a long time, and they're here to stay. Their capabilities and our expectations change with time, but many of the basic problems remain. This issue touches on designing for unpredictable human behavior, positioning sensors, powering wearables without removing the device from the body, and providing text input on very small displays.", "num_citations": "10\n", "authors": ["1171"]}
{"title": "Check-ins in “Blau Space” Applying Blau’s Macrosociological Theory to Foursquare Check-ins from New York City\n", "abstract": " Peter Blau was one of the first to define a latent social space and utilize it to provide concrete hypotheses. Blau defines social structure via social “parameters” (constraints). Actors that are closer together (more homogenous) in this social parameter space are more likely to interact. One of Blau’s most important hypotheses resulting from this work was that the consolidation of parameters could lead to isolated social groups. For example, the consolidation of race and income might lead to segregation. In the present work, we use Foursquare data from New York City to explore evidence of homogeneity along certain social parameters and consolidation that breeds social isolation in communities of locations checked in to by similar users. More specifically, we first test the extent to which communities detected via Latent Dirichlet Allocation are homogenous across a set of four social constraints—racial homophily, income …", "num_citations": "10\n", "authors": ["1171"]}
{"title": "Protecting against data breaches; living with mistakes\n", "abstract": " The Communications Web site, http://cacm.acm.org, features more than a dozen bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish selected posts or excerpts.twitterFollow us on Twitter at http://twitter.com/blogCACMhttp://cacm.acm.org/blogs/blog-cacmJason Hong writes about security breaches and offers a three-pronged approach. Greg Linden discusses the differences between computers and the human brain and their tolerance of errors.", "num_citations": "10\n", "authors": ["1171"]}
{"title": "3D printing, smart cities, robots, and more\n", "abstract": " This installment of Notes from the Community covers a wide range of topics, including new gadgets that help you track down lost items, 3D printing, the downside of smart cities, and soldiers growing attached to their robots.", "num_citations": "9\n", "authors": ["1171"]}
{"title": "An overview of latent semantic indexing\n", "abstract": " We give an overview of an information retrieval technique known as Latent Semantic Indexing, including the problems it was designed to overcome, how it works, some current drawbacks of this approach, and continuing research into this technique.", "num_citations": "9\n", "authors": ["1171"]}
{"title": "Wearable computing\n", "abstract": " To give you a preview of IEEE Pervasive Computing's October-December special issue on wearable computing, this installment of Notes from the Community focuses on submissions about wearables. The topics range from the origins of wearable computing to unusual examples of wearables, and from emerging uses to wearables in popular culture.", "num_citations": "8\n", "authors": ["1171"]}
{"title": "Investigating collaborative mobile search behaviors\n", "abstract": " People use mobile devices to search, locate and discover local information around them. Mobile local search is frequently a social activity. This paper presents the results of a survey and an exploratory user study of collaborative mobile local search. The survey results show that people frequently search with others and that these searches often involve the use of more than one mobile device. We prototyped a collaborative mobile search app, which we used as a tool to investigate users' collaborative mobile search behavior. Our study results provide insights into how users collaborate while performing search. We also provide design considerations to inform future mobile local search technologies.", "num_citations": "8\n", "authors": ["1171"]}
{"title": "Why is Great Design so Hard?\n", "abstract": " In one of the talks, a designer at Microsoft mentioned two data points I've informally heard before but had never confirmed. First, the ratio of developers to user interface designers at Microsoft was 50: 1. Second, this ratio was better than any other company out there.", "num_citations": "8\n", "authors": ["1171"]}
{"title": "Computational Support for Sketching in Design\n", "abstract": " Computational support for sketching has a long and interesting history dating back to the early days of computing. Computational Support for Sketching in Design: A Review takes a brief look at the origins and history of the subject before going on to survey the literature from a wide variety of sources on modern sketch based design tools. It first describes the practical basis of sketching - why people sketch, what significance it has in design and problem solving, and the cognitive activities it supports. It goes on to survey computational support for sketching, including methods for performing sketch recognition and managing ambiguity, techniques for modeling recognizable elements, and human-computer interaction techniques for working with sketches. It concludes by proposing challenges and opportunities for future advances in this field. Computational Support for Sketching in Design: A Review is an ideal reference …", "num_citations": "8\n", "authors": ["1171"]}
{"title": "Modeling content from human-verified blacklists for accurate zero-hour phish detection\n", "abstract": " Phishing attacks are a significant security threat to users of the Internet, causing tremendous economic loss every year. Past work in academia has not been adopted by industry in part due to concerns about liability over false positives. However, blacklist-based methods heavily used in industry are slow in responding to new phish attacks, and tend to be easily overwhelmed by phishing techniques such as fast-flux and the proliferation of toolkits. In this paper, we present the design and evaluation of two blacklist-enhanced content-based algorithms. The key insight behind our algorithms is to leverage existing human-verified whitelists and blacklists, and relax them via probabilistic methods to attain high true positive rates while maintaining extremely low false positive rates. Comprehensive experiments over a diverse spectrum of data sources show that our approach currently achieves a false positive rate of 0.0434 with a true positive rate of 87.42. Our algorithms are able to adapt quickly to new phishing attacks by incremental retraining, and present a new framework that will generalize to evolving attacks.Descriptors:", "num_citations": "8\n", "authors": ["1171"]}
{"title": "Whisper: analysis and design for a community event service\n", "abstract": " We present an analysis of what we call the community event space, looking at how social events are planned and organized. Based on a series of interviews, field studies, and a focus group, we introduce a framework outlining six phases of events: proposition, polling, participation, parting, perpetuation, and persuasion. We also present the design of Whisper, a web-based event service that addresses the planning and organizational challenges identified in this framework. This analysis and design serves as a blueprint for existing and future community event services.", "num_citations": "8\n", "authors": ["1171"]}
{"title": "You're getting warmer! how proximity information affects search behavior in physical spaces\n", "abstract": " This paper describes the results of a Wizard of Oz study of people's search behavior using BuddySystem, a proximity-sensing system designed to help end-users locate people, places, and things. BuddySystem uses distance estimation based on signal strength alone, since direction is difficult to obtain in ad-hoc radio-based systems. Overall findings indicate that the BuddySystem changed people's search behavior to reduce walking area, but may increase search times if the system demands too much of the user's attention, suggesting that reducing distractions and adjusting search strategies could improve search effectiveness of proximity-based tracking systems in physical spaces.", "num_citations": "8\n", "authors": ["1171"]}
{"title": "Panel: voice assistants, UX design and research\n", "abstract": " In this panel, we discuss the challenges that are faced by HCI practitioners and researchers as they study how voice assistants (VA) are used on a daily basis. Voice has become a widespread and commercially viable interaction mechanism with the introduction of VAs such as Amazon's Alexa, Apple's Siri, the Google Assistant, and Microsoft's Cortana. Despite their prevalence, the design of VAs and their embeddedness with other personal technologies and daily routines have yet to be studied in detail. Making use of a roundtable, we will discuss these issues by providing a number of VA use scenarios that panel members will discuss. Some of the issues that researchers will discuss in this panel include:(1) obtaining VA data & privacy concerns around the processing and storage of user data;(2) the personalization of VAs and the user value derived from this interaction; and (3) the relevant UX work that reflects on …", "num_citations": "7\n", "authors": ["1171"]}
{"title": "Privacy and Client-based Discovery Location\n", "abstract": " Wireless network hotspots, such as 802.11 b WiFi access points, can be used as beacons that provide an inexpensive, large-scale, and privacy-sensitive way of determining one’s current location. This approach, however, requires creating and storing databases of a large number of access point locations, which raises ethical and legal questions over the privacy of the network. In this paper, we analyze the privacy risks for end-users in such a system. We also propose a set of algorithms for storing location information in a highly private but usable manner using encryption and Bloom filters. We show how individual access point information is kept private, but can still be used by mobile devices as an inexpensive geographical aid.", "num_citations": "7\n", "authors": ["1171"]}
{"title": "Speakeasy: A Platform for Interactive Public Displays\n", "abstract": " This is our vision: display and interact with any media type on any kind of device that you want to turn into an electronic public display. We desire to support all media types and devices that exist today as well as those that will exist tomorrow. To explore this vision, we developed two electronic public displays using Speakeasy, a foundational platform that supports ad hoc communication between devices and services with little or no a priori knowledge of one another. We discuss the design, implementation, and our experiences with these two electronic public displays.", "num_citations": "7\n", "authors": ["1171"]}
{"title": "Integrating Context Services Through Automatic Path Creation\n", "abstract": " We believe that a middleware service infrastructure can greatly simplify the tasks of creating context-aware applications and maintaining the suite of sensors that supports these applications. By providing a uniform layer of abstraction and a common programming model, such an infrastructure would provide support for context-aware applications in a platform neutral manner. Furthermore, such an infrastructure would be “always on,” allowing sensors and devices to be deployed incrementally without having to update every application or having to restart the entire system. The particulars of this infrastructure approach are detailed elsewhere [REF].One of the key services in this infrastructure would be automatic path creation, a way of flexibly composing existing services to create new functionality. Automatic path creation has been previously used for data format and protocol interoperability (for example,[1] and [2]), but our position is that it can also be used to facilitate the creation of context services. As an example, suppose we have three services, one that converts GPS location to ZIP code information (denoted GPS→ ZIP), another that uses ZIP codes to retrieve current weather conditions in that area (ZIP→ Weather), and another that uses ZIP codes to find local movie theaters (ZIP→ Movie Theaters). Individually, each of these services are not very interesting; however, they can be chained together into paths to form more interesting services, such as using GPS to retrieve weather conditions (chaining GPS→ ZIP and ZIP→ Weather together).", "num_citations": "7\n", "authors": ["1171"]}
{"title": "Knock x knock: the design and evaluation of a unified authentication management system\n", "abstract": " We introduce UniAuth, a set of mechanisms for streamlining authentication to devices and web services. With UniAuth, a user first authenticates himself to his UniAuth client, typically his smartphone or wearable device. His client can then authenticate to other services on his behalf. In this paper, we focus on exploring the user experiences with an early iPhone prototype called Knock x Knock. To manage a variety of accounts securely in a usable way, Knock x Knock incorporates features not supported in existing password managers, such as tiered and location-aware lock control, authentication to laptops via knocking, and storing credentials locally while working with laptops seamlessly. In two field studies, 19 participants used Knock x Knock for one to three weeks with their own devices and accounts. Our participants were highly positive about Knock x Knock, demonstrating the desirability of our approach. We also …", "num_citations": "6\n", "authors": ["1171"]}
{"title": "Analyzing use of privacy policy attributes in a location sharing application.\n", "abstract": " Privacy in location sharing applications is particularly important due to the sensitivity of users’ geographical location. Privacy in most location sharing applications is provided through relatively simple functionality where users have to specify which friends they are willing to share their location with. This approach may not be adequate to fully express users’ privacy requirements. In this short article, we present results obtained with a privacy preserving location sharing application, where users are given the option of specifying location disclosure preferences that reflect recurring scenarios, using attributes such as days of the week, times of the day or specific locations. Our results indicate that, while many users tend to start with relatively simple policies similar to those they could specify using today’s applications, over time they seem to increasingly refine these policies and take advantage of time and location restrictions.", "num_citations": "6\n", "authors": ["1171"]}
{"title": "Denim: An informal sketch-based tool for early stage web design\n", "abstract": " DENIM is a system that helps web site designers in the early stages of design. DENIM supports sketching input and gestures for operations like pan, cut, copy, and paste; allows design at different refinement levels—site map, storyboard, and individual page; and unifies the levels through zooming. DENIM uses very little sketch recognition, and when recognition is used, the sketched ink is almost always unchanged. We chose this informal interaction so that designers could concentrate on designing web sites without being distracted by recognition technology.", "num_citations": "6\n", "authors": ["1171"]}
{"title": "How Developers Talk About Personal Data and What It Means for User Privacy: A Case Study of a Developer Forum on Reddit\n", "abstract": " While online developer forums are major resources of knowledge for application developers, their roles in promoting better privacy practices remain underexplored. In this paper, we conducted a qualitative analysis of a sample of 207 threads (4772 unique posts) mentioning different forms of personal data from the /r/androiddev forum on Reddit. We started with bottom-up open coding on the sampled posts to develop a typology of discussions about personal data use and conducted follow-up analyses to understand what types of posts elicited in-depth discussions on privacy issues or mentioned risky data practices. Our results show that Android developers rarely discussed privacy concerns when talking about a specific app design or implementation problem, but often had active discussions around privacy when stimulated by certain external events representing new privacy-enhancing restrictions from the Android …", "num_citations": "5\n", "authors": ["1171"]}
{"title": "Designing Alternative Representations of Confusion Matrices to Support Non-Expert Public Understanding of Algorithm Performance\n", "abstract": " Ensuring effective public understanding of algorithmic decisions that are powered by machine learning techniques has become an urgent task with the increasing deployment of AI systems into our society. In this work, we present a concrete step toward this goal by redesigning confusion matrices for binary classification to support non-experts in understanding the performance of machine learning models. Through interviews (n=7) and a survey (n=102), we mapped out two major sets of challenges lay people have in understanding standard confusion matrices: the general terminologies and the matrix design. We further identified three sub-challenges regarding the matrix design, namely, confusion about the direction of reading the data, layered relations and quantities involved. We then conducted an online experiment with 483 participants to evaluate how effective a series of alternative representations target each …", "num_citations": "5\n", "authors": ["1171"]}
{"title": "Normal and Easy: Account Sharing Practices in the Workplace\n", "abstract": " Work is being digitized across all sectors, and digital account sharing has become common in the workplace. In this paper, we conduct a qualitative and quantitative study of digital account sharing practices in the workplace. Across two surveys, we examine the sharing process at work, probing what accounts people share, how and why they share those accounts, and identifying the major challenges people face in sharing accounts. Our results demonstrate that account sharing in the modern workplace serves as a norm rather than a simple workaround; centralizing collaborative activity and reducing boundary management effort are key motivations for sharing. But people still struggle with a lack of activity accountability and awareness, conflicts over simultaneous access, difficulties controlling access, and collaborative password use. Our work provides insights into the current difficulties people face in workplace …", "num_citations": "5\n", "authors": ["1171"]}
{"title": "Dissecting developer policy violating apps: characterization and detection\n", "abstract": " To ensure quality and trustworthiness of mobile apps, Google Play store imposes various developer policies. Once an app is reported for exhibiting policy-violating behaviors, it is removed from the store to protect users. Currently, Google Play store relies on mobile users' feedbacks to identify policy violations. Our paper takes the first step towards understanding these policy-violating apps. First, we crawl 302 Android apps, which are reported in the Reddit forum by mobile users for policy violations and are later removed from the Google Play store. Second, we perform empirical analysis, which reveals that many violating behaviors have not been studied well by industry or research communities. We discover that 53% of the reported apps are either copying popular apps or violating copy-rights or trademarks of brands. Moreover, 49% of reported apps are violating ads policies by sending push notifications, adding …", "num_citations": "5\n", "authors": ["1171"]}
{"title": "Privacy challenges in pervasive computing\n", "abstract": " About 540 million years ago, a vast multitude of species suddenly appeared in the fossil record, along with major diversification of organisms. Paleontologists call this event the “Cambrian explosion.” We are currently witnessing the computing world’s version of the Cambrian explosion. In the past decade, advances in sensing capabilities, screen technologies, solid state storage, and wireless networking have enabled the cheap manufacture of computers in all kinds of form factors.Rather than just large boxes sitting underneath our desks, today’s computers come as smartphones, tablets, glasses, cars, watches, fitness trackers, tables, physical games, and so on. Designers, artists, scientists, and engineers are all looking at new ways of weaving computation, communication, and sensing into our everyday lives.", "num_citations": "5\n", "authors": ["1171"]}
{"title": "Research Issues for Privacy in a Ubiquitously Connected World\n", "abstract": " In just the past decade, we have seen the invention and adoption of wireless networking, smartphones, big data and predictive analytics, wearable computing, autonomous vehicles, sensor networks, social media sites, massive open online courses (MOOCs), and an array of many other wondrous technologies. We are now at a major inflection point, as computation, communication, and sensing are woven into our everyday lives. A very likely scenario is that, in the near future, our computing systems will know everything about us. A fundamental problem, however, is that these same technologies also introduce many new privacy risks, often at a rate faster than legal mechanisms and social norms can adapt. In this position paper, I sketch out several major research challenges for privacy. I present two different scenarios for privacy, probing the confluence of smart devices and inferencing, as well as issues in social media and big data. I also present some ongoing work my team is doing in investigating social influences on privacy, which I use as an example of how more social scientists can be brought on board to study issues of privacy", "num_citations": "5\n", "authors": ["1171"]}
{"title": "Interaction platforms, energy conservation, behavior change research, and more\n", "abstract": " This installment of Notes from the Community covers new developments in interaction toolkits and platforms, security and privacy, smartphones, power consumption and battery life, and ubicomp education. It also includes a vision of ubicomp's past and future and presents works in progress on behavioral change.", "num_citations": "5\n", "authors": ["1171"]}
{"title": "An Anonymous and Privacy-Sensitive Approach to Collecting Sensed Data in Location-Based Applications\n", "abstract": " The emergence of location-based computing promises new and compelling applications, but raises very real privacy risks. Existing approaches to privacy generally treat people as the entity of interest, often using a fidelity tradeoff to manage the costs and benefits of revealing a person’s location. However, these approaches cannot be applied in some applications, as a reduction in precision can render location information useless. This is true of a category of applications that use location data collected from multiple people to infer such information as whether there is a traffic jam on a bridge, whether there are seats available in a nearby coffee shop, when the next bus will arrive, or if a particular conference room is currently empty. We present hitchhiking, a new approach that treats locations as the primary entity of interest. Hitchhiking removes the fidelity tradeoff by preserving the anonymity of reports without reducing the precision of location disclosures. We can therefore support the full functionality of an interesting class of location-based applications without introducing the privacy concerns that would otherwise arise.", "num_citations": "5\n", "authors": ["1171"]}
{"title": "Software-Defined Cooking using a Microwave Oven\n", "abstract": " Despite widespread popularity, today's microwave ovens are limited in their cooking capabilities, given that they heat food blindly, resulting in a non-uniform and unpredictable heating distribution. We present SDC (software-defined cooking), a low-cost closed-loop microwave oven system that aims to heat the food in a software-defined thermal trajectory. SDC achieves this through a novel high-resolution heat sensing and actuation system that uses microwave-safe components to augment existing microwaves. SDC first senses thermal gradient by using arrays of neon lamps that are charged by the Electromagnetic (EM) field a microwave produces. SDC then modifies the EM-field strength to desired levels by accurately moving food on a programmable turntable towards sensed hot and cold spots. To create a more skewed arbitrary thermal pattern, SDC further introduces two types of programmable accessories …", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Automated extraction of personal knowledge from smartphone push notifications\n", "abstract": " Personalized services are in need of a rich and powerful personal knowledge base, i.e. a knowledge base containing information about the user. This paper proposes an approach to extracting personal knowledge from smartphone push notifications, which are used by mobile systems and apps to inform users of a rich range of information. Our solution is based on the insight that most notifications are formatted using templates, while knowledge entities can be usually found within the parameters to the templates. As defining all the notification templates and their semantic rules are impractical due to the huge number of notification templates used by potentially millions of apps, we propose an automated approach for personal knowledge extraction from push notifications. We first discover notification templates through pattern mining, then use machine learning to understand the template semantics. Based on the …", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Generating neighborhood guides from social media\n", "abstract": " What are the neighborhoods in this city like? This is a question that movers and travelers ask all the time, and despite the information sources on the internet, there are few neighborhood guides to help people answer it. We describe formative research, including the Twitter Neighborhood TF-IDF map and an interview-based study of 17 recent movers and travelers. Based on this research, we then describe plans for construction of neighborhood guides based on social media posts in each neighborhood and publicly available data.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Pervasive computing moves in\n", "abstract": " Researchers have studied pervasive computing in many domains, but few are as complex as the home. Decades of early-adopter use of smart home technologies have blazed the path and highlighted numerous research challenges. Today, the long-standing vision of pervasive computing, commonly referred to as the Internet of Things, is finally starting to come to fruition in people's homes. The articles in this special issue showcase the diverse range of research in domestic pervasive computing.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Mindminer: A mixed-initiative interface for interactive distance metric learning\n", "abstract": " We present MindMiner, a mixed-initiative interface for capturing subjective similarity measurements via a combination of new interaction techniques and machine learning algorithms. MindMiner collects qualitative, hard to express similarity measurements from users via active polling with uncertainty and example based visual constraint creation. MindMiner also formulates human prior knowledge into a set of inequalities and learns a quantitative similarity distance metric via convex optimization. In a 12-subject peer-review understanding task, we found MindMiner was easy to learn and use, and could capture users’ implicit knowledge about writing performance and cluster target entities into groups that match subjects’ mental models. We also found that MindMiner’s constraint suggestions and uncertainty polling functions could improve both efficiency and the quality of clustering.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "A comparative study of location-sharing privacy preferences in the US and China\n", "abstract": " While prior studies have provided us with an initial understanding of peoples location-sharing privacy preferences, they have been limited to Western countries and have not investigated the impact of the granularity of location disclosures on peoples privacy preferences. We report findings of a three-week comparative study collecting location traces and location-sharing preferences from two comparable groups in the US and China. Results of the study shed further light on the complexity of peoples location-sharing privacy preferences and key attributes influencing willingness to disclose locations to others and to advertisers. While our findings reveal many similarities between US and Chinese participants, they also show interesting differences, such as differences in willingness to share location at home and at work and differences in the granularity of disclosures people feel comfortable with. We conclude with a discussion of implications for the design of location-sharing applications and location-based advertising.Descriptors:", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Gurungo: coupling personal computers and mobile devices through mobile data types\n", "abstract": " Networked devices like desktop computers and mobile phones make it possible for people to access any of the billions of web pages available on the Internet. However, mobile devices are fundamentally different from desktop PCs in terms of input speeds, screen size, and network speeds, making it harder in practice to find information when on the go. In this paper, we introduce GurunGo, a system that monitors a person's activities on their PC for mobile data types---kinds of data likely to be useful to a person when mobile---and then proactively copies these snippets of data onto his mobile device, thus making it easier to find that information when mobile. Our initial prototype finds and extracts mobile data types from web pages that are browsed on a desktop computer, annotates it with additional relevant information, and copies it to a mobile device in the background. We discuss the design and implementation of …", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Educated guess on graphical authentication schemes: vulnerabilities and countermeasures.\n", "abstract": " This paper investigate security of graphical authentication tokens against educated guess attacks. Results of two user studies indicate that, if we use original photos as authentication tokens, the authentication tokens are vulnerable to educated guess attacks. The results also demonstrate that we can mitigate the vulnerability using distorted pictures.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Method and system for handling data\n", "abstract": " Handling data at one of a plurality of components, wherein the plurality of components includes at least a sink component and a source component. The source component transfers data to the sink component, and the sink component accesses an obtained data type handler object to invoke an interface implemented by the handler object. The invoked type handler interface includes source-specific instructions that are executed by the sink component regardless of whether the data is a format that the sink natively understands.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Memory karaoke: using a location-aware mobile reminiscence tool to support aging in place\n", "abstract": " Episodic memory exercises such as reminiscing and storytelling have been shown to provide therapeutic benefits for older adults by prolonging their ability to lead an independent lifestyle. In this paper, we describe a mobile reminiscence tool called Memory Karaoke, which facilitates episodic memory exercise through contextualized storytelling of meaningful experiences by using contextual cues such as location, time, and photos. We present results from two studies we conducted with Memory Karaoke to explore which contextual cues contribute to best exercising a person's episodic memory. Our findings suggest that while viewing photos do exercise episodic memory to some extent, additional contextual cues (eg location and time) can solicit a greater amount of episodic memory exercise. This suggests that Memory Karaoke's selective capture process and its ability to contextualize memories while users retell …", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Testing PhishGuru in the Real World\n", "abstract": " In real world testing of PhishGuru, an embedded training system that teaches people how to protect themselves from phishing attacks, we found (a) PhishGuru is effective in training people in the real world;(b) users retained knowledge when trained with PhishGuru in the real world;(c) a large percentage of people who clicked on links in simulated emails proceeded to give some form of personal information in the real world;(d) people trained with spear phishing specific training material did not make better decisions in identifying spear phishing emails compared to people trained with generic training material. We also observed that PhishGuru training could be effective in training other people in the organization who did not receive training messages directly from the system.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "A toolkit supporting pen-based interfaces\n", "abstract": " Despite the fact that pens are becoming a common input device for computers, software support for using them is rudimentary at best. The input / output models in existing windowing systems are insufficient, as they have been optimized for the keyboard and mouse, relegating all other modalities as second-class citizens. With respect to input and output for pens, we are at the same stage windowing toolkits were in the early 1980s, with many bits and pieces here and there, but no cohesive frameworks to support the creation of real applications. To facilitate further exploration into alternative input / output models for pens, we have created SATIN, a first-generation toolkit designed to support pen-based interfaces. In this paper, we describe the functionality, architecture, and abstractions in SATIN, as well as some sample applications built on top of it, and conclude with lessons learned.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "Analysis of aocs framework\n", "abstract": " This paper gives an overview of the AOCS framework, an extensible system for controlling satellites. It also presents the results of two evaluations of the software architecture, using the SAAM and ATAM methods.", "num_citations": "4\n", "authors": ["1171"]}
{"title": "'I Can't Even Buy Apples If I Don't Use Mobile Pay?' When Mobile Payments Become Infrastructural in China\n", "abstract": " Despite slow adoption in the US, mobile payments are thede facto solution for hundreds of millions of users in China for everything from paying bills to riding buses, from sending virtual \"Red Packets'' to buying money-market funds. In this paper, we use the theoretical lens of infrastructure to study users' interactions with ubiquitous mobile payment systems in China, focusing on Alipay and WeChat Pay, the two dominant apps on the market. Based on data from a survey (n=466) and follow-up interviews (n=12) with users in China, we describe the diverse usage patterns across physical, social, and digital ubiquity, and a series of challenges people face. Reflecting on the lessons we learned from the Chinese case -- in particular, problems and pitfalls -- we discuss some implications both for design and for policy. Our findings have important implications for other countries that have been moving towards greater …", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Epistenet: Facilitating programmatic access & processing of semantically related mobile personal data\n", "abstract": " Effective use of personal data is a core utility of modern smartphones. On Android, several challenges make developing compelling personal data applications difficult. First, personal data is stored in isolated silos. Thus, relationships between data from different providers are missing, data must be queried by source of origin rather than meaning and the persistence of different types of data differ greatly. Second, interfaces to these data are inconsistent and complex. In turn, developers are forced to interleave SQL with Java boilerplate, resulting in error-prone code that does not generalize. Our solution is Epistenet: a toolkit that (1) unifies the storage and treatment of mobile personal data;(2) preserves relationships between disparate data;(3) allows for expressive queries based on the meaning of data rather than its source of origin (eg, one can query for all communications with John while at the park); and,(4 …", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Testing Computer-Aided Mnemonics and Feedback for Fast Memorization of High-Value Secrets\n", "abstract": " People sometimes require very strong passwords for high-value accounts (eg, master passwords for password managers and encryption keys), but often cannot create these strong passwords. Assigning them provably strong secrets is one solution, and prior work has shown that people can learn these assigned secrets through rote learning, though learning the secrets takes some time and they are quickly forgotten after two weeks of disuse. To improve upon the learning speed and long-term recall of strong, assigned secrets, we introduce, implement and evaluate a set of treatments, inspired by mnemonic devices and real-time feedback tutoring systems, to assist people in learning and remembering their assigned secrets. We encoded strong secrets as a set of six words randomly chosen from a corpus of 676 (∼ 56 bits of entropy). In a randomized between-subjects experiment, our story mnemonic, in which participants wrote two sentences linking their assigned secret words together in a narrative, performed best. Participants who used the story mnemonic required significantly fewer training sessions (7.5 versus 12 sessions) and had higher two-week recall when allowing for minor errors (84% vs. 65%) than the rote control from prior work. Additionally, 92% of those who could not recall their full secrets after two weeks were able to recover their secret once they saw their mnemonic hints with the secret words elided. In contrast, our other treatments did not perform as well–providing few, if any, notable improvements over the rote control. Finally, in an exit survey, a large majority of our participants reported that our treatments were quick, helpful …", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Examining visual-spatial paths for mobile authentication\n", "abstract": " Inspired by people’s strong memory for visual-spatial paths (eg, commuting paths), we present in this paper an introductory exploration of the use of these paths for memorable, strong mobile authentication. In a preliminary study, we evaluated several low-fidelity representations for encoding relatively strong (~ 20 bit) secrets as visual-spatial paths: a 2D birds-eye view, a 3D third-person view, and 3D immersed view. We found that the 3D immersed view worked best for memorability, and used this initial study to inspire the design for a novel mobile authentication application: the Memory Palace. We ran a within-subjects experiment to evaluate our Memory Palace authentication concept against Android’s 9-dot Patternlock along two dimensions: memorability and resilience to shoulder surfing. Results from our experiment suggest people have significantly higher memorability for visual-spatial secrets encoded in the Memory Palace which were also significantly more resilient against shoulder surfing. We conclude with directions for further work: specifically, creating sharable paths for more socially compatible authentication and segmenting secret paths for simple, non-binary access control.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Soulmate or Acquaintance? Visualizing Tie Strength for Trust Inference\n", "abstract": " Prior social science research has shown that tie strength is a useful indicator of context-dependent trust in many real-world relationships. Yet, it is often challenging to gauge trust in online environments. Given a multitude of variables that represent social relationships, we explore how to visualize interpersonal tie strength to empower people to make informed, context-dependent online trust decisions. Our goal is to develop visualizations that are meaningful, expressive, and comprehensible. In this paper, we describe the design of four visualizations. We also report on the results of two user studies, where users commented that our visualizations are highly comprehensive, meaningful, and easy to understand.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "What's New in the Ubicomp Community?\n", "abstract": " Welcome to the inaugural column of Notes from the Community! This column offers a curated summary of interesting news and research in pervasive and mobile computing, with content drawn from submissions from community members and readers. Visit www.reddit.com/r/pervasivecomputing to join the discussion.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Building a dynamic and computational understanding of personal social networks\n", "abstract": " While individuals' personal social networks are extremely important in their day-to-day lives, computational systems lack meaningful representations of them. We argue that recent trends in computer-mediated communication, the ubiquity of smartphones, usage of online services, and new approaches to real-world social science experimentation have created an opportunity to dynamically generate representations of personal social networks that will be useful in a variety of application areas. We describe several preliminary steps we have taken to investigate this vision, which demonstrate that the approach appears to be feasible and seems likely to produce useful results. While there are significant privacy concerns in this space, we outline two approaches for dealing with them. Finally, we close with a discussion of several application areas that might benefit from this new process for generating representations of …", "num_citations": "3\n", "authors": ["1171"]}
{"title": "School of phish: A real-word evaluation of anti-phishing training (Cmu-Cylab-09-002)\n", "abstract": " PhishGuru is an embedded training system that teaches users to avoid falling for phishing attacks by delivering a training message when the user clicks on the URL in a simulated phishing email. In previous lab and real-world experiments, we validated the effectiveness of this approach. Here, we extend our previous work with a 515-participant, real-world study in which we focus on long-term retention and the effect of two training messages. We also investigate demographic factors that influence training and general phishing susceptibility. Results of this study show that (1) users trained with PhishGuru retain knowledge even after 28 days; (2) adding a second training message to reinforce the original training decreases the likelihood of people giving information to phishing websites; and (3) training does not decrease users’ willingness to click on links in legitimate messages. We found no significant difference between males and females in the tendency to fall for phishing emails both before and after the training. We found that participants in the 18-25 age group were consistently more vulnerable to phishing attacks on all days of the study than older participants. Finally, our exit survey results indicate that most participants enjoyed receiving training during their normal use of email.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Patterns in Mashups\n", "abstract": " This paper describes preliminary work in the uncovering of mashup patterns in order to find new directions for the design of mashup tools. We conducted a qualitative survey of high-quality mashups, as nominated in two popular mashup directories, and examined how the mashups made use of existing websites or improved upon them, how data from multiple websites were combined, and what kinds of user tasks these mashups might be suitable for. We describe a set of patterns what we found in our sample of mashups.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Design and evaluation of 3d models for electronic dental records\n", "abstract": " We present the results of a field study of some of the work practices and software used by dentists. We also present the design, implementation, and evaluation of a user interface that streamlines some of these practices, as well as providing a novel 3D visualization of a patient's mouth that also displays relevant radiographs depending on what teeth are visible in the visualization. Dentists found the 3D synchronized navigation intuitive, even with little to no 3D navigation experience, but further research is needed to see the effect on real clinical outcomes.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Method and system for unifying component metadata\n", "abstract": " A method and system for unifying component metadata includes components, such as computers, laptops or flat panel display devices and software entities, connected together by one or more networks. A method includes a first component, such as a laptop device, obtaining intrinsic metadata associated with one or more other components, such as a computer and a flat panel display device. The first component combines intrinsic metadata received from each component with extrinsic metadata of the first component, and provides the combined metadata to the other components, although the first component may also utilize the combined metadata. The components are able to obtain a consistent, unified view of the combined metadata without needing any prior programming and without requiring the use of centralized servers.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Potential Effects of Ubiquitous Computing on Civic Engagement\n", "abstract": " In this workshop position paper, we examine some negative as well as some positive trends in ubicomp with respect to civic engagement. We also describe some critical questions for stimulating the direction of research in this area.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Towards a Unified Interaction Framework for Ubicomp User Interfaces\n", "abstract": " The remarkable success of the personal computing era is largely attributable to the WIMP desktop interaction framework. We identify a set of core design techniques embodied by the WIMP desktop, specifically aggregators, objects, commands, and selectors, and discuss their applicability to the design space of ubiquitous computing user interfaces. We offer some potential research directions for exploring this approach and present a set of open research questions.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Printertainment: printing with interactive cover sheets\n", "abstract": " We explored a new type of user interface, interactive cover sheets: computer forms laid out on the banner pages of print jobs that people can mark on, scan back into a multifunction printer/scanner, and use as input to applications. Cover sheets are commonly strewn around printer rooms; with interactivity, they can let people see what others have to say, add their own comments, or play games, all while waiting for their print jobs. We designed three prototype applications and deployed them briefly in our research lab. We found that interactive cover sheets can be very appealing, that the sheets must be designed so that people can still identify these pages as cover sheets, and that the slow interaction cycle favors asynchronous applications.", "num_citations": "3\n", "authors": ["1171"]}
{"title": "Unified authentication management system\n", "abstract": " A system for automatic authentication of a user to allow access to websites and physical devices which provides tiered levels of security and defines an API protocol for exchange of authentication credentials.", "num_citations": "2\n", "authors": ["1171"]}
{"title": "The memory palace: Exploring visual-spatial paths for strong, memorable, infrequent authentication\n", "abstract": " Many accounts and devices require only infrequent authentication by an individual, and thus authentication secrets should be both secure and memorable without much reinforcement. Inspired by people's strong visual-spatial memory, we introduce a novel system to help address this problem: the Memory Palace. The Memory Palace encodes authentication secrets as paths through a 3D virtual labyrinth navigated in the first-person perspective. We ran two experiments to iteratively design and evaluate the Memory Palace. In the first, we found that visual-spatial secrets are most memorable if navigated in a 3D first-person perspective. In the second, we comparatively evaluated the Memory Palace against Android's 9-dot pattern lock along three dimensions: memorability after one week, resilience to shoulder surfing, and speed. We found that relative to 9-dot, complexity-controlled secrets in the Memory Palace were …", "num_citations": "2\n", "authors": ["1171"]}
{"title": "Using Online Geotagged and Crowdsourced Data to Understand Human Offline Behavior in the City: An Economic Perspective\n", "abstract": " The pervasiveness of mobile technologies today has facilitated the creation of massive online crowdsourced and geotagged data from individual users at different locations in a city. Such ubiquitous user-generated data allow us to study the social and behavioral trajectories of individuals across both digital and physical environments. This information, combined with traditional economic and behavioral indicators in the city (e.g., store purchases, restaurant visits, parking), can help us better understand human behavior and interactions with cities. In this study, we take an economic perspective and focus on understanding human economic behavior in the city by examining the performance of local businesses based on the values learned from crowsourced and geotagged data. Specifically, we extract multiple traffic and human mobility features from publicly available data source geomapping and geo-social-tagging …", "num_citations": "2\n", "authors": ["1171"]}
{"title": "Toward a safe and secure internet of things\n", "abstract": " Jason Hong is an associate professor in the Human Computer Interaction Institute, part of the School of Computer Science at Carnegie Mellon University. He works in the areas of ubiquitous computing and usable privacy and security, and his research has been featured in the New York Times, MIT", "num_citations": "2\n", "authors": ["1171"]}
{"title": "It's Hidden in My Computer\": Exploring Account Management Tools and Behaviors\n", "abstract": " A great deal of past work has investigated passwords in terms of the number of passwords users have, the way people generate passwords, the security of these passwords, and better ways to create passwords that were secure and memorable. However, little work has examined how people manage these passwords in the wild. In this paper, we report results of interviews we conducted with 22 people probing how people manage their passwords and other account information using password management tools, which range from a piece of paper containing one’s passwords to applications specifically designed to manage account information. Through analyses of data, we found that majority of participants were using password management tools as backups and still tried to memorize passwords, and that having sense of control was of great importance for them in using password management tools. Furthermore, we identified features that could be implemented in password management applications to better satisfy users’ needs.", "num_citations": "2\n", "authors": ["1171"]}
{"title": "Computer Security needs refocus, and be nice about it\n", "abstract": " The Communications Web site, http://cacm.acm.org, features more than a dozen bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish selected posts or excerpts.twitterFollow us on Twitter at http://twitter.com/blogCACMhttp://cacm.acm.org/blogs/blog-cacmJason Hong wonders whether computer security is missing the mark, while Judy Robertson supports refusing to tolerate discourtesy.", "num_citations": "2\n", "authors": ["1171"]}
{"title": "Evaluating the use of autobiographical memory for authentication\n", "abstract": " This paper takes a first step in exploring what we call autobiographical authentication, using data about events and activities that are easily captured by smartphones and other devices as the basis for authentication. More specifically, this paper reports on two studies. The first study looked at understanding and categorizing what kinds of everyday memories people could recall, using the results to generate an ontology and understand the relationship between various factors and memorability. The second study investigated the difficulty level in answering different kinds of questions about everyday memories, along with the types of answers that can be expected and the level of confidence that can be ascribed to these answers. We found that there are 9 categories that comprise what users recall about their everyday memories that can be easily “captured” by digital sensors, that meta-knowledge of the response and participant demographics can affect memorability, that users can respond to autobiographical questions about themselves with fairly high confidence, and that users tend to respond to everyday memory questions with events in the past day or so.", "num_citations": "2\n", "authors": ["1171"]}
{"title": "Anonymous and Privacy-Sensitive Collection of Sensed Data in Location-Based Applications\n", "abstract": " Existing approaches to privacy in location-based applications generally treat people as the entity of interest. Anonymity and privacy are then addressed through a fidelity tradeoff, obscuring either a person’s identify or location. But the intentional obfuscation of location can interfere with many potential applications. This position paper discusses hitchhiking, our new that treats locations as the entity of interest. Taking this new perspective allows applications that preserve personal privacy and anonymity while collecting sensed data from people who visit locations of interest.", "num_citations": "2\n", "authors": ["1171"]}
{"title": "An Overview of the Jini Coordination Framework\n", "abstract": " We present an overview of coordination frameworks, a system infrastructure that provides simple, seamless, and scalable interoperability between devices and services. We focus specifically on the Jini coordination framework, describing the motivation behind it, as well as the underlying architecture and protocols used. We also compare and contrast the implementation of Jini to two competing technologies, Universal Plug and Play (UPnP) and Salutation.In addition, we sketch out two problems inherent to such coordination frameworks and describe current research in these areas. The first is system interface interoperability, that is making existing and future services work with one another in a robust, scalable, and flexible manner. The second problem is user interface interoperability, that is providing meaningful user interfaces for these services in a manner that can work across a wide range of devices.", "num_citations": "2\n", "authors": ["1171"]}
{"title": "Discovering and Validating AI Errors With Crowdsourced Failure Reports\n", "abstract": " AI systems can fail to learn important behaviors, leading to real-world issues like safety concerns and biases. Discovering these systematic failures often requires significant developer attention, from hypothesizing potential edge cases to collecting evidence and validating patterns. To scale and streamline this process, we introduce crowdsourced failure reports, end-user descriptions of how or why a model failed, and show how developers can use them to detect AI errors. We also design and implement Deblinder, a visual analytics system for synthesizing failure reports that developers can use to discover and validate systematic failures. In semi-structured interviews and think-aloud studies with 10 AI practitioners, we explore the affordances of the Deblinder system and the applicability of failure reports in real-world settings. Lastly, we show how collecting additional data from the groups identified by developers can …", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Honeysuckle: Annotation-guided code generation of in-app privacy notices\n", "abstract": " In-app privacy notices can help smartphone users make informed privacy decisions. However, they are rarely used in real-world apps, since developers often lack the knowledge, time, and resources to design and implement them well. We present Honeysuckle, a programming tool that helps Android developers build in-app privacy notices using an annotation-based code generation approach facilitated by an IDE plugin, a build system plugin, and a library. We conducted a within-subjects study with 12 Android developers to evaluate Honeysuckle. Each participant was asked to implement privacy notices for two popular open-source apps using the Honeysuckle library as a baseline as well as the annotation-based approach. Our results show that the annotation-based approach helps developers accomplish the task faster with significantly lower cognitive load. Developers preferred the annotation-based approach …", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Providing architectural support for building privacy-sensitive smart home applications\n", "abstract": " In this thesis, we plan to introduce a new IoT app development framework named Peekaboo, which aims to make it much easier for developers to get the granularity of data they actually need rather than always requesting raw data, while also offering architecture support for building privacy features across all the apps. Peekaboo's architectural design philosophy is to factor out repetitive data pre-processing tasks (eg, face detection, frequency spectrum extraction) from the cloud side onto a user-controlled hub, and support them as a fixed set of open source, reusable, and chainable operators. These operators pre-process raw data to remove unneeded sensitive user information before the data flow to the cloud (and out of the users' control), thus reducing data egress and many potential privacy risks for users. Further, all the IoT apps built with Peekaboo share a common structure of the chainable operators, making it …", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Discovering neighborhood clusters and uses therefor\n", "abstract": " Computer-based systems and methods for discovering neighborhood clusters in a geographic region, where the clusters have a mix of venues and are determined based on venue check-in data. The mix of venues for the clusters may be based on the social similarity between pairs of venues; or emblematic of certain neighborhood typologies; or emblematic of temporal check-in pattern types; or combinations thereof. The neighborhood clusters that are so discovered through venue-check in data could be used for many commercial and civic purposes.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "MindMiner: Quantifying Entity Similarity via Interactive Distance Metric Learning\n", "abstract": " We present MindMiner, a mixed-initiative interface for capturing subjective similarity measurements via a combination of new interaction techniques and machine learning algorithms. MindMiner collects qualitative, hard to express similarity measurements from users via active polling with uncertainty and example based visual constraint creation. MindMiner also formulates human prior knowledge into a set of inequalities and learns a quantitative similarity distance metric via convex optimization. In a 12-participant peer-review understanding task, we found MindMiner was easy to learn and use, and could capture users' implicit knowledge about writing performance and cluster target entities into groups that match subjects' mental models.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Social Cybersecurity: Applying Social Psychology to Cybersecurity\n", "abstract": " While there are certainly cases where new theories are needed, we have not yet taken full advantage of existing theories. As one example, our team has recently been taking a strong theory-driven approach in looking at how to apply ideas from social psychology to improve cybersecurity. Past research investigating the human side of cybersecurity has treated people as isolated individuals rather than as social actors acting within a web of social influence. In our research we are (a) investigating how social influence can and does affect cybersecurity, and (b) developing and evaluating novel social influence techniques to improve people’s awareness and knowledge of cybersecurity, as well as motivation to act securely. We use our experiences as a lens for discussing the ongoing role of theory in HCI.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Privacy and Security [Guest editors' introduction]\n", "abstract": " Privacy and security issues might very well be the greatest barrier to creating a ubiquitously connected world. The articles in this special issue show that addressing such concerns will require not only efficient algorithms and secure protocols but also usable interfaces and socially compatible designs. Furthermore, researchers with a strong interdisciplinary interest will need to look for the non-obvious solutions.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Sketch It, Make It: Freehand Drawing for Precise Rapid Fabrication\n", "abstract": " We present Sketch It, Make It (SIMI), a tool for designing precise models for rapid fabrication. SIMI provides a novel recognition and disambiguation architecture that supports designers in using pen-‐based interaction techniques without requiring users to enter persistent modes. The suite of pen-‐based interaction techniques let the designer fluidly transition from rough ideas to precise output within a single tool. These techniques are for creating geometry, issuing gestures that edit the model, and for creating, enforcing, and maintaining geometric constraints. The architecture demonstrated in this system could be applied more broadly in other domains, including 3D modeling or graphic design.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "From GPS Shoes to Instrumented Cities: Food for Thought\n", "abstract": " Welcome to latest installment of Notes from the Community! This column offers a curated summary of interesting news and research in pervasive and mobile computing, with content drawn from submissions from a shared community on the social news site Reddit, available at www.reddit.com/r/pervasivecomputing.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "The preface of the 4th International Workshop on Location-Based Social Networks\n", "abstract": " We briefly introduce the 4 th international workshop on location-based social networks (LBSN 2012), describing its objective, importance, and results.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Guest Editors' Introduction: Connected Youth\n", "abstract": " Today's youth are shaping the frontier of digital media in general, and mobile technology in particular. This special issue features applications with a youth focus, studies of how youth are appropriating pervasive technology, and a glimpse of how our lives will change when \"pervasive\" technology finally lives up to its name.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Software engineering, smartphones and health systems, and security warnings\n", "abstract": " The Communications Web site, http://cacm.acm.org, features more than a dozen bloggers in the BLOG@CACM community. In each issue of Communications, we'll publish excerpts from selected posts.twitterFollow us on Twitter at http://twitter.com/blogCACMGreg Linden writes about frequent software deployments, Ruben Ortega reports on smartphones and health systems research, and Jason Hong discusses designing effective security warnings.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Understanding People’s Place Naming Preferences in Location Sharing (CMU-CyLab-09-010)\n", "abstract": " Many existing location sharing applications provide coordinate-based location estimates and display them on a map. However, people use a rich variety of terms to convey their location to others, such as “home,” “Starbucks,” or even “the bus stop near my apartment.” Our long-term goal is to create a system that can automatically generate useful place names based on real-time context. Towards this end, we present the results of a week-long study with 30 participants to understand people’s preferences for place naming. We propose a hierarchical classification on place naming methods. We further conclude that people’s place naming preferences are complex and dynamic, but fairly predictable using machine learning techniques. Two factors influence the way people name a place: their routines and their willingness to share location information. The new findings provide important implications to location sharing applications and other location based services.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Using Electronic Tools in the Iterative Design of a Context-Aware Tour Guide: A Case Study\n", "abstract": " We report on the iterative design of a context-aware tour guide. We employed an informal prototyping tool, Topiary, to help us in the early stage design of the system. By using this electronic support to rapidly prototype ideas and test the prototypes with end users in the field, we efficiently explored the usability issues of map-based navigation techniques. Based on the tests, which involved five different designs and two design iterations, and an analysis of implementation issues, we built a high fidelity prototype of the tour guide system. We describe our experience with this iterative design process as well as suggestions for the early stage design of context-aware applications.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Whisper: A Client-Centered Approach for a Mobile Community Event Service\n", "abstract": " A common problem people face is finding useful and interesting community events to attend. The goal of Whisper is to create an anywhereanytime location-enhanced service that helps users find interesting events, ranging from large-scale organized events like concerts to small scale ad-hoc events like garage sales and academic talks. The development of Whisper was guided by four design principles, including synthesis of online information, supporting human spontaneity, creating new opportunities for serendipity, and maintaining secrecy of user preferences and activities. Whisper aggregates event information by crawling multiple event web sites, geocodes events with latitude and longitude, and labels as specific event types. The Whisper mobile client is built using a client-centered architectural style, which allows end-users to find events based on one’s interests and current location in an easily deployable …", "num_citations": "1\n", "authors": ["1171"]}
{"title": "a CAPpella: Prototyping Context-Aware Applications by Demonstration\n", "abstract": " In recent years, various projects have developed infrastructures and toolkits to facilitate the development of context-aware applications. These efforts made creating contextaware applications easier for programmers, but not for creative designers and end users, most of which do not program. To help non-programmers, we present, a CAPpella, a tool that allows users to build context-aware applications by demonstration. There are two challenges to this approach:(1) the machine learning technique to deduce the users’ context and (2) the design of the graphical user interface to allow users to assist the training of the computer. This paper describes our design of a user interface using principles that aid in visualization of information. We discuss the results of our paper prototype test that shaped our design decisions and describe the final prototype and future work.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Web design patterns for eCommerce\n", "abstract": " All trends are indicating that eCommerce is growing rapidly and will continue to grow. Forrester Research estimates that in 1999 business-to-consumer (B2C) eCommerce will reach $20 billion and business-to-business (B2B) eCommerce will reach $109 billion. However, as interaction designers and HCI researchers, we all know that usability can have a sharp impact on the user experience, which can directly affect a business' bottom line. A recent report released by Creative Good [1] estimates that $6 billion was lost due to poor web experiences in 1999. A clear example of the importance of usability was when IBM experienced a 400% increase in sales after redesigning their web site with usability in mind [2]. Combined with the fact that there are only around 250 million web users today [3] out of over 6 billion people, ease-of-use is critically important as more and more novices get on the web.Although there is certainly a lot of hype surrounding eCommerce, none of the reports and predictions answer a very simple question: who is going to build all of this in the future? Certainly, there are many HTML authors who can create simple web sites, and there are also many tools out there to help manage web page layout. However, there is a wide conceptual gap between knowledge of HTML and web design. As an analogy, this gap is the same between knowing how to do simple accounting and knowing how to plan, manage, and execute a successful business.", "num_citations": "1\n", "authors": ["1171"]}
{"title": "Can Your Smartphone Reveal If You Are Depressed?\n", "abstract": " Major Depressive Disorder (MDD) is the most common mental health disorder and remains a leading cause of disability and lost productivity with huge costs for society. MDD has high rates of relapse and recurrence, and it has strong correlations with feelings of low social support and disrupted sleep. However, MDD is also commonly misdiagnosed by primary care providers, which leads to delayed treatment and unnecessary suffering. Changes in technology now make it possible to cheaply and effectively monitor social and sleep behaviors, offering the potential of early detection of the onset of MDD. We report on the design of Big Black Dog, a smartphone-based system for gathering data about social and sleep behaviors. We also report on the results of a pilot evaluation to understand the feasibility of gathering and using data from smartphones for inferring the onset of depression.", "num_citations": "1\n", "authors": ["1171"]}