{"title": "Enabling STD-NMR fragment screening using stabilized native GPCR: A case study of adenosine receptor\n", "abstract": " Structural studies of integral membrane proteins have been limited by the intrinsic conformational flexibility and the need to stabilize the proteins in solution. Stabilization by mutagenesis was very successful for structural biology of G protein-coupled receptors (GPCRs). However, it requires heavy protein engineering and may introduce structural deviations. Here we describe the use of specific calixarenes-based detergents for native GPCR stabilization. Wild type, full length human adenosine A 2A receptor was used to exemplify the approach. We could stabilize native, glycosylated, non-aggregated and homogenous A 2A R that maintained its ligand binding capacity. The benefit of the preparation for fragment screening, using the Saturation-Transfer Difference nuclear magnetic resonance (STD-NMR) experiment is reported. The binding of the agonist adenosine and the antagonist caffeine were observed and …", "num_citations": "44\n", "authors": ["806"]}
{"title": "Influence of trehalose on the structure of unilamellar DMPC vesicles\n", "abstract": " The influence of trehalose on the structure and properties of unilamellar (ULVs) and multilamellar (MLVs) dimyristoylphosphatidylcholine (DMPC) vesicles was studied using neutron and X-ray scattering, Raman spectroscopy, and differential scanning calorimetry. Trehalose solutions ranging from 0 to 30% (w/w) have been used. It was found that trehalose increases the main phase transition temperature of the MLVs, but has no influence on the main phase transition temperature of the ULVs. In the liquid crystalline phase, the DMPC membrane thickness decreases by a value of 3.1 Å at 20% trehalose.The intermembrane space increases by a value of about 26 Å at 30% trehalose. Due to the X-ray contrast variation caused by trehalose, it was possible to measure the thickness of the DMPC hydrocarbon chains directly by using X-ray scattering.", "num_citations": "34\n", "authors": ["806"]}
{"title": "Emerging technology of in situ cell free expression protein microarrays\n", "abstract": " Recently, in situ protein microarrays have been developed for large scale analysis and high throughput studies of proteins. In situ protein microarrays produce proteins directly on the solid surface from pre-arrayed DNA or RNA. The advances in in situ protein microarrays are exemplified by the ease of cDNA cloning and cell free protein expression. These technologies can evaluate, validate and monitor protein in a cost effective manner and address the issue of a high quality protein supply to use in the array. Here we review the importance of recently employed methods: PISA (protein in situ array), DAPA (DNA array to protein array), NAPPA (nucleic acid programmable protein array) and TUSTER microarrays and the role of these methods in proteomics.", "num_citations": "23\n", "authors": ["806"]}
{"title": "Requirements variability support through MDA™ and graph transformation\n", "abstract": " One of the most important factors of success in the development of a software product line is the elicitation, management, and representation of variability. Feature models, are used as a key artifact to express requirements variability and are the basis for the domain architecture design. In this context, this article explores the possible advantages of Model Driven Engineering (MDE) and shows an automated transformation from the feature model to the architecture model. This transformation is understood as a graph transformation process because it offers a natural way to represent model transformations. The transformation is applied by the definition of a simple context-sensitive graph grammar where production rules are obtained from metamodels of both feature and architecture models.", "num_citations": "19\n", "authors": ["806"]}
{"title": "Detection of embryonic stem cell lysate biomarkers by surface plasmon resonance with reduced nonspecific adsorption\n", "abstract": " Surface plasmon resonance imaging (SPRi) has emerged as a versatile biosensor to detect a wide range of biomolecular interactions with divergent potential applications. However, the use of this advanced-level technology for stem cell lysate study is still not much explored. Cell lysates are significant biological analytes used for disease diagnostics and proteomic studies, but their complex nature limits their use as an analyte for SPRi biosensors. Here, we review the problems associated with the use of SPRi for stem cell lysate study and examine the role of surface chemistry, running buffer, and blocking solution in order to minimize nonspecific adsorption (NSA). We detect the expression of Oct4, Sox2, Nanog, Rex1, and Lin28 biomarkers present in mouse embryonic stem cell (mESC) lysate against their corresponding antibodies immobilized on the sensor surface with reduced NSA. The current study shows that …", "num_citations": "18\n", "authors": ["806"]}
{"title": "Thermotropic phase behavior of milk sphingomyelin and role of cholesterol in the formation of the liquid ordered phase examined using SR-XRD and DSC\n", "abstract": " Sphingomyelin (SM) and cholesterol are major lipid components of biological membranes involved in the formation of ordered domains. In this study, we investigated the biophysical properties of milk-SM bilayers and determined the effect of cholesterol. The thermotropic phase behaviours of milk-SM and milk-SM/cholesterol mixtures were characterized using differential scanning calorimetry (DSC) and high flux synchrotron radiation X-ray diffraction (SR-XRD). The melting phase transition temperature determined for fully hydrated milk-SM bilayers was Tm = 34.3 ± 0.1 °C. The thermotropic phase behavior of milk-SM is complex, reflecting the mixture of different molecular species. Structural reorganisations successively occurring on heating of fully hydrated milk-SM bilayers were interpreted as follows: i) melting of C16:0-SM, ii) conversion of long and saturated SM species from fully interdigitated (Lβ1) to mixed …", "num_citations": "17\n", "authors": ["806"]}
{"title": "Exploring a method to detect behaviour-preserving evolution using graph transformation\n", "abstract": " Refactorings are commonly integrated into development environments and are extensively used. Finding and understanding refactorings is important to document and to understand a system’s evolution. It will be useful to determine automatically when software evolution has been behaviour-preserving. to verify a redesign process to verify a handmade refactoring to find and characterise stages of a system’s evolution", "num_citations": "16\n", "authors": ["806"]}
{"title": "Early results of off-pump coronary artery bypass graft surgery using bilateral internal thoracic artery grafts in octogenarian patients during ten years\n", "abstract": " Objective: The aim of this study is to review the outcome of OP-CABG using bilateral internal thoracic artery (BITA) grafts in these patients in terms of morbidity and mortality. Patients and method: Retrospective data from consecutive 64 octogenarian patients who underwent this surgery in the period between April 1998 and December 2007 were taken. Demographic data, risk factors, and details of surgical intervention and postoperative complications were analysed. Results: The mean age was 81.8±1.8 years (males=78.1%). Expected mortality calculated by additive EuroSCORE was 7.1±1.9%. The mean of left ventricular ejection fraction was 57.3±12.3%. Unstable angina was the main presenting symptom in 70.3% of patients and 18.7% had recent acute myocardial infarction. Hospital morbidity and mortality rates were 60.9 and 6.2%, respectively. The most frequent complications were: respiratory (25 …", "num_citations": "12\n", "authors": ["806"]}
{"title": "Medical contrast media as possible tools for SAXS contrast variation\n", "abstract": " Small-angle X-ray scattering (SAXS) is increasingly used to extract structural information from a multitude of soft-matter and biological systems in aqueous solution, including polymers, detergents, lipids, colloids, proteins and RNA/DNA. When SAXS data are recorded at multiple contrasts, i.e. at different electron densities of the solvent, the internal electron-density profile of solubilized molecular systems can be probed. However, contrast-variation SAXS has been limited by the range of electron densities available by conventional agents such as sugars, glycerol and salt, and by the fact that many soft-matter and biological systems are modified in their presence. Here we present a pioneering SAXS contrast-variation study on DDM (n-dodecyl-β-d-maltopyranoside) micelles by using two highly electron-rich contrast agents from biomedical imaging which belong to the families of gadolinium-based and iodinated …", "num_citations": "11\n", "authors": ["806"]}
{"title": "Molecular basis for transfer RNA recognition by the double-stranded RNA-binding domain of human dihydrouridine synthase 2\n", "abstract": " Double stranded RNA-binding domain (dsRBD) is a ubiquitous domain specialized in the recognition of double-stranded RNAs (dsRNAs). Present in many proteins and enzymes involved in various functional roles of RNA metabolism, including RNA splicing, editing, and transport, dsRBD generally binds to RNAs that lack complex structures. However, this belief has recently been challenged by the discovery of a dsRBD serving as a major tRNA binding module for human dihydrouridine synthase 2 (hDus2), a flavoenzyme that catalyzes synthesis of dihydrouridine within the complex elbow structure of tRNA. We here unveil the molecular mechanism by which hDus2 dsRBD recognizes a tRNA ligand. By solving the crystal structure of this dsRBD in complex with a dsRNA together with extensive characterizations of its interaction with tRNA using mutagenesis, NMR and SAXS, we establish that while hDus2 …", "num_citations": "9\n", "authors": ["806"]}
{"title": "Overview of the refactoring discovering problem\n", "abstract": " Refactoring support is currently aimed at automatically finding and applying individual transformation steps. Some techniques exist to suggest wider design changes that can be made to a system in order to improve certain design characteristics. Therefore, the sequence of refactorings needed to perform the proposed changes must be found by the developer. Support for complex refactoring sequences generation and execution could help on high level software systems redesigning, allowing the inclusion of very high level refactorings as a regular technique in the software development process. This paper presents which formalisms, techniques and tools we are exploring to address this problem, and shows the conclusions reached so far.", "num_citations": "7\n", "authors": ["806"]}
{"title": "A deep learning model for intra-day forecasting of solar irradiance using satellite-based estimations in the vicinity of a PV power plant\n", "abstract": " This work proposes an intra-day forecasting model, which does not require to be trained or fed with real-time data measurements, for global horizontal irradiance (GHI) at a given location. The proposed model uses a series of time-dependant irradiance estimates near the target location as the main input. These estimates are derived from satellite images and are combined with other secondary inputs in an advanced neural network, which features convolutional and dense layers and is trained using a deep learning approach. For the various input combinations, the performance of the model is validated with a quantitative analysis on the forecast accuracy using different error metrics. Accuracies are compared with a commercial solution for irradiance forecasting made by the European Centre for Medium-Range Weather Forecasts (ECMWF) and publications with similar approaches and forecasting horizons, showing …", "num_citations": "6\n", "authors": ["806"]}
{"title": "Microfluidic based synthesis of nanoparticles for drug delivery\n", "abstract": " Microfluidic based synthesis of nanoparticles for drug delivery × Close The Infona portal uses cookies, ie strings of text saved by a browser on the user's device. The portal can access those files and use them to remember the user's data, such as their chosen settings (screen view, interface language, etc.), or their login data. By using the Infona portal the user accepts automatic saving and using this information for portal operation purposes. More information on the subject can be found in the Privacy Policy and Terms of Service. By closing this window the user confirms that they have read the information on cookie usage, and they accept the privacy policy and the way cookies are used by the portal. You can change the cookie settings in your browser. I accept Polski English Login or register account remember me Password recovery INFONA - science communication portal INFONA Search advanced search Browse …", "num_citations": "6\n", "authors": ["806"]}
{"title": "Computation of refactoring plans from refactoring strategies using htn planning\n", "abstract": " Complex refactoring processes, such as applying big refactorings or removing design smells are difficult to perform in practice. The complexity of these processes is partly due to their heuristic nature and to the constraints imposed by preconditions on the applicability of the individual refactorings. We introduce refactoring strategies as heuristic-based, automation-suitable specifications of a complex refactoring process. They allow us to specify correction strategies and big refactorings more formally than it is done in current catalogues. Refactoring strategies can be instantiated, for each particular case, into refactoring plans. We define refactoring plans as sequences of refactorings that are immediately applicable over the current system source code. We have developed an approach for instantiating refactoring strategies into refactoring plans that uses Hierarchical Task Network (HTN) planning. This paper describes …", "num_citations": "6\n", "authors": ["806"]}
{"title": "Enabling refactoring with HTN planning to improve the design smells correction activity\n", "abstract": " Problems encountered in the software’s structure (code or design), that can be detected statically, that do not produce compile or run-time errors, but negatively affect software quality factors. In fact, this negative effect on quality factors could lead to real compile and run-time errors in the future.", "num_citations": "6\n", "authors": ["806"]}
{"title": "Refactoring planning for design smell correction: Summary, opportunities and lessons learned\n", "abstract": " Complex refactoring processes, such as applying big refactorings or removing design smells are difficult to perform in practice. The complexity of these processes is partly due to their heuristic nature and to the constraints imposed by preconditions on the applicability of the individual refactorings. Developers have to find out manually how to apply a complex refactoring \"recipe\", from a refactoring book, for each particular situation. In a PhD thesis, we developed an approach for tackling this problem. We described how to better write refactoring \"recipes\" (Refactoring Strategies) and how to compute, from them, the precise refactoring sequences for each particular situation (Refactoring Plans). Our proposal introduced, for the first time, the use of automated planning for this kind of software engineering problems. This paper presents a short summary of that PhD thesis and discuss the future work, open questions, new …", "num_citations": "5\n", "authors": ["806"]}
{"title": "Perspectives on automated correction of bad smells\n", "abstract": " Keeping a software system conformant with a desired architecture and consistent with good design principles is a recurring task during the software evolution process. Deviations from good design principles can manifest in the form of bad smells: problems in the system's structure that can negatively affect software quality factors.", "num_citations": "5\n", "authors": ["806"]}
{"title": "Predicting the right spacing between protein immobilization sites on self-assembled monolayers to optimize ligand binding\n", "abstract": " Self-assembled monolayers designed to immobilize capture antibodies are usually prepared using a mixture of functional and inactive linkers. Here, using low molar ratios (1:1 to 1:100) of the two linkers resulted in loss of binding capability of the anti-EGFR (epidermal growth factor receptor) antibody nimotuzumab, as assessed by surface plasmon resonance imaging. We then developed a simple theoretical model to predict the optimal surface density of the functional linker, taking into account the antibody size and linker diameter. A high (1:1000) dilution of the functional linker yielded the best results. As an advantage, this approach does not require chemical modification of the protein.", "num_citations": "3\n", "authors": ["806"]}
{"title": "Application of surface plasmon resonance imaging technique for iPSCs identification\n", "abstract": " Induced pluripotent stem cells (iPSCs) are an attractive cell source for regenerative medicine through cell therapy or drug screening. But application of iPSCs in regenerative medicine requires rapid and accurate characterization of iPSCs. Here, we demonstrate the detection of multiple antigens present in iPSC lysate using rapid, label-free surface plasmon resonance imaging (SPRi) assay. Validation of pluripotency is an important aspect of iPSC research. In this study, we fabricated antibody array against pluripotency biomarkers and found that our array successfully detect corresponding antigens in stem cell lysate. Each antibody recognized its specific antigens presented in iPSC lysates and a certain degree of variability was observed in comparison with other cell lysates. The results suggested that SPRi is a versatile technology feasible for the detection of multiple antigens presented in iPSC lysate …", "num_citations": "3\n", "authors": ["806"]}
{"title": "Evaluación de herramientas de detección y corrección de defectos de diseño\n", "abstract": " Este proyecto consiste en realizar un estudio y evaluación de una serie de herramientas de detección y corrección de defectos de diseño, para lo cual se parte de un estudio previo, ya existente, en el que se detallan cuáles son las características deseables y comunes para una herramienta de este tipo y, por lo tanto, las características evaluables, y en el que ya se ha realizado una evaluación de un pequeño número de herramientas [1]. Tras la evaluación de las herramientas se elabora un sitio web en el que se presentan los resultados, permitiendo a sus autores la modificación de las tablas, bien sea cambiando los resultados expuestos o bien completándolos.", "num_citations": "3\n", "authors": ["806"]}
{"title": "Specifying and analyzing program refactorings with AGG\n", "abstract": " AGG is a general development environment for graph transformation systems which we use here to specify and analyze program refactorings. In this paper, we consider two commonly used refactorings, namely MoveMethod and EncapsulateField, to show our approach.", "num_citations": "3\n", "authors": ["806"]}
{"title": "Integrated method of in situ cell free synthesis of a protein array on gold surface and real time kinetic monitoring by SPR imaging\n", "abstract": " Protein microarrays represent a promising alternative in proteomics and in the biomedical industry. The widespread use of this technology has been limited, largely due to the labor intensive protein production, the quality of proteins expressed in different systems, and the shelf life of these arrays. The novel method Nucleic Acid Programmable Protein Array (NAPPA) overcomes these limitations by synthesizing the proteins in situ. NAPPA entails spotting plasmid DNA encoding the relevant proteins, which are then simultaneously transcribed and translated by a cell free system. NAPPA assays are based on fluorescence detection, which need a protein labeled, often in-situ or by fluorescent tag, and can’t give real time information or kinetics. An attractive alternative to traditional fluorescence-based microarrays detection methods is the technique of surface plasmon resonance imaging (SPRi). SPRi brings a significant advantage in the analysis of biological samples where labeling multiple biomarker with fluorophores or nanoparticles is not practical. A new surface chemistry is developed to carry out an in-situ and cell free synthesis of an SPR compatible protein array. The DNA which encodes the P53-GST-(e-coil) fusion protein is arrayed on the gold sensor surface and through the expression with cell lysate extract the corresponding protein array is obtained. Both the expression process and the posterior characterization are implemented on the flow cell covering the sensor chip. The kinetic interaction of the fusion proteins with the specific antibody anti-P53 was analyzed.", "num_citations": "2\n", "authors": ["806"]}
{"title": "Ley\n", "abstract": " El domingo pasado se llevaron a cabo las elecciones internas en la provincia de Chubut. Participaron en las mismas alremisión investigadora Par-lamentaria, cuya constitu-ción reclamaron. dedor del 20 por ciento del padrón de aﬁliados, siendo proclamada después del escrutinio la única lista que se habla oiicializado. De este modo, Chubut se ha convertido en el sc ‘-gundo distrito que completa su organización legal. X El domingo pióximo: Río Negro ‘", "num_citations": "2\n", "authors": ["806"]}
{"title": "Integrando un modelo de reutilización en la producción de software: entorno distribuido para el desarrollo basado en reutilización.\n", "abstract": " Este trabajo presenta la definición, diseño y puesta en marcha de un entorno distribuido para el desarrollo de software basado en reutilización que permite la integración tanto de herramientas establecidas como de nuevas herramientas. Para ello se ha definido una arquitectura genérica de colaboración entre entidades distribuidas, capaces de trabajar según el modelo de reutilización. Como parte de la arquitectura se ha definido el tipo de entidades (nodos) que pueden participar en la colaboración, un protocolo de comunicación que permite a dichas entidades solicitar servicios e intercambiar objetos pertenecientes al modelo de componente reutilizable, los servicios básicos que pueden ofrecer los nodos y un diseño basado en frameworks que permite la reutilización de mecanismos y servicios a la vez que la independencia de la implementación y la tecnología particular del nodo. El diseño del entorno se ha realizado teniendo en cuenta su escalabilidad y adaptabilidad. Se han definido mecanismos de extensión que permiten la definición de nuevos servicios, la inclusión de nueva funcionalidad en los nodos, la posible ampliación del modelo de componente reutilizable, la coexistencia de repositorios referenciales con repositorios de contención, etc.", "num_citations": "2\n", "authors": ["806"]}
{"title": "The genetics of recurrent hydatidiform moles in Mexico: further evidence of a strong founder effect for one mutation in NLRP7 and its widespread\n", "abstract": " PurposeTo investigate the frequency of a founder mutation in NLRP7, L750V, in independent cohorts of Mexican patients with recurrent hydatidiform moles (RHMs).MethodsMutation analysis was performed by Sanger sequencing on DNA from 44 unrelated Mexican patients with RHMs and seven molar tissues from seven additional unrelated patients.ResultsL750V was present in homozygous or heterozygous state in 37 (86%) patients and was transmitted on the same haplotype to patients from different states of Mexico. We also identified a second founder mutation, c. 2810+ 2T> G in eight (18.1%) patients, and a novel premature stop-codon mutation W653*.ConclusionOur data confirm the strong founder effect for L750V, which appears to be the most common mutation in NLRP7. We also report on six healthy live births to five patients with biallelic NLRP7 mutations, two from spontaneous conceptions and four …", "num_citations": "1\n", "authors": ["806"]}
{"title": "Small-Angle X-Ray Scattering (SAXS) analyses of build-up, relaxation and erosion of casein micelles fouling layer during cross-flow ultrafiltration\n", "abstract": " The aim of this work is to understand the influence of operating conditions (time, transmembrane pressure (TMP), cross-flow velocity (v)) on the casein micelles fouling layer properties (build-up, sol-gel transition and reversibility behaviour during TMP relaxation) during cross-flow filtration. Small-Angle X-Ray Scattering (SAXS) has been coupled to cross-flow ultrafiltration to determine the behaviour of casein micelles concentrated layers at the membrane surface. Concentration profiles have been deduced from the scattering intensities registered in-situ in the course of the cross-flow ultrafiltration of casein micelles dispersions. SAXS and filtration results for a reference experiment (TMP = 110 kPa, v = 0.03 m∙s−1, 2h30 of filtration, 25°C) show the formation of a thick fouling layer of 275 μm and reaching 307 g∙L−1 at the membrane surface, which is above the sol-gel transition of casein micelles (≈180 g∙L−1). Furthermore, results show some reversibility of the outer fraction of fouling layer and irreversibility of its fraction close to the membrane surface. Those results are important for understanding the concentrated layer build-up of casein micelles during cross-flow ultrafiltration but more originally the TMP relaxation behavior of casein micelles fouling layer linked to different operating conditions", "num_citations": "1\n", "authors": ["806"]}
{"title": "The CHA-Q meta-model: A comprehensive, change-centric software representation\n", "abstract": " The Cha-Q Meta-Model: A Comprehensive, Change-Centric Software Representation Page 1 The Cha-Q Meta-Model: A Comprehensive, Change-Centric Software Representation Coen De Roover, Christophe Scholliers, Angela Lozano, Viviane Jonckers Javier Perez, Alessandro Murgia, Serge Demeyer Page 2 ✓ of the different entities of a software system Cha-Q Meta-Model ✓ each change to an entity that results in a new entity state ✓ system snapshots under control of a VCS first interconnected representation of: object-oriented (ie, each concept and relation is represented by a class) memory-efficient tracking of states driven by positive experience with FAMIX, RING/C/H, Cheops driven by poor scalability reported for Hismo and Syde change state & evolution snapshots ➜ to be shared by prototypes for analyzing, repeating, tracing changes Page 3 Cha-Q Meta Model: Overview & Inspiration state & evolution …", "num_citations": "1\n", "authors": ["806"]}
{"title": "Chitosan in Biomedicine. From Gels to Nanoparticles\n", "abstract": " This article presents the preparation of chitosan gels and nanoparticles and illustrates their potential for drug release applications. Interpenetrated polymer networks of chitosan (CHI), polyacrylic acid (PAA) and polyacrylamide were prepared by free radical polymerization. Swelling studies showed that the water uptake of these hydrogels was highly dependent on composition and pH. The hydrogels were loaded with bovine serum albumin. Sustained protein release was observed at pH 6.8 and 7.4. The integrity of the protein released was unaffected. The hydrogels were not cytotoxic. Chitosan nanoparticles were prepared by two routes. In the first one nanoparticles were obtained by the interpolyelectrolyte reaction between chitosan acetate and the sodium salt of PAA and alginic acid. It was found that the appropriate conditions for nanoparticle formation depend on the nature of the reacting polyelectrolytes. The CHI-PAA nanoparticles loaded with 5-fluorouracil released the drug with a pH dependent kinetics. In the second route, the preparation of self-assembled nanoparticles of α-tocopherol modified glycol chitosan and succinyl-chitosan is illustrated. The size of nanoparticles in aqueous solution ranged from 254 to 496 nm. At pH 6 the nanoparticles give sustained release of αtocopherol with almost constant rate during the first 4-7 hours.", "num_citations": "1\n", "authors": ["806"]}
{"title": "SAXS and DSC studies on the structural characteristics of siliconized s-triazine glassy hybrid materials\n", "abstract": " Three hybrid materials composed of planar s-triazine rings and polyhedral silica (SiO2), phenylsilsesquioxane (PhSiO1.5) and diphenylsiloxane (Ph2SiO) building blocks were investigated by differential scanning calorimetry (DSC) and small angle X-ray scattering (SAXS) techniques. These measurements revealed that the geometrically dissimilar components were fully integrated into intact glassy hybrid structures. Their DSC thermograms showed that these hybrids are thermally stable below 350 °C with moderate glass transition temperatures (Tg) of 56–110 °C consistent with the increasing structural connectivity of the silicone component. The SAXS data was analyzed to obtain different structural information using Porod, Guinier and Kratky approximations. The general features of each of the SAXS profiles of these hybrids are very similar to those of polyphenylsilsesquioxane (PPhSQ). The SAXS profiles reveal …", "num_citations": "1\n", "authors": ["806"]}
{"title": "Towards a framework for software design defects correction with refactoring plans\n", "abstract": " Definition Design defects are “bad” solutions to recurring design problems in object-oriented systems. Design defects are problems resulting from bad design practices. They include problems ranging from high-level and design problems, such as antipatterns, to low-level or local problems, such as code smells.(Moha, 2008)", "num_citations": "1\n", "authors": ["806"]}
{"title": "A Refactoring Discovering Tool based on Graph Transformation.\n", "abstract": " One of the problems of documenting software evolution arises with the extensive use of refactorings. Finding and documenting refactorings is usually harder than other changes performed to an evolving system. We introduce a tool prototype, based on graph transformation, to discover refactoring sequences between two versions of a software system. When a refactoring sequence exists, our tool can also help reveal the functional equivalence between the two versions of the system, at least, as far as refactorings can assure behaviour preservation.", "num_citations": "1\n", "authors": ["806"]}
{"title": "First Results in Supporting Automated Elaboration of Refactoring Plans\n", "abstract": " Current approaches to refactoring automation [1] are focused on finding and applying each individual transformation step. When decided which and where a refactoring opportunity exists, development tools are used to automatically apply the refactoring and test its effects. This kind of methodologies are directed to improve certain design characteristics. In some cases deeper redesigning is needed because wider architectural changes are planned. Other refactoring methodologies must be used. Refactorings must be directed to a full system new design proposal. Starting a framework based productline from legacy software systems is a good example of this. A sketch of a desirable system design can be obtained from a wide variety of techniques such as Formal Concept Analysis, metrics [2], or just the proposal of skilled software designers. This work assumes that this sketch of the desirable system design exists and explores how to check if the new design could be derived from the original system using an available set of defined refactorings. A small example is presented to show how the full transformation step sequence could be obtained in case it exists. The transformation sequence is understood as a chain of refactorings that builds up a\" Refactoring Plan\". This work aims to support the automation of this refactoring process which can be overviewed in Figure 1.", "num_citations": "1\n", "authors": ["806"]}