{"title": "Observation of gravitational waves from a binary black hole merger\n", "abstract": " On September 14, 2015 at 09: 50: 45 UTC the two detectors of the Laser Interferometer Gravitational-Wave Observatory simultaneously observed a transient gravitational-wave signal. The signal sweeps upwards in frequency from 35 to 250 Hz with a peak gravitational-wave strain of 1.0├ù 10ΓêÆ 21. It matches the waveform predicted by general relativity for the inspiral and merger of a pair of black holes and the ringdown of the resulting single black hole. The signal was observed with a matched-filter signal-to-noise ratio of 24 and a false alarm rate estimated to be less than 1 event per 203 000 years, equivalent to a significance greater than 5.1 ╧â. The source lies at a luminosity distance of 41 0ΓêÆ 180+ 160 Mpc corresponding to a redshift z= 0.0 9ΓêÆ 0.04+ 0.03. In the source frame, the initial black hole masses are 3 6ΓêÆ 4+ 5 MΓèÖ and 2 9ΓêÆ 4+ 4 MΓèÖ, and the final black hole mass is 6 2ΓêÆ 4+ 4 MΓèÖ, with 3. 0ΓêÆ 0.5+ 0.5 MΓèÖ c 2┬áΓÇª", "num_citations": "10395\n", "authors": ["10"]}
{"title": "GW170817: observation of gravitational waves from a binary neutron star inspiral\n", "abstract": " On August 17, 2017 at 12Γê╢ 41: 04 UTC the Advanced LIGO and Advanced Virgo gravitational-wave detectors made their first observation of a binary neutron star inspiral. The signal, GW170817, was detected with a combined signal-to-noise ratio of 32.4 and a false-alarm-rate estimate of less than one per 8.0├ù 10 4 years. We infer the component masses of the binary to be between 0.86 and 2.26 MΓèÖ, in agreement with masses of known neutron stars. Restricting the component spins to the range inferred in binary neutron stars, we find the component masses to be in the range 1.17ΓÇô1.60 MΓèÖ, with the total mass of the system 2.7 4ΓêÆ 0.01+ 0.04 MΓèÖ. The source was localized within a sky region of 28 deg 2 (90% probability) and had a luminosity distance of 4 0ΓêÆ 14+ 8 Mpc, the closest and most precisely localized gravitational-wave signal yet. The association with the ╬│-ray burst GRB 170817A, detected by Fermi-GBM┬áΓÇª", "num_citations": "5827\n", "authors": ["10"]}
{"title": "GW151226: observation of gravitational waves from a 22-solar-mass binary black hole coalescence\n", "abstract": " We report the observation of a gravitational-wave signal produced by the coalescence of two stellar-mass black holes. The signal, GW151226, was observed by the twin detectors of the Laser Interferometer Gravitational-Wave Observatory (LIGO) on December 26, 2015 at 03: 38: 53 UTC. The signal was initially identified within 70 s by an online matched-filter search targeting binary coalescences. Subsequent off-line analyses recovered GW151226 with a network signal-to-noise ratio of 13 and a significance greater than 5 ╧â. The signal persisted in the LIGO frequency band for approximately 1 s, increasing in frequency and amplitude over about 55 cycles from 35 to 450 Hz, and reached a peak gravitational strain of 3. 4ΓêÆ 0.9+ 0.7├ù 10ΓêÆ 22. The inferred source-frame initial black hole masses are 14.2ΓêÆ 3.7+ 8.3 MΓèÖ and 7. 5ΓêÆ 2.3+ 2.3 MΓèÖ, and the final black hole mass is 20.8ΓêÆ 1.7+ 6.1 MΓèÖ. We find that at least one of┬áΓÇª", "num_citations": "3262\n", "authors": ["10"]}
{"title": "Advanced ligo\n", "abstract": " The Advanced LIGO gravitational wave detectors are second-generation instruments designed and built for the two LIGO observatories in Hanford, WA and Livingston, LA, USA. The two instruments are identical in design, and are specialized versions of a Michelson interferometer with 4 km long arms. As in Initial LIGO, FabryΓÇôPerot cavities are used in the arms to increase the interaction time with a gravitational wave, and power recycling is used to increase the effective laser power. Signal recycling has been added in Advanced LIGO to improve the frequency response. In the most sensitive frequency region around 100 Hz, the design strain sensitivity is a factor of 10 better than Initial LIGO. In addition, the low frequency end of the sensitivity band is moved from 40 Hz down to 10 Hz. All interferometer components have been replaced with improved technologies to achieve this sensitivity gain. Much better seismic┬áΓÇª", "num_citations": "2390\n", "authors": ["10"]}
{"title": "GW170104: observation of a 50-solar-mass binary black hole coalescence at redshift 0.2\n", "abstract": " We describe the observation of GW170104, a gravitational-wave signal produced by the coalescence of a pair of stellar-mass black holes. The signal was measured on January 4, 2017 at 10Γê╢ 11: 58.6 UTC by the twin advanced detectors of the Laser Interferometer Gravitational-Wave Observatory during their second observing run, with a network signal-to-noise ratio of 13 and a false alarm rate less than 1 in 70 000 years. The inferred component black hole masses are 31. 2ΓêÆ 6.0+ 8.4 MΓèÖ and 19. 4ΓêÆ 5.9+ 5.3 MΓèÖ(at the 90% credible level). The black hole spins are best constrained through measurement of the effective inspiral spin parameter, a mass-weighted combination of the spin components perpendicular to the orbital plane, ╧ç eff=ΓêÆ 0.1 2ΓêÆ 0.30+ 0.21. This result implies that spin configurations with both component spins positively aligned with the orbital angular momentum are disfavored. The source┬áΓÇª", "num_citations": "2342\n", "authors": ["10"]}
{"title": "Gravitational waves and gamma-rays from a binary neutron star merger: GW170817 and GRB 170817A\n", "abstract": " On 2017 August 17, the gravitational-wave event GW170817 was observed by the Advanced LIGO and Virgo detectors, and the gamma-ray burst (GRB) GRB∩éá 170817A was observed independently by the Fermi Gamma-ray Burst Monitor, and the Anti-Coincidence Shield for the Spectrometer for the International Gamma-Ray Astrophysics Laboratory. The probability of the near-simultaneous temporal and spatial observation of GRB∩éá 170817A and GW170817 occurring by chance is 5.0 10 8-. We therefore confirm binary neutron star mergers as a progenitor of short GRBs. The association of GW170817 and GRB∩éá 170817A provides new insight into fundamental physics and the origin of short GRBs. We use the observed time delay of 1.74 0.05 s+∩é▒() between GRB∩éá 170817A and GW170817 to:(i) constrain the difference between the speed of gravity and the speed of light to be between 3 10 15--and 7 10 16+-times┬áΓÇª", "num_citations": "1884\n", "authors": ["10"]}
{"title": "GW170814: a three-detector observation of gravitational waves from a binary black hole coalescence\n", "abstract": " On August 14, 2017 at 10Γê╢ 30: 43 UTC, the Advanced Virgo detector and the two Advanced LIGO detectors coherently observed a transient gravitational-wave signal produced by the coalescence of two stellar mass black holes, with a false-alarm rate ofΓë▓ 1 in 27 000 years. The signal was observed with a three-detector network matched-filter signal-to-noise ratio of 18. The inferred masses of the initial black holes are 30. 5ΓêÆ 3.0+ 5.7 MΓèÖ and 25. 3ΓêÆ 4.2+ 2.8 MΓèÖ(at the 90% credible level). The luminosity distance of the source is 54 0ΓêÆ 210+ 130 Mpc, corresponding to a redshift of z= 0.1 1ΓêÆ 0.04+ 0.03. A network of three detectors improves the sky localization of the source, reducing the area of the 90% credible region from 1160 deg 2 using only the two LIGO detectors to 60 deg 2 using all three detectors. For the first time, we can test the nature of gravitational-wave polarizations from the antenna response of the┬áΓÇª", "num_citations": "1827\n", "authors": ["10"]}
{"title": "GWTC-1: a gravitational-wave transient catalog of compact binary mergers observed by LIGO and Virgo during the first and second observing runs\n", "abstract": " We present the results from three gravitational-wave searches for coalescing compact binaries with component masses above 1 MΓèÖ during the first and second observing runs of the advanced gravitational-wave detector network. During the first observing run (O 1), from September 12, 2015 to January 19, 2016, gravitational waves from three binary black hole mergers were detected. The second observing run (O 2), which ran from November 30, 2016 to August 25, 2017, saw the first detection of gravitational waves from a binary neutron star inspiral, in addition to the observation of gravitational waves from a total of seven binary black hole mergers, four of which we report here for the first time: GW170729, GW170809, GW170818, and GW170823. For all significant gravitational-wave events, we provide estimates of the source properties. The detected binary black holes have total masses between 18.6ΓêÆ 0.7+ 3.2 M┬áΓÇª", "num_citations": "1784\n", "authors": ["10"]}
{"title": "Binary black hole mergers in the first advanced LIGO observing run\n", "abstract": " The first observational run of the Advanced LIGO detectors, from September 12, 2015 to January 19, 2016, saw the first detections of gravitational waves from binary black hole mergers. In this paper, we present full results from a search for binary black hole merger signals with total masses up to 100 MΓèÖ and detailed implications from our observations of these systems. Our search, based on general-relativistic models of gravitational-wave signals from binary black hole systems, unambiguously identified two signals, GW150914 and GW151226, with a significance of greater than 5 ╧â over the observing period. It also identified a third possible signal, LVT151012, with substantially lower significance and with an 87% probability of being of astrophysical origin. We provide detailed estimates of the parameters of the observed systems. Both GW150914 and GW151226 provide an unprecedented opportunity to study the┬áΓÇª", "num_citations": "1389\n", "authors": ["10"]}
{"title": "Prospects for observing and localizing gravitational-wave transients with Advanced LIGO, Advanced Virgo and KAGRA\n", "abstract": " We present our current best estimate of the plausible observing scenarios for the Advanced LIGO, Advanced Virgo and KAGRA gravitational-wave detectors over the next several years, with the intention of providing information to facilitate planning for multi-messenger astronomy with gravitational waves. We estimate the sensitivity of the network to transient gravitational-wave signals for the third (O3), fourth (O4) and fifth observing (O5) runs, including the planned upgrades of the Advanced LIGO and Advanced Virgo detectors. We study the capability of the network to determine the sky location of the source for gravitational-wave signals from the inspiral of binary systems of compact objects, that is binary neutron star, neutron starΓÇôblack hole, and binary black hole systems. The ability to localize the sources is given as a sky-area probability, luminosity distance, and comoving volume. The median sky localization area (90% credible┬áΓÇª", "num_citations": "1323\n", "authors": ["10"]}
{"title": "GW170817: Measurements of neutron star radii and equation of state\n", "abstract": " On 17 August 2017, the LIGO and Virgo observatories made the first direct detection of gravitational waves from the coalescence of a neutron star binary system. The detection of this gravitational-wave signal, GW170817, offers a novel opportunity to directly probe the properties of matter at the extreme conditions found in the interior of these stars. The initial, minimal-assumption analysis of the LIGO and Virgo data placed constraints on the tidal effects of the coalescing bodies, which were then translated to constraints on neutron star radii. Here, we expand upon previous analyses by working under the hypothesis that both bodies were neutron stars that are described by the same equation of state and have spins within the range observed in Galactic binary neutron stars. Our analysis employs two methods: the use of equation-of-state-insensitive relations between various macroscopic properties of the neutron stars┬áΓÇª", "num_citations": "1008\n", "authors": ["10"]}
{"title": "GW170608: observation of a 19 solar-mass binary black hole coalescence\n", "abstract": " On 2017 June 8 at 02: 01: 16.49 UTC, a gravitational-wave (GW) signal from the merger of two stellar-mass black holes was observed by the two Advanced Laser Interferometer Gravitational-Wave Observatory detectors with a network signal-to-noise ratio of∩éá 13. This system is the lightest black hole binary so far observed, with component masses of-", "num_citations": "999\n", "authors": ["10"]}
{"title": "A gravitational-wave standard siren measurement of the Hubble constant\n", "abstract": " The detection of GW170817 in both gravitational waves and electromagnetic waves heralds the age of gravitational-wave multi-messenger astronomy. On 17 August 2017 the Advanced LIGO and Virgo detectors observed GW170817, a strong signal from the merger of a binary neutron-star system. Less than 2 seconds after the merger, a gamma-ray burst (GRB 170817A) was detected within a region of the sky consistent with the LIGO-Virgo-derived location of the gravitational-wave source. This sky region was subsequently observed by optical astronomy facilities, resulting in the identification of an optical transient signal within  arcsec of the galaxy NGC 4993. These multi-messenger observations allow us to use GW170817 as a standard siren, the gravitational-wave analog of an astronomical standard candle, to measure the Hubble constant. This quantity, which represents the local expansion rate of the Universe, sets the overall scale of the Universe and is of fundamental importance to cosmology. Our measurement combines the distance to the source inferred purely from the gravitational-wave signal with the recession velocity inferred from measurements of the redshift using electromagnetic data. This approach does not require any form of cosmic \"distance ladder;\" the gravitational wave analysis can be used to estimate the luminosity distance out to cosmological scales directly, without the use of intermediate astronomical distance measurements. We determine the Hubble constant to be  (maximum a posteriori and 68% credible interval). This is consistent with existing measurements, while being completely┬áΓÇª", "num_citations": "830\n", "authors": ["10"]}
{"title": "Properties of the binary black hole merger GW150914\n", "abstract": " On September 14, 2015, the Laser Interferometer Gravitational-Wave Observatory (LIGO) detected a gravitational-wave transient (GW150914); we characterize the properties of the source and its parameters. The data around the time of the event were analyzed coherently across the LIGO network using a suite of accurate waveform models that describe gravitational waves from a compact binary system in general relativity. GW150914 was produced by a nearly equal mass binary black hole of masses 3 6ΓêÆ 4+ 5 MΓèÖ and 2 9ΓêÆ 4+ 4 MΓèÖ; for each parameter we report the median value and the range of the 90% credible interval. The dimensionless spin magnitude of the more massive black hole is bound to be< 0.7 (at 90% probability). The luminosity distance to the source is 41 0ΓêÆ 180+ 160 Mpc, corresponding to a redshift 0.0 9ΓêÆ 0.04+ 0.03 assuming standard cosmology. The source location is constrained to an┬áΓÇª", "num_citations": "760\n", "authors": ["10"]}
{"title": "Exploring the sensitivity of next generation gravitational wave detectors\n", "abstract": " The second-generation of gravitational-wave detectors are just starting operation, and have already yielding their first detections. Research is now concentrated on how to maximize the scientific potential of gravitational-wave astronomy. To support this effort, we present here design targets for a new generation of detectors, which will be capable of observing compact binary sources with high signal-to-noise ratio throughout the Universe.", "num_citations": "684\n", "authors": ["10"]}
{"title": "Astrophysical implications of the binary black hole merger GW150914\n", "abstract": " This site uses cookies. By continuing to use this site you agree to our use of cookies. To find out more, see our Privacy and Cookies policy. Close this notification", "num_citations": "663\n", "authors": ["10"]}
{"title": "GW190425: Observation of a compact binary coalescence with total massΓê╝ 3.4 MΓèÖ\n", "abstract": " The first observation of gravitational waves from the inspiral of a binary neutron star (BNS) 200 system on 2017 August 17 (Abbott et al. 2017b) was a major landmark in multi-messenger astronomy and astrophysics. The gravitational-wave merger was accompanied by a gamma-ray burst (Abbott et al. 2017c; Goldstein et al. 2017; Savchenko et al. 2017); the subsequent world-wide follow-up of the signal by electromagnetic telescopes and satellite observatories identified the host galaxy and observed the kilonova and afterglow emission of the event over a period of hours to months (see, for example, Abbott et al. 2017d and references therein; Villar et al. 2017; Hajela et al. 2019; Troja et al. 2019).", "num_citations": "610\n", "authors": ["10"]}
{"title": "Properties of the binary neutron star merger GW170817\n", "abstract": " On August 17, 2017, the Advanced LIGO and Advanced Virgo gravitational-wave detectors observed a low-mass compact binary inspiral. The initial sky localization of the source of the gravitational-wave signal, GW170817, allowed electromagnetic observatories to identify NGC 4993 as the host galaxy. In this work, we improve initial estimates of the binaryΓÇÖs properties, including component masses, spins, and tidal parameters, using the known source location, improved modeling, and recalibrated Virgo data. We extend the range of gravitational-wave frequencies considered down to 23 Hz, compared to 30 Hz in the initial analysis. We also compare results inferred using several signal models, which are more accurate and incorporate additional physical effects as compared to the initial analysis. We improve the localization of the gravitational-wave source to a 90% credible region of 16 deg 2. We find tighter┬áΓÇª", "num_citations": "582\n", "authors": ["10"]}
{"title": "GW150914: The Advanced LIGO detectors in the era of first discoveries\n", "abstract": " Following a major upgrade, the two advanced detectors of the Laser Interferometer Gravitational-wave Observatory (LIGO) held their first observation run between September 2015 and January 2016. With a strain sensitivity of 10ΓêÆ 23/Hz at 100 Hz, the product of observable volume and measurement time exceeded that of all previous runs within the first 16 days of coincident observation. On September 14, 2015, the Advanced LIGO detectors observed a transient gravitational-wave signal determined to be the coalescence of two black holes [BP Abbott et al., Phys. Rev. Lett. 116, 061102 (2016)], launching the era of gravitational-wave astronomy. The event, GW150914, was observed with a combined signal-to-noise ratio of 24 in coincidence by the two detectors. Here, we present the main features of the detectors that enabled this observation. At full sensitivity, the Advanced LIGO detectors are designed to deliver┬áΓÇª", "num_citations": "536\n", "authors": ["10"]}
{"title": "GW150914: First results from the search for binary black hole coalescence with Advanced LIGO\n", "abstract": " On September 14, 2015, at 09Γê╢ 50: 45 UTC the two detectors of the Laser Interferometer Gravitational-Wave Observatory (LIGO) simultaneously observed the binary black hole merger GW150914. We report the results of a matched-filter search using relativistic models of compact-object binaries that recovered GW150914 as the most significant event during the coincident observations between the two LIGO detectors from September 12 to October 20, 2015 GW150914 was observed with a matched-filter signal-to-noise ratio of 24 and a false alarm rate estimated to be less than 1 event per 203000 years, equivalent to a significance greater than 5.1 ╧â.", "num_citations": "382\n", "authors": ["10"]}
{"title": "Binary black hole population properties inferred from the first and second observing runs of Advanced LIGO and Advanced Virgo\n", "abstract": " The second LIGO/Virgo observing run (O2) spanned 9 months between 2016 November and 2017 August, building on the first, 4-month run (O1) in 2015. The LIGO/Virgo gravitational-wave (GW) interferometer network is composed of two instruments in the United States (LIGO; LIGO Scientific Collaboration et al. 2015; Abbott et al. 2016a) and a third in Europe (Virgo;∩éá Acernese et al. 2015), the latter joining the run in the summer of 2017. In total, 10 binary black hole (BBH) mergers have been detected to date∩éá(Abbott et al. 2018a). The BBHs detected possess a wide range of physical properties. The lightest so far is GW170608∩éá(Abbott et al. 2017a), with an inferred total mass of ╨ô+ 18.7 0.7 3.3∩üÑ M. GW170729∩éá(Abbott et al. 2018a)ΓÇöexceptional in several waysΓÇöis likely to be the heaviest BBH to date, having total mass ╨ô+ 85.2 11.2 15.4∩üÑ M, as well as the most distant, at redshift ╨ô+ 0.48 0.20 0.19. Both GW151226┬áΓÇª", "num_citations": "381\n", "authors": ["10"]}
{"title": "Tests of general relativity with the binary black hole signals from the LIGO-Virgo catalog GWTC-1\n", "abstract": " The detection of gravitational waves by Advanced LIGO and Advanced Virgo provides an opportunity to test general relativity in a regime that is inaccessible to traditional astronomical observations and laboratory tests. We present four tests of the consistency of the data with binary black hole gravitational waveforms predicted by general relativity. One test subtracts the best-fit waveform from the data and checks the consistency of the residual with detector noise. The second test checks the consistency of the low-and high-frequency parts of the observed signals. The third test checks that phenomenological deviations introduced in the waveform model (including in the post-Newtonian coefficients) are consistent with 0. The fourth test constrains modifications to the propagation of gravitational waves due to a modified dispersion relation, including that from a massive graviton. We present results both for individual┬áΓÇª", "num_citations": "336\n", "authors": ["10"]}
{"title": "Characterization of transient noise in Advanced LIGO relevant to gravitational wave signal GW150914\n", "abstract": " A gravitational wave signal, denoted GW150914, has been detected by the Advanced LIGO detectors [1]. The recovered waveform indicated the source was a binary black hole system with component masses ╨ô+ 36 4 5∩üÑ M and ╨ô+ 29 4 4∩üÑ M, which coalesced at a distance of ╨ô+ 410 180 160 Mpc away from Earth. The significance of the GW150914 event was measured to be greater than 5.1 ╧â, corresponding to a false-alarm rate of less than 1 event per 203 000 years [1]. The event, lasting 0.2 s in Advanced LIGO, s sensitive frequency range, was detected in independent searches for modeled compact binary coalescences (CBCs) and for unmodeled gravitational wave bursts [2, 3].The US-based detectors, in Hanford, Washington (H1) and in Livingston, Louisiana (L1) jointly comprise the Laser Interferometer Gravitational-wave Observatory (LIGO). The detectors are designed to measure spacetime strain induced by┬áΓÇª", "num_citations": "312\n", "authors": ["10"]}
{"title": "GW150914: Implications for the stochastic gravitational-wave background from binary black holes\n", "abstract": " The LIGO detection of the gravitational wave transient GW150914, from the inspiral and merger of two black holes with massesΓë│ 30 MΓèÖ, suggests a population of binary black holes with relatively high mass. This observation implies that the stochastic gravitational-wave background from binary black holes, created from the incoherent superposition of all the merging binaries in the Universe, could be higher than previously expected. Using the properties of GW150914, we estimate the energy density of such a background from binary black holes. In the most sensitive part of the Advanced LIGO and Advanced Virgo band for stochastic backgrounds (near 25 Hz), we predict ╬⌐ GW (f= 25 Hz)= 1. 1ΓêÆ 0.9+ 2.7├ù 10ΓêÆ 9 with 90% confidence. This prediction is robustly demonstrated for a variety of formation scenarios with different parameters. The differences between models are small compared to the statistical uncertainty┬áΓÇª", "num_citations": "312\n", "authors": ["10"]}
{"title": "The rate of binary black hole mergers inferred from Advanced LIGO observations surrounding GW150914\n", "abstract": " A transient gravitational-wave signal, GW150914, was identified in the twin Advanced LIGO detectors on 2015 September 2015 at 09: 50: 45 UTC. To assess the implications of this discovery, the detectors remained in operation with unchanged configurations over a period of 39 days around the time of the signal. At the detection statistic threshold corresponding to that observed for GW150914, our search of the 16 days of simultaneous two-detector observational data is estimated to have a false-alarm rate (FAR) of<--4.9 10 yr 6 1, yielding a p-value for GW150914 of<-2 10 7. Parameter estimation follow-up on this trigger identifies its source as a binary black hole (BBH) merger with component masses ()()∩üÑ=-+-+ mm M, 36, 29 1 2", "num_citations": "284\n", "authors": ["10"]}
{"title": "Localization and broadband follow-up of the gravitational-wave transient GW150914\n", "abstract": " A gravitational-wave (GW) transient was identified in data recorded by the Advanced Laser Interferometer Gravitational-wave Observatory (LIGO) detectors on 2015 September 14. The event, initially designated G184098 and later given the name GW150914, is described in detail elsewhere. By prior arrangement, preliminary estimates of the time, significance, and sky location of the event were shared with 63 teams of observers covering radio, optical, near-infrared, X-ray, and gamma-ray wavelengths with ground-and space-based facilities. In this Letter we describe the low-latency analysis of the GW data and present the sky localization of the first observed compact binary merger. We summarize the follow-up observations reported by 25 teams via private Gamma-ray Coordinates Network circulars, giving an overview of the participating facilities, the GW sky localization coverage, the timeline, and depth of the┬áΓÇª", "num_citations": "256\n", "authors": ["10"]}
{"title": "Upper limits on the stochastic gravitational-wave background from Advanced LIGOΓÇÖs first observing run\n", "abstract": " A wide variety of astrophysical and cosmological sources are expected to contribute to a stochastic gravitational-wave background. Following the observations of GW150914 and GW151226, the rate and mass of coalescing binary black holes appear to be greater than many previous expectations. As a result, the stochastic background from unresolved compact binary coalescences is expected to be particularly loud. We perform a search for the isotropic stochastic gravitational-wave background using data from Advanced Laser Interferometer Gravitational Wave ObservatoryΓÇÖs (aLIGO) first observing run. The data display no evidence of a stochastic gravitational-wave signal. We constrain the dimensionless energy density of gravitational waves to be ╬⌐ 0< 1.7├ù 10ΓêÆ 7 with 95% confidence, assuming a flat energy density spectrum in the most sensitive part of the LIGO band (20ΓÇô86 Hz). This is a factor ofΓê╝ 33 times more┬áΓÇª", "num_citations": "203\n", "authors": ["10"]}
{"title": "Observing gravitational-wave transient GW150914 with minimal assumptions\n", "abstract": " The gravitational-wave signal GW150914 was first identified on September 14, 2015, by searches for short-duration gravitational-wave transients. These searches identify time-correlated transients in multiple detectors with minimal assumptions about the signal morphology, allowing them to be sensitive to gravitational waves emitted by a wide range of sources including binary black hole mergers. Over the observational period from September 12 to October 20, 2015, these transient searches were sensitive to binary black hole mergers similar to GW150914 to an average distance ofΓê╝ 600 Mpc. In this paper, we describe the analyses that first detected GW150914 as well as the parameter estimation and waveform reconstruction techniques that initially identified GW150914 as the merger of two black holes. We find that the reconstructed waveform is consistent with the signal from a binary black hole merger with a┬áΓÇª", "num_citations": "187\n", "authors": ["10"]}
{"title": "GW170817: implications for the stochastic gravitational-wave background from compact binary coalescences\n", "abstract": " The LIGO Scientific and Virgo Collaborations have announced the event GW170817, the first detection of gravitational waves from the coalescence of two neutron stars. The merger rate of binary neutron stars estimated from this event suggests that distant, unresolvable binary neutron stars create a significant astrophysical stochastic gravitational-wave background. The binary neutron star component will add to the contribution from binary black holes, increasing the amplitude of the total astrophysical background relative to previous expectations. In the Advanced LIGO-Virgo frequency band most sensitive to stochastic backgrounds (near 25 Hz), we predict a total astrophysical background with amplitude ╬⌐ GW (f= 25 Hz)= 1. 8ΓêÆ 1.3+ 2.7├ù 10ΓêÆ 9 with 90% confidence, compared with ╬⌐ GW (f= 25 Hz)= 1. 1ΓêÆ 0.7+ 1.2├ù 10ΓêÆ 9 from binary black holes alone. Assuming the most probable rate for compact binary mergers, we┬áΓÇª", "num_citations": "172\n", "authors": ["10"]}
{"title": "Upper limits on the rates of binary neutron star and neutron starΓÇôblack hole mergers from advanced LIGOΓÇÖs first observing run\n", "abstract": " We report here the non-detection of gravitational waves from the merger of binaryΓÇôneutron star systems and neutron starΓÇôblack hole systems during the first observing run of the Advanced Laser Interferometer Gravitationalwave Observatory (LIGO). In particular, we searched for gravitational-wave signals from binaryΓÇôneutron star systems with component masses ├Ä∩üÑ M 1, 3 [] and component dimensionless spins< 0.05. We also searched for neutron starΓÇôblack hole systems with the same neutron star parameters, black hole mass ├Ä∩üÑ M 2, 99 [], and no restriction on the black hole spin magnitude. We assess the sensitivity of the two LIGO detectors to these systems and find that they could have detected the merger of binaryΓÇôneutron star systems with component mass distributions of 1.35∩éá┬▒∩éá 0.13 Me at a volume-weighted average distance ofΓê╝ 70 Mpc, and for neutron starΓÇôblack hole systems with neutron star masses of┬áΓÇª", "num_citations": "172\n", "authors": ["10"]}
{"title": "Search for the isotropic stochastic background using data from Advanced LIGOΓÇÖs second observing run\n", "abstract": " The stochastic gravitational-wave background is a superposition of sources that are either too weak or too numerous to detect individually. In this study, we present the results from a cross-correlation analysis on data from Advanced LIGOΓÇÖs second observing run (O2), which we combine with the results of the first observing run (O1). We do not find evidence for a stochastic background, so we place upper limits on the normalized energy density in gravitational waves at the 95% credible level of ╬⌐ GW< 6.0├ù 10ΓêÆ 8 for a frequency-independent (flat) background and ╬⌐ GW< 4.8├ù 10ΓêÆ 8 at 25 Hz for a background of compact binary coalescences. The upper limit improves over the O1 result by a factor of 2.8. Additionally, we place upper limits on the energy density in an isotropic background of scalar-and vector-polarized gravitational waves, and we discuss the implication of these results for models of compact binaries and┬áΓÇª", "num_citations": "163\n", "authors": ["10"]}
{"title": "High-energy neutrino follow-up search of gravitational wave event GW150914 with ANTARES and IceCube\n", "abstract": " We present the high-energy-neutrino follow-up observations of the first gravitational wave transient GW150914 observed by the Advanced LIGO detectors on September 14, 2015. We search for coincident neutrino candidates within the data recorded by the IceCube and Antares neutrino detectors. A possible joint detection could be used in targeted electromagnetic follow-up observations, given the significantly better angular resolution of neutrino events compared to gravitational waves. We find no neutrino candidates in both temporal and spatial coincidence with the gravitational wave event. Within┬▒500 s of the gravitational wave event, the number of neutrino candidates detected by IceCube and Antares were three and zero, respectively. This is consistent with the expected atmospheric background, and none of the neutrino candidates were directionally coincident with GW150914. We use this nondetection to┬áΓÇª", "num_citations": "157\n", "authors": ["10"]}
{"title": "Estimating the contribution of dynamical ejecta in the kilonova associated with GW170817\n", "abstract": " The source of the gravitational-wave (GW) signal GW170817, very likely a binary neutron star merger, was also observed electromagnetically, providing the first multi-messenger observations of this type. The two-week-long electromagnetic (EM) counterpart had a signature indicative of an r-process-induced optical transient known as a kilonova. This Letter examines how the mass of the dynamical ejecta can be estimated without a direct electromagnetic observation of the kilonova, using GW measurements and a phenomenological model calibrated to numerical simulations of mergers with dynamical ejecta. Specifically, we apply the model to the binary masses inferred from the GW measurements, and use the resulting mass of the dynamical ejecta to estimate its contribution (without the effects of wind ejecta) to the corresponding kilonova light curves from various models. The distributions of dynamical ejecta mass┬áΓÇª", "num_citations": "154\n", "authors": ["10"]}
{"title": "Search for high-energy neutrinos from binary neutron star merger GW170817 with ANTARES, IceCube, and the Pierre Auger Observatory\n", "abstract": " The Advanced LIGO and Advanced Virgo observatories recently discovered gravitational waves from a binary neutron star inspiral. A short gamma-ray burst (GRB) that followed the merger of this binary was also recorded by the Fermi Gamma-ray Burst Monitor (Fermi-GBM), and the Anticoincidence Shield for the Spectrometer for the International Gamma-Ray Astrophysics Laboratory (INTEGRAL), indicating particle acceleration by the source. The precise location of the event was determined by optical detections of emission following the merger. We searched for high-energy neutrinos from the merger in the GeV--EeV energy range using the ANTARES, IceCube, and Pierre Auger Observatories. No neutrinos directionally coincident with the source were detected within  s around the merger time. Additionally, no MeV neutrino burst signal was detected coincident with the merger. We further carried out an extended search in the direction of the source for high-energy neutrinos within the 14-day period following the merger, but found no evidence of emission. We used these results to probe dissipation mechanisms in relativistic outflows driven by the binary neutron star merger. The non-detection is consistent with model predictions of short GRBs observed at a large off-axis angle.", "num_citations": "153\n", "authors": ["10"]}
{"title": "Improved analysis of GW150914 using a fully spin-precessing waveform model\n", "abstract": " This paper presents updated estimates of source parameters for GW150914, a binary black-hole coalescence event detected by the Laser Interferometer Gravitational-wave Observatory (LIGO) in 2015 [Abbott et al. Phys. Rev. Lett. 116, 061102 (2016).]. Abbott et al.[Phys. Rev. Lett. 116, 241102 (2016).] presented parameter estimation of the source using a 13-dimensional, phenomenological precessing-spin model (precessing IMRPhenom) and an 11-dimensional nonprecessing effective-one-body (EOB) model calibrated to numerical-relativity simulations, which forces spin alignment (nonprecessing EOBNR). Here, we present new results that include a 15-dimensional precessing-spin waveform model (precessing EOBNR) developed within the EOB formalism. We find good agreement with the parameters estimated previously [Abbott et al. Phys. Rev. Lett. 116, 241102 (2016).], and we quote updated component┬áΓÇª", "num_citations": "151\n", "authors": ["10"]}
{"title": "First search for gravitational waves from known pulsars with Advanced LIGO\n", "abstract": " The recent observations of gravitational waves from the inspiral and merger of binary black holes herald the era of gravitational-wave astronomy (Abbott et al. 2016b, 2016c). Such cataclysmic, transient, and extragalatic events are not however the only potential sources of observable gravitational waves. Galactic neutron stars offer a more local, and continuous, quasi-monochromatic source of gravitational radiation. Although intrinsically far weaker than the transient sources that have been observed, their continuous nature allows their signals to be found buried deep in the noise by coherently integrating over the long observing runs of the gravitationalwave observatories.The subset of known pulsars, identified through electromagnetic observations, provides an important possible source of continuous gravitational waves. They are often timed with exquisite precision, allowing their rotational phase evolution, sky┬áΓÇª", "num_citations": "145\n", "authors": ["10"]}
{"title": "Search for post-merger gravitational waves from the remnant of the binary neutron star merger GW170817\n", "abstract": " The first observation of a binary neutron star (NS) coalescence by the Advanced LIGO and Advanced Virgo gravitational-wave (GW) detectors offers an unprecedented opportunity to study matter under the most extreme conditions. After such a merger, a compact remnant is left over whose nature depends primarily on the masses of the inspiraling objects and on the equation of state of nuclear matter. This could be either a black hole (BH) or an NS, with the latter being either long-lived or too massive for stability implying delayed collapse to a BH. Here, we present a search for GWs from the remnant of the binary NS merger GW170817 using data from Advanced LIGO and Advanced Virgo. We search for short-(∩éê 1 s) and intermediate-duration (∩éê 500 s) signals, which include GW emission from a hypermassive NS or supramassive NS, respectively. We find no signal from the post-merger remnant. Our derived strain┬áΓÇª", "num_citations": "144\n", "authors": ["10"]}
{"title": "Improved upper limits on the stochastic gravitational-wave background from 2009ΓÇô2010 LIGO and Virgo data\n", "abstract": " Gravitational waves from a variety of sources are predicted to superpose to create a stochastic background. This background is expected to contain unique information from throughout the history of the Universe that is unavailable through standard electromagnetic observations, making its study of fundamental importance to understanding the evolution of the Universe. We carry out a search for the stochastic background with the latest data from the LIGO and Virgo detectors. Consistent with predictions from most stochastic gravitational-wave background models, the data display no evidence of a stochastic gravitational-wave signal. Assuming a gravitational-wave spectrum of ╬⌐ GW (f)= ╬⌐ ╬▒ (f/f ref) ╬▒, we place 95% confidence level upper limits on the energy density of the background in each of four frequency bands spanning 41.5ΓÇô1726 Hz. In the frequency band of 41.5ΓÇô169.25 Hz for a spectral index of ╬▒= 0, we┬áΓÇª", "num_citations": "129\n", "authors": ["10"]}
{"title": "First measurement of the Hubble constant from a dark standard siren using the dark energy survey galaxies and the LIGO/Virgo binaryΓÇôblack-hole merger GW170814\n", "abstract": " Unlike most extragalactic distance observables, mergers of neutron star and black hole binary systems are absolute distance indicators. Often referred to as ΓÇ£standard sirens,ΓÇ¥ they emit gravitational waves (GWs) from which the luminosity distance can be inferred without relying on any calibration with respect to another source: the rate of change in frequency gives the systemΓÇÖs size and thus the intrinsic amplitude, which is compared against the observed signal amplitude to obtain the distance to the source. If redshifts are associated with those sirens (in the simplest case, the host galaxy is identified and its redshift is obtained via spectroscopic follow up), a measurement of the present rate of expansion of the universe H0 can be achieved via the distanceΓÇôredshift relation. The use of GW sources as cosmological probes was first proposed by Schutz (1986), and recently revisited in several works (eg, Holz & Hughes┬áΓÇª", "num_citations": "124\n", "authors": ["10"]}
{"title": "Directly comparing GW150914 with numerical solutions of EinsteinΓÇÖs equations for binary black hole coalescence\n", "abstract": " We compare GW150914 directly to simulations of coalescing binary black holes in full general relativity, including several performed specifically to reproduce this event. Our calculations go beyond existing semianalytic models, because for all simulationsΓÇöincluding sources with two independent, precessing spinsΓÇöwe perform comparisons which account for all the spin-weighted quadrupolar modes, and separately which account for all the quadrupolar and octopolar modes. Consistent with the posterior distributions reported by Abbott et al.[Phys. Rev. Lett. 116, 241102 (2016)](at the 90% credible level), we find the data are compatible with a wide range of nonprecessing and precessing simulations. Follow-up simulations performed using previously estimated binary parameters most resemble the data, even when all quadrupolar and octopolar modes are included. Comparisons including only the quadrupolar┬áΓÇª", "num_citations": "117\n", "authors": ["10"]}
{"title": "Constraints on cosmic strings using data from the first Advanced LIGO observing run\n", "abstract": " Cosmic strings are topological defects which can be formed in grand unified theory scale phase transitions in the early universe. They are also predicted to form in the context of string theory. The main mechanism for a network of Nambu-Goto cosmic strings to lose energy is through the production of loops and the subsequent emission of gravitational waves, thus offering an experimental signature for the existence of cosmic strings. Here we report on the analysis conducted to specifically search for gravitational-wave bursts from cosmic string loops in the data of Advanced LIGO 2015-2016 observing run (O1). No evidence of such signals was found in the data, and as a result we set upper limits on the cosmic string parameters for three recent loop distribution models. In this paper, we initially derive constraints on the string tension G ╬╝ and the intercommutation probability, using not only the burst analysis performed┬áΓÇª", "num_citations": "111\n", "authors": ["10"]}
{"title": "Effects of waveform model systematics on the interpretation of GW150914\n", "abstract": " We recently reported the first direct observation of a gravitational-wave (GW) signal by the Advanced Laser Interferometer Gravitational Wave Observatory (aLIGO), from the merger of two black holes, GW150914 [1]. The merger occurred at a distance ofΓê╝ 410 Mpc and the black holes were estimated to have masses ofΓê╝ 36ΓèÖ M andΓê╝ 29ΓèÖ M, with spins poorly constrained to be each< 0.7 of their maximum possible values; we discuss the full properties of the source in detail in [2, 3], subsequently refined in [4]. These parameter estimates relied on three semi-analytic models of binary black hole (BBH) GW signals [5ΓÇô10]. In this paper we investigate systematic parameter errors that may have resulted from the approximations or physical infidelities of these waveform models, by repeating the analysis of [2] using a set of numerical relativity (NR) waveforms from configurations similar to those found for GW150914.The┬áΓÇª", "num_citations": "111\n", "authors": ["10"]}
{"title": "Calibration of the Advanced LIGO detectors for the discovery of the binary black-hole merger GW150914\n", "abstract": " In Advanced LIGO, detection and astrophysical source parameter estimation of the binary black hole merger GW150914 requires a calibrated estimate of the gravitational-wave strain sensed by the detectors. Producing an estimate from each detectorΓÇÖs differential arm length control loop readout signals requires applying time domain filters, which are designed from a frequency domain model of the detectorΓÇÖs gravitational-wave response. The gravitational-wave response model is determined by the detectorΓÇÖs opto-mechanical response and the properties of its feedback control system. The measurements used to validate the model and characterize its uncertainty are derived primarily from a dedicated photon radiation pressure actuator, with cross-checks provided by optical and radio frequency references. We describe how the gravitational-wave readout signal is calibrated into equivalent gravitational-wave-induced┬áΓÇª", "num_citations": "108\n", "authors": ["10"]}
{"title": "Effects of data quality vetoes on a search for compact binary coalescences in Advanced LIGOΓÇÖs first observing run\n", "abstract": " The Advanced Laser Interferometer Gravitational-Wave Observatory (aLIGO) is comprised of two dual-recycled Michelson interferometers [1] located in Livingston, LA (L1) and Hanford, WA (H1). A gravitational wave passing through a LIGO interferometer will induce a strain on spacetime, stretching and squeezing the 4 km arms and generating an interferometric signal at the antisymmetric port of the beamsplitter.Advanced LIGOΓÇÖs first observing run (O1) lasted from 12 September 2015 to 19 January 2016. A primary goal of this observing run was the detection of gravitational waves from compact binary coalescences (CBC)[2]. This goal was achieved with the detections of GW150914 and GW151226, both signals from binary black hole systems, which marked the first direct detections of gravitational waves [3, 4]. These detections were part of a broader search for CBC signals carried out by multiple search pipelines┬áΓÇª", "num_citations": "104\n", "authors": ["10"]}
{"title": "Search for intermediate mass black hole binaries in the first observing run of Advanced LIGO\n", "abstract": " During their first observational run, the two Advanced LIGO detectors attained an unprecedented sensitivity, resulting in the first direct detections of gravitational-wave signals produced by stellar-mass binary black hole systems. This paper reports on an all-sky search for gravitational waves (GWs) from merging intermediate mass black hole binaries (IMBHBs). The combined results from two independent search techniques were used in this study: the first employs a matched-filter algorithm that uses a bank of filters covering the GW signal parameter space, while the second is a generic search for GW transients (bursts). No GWs from IMBHBs were detected; therefore, we constrain the rate of several classes of IMBHB mergers. The most stringent limit is obtained for black holes of individual mass 100 MΓèÖ, with spins aligned with the binary orbital angular momentum. For such systems, the merger rate is constrained to┬áΓÇª", "num_citations": "100\n", "authors": ["10"]}
{"title": "Characterizing foreground for redshifted 21 cm radiation: 150 MHz Giant Metrewave Radio Telescope observations\n", "abstract": " Foreground removal is a major challenge for detecting the redshifted 21 cm neutral hydrogen (H i) signal from the Epoch of Reionization. We have used 150 MHz Giant Metrewave Radio Telescope observations to characterize the statistical properties of the foregrounds in four different fields of view. The measured multifrequency angular power spectrum C Γäô (╬ö╬╜) is found to have values in the range 104ΓÇô2├ù 104 mK2 across 700Γëñ ΓäôΓëñ 2├ù 104 and ╬ö╬╜Γëñ 2.5 MHz, which is consistent with model predictions where point sources are the most dominant foreground component. The measured C Γäô (╬ö╬╜) does not show a smooth ╬ö╬╜ dependence, which poses a severe difficulty for foreground removal using polynomial fitting. The observational data were used to assess point source subtraction. Considering the brightest source (Γê╝ 1 Jy) in each field, we find that the residual artefacts are less than 1.5 per cent in the most sensitive┬áΓÇª", "num_citations": "100\n", "authors": ["10"]}
{"title": "Tests of general relativity with GW150914\n", "abstract": " The LIGO detection of GW150914 provides an unprecedented opportunity to study the two-body motion of a compact-object binary in the large-velocity, highly nonlinear regime, and to witness the final merger of the binary and the excitation of uniquely relativistic modes of the gravitational field. We carry out several investigations to determine whether GW150914 is consistent with a binary black-hole merger in general relativity. We find that the final remnantΓÇÖs mass and spin, as determined from the low-frequency (inspiral) and high-frequency (postinspiral) phases of the signal, are mutually consistent with the binary black-hole solution in general relativity. Furthermore, the data following the peak of GW150914 are consistent with the least-damped quasinormal mode inferred from the mass and spin of the remnant black hole. By using waveform models that allow for parametrized general-relativity violations during the┬áΓÇª", "num_citations": "99\n", "authors": ["10"]}
{"title": "A guide to LIGOΓÇôVirgo detector noise and extraction of transient gravitational-wave signals\n", "abstract": " Gravitational-wave observations have become an important new means to learn about the Universe. The LIGO Scientific Collaboration and the Virgo Collaboration (LVC) have published a series of discoveries beginning with the first detected event, GW150914 [1], a binary black hole merger. Within a span of two years, that event was followed by nine other binary black hole detections (GW151012 [2, 3], GW151226 [4], GW170104 [5], GW170608 [6], GW170729, GW170809, GW170814 [7], GW170818 and GW170823), and one binary neutron star merger, GW170817 [8]. Details about all of these confidently-detected gravitationalwave events have been published in a catalog, GWTC-1 [3]. The global gravitational-wave detector network currently consists of two Advanced LIGO detectors in the US [9] in Hanford, Washington and Livingston, Louisiana; the Advanced", "num_citations": "98\n", "authors": ["10"]}
{"title": "All-sky search for continuous gravitational waves from isolated neutron stars using Advanced LIGO O2 data\n", "abstract": " We present results of an all-sky search for continuous gravitational waves (CWs), which can be produced by fast spinning neutron stars with an asymmetry around their rotation axis, using data from the second observing run of the Advanced LIGO detectors. Three different semicoherent methods are used to search in a gravitational-wave frequency band from 20 to 1922 Hz and a first frequency derivative fromΓêÆ 1├ù 10ΓêÆ 8 to 2├ù 10ΓêÆ 9 Hz/s. None of these searches has found clear evidence for a CW signal, so upper limits on the gravitational-wave strain amplitude are calculated, which for this broad range in parameter space are the most sensitive ever achieved.", "num_citations": "96\n", "authors": ["10"]}
{"title": "Directional limits on persistent gravitational waves from Advanced LIGOΓÇÖs first observing run\n", "abstract": " We employ gravitational-wave radiometry to map the stochastic gravitational wave background expected from a variety of contributing mechanisms and test the assumption of isotropy using data from the Advanced Laser Interferometer Gravitational Wave ObservatoryΓÇÖs (aLIGO) first observing run. We also search for persistent gravitational waves from point sources with only minimal assumptions over the 20ΓÇô1726 Hz frequency band. Finding no evidence of gravitational waves from either point sources or a stochastic background, we set limits at 90% confidence. For broadband point sources, we report upper limits on the gravitational wave energy flux per unit frequency in the range F ╬▒, ╬ÿ (f)<(0.1ΓÇô56)├ù 10ΓêÆ 8 erg cmΓêÆ 2 sΓêÆ 1 HzΓêÆ 1 (f/25 Hz) ╬▒ΓêÆ 1 depending on the sky location ╬ÿ and the spectral power index ╬▒. For extended sources, we report upper limits on the fractional gravitational wave energy density required to┬áΓÇª", "num_citations": "94\n", "authors": ["10"]}
{"title": "Search for tensor, vector, and scalar polarizations in the stochastic gravitational-wave background\n", "abstract": " The detection of gravitational waves with Advanced LIGO and Advanced Virgo has enabled novel tests of general relativity, including direct study of the polarization of gravitational waves. While general relativity allows for only two tensor gravitational-wave polarizations, general metric theories can additionally predict two vector and two scalar polarizations. The polarization of gravitational waves is encoded in the spectral shape of the stochastic gravitational-wave background, formed by the superposition of cosmological and individually unresolved astrophysical sources. Using data recorded by Advanced LIGO during its first observing run, we search for a stochastic background of generically polarized gravitational waves. We find no evidence for a background of any polarization, and place the first direct bounds on the contributions of vector and scalar polarizations to the stochastic background. Under log-uniform┬áΓÇª", "num_citations": "90\n", "authors": ["10"]}
{"title": "Search for subsolar mass ultracompact binaries in Advanced LIGOΓÇÖs second observing run\n", "abstract": " We present a search for subsolar mass ultracompact objects in data obtained during Advanced LIGOΓÇÖs second observing run. In contrast to a previous search of Advanced LIGO data from the first observing run, this search includes the effects of component spin on the gravitational waveform. We identify no viable gravitational-wave candidates consistent with subsolar mass ultracompact binaries with at least one component between 0.2 MΓèÖΓÇô1.0 MΓèÖ. We use the null result to constrain the binary merger rate of (0.2 MΓèÖ, 0.2 MΓèÖ) binaries to be less than 3.7├ù 10 5 GpcΓêÆ 3 yrΓêÆ 1 and the binary merger rate of (1.0 MΓèÖ, 1.0 MΓèÖ) binaries to be less than 5.2├ù 10 3 GpcΓêÆ 3 yrΓêÆ 1. Subsolar mass ultracompact objects are not expected to form via known stellar evolution channels, though it has been suggested that primordial density fluctuations or particle dark matter with cooling mechanisms and/or nuclear interactions could┬áΓÇª", "num_citations": "82\n", "authors": ["10"]}
{"title": "All-sky search for short gravitational-wave bursts in the first Advanced LIGO run\n", "abstract": " We present the results from an all-sky search for short-duration gravitational waves in the data of the first run of the Advanced LIGO detectors between September 2015 and January 2016. The search algorithms use minimal assumptions on the signal morphology, so they are sensitive to a wide range of sources emitting gravitational waves. The analyses target transient signals with duration ranging from milliseconds to seconds over the frequency band of 32 to 4096 Hz. The first observed gravitational-wave event, GW150914, has been detected with high confidence in this search; the other known gravitational-wave event, GW151226, falls below the searchΓÇÖs sensitivity. Besides GW150914, all of the search results are consistent with the expected rate of accidental noise coincidences. Finally, we estimate rate-density limits for a broad range of non-binary-black-hole transient gravitational-wave sources as a function of┬áΓÇª", "num_citations": "81\n", "authors": ["10"]}
{"title": "First all-sky search for continuous gravitational waves from unknown sources in binary systems\n", "abstract": " We present the first results of an all-sky search for continuous gravitational waves from unknown spinning neutron stars in binary systems using LIGO and Virgo data. Using a specially developed analysis program, the TwoSpect algorithm, the search was carried out on data from the sixth LIGO science run and the second and third Virgo science runs. The search covers a range of frequencies from 20 Hz to 520 Hz, a range of orbital periods from 2 toΓê╝ 2, 254 h and a frequency-and period-dependent range of frequency modulation depths from 0.277 to 100 mHz. This corresponds to a range of projected semimajor axes of the orbit fromΓê╝ 0.6├ù 1 0ΓêÆ 3 ls toΓê╝ 6, 500 ls assuming the orbit of the binary is circular. While no plausible candidate gravitational wave events survive the pipeline, upper limits are set on the analyzed data. The most sensitive 95% confidence upper limit obtained on gravitational wave strain is 2.3├ù 1┬áΓÇª", "num_citations": "81\n", "authors": ["10"]}
{"title": "Searches for continuous gravitational waves from nine young supernova remnants\n", "abstract": " The American Astronomical Society (AAS), established in 1899 and based in Washington, DC, is the major organization of professional astronomers in North America. Its membership of about 7,000 individuals also includes physicists, mathematicians, geologists, engineers, and others whose research and educational interests lie within the broad spectrum of subjects comprising contemporary astronomy. The mission of the AAS is to enhance and share humanity's scientific understanding of the universe.", "num_citations": "76\n", "authors": ["10"]}
{"title": "First targeted search for gravitational-wave bursts from core-collapse supernovae in data of first-generation laser interferometer detectors\n", "abstract": " We present results from a search for gravitational-wave bursts coincident with two core-collapse supernovae observed optically in 2007 and 2011. We employ data from the Laser Interferometer Gravitational-wave Observatory (LIGO), the Virgo gravitational-wave observatory, and the GEO 600 gravitational-wave observatory. The targeted core-collapse supernovae were selected on the basis of (1) proximity (within approximately 15 Mpc),(2) tightness of observational constraints on the time of core collapse that defines the gravitational-wave search window, and (3) coincident operation of at least two interferometers at the time of core collapse. We find no plausible gravitational-wave candidates. We present the probability of detecting signals from both astrophysically well-motivated and more speculative gravitational-wave emission mechanisms as a function of distance from Earth, and discuss the implications for the┬áΓÇª", "num_citations": "75\n", "authors": ["10"]}
{"title": "Search for gravitational waves from a long-lived remnant of the binary neutron star merger GW170817\n", "abstract": " The binary neutron star (BNS) observation GW170817 (Abbott et al. 2017d) was the first multimessenger astronomy event to be jointly detected in gravitational waves (GWs) and at many electromagnetic (EM) wavelengths∩éá(Abbott et al. 2017e). It originated remarkably close to Earth, with a distance of 38 18 8 ╨ô+ Mpc 170 as measured by the LIGO and Virgo GW detectors∩éá(Aasi et al. 2015a; Acernese et al. 2015) alone and consistent EM distance estimates for the host galaxy NGC∩éá 4993∩éá(Sakai et al. 2000; Freedman et al. 2001; Hjorth et al. 2017; Lee et al. 2018).A BNS merger is expected to leave behind a remnant compact object, either a light stellar-mass black hole or a heavy neutron star (NS), which can emit a variety of post-merger GW signals. Although these are more difficult to detect than the premerger inspiral signal, the nearby origin of GW170817 has generated interest in the search for a post-merger┬áΓÇª", "num_citations": "73\n", "authors": ["10"]}
{"title": "Model comparison from LIGOΓÇôVirgo data on GW170817ΓÇÖs binary components and consequences for the merger remnant\n", "abstract": " On August 17, 2017, the Advanced LIGO [1] and Advanced Virgo [2] observatories detected a gravitational-wave signal, GW170817, from a low-mass compact binary system [3]. The signal was coincident with the gamma-ray burst GRB 170817A [4] and was followed by other observations spanning the electromagnetic spectrum [5]. These electromagnetic observations, coupled with measurements of the component masses from the gravitational-wave observation [6, 7], provide compelling evidence that GW170817 was produced from the merger of two neutron stars.One of the key goals of observing such neutron star mergers is to extract information regarding the internal structure of neutron stars and to improve our understanding of their highly uncertain equation of state [8, 9]. Information regarding the equation of state is encoded in the variation of the orbital evolution induced by tidal interactions and the┬áΓÇª", "num_citations": "72\n", "authors": ["10"]}
{"title": "Search for subsolar-mass ultracompact binaries in Advanced LIGOΓÇÖs first observing run\n", "abstract": " We present the first Advanced LIGO and Advanced Virgo search for ultracompact binary systems with component masses between 0.2 MΓèÖΓÇô1.0 MΓèÖ using data taken between September 12, 2015 and January 19, 2016. We find no viable gravitational wave candidates. Our null result constrains the coalescence rate of monochromatic (delta function) distributions of nonspinning (0.2 MΓèÖ, 0.2 MΓèÖ) ultracompact binaries to be less than 1.0├ù 10 6 GpcΓêÆ 3 yrΓêÆ 1 and the coalescence rate of a similar distribution of (1.0 MΓèÖ, 1.0 MΓèÖ) ultracompact binaries to be less than 1.9├ù 10 4 GpcΓêÆ 3 yrΓêÆ 1 (at 90% confidence). Neither black holes nor neutron stars are expected to form belowΓê╝ 1 MΓèÖ through conventional stellar evolution, though it has been proposed that similarly low mass black holes could be formed primordially through density fluctuations in the early Universe and contribute to the dark matter density. The┬áΓÇª", "num_citations": "72\n", "authors": ["10"]}
{"title": "Low-latency gravitational-wave alerts for multimessenger astronomy during the second Advanced LIGO and virgo observing run\n", "abstract": " Gravitational-wave (GW) multimessenger astronomy provides a unique view of the cosmos. In this paper, we explain the procedures used during the second observing run of the advanced ground-based gravitational-wave-detector network to issue alerts for multimessenger follow-up. We also include a summary of all alerts issued to observing partners and an update on the status of candidate events. The Advanced Laser Interferometer Gravitational-wave Observatory (LIGO) detectors (LIGO Scientific Collaboration et al. 2015) are installed in the US at Hanford, WA and Livingston, LA, and the Advanced Virgo detector (Acernese et al. 2015) is located in Cascina, Italy near Pisa. The detectors use a modified Michelson laser interferometer design to measure GW strain. A passing GW causes a differential length change in the detector arms, producing interference of the laser beams at the beam splitter, and giving an┬áΓÇª", "num_citations": "71\n", "authors": ["10"]}
{"title": "Search for gravitational waves associated with gamma-ray bursts during the first Advanced LIGO observing run and implications for the origin of GRB 150906B\n", "abstract": " Gamma-ray bursts (GRBs) are among the most energetic astrophysical events observed in the electromagnetic spectrum. They are transient flashes of ╬│-radiation and are broadly classified as being long or short, depending on their duration and spectral hardness, mainly on the basis of data from the Burst and Transient Source Experiment on board the Compton Gamma-Ray Observatory∩éá(Nakar 2007; Berger 2014). Long GRBs have a duration that is greater thanΓê╝ 2s and a softer spectrum; their origin is related to the core collapse of rapidly rotating massive stars (Woosley & Bloom 2006; M├╢sta et al. 2015), a hypothesis supported by observations of associated core-collapse supernovae∩éá(Hjorth & Bloom 2011). In this scenario, several (magneto) rotational instabilities may kick in and lead to the emission of gravitational waves (GWs; Modjaz 2011).Short GRBs have a duration of less thanΓê╝ 2 s and a harder┬áΓÇª", "num_citations": "69\n", "authors": ["10"]}
{"title": "The NINJA-2 project: detecting and characterizing gravitational waveforms modelled using numerical binary black hole simulations\n", "abstract": " A network of second-generation laser interferometric gravitational-wave (GW) observatories is presently under construction. The US-based Advanced Laser Interferometer Gravitational Wave Observatory (aLIGO)[1] is expected to have its initial observing run in 2015 utilizing observatories in Hanford, Washington and Livingston, Louisiana (denoted ΓÇÿHΓÇÖand ΓÇÿLΓÇÖ, respectively). aLIGO will then work towards reaching design sensitivity, expected in 2018ΓÇô20 [2]. The FrenchΓÇôItalian Advanced Virgo (AdV) observatory [3, 4](denoted ΓÇÿVΓÇÖ) is expected to follow shortly after the aLIGO instruments. The cryogenically cooled KAGRA observatory [5, 6] and a India-based aLIGO facility [7, 8] are due to begin operations around 2020, providing a 5-site network to explore the GW sky in detail. These second-generation observatories will have an order of magnitude increase in sensitivity over their first-generation counterparts and will be┬áΓÇª", "num_citations": "69\n", "authors": ["10"]}
{"title": "All-sky search for periodic gravitational waves in the O1 LIGO data\n", "abstract": " We report on an all-sky search for periodic gravitational waves in the frequency band 20ΓÇô475 Hz and with a frequency time derivative in the range of [ΓêÆ 1.0,+ 0.1]├ù 10ΓêÆ 8 Hz/s. Such a signal could be produced by a nearby spinning and slightly nonaxisymmetric isolated neutron star in our galaxy. This search uses the data from Advanced LIGOΓÇÖs first observational run, O1. No periodic gravitational wave signals were observed, and upper limits were placed on their strengths. The lowest upper limits on worst-case (linearly polarized) strain amplitude h 0 areΓê╝ 4├ù 10ΓêÆ 25 near 170 Hz. For a circularly polarized source (most favorable orientation), the smallest upper limits obtained areΓê╝ 1.5├ù 10ΓêÆ 25. These upper limits refer to all sky locations and the entire range of frequency derivative values. For a population-averaged ensemble of sky locations and stellar orientations, the lowest upper limits obtained for the strain┬áΓÇª", "num_citations": "68\n", "authors": ["10"]}
{"title": "First search for nontensorial gravitational waves from known pulsars\n", "abstract": " We present results from the first directed search for nontensorial gravitational waves. While general relativity allows for tensorial (plus and cross) modes only, a generic metric theory may, in principle, predict waves with up to six different polarizations. This analysis is sensitive to continuous signals of scalar, vector, or tensor polarizations, and does not rely on any specific theory of gravity. After searching data from the first observation run of the advanced LIGO detectors for signals at twice the rotational frequency of 200 known pulsars, we find no evidence of gravitational waves of any polarization. We report the first upper limits for scalar and vector strains, finding values comparable in magnitude to previously published limits for tensor strain. Our results may be translated into constraints on specific alternative theories of gravity.", "num_citations": "66\n", "authors": ["10"]}
{"title": "On the progenitor of binary neutron star merger GW170817\n", "abstract": " On 2017 August 17 the merger of two compact objects with masses consistent with two neutron stars was discovered through gravitational-wave (GW170817), gamma-ray (GRB∩éá 170817A), and optical (SSS17a/AT 2017gfo) observations. The optical source was associated with the early-type galaxy NGC 4993 at a distance of justΓê╝ 40 Mpc, consistent with the gravitational-wave measurement, and the merger was localized to be at a projected distance ofΓê╝ 2 kpc away from the galaxyΓÇÖs center. We use this minimal set of facts and the mass posteriors of the two neutron stars to derive the first constraints on the progenitor of GW170817 at the time of the second supernova (SN). We generate simulated progenitor populations and follow the three-dimensional kinematic evolution from binary neutron star (BNS) birth to the merger time, accounting for pre-SN galactic motion, for considerably different input distributions of the┬áΓÇª", "num_citations": "66\n", "authors": ["10"]}
{"title": "Searches for gravitational waves from known pulsars at two harmonics in 2015ΓÇô2017 LIGO data\n", "abstract": " There have been several previous searches for persistent (or continuous) quasi-monochromatic gravitational waves emitted by a selection of known pulsars using data from the LIGO, Virgo, and GEO600 gravitational-wave∩éá detectors (Abbott et al. 2004, 2005, 2017a, 2007, 2008, 2010; Abadie et al. 2011; Aasi et al. 2014). In the majority of these, the signals that have been searched for are those that would be expected from stars with a nonzero l∩éá=∩éá m∩éá=∩éá 2 mass quadrupole moment Q22 and with polarization content consistent with the expectations of general relativity (see, eg, Zimmermann & Szedenits 1979; Bonazzola & Gourgoulhon 1996; Jaranowski et al. 1998). Such signals would be produced at twice the stellar rotation frequencies, and searches have generally assumed that the rotation frequency derived from electromagnetic observations of the pulsars is phase locked to the star, s rotation and thus the┬áΓÇª", "num_citations": "65\n", "authors": ["10"]}
{"title": "Search for high-energy neutrinos from gravitational wave event GW151226 and candidate LVT151012 with ANTARES and IceCube\n", "abstract": " The Advanced LIGO observatories detected gravitational waves from two binary black hole mergers during their first observation run (O1). We present a high-energy neutrino follow-up search for the second gravitational wave event, GW151226, as well as for gravitational wave candidate LVT151012. We find two and four neutrino candidates detected by IceCube, and one and zero detected by Antares, within┬▒500 s around the respective gravitational wave signals, consistent with the expected background rate. None of these neutrino candidates are found to be directionally coincident with GW151226 or LVT151012. We use nondetection to constrain isotropic-equivalent high-energy neutrino emission from GW151226, adopting the GW eventΓÇÖs 3D localization, to less than 2├ù 1 0 51ΓÇô2├ù 1 0 54 erg.", "num_citations": "65\n", "authors": ["10"]}
{"title": "Directed search for gravitational waves from Scorpius X-1 with initial LIGO data\n", "abstract": " We present results of a search for continuously emitted gravitational radiation, directed at the brightest low-mass x-ray binary, Scorpius X-1. Our semicoherent analysis covers 10 days of LIGO S5 data ranging from 50ΓÇô550 Hz, and performs an incoherent sum of coherent F-statistic power distributed amongst frequency-modulated orbital sidebands. All candidates not removed at the veto stage were found to be consistent with noise at a 1% false alarm rate. We present Bayesian 95% confidence upper limits on gravitational-wave strain amplitude using two different prior distributions: a standard one, with no a priori assumptions about the orientation of Scorpius X-1; and an angle-restricted one, using a prior derived from electromagnetic observations. Median strain upper limits of 1.3├ù 10ΓêÆ 24 and 8├ù 10ΓêÆ 25 are reported at 150 Hz for the standard and angle-restricted searches respectively. This proof-of-principle analysis┬áΓÇª", "num_citations": "65\n", "authors": ["10"]}
{"title": "First low-frequency Einstein@ Home all-sky search for continuous gravitational waves in Advanced LIGO data\n", "abstract": " We report results of a deep all-sky search for periodic gravitational waves from isolated neutron stars in data from the first Advanced LIGO observing run. This search investigates the low frequency range of Advanced LIGO data, between 20 and 100 Hz, much of which was not explored in initial LIGO. The search was made possible by the computing power provided by the volunteers of the Einstein@ Home project. We find no significant signal candidate and set the most stringent upper limits to date on the amplitude of gravitational wave signals from the target population, corresponding to a sensitivity depth of 48.7 [1/Hz]. At the frequency of best strain sensitivity, near 100 Hz, we set 90% confidence upper limits of 1.8├ù 1 0ΓêÆ 25. At the low end of our frequency range, 20 Hz, we achieve upper limits of 3.9├ù 1 0ΓêÆ 24. At 55 Hz we can exclude sources with ellipticities greater than 1 0ΓêÆ 5 within 100 pc of Earth with fiducial┬áΓÇª", "num_citations": "64\n", "authors": ["10"]}
{"title": "Search for gravitational waves from Scorpius X-1 in the first Advanced LIGO observing run with a hidden Markov model\n", "abstract": " Results are presented from a semicoherent search for continuous gravitational waves from the brightest low-mass X-ray binary, Scorpius X-1, using data collected during the first Advanced LIGO observing run. The search combines a frequency domain matched filter (Bessel-weighted F-statistic) with a hidden Markov model to track wandering of the neutron star spin frequency. No evidence of gravitational waves is found in the frequency range 60ΓÇô650 Hz. Frequentist 95% confidence strain upper limits, h 0 95%= 4.0├ù 1 0ΓêÆ 25, 8.3├ù 1 0ΓêÆ 25, and 3.0├ù 1 0ΓêÆ 25 for electromagnetically restricted source orientation, unknown polarization, and circular polarization, respectively, are reported at 106 Hz. They areΓëñ 10 times higher than the theoretical torque-balance limit at 106 Hz.", "num_citations": "59\n", "authors": ["10"]}
{"title": "A gravitational-wave measurement of the Hubble constant following the second observing run of Advanced LIGO and Virgo\n", "abstract": " Gravitational waves (GWs) from compact binary coalescences allow for the direct measurement of the luminosity distance to their source. This makes them standard-distance indicators, and in conjunction with an identified host galaxy or a set of possible host galaxies, they can be used as standard sirens to construct a redshift-distance relationship and measure cosmological parameters like the Hubble constant (H0; Schutz 1986; Holz & Hughes 2005; MacLeod & Hogan 2008; Nissanke et al. 2010; Sathyaprakash et al. 2010). The GW signature from the binary neutron star (BNS) merger GW170817, along with its coincident electromagnetic (EM) transient associated with the host galaxy NGC4993, led to a first standard-siren measurement of H0 (Abbott et al. 2017a). This measurement is independent of other state-of-the-art measurements of H0, and in particular, independent of the cosmic distance ladder used to┬áΓÇª", "num_citations": "58\n", "authors": ["10"]}
{"title": "Search for gravitational radiation from intermediate mass black hole binaries in data from the second LIGO-Virgo joint science run\n", "abstract": " This paper reports on an unmodeled, all-sky search for gravitational waves from merging intermediate mass black hole binaries (IMBHB). The search was performed on data from the second joint science run of the LIGO and Virgo detectors (July 2009ΓÇôOctober 2010) and was sensitive to IMBHBs with a range up toΓê╝ 200 Mpc, averaged over the possible sky positions and inclinations of the binaries with respect to the line of sight. No significant candidate was found. Upper limits on the coalescence-rate density of nonspinning IMBHBs with total masses between 100 and 450 MΓèÖ and mass ratios between 0.25 and 1 were placed by combining this analysis with an analogous search performed on data from the first LIGO-Virgo joint science run (November 2005ΓÇôOctober 2007). The most stringent limit was set for systems consisting of two 88 MΓèÖ black holes and is equal to 0.12 MpcΓêÆ 3 MyrΓêÆ 1 at the 90% confidence level┬áΓÇª", "num_citations": "57\n", "authors": ["10"]}
{"title": "FLAGCAL: a flagging and calibration package for radio interferometric data\n", "abstract": " We describe a flagging and calibration pipeline intended for making quick look images from GMRT data. The package identifies and flags corrupted visibilities, computes calibration solutions and interpolates these onto the target source. These flagged calibrated visibilities can be directly imaged using any standard imaging package. The pipeline is written in ΓÇ£CΓÇ¥ with the most compute intensive algorithms being parallelized using OpenMP.", "num_citations": "56\n", "authors": ["10"]}
{"title": "All-sky search for short gravitational-wave bursts in the second Advanced LIGO and Advanced Virgo run\n", "abstract": " We present the results of a search for short-duration gravitational-wave transients in the data from the second observing run of Advanced LIGO and Advanced Virgo. We search for gravitational-wave transients with a duration of milliseconds to approximately one second in the 32ΓÇô4096 Hz frequency band with minimal assumptions about the signal properties, thus targeting a wide variety of sources. We also perform a matched-filter search for gravitational-wave transients from cosmic string cusps for which the waveform is well modeled. The unmodeled search detected gravitational waves from several binary black hole mergers which have been identified by previous analyses. No other significant events have been found by either the unmodeled search or the cosmic string search. We thus present the search sensitivities for a variety of signal waveforms and report upper limits on the source rate density as a function┬áΓÇª", "num_citations": "55\n", "authors": ["10"]}
{"title": "Search for Gravitational Waves Associated with -ray Bursts Detected by the Interplanetary Network\n", "abstract": " We present the results of a search for gravitational waves associated with 223 ╬│-ray bursts (GRBs) detected by the InterPlanetary Network (IPN) in 2005ΓÇô2010 during LIGOΓÇÖs fifth and sixth science runs and VirgoΓÇÖs first, second, and third science runs. The IPN satellites provide accurate times of the bursts and sky localizations that vary significantly from degree scale to hundreds of square degrees. We search for both a well-modeled binary coalescence signal, the favored progenitor model for short GRBs, and for generic, unmodeled gravitational wave bursts. Both searches use the event time and sky localization to improve the gravitational wave search sensitivity as compared to corresponding all-time, all-sky searches. We find no evidence of a gravitational wave signal associated with any of the IPN GRBs in the sample, nor do we find evidence for a population of weak gravitational wave signals associated with the┬áΓÇª", "num_citations": "49\n", "authors": ["10"]}
{"title": "Upper limits on gravitational waves from Scorpius X-1 from a model-based cross-correlation search in advanced LIGO data\n", "abstract": " Rotating neutron stars (NSs) are the primary expected source of continuous, periodic gravitational waves (GWs) for groundbased GW detectors. Targets include known pulsars (Aasi et al. 2014a), non-pulsating NSs in supernova remnants (Wette et al. 2008; Abadie et al. 2010; Aasi et al. 2015a), and unknown isolated (Aasi et al. 2016; Abbott et al. 2016a) or binary NSs (Aasi et al. 2014b). A particularly promising source is an accreting NS in a low-mass X-ray binary (LMXB); accretion torque spins up the NS into the frequency band of the detectors, and the accretion can generate an asymmetric mass or current quadrupole that acts as the source for the GWs (Watts et al. 2008). An approximate equilibrium between the accretion spinup and GW spin-down, as well as other spin-down torques can produce a signal that is nearly periodic in the NS╩╝s rest frame, and then Doppler-shifted due to the orbital motion of the NS┬áΓÇª", "num_citations": "48\n", "authors": ["10"]}
{"title": "Narrow-band search of continuous gravitational-wave signals from Crab and Vela pulsars in Virgo VSR4 data\n", "abstract": " In this paper we present the results of a coherent narrow-band search for continuous gravitational-wave signals from the Crab and Vela pulsars conducted on Virgo VSR4 data. In order to take into account a possible small mismatch between the gravitational-wave frequency and two times the star rotation frequency, inferred from measurement of the electromagnetic pulse rate, a range of 0.02 Hz around two times the star rotational frequency has been searched for both the pulsars. No evidence for a signal has been found and 95% confidence level upper limits have been computed assuming both that polarization parameters are completely unknown and that they are known with some uncertainty, as derived from x-ray observations of the pulsar wind torii. For Vela the upper limits are comparable to the spin-down limit, computed assuming that all the observed spin-down is due to the emission of gravitational waves┬áΓÇª", "num_citations": "48\n", "authors": ["10"]}
{"title": "Effects of the size of cosmological N-body simulations on physical quantities ΓÇô I. Mass function\n", "abstract": " N-body simulations are a very important tool in the study of formation of large-scale structures. Much of the progress in understanding the physics of galaxy formation and comparison with observations would not have been possible without N-body simulations. Given the importance of this tool, it is essential to understand its limitations as ignoring these can easily lead to interesting but unreliable results. In this paper, we study the limitations due to the finite size of the simulation volume. We explicitly construct the correction term arising due to a finite box size and study its generic features for clustering of matter and also on mass functions. We show that the correction to mass function is maximum near the scale of non-linearity, as a corollary we show that the correction to the number density of haloes of a given mass changes sign at this scale; the number of haloes at small masses is overestimated in┬áΓÇª", "num_citations": "48\n", "authors": ["10"]}
{"title": "Search for eccentric binary black hole mergers with advanced LIGO and advanced virgo during their first and second observing runs\n", "abstract": " In their first two observing runs, the Advanced LIGO and Advanced Virgo detectors discovered 10 binary black hole (BBH) mergers and a binary neutron star merger (Abbott et al. 2019e). These detections have already provided a wealth of information on cosmic processes, including the rate, mass, spin, and redshift distribution of BBH mergers (Abbott et al. 2016f, 2019d), constraints on general relativity (Abbott et al. 2016e, 2019c), estimates of the Hubble constant (Abbott et al. 2017a, 2019b; Soares-Santos et al. 2019), and constraints on multi-messenger emission from the mergers (Abbott et al. 2008, 2016d, 2019a; Adri├ín-Mart├¡nez et al. 2016; Albert et al. 2017; Burns et al. 2019).A key question that remains unanswered is how BBHs are formed. Viable formation channels include isolated binary evolution (eg, Bethe & Brown 1998; Belczynski et al. 2002, 2014, 2016; Dominik et al. 2013; Mennekens & Vanbeveren┬áΓÇª", "num_citations": "47\n", "authors": ["10"]}
{"title": "Narrow-band search for gravitational waves from known pulsars using the second LIGO observing run\n", "abstract": " Isolated spinning neutron stars, asymmetric with respect to their rotation axis, are expected to be sources of continuous gravitational waves. The most sensitive searches for these sources are based on accurate matched filtering techniques that assume the continuous wave to be phase locked with the pulsar beamed emission. While matched filtering maximizes the search sensitivity, a significant signal-to-noise ratio loss will happen in the case of a mismatch between the assumed and the true signal phase evolution. Narrow-band algorithms allow for a small mismatch in the frequency and spin-down values of the pulsar while coherently integrating the entire dataset. In this paper, we describe a narrow-band search using LIGO O2 data for the continuous wave emission of 33 pulsars. No evidence of a continuous wave signal is found, and upper limits on the gravitational wave amplitude over the analyzed frequency┬áΓÇª", "num_citations": "47\n", "authors": ["10"]}
{"title": "First narrow-band search for continuous gravitational waves from known pulsars in advanced detector data\n", "abstract": " Spinning neutron stars asymmetric with respect to their rotation axis are potential sources of continuous gravitational waves for ground-based interferometric detectors. In the case of known pulsars a fully coherent search, based on matched filtering, which uses the position and rotational parameters obtained from electromagnetic observations, can be carried out. Matched filtering maximizes the signal-to-noise (SNR) ratio, but a large sensitivity loss is expected in case of even a very small mismatch between the assumed and the true signal parameters. For this reason, narrow-band analysis methods have been developed, allowing a fully coherent search for gravitational waves from known pulsars over a fraction of a hertz and several spin-down values. In this paper we describe a narrow-band search of 11 pulsars using data from Advanced LIGOΓÇÖs first observing run. Although we have found several initial outliers┬áΓÇª", "num_citations": "47\n", "authors": ["10"]}
{"title": "Search for gravitational wave ringdowns from perturbed intermediate mass black holes in LIGO-Virgo data from 2005ΓÇô2010\n", "abstract": " We report results from a search for gravitational waves produced by perturbed intermediate mass black holes (IMBH) in data collected by LIGO and Virgo between 2005 and 2010. The search was sensitive to astrophysical sources that produced damped sinusoid gravitational wave signals, also known as ringdowns, with frequency 50Γëñ f 0/HzΓëñ 2000 and decay timescale 0.0001Γë▓ ╧ä/sΓë▓ 0.1 characteristic of those produced in mergers of IMBH pairs. No significant gravitational wave candidate was detected. We report upper limits on the astrophysical coalescence rates of IMBHs with total binary mass 50Γëñ M/MΓèÖΓëñ 450 and component mass ratios of either 1: 1 or 4: 1. For systems with total mass 100Γëñ M/MΓèÖΓëñ 150, we report a 90% confidence upper limit on the rate of binary IMBH mergers with nonspinning and equal mass components of 6.9├ù 10ΓêÆ 8 MpcΓêÆ 3 yrΓêÆ 1. We also report a rate upper limit for ringdown┬áΓÇª", "num_citations": "47\n", "authors": ["10"]}
{"title": "Search for intermediate mass black hole binaries in the first and second observing runs of the Advanced LIGO and Virgo network\n", "abstract": " Gravitational-wave astronomy has been firmly established with the detection of gravitational waves from the merger of ten stellar-mass binary black holes and a neutron star binary. This paper reports on the all-sky search for gravitational waves from intermediate mass black hole binaries in the first and second observing runs of the Advanced LIGO and Virgo network. The search uses three independent algorithms: two based on matched filtering of the data with waveform templates of gravitational-wave signals from compact binaries, and a third, model-independent algorithm that employs no signal model for the incoming signal. No intermediate mass black hole binary event is detected in this search. Consequently, we place upper limits on the merger rate density for a family of intermediate mass black hole binaries. In particular, we choose sources with total masses M= m 1+ m 2Γêê[120, 800] MΓèÖ and mass ratios q┬áΓÇª", "num_citations": "46\n", "authors": ["10"]}
{"title": "Implementation of an-statistic all-sky search for continuous gravitational waves in virgo vsr1 data\n", "abstract": " This paper presents results from a wide parameter search for periodic gravitational waves from spinning neutron stars using data from the Virgo detector [1]. The data used in this paper were produced during Virgo╩╝s first science run (VSR1), which started on 18 May 2007 and ended on 1 October 2007. The VSR1 data have never been searched for periodic gravitational waves from isolated neutron stars before. The innovation of the search is the combination of the efficiency of the FFT algorithm together with a nearly optimal grid of templates. Rotating neutron stars are promising sources of gravitational radiation in the band of ground-based laser interferometric detectors (see [2] for a review). In order for these objects to emit gravitational waves, they must exhibit some asymmetry, which could be due to imperfections of the neutron star crust or the influence of strong internal magnetic fields (see [3] for recent results┬áΓÇª", "num_citations": "46\n", "authors": ["10"]}
{"title": "Multimessenger search for sources of gravitational waves and high-energy neutrinos: Initial results for LIGO-Virgo and IceCube\n", "abstract": " We report the results of a multimessenger search for coincident signals from the LIGO and Virgo gravitational-wave observatories and the partially completed IceCube high-energy neutrino detector, including periods of joint operation between 2007ΓÇô2010. These include parts of the 2005ΓÇô2007 run and the 2009ΓÇô2010 run for LIGO-Virgo, and IceCubeΓÇÖs observation periods with 22, 59 and 79 strings. We find no significant coincident events, and use the search results to derive upper limits on the rate of joint sources for a range of source emission parameters. For the optimistic assumption of gravitational-wave emission energy of 10ΓêÆ 2 MΓèÖ c 2 atΓê╝ 150 Hz withΓê╝ 60 ms duration, and high-energy neutrino emission of 1 0 51 erg comparable to the isotropic gamma-ray energy of gamma-ray bursts, we limit the source rate below 1.6├ù 1 0ΓêÆ 2 MpcΓêÆ 3 yrΓêÆ 1. We also examine how combining information from gravitational┬áΓÇª", "num_citations": "45\n", "authors": ["10"]}
{"title": "All-sky search for long-duration gravitational wave transients with initial LIGO\n", "abstract": " We present the results of a search for long-duration gravitational wave transients in two sets of data collected by the LIGO Hanford and LIGO Livingston detectors between November 5, 2005 and September 30, 2007, and July 7, 2009 and October 20, 2010, with a total observational time of 283.0 days and 132.9 days, respectively. The search targets gravitational wave transients of duration 10ΓÇô500 s in a frequency band of 40ΓÇô1000 Hz, with minimal assumptions about the signal waveform, polarization, source direction, or time of occurrence. All candidate triggers were consistent with the expected background; as a result we set 90% confidence upper limits on the rate of long-duration gravitational wave transients for different types of gravitational wave signals. For signals from black hole accretion disk instabilities, we set upper limits on the source rate density between 3.4├ù 1 0ΓêÆ 5 and 9.4├ù 1 0ΓêÆ 4 MpcΓêÆ 3 yrΓêÆ 1 at 90┬áΓÇª", "num_citations": "44\n", "authors": ["10"]}
{"title": "Full band all-sky search for periodic gravitational waves in the O1 LIGO data\n", "abstract": " We report on a new all-sky search for periodic gravitational waves in the frequency band 475ΓÇô2000 Hz and with a frequency time derivative in the range of [ΓêÆ 1.0,+ 0.1]├ù 1 0ΓêÆ 8 Hz/s. Potential signals could be produced by a nearby spinning and slightly nonaxisymmetric isolated neutron star in our Galaxy. This search uses the data from Advanced LIGOΓÇÖs first observational run O1. No gravitational-wave signals were observed, and upper limits were placed on their strengths. For completeness, results from the separately published low-frequency search 20ΓÇô475 Hz are included as well. Our lowest upper limit on worst-case (linearly polarized) strain amplitude h 0 isΓê╝ 4├ù 1 0ΓêÆ 25 near 170 Hz, while at the high end of our frequency range, we achieve a worst-case upper limit of 1.3├ù 1 0ΓêÆ 24. For a circularly polarized source (most favorable orientation), the smallest upper limit obtained isΓê╝ 1.5├ù 1 0ΓêÆ 25.", "num_citations": "42\n", "authors": ["10"]}
{"title": "Results of the deepest all-sky survey for continuous gravitational waves on LIGO S6 data running on the Einstein@ Home volunteer distributed computing project\n", "abstract": " We report results of a deep all-sky search for periodic gravitational waves from isolated neutron stars in data from the S6 LIGO science run. The search was possible thanks to the computing power provided by the volunteers of the Einstein@ Home distributed computing project. We find no significant signal candidate and set the most stringent upper limits to date on the amplitude of gravitational wave signals from the target population. At the frequency of best strain sensitivity, between 170.5 and 171 Hz we set a 90% confidence upper limit of 5.5├ù 10ΓêÆ 25, while at the high end of our frequency range, around 505 Hz, we achieve upper limitsΓëâ 10ΓêÆ 24. At 230 Hz we can exclude sources with ellipticities greater than 10ΓêÆ 6 within 100 pc of Earth with fiducial value of the principal moment of inertia of 10 38 kg m 2. If we assume a higher (lower) gravitational wave spin-down we constrain farther (closer) objects to higher┬áΓÇª", "num_citations": "41\n", "authors": ["10"]}
{"title": "Directional limits on persistent gravitational waves using data from Advanced LIGOΓÇÖs first two observing runs\n", "abstract": " We perform an unmodeled search for persistent, directional gravitational wave (GW) sources using data from the first and second observing runs of Advanced LIGO. We do not find evidence for any GW signals. We place limits on the broadband GW flux emitted at 25 Hz from point sources with a power law spectrum at F ╬▒, ╬ÿ<(0.05ΓÇô25)├ù 10ΓêÆ 8 erg cmΓêÆ 2 sΓêÆ 1 HzΓêÆ 1 and the (normalized) energy density spectrum in GWs at 25 Hz from extended sources at ╬⌐ ╬▒ (╬ÿ)<(0.19ΓÇô2.89)├ù 10ΓêÆ 8 srΓêÆ 1 where ╬▒ is the spectral index of the energy density spectrum. These represent improvements of 2.5ΓÇô3├ù over previous limits. We also consider point sources emitting GWs at a single frequency, targeting the directions of Sco X-1, SN 1987A, and the Galactic center. The best upper limits on the strain amplitude of a potential source in these three directions range from h 0<(3.6ΓÇô4.7)├ù 10ΓêÆ 25, 1.5├ù better than previous limits set with the┬áΓÇª", "num_citations": "39\n", "authors": ["10"]}
{"title": "Optically targeted search for gravitational waves emitted by core-collapse supernovae during the first and second observing runs of advanced LIGO and advanced Virgo\n", "abstract": " We present the results from a search for gravitational-wave transients associated with core-collapse supernovae observed within a source distance of approximately 20 Mpc during the first and second observing runs of Advanced LIGO and Advanced Virgo. No significant gravitational-wave candidate was detected. We report the detection efficiencies as a function of the distance for waveforms derived from multidimensional numerical simulations and phenomenological extreme emission models. The sources with neutrino-driven explosions are detectable at the distances approaching 5 kpc, and for magnetorotationally driven explosions the distances are up to 54 kpc. However, waveforms for extreme emission models are detectable up to 28 Mpc. For the first time, the gravitational-wave data enabled us to exclude part of the parameter spaces of two extreme emission models with confidence up to 83%, limited by┬áΓÇª", "num_citations": "37\n", "authors": ["10"]}
{"title": "Searches for continuous gravitational waves from 15 supernova remnants and Fomalhaut b with advanced LIGO\n", "abstract": " With the detections of several binary black hole mergers (Abbott et al. 2016b, 2016c, 2017e, 2017f, 2017g) and one binary neutron star merger (Abbott et al. 2017h) also seen in electromagnetic waves (Abbott et al. 2017i), Advanced LIGO and Virgo have spectacularly inaugurated the field of gravitational wave (GW) astronomy. While the binary neutron star merger has had farreaching implications for our knowledge of neutron star matter (Abbott et al. 2018b; De et al. 2018b), a continuous GW signal could teach us even moreΓÇönot just about bulk properties but about internal magnetic fields, the extent and strength of crystalline phases, and, potentially, other microphysics of extreme matter (Owen 2009; Glampedakis & Gualtieri 2018). Young isolated neutron stars are promising sources of continuous GWs. The spin-downs of young pulsars are rapid enough to include significant continuous GW emission, as shown by┬áΓÇª", "num_citations": "37\n", "authors": ["10"]}
{"title": "Comprehensive all-sky search for periodic gravitational waves in the sixth science run LIGO data\n", "abstract": " We report on a comprehensive all-sky search for periodic gravitational waves in the frequency band 100ΓÇô1500 Hz and with a frequency time derivative in the range of [ΓêÆ 1.18,+ 1.00]├ù 1 0ΓêÆ 8 Hz/s. Such a signal could be produced by a nearby spinning and slightly nonaxisymmetric isolated neutron star in our galaxy. This search uses the data from the initial LIGO sixth science run and covers a larger parameter space with respect to any past search. A Loosely Coherent detection pipeline was applied to follow up weak outliers in both Gaussian (95% recovery rate) and non-Gaussian (75% recovery rate) bands. No gravitational wave signals were observed, and upper limits were placed on their strength. Our smallest upper limit on worst-case (linearly polarized) strain amplitude h 0 is 9.7├ù 1 0ΓêÆ 25 near 169 Hz, while at the high end of our frequency range we achieve a worst-case upper limit of 5.5├ù 1 0ΓêÆ 24. Both cases┬áΓÇª", "num_citations": "37\n", "authors": ["10"]}
{"title": "First low frequency all-sky search for continuous gravitational wave signals\n", "abstract": " In this paper we present the results of the first low frequency all-sky search of continuous gravitational wave signals conducted on Virgo VSR2 and VSR4 data. The search covered the full sky, a frequency range between 20 and 128 Hz with a range of spin-down betweenΓêÆ 1.0├ù 10ΓêÆ 10 and+ 1.5├ù 10ΓêÆ 11 Hz/s, and was based on a hierarchical approach. The starting point was a set of short fast Fourier transforms, of length 8192 s, built from the calibrated strain data. Aggressive data cleaning, in both the time and frequency domains, has been done in order to remove, as much as possible, the effect of disturbances of instrumental origin. On each data set a number of candidates has been selected, using the FrequencyHough transform in an incoherent step. Only coincident candidates among VSR2 and VSR4 have been examined in order to strongly reduce the false alarm probability, and the most significant candidates┬áΓÇª", "num_citations": "36\n", "authors": ["10"]}
{"title": "Search for multimessenger sources of gravitational waves and high-energy neutrinos with advanced LIGO during its first observing run, ANTARES, and IceCube\n", "abstract": " We have entered the era of regular gravitational-wave (GW) discoveries. Since 2015, Advanced LIGO (Abadie et al. 2015) and Advanced Virgo (Acernese et al. 2015) have discovered GWs from multiple binary black hole mergers (Abbott et al. 2016a, 2017a, 2017b, 2017c) and a binary neutron star (BNS) merger (Abbott et al. 2017d, 2018a) during Advanced LIGO, s first two and Advanced Virgo, s first observing periods. The rate of detections is expected to significantly increase in upcoming observation periods (Abbott et al. 2018b). High-energy neutrinos carry information about hadronic acceleration in astrophysical phenomena, such as accreting black holes and supernovae (Halzen & Hooper 2002) and about the environment of the emission site (eg, Razzaque et al. 2003; Loeb & Waxman 2006; Bartos et al. 2012). Several high-energy neutrino observatories carry out joint searches with GW and electromagnetic┬áΓÇª", "num_citations": "34\n", "authors": ["10"]}
{"title": "Methods and results of a search for gravitational waves associated with gamma-ray bursts using the GEO 600, LIGO, and Virgo detectors\n", "abstract": " In this paper we report on a search for short-duration gravitational wave bursts in the frequency range 64 HzΓÇô1792 Hz associated with gamma-ray bursts (GRBs), using data from GEO 600 and one of the LIGO or Virgo detectors. We introduce the method of a linear search grid to analyze GRB events with large sky localization uncertainties, for example the localizations provided by the Fermi Gamma-ray Burst Monitor (GBM). Coherent searches for gravitational waves (GWs) can be computationally intensive when the GRB sky position is not well localized, due to the corrections required for the difference in arrival time between detectors. Using a linear search grid we are able to reduce the computational cost of the analysis by a factor of O (10) for GBM events. Furthermore, we demonstrate that our analysis pipeline can improve upon the sky localization of GRBs detected by the GBM, if a high-frequency GW signal is┬áΓÇª", "num_citations": "34\n", "authors": ["10"]}
{"title": "we must keep going i guess\n", "abstract": " Constraining the -ModeΓÇô-Mode Tidal Instability with GW170817 We analyze the impact of a proposed tidal instability coupling p modes and g modes within neutron stars on GW170817. This nonresonant instability transfers energy from the orbit of the binary to internal modes of the stars, accelerating the gravitational-wave driven inspiral. We model the impact of this instability on the phasing of the gravitational wave signal using three parameters per star: an overall amplitude, a saturation frequency, and a spectral index. Incorporating these additional parameters, we compute the Bayes factor (ln B! p g p g) comparing our pΓêÆ g model to a standard one. We find that the observed signal is consistent with waveform models that neglect pΓêÆ g effects, with ln B! p g p g= 0.0 3ΓêÆ 0.58+ 0.70 (maximum a posteriori and 90% credible region). By injecting simulated signals that do not include pΓêÆ g effects and recovering them with the pΓêÆ g model, we show that there is aΓëâ 50% probability of┬áΓÇª", "num_citations": "30\n", "authors": ["10"]}
{"title": "Revisiting a pre-inflationary radiation era and its effect on the CMB power spectrum\n", "abstract": " We revisit the scenario where inflation is preceded by a radiation era by considering that the inflaton too could have been in thermal equilibrium early in the radiation era. Hence we take into account not only the effect of a pre-inflationary era on the inflaton mode functions but also that of a frozen thermal distribution of inflaton quanta. We initially discuss in detail the issues relevant to our scenario of a pre-inflationary radiation dominated era and then obtain the scalar power spectrum for this scenario. We find that the power spectrum is free from infrared divergences. We then use the WMAP and Planck data to determine the constraints on the inflaton comoving'temperature'and on the duration of inflation. We find that the best fit value of the duration of inflation is less than 1 e-folding more than what is required to solve cosmological problems, while only an upper bound on the inflaton temperature can be obtained.", "num_citations": "29\n", "authors": ["10"]}
{"title": "Cosmological parameter estimation using particle swarm optimization\n", "abstract": " Constraining theoretical models, which are represented by a set of parameters, using observational data is an important exercise in cosmology. In Bayesian framework this is done by finding the probability distribution of parameters which best fits to the observational data using sampling based methods like Markov chain Monte Carlo (MCMC). It has been argued that MCMC may not be the best option in certain problems in which the target function (likelihood) poses local maxima or have very high dimensionality. Apart from this, there may be examples in which we are mainly interested to find the point in the parameter space at which the probability distribution has the largest value. In this situation the problem of parameter estimation becomes an optimization problem. In the present work we show that particle swarm optimization (PSO), which is an artificial intelligence inspired population based search procedure┬áΓÇª", "num_citations": "29\n", "authors": ["10"]}
{"title": "A fermi gamma-ray burst monitor search for electromagnetic signals coincident with gravitational-wave candidates in Advanced LIGO's first observing run\n", "abstract": " The first observing run (O1) of the Advanced LIGO detectors (Aasi et al. 2015) marked the dawn of gravitational wave (GW) astronomy with the groundbreaking discovery of merging black holes (BHs; Abbott et al. 2016e, 2016g) and Abbott et al.(2016b). The second observing run (O2) continued unveiling the population of binary BHs (BBHs; Abbott et al. 2017b, 2017c, 2017d), saw the addition of the Virgo observatory to the detector network (Abbott et al. 2017d), and culminated in the spectacular multimessenger observations of a binary neutron star (BNS) merger, summarized in Abbott et al.(2017e, 2017f). Simultaneously observing the same astrophysical event in both gravitational and electromagnetic radiation will continue to uniquely enrich our understanding of sources. Because GWs negligibly interact with matter they are directly encoded with information about the central engines of the most violent, dynamic┬áΓÇª", "num_citations": "28\n", "authors": ["10"]}
{"title": "Search for gravitational waves from Scorpius X-1 in the second Advanced LIGO observing run with an improved hidden Markov model\n", "abstract": " We present results from a semicoherent search for continuous gravitational waves from the low-mass x-ray binary Scorpius X-1, using a hidden Markov model (HMM) to track spin wandering. This search improves on previous HMM-based searches of LIGO data by using an improved frequency domain matched filter, the J-statistic, and by analyzing data from Advanced LIGOΓÇÖs second observing run. In the frequency range searched, from 60 to 650 Hz, we find no evidence of gravitational radiation. At 194.6 Hz, the most sensitive search frequency, we report an upper limit on gravitational wave strain (at 95% confidence) of h 0 95%= 3.47├ù 10ΓêÆ 25 when marginalizing over source inclination angle. This is the most sensitive search for Scorpius X-1, to date, that is specifically designed to be robust in the presence of spin wandering.", "num_citations": "27\n", "authors": ["10"]}
{"title": "All-sky search for long-duration gravitational-wave transients in the second Advanced LIGO observing run\n", "abstract": " We present the results of a search for long-duration gravitational-wave transients in the data from the Advanced LIGO second observation run; we search for gravitational-wave transients of 2ΓÇô500 s duration in the 24ΓÇô2048 Hz frequency band with minimal assumptions about signal properties such as waveform morphologies, polarization, sky location or time of occurrence. Signal families covered by these search algorithms include fallback accretion onto neutron stars, broadband chirps from innermost stable circular orbit waves around rotating black holes, eccentric inspiral-merger-ringdown compact binary coalescence waveforms, and other models. The second observation run totals about 118.3 days of coincident data between November 2016 and August 2017. We find no significant events within the parameter space that we searched, apart from the already-reported binary neutron star merger GW170817. We┬áΓÇª", "num_citations": "27\n", "authors": ["10"]}
{"title": "Search for transient gravitational waves in coincidence with short-duration radio transients during 2007ΓÇô2013\n", "abstract": " We present an archival search for transient gravitational-wave bursts in coincidence with 27 single-pulse triggers from Green Bank Telescope pulsar surveys, using the LIGO, Virgo, and GEO interferometer network. We also discuss a check for gravitational-wave signals in coincidence with Parkes fast radio bursts using similar methods. Data analyzed in these searches were collected between 2007 and 2013. Possible sources of emission of both short-duration radio signals and transient gravitational-wave emission include starquakes on neutron stars, binary coalescence of neutron stars, and cosmic string cusps. While no evidence for gravitational-wave emission in coincidence with these radio transients was found, the current analysis serves as a prototype for similar future searches using more sensitive second-generation interferometers.", "num_citations": "26\n", "authors": ["10"]}
{"title": "Search for gravitational-wave signals associated with gamma-ray bursts during the second observing run of Advanced LIGO and Advanced Virgo\n", "abstract": " Gamma-ray bursts (GRBs) are high-energy astrophysical transients originating throughout the universe that are observed more than once per day on average. The prompt gamma-ray emission is thought to emanate from highly relativistic jets powered by matter interacting with a compact central object such as an accreting black hole (BH) or a magnetar (Woosley 1993). Broadly speaking, GRBs are divided into two subpopulations based on duration and spectral hardness (Kouveliotou et al. 1993). Long-soft bursts generally have durations∩éë 2s. The favored model is the core-collapse supernova (SN) of a rapidly rotating massive star (Woosley & Bloom 2006; M├╢sta et al. 2015). This connection was observationally supported by the presence of SN∩éá 1998bw within the error box of the long GRB∩éá 980425 (Galama et al. 1998) and the later strong association of SN∩éá 2003dh with GRB∩éá 030329 (Hjorth et al. 2003; Stanek┬áΓÇª", "num_citations": "25\n", "authors": ["10"]}
{"title": "Search for transient gravitational-wave signals associated with magnetar bursts during Advanced LIGOΓÇÖs second observing run\n", "abstract": " So far, the Laser Interferometer Gravitational-Wave Observatory (LIGO; Aasi et al. 2015) and Virgo (Acernese et al. 2015) have reported detections of a handful of gravitationalwave (GW) signals from the coalescence of compact binary systems (Abbott et al. 2016a, 2016b, 2017b, 2017c, 2017d, 2017e). Isolated compact objects may also emit detectable GWs, though they are predicted to be much weaker than compact binary coalescences (Sathyaprakash & Schutz 2009). Because of the high energies and mass densities required to generate detectable GWs, neutron stars and supernovae are among the main targets of nonbinary searches. This paper focuses on a type of neutron star: magnetars. Magnetars are highly magnetized isolated neutron stars (Woods & Thompson 2006; Mereghetti et al. 2015). Originally classified as anomalous X-ray pulsars (AXPs), or soft gamma repeaters (SGRs), some AXPs have been┬áΓÇª", "num_citations": "22\n", "authors": ["10"]}
{"title": "Revisiting CMB constraints on warm inflation\n", "abstract": " We revisit the constraints that Planck 2015 temperature, polarization and lensing data impose on the parameters of warm inflation. To this end, we study warm inflation driven by a single scalar field with a quartic self interaction potential in the weak dissipative regime. We analyse the effect of the parameters of warm inflation, namely, the inflaton self coupling ╬╗ and the inflaton dissipation parameter Q P on the CMB angular power spectrum. We constrain ╬╗ and Q P for 50 and 60 number of e-foldings with the full Planck 2015 data (TT, TE, EE+ lowP and lensing) by performing a Markov-Chain Monte Carlo analysis using the publicly available code CosmoMC and obtain the joint as well as marginalized distributions of those parameters. We present our results in the form of mean and 68% confidence limits on the parameters and also highlight the degeneracy between ╬╗ and Q P in our analysis. From this analysis we┬áΓÇª", "num_citations": "22\n", "authors": ["10"]}
{"title": "All-sky search for long-duration gravitational wave transients in the first Advanced LIGO observing run\n", "abstract": " The first observing runs of the Advanced LIGO and Advanced Virgo detectors, with significant sensitivity improvements compared to the first generation detectors, yielded in less than two years incredible discoveries and major astrophysics results via gravitational wave (GW) detections. The first observed GW signals corresponded to the final moments of the coalescence of two stellar-mass black holes and their final plunge. GW150914 and GW151226 were observed with high confidence (> 5╧â), while LVT151012 was identified with a lower significance (1.7╧â)[1ΓÇô5] during the first observing run (O1). During the second observing run (O2), GW170104 and GW170814 (which was detected simultaneously by the three LIGO and Virgo detectors) have confirmed the estimated rate of stellar-mass black hole mergers [6, 7]. Lastly,", "num_citations": "21\n", "authors": ["10"]}
{"title": "Search of the Orion spur for continuous gravitational waves using a loosely coherent algorithm on data from LIGO interferometers\n", "abstract": " We report results of a wideband search for periodic gravitational waves from isolated neutron stars within the Orion spur towards both the inner and outer regions of our Galaxy. As gravitational waves interact very weakly with matter, the search is unimpeded by dust and concentrations of stars. One search disk (A) is 6.87 in diameter and centered on 2 0 h 1 0 m 54.7 1 s+ 3 3 3 3ΓÇ▓ 25.2 9ΓÇ▓ΓÇ▓, and the other (B) is 7.45 in diameter and centered on 8 h 3 5 m 20.6 1 sΓêÆ 4 6 4 9ΓÇ▓ 25.15 1ΓÇ▓ΓÇ▓. We explored the frequency range of 50ΓÇô1500 Hz and frequency derivative from 0 toΓêÆ 5├ù 10ΓêÆ 9 Hz/s. A multistage, loosely coherent search program allowed probing more deeply than before in these two regions, while increasing coherence length with every stage. Rigorous follow-up parameters have winnowed the initial coincidence set to only 70 candidates, to be examined manually. None of those 70 candidates proved to be┬áΓÇª", "num_citations": "20\n", "authors": ["10"]}
{"title": "Joint Planck and WMAP assessment of low CMB multipoles\n", "abstract": " The remarkable progress in cosmic microwave background (CMB) studies over past decade has led to the era of precision cosmology in striking agreement with the ╬¢CDM model. However, the lack of power in the CMB temperature anisotropies at large angular scales (low-Γäô), as has been confirmed by the recent Planck data also (up to 0Γäô= 4), although statistically not very strong (less than 3╧â), is still an open problem. One can avoid to seek an explanation for this problem by attributing the lack of power to cosmic variance or can look for explanations ie, different inflationary potentials or initial conditions for inflation to begin with, non-trivial topology, ISW effect etc. Features in the primordial power spectrum (PPS) motivated by the early universe physics has been the most common solution to address this problem. In the present work we also follow this approach and consider a set of PPS which have features and┬áΓÇª", "num_citations": "19\n", "authors": ["10"]}
{"title": "Maximum entropy deconvolution of primordial power spectrum\n", "abstract": " It is well known that cosmic microwave background (CMB) temperature anisotropies and polarization can be used to probe the metric perturbations in the early universe. Presently, there exists no observational detection of tensor modes of primordial metric perturbations or of primordial non-Gaussianity. In such a scenario, the primordial power spectrum of scalar metric perturbations is the only correlation function of metric perturbations (presumably generated during inflation) whose effects can be directly probed through various observations. To explore the possibility of any deviations from the simplest picture of the era of cosmic inflation in the early universe, it thus becomes extremely important to uncover the amplitude and shape of this correlation sufficiently well. In the present work, we attempt to reconstruct the primordial power spectrum of scalar metric perturbations using the binned (uncorrelated) CMB┬áΓÇª", "num_citations": "18\n", "authors": ["10"]}
{"title": "Search for continuous gravitational waves from neutron stars in globular cluster NGC 6544\n", "abstract": " We describe a directed search for continuous gravitational waves in data from the sixth initial LIGO science run. The target was the nearby globular cluster NGC 6544 at a distance ofΓëê 2.7 kpc. The search covered a broad band of frequencies along with first and second frequency derivatives for a fixed sky position. The search coherently integrated data from the two LIGO interferometers over a time span of 9.2 days using the matched-filtering F-statistic. We found no gravitational-wave signals and set 95% confidence upper limits as stringent as 6.0├ù 10ΓêÆ 25 on intrinsic strain and 8.5├ù 10ΓêÆ 6 on fiducial ellipticity. These values beat the indirect limits from energy conservation for stars with characteristic spin-down ages older than 300 years and are within the range of theoretical predictions for possible neutron-star ellipticities. An important feature of this search was use of a barycentric resampling algorithm which┬áΓÇª", "num_citations": "16\n", "authors": ["10"]}
{"title": "Quality evaluation of Yaqona (Piper methysticum) in Fiji\n", "abstract": " Quality evaluation of yaqona (Piper methysticum) in Fiji FAO_logo home-icon English Espa├▒ol Fran├ºais ╪º┘ä╪╣╪▒╪¿┘è╪⌐ Σ╕¡µûç ╨á╤â╤ü╤ü╨║╨╕╨╣ home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 2013 Volume : 43 Issue : 1 Start Page : 1 End Page : 8 All titles : \" Quality evaluation of yaqona (Piper methysticum) in Fiji \" \" Quality evaluation of yaqona (Piper methysticum) in Fiji [Adulteration of powdered material used for national beverage] \" Save as: AGRIS_AP RIS EndNote(XML) Quality evaluation of yaqona (Piper methysticum) in Fiji Loading... Paper Written Paper Quality evaluation of yaqona (Piper methysticum) in Fiji [1981] Duve, RN Prasad, J. Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Access the full text NOT AVAILABLE Lookup at Google Scholar google-.ΓÇª", "num_citations": "15\n", "authors": ["10"]}
{"title": "Effects of the size of cosmological N-body simulations on physical quantities ΓÇô III. Skewness\n", "abstract": " N-body simulations are an important tool in the study of formation of large-scale structures. Much of the progress in understanding the physics of galaxy clustering and comparison with observations would not have been possible without N-body simulations. Given the importance of this tool, it is essential to understand its limitations as ignoring these can easily lead to interesting but unreliable results. In this paper, we study the limitations due to the finite size of the simulation volume. In an earlier work, we proposed a formalism for estimating the effects of a finite box size on physical quantities and applied it to estimate the effect on the amplitude of clustering, mass function. Here, we extend the same analysis and estimate the effect on skewness and kurtosis in the perturbative regime. We also test the analytical predictions from the earlier work as well as those presented in this paper. We find good agreement between┬áΓÇª", "num_citations": "13\n", "authors": ["10"]}
{"title": "Erratum:ΓÇ£First Search for Gravitational Waves from Known Pulsars with Advanced LIGOΓÇ¥(2017, ApJ, 839, 12)\n", "abstract": " The American Astronomical Society (AAS), established in 1899 and based in Washington, DC, is the major organization of professional astronomers in North America. Its membership of about 7,000 individuals also includes physicists, mathematicians, geologists, engineers, and others whose research and educational interests lie within the broad spectrum of subjects comprising contemporary astronomy. The mission of the AAS is to enhance and share humanity's scientific understanding of the universe.", "num_citations": "12\n", "authors": ["10"]}
{"title": "Constraints on just enough inflation preceded by a thermal era\n", "abstract": " If the inflationary era is preceded by a radiation-dominated era in which the inflaton too was in thermal equilibrium at some very early time, then the CMB data places an upper bound on the comoving temperature of the (decoupled) inflaton quanta. In addition, if one considers models of ΓÇ£just enoughΓÇ¥ inflation, where the number of e-foldings of inflation is just enough to solve the horizon and flatness problems, then we get a lower bound on the Hubble parameter during inflation, H inf, which is in severe conflict with the upper bound from tensor perturbations. Alternatively, imposing the upper bound on H inf implies that such scenarios are compatible with the data only if the number of relativistic degrees of freedom in the thermal bath in the preinflationary Universe is extremely large (greater than 10 9 or 10 11). We are not aware of scenarios in which this can be satisfied.", "num_citations": "11\n", "authors": ["10"]}
{"title": "Pectin and oil from passion fruit waste.\n", "abstract": " see more details. The production figures for 1977, 1978 and 1979 were 225, 368 and 460 tons, respectively. The fruit is composed of 46% rind and 11% seed, both of which were hitherto regarded as factory waste. However, they can be utilized properly by extracting 2.4% pectin of fair commercial value from the rind and 23% edible oil from the seed. The oil has chemical and physical parameters very close to those of safflower safflower Subject Category: Commodities and Products", "num_citations": "11\n", "authors": ["10"]}
{"title": "Detection of fast transients with radio interferometric arrays\n", "abstract": " Next-generation radio arrays, including the Square Kilometre Array (SKA) and its pathfinders, will open up new avenues for exciting transient science at radio wavelengths. Their innovative designs, comprising a large number of small elements, pose several challenges in digital processing and optimal observing strategies. The Giant Metre-wave Radio Telescope (GMRT) presents an excellent test-bed for developing and validating suitable observing modes and strategies for transient experiments with future arrays. Here we describe the first phase of the ongoing development of a transient detection system for GMRT that is planned to eventually function in a commensal mode with other observing programs. It capitalizes on the GMRT's interferometric and sub-array capabilities, and the versatility of a new software backend. We outline considerations in the plan and design of transient exploration programs with┬áΓÇª", "num_citations": "10\n", "authors": ["10"]}
{"title": "Gravitational collapse in an expanding background and the role of substructureΓÇôII. Excess power at small scales and its effect on collapse of structures at larger scales\n", "abstract": " We study the interplay of clumping at small scales with the collapse and relaxation of perturbations at larger scales using N-body simulations. We quantify the effect of collapsed haloes on perturbations at larger scales using the two-point correlation function, moments of counts in cells and the mass function. The purpose of the study is twofold and the primary aim is to quantify the role played by collapsed low-mass haloes in the evolution of perturbations at large scales; this is in view of the strong effect seen when the large scale perturbation is highly symmetric. Another reason for this study is to ask whether features or a cut-off in the initial power spectrum can be detected using measures of clustering at scales that are already non-linear. The final aim is to understand the effect of ignoring perturbations at scales smaller than the resolution of N-body simulations. We find that these effects are ignorable if the scale┬áΓÇª", "num_citations": "10\n", "authors": ["10"]}
{"title": "Gravitational collapse in an expanding background and the role of substructureΓÇôI. Planar collapse\n", "abstract": " We study the interplay of clumping at small scales with the collapse and relaxation of perturbations at much larger scales. We present results of our analysis when the large-scale perturbation is modelled as a plane wave. We find that in the absence of substructure, collapse leads to formation of a pancake with multistream regions. Dynamical relaxation of the plane wave is faster in the presence of substructure. Scattering of substructures and the resulting enhancement of transverse motions of haloes in the multistream region lead to a thinner pancake. In turn, collapse of the plane wave leads to formation of more massive collapsed haloes as compared to the collapse of substructure in the absence of the plane wave. The formation of more massive haloes happens without any increase in the total mass in collapsed haloes. A comparison with the Burgers equation approach in the absence of any substructure┬áΓÇª", "num_citations": "9\n", "authors": ["10"]}
{"title": "Open sun drying of tinospora cordifolia, Curcuma longa L. and zingiber officinale. Thermal analysis\n", "abstract": " Open sun drying is a common method of drying of agricultural products in developing                 countries. Despite having several disadvantages, it is widely practised because it                 is a very simple way of drying. Tinospora cordifolia (a type of herb),                     Curcuma longa L. and Zingiber officinale (spices) were dried                 in the open sun and determined thermal parameters like product temperature,                 temperature around the product surface and rate of moisture transfer. The drying                 time for Tinospora cordifolia, Curcuma longa L. and Zingiber                 officinale were 41, 43 and 45 sunshine hours respectively with average solar                 radiation of 10.8MJ/m2. Convective heat transfer coefficient (hc) for Tinospora cordifolia, Curcuma longa L. and                     Zingiber officinale were 1.57-3.85W/m2┬░C,                 2.32-3.42W/m2┬░C and 1.62-3.34W/m2┬░C                 respectively, and increased by┬áΓÇª", "num_citations": "8\n", "authors": ["10"]}
{"title": "Extracting the effective contact rate of COVID-19 pandemic\n", "abstract": " In the absence of any available vaccines or drugs, prevention of the spread of Coronavirus Disease 2019 (COVID-19) pandemic is being achieved by putting many mitigation measures in place. It is indispensable to have robust and reliable ways of evaluating the effectiveness of these measures. In this work, we assume that, at a very coarse-grained level of description, the overall effect of all the mitigation measures is that we can still describe the spread of the pandemic using the most basic Susceptible-Exposed-Infectious-Removed ($SEIR$) model but with an \"effective contact rate\" ($\\beta$) which is time-dependent. We then use the time series data of the number of infected individuals in the population to extract the instantaneous effective contact rate which is the result of various social interventions put in place. This approach has the potential to be significantly useful while evaluating the impact of mitigation measures on the spread of COVID-19 in near future.", "num_citations": "7\n", "authors": ["10"]}
{"title": "Efficacy of Extraction of Constituents in the Preparation of Yaqona Beverage, Part 2: Major Active Constituents\n", "abstract": " Yaqona (Piper methysticum) beverage, the national drink of Fiji, prepared by straining 100 g of powdered material through muslin cloth using 3 litres of water gave average extractions of 76.1%, 89.3%, 79.9% and 85.5% of major active constituents in the root, powdered root, basal stem, and powdered basal stem preparations, respectively, with the overall extraction being 82. 7%. In the above method of preparation a\" standard bowl\" of 100 ml of yaqona beverage prepared from roots, powdered roots, basal stems, contained 247.0 mg, 223.1 mg, 136.1 mg, and 100.0 mg of total major active constituents, respectively.", "num_citations": "5\n", "authors": ["10"]}
{"title": "A data first approach to modelling Covid-19\n", "abstract": " The primary data for Covid-19 pandemic is in the form of time series for the number of confirmed, recovered and dead cases. This data is updated every day and is available for most countries from multiple sources. In this work we present a two step procedure for model fitting to Covid-19 data. In the first step, time dependent transmission coefficients are constructed directly from the data and, in the second step, measures of those (minimum, maximum, mean, median etc.,) are used to set priors for fitting models to data. We call this approach  a \"data driven approach\" or \"data first approach\". This scheme is complementary to Bayesian approach and can be used with or without that for parameter estimation.  We  use the procedure to fit a set of SIR and SIRD models, with time dependent contact rate, to Covid-19 data for a set of 45 most affected countries. We  find  that SIR and SIRD models with constant transmission coefficients cannot fit  Covid-19 data for most countries (mainly because social distancing, lockdown etc., make those time dependent). We find that any time dependent contact rate, which falls gradually with time, can help to fit SIR and SIRD models for most of the countries. We also present constraints on transmission coefficients and basic reproduction number R0~ as well as effective reproduction number R(t).  The main contributions  of our work are as follows. (1) presenting  a two step procedure for model fitting to Covid-19 data (2)  constraining  transmission coefficients as well as R0~ and R(t), for a set of most affected countries  and (3) releasing a python package PyCov19 that can used to  fit a set of compartmental models with time┬áΓÇª", "num_citations": "4\n", "authors": ["10"]}
{"title": "Processing of turmeric.\n", "abstract": " see more details, boiling, boiling in 5% brine, and cutting into halves, and 2 methods of drying were studied for the preparation of turmeric turmeric Subject Category: Commodities and Products", "num_citations": "4\n", "authors": ["10"]}
{"title": "Drug prescribing pattern in pregnancy in a secondary care hospital in south India: a retrospective study\n", "abstract": " BackgroundIn pregnancy drug treatment presents a special concern due potential teratogenic effects and physiologic alterations in mother. This retrospective study was performed to evaluate the drug prescribing pattern in pregnancy among pregnant women in a secondary care hospital in India.Materials and methodsThis cross-sectional retrospective study was done for 3 months using pre-formatted forms and patientΓÇÖs records.ResultsA total of 326 drugs, including 46 different types of drugs, were prescribed to 606 gravid women. Eight different types of medications were started before being seen at the antenatal clinic. Most of these drugs fall under US FDA pregnancy categories B and C and few under categories A, X and N.ConclusionThis study reflects a good, safe and rational medication practice during pregnancy in various common disorders in a secondary care hospital and can be cited as an example to┬áΓÇª", "num_citations": "3\n", "authors": ["10"]}
{"title": "Effect of Sulphur Levels on Mustard (Brassiaca juncea) yield in Muzaffarpur District of Bihar: Application of Sulphur to Achieve Better Performance of Mustard Under┬áΓÇª\n", "abstract": " Application of varying sulphur levels to optimize its dose to achieve better performance of mustard (Brassica juncea) under participatory research mode in Muzaffarpur district of North Bihar", "num_citations": "2\n", "authors": ["10"]}
{"title": "Characterizing the diffuse foreground for redshifted 21-cm HI signal: GMRT 153 MHz observation\n", "abstract": " Detailed knowledge of the foreground structure on the angular scales of~ 1 to sub-arcminute will be essential for extracting the redshifted 21-cm HI signal from the observed data. We have presented results from the GMRT observations at 153 MHz, which was used to characterize the statistical properties of the diffuse radiation, using the multi-frequency angular power spectrum, across sub-degree angular scales. We have detected fluctuations in the diffuse emission on angular scales greater than 10'in a low galactic latitude area. The total intensity angular spectrum shows a power-law behaviour, while the detection of diffuse emission at smaller angular scales is limited by residual point sources. Also, we have estimated the level of foreground contamination.", "num_citations": "2\n", "authors": ["10"]}
{"title": "Effects of the size of cosmological N-body simulations on physical quantitiesΓÇöII: Halo formation and destruction rate\n", "abstract": " In this study we show how errors due to finite box size affect formation and the destruction rate for haloes in cosmological N-body simulations. In an earlier study we gave an analytic prescription of finding the corrections in the mass function. Following the same approach, in this paper we give analytical expressions for corrections in the formation rate, destruction rate and the rate of change in comoving number density, and compute their expected values for the power law (n = ΓêÆ2) and LCDM models.", "num_citations": "2\n", "authors": ["10"]}
{"title": "Selection parameters for yield in papaya\n", "abstract": " Estimates of direct selection parameters i.e. heritability and genetic advance in per cent of mean were studied for 10 characters of 28 crosses obtained in F1 generation. High h2n coupled with moderate to high G.S.% was recorded for fruiting height, average weight of fruit, fruit yield, T.S.S. and total sugars; while high H2n coupled with low GS% for number of fruits per plant and low h2n coupled with low G.S.% for plant girth and days to first flowering were observed. Thus, selection for all the traits except plant girth, days to first flowering and depth of fruit setting would be most amenable selection criterias for improvement of papaya having higher yield potential and better fruit quality.", "num_citations": "2\n", "authors": ["10"]}
{"title": "Extranatural inflation redux\n", "abstract": " The success of a given inflationary model crucially depends upon two features: its predictions for observables such as those of the cosmic microwave background (CMB) and its insensitivity to the unknown UV physics such as quantum gravitational effects. Extranatural inflation is a well-motivated scenario that is insensitive to UV physics by construction. In this five-dimensional model, the fifth dimension is compactified on a circle, and the zero mode of the fifth component of a bulk U (1) gauge field acts as the inflaton. In this work, we study simple variations of the minimal extranatural inflation model in order to improve its CMB predictions while retaining its numerous merits. We find that it is possible to obtain CMB predictions identical to those of, eg, the R+ R 2 Starobinsky model of inflation and show that this can be done in the most minimal way by having two additional light fermionic species in the bulk, with the same┬áΓÇª", "num_citations": "1\n", "authors": ["10"]}
{"title": "Multi-messenger observations of a binary neutron star merger\n", "abstract": " On 2017 August 17 a binary neutron star coalescence candidate (later designated GW170817) with merger time 12: 41: 04 UTC was observed through gravitational waves by the Advanced LIGO and Advanced Virgo detectors. The Fermi Gamma-ray Burst Monitor independently detected a gamma-ray burst (GRB 170817A) with a time delay of 1.7 s~ with respect to the merger time. From the gravitational-wave signal, the source was initially localized to a sky region of 31 deg2 at a luminosity distance of 40 8 8-+ Mpc and with component masses consistent with neutron stars. The component masses were later measured to be in the range 0.86 to 2.26 M∩üÑ. An extensive observing campaign was launched across the electromagnetic spectrum leading to the discovery of a bright optical transient (SSS17a, now with the IAU identification of AT 2017gfo) in NGC 4993 (at 40 Mpc~) less than 11 hours after the merger by the One-Meter, Two Hemisphere (1M2H) team using the 1 m Swope Telescope. The optical transient was independently detected by multiple teams within an hour. Subsequent observations targeted the object and its environment. Early ultraviolet observations revealed a blue transient that faded within 48 hours. Optical and infrared observations showed a redward evolution overΓê╝ 10 days. Following early non-detections, X-ray and radio emission were discovered at the transientΓÇÖs position 9~ and 16~ days, respectively, after the merger. Both the X-ray and radio emission likely arise from a physical process that is distinct from the one that generates the UV/optical/near-infrared emission. No ultra-high-energy gamma-rays and no neutrino┬áΓÇª", "num_citations": "1\n", "authors": ["10"]}
{"title": "Erratum: Cosmological parameter estimation using particle swarm optimization [Phys. Rev. D 85, 123008 (2012)]\n", "abstract": " In order to highlight the fact that particle swarm optimization (PSO) particles are attracted towards the Pbest and Gbest, we wrote (Xi (t)ΓêÆ Pi) and (Xi (t)ΓêÆ G) in place of (PiΓêÆ Xi (t)) and (GΓêÆ Xi (t)), respectively, in Eqs.(6) and (7) of the paper. However, we forgot to put an extra minus (ΓêÆ) sign before these factors so that these equations could become consistent with the correct equation,", "num_citations": "1\n", "authors": ["10"]}
{"title": "Studies on sex-inheritance of papaya hybrids (carica papaya L.)\n", "abstract": " Papaya is an important fruit of tropical and subtropical regions of the world. Its cultivation is besieged with several limitations including variable sex-forms. Since papaya is a highly cross-pollinated and sexually propagated plant, it exhibits wide variability in vigour, sex-forms, bearing potentiality and fruit quality. Sex-inheritance in papaya is determined as polygamous, which is polygenically controlled and influenced by invironmental factors. The sex-ratio in segregating population is the result of interaction of three allelic genes (Gammie and Patwardhan, 1; Hofmeyr, 3; Storey, Ie; Ram and Majumder, 7). The combination of these genetic factors through hybridization may attribute to heterotic effect on expression of stable sex and yield components. The present breeding work involving intervarietal hybridization was initiated to study the extent of sex-inheritance and understanding the crossability among certain parental┬áΓÇª", "num_citations": "1\n", "authors": ["10"]}