{"title": "A comparison of software effort estimation techniques: Using function points with neural networks, case-based reasoning and regression models\n", "abstract": " Estimating software development effort remains a complex problem attracting considerable research attention. Improving the estimation techniques available to project managers would facilitate more effective control of time and budgets in software development. This paper reviews a research study comparing three estimation techniques using function points as an estimate of system size. The models considered are based on regression analysis, artificial neural networks and case-based reasoning. Although regression models performed poorly on the data set of 299 projects, both artificial neural networks and case-based reasoning appeared to have value for software development effort estimation models. Case-based reasoning in particular is appealing because of its similarity to expert judgment approaches and for its potential as an expert assistant in support of human judgment.", "num_citations": "395\n", "authors": ["1148"]}
{"title": "Analyse statistique de la productivitie des projects informatique a partie de la technique des point des function\n", "abstract": " CiNii 論文 - Analyse statistique de la productivitie des projects informatique a partie de la technique des point des function CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の 論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について Analyse statistique de la productivitie des projects informatique a partie de la technique des point des function DESHARNAIS JM 被引用文献: 1件 著者 DESHARNAIS JM 収録刊行物 Masters Thesis University of Montreal Masters Thesis University of Montreal, 1989 被引用文献: 1件中 1-1件を 表示 1 類似プロジェクトを用いた工数予測方法の性能比較 角田 雅照 , 柿元 健 , 大杉 直樹 , 門田 暁人 , 松本 健一 電子情報通信学会技術研究報告. SS, ソフトウェアサイエンス 105(331), 45-50, …", "num_citations": "161\n", "authors": ["1148"]}
{"title": "Estimating software development effort with case-based reasoning\n", "abstract": " Software project effort estimation is a difficult problem complicated by a variety of interrelated factors. Current regression-based models have not had much success in accurately estimating system size. This paper describes a case based reasoning approach to software estimation which performs somewhat better than regression models based on the same data and which has some similarity to human expert judgement approaches. An analysis is performed to determine whether different forms of averaging and adaptation improve the overall quality of the estimate.", "num_citations": "56\n", "authors": ["1148"]}
{"title": "Measuring ALL the Software not just what the Business Uses\n", "abstract": " Outsourcing Information Technology’s (IT) software development and maintenance activities has become increasingly popular as a means of enabling an organisation to more effectively focus on their core business activities.The high cost and risk associated with these IT outsourcing contracts means that they need to be carefully monitored and managed. Both the client and the supplier need to establish a means by which the client’s software assets can be quantified and the supplier’s performance can be evaluated and compared to agree targets. The most common mechanism for providing these performance measurements is to measure the supplier’s productivity rates in units of software product delivered per unit effort or units of software product delivered per unit cost.", "num_citations": "24\n", "authors": ["1148"]}
{"title": "APPLICATION DE LA MESURE FONCTIONNELLE COSMIC-FFP: UNE APPROCHE COGNITIVE\n", "abstract": " Cette thèse porte sur l’application de la mesure fonctionnelle ISO 19761: 2002 (COSMICFFP)[3, 4]. Appliquer une mesure fonctionnelle à un logiciel veut dire mettre en correspondance les artefacts du logiciel à mesurer avec les règles2 de la méthode de mesure. Cette tâche est complexe et demande au mesureur une expertise qu’il acquiert, via des connaissances en génie logiciel et en mesure ainsi que par la pratique de la mesure.Cette thèse décrit, entre autres, la démarche du mesureur, ce qui n’a jamais été fait à notre connaissance dans d’autres travaux de recherche et n’a jamais, de plus, été analysée systématiquement et encore moins traitée dans le cadre d’une approche cognitive. À ce titre, c'est une recherche de type exploratoire. Pour appliquer une mesure fonctionnelle, le mesureur utilise ses connaissances (en mesure fonctionnelle, mais aussi en génie logiciel) ainsi que des informations sur les documents ou les artefacts décrivant le logiciel. Cette démarche est difficilement automatisable puisque les sources d’information ont un formalisme très varié en plus de nécessiter, assez souvent, des interviews avec le personnel de développement ou de production du logiciel. Nous faisons l’hypothèse qu’un système à base de connaissances pourrait aider le personnel de la mesure à acquérir et à maintenir les connaissances nécessaires à la mesure fonctionnelle des logiciels.", "num_citations": "17\n", "authors": ["1148"]}
{"title": "Statistical analysis on the productivity of data processing with development projects using the function point technique\n", "abstract": " The objective of this thesis was to determine whether it is possible to use the Function Point technique developed by Albrecht as the basis for a cost-estimating model for development projects in the field of management information services (MIS).", "num_citations": "15\n", "authors": ["1148"]}
{"title": "Implementing a measurement program in software maintenance–an experience report based on basili’s approach\n", "abstract": " Software maintenance refers to all those activities, both technical and managerial, that take place after a software product becomes operational. Software maintenance is an area of vital importance to industry since most organizations now have a major application portfolio that supports their business operations. Software maintenance ensures that these applications continue to meet organizational and business objectives in an effective way, thereby keeping the organization competitive. Some studies have been published on the workload distribution of maintenance activities. However, most of these studies are founded on surveys (Lientz and Swanson, 1980; Ball, 1987 and Dekleva, 1990), and few are based on actual collected data (Abran and Nguyenkim, 1993). The principal reason for this lack of published data is that the industry does not measure or collect maintenancetype data in a timely and accurate …", "num_citations": "12\n", "authors": ["1148"]}
{"title": "Reassessing function points\n", "abstract": " Accurate estimation of the size and development effort for software projects requires estimation models which can be used early enough in the development life cycle to be of practical value. Function Point Analysis (FPA) has become possibly the most widely used estimation technique in practice. However the technique was developed in the data processing environment of the 1970's and, despite undergoing considerable reassessment and formalisation, still attracts criticism for the weighting scoring it employs and for the way in which the function point score is adapted for specific system characteristics. This paper reviews the validity of the weighting scheme and the value of adjusting for system characteristics by studying their effect in a sample of 299 software developments. In general the value adjustment scheme does not appear to cater for differences in productivity. The weighting scheme used to adjust system components in terms of being simple, average or complex also appears suspect and should be redesigned to provide a more realistic estimate of system functionality.", "num_citations": "11\n", "authors": ["1148"]}
{"title": "Validation Process in Software Engineering: An example with Function Point\n", "abstract": " Benchmarking1 studies based on actual data supplied by many industrial sites require two types of validation: validation of the collection process as well as validation of the data supplied to the researchers. The former validation will be referred to as a priori validation and the later one as a posteriori validation. The a priori validation will review all the steps and procedures of the data collection process within benchmarking data. The a posteriori validation will establish the degree of quality of the data collected and, wherever required, will eliminate from the comparative studies the data deemed not reliable. Both types of validation are required to ensure the quality and the integrity of the data for meaningful benchmarking studies in software engineering due the current immaturity of both software metrics and software engineering processes at industrial sites as assessed the maturity model developed by the …", "num_citations": "8\n", "authors": ["1148"]}
{"title": "Validation Process for Industry Benchmarking Data\n", "abstract": " Validation Process for Industry Benchmarking Data | Proceedings of the Conference on Software Maintenance ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsICSM '93Validation Process for Industry Benchmarking Data ARTICLE Validation Process for Industry Benchmarking Data Share on Author: Jules Marc Desharnais profile image Jean-Marc Desharnais View Profile Authors Info & Affiliations Publication: ICSM '93: Proceedings of the Conference on Software MaintenanceSeptember 1993 Pages 371–372 0citation 0 Downloads Metrics Total Citations0 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get Citation …", "num_citations": "8\n", "authors": ["1148"]}
{"title": "Comparison between FPA and FFP: a field experience\n", "abstract": " A requirement for software productivity analysis and estimation is the ability to measure the size of a software product, from a functional perspective rather than from a technical perspective. One example of such a functional size measurement (FSM) technique is Function Point Analysis (FPA)[2]. FPA is now widely used in the MIS domain, where it has become the ‘de facto’ standard in the industry. However, FPA has not had the same acceptance in other domains, such as real-time software. A new technique was proposed by the University of Quebec in Montreal (UQAM) and the Software Engineering Laboratory in Applied Metrics (SELAM) to extend the functional measure to real-time software. The new technique is called Full Function Points.               This article reports on a practical research undertaken in a telecommunications company which compared 5 major applications in the real-time and MIS …", "num_citations": "6\n", "authors": ["1148"]}
{"title": "Functional size measurement patterns: A proposed approach\n", "abstract": " This paper introduces the concepts of functional size measurement (FSM) patterns. These FSM patterns apply to the COSMIC FSM method and may help in solving several issues, such as being able to do an early sizing for estimation, helping inexperienced measurers in learning how to apply the COSMIC method by establishing the relationship between the method rules and the measurement results, avoiding measurement errors, and reducing measurement effort. The approach used to define FSM patterns is Design Science Research. This paper explores the motivation factors, defines the objectives of the solution, and describes the design and development of FSM patterns. FSM patterns can be defined for a portion of a functional process, a single functional process type, a set of functional process types having a main data group - or object of interest - as their common starting point, or a large set of functional …", "num_citations": "5\n", "authors": ["1148"]}
{"title": "The Strengths and Weaknesses of Functional Measure as a Good Negotiation Tool for New Development Projects\n", "abstract": " The user/contractor negotiations when constructing a software application are not easy. Many factors need to be considered (cost, product deliver, technical issues, competition, risk, etc.). In this article our focus is on the delivery of the product through the different phases of a project, using functional measure. To follow a product though different phases, a measure that can cope with preliminary requirements must be used. So, functional measure is preferable to lines of code (1). But lines of code are not totally eliminated. Some have used FPA (Function Point Analysis) to predict lines of code (1, 2) or to predict FPA from lines of code (backfire)(3). However there has been very little study, to our knowledge, that analyses the performance of FPA as a predictor, from the user requirements through to the implementation of the software (2).The following article relates our experiences measuring, at different project phases (early, intermediary and final), two software development projects using different methodologies for counting and validating function points. We found that it was necessary to consider different types of users when counting software, not only the end user. What one user could see as technical could be seen as a functional requirement by another. This challenges the common view about what functional measure is measuring. In both projects a report generator was seen as the solution for the many reports identified in the requirements. This resulted in a lower number of function points. Other less obvious infrastructure processes were constructed to improve the quality of the product. We were not able to do the count of those processes …", "num_citations": "2\n", "authors": ["1148"]}
{"title": "New Methods for Measuring Function Points in Outsourcing Contracts\n", "abstract": " Function Point Analysis (FPA) is used by organisations worldwide as one of the measures used to establish the baseline size of their software assets in outsourcing contracts. This paper introduces new techniques, which enable all the functionality delivered and worked on by the supplier to be included in the productivity performance monitoring of these contracts. Typically only the business applications layer can be measured using FPA. The infrastructure software eg Utilities, device drivers and gateway applications, are usually overlooked because FPA is not designed to, nor easily adapted to, measuring internal layers of functions not delivered to the business user. This new Full Function Point Technique, developed by the University of Quebec in Montreal and SELAM, is a refinement of the FPA technique. It is no longer limited to only measuring MIS type applications but was specifically designed to meet the needs of organisations that build and support infrastructure applications and real-time and embedded software.", "num_citations": "1\n", "authors": ["1148"]}