{"title": "Intermediary objects as a means to foster co-operation in engineering design\n", "abstract": " In this paper we argue that co-operation is aparticular way to co-ordinate an industrialactivity and that it is particularly suited tocollaborative design activity. Through a welldocumented case study of the development of afront truck axle, we point out several keyfeatures of co-operation in an industrialsetting. We particularly pay attention to theinterfaces between the actors involved in thecollaborative process. We observed thepre-eminence of the representations and theobjects created, manipulated, and finally weclaim that they support knowledge creation andtherefore allow the development of a commonunderstanding of the design situation (i.e. theproblem and the solution). We propose theconcept of ``intermediary object'' as aconceptual framework for the involvement ofobjects in the design process. We demonstratethe power of this concept in the analysis andmodelling of particular design situations andin …", "num_citations": "359\n", "authors": ["864"]}
{"title": "A co-operation framework for product–process integration in engineering design\n", "abstract": " Many different studies have stressed the importance of co-operation in engineering design. This paper is based on an empirical study carried out over 18 months and based on fieldwork where the researcher worked in a design team as a mechanical engineer. The question of product–process integration is particularly critical in mechanical engineering and requires the development of specific co-operative procedures. Our results stress the importance of artefacts as intermediary objects in the design process and more specifically in the development of co-operative processes. We developed a framework centred on three conceptual levels:•At product level, where we developed specific artefacts within a CAD environment, referred to herein as co-operating features,•At organisation level, where we stress the importance of developing organisational learning and a new interface role,•At actor level, where we stress the …", "num_citations": "160\n", "authors": ["864"]}
{"title": "The role of objects in design co-operation: communication through physical or virtual objects\n", "abstract": " This special issue concentrates on the role of objects in design communication. We use a wide definition of the term object to encompass all sorts of physical and electronic artefacts, that can convey meaning in interpersonal communication, but have an existence beyond a single act of communication. These can include sketches, technical drawings, and computer models, as well as mock-ups and previous products. Researchers have for a long time been aware of the importance of representations and reference points in the generation and representation of designs, and have often studied particular types of representation, for example sketching (see Purcell and Gero, 1998, for an overview of research on the role of sketching in design). Designs are strongly influenced by the representations in which they are expressed. However in research on design communication the role of objects has sometimes been …", "num_citations": "125\n", "authors": ["864"]}
{"title": "Characterization of collaborative design and interaction management activities in a distant engineering design situation\n", "abstract": " This paper presents an empirical research to study synchronous and asynchronous collaborative design in a technology-mediated situation. In this experiment we wanted to create a design situation where four distant designers had to communicate using commercial software and standard hardware configurations. Our methodological approach gave us the opportunity to examine two main lines of research questions concerning: (1) the specificities of technology-mediated design meetings that contrast to those of face-to-face design meetings; (2) the differences between synchronous and asynchronous collaborative work in mediated design engineering situations. Our approach stresses on some important aspects related to the management of the synchronous activity in a distant mediated situation. The originality of the approach relies on the hybrid characterization of both solution and problem management on one hand, and activity management (e.g. speech turns, meeting agenda) on the other hand.", "num_citations": "84\n", "authors": ["864"]}
{"title": "User-defined annotations: artefacts for co-ordination and shared understanding in design teams\n", "abstract": " Annotation is a natural way for adding information to a specific representation. Most of the time these annotations remain informal and are considered as mere supports to a verbal exchange. We want to show in this paper that it is important to consider annotation as complex and composite elements that can play a central role in design co-operation. Relying on a strong empirical background especially based on ethnographic research and software developments in the truck manufacturing industry, we argue that providing annotation facilities within computer-aided design systems is not enough. We address here the cognitive side of the annotation, and we show how they can foster knowledge creation and participate to the development of shared understanding among design teams. We put on the hypothesis that annotation systems behave like natural languages, and we start exploring this metaphor. We then make …", "num_citations": "59\n", "authors": ["864"]}
{"title": "A socio-technical research method for analysing and instrumenting the design activity\n", "abstract": " Empirical studies are privileged means to obtain a holistic view of designing as it is practiced in the world. In this paper we describe a collaboration we have been carrying out for almost ten years in Grenoble between engineers and social scientists. Through this collaboration we have developed a common understanding of design and formulated a set of core of concepts - which we expose in the text. In this research we have drawn upon ethnographic methods for doing fieldwork. We also actively intervened in the design process as part of our experimentation. This provides us with a tool, complementary to passive observation, which gives insight into the fine grain mechanisms of the design process. We studied design teams and focused on design cooperation and instrumental methods for improving design co-operation.", "num_citations": "55\n", "authors": ["864"]}
{"title": "Formes et gestion des annotations numériques collectives en ingénierie collaborative\n", "abstract": " Nous présentons dans cet article l’importance des annotations dans les situations de conception collaborative. Après une caractérisation des annotations d’un point de vue cognitif, nous présentons les différents formats de représentation utilisés en conception. Nous discutons ensuite du type de sémantique (computationnelle ou cognitive) et du niveau de représentation (profonde ou superficielle) adapté aux annotations. Nous opposons ensuite deux directions de recherche visant à développer des supports à la conception collaborative: l’une centrée sur la définition de standards d’interopérabilité universels, l’autre sur l’intégration d’un flux de données semi structurées associé aux données techniques, que nous défendons. Nous présentons enfin les techniques permettant l’annotation dans une perspective du web «cognitivement sémantique» et une proposition de modèle conceptuel permettant de définir des méta-données associées aux annotations.", "num_citations": "52\n", "authors": ["864"]}
{"title": "Open design platforms for open source product development: current state and requirements\n", "abstract": " The spread of ICT and cheap low-size production tools like 3D-printers led to the development of open design, i.e. community-based and open source development of physical products. This innovative organization of product development offers a great opportunity for continuous improvement of products as well as formidable a potential for product innovation and incubation of new businesses. However, because of a limited availability of supporting methods and tools, open design projects are still unable to compete with today  s standards of industrial product design. The present article aims at providing a state of the art of existing online tools for open source product development and discusses their limitation regarding the challenges raised by what is identified as an emerging design paradigm. This is performed through the definition of an analysis grid through which existing tools have been scanned as well as a case study. It claims for further empirical research in order to describe the phenomenon from a design science perspective, to define appropriate categories and develop new specific online product data management tools.", "num_citations": "43\n", "authors": ["864"]}
{"title": "What is the “source” of open source hardware?\n", "abstract": " What “open source” means once applied to tangible products has been so far mostly addressed through the light of licensing. While this approach is suitable for software, it appears to be over-simplistic for complex hardware products. Whether such a product can be labelled as open source is not only a question of licence but a question of documentation, i.e. what is the information that sufficiently describes it? Or in other words, what is the “source” of open source hardware? To date there is no simple answer to this question, leaving large room for interpretation in the usage of the term. Based on analysis of public documentation of 132 products, this paper provides an overview of how practitioners tend to interpret the concept of open source hardware. It specifically focuses on the recent evolution of the open source movement outside the domain of electronics and DIY to that of non-electronic and complex open source hardware products. The empirical results strongly indicate the existence of two main usages of open source principles in the context of tangible products: publication of product-related documentation as a means to support community-based product development and to disseminate privately developed innovations. It also underlines the high variety of interpretations and even misuses of the concept of open source hardware. This reveals in turn that this concept may not even be clear to practitioners and calls for more narrowed down definitions of what has to be shared for a product to be called open source. This article contributes towards this effort through the definition of an open source hardware lifecycle summarizing the observed …", "num_citations": "42\n", "authors": ["864"]}
{"title": "An annotation model to reduce ambiguity in design communication\n", "abstract": " This paper describes an annotation model of digital design representations which aims to provide the design actors with a way to communicate more clearly in asynchronous situations. Our objective is to develop a model that improves design communication through the elicitation of knowledge related to the context of design. We present a case study based on our observations in an industrial vehicle company where we observed and analysed annotation practices during design reviews. The speech act theory is used in order to propose a model based on the concept of locutionary and illocutionary annotation acts, and annotation categories are drawn from cognitive approaches of design. An annotation scenario is then developed on the basis of the case study as an illustration of our model.", "num_citations": "31\n", "authors": ["864"]}
{"title": "Lessons learned from an empirical study of the early design phases of an unfulfilled innovation\n", "abstract": " This paper presents the results of an empirical study focused on the observation and analysis of an innovative design process. We have had the opportunity to observe and participate in the early phase of a new innovative project within a design office of a truck manufacturer. Our observations based on the actor-network theory highlight the importance of the various design rationales carried by the actors involved. The results of this study show the weakness and complexity of an innovative process within a highly constrained environment. We particularly show that carrying out innovation requires different viewpoints with regard to the object of the design to evolve along with the network of actors and the organisation involved. The issue of product and process integration involving knowledge transfer between actors throughout the design process is also discussed here. As a result, we highlight the importance …", "num_citations": "30\n", "authors": ["864"]}
{"title": "Design of a 3D annotation tool for supporting evaluation activities in engineering design\n", "abstract": " In the domain of engineering design a distinction can be made between the design activities related to the production of a CAD representation (embodiment of a design solution) and the activities related to the evaluation of a design solution. Throughout the whole design process annotations play a crucial role by supporting the cognitive synchronization between designers, by acting as intermediary objects in fostering cooperation, and by capturing the design rationale. This paper reports on the design of an annotation tool which supports the evaluation activities in engineering design.", "num_citations": "24\n", "authors": ["864"]}
{"title": "Caractérisation de l'activité de conception collaborative à distance: étude des effets de synchronisation cognitive\n", "abstract": " La coopération est aujourd'hui un aspect important dans les équipes de conception. L'ingénierie concourante a conduit les organisations industrielles à évoluer d'une approche séquentielle vers une approche intégrée des processus de conception. Ainsi les processus de conception se déroulent de plus en plus à distance, et les concepteurs sont repartis dans des lieux différents. Pour étudier cette problématique, cette thèse analyse l'activité de conception collaborative à distance à travers des analyse de protocoles. En particulier elle s'attache à la caractérisation des activités de conception et à la modélisation du phénomène d'intercompréhension à travers des objets intermédiaires. A partir des résultats deux propositions sont faites : d'une part, un modèle d'activité qui prend en compte les aspects collectifs et cognitifs de la conception et d'autre part, un cadre pour l'analyse et le développement des outils pour l'assistance à l'activité collective de conception.", "num_citations": "21\n", "authors": ["864"]}
{"title": "Modelling knowledge transfer: A knowledge dynamics perspective\n", "abstract": " The increasing complexity in design activities leads designers to collaborate and share knowledge within distributed teams. This makes designers use systems such as knowledge management systems to reach their goal. In this article, our aim is to investigate on improving the use of knowledge management systems by defining a framework for modelling knowledge transfer in such context. The proposed framework is partly based on reuse of existing models found in the literature and on a participant observation methodology. Then, we tested this framework through several case studies presented in this article. These investigations enable us to observe, define and model more finely the knowledge dynamics that occur between knowledge workers and knowledge management systems.", "num_citations": "20\n", "authors": ["864"]}
{"title": "An annotation based approach to support design communication\n", "abstract": " The aim of this paper is to propose an approach based on the concept of annotation for supporting design communication. In this paper, we describe a co-operative design case study where we analyse some annotation practices, mainly focused on design minutes recorded during project reviews. We point out specific requirements concerning annotation needs. Based on these requirements, we propose an annotation model, inspired from the Speech Act Theory (SAT) to support communication in a 3D digital environment. We define two types of annotations in the engineering design context, locutionary and illocutionary annotations. The annotations we describe in this paper are materialised by a set of digital artefacts, which have a semantic dimension allowing express/record elements of technical justifications, traces of contradictory debates, etc. In this paper, we first clarify the semantic annotation concept, and we define general properties of annotations in the engineering design context, and the role of annotations in different design project situations. After the description of the case study, where we observe and analyse annotations usage during the design reviews and minute making, the last section is dedicated to present our approach. We then describe the SAT concept, and define the concept of annotation acts. We conclude with a description of basic annotation functionalities that are actually implemented in a software, based on our approach.", "num_citations": "20\n", "authors": ["864"]}
{"title": "Un exemple d'intégration des fonctions métier dans les systèmes de CAO: la conception de pièces forgées tridimensionnelles\n", "abstract": " L'integration des fonctions metier dans les systemes de cao est un enjeu d'ampleur dans le contexte economique actuel. Pouvoir prendre en compte le plus tot possible dans le deroulement du processus de conception des savoir-faire qui, jusqu'a present, n'etaient pas disponibles, permettre au concepteur d'effectuer des choix en connaissance de cause et eviter l'arbitraire, tel est l'enjeu de ce travail et plus generalement a la conception integree. L'habillage de pieces forgees est une activite tres complexe qui fait appel a des savoir-faire riches mais tres peu formalises. Base en grande partie sur l'expertise de chamouard, en precisant et en formalisant les regles de l'art en vigueur dans la profession, nous avons bati un outil d'aide a la conception de pieces forgees. Celui-ci permet a un non-specialiste du domaine (le concepteur) d'avoir acces a des connaissances expertes au domaine (la forge). Une des originalites de ce travail reside dans la methode de dimensionnement des rayons d'aretes. L'utilisation du modele experimental de chamouard liant la valeur des rayons a la pression necessaire a les former, en fin de forgeage la ou l'effort est maximum, permet de calculer la valeur de ceux-ci. Ce modele est utilise pour traiter les sections planes de pieces de formes quelconques. La coherence de ces differentes coupes est assuree par des equilibres a partir d'une section de reference. Partie integrante d'un logiciel de cao, ces connaissances sont accessibles dans l'environnement du concepteur. Sous forme d'une application specifique du modeleur geometrique, le programme d'habillage peut etre utilise par le concepteur de maniere …", "num_citations": "17\n", "authors": ["864"]}
{"title": "Toward reflective practice in engineering design education\n", "abstract": " Today engineering design practices are radically changing through the development of collaborative work, which requires new specific skills. From an educational point of view specific courses have been set up, including projects and teamwork. However, few efforts have been devoted to the definition of a framework for analysing and characterising collaborative practices in engineering design education. Our aim in this paper is to propose a framework, based on four basic concepts, which allows the characterisation of specific collaborative situations in order to provide engineering students with a more accurate feedback. We stress here the importance of developing reflective practices as a basic skill for collaboration. Our research method is based on a longstanding qualitative analysis of groups of students working on a design game at a graduate level.", "num_citations": "17\n", "authors": ["864"]}
{"title": "Current state of practices in open source product development\n", "abstract": " Open source innovation is a well-studied phenomenon of the ICT sector, but its evolution towards the field of tangible hardware product development is a newer phenomenon which remains mostly theoretical. Existing literature has identified that to push existing open source product development (OSPD) practice towards the achievement of high quality complex products, methods and tools adapted to this specific organisation of work are needed. The objective of this article is to explore the practices emerging from OSPD communities in order to support the development of appropriate process support in the future. It reports first observations made during a qualitative and comparative empirical study performed with participants of 23 OSPD projects through semi-directed interviews. Activating a formerly published framework, these observations address four themes: the organizational structure of OSPD’s surrounding communities, their design process, their underlying business models and the supporting online tools they use. The preliminary results are delivered to the engineering design and management scientific community as an impulse for further research.", "num_citations": "16\n", "authors": ["864"]}
{"title": "Using annotations in a collective and face-to-face design situation\n", "abstract": " Allowing a group of users to produce and transmit some annotations in common digital documents is nowadays a major issue for groupware systems. In this paper, we report a psychological and ergonomic study carried out on this topic in the mechanical design domain. We observed a collective design process that took place in a series of face-to-face meetings attended by the members of a design team. Our results show the minor role played by textual annotations, contrasting with the great number of figurative annotations. We also highlight that the function of annotations is not to develop parts of the solution but to provide the team members with contextual descriptions of the problem and the solution. These results are a first step towards a model of annotations in a collective face-to-face situation. They also provide interesting tracks for elaborating specifications of annotations in mediated situations.", "num_citations": "16\n", "authors": ["864"]}
{"title": "An Interface Tool for driving innovation during preparatory phases: Application in the design of composite parts\n", "abstract": " This paper presents the specifications of a new tool which aims at fostering and supporting product-process innovative projects in the very early design phases, while structuring and capitalising information for future projects. This work is based on an ethnographic study that we carried out from October 1999 to June 2000 in one of the design offices of a great industrial company. This empirical study is focused on the development of a composite part and highlights the complexity and weakness of an innovative process. Relying on the main results of this study, the first part of this article shows the importance of the upstream prospective phases especially those we call “preparatory phases”. In the second part, we will present the specifications of a new tool that instruments these phases by providing a support to interactions between the different participants of an innovative project. More precisely it is dedicated to product/process integration in early design phases.", "num_citations": "16\n", "authors": ["864"]}
{"title": "A speech act theory-based information model to support design communication through annotations\n", "abstract": " The aim of this paper is to describe an annotation model based around design representations. The model tends to promote more successful co-operation between design actors and enables more systematic knowledge sharing. Our annotation model is a set of digital artefacts, which have a semantic dimension. These artefacts aim to improve the design communication through the elicitation of knowledge about the context. We develop a linguistics pragmatics approach, based on Speech Act Theory to characterise annotations in design co-operation. By following the utterance and illocutionary force concepts, we develop locutionary and illocutionary annotation acts concepts. Then, we present an information model on the basis of these concepts. Finally, we propose functionalities for an annotation tool based on our approach.", "num_citations": "15\n", "authors": ["864"]}
{"title": "Des Outils aux interfaces: Pour le développement de processus de conception coopératifs\n", "abstract": " Les travaux présentés ici portent sur le domaine de la conception de produits industriels manufacturés et plus particulièrement la conception collaborative. Nous posons le postulat que la conception est un processus d'action collectif instrumenté basé sur la constitution et la confrontation de connaissances, l'établissement de relations entre les acteurs, et dont le but est de créer un artefact matériel. Nos travaux sont le résultat d'une collaboration interdisciplinaire originale entre les sciences sociales et les sciences pour l'ingénieur débutée dans les années 90 et impliquant les laboratoires CRISTO et 3S du site Grenoblois. Cette confrontation et ce croisement ont conduit au développement d'une méthodologie de recherche originale dans le domaine de la mécanique : la recherche intervention. Nous soutenons la thèse suivante : La coopération en tant que mode particulier de coordination en conception nécessite une instrumentation particulière, c'est-à-dire une approche complète du développement de l'outil et du processus d'appropriation et de transformation dans l'action. Ceci nous a conduit à développer deux axes de recherche : le développement d'espaces de coopération et le développement d'outils métiers dédiés aux interfaces.", "num_citations": "15\n", "authors": ["864"]}
{"title": "Defining requirements for an Augmented Reality system to overcome the challenges of creating and using design representations in co-design sessions\n", "abstract": " Within co-design sessions involving designers and non-designers, the type and characteristics of the design representations employed is known to impact the performance of such sessions in terms of idea generation, idea evaluation and communication. This study captures the challenges practitioners face in creating and using design representations for co-design sessions and goes on to investigate the potential of Spatial Augmented Reality (SAR) to overcome those challenges. The advantages of SAR in this application are that, multiple concepts can be represented using one physical model, concepts can be modified live during the session, and additional equipment (such as head mounted displays or handheld devices) is not required, thus eliminating any possible interference with the natural interactions between participants. Interviews with design practitioners and trials with a prototype SAR system are used …", "num_citations": "14\n", "authors": ["864"]}
{"title": "Etude des annotations en situation collaborative de conception mécanique\n", "abstract": " L'un des objectifs des recherches menées actuellement dans le champ du CSCW est de développer les fonctionnalités d'annotations numériques qu'offrent les collecticiels. On veut permettre aux utilisateurs de ces systèmes de rédiger, de transmettre et d'exploiter les annotations qui sont traditionnellement produites sur des supports papier et créées spontanément au cours d'activités individuelles ou collaboratives. Alors que les études relatives à l'usage des annotations sont nombreuses dans le domaine du Web, elles sont beaucoup plus rares dans le champ de la conception de produit (conception mécanique, conception architecturale, etc.). C'est dans ce contexte que notre étude se situe. Nous avons procédé à une analyse exploratoire des annotations en conception mécanique. La problématique des annotations dans ce domaine d'activité présente des spécificités qui valent pour toutes les situations de conception d'un artefact matériel : produits manufacturés, automatique et productique, conception architecturale, etc. Sur la base des recherches menées autour des annotations de documents numériques, nous proposons un cadre de définition des annotations. L'étude ergonomique que nousavons menée se restreint à l'analyse des pratiques d'annotation en présentiel. Cependant, les résultats fournissent des pistes utiles pour spécifier l''usage d'annotations médiatisées dans le contexte plus général de la conception de produit.", "num_citations": "14\n", "authors": ["864"]}
{"title": "Activité de conception et instrumentation de la dynamique des connaissances locales\n", "abstract": " Activité de conception et instrumentation de la dynamique des connaissances locales - Université Grenoble Alpes Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support Portail HAL de l'Université Grenoble Alpes HAL archives-ouvertes.fr Accueil Rechercher Déposer Consulter Services hal-00366934, version 1 Chapitre d'ouvrage Activité de conception et instrumentation de la dynamique des connaissances locales Guy Prudhomme 1 Jean-François Boujut 1 Franck Pourroy 1 Détails 1 G-SCOP_CC - Conception collaborative G-SCOP - Laboratoire des sciences pour la conception, l'optimisation et la production Type de document : Chapitre d'ouvrage Domaine : Physique [physics] / Mécanique [physics] / …", "num_citations": "14\n", "authors": ["864"]}
{"title": "Innovating in a routine design process-Empirical study of an industrial situation\n", "abstract": " This paper presents an empirical study based on a fieldwork carried out in an industrial company. We have had the opportunity to participate to the development of a composite part within a design office. This project will soon appear as an innovative project disturbing a routine design process. Our observations highlight the importance of the various design rationale carried by the involved actors. We also point out that the evolution of the knowledge level on the composite technology is a key point that fosters innovation. It is related to a complex learning process involving various actors including an external supplier. The results of this study show the weakness and the complexity of an innovative process within a highly constrained environment. This lead to rethinking the role and competencies of various actors, proposing new tools for evaluating and promoting innovative projects. Carrying out innovation involves the evolution of the various viewpoints upon the object of design, together with the involved actors and the organization. The problem of product and process integration is discussed through the question of the participation of an external supplier in the early design phases, involving technical, economical and strategic exchanges between the participants to the design process.Résumé: Cet article présente une étude socio-technique d’un développement de projet industriel de pièce en matériau composite, dans un bureau d’études d’une entreprise. Ce projet va très vite introduire des ruptures et un repositionnement des acteurs de la conception dans un environnement dominé par la technologie métallique, que l’on a pu caractériser …", "num_citations": "14\n", "authors": ["864"]}
{"title": "Exploring the performance of augmented reality technologies in co-creative sessions: Initial results from controlled experiments\n", "abstract": " Co-creation can offer business benefits such as increased speed to market, increased product quality, and a reduced risk of market failure. However, co-creative design sessions can be challenging due to communication barriers between designers and non-designers that can result in misunderstandings and inhibit the efficient exchange of ideas. The potential for augmented reality-based design representations to overcome these challenges and support more effective co-creation sessions is explored through controlled experiments conducted with professional designers and end users.", "num_citations": "12\n", "authors": ["864"]}
{"title": "Exploring the use of AR technology for co-creative product and packaging design\n", "abstract": " Extended Reality technologies, including Virtual Reality (VR) and Augmented Reality (AR), are being applied in a wide variety of industrial applications, but their use within design practice remains very limited, despite some promising research activities in this area over the last 20 years. At the same time, design practice has been evolving to place greater emphasis on the role of the client or end-user in the design process through ‘co-creative design’ activities. Whilst offering many benefits, co-creative design activities also present challenges, notably in the communication between designers and non-designers, which can hinder innovation.In this paper, we investigate the potential of a novel, projection-based AR system for the creation of design representations to support co-creative design sessions. The technology is tested through benchmarking experiments and in-situ trials conducted with two industrial partners …", "num_citations": "11\n", "authors": ["864"]}
{"title": "Une expérience de conception collaborative à distance\n", "abstract": " Nous présentons dans cet article une expérience de conception collaborative à distance utilisant des outils avancés de télétravail, à la base des NTIC (Nouvelles Technologies de l'Information et de la Communication). Cette expérience a été réalisée avec le concours des quatre laboratoires membres du groupe GRACC. Nous avons utilisé une approche expérimentale pour tout d'abord caractériser les outils et leur usage en situation de conception de produit. Ensuite, grâce à l'observation de l'activité de conception, nous avons évalué l'influence des outils sur la dynamique de la conception (actes de conception). Des pistes pour l'amélioration des outils sont proposées, afin d'éliminer les verrous qui freinent actuellement leur exploitation dans le cadre spécifique de la conception mécanique.", "num_citations": "11\n", "authors": ["864"]}
{"title": "Integration of downstream actors in the design process using a dedicated expert CAD tool for forged parts\n", "abstract": " This paper presents a new approach for integrating downstream activities of forged part design in a concurrent engineering con text. We show how a CAD application, integrating specific know-how, can enable co-design between the different actors involved. We develop two dimensions of activity, i.e., a technical aspect and a human aspect. On the technical side, we present the application structure and the un derlying mechanical models. On the human side we draw mainly from our industrial experience in the field of forging. This led us to build two models of the design phase. These models are illustrated by two typical case studies. We then show how the design of closed die parts can be distributed among three main actors. These actors are: the design actor, the manufacturing actor and the forging actor. They can be lo cated in the same company, or in different departments or located in distant companies. From …", "num_citations": "11\n", "authors": ["864"]}
{"title": "A step toward automatic dressing of a three-dimensional stamped part\n", "abstract": " We present here a computer aided system for the dressing of three dimensional stamped parts. The tool we propose is based on the interfacing of a geometrical modeller with an expert system in plane sections dressing.We mainly develop the model we use to optimise the value of the corner radii according to the available pressure on the skin, at the end of the process where all the metal has run into the dies. This approach allow to be certain of the homogeneous filling of the dies and provide a final form which minimise the risks to have forging defects such as cracks due to a local over pressure.We discuss the problem of the determination of the plane sections in a three dimensional part.", "num_citations": "11\n", "authors": ["864"]}
{"title": "Using a semiotic classification to characterise objects involved in collaborative design\n", "abstract": " This paper addresses the problem of expression and sharing of domain-specific constraints and knowledge in engineering design. Pierce’s theory of signs allows understanding why purely graphical 3D CAD systems partially fail to support design teams during design review meetings and more generally during collaborative design episodes. This theory can help us to go further in analysing annotation systems as symbolic systems of signs and we draw a parallel with the 2D standard drawing system, as they have the same semiotic nature. We show that semantic annotations can be considered to improve the semiotic richness in 3D CAD representations. A case study illustrates the need for cooperation support to multidisciplinary design teams. In this paper, we support the idea that future design tools should integrate both symbolic and iconic types of representations so that the designers could freely build shared …", "num_citations": "10\n", "authors": ["864"]}
{"title": "User-Designer collaboration in the design process of surgical instruments: new aspects for annotation as a communication tool\n", "abstract": " Today, collaboration is no more limited to the designers' sphere. Especially the design of products or systems dedicated to expert users requires the active participation of the users themselves. The aim of this paper is to explore the design collaboration process between designers and expert users in the specific case of new surgical instruments. Two design meetings have been studied; one technical design review without the user, and one design validation meeting with the expert user. Designers were using an annotation tool as a communication support during the design process, before and during the first meeting. Our observations showed that the designers were not able to make decisions about the technical solutions that contained user related issues. Moreover, the expert user's comments during the validation meeting altered the proposed solution. In conclusion, it seemed that the actual design organization should be changed in order to integrate the expert user more actively. Annotation as a communication tool proved to be useful for technical exchanges, but we found important limitations for non technical users, we then propose solutions for further improvement of the tool.", "num_citations": "10\n", "authors": ["864"]}
{"title": "Reducing the\" Information Gap\" between synchronous and asynchronous co-operative design phases\n", "abstract": " This paper aims to describe a particular role of annotations as co-operative artefacts in engineering design. In co-operative processes, where achieving a shared understanding between the participants from different domains is crucial, sharing the decisions and argumentations which lead to a solution is as important as sharing the solution itself. In our case study, we describe what we call an \"information gap\" between the asynchronous phase, when individual decisions are made, and the design review, when the solution is evaluated, and collective thinking influences the decisions. Then, within a conceptual design scenario, we show how semantic annotations can create a shared environment to help to reduce this gap, where all actors are able to elicit domain-specific constraints and engage discussions on design solution during the asynchronous phase.", "num_citations": "10\n", "authors": ["864"]}
{"title": "Participatory design in developing countries: How to improve user integration in design process for small scale food processing?\n", "abstract": " Participatory design in developing countries : How to improve user integration in design process for small scale food processing? - Agritrop Logo Agritrop Accueil Aide Liens utiles Recherche avancée Auteurs CIRAD Parcourir par champ stratégique Cirad par thème Agris par année par auteur par affiliation d'auteur Déposer Se connecter Participatory design in developing countries : How to improve user integration in design process for small scale food processing? Godjo Thierry, Marouzé Claude, Boujut Jean-François, Giroux François. 2006. Participatory design in developing countries : How to improve user integration in design process for small scale food processing?. In : 6th International Conference on Integrated design and manufacturing in mechanical engineering, 17 - 19 May 2006, Grenoble, France = 6ème Conférence Internationale sur la conception et la fabrication intégrée en mécanique. Tichkiewitch S. (…", "num_citations": "10\n", "authors": ["864"]}
{"title": "ID2: a new tool to foster innovation during the early phases of design projects\n", "abstract": " Innovation has been extensively studied both in the social sciences and in the                engineering design field. In this paper we present the specifications and features                of a new tool designed to coordinate the development of new solutions during the                early phases of design projects. It is the result of 18 months of fieldwork within                industrial companies during which we played an active role in the development of an                innovative solution. We were also able to closely analyze the activities of certain                actors (in this case materials experts) who are often behind proposals for new                materials and processes. The Innovation Development and Diffusion (ID2)                tool is geared to help innovative solutions emerge, on the one hand, and consolidate                these solutions by circulating them to the company's different specialists on the                other. The tool is based on a …", "num_citations": "10\n", "authors": ["864"]}
{"title": "Formes et structures des annotations sémantiques pour supporter la communication en conception collaborative asynchrone\n", "abstract": " Les processus de conception collaborative actuels comprennent un nombre important de situations coopératives dans lesquelles des participants géographiquement distribués, issus de différents domaines d'expertises, ont besoin de construire une compréhension mutuelle afin d'évaluer collectivement les solutions de conception. Les représentations tridimensionnelles de produit sont souvent utilisées dans ces situations comme l'artefact partagé entre les participants. Malgré l'avancement de technologies de Travail Collaboratif Assisté par Ordinnateur, la communication asynchrone reste difficile. Ceci est lié au manque d'une part de fonctionnalités permettant aux participants d'éliciter des informations tacites sur les représentations 3D et, d'autre part, à l'absence des mécanismes pour soutenir la communication argumentative. La question adressée dans cette thèse est de savoir comment les annotations peuvent être utilisées sur des représentations 3D pour soutenir la communication asynchrone, afin de permettre un partage plus efficace de l'information. Les contributions de ce travail incluent (1) un modèle d'annotation qui permet d'exprimer l'intention de conception, (2) une structure d'annotation qui facilite la compréhension de l'information en unifiant les dimensions communicatives et informationnelles du contenu de l'annotation, (3) un répertoire d'annotation afin de faciliter la recherche et la réutilisation des annotations, (4) l'environnement Annot'Action, une implémentation informatique des concepts proposés.", "num_citations": "9\n", "authors": ["864"]}
{"title": "Symbolic vs. iconic: How to support argumentative design discourse with 3D product representations\n", "abstract": " This paper presents three technical design representation cases along with a real design case, in order to discuss how annotations should be used in 3D representations to support argumentative design communication. We distinguish between two modes of representations: iconic, where the signifier is perceived as resembling or imitating the signified, and symbolic, where the relationship between representation and target object is fundamentally arbitrary or purely conventional, so that the relationship must be learnt. The design cases are discussed according to this approach, in order to show how mode of representation of design artefacts has evolved according to the different sharing contexts, and the advantages that their modes offer respectively in their context of use. This analysis shows how iconic 3D representations must be enhanced by symbolic annotations, in order to support asynchronous argumentative design communication.", "num_citations": "9\n", "authors": ["864"]}
{"title": "Proposition of a new model for early phases of innovation process\n", "abstract": " The paper discusses about a new model dedicated to be used during the early design phases of innovative ideas development. Our main goal is to propose a model to foster formal and informal interactions during the first operations of innovative projects. This model aims to encourage development and evaluation around new ideas proposals taking into consideration potential, technology and concepts feasibility. A tool proposal is also presenting to illustrate the use of our model and highlights the possibilities of networking among stakeholders of innovative project.", "num_citations": "9\n", "authors": ["864"]}
{"title": "Extracting and analysing design process data from log files of ICT supported co-creative sessions\n", "abstract": " The observation of designers' behaviour in collaborative design activities and the analysis of protocols improved the understanding of how novel ideas emerge, what occurs among designers and, indirectly, what methods have a good impact on the outcomes. Yet, protocol analysis requires recording the design sessions, often in a simulated environment, thus introducing a bias in the observation. Moreover, the analysis takes up to 1000 times the duration of the observed design session. These limitations definitely hinder the scalability of this practice to large experiments in real operational environments.This paper investigates the possibility to use the data collected in log files, automatically recorded during collaborative design sessions assisted by an ICT design support tool, as a means to extract relevant information about the design process and ultimately to infer insights about co-designers' cognition during the …", "num_citations": "8\n", "authors": ["864"]}
{"title": "A study of cognitive synchronisation in distant mediated design through design artefacts\n", "abstract": " Today, collaboration among design teams must be achieved across time and geographical constraints in addition to the usual problems associated with cognitive distance. In this paper, we propose a model mainly based on the concept of design intermediary object (DIO) that takes into account the collective dimension of the cognitive process of geographically remote designers. This model has been used for characterising the cognitive synchronisation mechanisms involved in a distributed collective design process. More precisely the analysis of two design protocols highlight a specific 'sequential effect' in distributed design situations where video facilities are poor or missing. We suggest that cognitive synchronisation is mainly affected by both distances and therefore there is a need to support better this process as it is a major performance factor in distributed teams.", "num_citations": "8\n", "authors": ["864"]}
{"title": "Using situated FBS to model design interactions in a distant synchronous collaborative situation\n", "abstract": " In this paper we present an approach based on a the Delta Design serious game, that proposes a versatile design scenario. We focus on the modelling aspects of the design situation and particularly we pay attention to interaction modelling. The situated FBS model is used as a basis for building our descriptive model and we show how we can propose a model of some key interactions and help to understand the mechanisms of the process of creating a shared understanding. In order to study more deeply this process we have built a collaborative platform, implementing the delta design situation.", "num_citations": "7\n", "authors": ["864"]}
{"title": "Defining a strategy of integration of packaging development into product development\n", "abstract": " This paper presents support for guiding the strategic activity of integrating packaging development into product development. This support consists in the description of 4 integration strategy models and a guideline based on the packaging specificities to help the planner define his or her own strategy. This strategy definition support can be operationalised without great effort.", "num_citations": "7\n", "authors": ["864"]}
{"title": "Open source hardware communities: investigating participation in design activities\n", "abstract": " Open source design of hardware products is an emerging phenomenon that takes more and more importance today's in the society. However, open source (hardware) design implies a tremendous change in both design practices and philosophy because it is partly related to the movements of creative commons and the sharing economy. From this perspective one could think that participation is crucial in the success of open source design projects. In this paper, we analyse 9 case studies in the light of 3 hypotheses. If many studies highlight the potential of the crowd as a resource for design tasks, our study shows that for open source design communities the participation is not massive. In this study, we used an activity-based approach to build our model. As open source design processes are fairly unstructured and based on voluntary participation, it is impossible to adopt a classical task-based model. With the help …", "num_citations": "6\n", "authors": ["864"]}
{"title": "Fast quotation of threedimensional stamped part using CAD system\n", "abstract": " The design of a mechanical part has to be taken as an optimization process with constraints in which the objective function is the manufacturing cost of the part. Therefore, into the CAD system, we have to introduce fast quotation in manufacturing. This problem is usually tackled in terms of tooling, and we show in this paper another view: the quotation of the rough part.Starting with the tooled 3D representation of the part in a CAD station, we have to add the stamping allowances. To do this work, we cut the 3D part in order to get the whole strain plans, and we introduce these plans into the COPEST expert system, using an IGES file. As answers, COPEST gives the corresponding dressed sections to the CAD station and the usefull pressure in front of these sections. An integration on the total surface of the part gives an information to get the spent energy. The use of specific rules allows us to produce the quotation for …", "num_citations": "6\n", "authors": ["864"]}
{"title": "A participatory design approach based on the use of scenarios for improving local design methods in developing countries\n", "abstract": " Over the past few years, the use of scenarios in participatory design has proved its worth. It has resulted in some interesting tools for capturing the context of use. However, these approaches have been almost exclusively developed and used for software design. In this article, we shall describe the development of scenarios in the specific context of tropical food processing equipment design in developing countries. As well as exploring this original field of application, this article raises fundamental questions about scenario use, taking us beyond the limited framework of the proposed application. We shall outline a methodological framework for structuring the deployment of scenarios according to the different design phases: the COSU  method. This method implements the scenario concept in an original way. It comprises four types of scenario whose aim is to create interaction between designers and users in order to foster a shared understanding of both the problem and the solutions. We shall also show that the scenarios are objects that mediate the user-designer dialogue that is of prior importance in the context of developing countries. The applicability of the method is presented through various case study examples.", "num_citations": "5\n", "authors": ["864"]}
{"title": "Challenges in expert user participation in design evaluation meetings\n", "abstract": " This paper explores the design collaboration between designers and expert users in the specific case of new surgical instrument design. To this end, two design evaluation meetings were studied. Decision and interaction analysis methods were applied to compare the effectiveness of the design team on discussing and solving design issues with and without active participation of the expert user. The observations showed that, in the absence of the user, the designers were unable to make decisions about technical solutions relating to usability issues, and the expert user’s comments during the subsequent meeting significantly altered their decisions. These two observations indicate that the use of a support tool could have a significant role to help asynchronous communication in such a design process.", "num_citations": "5\n", "authors": ["864"]}
{"title": "Towards a multi-input model, method and tool for early design phases in innovation\n", "abstract": " This paper focuses on the early design phases of innovative projects. More precisely, the question of the innovation opportunities development and management is addressed here, starting from a theoretical model and methodology, until precise tool perspectives. The key elements of our approach are the potential technology concept (PTC) multi-input model and the C-K theory. Our PTC model is based on three dimensions (concept, technology and potential) and highlights the need of interactions between them regarding strategic and operational levels. Starting from the analysis of these three dimensions, different opportunities for the innovation are identified. In order to develop every identified opportunity, the three dimensions have to be explored with specific workshops and the C-K theory resulting in a tree diagram. The paper presents also tool perspectives dedicated to structure the preliminary exchanges …", "num_citations": "5\n", "authors": ["864"]}
{"title": "Etude de cas d’une offre industrielle de management des connaissances techniques\n", "abstract": " La société BASSETTI, PME basée à Grenoble, a développé une méthodologie et un logiciel à destination de structures et organisations souhaitant valoriser et pérenniser les connaissances de leurs experts techniques. Le premier auteur de l’article a intégré la société en tant que chercheur et, depuis une posture de recherche intervention, va dans cet article analyser les pratiques de la société concernant le management des connaissances et les mettre en perspective avec un certain nombre de concepts issus de la littérature.Summary: The company BASSETTI, a SME located in Grenoble, has developed a methodology and a software designed for technical organizations and structures that want to increase the value of their experts’ knowledge. The first author of the article has joined the company as a PhD student. With a participant observation methodology, she will analyze the company practices regarding knowledge management and put them into perspective with a number of concepts issued from a literature review.", "num_citations": "5\n", "authors": ["864"]}
{"title": "Annotation in design and product engineering: an introduction to the special issue\n", "abstract": " The annotation of a document involves the embedding of data such as a textual note, a symbol or structured data in an original document at a specific location (Ovsiannikov et al. 1999). For centuries, people have used annotations in paper documents and drawings in the course of their work—for example, an author of a document may use annotation to assist in the development and refinement of the text of the document; other readers may use annotation to assist in recall, to indicate corrections or for the purposes of comment, assessment and review. Annotations have been applied to a wide variety of document types including books, reports, papers and transcripts, engineering drawings and diagrams, photographs and other images, and in this way have been widely used in product development. The scope of annotations has been considerably enlarged by the latest developments in digital technologies allowing …", "num_citations": "5\n", "authors": ["864"]}
{"title": "Annotation and knowledge creation\n", "abstract": " Annotation is a natural way for adding information to a specific representation. Every designer knows that, and it is the first thing a designer do when he wants to express a point of view or argument on a solution (evaluate, criticise,…). Most of the time these annotations remain informal and are considered as mere supports to a verbal exchange. We want to show in this paper that annotation is more than that, and that it is important to consider them as complex and composite elements. We argue that providing annotation facilities within CAD systems is not enough. Regarding what we exposed before we think that a work must be done in formalising organisation that will support annotation process in all its dimensions. For example functionalities of creating, storing retrieving new symbols should be implemented. Rules elicitations and formalisation should be implemented too, without forgetting the level of organisational learning. Indeed, we consider that the process of creating the rule is as much important as the rule itself.", "num_citations": "5\n", "authors": ["864"]}
{"title": "Designing to avoid potential defects: Simulation of the temperature effect on closing pressure during stamping\n", "abstract": " The local closing pressures on the dies during stamping process can be at the origin of microscale cracks. At this stage of failure, the metal runs along the cracks and increases the damage of the dies at very high speed. So is it important to design the part in order to minimize the pressure distribution on the whole surface in contact.Two factors have a direct influence on the local closing pressure: the working temperature of the metal and the values of radii on the part. In this paper, we study with some examples the relationship between these two factors.", "num_citations": "5\n", "authors": ["864"]}
{"title": "Processus d'annotation dans les documents pour l'action: textualité et médiation de la coopération\n", "abstract": " Ce chapitre traite des documents numériques utilisés comme supports à une pratique collective. Ces documents se caractérisent à la fois par une hyper-fragmentation résultant d’une hétérogénéité temporelle (weblog) et auctoriale (wiki) mais aussi par une multiplication des relations explicites entre ces fragments (« web sémantique » au sens large). Le chapitre propose tout d’abord un cadre théorique autour des notions de document pour l’action et d’annotation pour ensuite analyser l’état des recherches dans différents domaines d’application : médecine, conception mécanique, conception de logiciels libres, documentation scientifique.", "num_citations": "4\n", "authors": ["864"]}
{"title": "ID2 a tool for sharing information and fostering knowledge creation during innovative projects\n", "abstract": " This article presents the specifications and features of a new tool designed to co-ordinate the development of new solutions during the early phases of design projects. It is the result of 18 months of field work during which we played an active role in the development of an innovative solution. We were also able to closely analyse the activities of certain actors (called materials experts) who are often behind proposals for new materials and processes. The ID² (Innovation Development and Diffusion) tool is geared to help innovative solutions emerge, on the one hand, and consolidate these solutions by circulating them to the company’s different specialists on the other. The tool is based on a concepts/criteria table enabling the viewpoints of the different actors involved to be summarised during the design phase. In this article we shall show how functional features such as links, questions, alarms, information enquiries and the possibilities for exchanging information between actors can contribute to developing solutions for these different professionals. We will also see how the “innovative” solution proposed can be developed further by comparing and assessing it in relation to a list of criteria which is gradually drawn up by the actors involved in the project. This tool is designed to be managed by a specific actor (a co-ordinating actor), who may also, depending on his/her strategy, consolidate the proposal by involving an increasing number of people.", "num_citations": "4\n", "authors": ["864"]}
{"title": "Applying multiple metrics in the performance measurement of design sessions in industry: a co-design case study\n", "abstract": " The recently launched SPARK project (www.spark-project.net), aims to understand how Spatial Augmented Reality (SAR) technology can be used to support the co-design process. The project aims to develop, build and test a SAR technology for co-design. This paper presents the testing of a suite of metrics to assess the performance of co-design sessions in industry. These metrics will be needed in the SPARK project to help iteratively develop that technology, as well as to provide insights into the overall effects of using SAR tools in co-design. The aim of the study reported in this paper was to design, develop and test a process for applying a suite of co-design session metrics. During the study, the metrics application process was applied to two industry cases and based on the outcomes, refinements were made. This resulted in a proposed process for the evaluation of the effectiveness of co-design sessions. The work presented in this paper will be of particular interest to other researchers seeking to evaluate the impact of a product development tool on a specific design session.", "num_citations": "3\n", "authors": ["864"]}
{"title": "A methodology to support strategic design and management decision-making in entrepreneurial systems: A case study in mobility on demand (MoD) transportation\n", "abstract": " This paper introduces a methodology to support strategic design and management decision-making in entrepreneurial systems that are called to evolve towards more complexity. It describes a framework to capture the early dependencies between the components and stakeholders of an enterprise organization that faces a wide array of uncertainty in a start-up environment. The methodology consists of two steps: 1) a layered DSM representation, and 2) flexibility analysis. The first step provides a systems-level representation of the enterprise, and enables quick identification of opportunities for flexibility. The second step enables thorough and quantitative analysis of opportunities for flexibility to support strategic design and management decision-making. The concept of flexibility, often associated to real options, is exploited as a way to deal pro-actively with uncertainty, which is prevalent in a startup environment. It provides entrepreneurial systems with the “right, but not the obligation, to change and adapt over time as uncertainty unfolds.” The proposed methodology is applied as demonstration to the analysis of a startup system in the sector of mobility on-demand transportation.", "num_citations": "3\n", "authors": ["864"]}
{"title": "Modeling engineering interfaces in collaborative activities: a transactional model\n", "abstract": " In large projects such as the ATLAS detector at CERN, the complexity of organizational and decision making structures may endanger a safe management of such projects. An analysis of the ATLAS organization was conducted during several years. A map of the decision making structure of one of its sub-projects is presented in the paper. It shows that the so-called technical manager, a middle manager (most of the times an engineer) is in a position of interface and has to deal with complex socio-economic-technical problems. This paper proposes an interface model that aims to grasp the complexity of engineering management situations. Based on hologramic and recursive principles of complexity, a transactional model of the interface is proposed with the types of interfaces that derive from it. Nine types of translations are described together with six types of inward and outward transactions, as well as the exchange spaces established through the interface actor. This model is illustrated through the case study of the project introduced at the beginning of the paper. The conclusion opens towards the pooling of bilateral exchange spaces to the set up trading zones.", "num_citations": "3\n", "authors": ["864"]}
{"title": "Improving collaborative design tools in automotive industry: A case study\n", "abstract": " This paper presents a case study about improvements of collaborative design tools in the automotive industry. The objective is to propose some specifications for the development of a particular information system. This system, integrated into the designers’ CAD environment, shall support a method to integrate customer requirements into the design process. The problem of building up a project memory, in order to keep track of the requirements and their evolution (situated in their initial context) is also taken into consideration.", "num_citations": "3\n", "authors": ["864"]}
{"title": "Entrepreneurship and the design process: the paradox of innovation in a routine design process\n", "abstract": " The problematic of innovation has been extensively studied both in the social sciences and in the engineering design fields. In this chapter our aim is not to address this question in a theoretical and general way. Rather, we prefer to go deeper in a case study to understand the detailed workings of a specific design situation when a new technology is introduced. In our case, we have witnessed the introduction of a new material (a composite material called SMC1) in a design department of an industrial company. In the following we will call it the'composite project'. The aim of this project was twofold: testing the capacity of this material in a semi-structural application, and changing the design practices and organization through the introduction of a new material. The challenge was on the two aspects: moving the technical limits of the technology and making the organization and the actors evolve in the same time. This chapter deals with the second aspect. After presenting the context of this study we will analyse the different aspects of this innovation process in this particular design situation. We observed that design habits were deeply rooted in the history of the product and especially they were shaped by the underlying technology used in this industry since the beginning, that is, the steel and its related manufacturing processes. In that context the composite material forced implicit knowledge to elicit and introduce new participants in the design process. Furthermore, the design organization itself was modified since the composite project was not a regular project related to a specific range of product; it was an upstream project that had no clear aim and …", "num_citations": "3\n", "authors": ["864"]}
{"title": "Modelling the process of creating a mutual understanding in distributed design teams\n", "abstract": " Cooperation is an important issue in design teamwork. This paper is an attempt to contribute a theoretical framework through the modelling of the process of creating a mutual understanding during remote synchronous design sessions. We present here some reflections based on a review of the available literature in engineering design, on the experience accumulated in field studies and on a distributed design protocol we have recently carried out. We propose a model of an elementary design interaction between two participants of the design process. We take the Situated FBS Framework as a basic individual cognitive model and we propose to extend it through the concept of design intermediary objects and cognitive synchronisation.", "num_citations": "3\n", "authors": ["864"]}
{"title": "Analysis of the use of intermediary objects involved the design of food processing equipment in developing countries: The case of a peanut procesing plant in Benin\n", "abstract": " The design intermediary objects (DIO) that steered the design process of a peanut processing plant have been analysed in the aim of understanding how the design process worked, and also to discover the outcome of the use by Developing country designers of a design method based on a cooperative structure, which helped to frame the design task: the CESAM method. This study shows that the role of DIO's in the food equipment design process is one of translation, mediation and representation of the future product (at different stages of the process). They function on many different levels: supporting knowledge creation, interesting or motivating actors to the process, presenting and sharing the knowledge produced, etc. For example, some DIO's play a crucial role in key stages of the design process, linking the analysis of requirements and the perception of these requirements by the designers, or indeed in understanding the practices of the women who process the peanuts manually and in developing solutions that cater for their requirements. These DIO's favour a cooperative design approach and their contribution must be described more explicitly in the next version of CESAM.(Résumé d'auteur)", "num_citations": "3\n", "authors": ["864"]}
{"title": "Fast simulation system for axisymetrical stamped-deformation\n", "abstract": " Taking into account, as soon as possible in the product design process, specific manufacturing constraints is a major stake in the current economic context. In the specific field of forging part design, i.e. the modification of the initial shape of the tooled part into a forgeable shape, our recent developments show the necessity of knowing the way the material flows during the process. To this end, we are developing a fast-simulation deformation tool (two dimensional, isothermal) based on the extension of Chamouard's model. This tool allows us to simulate the evolution of the forging force, as well as to visualise the intermediate shapes during the operation in order to identify the critical zones in terms of filling. In this paper, we present our latest developments about this subject.First of all, we deal with the problem of the upsetting of a billet, recalling the model used and in particular our original approach to the evolution of …", "num_citations": "3\n", "authors": ["864"]}
{"title": "Requirements for design reuse in open-source hardware: a state of the art\n", "abstract": " Making a hardware open-source consists of making accessible the documentation of the system so that everyone can use this design for its own purpose. It is an increasing phenomenon that goes hand in hand with the developments of the makers movements and the underpinning societal changes that are at stake today. However, poorly structured communities are sometimes struggling with problems inherent to the reuse of exiting designs. Besides, the exponential number of web-sites and platforms hosting open-source projects makes it almost impossible to properly find similar products or designs to get inspiration from. Design reuse has been an important practice in industry since decades. This paper looks for exiting design reuse research work and makes an attempt to elicit the main characteristics of design reuse identified in the literature. From this, we discuss the conditions of the application of design reuse …", "num_citations": "2\n", "authors": ["864"]}
{"title": "Real-time coding method and tool for artefact-centric interaction analysis in co-design situations assisted by augmented reality\n", "abstract": " This paper presents and discusses a fast and efficient method to study artefact-centric interactions in co-design sessions. The method is particularly useful for exploring the introduction of augmented reality (AR) environments since AR application representations combine both digital content and physical content, transforming the way users interact with the design object. Although protocol analysis is extensively used in cognitive studies of design, it is a time-consuming and cumbersome method and hence unsuitable for extensive analysis in industrial environments. Our real-time coding method makes it possible to perform “on-the-fly” coding of physical interactions in co-design sessions. Focusing on quantifying interaction occurrences, our results are consistent with those obtained with post-session coding. Internal validity was assessed using relevant statistical tests. Based on the data collected in co-design …", "num_citations": "2\n", "authors": ["864"]}
{"title": "Issues and challenges of knowledge management in online open source hardware communities\n", "abstract": " Knowledge management (KM) is the process of creating, sharing, using and managing the knowledge and information of an organization. In this paper, we investigate KM practices and needs in Open Source Hardware (OSH) communities. The aim is to provide insights into the KM issues and challenges facing these communities. Our analysis is based on interviews carried out with the participants of 22 projects. Interview transcriptions were coded and tagged with concepts extracted from the literature. Text mining was used to uncover the main concepts embedded in the corpus. From this analysis, knowledge sharing emerged as one of the top-rated concepts. Codification and personalization also proved to be important KM approaches, both requiring support in the OSH design process. Using a dendrogram, we highlighted the benefits and challenges of codification together with some interesting concept …", "num_citations": "2\n", "authors": ["864"]}
{"title": "Analyse d’un dispositif de type fab-lab dans un contexte industriel\n", "abstract": " — L'émergence des Fab Labs facilite l'accès à la fabrication numérique et au prototypage depuis quelques années. Cette émergence s'accompagne du mouvement des makers au travers du Do It Yourself. Parallèlement les grandes entreprises s'intéressent de plus en plus à ces nouveaux lieux pour la simplicité de mise en oeuvre de leurs outils et pour leur ouverture quant au partage de connaissance et au compagnonnage. Cependant ce phénomène n'a pas encore pénétré concrètement les entreprises de manière significative. Nous pensons que l'utilisation de ce type de lieu dans les phases de conception amont pourrait aider les phases de créativité en favorisant l'exploration des espaces de possibles, en générant plus de concepts ou en les rendant plus robustes et en permettant la confrontation des divers points de vues plus rapidement. Le maquettage ne serait donc plus réservé aux services de prototypage ou à l'ingénierie ; il serait rendu accessible aux différents acteurs tels que le design, le marketing et l'ergonomie. En associant ce type de lieu à une démarche inspirée du design thinking, le Groupe SEB créé un nouveau dispositif pour accompagner ses équipes d'innovation. Ces équipes multi-expertises vont pouvoir travailler en collaboration afin de générer des idées via des outils de créativité. Ces idées vont être décrites pour se transformer en concepts qui seront ensuite matérialisées pour devenir des démonstrateurs. I. INTRODUCTION Depuis l'apparition des ordinateurs, les technologies numériques n'ont cessé de progresser. L'accès à ces technologies dans le domaine de la fabrication grand public est rendu possible avec l …", "num_citations": "2\n", "authors": ["864"]}
{"title": "Item life cycles in product data management: a case study on how to implement a design data validation process\n", "abstract": " At the start of a new design project, product data management (PDM) system is one of the first to be implemented. Soon the design has to be shared, released or approved, either for prototyping or manufacturing, and the PDM system has to fulfil the not always explicit requirements of the users. This paper describes what has to be implemented at the early stage of a new design project in order to get an actual use of PDM. It is based on a real case study in 2010 for a new project in a new organisational structure, with new tools and new processes applying to new team members. The process of implementing and using a PDM system is described, covering not only the classical title blocks for 2D drawings, but the release of 3D models and the relationship with the item approval. The proposed item-centric approach helps the designers, engineers and managers to make a proper distinction between the life cycle of the item and the life cycles of the CAD-entities that describe it, to assign the adequate status to these entities, depending on their maturity level, and to build up a common shared representation.", "num_citations": "2\n", "authors": ["864"]}
{"title": "Initiating engineers to distant collaboration: which scenario for a collaborative platform?\n", "abstract": " The purpose of this paper is to address the problematic of distant collaboration training. It focuses especially on engineering education through the activity of collaborative design. We present the underlying concept of a recent software development, based on an existing version of a design Role Playing Game. This notably deals with the new distributed situation and the foreseen design activities. Putting students into action with the software is not trivial and requires the elaboration of various scenarios. Choice has to be made depending on various factors among which the educational objectives, discussed in this communication.", "num_citations": "2\n", "authors": ["864"]}
{"title": "Computational linguistics for design, maintenance, and manufacturing\n", "abstract": " Although graphic representations have proven to be of value in computer-aided support and have received much attention in both research and practice (Goldschmidt, 1991; Goel, 1995; Achten, 1997; Do, 2002), linguistic representations presently do not significantly contribute to improve the information handling related to the computer support of a design product. During its life cycle, engineers and designers make many representations of a product. The information and knowledge used to create the product are usually represented visually in sketches, models, (technical) drawings, and images. Linguistic information is complementary to graphic information and essential to create the corporate memory of products. Linguistic information (i.e., the use of words, abbreviations, vocal comments, annotations, notes, and reports) creates meaningful information for designers and engineers as well as for computers (Segers …", "num_citations": "2\n", "authors": ["864"]}
{"title": "An activity model as a tool for analyzing communication in engineering design\n", "abstract": " The research focuses on remote co-operative work and particularly the study of group work sequences during design meetings. We make the assumption that remote synchronous design can be described by the two groups of activities (communication and product modelling). The aim of communication activities is to help the designers to build a common understanding of the present situation. We will present a case study related to remote project reviews within the Volvo Group. We will introduce the concept of activity and propose a classification in relation to the literature. This theoretical framework will then allow the analysis of the case study. It will reveal the evolution of a specific object including graphics and textual annotations.", "num_citations": "2\n", "authors": ["864"]}
{"title": "Information sharing for knowledge creation during early design phases\n", "abstract": " Archive ouverte HAL - Information sharing for knowledge creation during early design phases Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-01131541, version 1 Communication dans un congrès Information sharing for knowledge creation during early design phases Jérémy Legardeur 1, 2 Jonathan Hey 2 Jean Francois Boujut 2 Détails 1 ESTIA Recherche 2 3S - Laboratoire Sols, Solides, Structures Type de document : Communication dans un congrès Domaine : Sciences de l'ingénieur [physics] …", "num_citations": "2\n", "authors": ["864"]}
{"title": "Rethinking CAD Tools Through Their Use?\n", "abstract": " Studying the complex interactions of different point of view (i.e. technical, human, economical…) in the mechanical design process activity leads to develop a new approach of the CAD tools structure. The nature of the manipulated objects (i.e. plans, CAD models…) teaches us a lot about the mechanical design activity as it actually is. Through an empirical study done in Renault Véhicules Industriels (RVI) company, regarding the forged-part design process, we propose to look at the design activity at the lowest level. We point out some specific facts which show the task interrelations, the distributed and, eventually, the complex nature of the activity. The actors co-operate in different ways, using tools and objects. The analysis of this activity indicates some research directions in the design of new CAD tools for a co-design environment.", "num_citations": "2\n", "authors": ["864"]}
{"title": "A Systematic Approach to the Surface Modelling of Forged Parts\n", "abstract": " The approach presented here is centred on a systematic construction technique of surface models of forged parts. After having presented a construction scheme, some coherence checking routines for the generated forms are presented. Effectively, any defect related to the construction process leads to disasters at the machining stage or during other treatments, i.e.: modification of the part geometry, simulation of the forging process, part dimensioning, etc. The developments introduced here are related to the set up of a systematic process of surface creation, to the identification of the entities used during this process and of the operators involved. An approach guaranteeing the compatibility of the construction parameters of the surface is also presented.", "num_citations": "2\n", "authors": ["864"]}
{"title": "A socio-cognitive analysis of evaluation and idea generation activities during co-creative design sessions supported by spatial augmented reality\n", "abstract": " Co-creation with end-users is gaining an increasing interest in the design industry today. This study investigates the mechanisms by which spatial augmented reality (SAR) technology can affect socio-cognitive processes in groups involved in co-creative design sessions. More precisely, when used in real co-creative design sessions, does a SAR system facilitate the collective creative process, compared to sessions occurring in standard settings? A protocol analysis has been conducted to investigate three different design sessions involving experienced designers and end-users on a product design task: a design session supported by conventional design representations (usual design practices), a design session supported by non-spatial augmented reality (AR), and a session supported by SAR technology. While results do not clearly show that SAR or AR technologies increase end-user’s commitmen t, they …", "num_citations": "1\n", "authors": ["864"]}
{"title": "An analysis of socio-cognitive activities during co-creative design supported by spatialized augmented reality\n", "abstract": " This study investigates the mechanisms by which spatial augmented reality (SAR) technology can affect socio-cognitive processes in groups involved in co-creative design sessions. A protocol analysis has been conducted to investigate three different design sessions involving experienced designers and end-users on a product design task: a design session supported by classic design representations (usual design practices), a design session supported by non-spatial augmented reality (AR), and a session supported by SAR technology. While results don’t clearly show that SAR or AR technology increase end-user/client commitment, they illustrate the ability for these technologies to allow browsing through more ideas during a co-creative design sessions. Furthermore, it tends to reduce time spent on ideas, compared to a traditional session.  We also noted that the introduction of these different technologies does not modify the profiles of the sessions in terms of cognitive activities. This tends to demonstrate that the technology itself does not impair the design activity.", "num_citations": "1\n", "authors": ["864"]}
{"title": "Improving the efficiency of design protocol analysis: an approach to speed up the coding stage\n", "abstract": " This paper aims at checking the capabilities of tools to support coding activities for protocol design analysis to improve the efficiency of the process. The application of existing coding schemes to different protocols from real collaborative design sessions allows showing that the approach and the proposed tools can be flexibly adopted for various type of design tasks (product interface design and packaging design). The experiments to check the effectiveness of the proposed tools involved non-expert coders to create challenging experimental conditions and explore. This also allows exploring the viability of approaching the coding stage by non-expert coders in design protocol analysis, with a double goal: the positive results obtained show that is possible to release experts from time-demanding and HR consuming activities and, at the same time, obtain multiple parallel coded protocols for more reliable …", "num_citations": "1\n", "authors": ["864"]}
{"title": "Influential factors of initiating open innovation collaboration between universities and SMEs: Systematic Literature Review\n", "abstract": " Academia-Industry collaboration is increasingly seen as an essential engine of local economic development and the open innovation model is a key element in such collaboration. The aim of this paper is to explore the existing literature in a systematic way to identify the factors that influence decision makers to start an open innovation collaborations between universities and SMEs. The review shows that open innovation' in the context of university-Industry is receiving more and more attention. The majority of the existing research focus on knowledge and technology transfer. We used the Content Analysis method to analyze the final sample, the findings fall into four categories of factors: Organizational Structure, External Resources, Performance Indicators and Proximity. The article concludes with suggestions for future research.", "num_citations": "1\n", "authors": ["864"]}
{"title": "The emerging phenomenon of open source hardware design\n", "abstract": " The spread of ICT and cheap low-size production tools like 3D-printers led to the development of open design, i.e. community-based and open source development of physical products also named as open source hardware design. This innovative organisation of product development based on a new conception of copyright as well as decentralised and voluntary work offers a disruptive alternative to conventional industrial product development. It provides a great opportunity for continuous improvement of products as well as formidable potentials for product innovation and incubation of new businesses. However, the emergence of open source hardware design still suffers from a limited availability of supporting methods and online tools helping to face the organizational challenges raised by distributed collaboration of non-contractually engaged volunteers. Because of a lack of adapted structuring mechanisms, open source hardware design projects are still restricted to the development of products of low complexity and quality, i.e. prototypes or toys for do-it-yourself hobbyists. In order to compete with today's standards of industrial product design, open design shall be provided with adapted methods that ensure significant process efficiency and economic viability. In this presentation we will introduce the concept of open source hardware design and explain how it is different for open source software design. Then we will propose a caracterisation of the typical actors' profiles and the notion of of community. We will also introduce a tool for evaluating the openness of a product or a process and the link with the communication tools used by the …", "num_citations": "1\n", "authors": ["864"]}
{"title": "D5. 1 Validation at end users premises\n", "abstract": " D5.1 Validation at end users premises - Archive ouverte HAL Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-02007307, version 1 Rapport D5.1 Validation at end users premises Giuseppe Bellucci 1 Niccolo Becattini 2 Gaetano Cascini 2 Jamie O'Hare 3 Xavier Majoral 4 Jean-François Boujut 5 Fatma Ben Guefrache 5 Détails 1 Artefice group 2 POLIMI - Politecnico di Milano [Milan] 3 University of Bath [Bath] 4 Stimulo design 5 G-SCOP_CC - Conception collaborative G-SCOP - Laboratoire des sciences …", "num_citations": "1\n", "authors": ["864"]}
{"title": "Format effects on the comprehension of movement from static graphics in engineering education\n", "abstract": " Archive ouverte HAL - Format effects on the comprehension of movement from static graphics in engineering education Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-02051018, version 1 Communication dans un congrès Format effects on the comprehension of movement from static graphics in engineering education Olga Kasatkina 1 Erica Vries (de) 2 Jean-François Boujut 1 C. Masclet 1 Détails 1 G-SCOP_CC - Conception collaborative G-SCOP - Laboratoire des sciences pour la conception, l'…", "num_citations": "1\n", "authors": ["864"]}
{"title": "Modulation of ambiguity, a cognitive function of representations during idea generation\n", "abstract": " The role of the representations that are developed in creativity sessions is often overlooked as a potential factor, which can influence the progression and the results of those sessions. Through the qualitative analysis of a case, observed in an open innovation center called Ideas Lab, we will explain the use, the nature and the functions of representations developed during a creativity session. We aim at articulating Duval  s representational cognitive functions and the mode of attribution of meaning, polysemic versus monosemic, in creativity sessions as specific situations. In addition to the classical cognitive functions of Duval  s framework, we propose a new cognitive function of representation that we call the modulation of ambiguity specific to the creative process. The representation allows the adjustment of the ambiguity level to give way to a variety of interpretations. This potential of the modulation of polysemy supports the idea generation activity by introducing or preserving a variety of interpretations, and prepares the idea evaluation phase by reducing polysemy and supporting the construction of a common understanding.", "num_citations": "1\n", "authors": ["864"]}
{"title": "Identifying dimensions of socio-technical tools for innovative design and engineering education\n", "abstract": " Identifying dimensions of socio-technical tools for innovative design and engineering education - Institut polytechnique de Grenoble Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support Institut National Polytechnique de Grenoble Archive Ouverte HAL Accueil Consultation Liste des documents Liste par type de document Liste par année Liste par discipline Rechercher hal-02051124, version 1 Communication dans un congrès Identifying dimensions of socio-technical tools for innovative design and engineering education Olga Kasatkina 1 Erica Vries (de) 2 C. Masclet 1 Jean-François Boujut 1 Détails 1 G-SCOP_CC - Conception collaborative G-SCOP - Laboratoire des sciences pour la conception, l'…", "num_citations": "1\n", "authors": ["864"]}
{"title": "The network topology of open innovation freelancing\n", "abstract": " eLancing is an emerging paradigm for outsourcing technical services wherein freelancers bid on projects posted in a large-scale online marketplace. When viewed in concert with other open innovation services such as kickstarter.com, a new networked innovation model is emerging: \"very large scale innovation\". \"Very large scale innovation\" networks supported by the Internet are a large-scale form of innovation networks connecting producers and inventors to investors and retailers. In this paper, we study the statistical mechanics of the network structure of the projects and providers in eLancing to ascertain structural preconditions for their effective operation. The unipartite project and provider networks and the collaboration network exhibit the properties of a homogeneous network whereas the associated skill networks exhibit the properties of an inhomogeneous, scale-free network. All of the networks except the provider network are small-world networks. These results point to the lack of coordination and collaboration between providers, which could provide an opportunity for them to pursue more complex projects, and a need for systems integration services.", "num_citations": "1\n", "authors": ["864"]}
{"title": "From Research to Practice in the Design of Cooperative Systems: Results and Open Challenges\n", "abstract": " COOP 2012 is the 10th edition of the International Conference on the design of Cooperative Systems. It has now been 20 years since the first COOP event was organised by a small group of French researchers who identified an urgent need to investigate the complex issues involved in designing cooperative systems. To mark this special anniversary we asked researchers and practitioners not only to report on recent advances, but also to reflect on successes and failures in our field. We have witnessed huge technological advances in the last twenty years in the ways that people communicate, cooperate and work. This has posed many challenges to systems design and development. With our current work in areas such as smart applications, tangible interfaces, the Internet of Things, web services, the integration of applications and devices, social media and our ever-growing virtual communities, new challenges will …", "num_citations": "1\n", "authors": ["864"]}
{"title": "Supporting Annotation-Based Argumentation Linking Discursive and Graphical Aspects of Design for Asynchronous Communication\n", "abstract": " In this paper we will focus on distant collaborative design activities. In design graphic representations has always play an important role. If one look back in the history of engineering, graphic representations has always been strongly present. Drawings, sketches, mock-ups, and more recently digital representations (CAD, virtual reality, etc.) are commonly shared in design teams. For many years we have been studying the role of mediating objects in design teams, facilitating common understanding, knowledge elicitation and sharing. More recently we have focused on the argumentative side of design. Indeed, the discursive aspect of design is almost as important as the graphic one. In relation to these observations we discuss the concept of intermediary object, boundary object and transactive memory as a good theoretical framework. Today new technologies enable to rethink the mediating structures in distant collaborative work. Particularly we have studied the role of annotations for linking discursive and graphical aspects of design. This led us to develop an annotation plate-form we will present and propose to the discussion.", "num_citations": "1\n", "authors": ["864"]}
{"title": "Improving shared representation by linking discursive and graphical aspects of design\n", "abstract": " In this paper we will focus on distant collaborative design activities. In design graphic representations has always play an important role. If one look back in the history of engineering, graphic representations has always been strongly present. Drawings, sketches, mock-ups, and more recently digital representations (CAD, virtual reality, etc.) are commonly shared in design teams. For many years we have been studying the role of mediating objects in design teams, facilitating common understanding, knowledge elicitation and sharing. More recently we have focused on the argumentative side of design. Indeed, the discursive aspect of design is almost as important as the graphic one. In relation to these observations we discuss the concept of intermediary object, boundary object and transactive memory as a good theoretical framework. Today new technologies enable to rethink the mediating structures in distant …", "num_citations": "1\n", "authors": ["864"]}
{"title": "INNOVATIVE DESIGN METHODS IN THE FOOD PROCESSING INDUSTRY: DISCUSSION ON CK AND TRIZ\n", "abstract": " The food processing industry has been an innovation intensive domain for a long time. However, when analyzing the nature of the industrial organization of this industry we surprisingly noticed that there was an important gap between R&D and marketing activities, on one side and industrial developments activities on the other side particularly in the SMEs. We believe that the latest developments in engineering design research may bring some benefits to the food processing industry. TRIZ and CK are two very different approaches that have already been successfully used in the food industry. In this paper we present an attempt to combine the two methods in order to provide a methodological framework that allows a more efficient use of the two methods. We propose a theoretical reflection on the use of these two very different approaches and propose an original interpretation of TRIZ within the paradigm of the CK theory.", "num_citations": "1\n", "authors": ["864"]}
{"title": "Socio-technical networks: a tool for integrating the maintenance dimension in the design of equipment for small food-processing units in Western Africa\n", "abstract": " In Burkina Faso, as in other Western African countries, maintenance in small food-processing units is carried out by several actors. These actors form an informal network and contribute to ensuring that equipment is operationally available in a more or less satisfactory manner. Our field studies have revealed how important informal networks are in the economic life of African countries, especially those in West Africa. This paper describes a formal method for representing and analysing sociotechnical maintenance networks and proposes its integration within the wider framework of the CESAM design method. Three types of equipment illustrate the above hypothesis. Lessons learned from the analysis of the representations have served as a basis for an improvement of the CESAM design methodology that ensure that, during the design phase, the maintenance aspects are reasonably tackled.", "num_citations": "1\n", "authors": ["864"]}
{"title": "Gestion des informations dans les espaces de travail collaboratif en conception de produit.\n", "abstract": " Gestion des informations dans les espaces de travail collaboratif en conception de produit. - Université Grenoble Alpes Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support Portail HAL de l'Université Grenoble Alpes HAL archives-ouvertes.fr Accueil Rechercher Déposer Consulter Services hal-00186054, version 1 Chapitre d'ouvrage Gestion des informations dans les espaces de travail collaboratif en conception de produit. Khadidja Grebici 1 Eric Blanco 2 Jean-François Boujut 2 Onour Hisarciklilar 2 Détails 1 CC GILCO - Gestion Industrielle Logistique et Conception 2 G-SCOP_CC - Conception collaborative G-SCOP - Laboratoire des sciences pour la conception, l'optimisation et la production Type de …", "num_citations": "1\n", "authors": ["864"]}
{"title": "Knowledge management system for cognitive synchronization in collaborative design\n", "abstract": " Collaborative designs generally result in artefacts' solutions which are enriched by the multiple expertise and skills of the designers engaged in the design task. However, because designers have their own knowledge, expertise and insight, reaching a shared point of view from multiple and not necessarily coherent ones is difficult and often leads to conflicts during the design stage. To address this problem, we describe a new methodology for modelling the conflict management process and its implementation in a Web-based multi-agent system for advanced concurrent design and manufacturing with emphasize on the concept of “cognitive synchronisation” and “design rational” for building a shared point of view and thus reaching a “satisfying” solution.", "num_citations": "1\n", "authors": ["864"]}
{"title": "développement de pratiques collaboratives en ingénierie de produits\n", "abstract": " Développement de pratiques collaboratives en ingénierie de produits - Université Grenoble Alpes Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support Portail HAL de l'Université Grenoble Alpes HAL archives-ouvertes.fr Accueil Rechercher Déposer Consulter Services hal-00377035, version 1 Communication dans un congrès Développement de pratiques collaboratives en ingénierie de produits J. Chartier Jean-François Boujut 1 Guy Prudhomme 1 Détails 1 G-SCOP_CC [?-] - Conception collaborative [?-] G-SCOP [2006-2015] - Laboratoire des sciences pour la conception, l'optimisation et la production [2006-2015] Type de document : Communication dans un congrès Domaine : Sciences de l'…", "num_citations": "1\n", "authors": ["864"]}
{"title": "Conception de nouveaux produits mécaniques\n", "abstract": " Conception de nouveaux produits mécaniques - Université Grenoble Alpes Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support Portail HAL de l'Université Grenoble Alpes HAL archives-ouvertes.fr Accueil Rechercher Déposer Consulter Services hal-00366926, version 1 Chapitre d'ouvrage Conception de nouveaux produits mécaniques Jean-François Boujut 1 Détails 1 G-SCOP_CC - Conception collaborative G-SCOP - Laboratoire des sciences pour la conception, l'optimisation et la production Type de document : Chapitre d'ouvrage Domaine : Sciences de l'ingénieur [physics] / Mécanique [physics.med-ph] / Génie mécanique [physics.class-ph] Physique [physics] / Mécanique [physics] / Génie …", "num_citations": "1\n", "authors": ["864"]}