{"title": "Managing technical debt with the sqale method\n", "abstract": " To date, several methods are available for estimating the technical debt present in an application's source code. The SQALE (software quality assessment based on life-cycle expectations) method provides guidance for managing this debt. This article provides some implementation recommendations the authors learned from coaching and assisting large organizations in setting up and using SQALE.", "num_citations": "145\n", "authors": ["387"]}
{"title": "The SQALE method for evaluating technical debt\n", "abstract": " This paper presents the SQALE (Software Quality Assessment Based on Lifecycle Expectations) method. We describe its Quality Model and Analysis Model which is used to estimate the Quality and the Technical Debt of an application source code. We provide recommendations and guidelines for using the SQALE indicators in order to analyse the structure and the impact of the Technical Debt.", "num_citations": "145\n", "authors": ["387"]}
{"title": "The sqale analysis model: An analysis model compliant with the representation condition for assessing the quality of software source code\n", "abstract": " This paper presents the analysis model of the assessment method of software source code SQALE (Software Quality Assessment Based on Lifecycle Expectations). We explain what brought us to develop consolidation rules based in remediation indices. We describe how the analysis model can be implemented in practice.", "num_citations": "74\n", "authors": ["387"]}
{"title": "The sqale models for assessing the quality of real time source code\n", "abstract": " We need standardized methods to objectively evaluate the quality of an application's source code. The hope is that over time, standards for doing such assessments will emerge, generalizing their use. Aiming to contribute to this standardization process, we present in this paper two elements of the SQALE (Software Quantitative Assessment based on Lifecycle Expectations) method used by DNV IT Global Services: the Quality Model and the Analysis Model.By construction, the SQALE Quality Model has two main advantages: it is organized in layers and can be understood using two different viewpoints: the point of view of the developer and the point of view of the owner or user. The SQALE Analysis Model is based on the concept of a remediation index. The purpose is to objectively rate and quantify the characteristics of a piece of software. A concrete example of the joint use of the two models is presented here.", "num_citations": "7\n", "authors": ["387"]}
{"title": "Managing large application portfolio with technical debt related measures\n", "abstract": " This presentation will show how some large organizations use some specific indexes and indicators of the SQALE method to manage the health of their software assets and optimize their maintenance budget.", "num_citations": "4\n", "authors": ["387"]}