{"title": "Blockchain Technology Innovations\n", "abstract": " Digital world has produced efficiencies, new innovative products, and close customer relationships globally by the effective use of mobile, IoT (Internet of Things), social media, analytics and cloud technology to generate models for better decisions. Blockchain is recently introduced and revolutionizing the digital world bringing a new perspective to security, resiliency and efficiency of systems. While initially popularized by Bitcoin, Blockchain is much more than a foundation for crypto currency. It offers a secure way to exchange any kind of good, service, or transaction. Industrial growth increasingly depends on trusted partnerships; but increasing regulation, cybercrime and fraud are inhibiting expansion. To address these challenges, Blockchain will enable more agile value chains, faster product innovations, closer customer relationships, and quicker integration with the IoT and cloud technology. Further Blockchain …", "num_citations": "346\n", "authors": ["1963"]}
{"title": "Server Virtualization Architecture and Implementation\n", "abstract": " Virtual machine technology, or virtualization, is gaining momentum in the information technology community. While virtual machines are not a new concept, recent advances in hardware and software technology have brought virtualization to the forefront of IT management. Stability, cost savings, and manageability are among the reasons for the recent rise of virtualization. Virtual machine solutions can be classified by hardware, software, and operating system/containers. From its inception on the mainframe to distributed servers on x86, the virtual machine has matured and will play an increasing role in systems management.", "num_citations": "131\n", "authors": ["1963"]}
{"title": "Blockchain technology, cognitive computing, and healthcare innovations\n", "abstract": " Exponential growth of the impact of information technology innovation is an indispensable part of today’s industry. Blockchain technology has identified itself as an efficiency booster and service optimization for financial industries. Yet non-financial venues have gained little benefit from this new major horizon, Blockchain technology. It offers a secure way to exchange any kind of good, service, or transaction. Industrial growth increasingly depends on trusted partnerships; but increasing regulation, cybercrime and fraud are inhibiting expansion. Blockchain enables more agile value chains, faster product innovations, closer customer relationships, and faster integration with the Internet of Things (IoT) and cloud technology. Now with Cloud and Blockchain technologies providing high computing power and network capabilities, cognitive systems are available tools to deepen the relationship between humans and the world. Many problems that have been with our society for a long time can be solved. Cognitive systems are the tools to accomplish that ambitious goal. This study is continuing our effort on surveying the applicability of Blockchain technology innovation in nonfinance (non-bitcoin). The study concluded with discussing opportunities and challenges of the application of two intrahorizons of Blockchain technology, Cognitive Computing and Healthcare.", "num_citations": "27\n", "authors": ["1963"]}
{"title": "The internet of things, artificial intelligence, blockchain, and professionalism\n", "abstract": " This article describes how technology can be impactful when applied to solve precise and measurable problems. Technologies such as Al, TOT, RPA, and blockchain hold tremendous potential when integrated for specific solutions. In addition to these technologies, the professional designers, engineers, and developers are fundamental to solving problems. People are our most critical element in envisioning the future and solving challenges with the help of technologies. We recognize that in order to truly maximize our efforts with these technologies, the solutions must be used within the ethics of our communities, with a responsibility to safeguard the public's health, safety, security, and environment with a minimum standard of care ultimately governed by people in a constantly evolving network. With proper oversight on a secure platform and architecture, we will see that the convergence of ToT/RPA, Al, and …", "num_citations": "20\n", "authors": ["1963"]}
{"title": "A pervasive review of blockchain technology and its potential applications\n", "abstract": " In today’s digital age, a sizable data handling is a foremost concern topic for researchers. The several applications like big data, data analysis, Image processing, data mining are required processing of large amount of data. The Blockchain is a distributed ledger technology that stores information across various systems securely to enable peer-to-peer transactions by creating a reliable source of truth dig out mediating the so-called intermediaries of trust. A Blockchain is a technology for constructing distinguished types of distributed databases composed of unswerving blocks of data, each containing a list of transactions and a peerless reference to its predecessor block. The Blockchain based applications are springing up, covering a lot of fields, including reputation system, Internet of Things (IoT,) big data, and financial services, and so on. This technique is a shared, distributed ledger that makes easier the process of recording transactions and tracking assets in a business network. In this paper, we aimed to demonstrate a close-up view about Blockchain technology. We also provide an overview of Blockchain architecture, differentiate different Block chain and how Blockchain works. With the swiftness of its growth and development, we trust that Blockchain will soon become a very common and prominent phenomenon.", "num_citations": "11\n", "authors": ["1963"]}
{"title": "Assured Identity for the Cloud\n", "abstract": " It has been widely reported the largest security concerns with cloud computing design and implementation are centered on identity and access management. Pearson (2009) identifies open security challenges such as where processing takes place, auditability of transactions, and data sensitivity in distributed systems. Cloud computing builds on prior research in virtualization, distributed computing, utility computing, networking, and web services (Vouk, 2008).", "num_citations": "2\n", "authors": ["1963"]}
{"title": "A raspberry pi and lxc based distributed computing testbed\n", "abstract": " With the development of the teaching and research of big data processing and distributed algorithms, there emerges an increasing need to leverage low-cost hardware to build the distributed computing test environment for the purpose of the algorithm validation and experiment simulation. In this paper, we propose a distributed computing testbed using the affordable Raspberry Pi board as the basic computing unit. We develop a cluster platform by building and assembling the units, and design a containerized service-computing framework by merging LXC and service computing techniques. Three kinds of services are introduced and configured to implement specific workflow orchestration on demand. For convenience, we develop a visualized user interface to manage cluster, deploy service containers, and manage workflows. We present the containerized service workflow that links the components of data source …", "num_citations": "1\n", "authors": ["1963"]}