{"title": "Software project control centers: concepts and approaches\n", "abstract": " On-line interpretation and visualization of project data are gaining increasing importance on the long road towards predictable and controllable software project execution. In the context of software development, only few techniques exist for supporting these tasks. This is caused particularly by the often insufficient use of engineering principles in the software development domain. Beyond that, interpretation and visualization techniques from other domains (such as business or production processes) are not directly applicable to software processes because of the specific characteristics of software development. A software project control center (SPCC) is a means for collecting, interpreting, and visualizing measurement data in order to provide purpose- and role-oriented information to all involved parties (e.g., project manager, quality assurer) during the execution of a project. This article presents a reference model …", "num_citations": "95\n", "authors": ["1996"]}
{"title": "Development of a hybrid cost estimation model in an iterative manner\n", "abstract": " Cost estimation is a very crucial field for software developing companies. The acceptance of an estimation technique is highly dependent on estimation accuracy. Often, this accuracy is only determined after an initial application. Possible further steps for improving the underlying estimation model typically do not influence the decision on whether to discard the technique or deploy it. In addition, most estimation techniques do not explicitly support the evolution of the underlying estimation model in an iterative manner. This increases the risk of overlooking some important cost drivers or data inconsistencies. This paper presents an enhanced process for developing a CoBRA® cost estimation model by systematically including iterative analysis and feedback cycles, and its evaluation in a software development unit of Oki Electric Industry Co., Ltd., Japan. During the model improvement cycles, estimation accuracy was …", "num_citations": "58\n", "authors": ["1996"]}
{"title": "Aligning software projects with business objectives\n", "abstract": " Companies increasingly recognize that software and IT play a significant role for their current and future business strategies. Therefore, it is important to align IT/software-related strategies with the business goals across the organization. Currently, little experience exists regarding how to effectively create this missing business-IT link. For this purpose, the GQM+Strategies ®  approach was developed to support companies in aligning IT/software-related strategies with business goals through measurement. This paper focuses on facilitating the approach for aligning IT/software projects with an organization's higher-level goals. Lessons learned from applying the approach in the context of the Japanese Information-technology Promotion Agency (IPA), specifically its Software Engineering Center (SEC), are presented. The transparent documentation of goals and strategies, and the collection of key performance …", "num_citations": "30\n", "authors": ["1996"]}
{"title": "Evaluating software project control centers in industrial environments\n", "abstract": " Many software development organizations still lack support for detecting and reacting to critical project states in order to achieve planned goals. One means to institutionalize project control, systematic quality assurance, and management support on the basis of measurement and explicit models is the establishment of so-called software project control centers. However, there is only little experience reported in the literature with respect to setting up and applying such control centers in industrial environments. One possible reason is the lack of appropriate evaluation instruments (such as validated questionnaires and appropriate analysis procedures). Therefore, we developed an initial measurement instrument to systematically collect experience with respect to the deployment and use of control centers. Our main research goal was to develop and evaluate the measurement instrument. The instrument is based on …", "num_citations": "28\n", "authors": ["1996"]}
{"title": "Goal-oriented setup and usage of custom-tailored software cockpits\n", "abstract": " Software Cockpits, also known as Software Project Control Centers, support the management and controlling of software and system development projects and provide means for quantitative measurement-based project control. Currently, many companies are developing simple control dashboards that are mainly based on Spreadsheet applications. Alternatively, they use solutions providing a fixed set of project control functionality that cannot be sufficiently customized to their specific needs and goals. Specula is a systematic approach for defining reusable, customizable control components and instantiate them according to different organizational goals and characteristics based on the Quality Improvement Paradigm (QIP) and GQM. This article gives an overview of the Specula approach, including the basic conceptual model, goal-oriented measurement, and the composition of control components based …", "num_citations": "23\n", "authors": ["1996"]}
{"title": "Exploiting Big Data's Benefits\n", "abstract": " Knowing about big data's potential for exploiting new business ideas is a key capability for staying successful in the market. Potential analysis provides a systematic way to identify and close the gap between big data's possible benefits and the ability to turn that data into business value.", "num_citations": "22\n", "authors": ["1996"]}
{"title": "Empirical results from using custom-made software project control centers in industrial environments\n", "abstract": " One means for institutionalizing project control, systematic quality assurance, and management support on the basis of measurement and explicit models is the establishment of so-called Software Project Control Centers. Nowadays many companies develop their own dashboards for project control or use off-the-shelf tools that provide a predefined functionality. It is not clear how to tailor an existing tool to the specific needs and goals. An engineering-like approach providing the methodological foundation is needed for systematically defining and applying project control mechanisms.\" Soft-Pit\" is a research project focusing on an improvement-oriented approach for setting up and applying project control mechanisms in a goal-oriented way and evaluating the practical benefits of such a control center. This article describes the results of industrial case studies conducted in the context of the project. Moreover, lessons …", "num_citations": "22\n", "authors": ["1996"]}
{"title": "GQM+ Strategies in a Nutshell\n", "abstract": " This chapter introduces the GQM+Strategies approach for aligning organizational goals and strategies through measurement. We first explain the basic idea of combining alignment and measurement within GQM+Strategies, which provides an integrated method for explicitly defining organizational goals and controls for the execution of those plans. Next, we describe in detail the core components of GQM+Strategies. This includes a specification of the GQM+Strategies model as well as the description of the GQM+Strategies process for defining, controlling, and continuously improving organizational goals and strategies.", "num_citations": "16\n", "authors": ["1996"]}
{"title": "Usage Scenarios for Measurement-based Project Control\n", "abstract": " Many software development organizations still lack support for obtaining intellectual control over their development processes. This includes determining the performance of their processes and the quality of their products as well as the ability to react in a way that intended project and product goals can be fulfilled. Systematic support for detecting and reacting to critical project states in order to achieve planned goals is usually missing. One means to institutionalize project control, systematic quality assurance, and management support on the basis of measurement and explicit models is the establishment of so-called Software Project Control Centres. From a research perspective, the set-up of such control centres is a challenging task: The metrics to be used typically need to be tailored to business goals and to the development context; appropriate interpretation and control techniques need to be combined to aggregate the information; different stakeholders require quite different visualizations for decision support. From a practical viewpoint, the deployment of a control centre is challenging because it needs to be tailored and integrated into a specific development environment that is often characterized by multi-disciplinary, distributed development. This requires careful analysis of usage scenarios for such control centres and smooth integration into the management and quality assurance processes of an organization. This article will give an introduction to basic control centre concepts and discuss their usage, exemplified by several typical scenarios from industry. Each scenario is described in the context of a related business goal, which should …", "num_citations": "16\n", "authors": ["1996"]}
{"title": "Big Data in Smart Ecosystems\n", "abstract": " Die Diskussion über Big Data ist viel mehr als die klassische Analyse von Internetdaten. Im Zeitalter von Industrie 4.0 und dem Aufkommen von Cyber-Physical Systems und schlussendlich hochgradig integrierten Smart Ecosystems geht es darum, einen tatsächlich greifbaren Mehrwert aus einem schier unendlich großen Datenschatz zu schaffen. Dabei gilt es einerseits, die funktionale Sicherheit der beteiligten eingebetteten Systeme nicht zu gefährden, und andererseits, die Sicherheit der Daten innerhalb eines Smart Ecosystems nachhaltig sicherzustellen. Dies stellt die Voraussetzung dar, um eine Akzeptanz derartiger Systeme langfristig zu erreichen. Der vorliegende Beitrag zeigt einige zentrale Aspekte auf, die es bei der Umsetzung von Big-Data-Systemen in Smart Ecosystems zu beherrschen gilt. Des Weiteren werden mögliche Applikationsszenarien, die alle Bereiche der Industrie und Wirtschaft …", "num_citations": "15\n", "authors": ["1996"]}
{"title": "People-oriented capture, display, and use of process information\n", "abstract": " Project success demands that process performers have accurate, up-todate information about the activities they should perform, any constraints upon activity performance, and guidance about how to effectively and efficiently perform their activities. The goal of this chapter is to describe support for people-oriented capture, display, and use of process information that experience has shown is highly beneficial. The chapter reviews several state-of-the-art approaches for supporting people-oriented process performance, illustrates challenges of providing this support, and presents experience from practice. We describe different kinds of process knowledge and discuss a method for collecting one kind of process knowledge – measurement data – in a goal-oriented way. We present different ways to display process information in order to satisfy information needs of people involved in a software development project …", "num_citations": "15\n", "authors": ["1996"]}
{"title": "Towards Guidelines for Assessing Qualities of Machine Learning Systems\n", "abstract": " Nowadays, systems containing components based on machine learning (ML) methods are becoming more widespread. In order to ensure the intended behavior of a software system, there are standards that define necessary quality aspects of the system and its components (such as ISO/IEC 25010). Due to the different nature of ML, we have to adjust quality aspects or add additional ones (such as trustworthiness) and be very precise about which aspect is really relevant for which object of interest (such as completeness of training data), and how to objectively assess adherence to quality requirements. In this article, we present the construction of a quality model (i.e., evaluation objects, quality aspects, and metrics) for an ML system based on an industrial use case. This quality model enables practitioners to specify and assess quality requirements for such kinds of ML systems objectively. In the future, we …", "num_citations": "13\n", "authors": ["1996"]}
{"title": "Visualization of software and systems as support mechanism for integrated software project control\n", "abstract": " Many software development organizations still lack support for obtaining intellectual control over their software development processes and for determining the performance of their processes and the quality of the produced products. Systematic support for detecting and reacting to critical process and product states in order to achieve planned goals is usually missing. One means to institutionalize measurement on the basis of explicit models is the development and establishment of a so-called Software Project Control Center (SPCC) for systematic quality assurance and management support. An SPCC is comparable to a control room, which is a well known term in the mechanical production domain. One crucial task of an SPCC is the systematic visualization of measurement data in order to provide context-, purpose-, and role-oriented information for all stakeholders (e.g., project managers, quality …", "num_citations": "12\n", "authors": ["1996"]}
{"title": "Future Skills: Ansätze zur Vermittlung von Data Literacy in der Hochschulbildung\n", "abstract": " Die Fähigkeit, planvoll mit Daten umzugehen und sie im jeweiligen Kontext bewusst einsetzen und hinterfragen zu können wird im Zuge der digitalen Transformationen von zunehmender Wichtigkeit und stellt eine zentrale Kompetenz in allen Sektoren und Disziplinen dar. Auf der einen Seite werden Data Scientists benötigt, die in der Lage sind, speziell mit großen heterogenen Daten umzugehen und die Technologie rund um den Big-Data-Lifecycle beherrschen, um schnell Entscheidungen basierend auf Daten und daraus abgeleiteten Informationen ermöglichen zu können. Auf der anderen Seite werden in der Breite in allen Sektoren und Disziplinen Personen benötigt, welche die Fähigkeit besitzen, Daten auf kritische Art und Weise zu sammeln, zu managen, zu bewerten und anzuwenden. Diese Fähigkeiten werden unter dem Begriff Data Literacy zusammengefasst.", "num_citations": "11\n", "authors": ["1996"]}
{"title": "Requirements-driven method to determine quality characteristics and measurements for machine learning software and its evaluation\n", "abstract": " As the applications of machine learning algorithms in various fields are widely demanded, the development of machine learning software systems (MLS) is rapidly increasing. The quality of MLS is different from that of conventional software systems, in the sense that it depends on the amount and distribution of training data in a model learning and input data during operation. This is a major challenge in quality assurance of MLS development for the enterprise. In this paper, we propose a requirements-driven method to determine the quality characteristics of the MLS. Major contributions of this paper include: (1) Extending the quality characteristics of ISO 25010, which defines the conventional software quality, to those unique to MLS; this paper also defines its measuring method. (2) A method to identify requirements, i.e., issues to be determined in the requirements definition, in order to derive the quality …", "num_citations": "9\n", "authors": ["1996"]}
{"title": "Cost-efficient customisation of software cockpits by reusing configurable control components\n", "abstract": " Detecting and reacting to critical project states in order to achieve planned goals is one key issue in performing a software development project successfully and staying competitive as a software development company. Software Cockpits, also known as Software Project Control Centres, support the management and controlling of software and system development projects and provide a single point of project control. One key element of such cockpits is the analysis, interpretation, and visualisation of measurement data in order to support various stakeholders for different purposes. Currently, many companies develop their own cockpits (typically simple dashboards) that are mainly based on Spreadsheet applications. Alternatively, they use dashboard solutions that provide a fixed set of predefined functions for project control that cannot be sufficiently customised to their own development environment. Most of the more generic approaches for control centres offer only partial solutions and lack purpose-and role-oriented data interpretation and visualisation based on a flexible set of control techniques that can be customised according to planned goals in a cost-efficient way. A systematic approach for defining reusable, customisable control components and instantiate them according to different organisational goals and characteristics is basically missing. This article gives an overview of the Specula project control framework and illustrates how to employ it for implementing project control mechanisms. The focus is on how to describe and combine control components in a generic way and how to select the right components based on explicitly …", "num_citations": "8\n", "authors": ["1996"]}
{"title": "Construction of a quality model for machine learning systems\n", "abstract": " Nowadays, systems containing components based on machine learning (ML) methods are becoming more widespread. In order to ensure the intended behavior of a software system, there are standards that define necessary qualities of the system and its components (such as ISO/IEC 25010). Due to the different nature of ML, we have to re-interpret existing qualities for ML systems or add new ones (such as trustworthiness). We have to be very precise about which quality property is relevant for which entity of interest (such as completeness of training data or correctness of trained model), and how to objectively evaluate adherence to quality requirements. In this article, we present how to systematically construct quality models for ML systems based on an industrial use case. This quality model enables practitioners to specify and assess qualities for ML systems objectively. In addition to the overall construction …", "num_citations": "5\n", "authors": ["1996"]}
{"title": "A Deployment Process for Strategic Measurement Systems\n", "abstract": " Explicitly linking software-related activities to an organisation's higher-level goals has been shown to be critical for organizational success. GQM+Strategies provides mechanisms for explicitly linking goals and strategies, based on goal-oriented strategic measurement systems. Deploying such strategic measurement systems in an organization is highly challenging. Experience has shown that a clear deployment strategy is needed for achieving sustainable success. In particular, an adequate deployment process as well as corresponding tool support can facilitate the deployment. This paper introduces the systematical GQM+Strategies deployment process and gives an overview of GQM+Strategies modelling and associated tool support. Additionally, it provides an overview of industrial applications and describes success factors and benefits for the usage of GQM+Strategies.", "num_citations": "5\n", "authors": ["1996"]}
{"title": "Messung und Bewertung von Software\n", "abstract": " Software bestimmt unser Leben. Sowohl ihr Nutzen als auch die damit verbundenen Risiken wachsen ständig. Das Wissen um Software, ihre Entwicklung und die vielfältigen Anwendungsmöglichkeiten ist Voraussetzung für die Beherrschung ihrer ständig wachsenden Komplexität. Softwaremessung und -bewertung ist die Disziplin in der Softwaretechnik und Informatik, die sich mit der quantitativen Behandlung von Eigenschaften von Softwareprodukten, -prozessen und -projekten befasst. Dabei geht es um die Nutzung von Softwaremessungen, also das Einführen von Messsystemen, das Extrahieren von Messdaten, das Evaluieren der Softwarequalität und das Entscheiden über Verbesserungsmaßnahmen, um bestimmte Ziele, wie beispielsweise Projektkontrolle, Fehlerreduktion oder Effizienzsteigerung, zu erreichen. In diesem Beitrag werden der Stand der Softwaremessung dargestellt, einige aktuelle …", "num_citations": "5\n", "authors": ["1996"]}
{"title": "Product-Focused Software Process Improvement\n", "abstract": " On behalf of the PROFES Organizing Committee, we are proud to present the proceedings of the 14th International Conference on Product-Focused Software Process Improvement (PROFES 2013) held in Paphos, Cyprus. Since 1999, PROFES has established itself as one of the recognized international process improvement conferences. The main theme of PROFES is professional software process improvement (SPI) motivated by product, process, and service quality needs. PROFES 2013 addressed both quality engineering and management topics, including processes, methods, techniques, tools, organizations, and enabling SPI. Solutions found in practice and relevant research results from academia were presented.The technical program was selected by a committee of leading experts in software process improvement, software process modeling, and empirical software engineering research. This year, 41 …", "num_citations": "5\n", "authors": ["1996"]}
{"title": "Messbasierte Ausrichtung von Softwarestrategien an Geschäftszielen\n", "abstract": " Die Beherrschung von Risiken, die mit der Softwareentwicklung und der Bereitstellung von IT-Diensten verbunden sind, ist von besonderer Wichtigkeit für die Unternehmensperformance. Dazu ist es erforderlich, den Zusammenhang zwischen Geschäftszielen und Software-bzw. IT-Strategien durchgängig über die gesamte Organisation zu managen. Der GQM+ Strategies®-Ansatz leistet dies durch den Einsatz zielgerichteter Messverfahren.", "num_citations": "5\n", "authors": ["1996"]}
{"title": "Soft-Pit: Ganzheitliche Projekt-Leitstände zur ingenieurmäßigen Software-Projektdurchführung\n", "abstract": " Prozesstransparenz wird immer wichtiger bei der Entwicklung softwareintensiver Systeme. Mit Projekt-Leitständen lässt sich diese herstellen: Sie helfen, Risiken frühzeitig zu erkennen sowie effektiv zu reduzieren und steigern damit letztlich die Budget-und Termintreue. Ähnlich wie beim Cockpit eines Flugzeugs oder einem Fertigungsleitstand ist für die Softwareentwicklung ein Instrument zur ganzheitlichen Kontrolle und Steuerung der einzelnen Entwicklungsschritte und Resultate notwendig. Daher etablieren sich in Unternehmen vermehrt Leitstände, mit denen vorhandene Informationen zielorientiert gebündelt und nachvollziehbar aufbereitet werden, damit Managemententscheidungen effektiv getroffen werden können. Im Unterschied zu traditionellen Dashboards lassen sich damit individuelle Metriken erfassen und nutzerspezifisch im Kontext der Unternehmensziele interpretieren. Ziel des Verbundvorhabens Soft-Pit ist die Bereitstellung von ganzheitlichen Projekt-Leitständen, mit denen alle für eine ingenieurmäßige Software-Projektdurchführung relevanten Aspekte analysiert, Fehlentwicklungen zeitnah erkannt und effektive Gegenmaßnahmen abgeleitet werden können. Soft-Pit ist in drei Iterationen organisiert, in denen Teile des ganzheitlichen Leitstandes entwickelt und in industriellen Fallstudien erprobt werden. Das Projekt befindet sich zurzeit in der Durchführungsphase der ersten Fallstudien. Hierzu wurden die Zielsetzungen der Fallstudiengeber systematisch erfasst, Indikatoren zur Projektkontrolle abgeleitet und ein erstes Leitstand-Inkrement entwickelt, das bei den Fallstudiengebern zum Einsatz kommt. Der vorliegende Artikel …", "num_citations": "5\n", "authors": ["1996"]}
{"title": "Software Effort Estimation and Risk Management\n", "abstract": " Every software business has to be able to budget and plan its software development projects realistically. Since software projects are usually fraught with uncertainty, they inherently involve planning risks right from the start. Consequently, it is important to manage cost-related risks in order to monitor them and implement adequate contingency plans when a crisis occurs. Since not all projects are equal, it is important to identify the specific factors (cost drivers) that have a positive or negative influence on productivity. Thus, the use of appropriate cost estimation approaches does not only contribute to accurate project planning and successful risk management, but also to improved software processes and overall organization maturity.", "num_citations": "4\n", "authors": ["1996"]}
{"title": "Strukturen und Kollaborationsformen zur Vermittlung von Data-Literacy-Kompetenzen\n", "abstract": " Hierfür sind einerseits spezialisierte Fachkräfte von Nöten, die so genannten Data Scientists, welche sich auf den Umgang mit Big Data konzentrieren. Andererseits wird heutzutage in allen Sektoren und Fächern bis hin zum gebildeten Bürger ein gewisses Grundwissen im Umgang mit Daten und entsprechenden Werkzeugen zur Datenverarbeitung gefordert, um datengestützt arbeiten und wohlfundierte Entscheidungen treffen zu können.", "num_citations": "3\n", "authors": ["1996"]}
{"title": "Systems Engineering as an Enabler for Future Innovation\n", "abstract": " Autonomous driving, Industrie 4.0, IoT, or Big Data represent innovations for which software is the enabler. This trend from software engineering to systems engineering is made stronger by the fact that systems are being integrated across the boundaries of their traditional domains. The article will give an introduction to why efficient Systems Engineering is important to cope with future product trends. This will be further elaborated by the key outcomes of a conducted study regarding the challenges companies see in the area of systems engineering and best practices in terms of techniques, methods, and tools they apply for coping with the challenges. Lastly, a concrete use case from the German reference project on developing the basic platform for Industrie 4.0 will be introduced as an example on how good Systems Engineering capabilities act as an enabler for implementing innovative systems solutions.", "num_citations": "3\n", "authors": ["1996"]}
{"title": "Goal‐oriented customization of software cockpits\n", "abstract": " Software cockpits, also known as Software Project Control Centers, support the management and controlling of software and system development projects and provide means for quantitative, measurement‐based project control. Currently, many companies are developing simple control dashboards that are mainly based on Spreadsheet applications. Alternatively, they use solutions providing a fixed set of project control functionalities that cannot be sufficiently customized to their specific needs and goals. Specula is a systematic approach for defining reusable, customizable control components and instantiating them according to different organizational goals and characteristics based on the Quality Improvement Paradigm (QIP) and the Goal Question Metric (GQM) approach. This article gives an overview of the Specula approach, including the basic conceptual model, goal‐oriented composition of control centers …", "num_citations": "3\n", "authors": ["1996"]}
{"title": "Software productivity and effort estimation\n", "abstract": " Every software business has to be able to budget and plan its software development projects realistically. This is the prerequisite for professional project management, for competitive offers, and for a more objective assessment of the offers made by potential contractors. In order to achieve these objectives, a software business must be capable of estimating their own productivity in developing software at an appropriate level of quality and produce accurate estimates for the effort required to develop software.Since 1999, the International Conference on Product-Focused Software Process Improvement (PROFES) has established itself as one of the most recognized international conferences on professional software process improvement (SPI) motivated by product, process, and service quality needs. PROFES addresses both quality engineering and management topics, including processes, methods, techniques …", "num_citations": "2\n", "authors": ["1996"]}
{"title": "Quality improvement through visualization of software and systems\n", "abstract": " Many organizations still lack support for obtaining control over their system development processes and for determining the performance of their processes and the quality of the produced products. Systematic support for detecting and reacting to critical process and product states in order to achieve planned goals is often missing. As systems and software become bigger and more complex, classic approaches reach their limits, due to the difficulty of extracting relevant information from a large volume of measures. Here, suitable visualization and virtual reality solutions can offer a clear advantage by representing the relevant information in a more easily recognizable form. However, many resulting visualizations are still hard to understand, even for experts. This opens the door for researching modern, human-centered approaches that provide the user with visualization and interaction models for visually analyzing and understanding the underlying complex data. This chapter focuses on two main topics: system visualization and software visualization.Software visualization continues a very successful direction of software engineering, namely the topic of “software measuring/software analysis”. Software visualization in general does more than visualizing the product “software” itself. Visualization mechanisms are also typically applied to software development processes and to support the tracking of project progress (eg, as a central component in project dashboards).", "num_citations": "2\n", "authors": ["1996"]}
{"title": "Implementing Software Project Control Centers: An Architectural View\n", "abstract": " Setting up effective and efficient mechanisms for controlling software and system development projects is still challenging in industrial practice. On the one hand, necessary prerequisites such as established development processes, understanding of cause-effect relationships on relevant indicators, and sufficient sustainability of measurement programs are often missing. On the other hand, there are more fundamental methodological deficits related to the controlling process itself and to appropriate tool support. Additional activities that would guarantee the usefulness, completeness, and precision of the resulting controlling data are widely missing. This article presents a conceptual architecture for so-called Software Project Control Centers (SPCC) that addresses these challenges. The architecture includes mechanisms for getting sufficiently precise and complete data and supporting the information needs of …", "num_citations": "2\n", "authors": ["1996"]}
{"title": "A Practical Way to Use Clustering and Context Knowledge for Software Project Planning.\n", "abstract": " The use of empirical data from past projects for project planning is gaining increasing importance in engineering-style software development. Since software development projects are unique, experience from these projects cannot be reused directly. Nevertheless, common patterns can often be found when comparing past projects. This information can then be used to better support project planning. The article sketches the SPRINT I technique for project planning and controlling. The approach is grounded on the usage and analysis of context-oriented cluster curves. The article focuses on two aspects: How to identify similar projects and build so-called clusters with typical data curves (such as effort distribution); and how to characterize these clusters by using context knowledge. This allows for assigning a new project to a cluster in order to obtain a prediction. Results from an evaluation with data from 25 projects show that the technique provides a practical way to increase the accuracy of software project planning by using empirical data.", "num_citations": "2\n", "authors": ["1996"]}
{"title": "TOOL-BASED SOFTWARE PROJECT CONTROL\n", "abstract": " Developing software and systems in a way that entails plannable project execution and predictable product quality requires the use of quantitative data for project control. In the context of software development, few techniques exist for supporting on-line monitoring, interpretation, and visualization of project data. This is caused particularly by the often insufficient use of such engineering principles as experience-based planning and plan-based execution in the software development domain. However, effective software project control requires integrated tool support for capturing, managing, analyzing, and storing data. In addition, advanced control approaches aim at providing purpose- and role-oriented information to all involved parties (e.g. project manager, quality assurer) during the execution of a project. This chapter introduces the concept of a so-called Software Project Control Center (SPCC), sketches a …", "num_citations": "2\n", "authors": ["1996"]}
{"title": "Empfehlungen für Masterstudiengänge „Data Science “–auf Basis eines Bachelors in (Wirtschafts-) Informatik oder Mathematik\n", "abstract": " Auch wenn wir keine konkreten Empfehlungen für die Aufteilung von Lerninhalten zwischen Bachelor und Master für konsekutive Studiengänge geben, können Lerninhalte analog zur Betrachtung von Bachelorstudiengängen in Data Science behandelt werden. Ein* e wie oben beschriebene* r Bachelorabsolvent* in bringt–auf einer niedrigeren Ebene der kognitiven Durchdringung–bereits die wesentlichen Kompetenzen mit, die im Masterstudium entsprechend vertieft werden können. Wir empfehlen, entsprechende Vertiefungsmöglichkeiten in allen im Arbeitspapier genannten Kompetenzbereichen vorzusehen.", "num_citations": "1\n", "authors": ["1996"]}
{"title": "未来のイノベーションを牽引するシステムズエンジニアリング: German Industrie 4.0 の事例から (特集 システムズエンジニアリング)\n", "abstract": " ※ 3 同研究所組込みソフトウェア部門責任者. 組込みソフトウェア・アーキテクチャと仮想エンジニアリングについての研究を行っている.※ 4 同研究所組込みシステム部門のプロジェクト・マネージャ. システム要求エンジニアリングについて研究している.※ 5 同研究所組込みソフトウェア部門のプロジェクト・マネージャ. 組込みソフトウェア・アーキテクチャと仮想エンジニアリングについて研究している.※ 6 ボッシュ・レックスロス社において, コンピューター技術者としてテクニカル・ソリューション アーキテクト兼システムエンジニアの任にあり, 製造 IoT でのコンセプト開発とユースケース実装を担当している.", "num_citations": "1\n", "authors": ["1996"]}
{"title": "Using Cluster Curves to Control Software Development Projects\n", "abstract": " Online interpretation and visualization of project data are gaining increasing importance on the long road towards predictable and controllable software project execution. This paper sketches the Sprint I controlling approach for software development projects and gives first evaluation results. The approach is grounded on the usage of context-oriented cluster curves and integrated in the framework of software project control centers.", "num_citations": "1\n", "authors": ["1996"]}
{"title": "Context-driven Software Project Estimation\n", "abstract": " Using quantitative data from past projects for software project estimation requires context knowledge that characterizes its origin and indicates its applicability for future use. This article sketches the SPRINT I technique for project planning and controlling. The underlying prediction mechanism is based on the identification of similar past projects and the building of so-called clusters with typical data curves. The article focuses on how to characterize these clusters with context knowledge and how to use context information from actual projects for prediction. The SPRINT approach is tool-supported and first evaluations have been conducted.", "num_citations": "1\n", "authors": ["1996"]}
{"title": "Continuous Process Improvement\n", "abstract": " Nowadays, a variety of different processes for the development and maintenance of software-intensive systems exists, ranging from agile development processes to classical plan-based approaches. There is no ultimate process that can be applied in each and every situation. It depends on the project goals and environment as well as on the required characteristics of the system under development. Development processes support organizations in developing software-intensive systems with certain quality characteristics, within a certain time span, and requiring a certain amount of effort. Continuous process improvement deals with the establishment and maintenance of high-quality processes, with analyzing their performance and effectiveness, and with initiating corresponding improvement actions if needed. In this chapter, we will take a closer look at how to systematically define and continuously improve …", "num_citations": "1\n", "authors": ["1996"]}
{"title": "Tutorial: business IT alignment using the GQM+ Strategies® approach\n", "abstract": " Most of today’s products and services are software-based. Organizations that develop software want to maintain and improve their competitiveness by controlling software-related risks. To do this, they need to align their business goals with software development strategies and translate them into quantitative project management. There is also an increasing need to justify cost and resources for software and system development and other IT services by demonstrating their impact on an organization’s higher-level goals. For both, linking business goals and software-related efforts in an organization is necessary. However, this is a challenging task, and there is a lack of methods addressing this gap.", "num_citations": "1\n", "authors": ["1996"]}
{"title": "GQM+Strategies®: Experiences from Industrial Case Studies and Visualization Needs\n", "abstract": " Explicitly linking software-related activities to an organization’s higher-level goals has been shown to be critical for several purposes such as aligning activities to strategies or linking budgets to strategic objectives. GQM+Strategies® provides mechanisms for explicitly linking goals and strategies in an organization based on goal-oriented measurement. Developing strategic measurement systems with GQM+ Strategies® requires that higher-level decision makers are involved and that, as a consequence, their information needs are addressed. Experience has shown that it is important to use adequate representations for decision makers when involving them in the definition of strategic measurement systems. This article sketches practical experience from three industrial pilot studies that applied the method, derives requirements for representing strategic measurement systems to decision makers in an adequate format, and proposes visualization mechanisms that can contribute to the fulfillment of the stated requirements. In the conclusion, next steps and future research questions are sketched.", "num_citations": "1\n", "authors": ["1996"]}