{"title": "Evolving spiking neural networks for online learning over drifting data streams\n", "abstract": " Nowadays huge volumes of data are produced in the form of fast streams, which are further affected by non-stationary phenomena. The resulting lack of stationarity in the distribution of the produced data calls for efficient and scalable algorithms for online analysis capable of adapting to such changes (concept drift). The online learning field has lately turned its focus on this challenging scenario, by designing incremental learning algorithms that avoid becoming obsolete after a concept drift occurs. Despite the noted activity in the literature, a need for new efficient and scalable algorithms that adapt to the drift still prevails as a research topic deserving further effort. Surprisingly, Spiking Neural Networks, one of the major exponents of the third generation of artificial neural networks, have not been thoroughly studied as an online learning approach, even though they are naturally suited to easily and quickly adapting to …", "num_citations": "47\n", "authors": ["1094"]}
{"title": "Adaptive long-term traffic state estimation with evolving spiking neural networks\n", "abstract": " Due to the nature of traffic itself, most traffic forecasting models reported in literature aim at producing short-term predictions, yet their performance degrades when the prediction horizon is increased. The scarce long-term estimation strategies currently found in the literature are commonly based on the detection and assignment to patterns, but their performance decays when unexpected events provoke non predictable changes, or if the allocation to a traffic pattern is inaccurate. This work introduces a method to obtain long-term pattern forecasts and adapt them to real-time circumstances. To this end, a long-term estimation scheme based on the automated discovery of patterns is proposed and integrated with an on-line change detection and adaptation mechanism. The framework takes advantage of the architecture of evolving Spiking Neural Networks (eSNN) to perform adaptations without retraining the model …", "num_citations": "43\n", "authors": ["1094"]}
{"title": "DRED: An evolutionary diversity generation method for concept drift adaptation in online learning environments\n", "abstract": " Nowadays fast-arriving information flows lay the basis of many data mining applications. Such data streams are usually affected by non-stationary events that eventually change their distribution (concept drift), causing that predictive models trained over these data become obsolete and do not adapt suitably to the new distribution. Specially in online learning scenarios, there is a pressing need for new algorithms that adapt to this change as fast as possible, while maintaining good performance scores. Recent studies have revealed that a good strategy is to construct highly diverse ensembles towards utilizing them shortly after the drift (independently from the type of drift) to obtain good performance scores. However, the existence of the so-called trade-off between stability (performance over stable data concepts) and plasticity (recovery and adaptation after drift events) implies that the construction of the ensemble …", "num_citations": "24\n", "authors": ["1094"]}
{"title": "Community detection in graphs based on surprise maximization using firefly heuristics\n", "abstract": " The detection of node clusters (communities) in graphs has been at the core of many modeling paradigms emerging in different fields and disciplines such as Social Sciences, Biology, Chemistry, Telecommunications and Linguistics. When evaluating the quality of a clustering arrangement unsupervised metrics can be utilized (e.g. modularity), which all rely on structural and topological characteristics of the cluster space rather than on an observed ground of truth that should be achieved. One of such metrics is the recently published Surprise, which evaluates how statistically unlikely a given clustering arrangement is with respect to a random network featuring the same distribution of nodes per cluster. To maximize this metric, a number of algorithms have been proposed in the literature, but their comparative performance varies significantly between networks of different shape and size. In this article a novel heuristic …", "num_citations": "14\n", "authors": ["1094"]}
{"title": "Cognitive Workload Classification using Eye-tracking and EEG Data\n", "abstract": " It has been shown that an increased mental workload in pilots could lead to a decrease in their situation awareness, which could lead, in turn, to a worse piloting performance and ultimately to critical human errors. Assessing the current pilot's psycho-physiological state is a hot topic of interest for developing advanced embedded cockpits systems capable of adapting their behavior to the state and performance of the pilot. In this work, we investigate a method to classify different levels of cognitive workload starting from synchronized EEG and eye-tracking information. The classifier object of the research is targeted to score a performance high enough to be applicable as a gauge for performance of unobtrusive monitoring systems working with data of lower quality.", "num_citations": "12\n", "authors": ["1094"]}
{"title": "Unsupervised anomaly detection in stream data with online evolving spiking neural networks\n", "abstract": " Unsupervised anomaly discovery in stream data is a research topic with many practical applications. However, in many cases, it is not easy to collect enough training data with labeled anomalies for supervised learning of an anomaly detector in order to deploy it later for identification of real anomalies in streaming data. It is thus important to design anomalies detectors that can correctly detect anomalies without access to labeled training data. Our idea is to adapt the Online evolving Spiking Neural Network (OeSNN) classifier to the anomaly detection task. As a result, we offer an Online evolving Spiking Neural Network for Unsupervised Anomaly Detection algorithm (OeSNN-UAD), which, unlike OeSNN, works in an unsupervised way and does not separate output neurons into disjoint decision classes. OeSNN-UAD uses our proposed new two-step anomaly detection method. Also, we derive new theoretical …", "num_citations": "10\n", "authors": ["1094"]}
{"title": "Deep echo state networks for short-term traffic forecasting: Performance comparison and statistical assessment\n", "abstract": " In short-term traffic forecasting, the goal is to accurately predict future values of a traffic parameter of interest occurring shortly after the prediction is queried. The activity reported in this long-standing research field has been lately dominated by different Deep Learning approaches, yielding overly complex forecasting models that in general achieve accuracy gains of questionable practical utility. In this work we elaborate on the performance of Deep Echo State Networks for this particular task. The efficient learning algorithm and simpler parametric configuration of these alternative modeling approaches make them emerge as a competitive traffic forecasting method for real ITS applications deployed in devices and systems with stringently limited computational resources. An extensive comparison benchmark is designed with real traffic data captured over the city of Madrid (Spain), amounting to more than 130 Automatic …", "num_citations": "9\n", "authors": ["1094"]}
{"title": "Multifactorial cellular genetic algorithm (MFCGA): algorithmic design, performance comparison and genetic transferability analysis\n", "abstract": " Multitasking optimization is an incipient research area which is lately gaining a notable research momentum. Unlike traditional optimization paradigm that focuses on solving a single task at a time, multitasking addresses how multiple optimization problems can be tackled simultaneously by performing a single search process. The main objective to achieve this goal efficiently is to exploit synergies between the problems (tasks) to be optimized, helping each other via knowledge transfer (thereby being referred to as Transfer Optimization). Furthermore, the equally recent concept of Evolutionary Multitasking (EM) refers to multitasking environments adopting concepts from Evolutionary Computation as their inspiration for the simultaneous solving of the problems under consideration. As such, EM approaches such as the Multifactorial Evolutionary Algorithm (MFEA) has shown a remarkable success when dealing with …", "num_citations": "9\n", "authors": ["1094"]}
{"title": "Drift detection over non-stationary data streams using evolving spiking neural networks\n", "abstract": " Drift detection in changing environments is a key factor for those active adaptive methods which require trigger mechanisms for drift adaptation. Most approaches are relied on a base learner that provides accuracies or error rates to be analyzed by an algorithm. In this work we propose the use of evolving spiking neural networks as a new form of drift detection, which resorts to the own architectural changes of this particular class of models to estimate the drift location without requiring any external base learner. By virtue of its inherent simplicity and lower computational cost, this embedded approach can be suitable for its adoption in online learning scenarios with severe resource constraints. Experiments with synthetic datasets show that the proposed technique is very competitive when compared to other drift detection techniques.", "num_citations": "8\n", "authors": ["1094"]}
{"title": "On the creation of diverse ensembles for nonstationary environments using bio-inspired heuristics\n", "abstract": " Recently the relevance of adaptive models for dynamic data environments has turned into a hot topic due to the vast number of scenarios generating nonstationary data streams. When a change (concept drift) in data distribution occurs, the ensembles of models trained over these data sources are obsolete and do not adapt suitably to the new distribution of the data. Although most of the research on the field is focused on the detection of this drift to re-train the ensemble, it is widely known the importance of the diversity in the ensemble shortly after the drift in order to reduce the initial drop in accuracy. In a Big Data scenario in which data can be huge (and also the number of past models), achieving the most diverse ensemble implies the calculus of all possible combinations of models, which is not an easy task to carry out quickly in the long term. This challenge can be formulated as an optimization problem …", "num_citations": "5\n", "authors": ["1094"]}
{"title": "Identifying recommendation opportunities for computer‐supported collaborative environments\n", "abstract": " Collaborative indicators derived from participants' interactions can be used to support and improve their collaborative behaviour. In this research, we focus on automatically identifying recommendation opportunities in the Collaborative Logical Framework from participants' interactions. Different information sources have been considered: (a) statistical collaborative indicators; (b) social interactions; (c) opinions received by the participants via ratings; and (d) users' affective state and personality. The recommendations have been elicited considering the generality and transferability of the participants' interactions provided by the Collaborative Logical Framework. As a result, three scenarios have been identified that lead us to propose meaningful grouping suggestions and recommendations, which ultimately aimed to ground an informed personalized support to the participants in intensive collaborative frameworks.", "num_citations": "5\n", "authors": ["1094"]}
{"title": "AT-MFCGA: An Adaptive Transfer-guided Multifactorial Cellular Genetic Algorithm for Evolutionary Multitasking\n", "abstract": " Transfer Optimization is an incipient research area dedicated to solving multiple optimization tasks simultaneously. Among the different approaches that can address this problem effectively, Evolutionary Multitasking resorts to concepts from Evolutionary Computation to solve multiple problems within a single search process. In this paper we introduce a novel adaptive metaheuristic algorithm to deal with Evolutionary Multitasking environments coined as Adaptive Transfer-guided Multifactorial Cellular Genetic Algorithm (AT-MFCGA). AT-MFCGA relies on cellular automata to implement mechanisms in order to exchange knowledge among the optimization problems under consideration. Furthermore, our approach is able to explain by itself the synergies among tasks that were encountered and exploited during the search, which helps us to understand interactions between related optimization tasks. A comprehensive …", "num_citations": "4\n", "authors": ["1094"]}
{"title": "On the transferability of knowledge among vehicle routing problems by using cellular evolutionary multitasking\n", "abstract": " Multitasking optimization is a recently introduced paradigm, focused on the simultaneous solving of multiple optimization problem instances (tasks). The goal of multitasking environments is to dynamically exploit existing complementarities and synergies among tasks, helping each other through the transfer of genetic material. More concretely, Evolutionary Multitasking (EM) regards to the resolution of multitasking scenarios using concepts inherited from Evolutionary Computation. EM approaches such as the well-known Multifactorial Evolutionary Algorithm (MFEA) are lately gaining a notable research momentum when facing with multiple optimization problems. This work is focused on the application of the recently proposed Multifactorial Cellular Genetic Algorithm (MFCGA) to the well-known Capacitated Vehicle Routing Problem (CVRP). In overall, 11 different multitasking setups have been built using 12 datasets …", "num_citations": "4\n", "authors": ["1094"]}
{"title": "Road traffic forecasting using neucube and dynamic evolving spiking neural networks\n", "abstract": " This paper presents a new approach for spatio-temporal road traffic forecasting that relies on the adoption of the NeuCube architecture based on spiking neural networks. The NeuCube platform was originally conceived and designed to process electroencephalographic (EEG) signals considering their temporal component and their spatial source within the brain. Its neural representation allows for a visual analysis of connectivity among different locations, and also provides a prediction tool harnessing the predictive learning capabilities of dynamic evolving Spiking Neural Networks (deSNNs). Taking advantage of the NeuCube features, this work focuses on the potential of spatially-aware traffic variable forecasts, as well as on the exploration of the spatio-temporal relationships among different sensor locations within a traffic network. Its performance, assessed over real traffic data collected in 51 locations in …", "num_citations": "4\n", "authors": ["1094"]}
{"title": "A probabilistic sample matchmaking strategy for imbalanced data streams with concept drift\n", "abstract": " In the last decade the interest in adaptive models for non-stationary environments has gained momentum within the research community due to an increasing number of application scenarios generating non-stationary data streams. In this context the literature has been specially rich in terms of ensemble techniques, which in their majority have focused on taking advantage of past information in the form of already trained predictive models and other alternatives alike. This manuscript elaborates on a rather different approach, which hinges on extracting the essential predictive information of past trained models and determining therefrom the best candidates (intelligent sample matchmaking) for training the predictive model of the current data batch. This novel perspective is of inherent utility for data streams characterized by short-length unbalanced data batches, situation where the so-called trade-off between …", "num_citations": "4\n", "authors": ["1094"]}
{"title": "New perspectives on the use of online learning for congestion level prediction over traffic data\n", "abstract": " This work focuses on classification over time series data. When a time series is generated by non-stationary phenomena, the pattern relating the series with the class to be predicted may evolve over time (concept drift). Consequently, predictive models aimed to learn this pattern may become eventually obsolete, hence failing to sustain performance levels of practical use. To overcome this model degradation, online learning methods incrementally learn from new data samples arriving over time, and accommodate eventual changes along the data stream by implementing assorted concept drift strategies. In this manuscript we elaborate on the suitability of online learning methods to predict the road congestion level based on traffic speed time series data. We draw interesting insights on the performance degradation when the forecasting horizon is increased. As opposed to what is done in most literature, we provide …", "num_citations": "3\n", "authors": ["1094"]}
{"title": "Stream Learning in Energy IoT Systems: A Case Study in Combined Cycle Power Plants\n", "abstract": " The prediction of electrical power produced in combined cycle power plants is a key challenge in the electrical power and energy systems field. This power production can vary depending on environmental variables, such as temperature, pressure, and humidity. Thus, the business problem is how to predict the power production as a function of these environmental conditions, in order to maximize the profit. The research community has solved this problem by applying Machine Learning techniques, and has managed to reduce the computational and time costs in comparison with the traditional thermodynamical analysis. Until now, this challenge has been tackled from a batch learning perspective, in which data is assumed to be at rest, and where models do not continuously integrate new information into already constructed models. We present an approach closer to the Big Data and Internet of Things paradigms, in which data are continuously arriving and where models learn incrementally, achieving significant enhancements in terms of data processing (time, memory and computational costs), and obtaining competitive performances. This work compares and examines the hourly electrical power prediction of several streaming regressors, and discusses about the best technique in terms of time processing and predictive performance to be applied on this streaming scenario. View Full-Text", "num_citations": "3\n", "authors": ["1094"]}
{"title": "Concept Tracking and Adaptation for Drifting Data Streams under Extreme Verification Latency\n", "abstract": " When analyzing large-scale streaming data towards resolving classification problems, it is often assumed that true labels of the incoming data are available right after being predicted. This assumption allows online learning models to efficiently detect and accommodate non-stationarities in the distribution of the arriving data (concept drift). However, this assumption does not hold in many practical scenarios where a delay exists between predicted and class labels, to the point of lacking this supervision for an infinite period of time (extreme verification latency). In this case, the development of learning algorithms capable of adapting to drifting environments without any external supervision remains a challenging research area to date. In this context, this work proposes a simple yet effective learning technique to classify non-stationary data streams under extreme verification latency. The intuition motivating the …", "num_citations": "2\n", "authors": ["1094"]}
{"title": "Multi-objective heuristics applied to robot task planning for inspection plants\n", "abstract": " Robotics are generally subject to stringent operational conditions that impose a high degree of criticality on the allocation of resources and the schedule of operations in mission planning. In this regard the so-called cost of a mission must be considered as an additional criterion when designing optimal task schedules within the mission at hand. Such a cost can be conceived as the impact of the mission on the robotic resources themselves, which range from the consumption of battery to other negative effects such as mechanic erosion. This manuscript focuses on this issue by presenting experimental results obtained over realistic scenarios of two heuristic solvers (MOHS and NSGA-II) aimed at efficiently scheduling tasks in robotic swarms that collaborate together to accomplish a mission. The heuristic techniques resort to a Random-Keys encoding strategy to represent the allocation of robots to tasks whereas the …", "num_citations": "2\n", "authors": ["1094"]}
{"title": "Rank Aggregation for Non-stationary Data Streams\n", "abstract": " We consider the problem of learning over non-stationary ranking streams. The rankings can be interpreted as the preferences of a population and the non-stationarity means that the distribution of preferences changes over time. Our goal is to learn, in an online manner, the current distribution of rankings. The bottleneck of this process is a rank aggregation problem. We propose a generalization of the Borda algorithm for non-stationary ranking streams. Moreover, we give bounds on the minimum number of samples required to output the ground truth with high probability. Besides, we show how the optimal parameters are set. Then, we generalize the whole family of weighted voting rules (the family to which Borda belongs) to situations in which some rankings are more \\textit{reliable} than others and show that this generalization can solve the problem of rank aggregation over non-stationary data streams.", "num_citations": "1\n", "authors": ["1094"]}
{"title": "LUNAR: Cellular automata for drifting data streams\n", "abstract": " With the advent of fast data streams, real-time machine learning has become a challenging task, demanding many processing resources. In addition, they can be affected by the concept drift effect, by which learning methods have to detect changes in the data distribution and adapt to these evolving conditions. Several emerging paradigms such as the so-called Smart Dust, Utility Fog, or Swarm Robotics are in need for efficient and scalable solutions in real-time scenarios, and where usually computing resources are constrained. Cellular automata, as low-bias and robust-to-noise pattern recognition methods with competitive classification performance, meet the requirements imposed by the aforementioned paradigms mainly due to their simplicity and parallel nature. In this work we propose LUNAR, a streamified version of cellular automata devised to successfully meet the aforementioned requirements. LUNAR is …", "num_citations": "1\n", "authors": ["1094"]}
{"title": "Modelling gene interaction networks from time-series gene expression data using evolving spiking neural networks.\n", "abstract": " The genetic mechanisms responsible for the differentiation, metabolism, morphology and function of a cell in both normal and abnormal conditions can be uncovered by the analysis of transcriptomes. Mining big data such as the information encoded in nucleic acids, proteins, and metabolites has challenged researchers for several years now. Even though bioinformatics and system biology techniques have improved greatly and many are the advancements in these fields of research, most of the processes that influence gene interaction over time are still unknown. In this study, we apply state-of-the art spiking neural network (SNN) techniques to model, analyse and extract information about the regulatory processes of gene expression over time. A case study of microarray profiling in human skin during elicitation of eczema is used to examine the temporal association of genes involved in the inflammatory response, by means of a gene interaction network (GIN). SNN techniques are able to learn the interaction between genes using information encoded from the time-series gene expression data as spikes. The temporal interaction is learned, and the patterns of activity extracted and analysed with a GIN. Results demonstrated that useful knowledge can be extracted from the data by using SNN, unlocking some of the possible mechanisms involved in the regulatory process of gene expression.", "num_citations": "1\n", "authors": ["1094"]}
{"title": "Towards semantic descriptions of collaboration indicators to support collaboration models transferability\n", "abstract": " Students around the world are currently taking advantage of e-learning platforms to support their learning, and one of the most important features in some of these platforms is their support for collaborative learning. In this context, a collaboration analysis is necessary to ascertain whether collaboration takes place. Having this in mind, data mining techniques are often used to identify student collaboration indicators based on their forum interactions (see relevant literature elsewhere). The Collaborative Logical Framework (CLF) system, based on an approach used by international Cooperation Agencies, sets guidelines to promote participation in CSCL [1]. It is fully integrated into dotLRN/OpenACS as one of its packages and consists of making the students work consecutively in three ways: 1) solving tasks individually 2) working in cooperation with their colleagues’ to improve own solutions, and 3) working all together to reach an agreement for the joint solution. Moreover, the system gathers the students’ performance to infer how they work in the course. By means of a varied number of metrics, derived from the analysis of forum interactions, the system provides their behavior related to the collective task. In particular, these metrics focus on ratings given to their colleagues’ contributions, on the revised versions they create of their solutions after the colleagues feedback received, and studying the actions they carry out before and after a specific interaction. This information helps the student and the tutor to monitor the tasks, and on the other it is used to get collaborative indicators, which define the learner’s reputation. Domain-independent statistical …", "num_citations": "1\n", "authors": ["1094"]}