{"title": "Value-based requirements engineering: exploring innovative e-commerce ideas\n", "abstract": " Innovative e-commerce ideas are characterised by commercial products yet unknown to the market, enabled by information technology such as the Internet and technologies on top of it. How to develop such products is hardly known. We propose an interdisciplinary approach, e                    3                  -value, to explore an innovative e-commerce idea with the aim of understanding such an idea thoroughly and evaluating it for potential profitability. Our methodology exploits a requirements engineering way of working, but employs concepts and terminology from business science, marketing and axiology. It shows how to model business requirements and improve business–IT alignment, in sophisticated multi-actor value constellations that are common in electronic commerce. In addition to the e                    3                  -value approach methodology, we also present the action research-based development of our …", "num_citations": "1240\n", "authors": ["1464"]}
{"title": "Designing and evaluating e-business models\n", "abstract": " Business models are usually represented by a mixture of informal textual, verbal, and ad-hoc graphical representations. However, these representations typically limit a clear understanding of the e-business issues that confront the stakeholders, and often perpetuate the existing gap between business executives and the IT developers who must create the e-business information systems. This article presents a conceptual modeling approach to e-business—called e3-value—that is designed to help define how economic value is created and exchanged within a network of actors. Doing e-business well requires the formulation of an e-business model that will serve as the first step in requirements analysis for e-business information systems. The industry currently lacks adequate methods for formulating these kinds of requirements. Methods from the IT systems analysis domain generally have a strong technology bias and typically do not reflect business considerations very well. Meanwhile, approaches from the business sciences often lack the rigor needed for information systems development. A tighter integration of business and IT modeling would most certainly benefit the industry, because the integration of business and IT systems is already a distinct feature of e-business. This article shows some ways to achieve this kind of modeling integration. Our e3-value method is based on an economic valueoriented ontology that specifies what an e-business model is made of. In particular, it entails defining, deriving, and analyzing multi-enterprise relationships, e-business scenarios, and operations requirements in both qualitative and quantitative ways …", "num_citations": "1123\n", "authors": ["1464"]}
{"title": "Business modelling is not process modelling\n", "abstract": " Innovative e-business projects start with a design of the e-business model. We often encounter the view, in research as well as industry practice, that an e-business model is similar to a business process model, and so can be specified using UML activity diagrams or Petri nets. In this paper, we explain why this is a misunderstanding. The root cause is that a business model is not about process but about value exchanged between actors. Failure to make this separation of concerns leads to poor business decision-making and inadequate business requirements.", "num_citations": "503\n", "authors": ["1464"]}
{"title": "e-Service Design Using i* and e3value Modeling\n", "abstract": " Two requirements engineering techniques, i* and e 3  value, work together to explore commercial e-services from a strategic-goal and profitability perspective. We demonstrate our approach using a case study on Internet radio", "num_citations": "289\n", "authors": ["1464"]}
{"title": "Value webs: Using ontologies to bundle real-world services\n", "abstract": " Real-world services - that is, nonsoftware-based services - differ significantly from Web services, usually defined as software functionality accessible and configurable over the Web. Because of the economic, social, and business importance of the service concept in general, we believe it's necessary to rethink what this concept means in an ontological and computational sense. We deal about the OBELIX (ontology-based electronic integration of complex products and value chains) project has therefore developed a generic component-based ontology for real-world services. This OBELIX service ontology is first of all a formalization of concepts that represent the consensus in the business science literature on service management and marketing. We express our service ontology in a graphical, network-style representation, and we've developed support tools that facilitate end-user modeling of services. Then …", "num_citations": "269\n", "authors": ["1464"]}
{"title": "Comparing two business model ontologies for designing e-business models and value constellations\n", "abstract": " Business models have been an important topic in various disciplines and particularly ebusiness. Yet, little research has tempted to compare and integrate the different business model approaches. This paper compares two business model ontologies, the Business Model Ontology BMO and the e3value ontology, for the design of business models and value constellations. For that purpose it introduces a framework that allows the comparison of different conceptual approaches to business models. The two ontologies are illustrated through a case study in the domain of rights music management. The outcome of the analysis is twofold. Firstly, it permits a better understanding of business model research. Secondly, it highlights the possible paths to integrate the two ontologies in order to improve the representation, design, and analysis of business models.", "num_citations": "267\n", "authors": ["1464"]}
{"title": "A shared service terminology for online service provisioning\n", "abstract": " An extensive literature research in the fields of IT and business science reveals that service-related terms as service and e-service have multiple interpretations within business science, information science and computer science, resulting in confusion. These three communities take part in the multi-disciplinary process of realizing e-Commerce scenarios for services. Each community has its own role in e-service offering, and uses its own terminology. In this paper we analyze the different perspectives that these three communities have on the online service provisioning concept. We introduce different meanings of service-related terms in the three communities, and use a real-world case study to show how all three perspectives and terminologies need to be joined with each other for the realization of collaborative e-Commerce scenarios for service offerings on the Semantic Web. An extensive literature research in the …", "num_citations": "229\n", "authors": ["1464"]}
{"title": "Towards a reference ontology for business models\n", "abstract": " Ontologies are viewed as increasingly important tools for structuring domains of interests. In this paper we propose a reference ontology of business models using concepts from three established business model ontologies; the REA, BMO, and e3-value. The basic concepts in the reference ontology concern actors, resources, and the transfer of resources between actors. Most of the concepts in the reference ontology are taken from one of the original ontologies, but we have also introduced a number of additional concepts, primarily related to resource transfers between business actors. The purpose of the proposed ontology is to increase the understanding of the original ontologies as well as the relationships between them, and also to seek opportunities to complement and improve on them.", "num_citations": "218\n", "authors": ["1464"]}
{"title": "Business models for distributed generation in a liberalized market environment\n", "abstract": " The analysis of the potential of emerging innovative technologies calls for a systems-theoretic approach that takes into account technical as well as socio-economic factors. This paper reports the main findings of several business case studies of different future applications in various countries of distributed power generation technologies, all based on a common methodology for networked business modeling and analysis.", "num_citations": "177\n", "authors": ["1464"]}
{"title": "What’s in an electronic business model?\n", "abstract": " An electronic business model is an important baseline for the development of e-commerce system applications. Essentially, it provides the design rationale for e-commerce systems from the business point of view. However, how an e-business model must be defined and specified is a largely open issue. Business decision makers tend to use the notion in a highly informal way, and usually there is a big gap between the business view and that of IT developers. Nevertheless, we show that conceptual modelling techniques from IT provide very useful tools for precisely pinning down what e-business models actually are, as well as for their structured specification. We therefore present a (lightweight) ontology of what should be in an e-business model. The key idea we propose and develop is that an e-business model ontology centers around the core concept of value, and expresses how value is created …", "num_citations": "172\n", "authors": ["1464"]}
{"title": "Agent-based electricity balancing with distributed energy resources, a multiperspective case study\n", "abstract": " Distributed generation (DG) of electricity is providing an increasing part of the worldwide electricity supply. At the same time, there is a big potential of demand response resources. When - in a geographical area or in the contract portfolio of an energy trader - the number of these distributed energy resources (DER) increases, clustered control of DER by common ICT (information and communication technology) systems can add value. Due to the fine-grained and distributed nature of DER, the design of such a system needs to meet heavy requirements, e.g. regarding scalability and openness. Further, these systems need to balance multiple stakes in a multi-actor environment. Multiagent systems, especially those based on electronic markets have been identified as key technologies in this respect. This paper presents a multiperspective case study of the design, implementation and performance of such a system for …", "num_citations": "104\n", "authors": ["1464"]}
{"title": "E³-value in a Nutshell\n", "abstract": " Innovative e-commerce ideas have in common that they are hardly understood by the stakeholders involved, caused by hardly known products such innovative ideas contain by definition. For a better understanding of these ideas, we propose the e³-value methodology, which helps in eliciting, analyzing, evaluating e-commerce ideas. This paper summarizes the e³-value methodology, by explaining the concepts used to represent an e-commerce idea, and a by presenting a way of working with these concepts. The methodology is exemplified by a small running case study.", "num_citations": "81\n", "authors": ["1464"]}
{"title": "Using conceptual models to explore business-ICT alignment in networked value constellations\n", "abstract": " In this paper, we introduce e                 3                 alignment for inter-organizational business-ICT alignment. With the e                 3                 alignment framework, we create alignment between organizations operating in an agile networked value constellation—which is a set of organizations who jointly satisfy a customer need—by (1) focusing on the interaction between the organizations in the constellation, (2) considering interaction from four different perspectives, and (3) utilizing conceptual modeling techniques to analyze and create alignment within and between the perspectives. By creating inter-organizational business-ICT alignment between the actors in the constellation, e                 3                 alignment ultimately contributes to a sustainable and profitable constellation. To actually create alignment, e                 3                 alignment iteratively takes three specific steps: (1) identification of alignment issues …", "num_citations": "72\n", "authors": ["1464"]}
{"title": "Value based requirements creation for electronic commerce applications\n", "abstract": " Electronic commerce applications have special features compared to conventional information systems. First, because electronic commerce usually involves yet nonexisting business activities, requirements for e-commerce applications have to be created from scratch rather than elicited. Second, design decisions about e-business models and the associated information systems architecture cannot be sequentially made in a decoupled way, because business and technology considerations are strongly linked. On these counts, current methodology for requirements engineering is inadequate for electronic commerce applications. We outline a structured approach to e-commerce requirements creation. This e/sup 3/-VALUE approach enables one to clarify business model decisions to be made by management, by modelling the end-to-end value activities and exchanges in the e-commerce stakeholder network. In …", "num_citations": "68\n", "authors": ["1464"]}
{"title": "A design methodology for modeling trustworthy value webs\n", "abstract": " This paper introduces a design methodology for business modeling from two perspectives. The value-web perspective models the creation, distribution, and consumption of goods or services of economic value in a network of multiple enterprises and end-consumers. The goal is to create a shared understanding for all the actors and to assess profitability. The trust perspective describes how value webs can be expanded with trustworthy control procedures. The goal is to enhance the mutual confidence of the actors so as to enable trading. A formal theory for the design of trustworthy control procedures in the setting of the e3value methodology is outlined.", "num_citations": "66\n", "authors": ["1464"]}
{"title": "E-business value modelling using the e3-value ontology\n", "abstract": " A first step in developing e-Business ideas is to understand such an idea thoroughly. In the recent past, industry has clearly demonstrated that such an understanding lacks or at least is insufficient, resulting in failures and sometimes bankruptcies. In this chapter we present an approach to design an e-Business model, called the e3-value approach. This approach is ontologically founded in business science, marketing and axiology, but exploits rigorous conceptual modelling as a way of working known from computer science. The aim is that an e3-value e-Business model contributes to a better and shared understanding of the idea at stake, specifically with respect to its profit drivers. If the model is attributed with various assumptions, such as economic valuation of objects produced, distributed, and consumed, we can derive profitability sheets using the business model. These can be used to assess whether the idea …", "num_citations": "63\n", "authors": ["1464"]}
{"title": "Ontology-based operators for e-business model de-and reconstruction\n", "abstract": " We define e-business models as conceptual models that show how a network of actors (a value constellation) creates, exchanges and consumes objects of value by performing value adding activities. In this paper we present a semi-formal ontology-based representation of e-business models that is useful in carrying out a preliminary business and requirements analysis. In particular, we show that a small set of generic'model deconstruction'operators is able to generate design variations on a given e-business model, so that upfront analysis of the characteristics and consequences of a range of alternative e-business models becomes possible. We illustrate our ontology-based e 3-value approach by a commercial project on Internet news services.", "num_citations": "63\n", "authors": ["1464"]}
{"title": "Toward a modeling tool for designing control mechanisms for network organizations\n", "abstract": " In network organizations and e-commerce, control mechanisms to guarantee interorganizational contract compliance enhance trust that business transactions are fair. In this paper, we propose a design technology, called e3-control, to develop such controls. The e3-control design methodology is an extension of the e3-value design methodology for business models, which models economic-value exchanges, rather than operational processes, between the organizations in a network. A methodology for designing control mechanisms should include three steps: (1) design an interorganizational value-exchange model of the network, (2) analyze interorganizational control problems within the network (i.e., possible violations of contractual obligations related to the value model), and (3) design control mechanisms to detect or prevent such control problems. The usability of the proposed e3-control design methodology …", "num_citations": "57\n", "authors": ["1464"]}
{"title": "Control patterns in a health-care network\n", "abstract": " To keep a network of enterprises sustainable, inter-organizational control measures are needed to detect or prevent opportunistic behaviour of network participants. We present a requirements engineering method for understanding control problems and designing solutions, based on an economic value perspective. The methodology employs a library of so-called control patterns, inspired by design patterns in software engineering. A control pattern is a generic solution for a common control problem. The usefulness and adequacy of the control patterns is demonstrated by a case study of the governance and control mechanisms of the Dutch public health insurance network for exceptional medical expenses (AWBZ).", "num_citations": "56\n", "authors": ["1464"]}
{"title": "Business case modelling for e-services\n", "abstract": " In this paper we show how business value modelling and enterprise architecture can blend into an integral approach for modelling e-services business cases. The approach, building upon e3value and ArchiMate, allows to link revenues and cost in a single model. The approach is illustrated on by the business case model of a virtual laboratory in the process industry. First experiences have shown significant value in the approach for different stakeholders (managers and engineers).", "num_citations": "55\n", "authors": ["1464"]}
{"title": "Fuzzy verification of service value networks\n", "abstract": " Service Value Networks (SVNs) represent a flexible design for service suppliers to offer attractive value propositions to final customers. Furthermore, networked services can satisfy more complex customer needs than single services acting on their own. Although, SVNs can cover complex needs, there is usually a mismatch between what the SVNs offer and what the customer needs. We present a framework to achieve SVN composition by means of the propose-critique-modify (PCM) problem-solving method and a Fuzzy Inference System (FIS). Whereas the PCM method composes alternative SVNs given some customer need, the FIS verifies the fitness of the composed SVNs for the given need. Our framework offers not only an interactive dialogue in which the customer can refine the composed SVNs but also visualizes the final composition, by making use of e                 3                 -valuemodels. Finally, the …", "num_citations": "49\n", "authors": ["1464"]}
{"title": "Bridging business value models and process models in aviation value webs via possession rights\n", "abstract": " While exploring value Webs - cooperating enterprises - it is common to view such Webs from multiple perspectives: (1) the business value perspective, (2) the business process perspective, and (3) the information system perspective. The value perspective explains why a Web can exist from a commercial perspective, whereas the process perspective shows the interacting processes of enterprises and the IT perspectives shows the supporting IT architecture. These perspectives each take a different view on the same phenomenon: the value Web. Because the phenomenon is for each viewpoint the same the perspectives need to be consistent. This paper introduces an approach to arrive at a business process model of a value Web that is consistent with a business value model of the same value Web. We propose a step-wise approach that starts with considering the independent transfer of ownership right of a value …", "num_citations": "48\n", "authors": ["1464"]}
{"title": "Does e-business modeling really help?\n", "abstract": " Many innovative e-business ideas are hardly understood by their stakeholders when articulated, just by words. To create a better, also shared, understanding, and to enhance confidence in the feasibility of such verbal ideas, we have developed a model-based e-business development approach called e/sup 3/-value. But does a model-based approach really contribute to the development of innovative e-business ideas? To answer this question, we report on an innovative e-business idea about online news provisioning which has been explored, using our e/sup 3/-value approach, and which has been implemented afterwards. To see the merits of e/sup 3/-value we revisited, this project one-year-and-a-half after its implementation. It then shows up that indeed a modeling approach contributes to e-business development, but also some important lessons can be learned, to improve our methodology.", "num_citations": "48\n", "authors": ["1464"]}
{"title": "Dynamic cluster-based service bundling: A value-oriented framework\n", "abstract": " In this paper we present a framework for dynamic service bundling, which focuses on the exchange of valuable outcomes between customers and service suppliers. The approach is based on three components: A customer, a broker and a pool of suppliers. The broker is in charge of matching the customer and supplier perspectives and performing a cluster-based bundling process. The applicability of our approach is proven by means of a case study in the educational service industry.", "num_citations": "43\n", "authors": ["1464"]}
{"title": "Developing ICT services in a low-resource development context.\n", "abstract": " Despite an urgent need for social and technological innovation to improve wellbeing of people and communities in poor regions of the world, information and communications technology (ICT) service delivery has not yet been very successful in regions with low levels of literacy, poor infrastructures, and limited purchasing power. High rates of failure, reported in various studies, point at a frequent mismatch between deployed technologies and local needs and contexts. Still, no practical field-validated methodologies for ICT service innovation in low-resource development contexts have been proposed that offer adequate ways to meet local needs and contexts and assess sustainability before deployment. This paper outlines a framework for development of ICT services in low-resource development contexts, covering the full lifecycle of ICT service innovation. This framework is based on extensive field research, and shows how a collaborative, adaptive, and iterative methodology can address a set of key sociotechnical concerns and issues widely encountered in developing and emerging countries.", "num_citations": "41\n", "authors": ["1464"]}
{"title": "Serviguration: Towards online configurability of real-world services\n", "abstract": " Current eCommerce is still mainly characterized by the relatively straightforward trading of commodity goods. Nextgeneration efforts in worldwide information infrastructure, especially the Semantic Web and Web Services, contribute some necessary, but not sufficient, steps on the way to much more advanced business scenarios, such as collaborative design over the Internet of sophisticated goods and services. This paper discusses additional steps needed to achieve collaborative eCommerce concerned with real-world services. First, a component-based description of services and what they contain is needed, such that electronic design and production of services can be simplified to a configuration task:'serviguration'. Second, a configurable service approach must be linked with a clear conception of customer value over the Internet, such that it is ultimately expressable in computational terms. We discuss …", "num_citations": "40\n", "authors": ["1464"]}
{"title": "A Framework for Business/IT Alignment in Networked Value Constellations.\n", "abstract": " e-Services are just as commercial services; however e-services can be fully ordered and provisioned via the Internet. Such e-services are often offered by a constellation of enterprises rather than just one. A question is then how to properly align these enterprises, such that they can provision e-services. Additionally, because e-services rely so heavily on IT, aligning business (essentially the service) with IT is also of importance. In this paper, we present a framework that can be used to structure various alignment questions that popup while designing value constellations for e-services. We illustrate the framework by a small case study.", "num_citations": "38\n", "authors": ["1464"]}
{"title": "e3forces: Understanding Strategies of Networked e3value Constellations by Analyzing Environmental Forces\n", "abstract": " Enterprises increasingly form networked value constellations; networks of enterprises that can jointly satisfy complex consumer needs, while still focusing on core competencies. Information technology and information systems play an important role for such constellations, for instance to coordinate inter-organizational business processes and/or to offer an IT-intensive product, such as music or games. To do successful requirements engineering for these information systems it is important to understand its context; being here the constellation itself. To this end, business value modeling approaches for networked constellations, such as e                         3                         value, BMO, or REA, can be used. In this paper, we extend these business value modeling approaches to understand the strategic rationale of business value models. We introduce two dominant schools on strategic thinking: (1) the “environment …", "num_citations": "37\n", "authors": ["1464"]}
{"title": "An ontological approach for eliciting and understanding needs in e-services\n", "abstract": " The lack of a good understanding of customer needs within e-service initiatives caused severe financial losses in the Norwegian energy sector, resulting in the failure of e-service initiatives offering packages of independent services. One of the causes was a poor elicitation and understanding of the e-services at hand. In this paper, we propose an ontologically founded approach (1) to describe customer needs, and the necessary e-services that satisfy such needs, and (2) to bundle elementary e-services into needs-satisfying e-service bundles. The ontology as well as the associated reasoning mechanisms are codified in RDFS to enable software support for need elicitation and service bundling. A case study from the Norwegian energy sector is used to demonstrate how we put our theory into practice.", "num_citations": "37\n", "authors": ["1464"]}
{"title": "E3-Service-A Model-Based Approach for Generating Needs-Driven E-Service Bundles in a Networked Enterprise\n", "abstract": " Abstract e-services are just like normal services, but can be ordered and provisioned via the Internet completely. Increasingly, these e-services are offered as a multi-supplier bundle of elementary services. How to automatically compose these e-service bundles is considered as a key problem. Part of the composition process is to elicit the customer need for an e-service bundle, and to facilitate this elicitation process by a web-enabled software component. To this end, we need a computer-processable theory, called an ontology, which is able to represent customer needs, and also facilitates computer-supported elicitation of needs. In this paper, we propose the e3service ontology that does just that. The ontology represents needs, wants, demands, benefits, and related constructs, to build a customer-oriented catalogue of customer needs for e-services, which in turn can be used during the need-elicitation process for …", "num_citations": "36\n", "authors": ["1464"]}
{"title": "From chaining blocks to breaking even: A study on the profitability of bitcoin mining from 2012 to 2016\n", "abstract": " Bitcoin is a widely-spread payment instrument, but it is doubtful whether the proof-of-work (PoW) nature of the system is financially sustainable on the long term. To assess sustainability, we focus on the bitcoin miners as they play an important role in the proof-of-work consensus mechanism of bitcoin to create trust in the currency. Miners offer their services against a reward while recurring expenses. Our results show that bitcoin mining has become less profitable over time to the extent that profits seem to converge to zero. This is what economic theory predicts for a competitive market that has a single homogenous good. We analyze the actors involved in the bitcoin system as well as the value flows between these actors using the e3value methodology. The value flows are quantified using publicly available data about the bitcoin network. However, two important value flows for the miners, namely hardware …", "num_citations": "34\n", "authors": ["1464"]}
{"title": "Scenario methods for viewpoint integration in e-business requirements engineering\n", "abstract": " Before it makes sense to embark upon e-commerce systems development, first the commercial and technical feasibility of an e-business idea must be established. To this end, we describe how needs and interests of various types of stakeholders can be expressed by different viewpoint models. We propose an extension of so-called use case maps (UCMs) to e-business requirements engineering, as a scenario method to achieve the necessary viewpoint integration. Furthermore, we show how this scenario method is employed in an iteratively progressing 'spiral' process of e-business requirements elicitation and analysis. Our approach is practically illustrated by an e-business case study in electronic advertising.", "num_citations": "33\n", "authors": ["1464"]}
{"title": "A conceptual value modeling approach for e-business development\n", "abstract": " Abstract e-Business models show why an e-business case might work from an economic perspective. They are often represented using informal textual representations. This inhibits a clear understanding of an e-business model by all stakeholders involved. We propose a more formal, conceptual approach for representing the business model, which we call a value model, to enhance the common understanding amongst stakeholders, but also to allow for an asssesment of an ebusiness model. We illustrate our modeling approach by a state of the art project in the free Internet arena.", "num_citations": "33\n", "authors": ["1464"]}
{"title": "Multi-perspective assessment of scalability of IT-enabled networked constellations\n", "abstract": " Networked constellations are often formed to provide commercial IT services by leveraging the Internet technology. The provision of IT services should remain scalable, meaning that they should remain both economically and technically deployable in different business configurations. The same requirements hold for the Distributed Balancing Service (DBS), which is the subject of our analysis. In this paper we assess potentials of system scale of a constellation during its early design phase. We address a multi- perspective analysis approach, by taking a business value (using e 3 -value ) and an information system perspective (using UML) on the case at hand. We present a structured approach to relate both perspectives, thus enabling a cross- perspective assessment of system scale.", "num_citations": "32\n", "authors": ["1464"]}
{"title": "Ontology-based analysis of e-service bundles for networked enterprises\n", "abstract": " Model-based approaches to developing multi-enterprise e-Business initiatives help involved enterprises understand the initiatives by creating a shared understanding as a basis for profitability assessment. Still, when developing a business model where multiple potential enterprises may participate in offering a service bundle, complexity increases, and the need arises for automated support for the selection of services to include in the service bundle, implying also a selection of partners to work with. To put it differently, given a set of potential services to include in a business model, we need tools to configure one or more feasible service bundles, and to reason about the pros and cons of service bundles. Then the business analysis can be completed by calculating profitability of these service bundles. The configuration process takes into consideration inherent dependencies between available services. Its output is a set of suggested service bundles, based on these dependencies as well as possibly other given requirements related to service properties as price, quality and more. In this paper we present a methodology for doing all the above. We discuss and exemplify theoretical fundaments for such a methodology, in the framework of an e-Business analysis.", "num_citations": "32\n", "authors": ["1464"]}
{"title": "Service network approaches\n", "abstract": " This chapter discusses several approaches to design, analyze, describe and compose service networks.We analyze the technical and business-related aspects of these approaches, their evolution, and the trends they will be likely to follow. We further suggest how the two major trends driving these approaches (i.e., business and process orientation) can converge. The chapter concludes with a discussion of future lines of research in this area.", "num_citations": "30\n", "authors": ["1464"]}
{"title": "Energy services: A case study in real-world service configuration\n", "abstract": " Current eCommerce is still mainly characterized by the trading of commodity goods. Many industries offer complex compositions of goods based on customers’ specifications. This is facilitated by a component-based description of goods, supported by a variety of product classification schemes, e.g., UNSPSC and eCl@ss. These focus on physical goods – wrongly referred to as products – rather than on services. Services are intangible products, for instance insurances, transportation, network connectivity, events hosting, entertainment or energy supply. Due to major differences between goods and services, product classification schemes cannot support automated service scenarios, such as a customer who wishes to define and buy a set of independent services, possibly supplied by multiple suppliers, via one website. To enable such eCommerce scenarios for services, a service ontology is required that …", "num_citations": "30\n", "authors": ["1464"]}
{"title": "Modeling Strategic Partnerships Using the E3value Ontology: A Field Study in the Banking Industry\n", "abstract": " The banking industry is subject to a wave of consolidation taking the form of mergers but also the formation of strategic partnerships. In this chapter, we present how such a partnership can be assessed using the e3value ontology. This ontology allows us to model networks of enterprises and partnerships, exchanging things of economic with each other. To adequately model strategic partnerships, the e3value ontology has been extended to represent investment arrangements and outsourcing constructs. All this is explained using an industry-strength case banking study.", "num_citations": "29\n", "authors": ["1464"]}
{"title": "Ontology engineering, scientific method and the research agenda\n", "abstract": " The call for a “focus on content” in ontology research by Nicola Guarino and Mark Musen in their launching statement of the journal Applied Ontology has quite some implications and ramifications. We reflectively discuss ontology engineering as a scientific discipline, and we put this into the wider perspective of debates in other fields. We claim and argue that ontology is a new scientific method for theory formation. This positioning allows for stronger concepts and techniques for theoretical, empirical and practical validation that in our view are now needed in the field. A prerequisite for this is an emphasis on ontology as a (domain) content oriented concept, rather than as primarily a computer representation notion. We propose that taking domain theories and the associated substantive or content reference of ontologies really seriously as first-class citizens, will actually increase the contribution of ontology …", "num_citations": "29\n", "authors": ["1464"]}
{"title": "e3service: An Ontological Approach for Deriving Multi-supplier IT-Service  Bundles from Consumer Needs\n", "abstract": " IT-services should not only be considered from a technical perspective, but should also be seen as commercial services that satisfy a consumer need. Examples include well-known services such as Internet access or content provisioning services. Typically, to satisfy a consumer need, a bundle of elementary services is required. In such a bundle, each elementary service can be offered by a different supplier. A key problem is then how to actually find service-bundles that satisfy consumer needs as close as possible. Because IT-service bundles can be automatically provisioned online immediately after ordering, finding a service bundle satisfying a need should preferably also happen automatically. To this end, we propose the e 3 service ontology, which offers constructs from service marketing, but in a computational way, such that automated reasoning support can be developed to match consumer needs with IT …", "num_citations": "26\n", "authors": ["1464"]}
{"title": "Why visualization of e-business models matters\n", "abstract": " E-business models often suppose that a consortium of enterprises jointly deliver a service to endcustomers, in contrast to traditional business models where a single supplier offers a product to a single customer. This is especially true in the mobile industry: Telecommunication providers try to bundle their basic connectivity services with other services such as news, entertainment products (music), traffic information and so on, to offer one package to customers.Such multi-enterprise offerings require that all participating parties have a common understanding of the offering to be supplied. We have been involved in a series of business development tracks, and many of such multi-enterprise offerings result in unclear, and sometimes even inconsistent offerings. A main cause is mis-interpretation of the e-business idea underlying the offering.", "num_citations": "26\n", "authors": ["1464"]}
{"title": "What is this science called Requirements Engineering?\n", "abstract": " This vision paper reflects on the nature and status of requirements engineering as a science, based on recent RE journal articles on methodological foundations and research classification such as (R. Wieringa, et al., 2006). We put this discussion into the wider perspective of ongoing debates in other areas, including social and natural sciences methodology, IS and design research. We propose a new categorization of the notions of validity and evaluation, and suggest a criterial framework inspired by work on the structure of scientific argument", "num_citations": "25\n", "authors": ["1464"]}
{"title": "A design methodology for trust and value exchanges in business models\n", "abstract": " In this paper we introduce a design methodology for business models from two perspectives: the value web perspective and the trust perspective. The value web perspective models the creation, distribution, and consumption of things of economic value in a network of multiple enterprises and end-consumers. The goal of the methodology is two-fold:(1) to create a common understanding of a business model for all actors involved, and (2) to assess the potential profitability of a business model. The trust perspective describes how value webs can be expanded with trustworthy control procedures to provide for each actor sufficient confidence in each other to enable trading. We present a first outline of a formal theory to design trustworthy control procedures in the setting of the e3value methodology.", "num_citations": "25\n", "authors": ["1464"]}
{"title": "A Design Perspective on Networked Business Models: A Study of Distributed Generation in the Power Industry Sector\n", "abstract": " Value chain deconstruction and reconfiguration into new value constellations is a phenomenon impacting many industry sectors. An important strategic issue therefore is the creation and analysis of new networked business models that cut across a variety of enterprise and market actors. In this paper we take up this issue from a design perspective, and consider the construction of networked business models for the emerging case of distributed power generation in the utility industry. We elucidate the role of regulation here: feasibility of new business models in this industry sector appears to be critically dependent on the nature of future regulations even in a so-called ‘deregulated’open competitive market. We discuss how our value network modelling approach provides benefits already in a non-quantitative analysis in that (1) it offers a capability to map out new business ideas graphically in a clear and …", "num_citations": "24\n", "authors": ["1464"]}
{"title": "Designing value-based inter-organizational controls using patterns\n", "abstract": " Networked organizations, consisting of enterprises who exchange things of economic value with each other, often have participants who commit a fraud or perform other actions, not agreed in a contract. To explore such opportunistic behavior, and to design solutions to mitigate it, we propose the e                 3                 controlapproach. This approach takes the valuable objects, which are exchanged between enterprises, as a point of departure, and proposes a control patterns library to find solutions for various types of opportunistic behavior in network organizations. The practical use of the patterns is illustrated by a case study in the field of renewable electricity supply in UK.", "num_citations": "23\n", "authors": ["1464"]}
{"title": "Inter-organisational controls as value objects in network organisations\n", "abstract": " Inter-organizational controls are measures to ensure and monitor that networked enterprises do not commit a fraud and behave as agreed. Many of such controls have, apart from their control purpose, an inherent economic value component. This feature requires controls to pop-up into business value models, stating how actors create, trade and consume objects of economic value. In this paper, we provide guidelines that can be used to decide whether organizational controls should be part of a value model or not. We demonstrate these guidelines by a case study on the Letter of Credit procedure.", "num_citations": "22\n", "authors": ["1464"]}
{"title": "Value based business modelling for network organizations: Lessons learned from the electricity sector\n", "abstract": " Speed and availability of information, delivered in past years by Internet technologies, made it easier for any company to outsource primary activities, which resulted in unbundling of many companies’ traditional value constellations into networks of different companies. In the electricity power sector decomposition of the value constellation is not only enabled by technological advances such as smallscale electricity generation devices and Internet-based interconnections, but it is also enforced by government regulations and crucial ecological issues like CO2 reduction. In this paper we present a business modeling methodology, called e3value, which can be used to develop and reconstruct such value constellation in network organizations. This methodology combines rigorous conceptual modeling from Computer Sciences with the analysis methods from Business Sciences. We show how the e3value methodology can be used in the field of distributed power generation. Four European electricity power companies are developing new business cases and the corresponding value constellations, of which we discuss one prototypical business example. For this case we present a e3value business model, and show how we can use this model to make a first financial assessment of the case. Finally, we discuss lessons learned from the e3value modeling in this specific business case of the electricity industry.", "num_citations": "22\n", "authors": ["1464"]}
{"title": "Business strategy-it alignment in a multi-actor setting: a mobile e-service case\n", "abstract": " In this paper we present a framework and methodology for aligning the business strategy and IT/IS for an organization offering an e-service in a multi-organizational setting. We explore three perspectives on the e-service to be offered: 1) The business strategy perspective, in terms of the organization's strategic position; 2) The value creation perspective, in terms of a networked value constellation enabling value creation; 3) The IT/IS perspective, in terms of an ITarchitecture enabling the provision of the e-service. We explore these three perspectives and modify them, until we find a situation in which 1) the designed IT architecture enables the provision of the e-service and can be implemented in a profitable way by the networked value constellation, and 2) the enterprise under study is positioned in the networked value constellation such that the enterprise can execute its business strategy. We have tested our …", "num_citations": "21\n", "authors": ["1464"]}
{"title": "Service ontology\n", "abstract": " A service ontology is required, as we argued in the D3 deliverable of OBELIX, to support the composition of goods and services into a compound end-product or end-service. Such a composition is currently not supported by existing classification tools, which concentrate on physical goods, rather than on services. To that end, we have developed a service ontology. As the term “service” stems from the economic and business sciences, that was also our starting point. Research about traditional services (services that are not offered via Internet) in those sciences is very mature; it is characterized by a broad consensus. Research about e-services (services of which at least one important part–eg, buying, delivery etc–is realized via Internet) is still at its early stages; it relies on the traditional service research, and searches for the differences between e-services and traditional services. The traditional service research serves as a basis for our service ontology, since we consider the term “service” in its business context, rather than its IT-context; in the IT world the terms “eservices” and “web-services” mostly refer to technologies, rather than business activities with elements as value, costs and benefits.An ontology is a well-structured model. Existing service literature, on the other hand, lacks this characteristic. Whereas economists use well-structured models for many analysis tasks, the related theory is formulated in natural language, just like humans would require. Our service ontology, however, has to be machine-readable. We consequently needed to structure the knowledge available in the service literature, so that it can be made machinereadable. A …", "num_citations": "21\n", "authors": ["1464"]}
{"title": "On the interaction between business models and software architecture in electronic commerce\n", "abstract": " To design a business model for electronic commerce it is necessary to develop an architecture of the software system that will support this model. Such an architecture shows at an early stage to what extent the business model can be supported and implemented by a software system. If constraints of the business model cannot be supported by a software system, the model itself can be changed. We investigate this interaction between business model and architecture by carrying out a case study in the area of electronic commerce: the design and analysis of a software architecture for a directory service.", "num_citations": "20\n", "authors": ["1464"]}
{"title": "E-Business cases assessment: From business value to system feasibility\n", "abstract": " Innovative e-commerce initiatives present a new way of doing business. Since short time-to-market is a major requirement in e-commerce, and typically multiple parties (enterprises) are involved, multiple stakeholders have to be convinced quickly that the new way of doing business is technically feasible and economically profitable for them. Consequently, a lightweight approach is required for defining, deriving and analysing multi-enterprise relationships, business cases and requirements. The e3-value framework is a multi-viewpoint requirements engineering method that offers such an approach. It is based on analysing e-commerce initiatives through three stakeholder-based viewpoints. To ensure that these viewpoints keep correlated, to facilitate traceability of requirement decisions, and to support trade-off analysis between requirements, we present Feature?Solution (FS) graphs as an extension to the e3-value …", "num_citations": "19\n", "authors": ["1464"]}
{"title": "Consistency checking between value models and process models: A best-of-breed approach\n", "abstract": " Business value models and process models describe the same subject from a different perspective. Therefore, it is important that both models are consistent with each other. To do consistency checking, we construct an intermediate model that captures the physical transfers in a value model, thereby reducing the conceptual gap between value and process models. This physical transfer model can then be checked for consistency with a process model via the already existing “reduced model” approach. A reduced model is a simplified representation of a value model or process model, where common concepts represent aspects from both the value and process model. We illustrate our approach using a small case study in the electricity sector.", "num_citations": "18\n", "authors": ["1464"]}
{"title": "Selling bits: A matter of creating consumer value\n", "abstract": " Digital goods such as music are vulnerable to illegal use over the internet. Technology-driven IT solutions to protection are useful but limited. Instead, we suggest that incentives to legal forms of consumption can be constructed by redesigning how the e-business model for digital content creates consumer value. We present a general framework that enables a quantified utility analysis and clarifies what parameters, technological as well as market ones, influence consumer value. On this basis, we discuss several business scenarios that show how to make the value gap between legal and illegal offerings as large as possible. This analysis framework is part of our e                         3-value™methodology for e-business modelling and decision making in which business and IT considerations are integrated.", "num_citations": "18\n", "authors": ["1464"]}
{"title": "A framework for the design of service systems\n", "abstract": " We propose a framework for the design and implementation of service systems, especially to design controls for long-term sustainable value co-creation. The framework is based on the software support tool e3-control. To illustrate the framework we use a large-scale case study, the Beer Living Lab, for simplification of customs procedures in international trade. The BeerLL shows how value co-creation can be achieved by reduction of administrative burden in international beer export due to electronic customs. Participants in the BeerLL are Heineken, IBM and Dutch Tax & Customs.", "num_citations": "17\n", "authors": ["1464"]}
{"title": "Finding e-service offerings by computer-supported customer need reasoning\n", "abstract": " We outline a rigorous approach that models how companies can electronically offer packages of independent services (service bundles). Its objective is to support prospective Website visitors in defining and buying service bundles that fit their specific needs and demands. The various services in the bundle may be offered by different suppliers. To enable this scenario, it is necessary that software can reason about customer needs and available service offerings. Our approach for tackling this issue is based on recent advances in computer and information science, where information about a domain at hand is conceptualized and formalized using ontologies and subsequently represented in machine-interpretable form. The substantive part from our ontology derives from broadly accepted service management and marketing concepts from business studies literature. In earlier work, we concentrated on the service …", "num_citations": "17\n", "authors": ["1464"]}
{"title": "Modeling controls for dynamic value exchanges in virtual organizations\n", "abstract": " The e                         3                         -value modeling tool was developed for the design of a value proposition for virtual organizations. However, it is less suitable for designing the control structure of the virtual organization. We show how e                         3                         -value can be extended using legal concepts such as ownership, possession, usufruct and license. We also introduce value object transfer diagrams that show the transfers of value objects graphically and that can be used for elicitation of the required control mechanisms in order for the virtual organization to function properly and with a level of risk that is acceptable to all parties in the virtual organization.", "num_citations": "17\n", "authors": ["1464"]}
{"title": "Analysing preventative and detective control mechanisms in international trade using value modelling\n", "abstract": " Exploration and development of e-business models takes a series of viewpoints. One important perspective is the value web perspective, which can be modelled using the e 3 value methodology. However this perspective supposes a perfectly honest world, an assumption which turns out to be not true in practice. As a consequence, it is important to explore fraudulent behaviour of actors in value web, preferably by using a lightweight and graphical approach similar to the e 3 value methodology. Using a real-life e-business scenario (Bill of Lading) we show that e 3 value, with some extensions, is capable of modelling a control perspective that captures mechanisms for preventive and detective controls. Additionally, we show that such controls themselves can be seen as a kind of commercial services.", "num_citations": "17\n", "authors": ["1464"]}
{"title": "Reasoning about Customer Needs in Multi-supplier ICT Service Bundles using Decision Models.\n", "abstract": " We propose a method, e3service, to reason about satisfying customer needs in the context of a wide choice of multi-supplier ICT service bundles. Our method represents customer needs, their ensuing consequences, and the services that realize those consequences in a service catalogue. This catalogue is then used by a reasoner, which elicits customer needs, computes their consequences, and automatically matches these consequences with services offered by suppliers. The e3service method has been implemented and tested in software to demonstrate its feasibility.", "num_citations": "16\n", "authors": ["1464"]}
{"title": "Value-based Design of Networked Enterprises Using e³control Patterns\n", "abstract": " Networked organizations, consisting of enterprises who exchange things of economic value with each other, often have participants who commit a fraud or perform other actions, not agreed in a contract. To explore such opportunistic behavior, and to design solutions to mitigate it, we propose the e 3  control approach. This approach takes the valuable objects, which are exchanged between enterprises, as a point of departure, and proposes a control patterns library to find solutions for various types of opportunistic behavior in network organizations. The practical use of the patterns is illustrated by a case study in the field of renewable electricity supply in UK.", "num_citations": "16\n", "authors": ["1464"]}
{"title": "Integral design of E-Commerce systems: Aligning the business with software architecture through scenarios\n", "abstract": " Advancements in information and communication technology pave the way for a new class of business systems: e-commerce systems. These systems differ from traditional business systems in that they almost constitute the business rather than that they merely support the business of an organization. As a consequence, business and technology issues are intertwined in such a way that it is not sufficient anymore to consider them in isolation. For this reason, we argue that an integrated approach to ecommerce system development is required with which we can assess the impact of a business model on the information system and vice versa. In our approach, which we call e3-VALUE, an e-commerce system is considered from three architectural areas: business value, business process, and software architecture area. These three architectural areas cater for the needs of the various stakeholders involved in the development process at such an abstraction level that qualitative assessments can be made without getting buried by details. A scenario-based technique, represented by Use Case Maps (UCM), is used to relate the different architectural levels. The e3-VALUE approach is illuminated by means of an elaborated case study. Although it is too early to draw definite conclusions from this and other case studies that we have conducted, we did learn some important lessons. The first important lesson is that the case studies suggest that e-commerce systems can indeed be assessed qualitatively at a high level of abstraction as provided by the three architectural areas. The second important lesson is that an integrated approach can reveal …", "num_citations": "16\n", "authors": ["1464"]}
{"title": "Value-based process model design\n", "abstract": " Networked service value constellations, consisting of enterprises and customers working together to jointly provide a commercial service, can be analyzed from different modeling perspectives. Two such perspectives are (1) the value perspective and (2) the process perspective. Value models, describing the value perspective, indicate which economically valuable service outcomes are exchanged between the involved actors. However, a value model only shows what of economic value is exchanged, but not how this should be accomplished. Therefore, to understand a service well, an additional process model has to be designed, which shows the actual tasks to be performed by these actors as well as the time order of these tasks. A key problem is then how to construct such a process model, given an earlier designed value model. As the process model should put the value model into operation, there exists a …", "num_citations": "15\n", "authors": ["1464"]}
{"title": "Service value networks for competency-driven educational services: A case study\n", "abstract": " Service networks represent a flexible way for delivering services to customers. In earlier work, we have applied the e                 3                 -valuemethodology to conceptually model such networks. This paper, however, presents an approach for composing Service Value Networks (SVNs) based on customer and supplier perspectives. A broker is in charge of composing a SVN that reflects not only customer desires but also supplier offerings. Moreover, the application of using real-world services is shown by means of a case study. Finally, we provide some reflections as well as future lines of research.", "num_citations": "15\n", "authors": ["1464"]}
{"title": "Risk Analysis for Inter-organizational Controls.\n", "abstract": " Existing early requirements engineering methods for dealing with governance and control issues do not explicitly support comparison of alternative solutions and have no clear semantics for the notion of a control problem. In this paper we present a risk analysis method for inter-organizational business models, which is based on value modeling. A risk is the likelihood of a negative event multiplied by its impact. In value modeling, the impact of a control problem is given by the missing value. The likelihood can be estimated based on assumptions about trust and about the underlying coordination model. This allows us to model the expected value of a transaction. The approach is illustrated by a comparison of the risks of different electronic commerce scenarios for delivery and payment.", "num_citations": "15\n", "authors": ["1464"]}
{"title": "e3alignment: Exploring inter-organizational alignment in net worked value constellations.\n", "abstract": " In this paper we introduce the e3alignment approach for inter-organizational alignment. With e3alignment we create alignment between organizations operating in a networked value constellation-which is a set of organizations who jointly satisfy a customer needby (1) focusing on the interaction between the organizations in the networked value constellation,(2) considering interaction from four different perspectives, and (3) utilizing conceptual modeling techniques for each perspective. By creating inter-organizational alignment between the actors in a networked value constellation e3alignment ultimately contributes to a sustainable and profitable networked value constellation. To actually create alignment, e3alignment iteratively takes three specific steps:(1) identification of alignment issues,(2) alignment solution design, and (3) impact analysis. We tested e3alignment on an industrial strength case study in the Spanish electricity industry.", "num_citations": "14\n", "authors": ["1464"]}
{"title": "Modeling pricing for configuring e-service bundles\n", "abstract": " To offer online bundles of independent e-services, software is needed that composes services of different enterprises into a bundle of services, satisfying a complex consumer need. In earlier research, a service ontology–a formalized conceptual model of services–has been developed for such software-aided service bundling. This ontology, however, did not include constructs to reason about the prices of services, while these are needed to realize and offer service bundles online. In this paper, we present an extension of the service ontology with pricing models for e-services. Examples from real-world services are used to illustrate how pricing models of services can be modelled by domain experts, and prices of service bundles can be calculated by software using the extended ontology.", "num_citations": "14\n", "authors": ["1464"]}
{"title": "Reasoning about substitute choices and preference ordering in e-services\n", "abstract": " e-Services are just like normal services, but can be ordered and provisioned via the Internet completely. Increasingly, these e-services are offered as a multi-supplier bundle of elementary services. How to automatically compose and prioritize these multi-supplier e-service bundles is considered as a key problem. In this paper, we present the e                 3                 service ontology to represent a multi-supplier e-service catalogue from a consumer need perspective. Then, we use this ontology to reason about alternative e-service bundles satisfying a particular need, and to prioritize the found bundles using the consumer benefits they provide. The ontology and the reasoning process are illustrated by a case study in the Dutch telecommunication industry.", "num_citations": "13\n", "authors": ["1464"]}
{"title": "Assessing feasibility of IT-enabled networked value constellations: A case study in the electricity sector\n", "abstract": " Innovative networked value constellations, such as Cisco or Dell, are often enabled by Information Technology (IT). The same holds for the Distributed Electricity Balancing Service (DBS), which we present in this case study. To explore feasibility of such constellations while designing them, we need at least to develop a financial and technical understanding of the constellation at hand. In this paper, we take a multiple perspective approach, by taking a business value perspective (using e                         3                         -value) and an information system perspective (using UML-deployment diagrams) on the case at hand. We present a novel, structured approach to relate both perspectives, thus enabling a financial and technical feasibility assessment of the constellation, using a real-life case study in the field of electricity supply and consumption.", "num_citations": "13\n", "authors": ["1464"]}
{"title": "The configurable nature of real-world services: Analysis and demonstration\n", "abstract": " A collaborative design of complex real-world services (ranging from plumbing services, transportation, network connectivity and events hosting to insurances and governmental public services) over the WWW requires services to be described as components, the building blocks of a configuration. Defining complex services then becomes a traditional configuration task, where services are seen as components. Reducing the process of defining complex services into a configuration task (as studied in knowledge engineering) implies that it can be supported by information technology, to be used either by service personnel or by customers via the Internet. Furthermore, to facilitate service configuration by customers, it is required that the customer value of services is linked to services–or service elements–that shall be configured. A subset of the service outcomes, very often intangible, reflects the customer value of a service, in supply-side terms. In this paper we describe the component-like nature of services, in the framework of a service ontology comprising of the customer value (demand-side terms) as well as a supply-side, component-based description of services. We demonstrate the process of configuring–or bundling–services with a case study on hosting a meeting.", "num_citations": "13\n", "authors": ["1464"]}
{"title": "Exploring inter-organizational alignment with e3alignment-An Aviation Case\n", "abstract": " In this paper we present the e3alignment framework and approach, which we use to explore a wide range of inter-organizational alignment issues concerning the interaction between organizations in a value web, as seen from multiple perspectives, and with the aid of modeling techniques. The e3alignment approach focuses on interaction between actors, since “interaction” is one of the key success factors for a sustainable value web. Our ultimate goal is to create a sustainable value web, where various organizations cooperate to successfully meet a consumer need. To support our claims we conducted an industrial strength case study at the Dutch aviation sector.", "num_citations": "12\n", "authors": ["1464"]}
{"title": "Aligning information system design and business strategy–a starting internet company\n", "abstract": " In this paper we aim to align an organization’s information system with its strategic environment. We propose an alignment framework which takes four perspectives into account: Strategy, Value, Processes, IT/IS. This alignment framework is 1) intended for the exploration phase of information system design, 2) considers the complex environment in which an organization - and its IS - operates, and 3) uses conceptual modeling techniques (IS architectures and e                 3                 forces) and provides clear steps to analyzes and align the perspectives. We have tested our approach in a real life case setting, where we assisted in aligning an enterprise’s IS and business strategy.", "num_citations": "12\n", "authors": ["1464"]}
{"title": "Towards control patterns for smart business networks\n", "abstract": " To keep a smart business network sustainable, inter-organizational control measures are needed to detect or prevent opportunistic behavior of network participants. In this paper we present a methodology for understanding control problems and designing solutions, based on an economic value perspective. The methodology employs a library of so-called control patterns, inspired by design patterns in software engineering. A control pattern is considered as a generic solution for a common control problem. The adequacy and effectiveness of these control patterns is demonstrated by a case study about the redesign of customs procedures.", "num_citations": "12\n", "authors": ["1464"]}
{"title": "Towards value-based design patterns for inter-organizational control\n", "abstract": " We present control patterns: a framework for designing and analyzing interorganizational control mechanisms, inspired by design patterns. A control pattern is a generic solution for some recurring control problem, applicable in a certain context. The patterns are based on internal control theory from the accounting and auditing fields, and on previous work on inter-organizational controls. The application of the patterns is supported by the e3-control methodology, which is based on the e3-value business modeling tool. The patterns are applied in a case study.", "num_citations": "12\n", "authors": ["1464"]}
{"title": "Service classification versus configuration\n", "abstract": " We briefly review service classification schemes, originating especially from marketing research work, and analyze to what extent they are useful for ontology-based service configuration over the Web.", "num_citations": "12\n", "authors": ["1464"]}
{"title": "e-services in a networked world: From semantics to pragmatics\n", "abstract": " Today’s economy is a service economy, and an increasing number of services is electronic, i.e. can be ordered and provisioned online. Examples include Internet access, email and Voice over IP. Typically, e-services are offered as bundles consisting of more elementary services, offered by different suppliers, forming a network. This allows for best-of-breed solutions, in which the customer selects the best services from different suppliers to satisfy his need, and in which the supplier can focus on his core-competences. The research question is then how to compose such a multi-supplier service bundle. In this paper, we argue that first understanding of the context of the service is important. We propose a framework of ontologies, called e               3               family, which can be used to reason about the contextual socio-economical aspects of e-services. This framework can be used to elicit customer’s need, to …", "num_citations": "11\n", "authors": ["1464"]}
{"title": "Value-based service bundling: A customer-supplier approach\n", "abstract": " Due to future ubiquitous service environments, approaches for dynamic delivery of services face new challenges. Since the web 2.0 gave to customers the change to interact with the Internet, they are not any more static entities but can also contribute to the design or co-creation of new services. In this paper we show how customers can help to dynamically bundle services, our approach is based on customer and supplier perspectives. A broker is in charge of matching both perspectives, depicting not only customer desires but also supplier offerings. Moreover, our approach is illustrated by a case study. Finally, we provide some reflections as well as future lines of research.", "num_citations": "10\n", "authors": ["1464"]}
{"title": "Generating value models using skeletal design techniques\n", "abstract": " This paper presents a novel approach to automatically generate e3value instance models, based on skeletal design techniques. The approach has three phases. While the first two phases are related to the generation of a value activity network based on a given value skeleton, the third phase matches the elements of the value network with the capabilities of service providers. The main objective of our approach is to re-use a set of value skeletons for covering an industry sector from which more business cases may be generated. Finally, we validated our approach in a realistic case study.", "num_citations": "10\n", "authors": ["1464"]}
{"title": "Modelling value-based inter-organizational controls in healthcare regulations\n", "abstract": " Products and services are increasingly offered by value webs, rather than by a single enterprise. Typically, value webs need inter-organizational controls to prevent fraudulent behaviour of actors. To design and analyze controls, we developed the economic value-based methodology e                   3-control, which so far has been applied mainly in commercial environments, which are regulated by contractual arrangements. In this paper, we use e                   3                   control in a highly regulated environment, which contains public-private partnerships, namely the healthcare sector in The Netherlands. Lessons learned include that the notion of economic reciprocity — as present in a commercial setting — is not always apparent in highly regulated environments; and that a highly regulated environment requires artefacts like evidence objects, which can be dealt with as if they were value objects.", "num_citations": "10\n", "authors": ["1464"]}
{"title": "Music rights clearance business analysis and delivery\n", "abstract": " Semantic Web Services can be seen as remote Problem Solving Methods offered via the Web through platform and language independent interfaces. They can be seamlessly integrated to achieve more complex functionality by composing pre-existing software components. Despite technical advantages surrounding Semantic Web Services technologies, their perspective overlooks the commercial aspects of services in the real – non-IT – world, and is therefore incomplete and limiting. Real-world services – business activities such as insurances, medical services, ADSL etc – have nowadays an increasing social and economic importance. Important trends are the bundling of services and a growing customer-need orientation. Thus, there is a need for a computational background for describing real-world services and applying knowledge-based technologies for reasoning about them: configuring composite …", "num_citations": "9\n", "authors": ["1464"]}
{"title": "e3 alignment : Exploring inter-organizational alignment in value webs\n", "abstract": " In this paper we introduce the e 3  alignment approach for inter-organizational alignment. With e 3  alignment we create alignment between organizations operating in a value Web-which is a set of organizations who jointly satisfy a customer need-by (1) focusing on the interaction between the organizations in the value web, (2) considering interaction from four different perspectives, and (3) utilizing conceptual modeling techniques for each perspective. By creating inter-organizational alignment between the actors in a value web e 3  alignment ultimately contributes to a sustainable and profitable value Web. To actually create alignment, e 3  alignment iteratively takes three specific steps: (1) identification of alignment issues, (2) solution design, and (3) impact analysis. We tested e 3  alignment on an industrial strength case study in the Spanish electricity industry.", "num_citations": "8\n", "authors": ["1464"]}
{"title": "Towards a common business ontology\n", "abstract": " Towards a common business ontology (2006) | www.narcis.nl KNAW KNAW Narcis Back to search results Tilburg University Publication Towards a common business ontology (2006) Pagina-navigatie: Main Save publication Save as MODS Export to Mendeley Save as EndNote Export to RefWorks Title Towards a common business ontology Published in Proceedings of the 3rd Workshop on Enterprise Modelling and Ontologies for Interoperability (INTEROP-EMOI 2006) Author Andersson, B.; Bergholtz, M.; Edirisuriya, A.; Ilayperuma, T.; Johannesson, P.; Bertrand, G.; Michael, S.; Dubois, E.; Abels, S.; Hahn, A.; Gordijn, J.; Weigand, H.; Wangler, B. Publisher Research Group: Information Management Date issued 2006 Access Restricted Access Language English Type Book Part Publisher Unknown Publisher Publication https://research.tilburguniversity.edu/en/publications/be429... Persistent Identifier urn:nbn:nl:ui:12-…", "num_citations": "8\n", "authors": ["1464"]}
{"title": "Value-based business-ICT aligment: A case study of the mobile industry\n", "abstract": " The problem of business-ICT alignment lays in the difficulty of matching needs and requirements of customers over certain ICT services with the offered ICT services of suppliers. Our aim is to provide clearly determined factors and guidelines that characterize the optimal alignment in the ICT domain. To do so, we combine the e3-value methodology with the so-called service ontology. The resulted technique helps to understand the distribution and exchange of value objects between actors and the complexity of services. To reason over a successful alignment between service needs and offerings and to generate optimal service bundles it is necessary to combine these two mentioned techniques. The question is whether this combination is also sufficient for our purposes in the ICT domain.", "num_citations": "8\n", "authors": ["1464"]}
{"title": "User manual e3-value editor\n", "abstract": " One of the main objectives of the tool is to produce profitability sheets to assess the viability of the business model. These sheets will be in the spreadsheet format. xls of Microsoft Excel. In this spreadsheet tool the sheets can be loaded, financial parameters can be changed and the financial outcomes of the business model can be inspected or processed further.", "num_citations": "8\n", "authors": ["1464"]}
{"title": "Does your role in a networked value constellation match your business strategy-a model based approach\n", "abstract": " CiteSeerX — Does your role in a networked value constellation match your business strategy - a model based approach Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced Search Include Citations Tables: DMCA Does your role in a networked value constellation match your business strategy - a model based approach (2007) Cached Download as a PDF Download Links [domino.fov.uni-mb.si] [domino.fov.uni-mb.si] [domino.fov.uni-mb.si] Save to List Add to Collection Correct Errors Monitor Changes by Vincent Pijpers , Jaap Gordijn Venue: Proceedings of the 20th Bled eConference Citations: 2 - 1 self Summary Citations Active Bibliography Co-citation Clustered Documents Version History Share Facebook Twitter Reddit Bibsonomy OpenURL Abstract th Keyphrases networked value constellation business strategy …", "num_citations": "7\n", "authors": ["1464"]}
{"title": "E-service innovation in rural africa through value co-creation\n", "abstract": " E-Services have great potential, even in resource-poor environments such as in sub-Saharan Africa. However, contextual factors pose significant challenges for development, feasibility, deployment and sustainability of e-services. This chapter presents a case of e-service value co-creation in a rural context, with targeted end users in regions characterized by limited electricity infrastructure and poor or absent internet, strong diversity in languages spoken, high illiteracy rates and limited purchasing power. It offers a methodology to upfront analyze business model sustainability for e-service innovation in severely resource-constrained contexts. This is illustrated by an extensive case study in which a voice-based microblogging e-service was developed and deployed with local stakeholders in rural Mali.", "num_citations": "5\n", "authors": ["1464"]}
{"title": "Towards model-based assessment of business-IT alignment in e-service networks from multiple perspectives\n", "abstract": " In this paper we align business with IT in a networked setting while introducing innovative e-customs procedures worldwide. We perform the alignment process in a multi-perspective way, guided by concerns of upscaling. As we show in this paper, using an industry-strength case study, effects of upscaling have often impacts on business, like the increase of the number of service consumers, or the emerge of service suppliers who use their core competencies to satisfy an appearing, IT intensive consumer need. Consequently, these impacts cause a change in business-driven requirements that the underlying information system architecture need to accommodate in order to preserve well-aligned constellations of businesses. Besides understanding the technical consequences of upscaling, the articulation of factors that influence stakeholder value is of an importance, too. In this paper we propose a model-based …", "num_citations": "5\n", "authors": ["1464"]}
{"title": "How e-services satisfy customer needs: A software-aided reasoning\n", "abstract": " We outline a rigorous approach that models how companies can electronically offer packages of independent services (service bundles). Its objective is to support prospective Web site visitors in defining and buying service bundles that fit their specific needs and demands. The various services in the bundle may be offered by different suppliers. To enable this scenario, it is necessary that software can reason about customer needs and available service offerings. Our approach for tackling this issue is based on recent advances in computer and information science, where information about a domain at hand is conceptualized and formalized using ontologies and subsequently represented in machine-interpretable form. The substantive part from our ontology derives from broadly accepted service management and marketing concepts from business studies literature. In earlier work, we concentrated on the service …", "num_citations": "5\n", "authors": ["1464"]}
{"title": "Community-centered, Project-based ICT4D Education in the Field\n", "abstract": " The growing demand for user-centered, sustainable, collaborative and ecosystem-aware ICT4D programs and projects brings requirements for education of a new generation ICT4D professionals. This paper presents a post-graduate field-based course in ICT4D that teaches how to co-create and deploy community-centered ICT services. The course has been jointly organized and deployed by Vrije Universiteit (VU) Amsterdam and Universiti Malaysia Sarawak (UNIMAS) for a mixed group of computer science, information science and artificial intelligence students from VU and UNIMAS. The course design, experiences, outcomes and evaluation are presented in this paper.", "num_citations": "4\n", "authors": ["1464"]}
{"title": "Modeling Communities in e3value.\n", "abstract": " Increasingly, communities play an important role in business value models. However, in e3value, there seems not to be a suitable construct to model communities. In this paper, we propose an additional concept that can be used for communities, namely the “group”. We illustrate the use of this concept for understanding a business model in the field of ICT4D (ICT for developing countries). abstract environment.", "num_citations": "4\n", "authors": ["1464"]}
{"title": "Consonance between economic and IT services: finding the balance between conflicting requirements\n", "abstract": " [Context and motivation] Service Orientation has been heralded as the solution for seamless alignment of the business and IT. [Question/problem] Alignment, however, remains far from being resolved. [Principal ideas/results] While alignment research typically concentrates on mapping the counterpart elements, this paper provides a case for what we coin consonance—the mutual adjustment of conflicting requirements between business and IT perspectives. In previous work, we have identified inherent discrepancies between the requirements of the business- and IT perspectives. [Contribution] In this paper, to better understand such discrepancies and the kind of support needed for their consonance, we have carried out a real-world example in the music industry. Moreover, we study consonance in a networked setting; both in terms of a business network of enterprises, and in terms of a cross …", "num_citations": "4\n", "authors": ["1464"]}
{"title": "A computational approach towards eliciting needs-driven bundles of healthcare services\n", "abstract": " We propose a method, e3-service, to reason about satisfying customer needs (problems stated by the consumer) by means of a bundle of multi-supplier service bundles (solutions from specific suppliers). The e3-service method represents customer needs, desired consequences by the customer, and the services that realize those consequences in a multi-perspective service catalogue. This catalogue is used by a reasoner, which elicits customer needs and desired consequences, and matches these consequences with services offered by suppliers. The e3-service method has been implemented in software to demonstrate its feasibility. In this paper, we show how e3-service reasons about finding services for a consumer need using a case from the healthcare industry.", "num_citations": "4\n", "authors": ["1464"]}
{"title": "Matching complex consumer needs with e-service bundles\n", "abstract": " e-Services are commercial services that can be ordered and provisioned via the Internet, satisfying a consumer need. Sometimes, such services are provisioned by a constellation of enterprises, and consist of multiple elementary services. A problem is then how to configure such a constellation, satisfying a complex consumer need. To this end, we extend the notion of consumer need in the e3value methodology, as originally intended for designing value constellations. We also show how needs can be (automatically) matched with services provisioned by suppliers. As such, our contribution can be seen as a first step towards on-demand dynamic value constellations, provisioning e-services.", "num_citations": "4\n", "authors": ["1464"]}
{"title": "e 3 service: an ontology for needs-driven real-world service bundling in a multi-supplier setting\n", "abstract": " Businesses increasingly offer their services electronically via the Web. Take for example an Internet Service Provider. An ISP offers a variety of services, including raw bandwidth, IP connectivity, and Domain Name resolution. Although in some cases a single service already satisfies a customer need, in many situations a customer need is so complex that a bundle of services is needed to satisfy the need, as with the ISP example. In principle, each service in a bundle can be provisioned by a different supplier. This paper proposes an ontology, e 3 service, that can be used to formally capture customer needs, services, and multi-supplier service bundles of these. In addition, this paper contributes a process called PCM 2 to reason with the ontology. First, a customer need is identified for which desired consequences are elicited. Then, the desired set of consequences is matched with consequences associated with …", "num_citations": "3\n", "authors": ["1464"]}
{"title": "Needs-driven bundling of hosted ict services\n", "abstract": " Increasingly ICT (Information & Communication Technology) services become commercial services. For example, an Internet Service Provider (ISP) offers email, web browsing and content hosting as commercial services. In this paper we present an approach, e               3               service, to semi-automatically generate such services, satisfying a stated complex customer need. The e               3               serviceapproach elicits the customer need, the consequences satisfying the need, and services satisfying the need. We show how e               3               serviceworks in practice using a running, industry strength, case study.", "num_citations": "3\n", "authors": ["1464"]}
{"title": "A model-based approach to aid the development of E-government projects in real-life setting focusing on stakeholder value\n", "abstract": " Recently, there has been a lot of effort put into modernizing the public sector using advanced information technology. The resulting e-government initiatives offer numerous benefits for stakeholders from both private and public sectors, and require solid IT support for operation. The same phenomenon holds for e-customs that we analyze in this paper. In the real-life setting different IT-driven concerns emerge and influence the foreseen stakeholder benefits and, as a result, might violate the success of e-customs. Therefore, it is essential to explore and to balance the effects of such concerns already during the development phase while constantly considering stakeholder value. We propose a constructive, model-based approach to aid such investigations.", "num_citations": "3\n", "authors": ["1464"]}
{"title": "Automatic Service Configuration under e3value approach\n", "abstract": " The VALUE-IT project is addressing the problem of developing techniques to allow adaptive service configuration using e3value support. Such a service configuration also must match with specific consumer needs. In this sense, the first step is to deal with the problem of designing techniques to perform automatic service configuration. Consequently tasks related with IT elicitation, reuse of knowledge, service configuration and evaluation of configured services must be solved.", "num_citations": "3\n", "authors": ["1464"]}
{"title": "Towards a Common Ontology for Business Models\n", "abstract": " To create an understanding of enterprises and the ways they do business, a starting point could be to identify the main actors and the values transferred between them. Business models are created in order to make clear who the business actors are in a business case and to make their relations explicit. The relations are formulated in terms of values exchanged between the actors. The purpose of the work reported in this paper is to create a better understanding of business models by identifying basic notions used in such models. It does so by constructing a common ontology based on three established business model ontologies: e3-value, REA, and BMO. By means of a careful analysis of these ontologies a conceptual schema is created that defines the common concepts. An example is worked out that explains how the common ontology should be understood.", "num_citations": "3\n", "authors": ["1464"]}
{"title": "Control patterns in a healthcare network: Applying control patterns to redesign governance and control mechanisms in a healthcare network\n", "abstract": " Control Patterns in a Healthcare Network: Applying Control Patterns to... (2006) | www.narcis.nl KNAW KNAW Narcis Back to search results VU University Amsterdam Publication Control Patterns in a Healthcare Network: Applying Control Patterns to... (2006) Pagina-navigatie: Main Save publication Save as MODS Export to Mendeley Save as EndNote Export to RefWorks Title Control Patterns in a Healthcare Network: Applying Control Patterns to Redesign Governance and Control Mechanisms in a Healthcare Network Author Kartseva, V.; Hulstijn, J.; Gordijn, J.; Tan, YH Publisher VU Business School; Information, Logistics and Innovation; Business Web and Media; Business & Web Date issued 2006 Access Restricted Access Language English Type Report Publisher Telematica Instituut Publication https://research.vu.nl/en/publications/09c60cfb-8ccc-4159-93... Persistent Identifiers NBN urn:nbn:nl:ui:31-09c60cfb-…", "num_citations": "3\n", "authors": ["1464"]}
{"title": "Early requirements determination for networked value constellations: A business ontology approach\n", "abstract": " Many enterprises organize themselves as networked value constellations to jointly deliver products and services. Such constellations are facilitated by recent advances in IT, specifically various Internet and Web technologies. Before embarking upon information systems design and dealing with the technical issues, we argue that it is first important to understand the constellation with its business goals and activities as an artifact itself. This analysis forms a part of the early requirements determination phase that particularly seeks to clarify the business requirements underlying information systems support. To this end, we propose an ontology-based approach called e3value to represent and evaluate business models for networked enterprises from a value-creation perspective. In addition, the e3value approach contains a stepwise design process, a set of evaluation methods, and a software tool that supports the business requirements modeling, analysis, and determination process. The different elements of the proposed approach are discussed and exemplified by an extensive industrial case study related to the development of online distributed power balancing services in the electricity sector.", "num_citations": "3\n", "authors": ["1464"]}
{"title": "Balancing freedom and supervision in a real-life educational project\n", "abstract": " The practicum course Information System Development, offered by the faculty of Mathematics and Computer Science of the Vrije Universiteit, has two main goals:(1) to give students hands-on experience with different aspects of working on a ‘real-life’IT project, and (2) to let them apply previously learned techniques and methodology in a rationalized and integrated way. These goals imply a project setting that mimics reality as close as possible, giving students the possibility to experience a ‘real-life’situation in which they can apply previously learned knowledge and methodology. At the same time, students need a fair amount of supervision to guide them through the project and to ensure that they correctly apply the appropriate techniques and methodology. In this paper, we present an overview of the practicum, its goals, and our approach to balance the amount of freedom and supervision in order to create a true learning experience for our students.", "num_citations": "3\n", "authors": ["1464"]}
{"title": "A Decentralized Fair Governance Model for Permissionless Blockchain Systems\n", "abstract": " Blockchain systems are a new way to reduce or even eliminate the role of the middlemen in an eco-system. For example, the Bitcoin, as one of the most well-known blockchain platforms, shows that it is possible to transfer money without the need of any (intermediate) bank at all. More generally, it allows for the decentralization of roles. In this paper, we focus on permissionless blockchains, which are systems that allow participation without upfront approval on other parties, as opposed to permissioned blockchains. Permissionless blockchain systems support direct business transactions between peers, so without any intermediate and centralized entity very well. However, the organization of the governance of such systems is less obvious. We argue that, in order to arrive at a really decentralized eco-system where power is fairly distributed, the governance should be decentralized; in other words, it should not be in the hand of one controlling entity. In this paper, we analyse, in a model-based way, for three well-known blockchain systems (Bitcoin, Ethereum, Tezos) the governance processes. Based on this analysis, we draft an improved governance process for permissionless blockchains.", "num_citations": "3\n", "authors": ["1464"]}
{"title": "Early Identification of Potential Distributed Ledger Technology Business Cases Using e3value Models\n", "abstract": " Many Distributed Ledger Technology (DLT) projects end prematurely without reaping benefits. Previous research has indicated a lack of sustainable business cases for many Blockchain projects. A successful project has a disruptive impact on the business ecosystem. The paper investigates how e3value modeling can contribute to identifying the potential success of DLT implementation. Using insights from a first DLT case-study, an abstract e3value model fragment is defined that indicates potential success. As a test, the e3value model fragment is subsequently applied to a second case-study that is currently being implemented as a DLT-based platform. The paper concludes by reflecting on how an e3value model can provide evidence of meeting the requirements for building a sustainable DLT business case.", "num_citations": "2\n", "authors": ["1464"]}
{"title": "Technical challenges in market-driven automated service provisioning\n", "abstract": " In today's practice, we see readily precomposed commercial service bundles, such as a spam-free email box, consisting of more elementary services like mail storage and a spam-filter. However, these bundles may be suboptimal from the customer's perspective in terms of price and/or the elementary services that constitute the bundle. It would be advantageous to the customer if a service bundle more closely fulfilled the customer's individual requirements, by selecting the most appropriate elementary services included in the bundle. Also, by obtaining the bundle from a consortium of suppliers, rather than just one single supplier, the elementary services of each supplier with the best cost/benefit ratio can be selected. To put this vision into reality, we need middleware facilitating the automated composition of multisupplier bundles out of basic commercial services available online.", "num_citations": "2\n", "authors": ["1464"]}
{"title": "VA               3: Governance Selection in Value Webs\n", "abstract": " To deal with complex customer needs, enterprises increasingly form constellations, rather than just operate on their own. Cisco Systems and Dell are good examples of organizers of such constellations in their own industries. An important problem while designing these constellations is the selection of a performing enterprise for each value adding activity in the constellation. In this paper, we propose a model-based approach to do so. We use the existing e                 3-value methodology to represent a value constellation formally, and extend e                 3-value with VA3; a step-wise approach that assists in selecting enterprises for performing value activities. How VA3 practically works, is illustrated using a case study on Cisco Systems.", "num_citations": "2\n", "authors": ["1464"]}
{"title": "Introduction to the First International E-Services Workshop, ICEC 03\n", "abstract": " E-services are a relatively new phenomenon and have gained more and more attention by researchers. Services are often characterized as intangible, perishable, experience based, difficult to standardize products needing many interactions between customers and providers. E-services are about the use of information and communication technology, especially web services, for efficient and effective service provisioning. Although e-services is clearly an interdisciplinary research area, and consequently is rather broad, this workshop covers two eservice aspects:(1) modeling and conceptualizing e-services, and (2) e-government services. These two perspectives on e-services exemplify the richness of various views on this new research area. In this way it should strengthen the body of research, widen the view and provides endless opportunities for starting new research.", "num_citations": "2\n", "authors": ["1464"]}
{"title": "A longitudinal study in e-business idea exploration\n", "abstract": " Many innovative e-business ideas are hardly understood by their stakeholders when articulated just by words. To create a better, also shared, understanding, and to enhance confidence in the feasibility of such verbal ideas, we have developed a model-based e-business development approach called e3-value. But does a model-based approach really contribute to the development of innovative e-business ideas? To answer this question, we report on an innovative e-business idea about online news provisioning which has been explored using our e3-value approach, and which has been implemented afterwards. To see the merits of e3-value we revisited this project one-year-and-a-half after its implementation. It then shows up that indeed a modeling approach contributes to e-business development, but also some important lessons can be learned to improve our methodology.", "num_citations": "2\n", "authors": ["1464"]}
{"title": "Designing an Ecosystem Value Model Based on a Process Model–An Empirical Approach\n", "abstract": " Ecosystems have both inter-organizational process models and corresponding business value models. Whereas process models show how actors interact in terms of message flows and the time-ordering of activities, business value models present what is exchanged of economic value and abstract away from operational activities and their control flows. As organizations usually have process models but not explicit value models, we propose to derive a value model from a process model. We hypothesize on how these two models conceptually correspond to each other. We employ a real-world case to verify our hypotheses and learn about the applicability of the proposed design.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "Comparison of Two Value-Modeling Methods: e3 value and SEAM\n", "abstract": " In the last few decades, several value-modeling methods have emerged in requirements engineering for IS research. We compare two value-modeling methods, e 3  value and SEAM. We illustrate their use with an example of the exchange of the Intellectual Property Rights (IPR) on music. In the process, we propose a comparison framework. The results of our study show that e 3  value and SEAM are similar value-modeling techniques: both model services in networked systems and focus on value exchanges. They differ, however, in the way value is conceptualized: the market viability of the service system in e 3  value versus the subjective value and lack of market profitability analysis in SEAM. e 3  value shows how value flows from one actor to another, whereas SEAM shows the relative importance of different value propositions and how they are constructed by the service network. These results can be used by …", "num_citations": "1\n", "authors": ["1464"]}
{"title": "A Low-resource Aware Framework for ICT Service Development in Rural Africa.\n", "abstract": " Technological innovation and information & communication technologies (ICTs) are considered enabling factors for social and economic development, even in very poor parts of the world. However, successful ICT deployments in low-resource regions, with low levels of literacy and poor infrastructures are scarce. In this paper we argue that a user-centered, iterative approach, bridging the gap between developers and local users, is the path to successful, contextualized ICT service development, in benefit of local needs and goals. Based on field experimentation in rural regions of West Africa we present a framework to iteratively and collaboratively develop ICT systems, adapted to local needs and context.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "e3service-A structured methodology for generating needs-driven IT-service bundles in a networked enterprise\n", "abstract": " IT-services should not only be considered from a technical perspective, but should also be seen as commercial services that satisfy a consumer need. Examples include well-known services such as Internet access or an email box. Typically, to satisfy a complex consumer need, a bundle of elementary services is required. In such a bundle, each elementary service can be offered by a different supplier. A key problem is then how to actually find service-bundles that satify customer needs as close as possible. Because IT-service bundles can be automatically provisioned online immediately after ordering, finding a service bundle satisfying a need should preferably also happen automatically. To this end, we propose the e3service ontology, which offers constructs from service marketing, but in a computational way, such that automated reasoning support can be developed to match consumer needs with IT-services. This paper presents the e3service ontology and explains it by a case study in the postal industry", "num_citations": "1\n", "authors": ["1464"]}
{"title": "Considering software quality requirements as networked business quality requirements\n", "abstract": " Over the years, research on software architecture has identified architectural styles. In this paper we consider five of such styles, and analyze whether these styles can also be found in business value models for networked enterprises. To this end, we analyze 17 e3value models, as discussed in 29 academic papers or book chapters. We also consider whether the quality attributes related to the software architecture styles, are also relevant for e3value models. To demonstrate the relevance of our findings we present a case study.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "E3forces: Analyzing Strategic Considerations of Actors in Networked Value Constellations\n", "abstract": " Increasingly organizations are participating in networked value constellations, which are networks where organizations, enabled by information technology, jointly create value and satisfy customer needs. However, participating in a networked value constellation increases the problem of correctly understanding the organization, which is necessary to design (cross)-organizational IT support. Therefore, business modeling approaches for networked constellations, such as e3value, BMO, and REA, have been developed. In this paper, we extend these business modeling approaches to understand the strategic rationale behind business models. We propose the business modeling technique e3forces to understand strategic motivations of organizations. Furthermore we utilize e3forces to (1) analyze if the business strategy of an organization is consistent with its strategic position in the constellation and (2) analyze the impact of deploying IT on forces in the environment of actors in a constellation. To develop and assess e3forces a case study was conducted in the Dutch aviation industry.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "A consumer needs-driven approach for finding it-service bundles\n", "abstract": " Today, IT-support for enterprises is increasingly delivered as a commercial service. Consequently, IT-service provisioning requires at least two enterprises, a seller and a buyer. Moreover, the seller itself can often be considered as a network of enterprises, jointly satisfying an IT-need of a buyer, thereby utilizing each other strengths. In this paper, we contribute an ontologically well-founded methodology called e3service for creating multi-supplier IT-service bundles that satisfy customer IT-needs. Such IT-needs, actually being high level problem statements that often require multiple IT-services to cover (hence the term bundle), are often too ill-defined to find specific IT-services for, thus requiring a systematic approach to finding these solutions. The main idea behind e3service is to conceptualize established ideas from service marketing literature, with the ultimate aim to generate a bundle of IT-services semi-automatically starting from a vague customer need. This paper focuses itself on a systematic analysis of a customer need, or: how to gradually arrive from a vague problem statement to specific IT-services covering this problem statement. We illustrate this process by using findings from a case study performed with an industry partner.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "e3competences: Understanding core competences of organizations\n", "abstract": " In this paper we present the e3competences ontology, which enables us to conceptually model core competences of an organization such that we can (1) identify the core competences and (2) analyze whether value activities positively or negatively contribute to the core competences of the organization at hand. The e3competences ontology, which has an internal view on organization and is partially based on the e3value ontology, is positioned next to the e3forces ontology, which has an external view on organizations.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "Toward value-based business-IT alignment\n", "abstract": " Toward value-based business-IT alignment — Vrije Universiteit Amsterdam Skip to main navigation Skip to search Skip to main content Vrije Universiteit Amsterdam Logo Help & FAQ Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Search by expertise, name or affiliation Toward value-based business-IT alignment Z. Derzsi, J. Gordijn Business Web and Media Business & Web Research output: Chapter in Book / Report / Conference proceeding › Conference contribution › Academic › peer-review Overview Original language English Title of host publication Proceedings of the Workshops and Doctoral Consortium of CAiSE Editors T. Latour, M. Petit Place of Publication Namur, Belgium Publisher Namur University Press Publication status Published - 2006 Bibliographical note Derzsi06:busital Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Derzsi, Z., & Gordijn, J. (…", "num_citations": "1\n", "authors": ["1464"]}
{"title": "5 eBusiness Value Modelling Using the e3value Ontology\n", "abstract": " A first step in developing eBusiness ideas is to understand such an idea thoroughly. In the recent past, industry has clearly demonstrated that such an understanding lacks or at least is insufficient, resulting in failures and sometimes even bankruptcies. In this chapter we present an approach to design an eBusiness model, called the e3value approach. This approach is ontologically founded in business science, marketing and axiology, but exploits rigorous conceptual modelling as a way of working known from computer science. The aim is that an e3value eBusiness model contributes to a better and shared understanding of the idea at stake, specifically with the respect to its profit drivers. If the model is attributed with various assumptions, such as economic valuation of objects produced, distributed, and consumed, we can derive profitability sheets using the business model. These can be used to assess whether the idea seems to be profitable for all actors involved in the idea. We illustrate the e3value approach by a project we carried out for an Internet Service Provider.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "Designing Control Mechanisms for Networked Enterprises: The Internet Radio Case Study\n", "abstract": " In a network of organisations the design of appropriate control mechanisms is important to prevent and detect opportunistic behaviour of the members of the network. In most cases, control mechanisms can already be seen in the business value model, because most controls add new exchanges of economic value between enterprises. However, controls encompass also operational aspects, not covered by business value models, but which are important for the understanding and operation of controls. We developed the e3-value+ methodology for designing inter-organisational control mechanisms, based on analysing value aspects of network organisations. We illustrate it with the case for the distribution of music tracks via Internet radio, where we apply the methodology to design a control to monitor whether Internet radio stations and Right Societies cleared the right amount of tracks. We present the control mechanism not only from a business value model perspective, but also from an operational perspective, thus showing that the control can indeed be implemented.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "Requirements Engineering for Value Webs\n", "abstract": " Value webs are cooperating, networked enterprises and end-consumers that create, distribute, and consume things of economic value. The task of creating, designing, and analyzing such webs is a prototypical example of a multi-disciplinary task. Business-oriented stakeholders are involved because the way an enterprise creates economic value is discussed. But also representatives responsible for business processes (many innovative value webs require changes in processes) and inter-organizational information systems (enabling value webs from a technical point of view) play a key role, as well as end-consumers. To facilitate exploration and analysis of such value webs, we propose an approach called e3value that utilizes terminology from business sciences, marketing, and axiology but is founded on methodology seen in requirements engineering such as semi-formal, lightweight graphical conceptual …", "num_citations": "1\n", "authors": ["1464"]}
{"title": "Towards a modelling tool for designing control mechanisms in network organisations\n", "abstract": " Contracts and organizational controls to monitor contract compliance are important tools to enhance trust in a fair business transaction in network organisations and electronic commerce in general. In this paper, we propose a design methodology for such contracts and supporting controls, utilizing inter-organisational value models. We argue that a framework for designing control mechanisms should include three steps: design of an inter-organizational value model, analysis of possible violations of contractual obligations underlying this value model, and design of control mechanisms to detect or prevent such violations. It is shown how the e3-value methodology, which was developed to design business value models, can be extended to model obligations of parties. We use concepts and ideas from deontic logic (the logic of obligations and permissions) to develop an extension of e3-value called e3-value+. The e3 …", "num_citations": "1\n", "authors": ["1464"]}
{"title": "E-Business ontology\n", "abstract": " Over the past few years, many innovative e-commerce ideas have been considered. Such ideas reveal new value propositions, which are enabled by new technological possibilities, such as the widespread use of the Internet and technologies on top of it.During 1998-1999, the e-commerce hype reached its top. Recently, it became clear that many e-commerce ideas are not successful [34]. Many enterprises doing e-commerce have not been able to create profit with their e-commerce ideas. Some of these companies who relied entirely on future e-commerce profits have gone bankrupt.", "num_citations": "1\n", "authors": ["1464"]}
{"title": "Requirements for Electronic Commerce Applications are created rather than elicited\n", "abstract": " Electronic commerce applications are a challenging new class of information systerns. Due to the everincreasing technical possibilities, new, yet undiscovered ways of doing business are possible. Therefore, requirements for e-commerce systerns can hardly be elicited but instead need to be created because elicitation requires a dormant view ofusers on requirements. Also, E-commerce systerns are, in contrast to other information systerns, an intrinsic part of the product or service a companyoffers to others. Therefore, developing the business model, which represents the offering, and defining the requirements for a supporting e-commerce system, is not a sequential process and, neither can it be done in a decoupled way. Current requirements engineering methodology does not support requirements creation nor deals with information system requirements as an intrinsic part of developing business models. We outline a structured approach to e-commerce requirements creation called e3-VALUE. This approach identifies three views to be developed:(l) the e-business model view,(2) the e-business process view and (3), the esoftware architecture view. We discuss the e-business model view in more detail and discuss a more formal way to represent business models. In our interpretation of'business model', the notion ofvalue is a central theme. We illustrate our e3-VALUEby presenting an experience report.", "num_citations": "1\n", "authors": ["1464"]}