{"title": "Pursuing prosthetic electronic skin\n", "abstract": " Skin plays an important role in mediating our interactions with the world. Recreating the properties of skin using electronic devices could have profound implications for prosthetics and medicine. The pursuit of artificial skin has inspired innovations in materials to imitate skin's unique characteristics, including mechanical durability and stretchability, biodegradability, and the ability to measure a diversity of complex sensations over large areas. New materials and fabrication strategies are being developed to make mechanically compliant and multifunctional skin-like electronics, and improve brain/machine interfaces that enable transmission of the skin's signals into the body. This Review will cover materials and devices designed for mimicking the skin's ability to sense and generate biomimetic signals.", "num_citations": "1246\n", "authors": ["7"]}
{"title": "Multifunctional mesoporous composite microspheres with well-designed nanostructure: a highly integrated catalyst system\n", "abstract": " The precise control of the size, morphology, surface chemistry, and assembly process of each component is important to construction of integrated functional nanocomposites. We report here the fabrication of multifunctional microspheres which possess a core of nonporous silica-protected magnetite particles, transition layer of active gold nanoparticles, and an outer shell of ordered mesoporous silica with perpendicularly aligned pore channels. The well-designed microspheres have high magnetization (18.6 emu/g), large surface area (236 m2/g), highly open mesopores (Γê╝2.2 nm), and stably confined but accessible Au nanoparticles and, as a result, show high performance in catalytic reduction of 4-nitrophenol (with conversion of 95% in 12 min), styrene epoxidation with high conversion (72%) and selectivity (80%), especial convenient magnetic separability, long life and good reusability. The unique nanostructure┬áΓÇª", "num_citations": "896\n", "authors": ["7"]}
{"title": "Highly waterΓÇÉdispersible biocompatible magnetite particles with low cytotoxicity stabilized by citrate groups\n", "abstract": " Uniform magnetite particles stabilized by citrate groups were successfully synthesized by a modified high-temperature solvothermal reaction. Cell imaging reveals that the water-dispersible particles can readily penetrate into cells without destroying them, indicating an excellent biocompatibility. A high enrichment capacity of the magnetite particles for separation of trace peptides is observed.", "num_citations": "809\n", "authors": ["7"]}
{"title": "A bioinspired flexible organic artificial afferent nerve\n", "abstract": " The distributed network of receptors, neurons, and synapses in the somatosensory system efficiently processes complex tactile information. We used flexible organic electronics to mimic the functions of a sensory nerve. Our artificial afferent nerve collects pressure information (1 to 80 kilopascals) from clusters of pressure sensors, converts the pressure information into action potentials (0 to 100 hertz) by using ring oscillators, and integrates the action potentials from multiple ring oscillators with a synaptic transistor. Biomimetic hierarchical structures can detect movement of an object, combine simultaneous pressure inputs, and distinguish braille characters. Furthermore, we connected our artificial afferent nerve to motor nerves to construct a hybrid bioelectronic reflex arc to actuate muscles. Our system has potential applications in neurorobotics and neuroprosthetics.", "num_citations": "550\n", "authors": ["7"]}
{"title": "Macroporous nanowire nanoelectronic scaffolds for synthetic tissues\n", "abstract": " The development of three-dimensional (3D) synthetic biomaterials as structural and bioactive scaffolds is central to fields ranging from cellular biophysics to regenerative medicine. As of yet, these scaffolds cannot electrically probe the physicochemical and biological microenvironments throughout their 3D and macroporous interior, although this capability could have a marked impact in both electronics and biomaterials. Here, we address this challenge using macroporous, flexible and free-standing nanowire nanoelectronic scaffolds (nanoES), and their hybrids with synthetic or natural biomaterials. 3D macroporous nanoES mimic the structure of natural tissue scaffolds, and they were formed by self-organization of coplanar reticular networks with built-in strain and by manipulation of 2D mesh matrices. NanoES exhibited robust electronic properties and have been used alone or combined with other biomaterials as┬áΓÇª", "num_citations": "547\n", "authors": ["7"]}
{"title": "Syringe injectable electronics\n", "abstract": " With recent advancement in nanotechnology and materials science, we have been able to fabricate electronics on flexible, stretchable and 3D substrates to cover electrical functional units on soft and non-planar surfaces for monitoring, control and making smart systems. New requirements have been raised that electronics need to be implemented into objects with a minimal invasiveness followed by a 3D distribution of nano- and micro-scale sensor units in a large volume while maintaining mechanical ultra-flexibility.", "num_citations": "465\n", "authors": ["7"]}
{"title": "Syringe-injectable electronics\n", "abstract": " With recent advancement in nanotechnology and materials science, we have been able to fabricate electronics on flexible, stretchable and 3D substrates to cover electrical functional units on soft and non-planar surfaces for monitoring, control and making smart systems. New requirements have been raised that electronics need to be implemented into objects with a minimal invasiveness followed by a 3D distribution of nano- and micro-scale sensor units in a large volume while maintaining mechanical ultra-flexibility.", "num_citations": "465\n", "authors": ["7"]}
{"title": "Three-dimensional intact-tissue sequencing of single-cell transcriptional states\n", "abstract": " INTRODUCTION Single-cell RNA sequencing has demonstrated that both stable cell types and transient cell states can be discovered and defined by transcriptomes. In situ transcriptomic methods can map both RNA quantity and position; however, it remains challenging to simultaneously satisfy key technological requirements such as efficiency, signal intensity, accuracy, scalability to large gene numbers, and applicability to three-dimensional (3D) volumes. Well-established single-molecule fluorescence in situ hybridization (FISH) approaches (such as MERFISH and seqFISH) have high detection efficiency but require long RNA species (more than 1000 nucelotides) and yield lower intensity than that of enzymatic amplification methods (tens versus thousands of fluorophores per RNA molecule). Other pioneering in situ sequencing methods (via padlock probes and fluorescent in situ sequencing) use enzymatic┬áΓÇª", "num_citations": "441\n", "authors": ["7"]}
{"title": "A highly stretchable, transparent, and conductive polymer\n", "abstract": " Previous breakthroughs in stretchable electronics stem from strain engineering and nanocomposite approaches. Routes toward intrinsically stretchable molecular materials remain scarce but, if successful, will enable simpler fabrication processes, such as direct printing and coating, mechanically robust devices, and more intimate contact with objects. We report a highly stretchable conducting polymer, realized with a range of enhancers that serve a dual function: (i) they change morphology and (ii) they act as conductivity-enhancing dopants in poly(3,4-ethylenedioxythiophene):poly(styrenesulfonate) (PEDOT:PSS). The polymer films exhibit conductivities comparable to the best reported values for PEDOT:PSS, with over 3100 S/cm under 0% strain and over 4100 S/cm under 100% strainΓÇöamong the highest for reported stretchable conductors. It is highly durable under cyclic loading, with the conductivity maintained┬áΓÇª", "num_citations": "414\n", "authors": ["7"]}
{"title": "Synthesis of core/shell colloidal magnetic zeolite microspheres for the immobilization of trypsin\n", "abstract": " Magnetic zeolite microspheres are synthesized by combining sol-gel synthesis and vapor-phase transport. The microspheres, which have magnetite cores and crystalline zeolite shells (see figure), exhibit super-paramagnetism and a high adsorption capacity for trypsin. Trypsin-adsorbed microspheres digest proteins very efficiently (in only 15 s) in the presence of microwave radiation.", "num_citations": "284\n", "authors": ["7"]}
{"title": "Three-dimensional macroporous nanoelectronic networks as minimally invasive brain probes\n", "abstract": " Direct electrical recording and stimulation of neural activity using micro-fabricated silicon and metal micro-wire probes have contributed extensively to basic neuroscience and therapeutic applications; however, the dimensional and mechanical mismatch of these probes with the brain tissue limits their stability in chronic implants and decreases the neuronΓÇôdevice contact. Here, we demonstrate the realization of a three-dimensional macroporous nanoelectronic brain probe that combines ultra-flexibility and subcellular feature sizes to overcome these limitations. Built-in strains controlling the local geometry of the macroporous devices are designed to optimize the neuron/probe interface and to promote integration with the brain tissue while introducing minimal mechanical perturbation. The ultra-flexible probes were implanted frozen into rodent brains and used to record multiplexed local field potentials and single-unit┬áΓÇª", "num_citations": "267\n", "authors": ["7"]}
{"title": "Biocompatible and totally disintegrable semiconducting polymer for ultrathin and ultralightweight transient electronics\n", "abstract": " Increasing performance demands and shorter use lifetimes of consumer electronics have resulted in the rapid growth of electronic waste. Currently, consumer electronics are typically made with nondecomposable, nonbiocompatible, and sometimes even toxic materials, leading to serious ecological challenges worldwide. Here, we report an example of totally disintegrable and biocompatible semiconducting polymers for thin-film transistors. The polymer consists of reversible imine bonds and building blocks that can be easily decomposed under mild acidic conditions. In addition, an ultrathin (800-nm) biodegradable cellulose substrate with high chemical and thermal stability is developed. Coupled with iron electrodes, we have successfully fabricated fully disintegrable and biocompatible polymer transistors. Furthermore, disintegrable and biocompatible pseudo-complementary metalΓÇôoxideΓÇôsemiconductor (CMOS┬áΓÇª", "num_citations": "240\n", "authors": ["7"]}
{"title": "Soft and elastic hydrogel-based microelectronics for localized low-voltage neuromodulation\n", "abstract": " Narrowing the mechanical mismatch between tissue and implantable microelectronics is essential for reducing immune responses and for accommodating body movement. However, the design of implantable soft electronics (on the order of 10 kPa in modulus) remains a challenge because of the limited availability of suitable electronic materials. Here, we report electrically conductive hydrogel-based elastic microelectronics with YoungΓÇÖs modulus values in the kilopascal range. The system consists of a highly conductive soft hydrogel as a conductor and an elastic fluorinated photoresist as the passivation insulation layer. Owing to the high volumetric capacitance and the passivation layer of the hydrogel, electrode arrays of the thin-film hydrogel ΓÇÿelastronicsΓÇÖ, 20 ╬╝m in feature size, show a significantly reduced interfacial impedance with tissue, a current-injection density that is~ 30 times higher than that of platinum┬áΓÇª", "num_citations": "199\n", "authors": ["7"]}
{"title": "Fast and reversible thermoresponsive polymer switching materials for safer batteries\n", "abstract": " Safety issues have been a long-standing obstacle impeding large-scale adoption of next-generation high-energy-density batteries. Materials solutions to battery safety management are limited by slow response and small operating voltage windows. Here we report a fast and reversible thermoresponsive polymer switching material that can be incorporated inside batteries to prevent thermal runaway. This material consists of electrochemically stable graphene-coated spiky nickel nanoparticles mixed in a polymer matrix with a high thermal expansion coefficient. The as-fabricated polymer composite films show high electrical conductivity of up to 50 S cmΓêÆ 1 at room temperature. Importantly, the conductivity decreases within one second by seven to eight orders of magnitude on reaching the transition temperature and spontaneously recovers at room temperature. Batteries with this self-regulating material built in the┬áΓÇª", "num_citations": "196\n", "authors": ["7"]}
{"title": "Long term stability of nanowire nanoelectronics in physiological environments\n", "abstract": " Nanowire nanoelectronic devices have been exploited as highly sensitive subcellular resolution detectors for recording extracellular and intracellular signals from cells, as well as from natural and engineered/cyborg tissues, and in this capacity open many opportunities for fundamental biological research and biomedical applications. Here we demonstrate the capability to take full advantage of the attractive capabilities of nanowire nanoelectronic devices for long term physiological studies by passivating the nanowire elements with ultrathin metal oxide shells. Studies of Si and Si/aluminum oxide (Al2O3) core/shell nanowires in physiological solutions at 37 ┬░C demonstrate long-term stability extending for at least 100 days in samples coated with 10 nm thick Al2O3 shells. In addition, investigations of nanowires configured as field-effect transistors (FETs) demonstrate that the Si/Al2O3 core/shell nanowire FETs exhibit┬áΓÇª", "num_citations": "126\n", "authors": ["7"]}
{"title": "Ultra-Large-Pore Mesoporous Carbons Templated from Poly(ethylene oxide)-b-Polystyrene Diblock Copolymer by Adding Polystyrene Homopolymer as a Pore┬áΓÇª\n", "abstract": " A pore swelling approach was developed for the synthesis of ultralarge mesoporous carbons by using diblock copolymer PEO125-b-PS230 as a template, homopolystyrene (h-PS49) as a pore expander, resol as a carbon source, and THF as a solvent through solvent evaporation induced self-assembly (EISA). Small-angle X-ray scattering (SAXS) and transmission electron microscopy (TEM) characterizations show that when h-PS94 amount is lower than 20 wt% relative to PEO125-b-PS230, highly ordered face-center cubic (fcc) mesoporous carbon structure (space group Fm3╠àm) with ultralarge cell parameter of 46.4ΓêÆ58.0 nm can be obtained. Nitrogen sorption measurements reveal that the obtained LP-FDU-18s possess high surface area of about 1210 m2/g and large pore volume of 1.10 cm3/g. Because of adding pore swelling agent h-PS49, the mesostructural shrinkage is restrained, the pore wall thickness┬áΓÇª", "num_citations": "126\n", "authors": ["7"]}
{"title": "Three-dimensional mapping and regulation of action potential propagation in nanoelectronics-innervated tissues\n", "abstract": " Real-time mapping and manipulation of electrophysiology in three-dimensional (3D) tissues could have important impacts on fundamental scientific and clinical studies, yet realization is hampered by a lack of effective methods. Here we introduce tissue-scaffold-mimicking 3D nanoelectronic arrays consisting of 64 addressable devices with subcellular dimensions and a submillisecond temporal resolution. Real-time extracellular action potential (AP) recordings reveal quantitative maps of AP propagation in 3D cardiac tissues, enable in situ tracing of the evolving topology of 3D conducting pathways in developing cardiac tissues and probe the dynamics of AP conduction characteristics in a transient arrhythmia disease model and subsequent tissue self-adaptation. We further demonstrate simultaneous multisite stimulation and mapping to actively manipulate the frequency and direction of AP propagation. These┬áΓÇª", "num_citations": "123\n", "authors": ["7"]}
{"title": "Nanoelectronics-biology frontier: From nanoscopic probes for action potential recording in live cells to three-dimensional cyborg tissues\n", "abstract": " Semiconductor nanowires configured as the active channels of field-effect transistors (FETs) have been used as detectors for high-resolution electrical recording from single live cells, cell networks, tissues and organs. Extracellular measurements with substrate supported silicon nanowire (SiNW) FETs, which have projected active areas orders of magnitude smaller than conventional microfabricated multielectrode arrays (MEAs) and planar FETs, recorded action potential and field potential signals with high signal-to-noise ratio and temporal resolution from cultured neurons, cultured cardiomyocytes, acute brain slices and whole animal hearts. Measurements made with modulation-doped nanoscale active channel SiNW FETs demonstrate that signals recorded from cardiomyocytes are highly localized and have improved time resolution compared to larger planar detectors. In addition, several novel three┬áΓÇª", "num_citations": "116\n", "authors": ["7"]}
{"title": "Multifunctional three-dimensional macroporous nanoelectronic networks for smart materials\n", "abstract": " Seamless and minimally invasive integration of 3D electronic circuitry within host materials could enable the development of materials systems that are self-monitoring and allow for communication with external environments. Here, we report a general strategy for preparing ordered 3D interconnected and addressable macroporous nanoelectronic networks from ordered 2D nanowire nanoelectronic precursors, which are fabricated by conventional lithography. The 3D networks have porosities larger than 99%, contain approximately hundreds of addressable nanowire devices, and have feature sizes from the 10-╬╝m scale (for electrical and structural interconnections) to the 10-nm scale (for device elements). The macroporous nanoelectronic networks were merged with organic gels and polymers to form hybrid materials in which the basic physical and chemical properties of the host were not substantially altered, and┬áΓÇª", "num_citations": "80\n", "authors": ["7"]}
{"title": "A simple approach to the synthesis of hollow microspheres with magnetite/silica hybrid walls\n", "abstract": " In this paper, we report a simple approach for templating synthesis of magnetic hollow composite microspheres with magnetite/silica walls. This approach is based on the co-sedimentation of polymer microspheres and magnetic colloids followed by impregnation with silica oligomer from tetraethyl orthosilicate and the further removal of the polymer microspheres by pyrolysis. The diameter of the hollow microspheres can be adjusted in range of 300 nmΓÇô2.0 ╬╝m by using polymer microspheres of different sizes and the wall thickness is tunable from 10ΓÇô50 nm by controlling ratio of magnetite to the polymer microspheres. Magnetic characterizations show that the hollow microspheres have superparamagnetism with magnetization saturation of 10ΓÇô30 emu/g. HRTEM and N 2 adsorptionΓÇôdesorption isotherms reveal that the hollow microspheres have numerous nanopores in the walls with a broad distribution in the range┬áΓÇª", "num_citations": "45\n", "authors": ["7"]}
{"title": "we must keep going i guess\n", "abstract": " Genetically targeted chemical assembly of functional materials in living cells, tissues, and animals The structural and functional complexity of multicellular biological systems, such as the brain, are beyond the reach of human design or assembly capabilities. Cells in living organisms may be recruited to construct synthetic materials or structures if treated as anatomically defined compartments for specific chemistry, harnessing biology for the assembly of complex functional structures. By integrating engineered-enzyme targeting and polymer chemistry, we genetically instructed specific living neurons to guide chemical synthesis of electrically functional (conductive or insulating) polymers at the plasma membrane. Electrophysiological and behavioral analyses confirmed that rationally designed, genetically targeted assembly of functional polymers not only preserved neuronal viability but also achieved remodeling of membrane properties and modulated cell typeΓÇôspecific behaviors in freely moving animals. This┬áΓÇª", "num_citations": "43\n", "authors": ["7"]}
{"title": "Cyborg organoids: implantation of nanoelectronics via organogenesis for tissue-wide electrophysiology\n", "abstract": " Tissue-wide electrophysiology with single-cell and millisecond spatiotemporal resolution is critical for heart and brain studies. Issues arise, however, from the invasive, localized implantation of electronics that destroys well-connected cellular networks within matured organs. Here, we report the creation of cyborg organoids: the three-dimensional (3D) assembly of soft, stretchable mesh nanoelectronics across the entire organoid by the cellΓÇôcell attraction forces from 2D-to-3D tissue reconfiguration during organogenesis. We demonstrate that stretchable mesh nanoelectronics can migrate with and grow into the initial 2D cell layers to form the 3D organoid structure with minimal impact on tissue growth and differentiation. The intimate contact between the dispersed nanoelectronics and cells enables us to chronically and systematically observe the evolution, propagation, and synchronization of the bursting dynamics in┬áΓÇª", "num_citations": "41\n", "authors": ["7"]}
{"title": "Magnetic 3-D ordered macroporous silica templated from binary colloidal crystals and its application for effective removal of microcystin\n", "abstract": " Magnetic 3-D ordered macroporous siliceous materials were conveniently fabricated by combination of a simple co-sedimentation of binary colloidal system of PMMA spheres and magnetite nanoparticles and the infiltration of silica precursors. The SEM and TEM observations indicate that the obtained magnetic 3-D ordered macroporous silica materials have face-centered cubic (fcc) packing structure with ordered macropore of Γê╝200┬ánm and interconnected windows of about 50┬ánm. Magnetic property characterization shows that the magnetic 3-D ordered macroporous silica materials possess high magnetization (19.2┬áemu/g) and superparamagentism. By utilization of their ordered macroporous structure with large entrances and good affinity for biomacromolecules as well as high magnetization, a fast and efficient removal of microcystin in water with high removal efficiency (>93%) and removal capacity (3.3┬áng┬áMC┬áΓÇª", "num_citations": "38\n", "authors": ["7"]}
{"title": "Roadmap on semiconductorΓÇôcell biointerfaces\n", "abstract": " This roadmap outlines the role semiconductor-based materials play in understanding the complex biophysical dynamics at multiple length scales, as well as the design and implementation of next-generation electronic, optoelectronic, and mechanical devices for biointerfaces. The roadmap emphasizes the advantages of semiconductor building blocks in interfacing, monitoring, and manipulating the activity of biological components, and discusses the possibility of using active semiconductorΓÇôcell interfaces for discovering new signaling processes in the biological world.", "num_citations": "31\n", "authors": ["7"]}
{"title": "Fully stretchable active-matrix organic light-emitting electrochemical cell array\n", "abstract": " Intrinsically and fully stretchable active-matrix-driven displays are an important element to skin electronics that can be applied to many emerging fields, such as wearable electronics, consumer electronics and biomedical devices. Here, we show for the first time a fully stretchable active-matrix-driven organic light-emitting electrochemical cell array. Briefly, it is comprised of a stretchable light-emitting electrochemical cell array driven by a solution-processed, vertically integrated stretchable organic thin-film transistor active-matrix, which is enabled by the development of chemically-orthogonal and intrinsically stretchable dielectric materials. Our resulting active-matrix-driven organic light-emitting electrochemical cell array can be readily bent, twisted and stretched without affecting its device performance. When mounted on skin, the array can tolerate to repeated cycles at 30% strain. This work demonstrates the feasibility┬áΓÇª", "num_citations": "27\n", "authors": ["7"]}
{"title": "Intrinsically stretchable electrode array enabled in vivo electrophysiological mapping of atrial fibrillation at cellular resolution\n", "abstract": " Electrophysiological mapping of chronic atrial fibrillation (AF) at high throughput and high resolution is critical for understanding its underlying mechanism and guiding definitive treatment such as cardiac ablation, but current electrophysiological tools are limited by either low spatial resolution or electromechanical uncoupling of the beating heart. To overcome this limitation, we herein introduce a scalable method for fabricating a tissue-like, high-density, fully elastic electrode (elastrode) array capable of achieving real-time, stable, cellular level-resolution electrophysiological mapping in vivo. Testing with acute rabbit and porcine models, the device is proven to have robust and intimate tissue coupling while maintaining its chemical, mechanical, and electrical properties during the cardiac cycle. The elastrode array records epicardial atrial signals with comparable efficacy to currently available endocardial-mapping┬áΓÇª", "num_citations": "27\n", "authors": ["7"]}
{"title": "A novel approach to the construction of 3-D ordered macrostructures with polyhedral particles\n", "abstract": " A novel and facile approach was developed for the fabrication of 3-D ordered macrostructures of polyhedral particles through coating and packing of monodisperse polystyrene-co-poly[3-(trimethoxylsilyl)propyl methacrylate] (St-co-TMSPM) microspheres with the amphiphilic triblock copolymer F127 and phenolic resol by centrifugation, and subsequent thermosetting treatment of the deposited microspheres. The polyhedral particles possess a regular shape of rhombic dodecahedra (Γê╝1 ┬╡m) due to the spontaneous deformation of the fcc packed polymeric microspheres coated with resolΓÇôF127 composites during the thermosetting process. The amphiphilic triblock copolymer F127 plays a vital role in the formation of the ordered macrostructured polyhedral particles with compatible poly(St-co-TMSPM)ΓÇôresin composites. The simplicity of the fabrication method should open up a new door to the synthesis of nonspherical┬áΓÇª", "num_citations": "18\n", "authors": ["7"]}
{"title": "Homopolymer induced phase evolution in mesoporous silica from evaporation induced self-assembly process\n", "abstract": " In this paper, we report the experimental findings on the phase evolution of mesoporous silica in an evaporation induced self-assembly (EISA) approach by using low molecular weight homopolymer poly (propylene oxide)(M n= 400, PPO400) as an additive. It is found that the addition of PPO400 can cause hydrotropic curvature-reducing effect on the mesostructures. Upon the increase of PPO400 addition amount, the structures of the obtained mesoporous silicas gradually evolve from three-dimensional (3-D) cubic Im 3┬» m to quasi-p6m, to hexagonal p6m, and to mixed structures consisting of lamellar and reversed cylindrical structure. The quasi-p6m mesoporous silica structure has the buckled cylindrical mesopores with intermediate curvature and acts as the metastable structure during the phase evolution from Im 3┬» m to p6m structure. We ascribe this curvature-reducing effect to the relatively weak hydrophobicity┬áΓÇª", "num_citations": "16\n", "authors": ["7"]}
{"title": "Methods and systems for scaffolds comprising nanoelectronic components\n", "abstract": " Priority date (The priority date is an assumption and is not a legal conclusion. Google has not performed a legal analysis and makes no representation as to the accuracy of the date listed.) 2012-09-07", "num_citations": "12\n", "authors": ["7"]}
{"title": "Fundamental limits to the electrochemical impedance stability of dielectric elastomers in bioelectronics\n", "abstract": " Incorporation of elastomers into bioelectronics that reduces the mechanical mismatch between electronics and biological systems could potentially improve the long-term electronicsΓÇôtissue interface. However, the chronic stability of elastomers in physiological conditions has not been systematically studied. Here, using electrochemical impedance spectrum we find that the electrochemical impedance of dielectric elastomers degrades over time in physiological environments. Both experimental and computational results reveal that this phenomenon is due to the diffusion of ions from the physiological solution into elastomers over time. Their conductivity increases by 6 orders of magnitude up to 10ΓÇô8 S/m. When the passivated conductors are also composed of intrinsically stretchable materials, higher leakage currents can be detected. Scaling analyses suggest fundamental limitations to the electrical performances of┬áΓÇª", "num_citations": "10\n", "authors": ["7"]}
{"title": "From lithographically patternable to genetically patternable electronic materials for miniaturized, scalable, and soft implantable bioelectronics to interface with nervous and┬áΓÇª\n", "abstract": " Soft implantable bioelectronics, capable of maintaining an intimate, chronically stable tissue interface to provide single-cell spatial resolution, millisecond temporal resolution, and cell-type-specific interrogation and intervention, are important to biological research and clinical application. Despite remarkable advancements in recent years, the establishment of miniaturized, scalable, and soft bioelectronic interfaces to a large number of cells three-dimensionally (3D) distributed across cardiac and neural tissues in freely behaving animals and human subjects remains a challenge. In this Review, we discuss recent progress in studies and designs of lithographically and/or genetically patternable electronic materials to address these questions. First, we summarize the development of lithographically patternable electronic materials with proper electrical and mechanical properties, biocompatibility, and long-term stability┬áΓÇª", "num_citations": "6\n", "authors": ["7"]}
{"title": "Scaffolds comprising nanoelectronic components for cells, tissues, and other applications\n", "abstract": " The present invention generally relates to nanoscale wires and tissue engineering. In various embodiments, cell scaf folds for growing cells or tissues can be formed that include nanoscale wires that can be connected to electronic circuits extending externally of the cell scaffold. The nanoscale wires may form an integral part of cells or tissues grown from the cell scaffold, and can even be determined or controlled, eg, using various electronic circuits. This approach allows for the creation of fundamentally new types of functionalized cells and tissues, due to the high degree of electronic control offered by the nanoscale wires and elec tronic circuits. Accordingly, Such cell scaffolds can be used to grow cells or tissues which can be determined and/or controlled at very high resolutions, due to the presence of the nanoscale wires, and Such cell scaffolds will find use in a wide variety of novel applications, including┬áΓÇª", "num_citations": "5\n", "authors": ["7"]}
{"title": "Three-dimensional networks comprising nanoelectronics\n", "abstract": " BACKGROUND0004 Two basic methods have been used to fabricate 3D integrated electronic circuits. The first involves bonding sub strates, each containing devices/circuits integrated in 2D, together in a 3D stack. The second exploits bottom-up assem bly of nanoelectronic elements in a layer-by-layer manner. However, both methods yield solid or nonporous 3D struc tures that only allow the top-most layer of electronic elements to be merged directly with a second material and thus pre cluding integration of all of the electronic elements seam lessly with a host material in 3D. Accordingly, improvements in fabrication techniques are needed.", "num_citations": "5\n", "authors": ["7"]}
{"title": "In situ electro-sequencing in three-dimensional tissues\n", "abstract": " Pairwise mapping of single-cell gene expression and electrophysiology in intact three-dimensional (3D) tissues is crucial for studying electrogenic organs (e.g., brain and heart). Here, we introduce in situ electro-sequencing (electro-seq), combining soft bioelectronics with in situ RNA sequencing to stably map millisecond-timescale cellular electrophysiology and simultaneously profile a large number of genes at single-cell level across 3D tissues. We applied in situ electro-seq to 3D human induced pluripotent stem cell-derived cardiomyocyte (hiPSC-CM) patches, precisely registering the CM gene expression with electrophysiology at single-cell level, enabling multimodal in situ analysis. Such multimodal data integration substantially improved the dissection of cell types and the reconstruction of developmental trajectory from spatially heterogeneous tissues. Using machine learning (ML)-based cross-modal analysis, in situ electro-seq identified the gene-to-electrophysiology relationship over the time course of cardiac maturation. Further leveraging such a relationship to train a coupled autoencoder, we demonstrated the prediction of single-cell gene expression profile evolution using long-term electrical measurement from the same cardiac patch or 3D millimeter-scale cardiac organoids. As exemplified by cardiac tissue maturation, in situ electro-seq will be broadly applicable to create spatiotemporal multimodal maps and predictive models in electrogenic organs, allowing discovery of cell types and gene programs responsible for electrophysiological function and dysfunction.", "num_citations": "2\n", "authors": ["7"]}
{"title": "Stretchable Electrets: NanoparticleΓÇôElastomer Composites\n", "abstract": " Manipulating charges is fundamental to numerous systems, and this ability is achieved through materials of diverse characteristics. Electrets are dielectrics that trap charges or dipoles. Applications include electrophotography, microphones, air filters, and energy harvesters. To trap charges or dipoles for a long time, electrets are commonly made of hard dielectrics. Stretchable dielectrics are shortΓÇôlived electrets. The two properties, longevity and stretchability, conflict; existing electrets struggle to attain both. This work describes an approach to developing stretchable electrets. Nanoparticles of a hard electret are immobilized in a matrix of dielectric elastomer. The composite divides the labor of two functions: the particles trap charges with longevity, and the matrix enables stretchability. The design considerably broadens the choice of materials to enable stretchable electrets. Silica nanoparticles in the┬áΓÇª", "num_citations": "2\n", "authors": ["7"]}
{"title": "Nanoscale wire probes for the brain and other applications\n", "abstract": " The present invention generally relates to nanoscale wires and, in particular, to probes comprising nanoscale wires for use in determining properties such as electrical and/or chemical properties, eg, for insertion into biological tissue, such as the brain. The probe may be formed from relatively flexible materials such as polymers, and in some cases, the probes may comprises nanoscale wires or other electronic components. The probe may be cooled to a temperature that causes the probe to harden, eg, to a temperature below a glass transition temperature, prior to insertion, to facilitate the insertion of the probe into the tissue. s", "num_citations": "2\n", "authors": ["7"]}
{"title": "ClusterMap for multi-scale clustering analysis of spatial gene expression\n", "abstract": " Quantifying RNAs in their spatial context is crucial to understanding gene expression and regulation in complex tissues. In situ transcriptomic methods generate spatially resolved RNA profiles in intact tissues. However, there is a lack of a unified computational framework for integrative analysis of in situ transcriptomic data. Here, we introduce an unsupervised and annotation-free framework, termed ClusterMap, which incorporates the physical location and gene identity of RNAs, formulates the task as a point pattern analysis problem, and identifies biologically meaningful structures by density peak clustering (DPC). Specifically, ClusterMap precisely clusters RNAs into subcellular structures, cell bodies, and tissue regions in both two-and three-dimensional space, and performs consistently on diverse tissue types, including mouse brain, placenta, gut, and human cardiac organoids. We demonstrate ClusterMap to be┬áΓÇª", "num_citations": "1\n", "authors": ["7"]}
{"title": "A method for three-dimensional single-cell chronic electrophysiology from developing brain organoids\n", "abstract": " Human induced pluripotent stem cell-derived brain organoids have shown great potential for studies of human brain development and neurological disorders. However, quantifying the evolution and development of electrical functions in brain organoids is currently limited by measurement techniques that cannot provide long-term stable three-dimensional (3D) bioelectrical interfaces with brain organoids during development. Here, we report a cyborg brain organoid platform, in which 2D progenitor or stem cell sheets can fold \"tissue-like\" stretchable mesh nanoelectronics through organogenesis, distributing stretchable electrode arrays across 3D organoids. The tissue-wide integrated stretchable electrode arrays show no interruption to neuronal differentiation, adapt to the volume and morphological changes during organogenesis, and provide long-term stable electrical contacts with neurons within brain organoids during development. The seamless and non-invasive coupling of electrodes to neurons enables a 6-month continuous recording of the same brain organoids and captures the emergence of single-cell action potentials from early-stage brain organoid development.", "num_citations": "1\n", "authors": ["7"]}
{"title": "Scaffolds comprising nanoelectronic components for cells, tissues, and other applications\n", "abstract": " Page 2 wires may form an integral part of cells or tissues grown from the cell scaffold, and can even be determined or controlled, e. g., using various electronic circuits. This approach allows for the creation of fundamentally new types of functionalized cells and tissues, due to the high degree of electronic control offered by the nanoscale wires and elec tronic circuits. Accordingly, such cell scaffolds can be used to grow cells or tissues which can be determined and/or controlled at very high resolutions, due to the presence of the nanoscale wires, and such cell scaffolds will find use in a wide variety of novel applications, including applications in tissue engineering, prosthetics, pacemakers, implants, or the like.", "num_citations": "1\n", "authors": ["7"]}
{"title": "Three-Dimensional Macroporous Nanoelectronics Scaffold Innervated Synthetic Tissue\n", "abstract": " Functional synthetic 3D macroporous biomaterials as extracellular matrices (ECMs) are crucial for areas ranging from biophysics to regenerative medicine because they allow for studies of cell/tissue development in the presence of spatiotemporal biochemical stimulants [1ΓÇô6], and the understanding of pharmacological response of cells within synthetic tissues models is expected to provide a more robust link to in vivo disease treatment than that from 2D cell cultures [6].", "num_citations": "1\n", "authors": ["7"]}