{"title": "Adaptive learning ant colony optimization for web spam detection\n", "abstract": " Web spamming is nowadays a serious problem for search engines. It not only degrades the quality of search results by intentionally boosting undesirable web pages to users, but also causes the search engine to waste a significant amount of computational and storage resources in manipulating useless information. In this paper, we present a machine learning approach for spam detection by adopting the ant colony optimization algorithm. We first construct a directed graph corresponding to web hosts and their aggregated hyperlinks. Then, we train a classifier by employing ants to walk along paths in the graph. Each ant will start from an individual non-spam host and afterwards decides to follow a link to the next host with a probability based on both heuristic function and pheromone trail. Relying on the approximate isolation principle of a good set, we reward an ant that can discover a good path, i.e., a …", "num_citations": "2\n", "authors": ["1257"]}
{"title": "Towards a More Reliable Interpretation of Defect Models\n", "abstract": " Software Quality Assurance (SQA) activities are exercised to ensure high-quality software systems. Defect models help developers identify the most risky modules to prioritise their limited SQA resources. The interpretation of defect models also helps managers understand what factors impact software quality to chart quality improvement plans. Unfortunately, the commonly-used interpretation techniques (e.g., ANOVA for logistic regression and variable importance for random forests) only explain defect models at the high level (e.g., what factors impact software quality). Researchers and practitioners also raise concerns about a lack of explainability of defect models that hinders the adoption in practice. This thesis hypothesises that: A lack of explainability poses a critical challenge when adopting defect models in practice. To validate the hypothesis, we formulate 3 research questions, i.e., (1) what is the best defect …", "num_citations": "1\n", "authors": ["1257"]}