{"title": "CasADi: a software framework for nonlinear optimization and optimal control\n", "abstract": " We present CasADi, an open-source software framework for numerical optimization. CasADi is a general-purpose tool that can be used to model and solve optimization problems with a large degree of flexibility, larger than what is associated with popular algebraic modeling languages such as AMPL, GAMS, JuMP or Pyomo. Of special interest are problems constrained by differential equations, i.e. optimal control problems. CasADi is written in self-contained C++, but is most conveniently used via full-featured interfaces to Python, MATLAB or Octave. Since its inception in late 2009, it has been used successfully for academic teaching as well as in applications from multiple fields, including process control, robotics and aerospace. This article gives an up-to-date and accessible introduction to the CasADi framework, which has undergone numerous design improvements over the last 7 years.", "num_citations": "1072\n", "authors": ["908"]}
{"title": "CasADi: A Symbolic Package for Automatic Differentiation and Optimal Control\n", "abstract": " We present CasADi, a free, open-source software tool for fast, yet efficient solution of nonlinear optimization problems in general and dynamic optimization problems in particular. To the developer of algorithms for numerical optimization and to the advanced user of such algorithms, it offers a level of abstraction which is notably lower, and hence more flexible, than that of algebraic modeling languages such as AMPL or GAMS, but higher than working with a conventional automatic differentiation (AD) tool.CasADi is best described as a minimalistic computer algebra system (CAS) implementing automatic differentiation in eight different flavors. Similar to algebraic modeling languages, it includes high-level interfaces to state-of-the-art numerical codes for nonlinear programming, quadratic programming and integration of differential-algebraic equations. CasADi is implemented in self-contained C++ code and …", "num_citations": "360\n", "authors": ["908"]}
{"title": "Handling uncertainty in economic nonlinear model predictive control: A comparative case study\n", "abstract": " In the last years, the use of an economic cost function for model predictive control (MPC) has been widely discussed in the literature. The main motivation for this choice is that often the real goal of control is to maximize the profit or the efficiency of a certain system, rather than tracking a predefined set-point as done in the typical MPC approaches, which can be even counter-productive. Since the economic optimal operation of a system resulting from the application of an economic model predictive control approach drives the system to the constraints, the explicit consideration of the uncertainties becomes crucial in order to avoid constraint violations. Although robust MPC has been studied during the past years, little attention has yet been devoted to this topic in the context of economic nonlinear model predictive control, especially when analyzing the performance of the different MPC approaches. In this work, we …", "num_citations": "151\n", "authors": ["908"]}
{"title": "A fast and accurate solver for the general rate model of column liquid chromatography\n", "abstract": " Practical application of the general rate model is often hindered by computational complexity and by unknown parameter values. Model simplifications and parameter correlations are not always applicable, and repeated model solutions are required for parameter estimation and process optimization. We have hence developed and implemented a fast and accurate solver for the general rate model with various adsorption isotherms.Several state of the art scientific computing techniques have been combined for maximal solver performance: (1) the model equations are spatially discretized with finite volumes and the weighted essentially non-oscillatory (WENO) method. (2) A non-commercial solver with variable stepwidth and order is applied for time integration. (3) The internal linear solver module is replaced by customized code that is based on domain decomposition and can be executed on parallel computers.We …", "num_citations": "108\n", "authors": ["908"]}
{"title": "Airborne wind energy based on dual airfoils\n", "abstract": " The airborne wind energy (AWE) paradigm proposes to generate energy by flying a tethered airfoil across the wind flow at a high velocity. Although AWE enables flight in higher altitude and stronger wind layers, the extra drag generated by the tether motion imposes a significant limit to the overall system efficiency. To address this issue, two airfoils with a shared tether can reduce overall system drag. Although this technique may improve the efficiency of AWE systems, such improvement can only be achieved through properly balancing the system trajectories and parameters. This brief tackles that problem using optimal control. A generic procedure for modeling multiple-airfoil systems with equations of minimal complexity is proposed. A parametric study shows that at small and medium scales, dual-airfoil systems are significantly more efficient than single-airfoil systems, but they are less advantageous at very large …", "num_citations": "55\n", "authors": ["908"]}
{"title": "Integration of CasADi and JModelica. org\n", "abstract": " This paper presents the integration of two open source softwares: CasADi, which is a framework for efficient evaluation of expressions and their derivatives, and the Modelica-based platform JModelica. org. The integration of the tools is based on an XML format for exchange of DAE models. The JModelica. org platform supports export of models in this XML format, wheras CasADi supports import of models expressed in this format. Furthermore, we have carried out comparisons with ACADO, which is a multiple shooting package for solving optimal control problems. CasADi, in turn, has been interfaced with ACADO Toolkit, enabling users to define optimal control problems using Modelica and Optimica specifications, and use solve using direct multiple shooting. In addition, a collocation algorithm targeted at solving largescale DAE constrained dynamic optimization problems has been implemented. This implementation explores CasADi’s Python and IPOPT interfaces, which offer a convenient, yet highly efficient environment for development of optimization algorithms. The algorithms are evaluated using industrially relevant benchmark problems.", "num_citations": "50\n", "authors": ["908"]}
{"title": "Dynamic optimization with CasADi\n", "abstract": " We demonstrate how CasADi, a recently developed, free, open-source, general purpose software tool for nonlinear optimization, can be used for dynamic optimization in a flexible, interactive and numerically efficient way. CasADi is best described as a minimalistic computer algebra system (CAS) implementing automatic differentiation (AD) in eight different flavors. Similar to algebraic modeling languages like AMPL or GAMS, it includes high-level interfaces to state-of-the-art numerical codes for nonlinear programming, quadratic programming and integration of differentialalgebraic equations. CasADi is implemented in self-contained C++ code and contains full-featured front-ends to Python and Octave for rapid prototyping. In this paper, we discuss CasADi from the perspective of the developer or advanced user of algorithms for dynamic optimization for the first time, leaving out details on the implementation of the …", "num_citations": "41\n", "authors": ["908"]}
{"title": "Efficient robust economic nonlinear model predictive control of an industrial batch reactor\n", "abstract": " In this paper we present a systematic and efficient approach to deal with uncertainty in Nonlinear Model Predictive Control (NMPC). The main idea of the approach is to represent the NMPC setting as a real-time decision problem under uncertainty that is formulated as a multi-stage stochastic problem with recourse, based on a description of the uncertainty by a scenario tree. This formulation explicitly takes into account the fact that new information will be available in the future and thus reduces the conservativeness compared to open-loop worst-case approaches. We show that the proposed multistage NMPC formulation can deal with significant plant-model mismatch as it is usually encountered in the process industry and still satisfies tight constraints for the different values of the uncertain parameters, in contrast to standard NMPC. The use of an economic cost function leads to a superior performance compared to …", "num_citations": "25\n", "authors": ["908"]}
{"title": "Towards a computer algebra system with automatic differentiation for use with object-oriented modelling languages\n", "abstract": " The Directed Acyclic Graph (DAG), which can be generated by object oriented modelling languages, is often the most natural way of representing and manipulating a dynamic optimization problem. With this representation, it is possible to step-by-step reformulate an (infinite dimensional) dynamic optimization problem into a (finite dimensional) non-linear program (NLP) by parametrizing the state and control trajectories.We introduce CasADi, a minimalistic computer algebra system written in completely self-contained C++. The aim of the tool is to offer the benifits of a computer algebra to developers of C++ code, without the overhead usually associated with such systems. In particular, we use the tool to implement automatic differentiation, AD. For maximum efficiency, CasADi works with two different graph representations interchangeably: One supporting only scalar-valued, built-in unary and binary operations and no branching, similar to the representation used by today’s tools for automatic differentiation by operator overloading. Secondly, a representation supporting matrixvalued operations, branchings such as if-statements as well as function calls to arbitrary functions (eg ODE/DAE integrators).", "num_citations": "23\n", "authors": ["908"]}
{"title": "A framework for nonlinear model-predictive control using object-oriented modeling with a case study in power plant start-up\n", "abstract": " In t his paper, nonlinear model predictive control (NMPC) is applied to the start-up of a combined-cycle power plant. An object-oriented first-principle model library expressed in the high-level language Modelica has been written for the plant and used to set up the simulation and optimization models. The NMPC optimization problems are both encoded, using a high-level notation, and solved in the open-source framework JModelica.org. The results demonstrate the effectiveness of the framework and its high-level description. It bridges the gap between an intuitive physical modeling format and state of the art numerical optimization algorithms. Promising closed-loop control results are shown for plant start-up when the NMPC model contains parametric errors and the simulation model, corresponding to the real plant, is subject to disturbances.", "num_citations": "16\n", "authors": ["908"]}
{"title": "Optimization of the Mass Flow Rate Distribution of an Open Volumetric Air Receiver\n", "abstract": " The thermodynamical efficiency of a solar power tower power plant with an open volumetric air receiver depends among others on the operational strategy of the receiver. This strategy includes, on the one hand, controlling the distribution of irradiated power on the receiver surface via aim point optimization, and on the other hand, controlling the air mass flow rate and its distribution by choosing suitable dimensions of fixed orifices and controlling air flaps. The maximum mass flow rate of the receiver as an indication of the thermal power is commonly used as a quality function when assessing new component designs, comparing different operational strategies, or evaluating the role of aim point optimization for the open volumetric air receiver technology. In this paper, a method is presented to maximize the mass flow rate of the receiver using given technical capabilities of the receiver technology like orifices and air …", "num_citations": "14\n", "authors": ["908"]}
{"title": "Model-Based Dynamic Optimization with OpenModelica and CasADi\n", "abstract": " This paper demonstrates model-based dynamic optimization through the coupling of two open source tools: OpenModelica, which is a Modelica-based modeling and simulation platform, and CasADi, a framework for numerical optimization. The coupling uses a standardized XML format for exchange of differential-algebraic equations (DAE) models. OpenModelica supports export of models written in Modelica and the optimization language extension using this XML format, while CasADi supports import of models represented in this format. This allows users to define optimal control problems (OCP) using Modelica and optimization language specification, and solve the underlying model formulation using a range of optimization methods, including direct collocation and direct multiple shooting. The proposed solution has been tested on several industrially relevant optimal control problems, including a diesel-electric …", "num_citations": "13\n", "authors": ["908"]}
{"title": "A condensing algorithm for nonlinear MPC with a quadratic runtime in horizon length\n", "abstract": " A large number of practical algorithms for Optimal Control Problems (OCP) relies on a so-called condensing procedure to exploit the given structure in the quadratic programming (QP) subproblems. While the established structure-exploiting condensing algorithm is of cubic complexity in the horizon length, in this technical note we propose a novel algorithm that is only of quadratic complexity in horizon length. We present numerical results confirming that the proposed algorithm is faster in practice and discuss implications for related QP solution algorithms that rely on the elimination of the state sequence.", "num_citations": "12\n", "authors": ["908"]}
{"title": "Distributed multiple shooting for optimal control of large interconnected systems\n", "abstract": " Large interconnected systems consist of a multitude of subsystems with their own dynamics, but coupled with each other via input-output connections. Each subsystem is typically modelled by ordinary differential equations or differential-algebraic equations. Simulation and optimal control of such systems pose a challenge both with respect to CPU time and memory requirements. We address optimal control of such systems by applying “distributed multiple shooting”, a generalization of the direct multiple shooting method, which uses the decomposable structure of the system in order to obtain a highly parallel algorithm. The interconnections are allowed to be infeasible during the iterations but are driven to feasibility by a Newtontype optimization algorithm. We evaluate the performance of the distributed multiple shooting method on a large scale estimation problem.", "num_citations": "10\n", "authors": ["908"]}
{"title": "Optimized operation of an open volumetric air receiver\n", "abstract": " Solar thermal power towers are a promising option for a renewable electricity generation and first power plants using this technology have now started operation. For the receiver, the use of open volumetric air receivers is one possibility [1, 2, and 3]. This technology uses ambient air, which is sucked through the hot absorber structures irradiated by the heliostat field. The resulting hot air stream can be utilized in a regular steam generator and finally converted to electricity in the power block. Additionally, the power plant can be equipped with a storage system to improve the performance.During operation, the receiver air outlet temperature is set by demands of the steam generator or the storage system. There are two possibilities left to manipulate the receiver performance. The first is to adjust the aim points of the heliostats resulting in a desired flux density distribution. As the receiver is normally divided into subreceiver equipped with air flaps, the second option is to manipulate the mass flow distribution over the receiver by the air flaps resulting in an adequate temperature profile. The goal of the optimization is, given a desired air outlet temperature, to find a mixture of air streams from each of the subreceivers resulting in the highest combined mass flow rate, while satisfying constraints such as upper and lower bounds on the mass flows as well as on the temperatures for subreceivers.", "num_citations": "9\n", "authors": ["908"]}
{"title": "vICERP–The virtual Institute of Central Receiver Power Plants: Modeling and Simulation of an Open Volumetric Air Receiver Power Plant\n", "abstract": " The virtual Institute of Central Receiver Power Plants (vICERP) was founded in the beginning of 2008. It is a research network consisting of five research centers. The institute vICERP works in the field of solar thermal energy using central receiver power plant systems (CRS) with the emphasis on the open volumetric air receiver technology. This technology is now being realized in the research and demonstration power plant in Jülich, Germany. The focus of the work is on modeling and simulation of the dynamic system behavior as well as the development of an optimized control and operation strategy.", "num_citations": "6\n", "authors": ["908"]}
{"title": "Adjoint-based distributed multiple shooting for large-scale systems\n", "abstract": " Distributed multiple shooting is a modification of the standard multiple shooting method which takes into account the structure of certain large-scale systems in order to obtain a better controller design flexibility and high parallelizability. The aim of this paper is to extend the framework where distributed multiple shooting can be deployed and to propose a new solution method based on adjoint-based sequential quadratic programming. A numerical experiment shows that this can lead to considerable savings in computational time for the sensitivity generation.", "num_citations": "5\n", "authors": ["908"]}
{"title": "Simulation and Control of Solar Thermal Power Plants\n", "abstract": " In this paper, first the overall modeling approach for an optimized control of a hot-gas cycle for solar thermal power plants in the Modelica language is pointed out. The emphasis of the modeling work lies on the development of dynamic component models to be used in control systems. Depending on the control task, the discretization of the models has to be adapted. Main components of the hot-gas cycle are the solar thermal receiver and the storage system. The steam cycle is preliminarily only included as heat sink.Second, for control purposes a linear model-based controller (MPC) was implemented in Modelica based on an external state-of-the-art QP solver [2] linked to the Modelica model. The performance of the MPC is compared with a basic automation scheme based on classical PID controllers.", "num_citations": "5\n", "authors": ["908"]}
{"title": "viCERP-the Virtual Institute of Central Receiver Power Plant\n", "abstract": " OPUS 4 | viCERP - the Virtual Institute of Central Receiver Power Plant Deutsch Login Open Access Home Search Browse Administration FAQ viCERP - the Virtual Institute of Central Receiver Power Plant N. Ahlbrink, Spiros Alexopoulos, J. Andersson, B. Belhomme, Cristiano Teixeira Boura, J. Gall, T. Hirsch Export metadata BibTeX RIS Additional Services Share in Twitter Search Google Scholar Metadaten Author: N. Ahlbrink, Spiros Alexopoulos, J. Andersson, B. Belhomme, Cristiano Teixeira Boura, J. Gall, T. Hirsch ISBN: 978-3-901608-35-3 Parent Title (English): MATHMOD 2009 - 6th Vienna International Conference on Mathematical Modelling : February 11 - 13, 2009, Vienna, Austria. ARGESIM Report. No. 35 Publisher: Elsevier Place of publication: Amsterdam Document Type: Conference Proceeding Language: English Year of Completion: 2009 Date of the Publication (Server): 2013/08/23 Institutes: FH …", "num_citations": "2\n", "authors": ["908"]}
{"title": "Optimized Control of Hot-Gas Cycle for Solar Thermal Power Plants\n", "abstract": " In this paper, the overall modeling approach for an optimized control of a hot-gas cycle with its different components for solar thermal power plants is pointed out.", "num_citations": "2\n", "authors": ["908"]}
{"title": "Tool Demonstration Abstract: OpenModelica and CasADi for Model-Based Dynamic Optimization\n", "abstract": " This paper demonstrates model-based dynamic optimization through the coupling of two open source tools: OpenModelica, which is a Modelica-based modeling and simulation platform, and CasADi, a framework for numerical optimization. The coupling uses a standardized XML format for exchange of differentialalgebraic equations (DAE) models. OpenModelica supports export of models written in Modelica and the Optimica language extension using this XML format, while CasADi supports import of models represented in this format. This allows users to define optimal control problems (OCP) using Modelica and Optimica specifications, and solve the underlying model formulation using a range of optimization methods, including direct collocation and direct multiple shooting. The proposed solution has been tested on several industrially relevant optimal control problems, including a diesel-electric power train, a free-floating robot, and a stirred-tank.", "num_citations": "1\n", "authors": ["908"]}