{"title": "Dissipation of stop-and-go waves via control of autonomous vehicles: Field experiments\n", "abstract": " Traffic waves are phenomena that emerge when the vehicular density exceeds a critical threshold. Considering the presence of increasingly automated vehicles in the traffic stream, a number of research activities have focused on the influence of automated vehicles on the bulk traffic flow. In the present article, we demonstrate experimentally that intelligent control of an autonomous vehicle is able to dampen stop-and-go waves that can arise even in the absence of geometric or lane changing triggers. Precisely, our experiments on a circular track with more than 20 vehicles show that traffic waves emerge consistently, and that they can be dampened by controlling the velocity of a single vehicle in the flow. We compare metrics for velocity, braking events, and fuel economy across experiments. These experimental findings suggest a paradigm shift in traffic management: flow control will be possible via a few mobile …", "num_citations": "380\n", "authors": ["1396"]}
{"title": "Domain-Specific Modeling.\n", "abstract": " Since the inception of the software industry, modeling tools have been a core product offered by commercial vendors. In fact, the first software product sold independently of a hardware package was Autoflow, which was a flowchart modeling tool developed in 1964 by Martin Goetz of Applied Data Research (Johnson 1998). Although modeling tools have historical relevance in terms of offering productivity benefits, there are a few limitations that have narrowed their potential.", "num_citations": "172\n", "authors": ["1396"]}
{"title": "Information Technology for Assisted Living at Home: building a wireless infrastructure for assisted living\n", "abstract": " A heterogeneous wireless network to support a home health system is presented. This system integrates a set of smart sensors which are designed to provide health and security to the elder citizen living at home. The system facilitates privacy by performing local computation, it supports heterogeneous devices and it provides a platform and initial architecture for exploring the use of sensors with elderly people in the Information Technology for Assisted Living and Home project. The goal of this project is to provide alerts to care givers in the event of an accident or acute illness, and enable remote monitoring by authorized and authenticated care givers", "num_citations": "107\n", "authors": ["1396"]}
{"title": "Using smart sensors and a camera phone to detect and verify the fall of elderly persons\n", "abstract": " In this paper we present a fall detection system for elderly people. The core of the system is an intelligent sensor consisting of three accelerometers and a processor capable of analysing incoming data in real time and classifying motions events such as falls or other normal and abnormal events. The sensor is able to communicate these findings to nearby camera phones or PCs through Bluetooth for further processing. We have used the system to collect data of falls and nonfalls which we have used to evaluate different algorithms.", "num_citations": "100\n", "authors": ["1396"]}
{"title": "Reachability calculations for automated aerial refueling\n", "abstract": " This paper describes Hamilton-Jacobi (HJ) reachability calculations for a hybrid systems formalism governing unmanned aerial vehicles (UAVs) interacting with another vehicle in a safety-critical situation. We use this problem to lay the foundations toward the goal of refining or designing protocols for multi-UAV and/or manned vehicle interaction. We describe here what mathematical foundations are necessary to formulate verification problems on reachability and safety of flight maneuvers. We finally show how this formalism can be used in the chosen application to inform UAV decisions on avoiding unsafe scenarios while achieving mission objectives.", "num_citations": "75\n", "authors": ["1396"]}
{"title": "Encoding aerial pursuit/evasion games with fixed wing aircraft into a nonlinear model predictive tracking controller\n", "abstract": " Unmanned aerial vehicles (UAVs) have shown themselves to be highly capable in intelligence gathering, as well as a possible future deployment platform for munitions. Currently UAVs are supervised or piloted remotely, meaning that their behavior is not autonomous throughout the flight. For uncontested missions this is a viable method; however, if confronted by an adversary, UAVs may be required to execute maneuvers faster than a remote pilot could perform them in order to evade being targeted. In this paper we give a description of a nonlinear model predictive controller in which evasive maneuvers in three dimensions are encoded for a fixed wing UAV for the purposes of this pursuit/evasion game.", "num_citations": "73\n", "authors": ["1396"]}
{"title": "Are commercially implemented adaptive cruise control systems string stable?\n", "abstract": " In this article, we assess the string stability of seven 2018 model year adaptive cruise control (ACC) equipped vehicles that are widely available in the US market. Seven distinct vehicle models from two different vehicle makes are analyzed using data collected from more than 1,200 miles of driving in car-following experiments with ACC engaged by the follower vehicle. The resulting dataset is used to identify the parameters of a linear second order delay differential equation model that approximates the behavior of the black box ACC systems. The string stability of the data-fitted model associated with each vehicle is assessed, and the main finding is that all seven vehicle models have string unstable ACC systems. For one commonly available vehicle model that offers ACC as a standard feature on all trim levels, we validate the string stability finding with a multi-vehicle homogeneous platoon experiment in which all …", "num_citations": "68\n", "authors": ["1396"]}
{"title": "Implementing and testing a nonlinear model predictive tracking controller for aerial pursuit/evasion games on a fixed wing aircraft\n", "abstract": " Flight test and simulation results are presented for a nonlinear model predictive tracking controller (NMPC) used in pursuit and evasion maneuvers in three dimensions on a fixed wing unmanned aerial vehicle (UAV) for the purposes of pursuit/evasion games (PEGs) against a piloted F-15 aircraft. These controllers are shown to be effective for both asymmetric and symmetric PEGs. While the capability of UAVs to perform autonomously has not yet been demonstrated, this is an important step to enable at least limited autonomy in such aircraft to operate with temporary loss of remote control, or when confronted with an adversary or obstacles for which remote control is insufficient. Such capabilities have been under development in the software enabled control (SEC) program and were recently tested in the capstone demonstration of that program.", "num_citations": "64\n", "authors": ["1396"]}
{"title": "Quantifying air quality benefits resulting from few autonomous vehicles stabilizing traffic\n", "abstract": " It is anticipated that in the near future, the penetration rate of vehicles with some autonomous capabilities (eg, adaptive cruise control, lane following, full automation, etc.) will increase on roadways. This work investigates the potential reduction of vehicular emissions caused by the whole traffic stream, when a small number of autonomous vehicles (eg, 5% of the vehicle fleet) are designed to stabilize the traffic flow and dampen stop-and-go waves. To demonstrate this, vehicle velocity and acceleration data are collected from a series of field experiments that use a single autonomous-capable vehicle to dampen traffic waves on a circular ring road with 20–21 human-piloted vehicles. From the experimental data, vehicle emissions (hydrocarbons, carbon monoxide, carbon dioxide, and nitrogen oxides) are estimated using the MOVES emissions model. This work finds that vehicle emissions of the entire fleet may be …", "num_citations": "49\n", "authors": ["1396"]}
{"title": "Switched and symmetric pursuit/evasion games using online model predictive control with application to autonomous aircraft\n", "abstract": " This paper describes a supervisory controller for pursuit and evasion of two fixed-wing autonomous aircraft. Novel contributions of the work include the real-time use of model-predictive control, specifically nonlinear model predictive tracking control, for predictions of the vehicle under control, as well as predictions for the adversarial aircraft. In addition to this inclusion, the evasive controller is a hybrid system, providing switching criteria to change modes to become a pursuer based on the current and future state of the vehicle under control, and that of the adversarial aircraft. Results of the controller for equally matched platforms in actual flight tests against a US Air Force trained F-15 test pilot are given. Extensive simulation analysis of the symmetric games is provided, including regressive analysis based on initial conditions of height advantage, and relative velocity vectors, and in particular the effect of allowing the …", "num_citations": "48\n", "authors": ["1396"]}
{"title": "A generic in-place transformation-based approach to structured model co-evolution\n", "abstract": " In MDE not only models but also metamodels are subject to evolution. More specifically, they need to be adapted to correct errors, support new and/or update language features. The direct consequence of such evolutionary steps comprises the problem of managing the co-evolution of existing model instances, which may no longer conform to the new metamodel version. This model migration is intrinsically complex and results in a time-consuming and error-prone process if no adequate support is provided. For tackling this problem, we introduce a new technique to guide the user in solving migration issues in a step-wise manner. The aims are manifold, notably the simplification of the migration specification, the reduction of the effort for the evolver, the control of user intervention, and the optimization of the migration execution itself by allowing in-place adaptation of the existing instances.", "num_citations": "41\n", "authors": ["1396"]}
{"title": "Model-integrated computing\n", "abstract": " The integration of design tools and an executable system is an important step in software engineering's evolution. Model-integrated computing (MIC) through the use of domain specific modeling environments (DSMEs) is an emerging approach to computer programming. By providing a customized level of abstraction in a relatively short period of time, and leveraging existing domain knowledge by creating the language specifically for a domain expert, DSMEs are a logical progression of system design technology. MIC is the technology that turns a design tool into an executable system. DSMEs should be used only when they fit the profile required by the domain. A domain with a manageable set of components with well-understood behaviors is an excellent candidate for a DSME, as the final computer system can be generated from the model of the system. Once the domain is identified, then it is possible to use …", "num_citations": "41\n", "authors": ["1396"]}
{"title": "9 Model Evolution and Management\n", "abstract": " As complex software and systems development projects need models as an important planning, structuring and development technique, models now face issues resolved for software earlier: models need to be versioned, differences captured, syntactic and semantic correctness checked as early as possible, documented, presented in easily accessible forms, etc. Quality management needs to be established for models as well as their relationship to other models, to code and to requirement documents precisely clarified and tracked. Business and product requirements, product technologies as well as development tools evolve. This also means we need evolutionary technologies both for models within a language and if the language evolves also for an upgrade of the models.               This chapter discusses the state of the art in model management and evolution and sketches what is still necessary for …", "num_citations": "38\n", "authors": ["1396"]}
{"title": "Deciding to land a UAV safely in real time\n", "abstract": " The difficulty of autonomous free-flight of a fixed-wing UAV is trivial when compared to that of takeoff and landing. There is an even more marked difference when deciding whether or not a UAV can capture or recapture a certain trajectory, since the answer depends on the operating ranges of the aircraft. A common example of requiring this calculation, from a military perspective, is the determination of whether or not an aircraft can capture a landing trajectory (i.e., glideslope) from a certain initial state (velocity, position, etc.). As state dimensions increase, the time to calculate the decision grows exponentially. This paper describes how we can make this decision at flight time, and guarantee that the decision gives a safe answer before the state changes enough to invalidate the decision. We also describe how the computations should be formulated, and how the partitioning of the state-space can be done to reduce the …", "num_citations": "34\n", "authors": ["1396"]}
{"title": "The cat vehicle testbed: A simulator with hardware in the loop for autonomous vehicle applications\n", "abstract": " This paper presents the CAT Vehicle (Cognitive and Autonomous Test Vehicle) Testbed: a research testbed comprised of a distributed simulation-based autonomous vehicle, with straightforward transition to hardware in the loop testing and execution, to support research in autonomous driving technology. The evolution of autonomous driving technology from active safety features and advanced driving assistance systems to full sensor-guided autonomous driving requires testing of every possible scenario. However, researchers who want to demonstrate new results on a physical platform face difficult challenges, if they do not have access to a robotic platform in their own labs. Thus, there is a need for a research testbed where simulation-based results can be rapidly validated through hardware in the loop simulation, in order to test the software on board the physical platform. The CAT Vehicle Testbed offers such a testbed that can mimic dynamics of a real vehicle in simulation and then seamlessly transition to reproduction of use cases with hardware. The simulator utilizes the Robot Operating System (ROS) with a physics-based vehicle model, including simulated sensors and actuators with configurable parameters. The testbed allows multi-vehicle simulation to support vehicle to vehicle interaction. Our testbed also facilitates logging and capturing of the data in the real time that can be played back to examine particular scenarios or use cases, and for regression testing. As part of the demonstration of feasibility, we present a brief description of the CAT Vehicle Challenge, in which student researchers from all over the globe were able to reproduce …", "num_citations": "33\n", "authors": ["1396"]}
{"title": "Reachability calculations for vehicle safety during manned/unmanned vehicle interaction\n", "abstract": " IN MODERN autonomous flight systems, the tasks of manage-ment and control of aircraft are frequently distributed between an onboard autonomous controller and external human operators or supervisors. In safety-critical scenarios, the decision authority to perform a given flight maneuver usually rests exclusively with the human operators, and proper design of the flight control system can be used to ensure that the aircraft remains within safe operational limits during the maneuver [1]. However, if a scenario involves simultaneous control of one or more vehicles over communication delay, then it can become difficult for a human operator to foresee all safety issues, and unsafe situations may arise [2, 3]. Thus, an important consideration is how an unmanned aerial vehicle (UAV) would detect and respond to situations in which a human-operator command would place the UAV in imminent danger. For cases in which …", "num_citations": "33\n", "authors": ["1396"]}
{"title": "Model-based design: a report from the trenches of the DARPA Urban Challenge\n", "abstract": " The impact of model-based design on the software engineering community is impressive, and recent research in model transformations, and elegant behavioral specifications of systems has the potential to revolutionize the way in which systems are designed. Such techniques aim to raise the level of abstraction at which systems are specified, to remove the burden of producing application-specific programs with general-purpose programming. For complex real-time systems, however, the impact of model-driven approaches is not nearly so widespread. In this paper, we present a perspective of model-based design researchers who joined with software experts in robotics to enter the DARPA Urban Challenge, and to what extent model-based design techniques were used. Further, we speculate on why, according to our experience and the testimonies of many teams, the full promises of model-based design …", "num_citations": "30\n", "authors": ["1396"]}
{"title": "Tracking vehicle trajectories and fuel rates in phantom traffic jams: Methodology and data\n", "abstract": " The traffic experiment conducted by Sugiyama et al. (2007) has been a seminal work in transportation research. In the experiment, a group of vehicles are instructed to drive on a circular track starting with uniform spacing. The isolated experimental environment provides a safe, economic, and controlled environment to study free flow traffic and phantom traffic waves. This article introduces a novel method that automates the data collection process in such an environment. Specifically, the vehicle trajectories are measured using a 360-degree camera, and the fuel rates are recorded via on-board diagnostics (OBD-II) scanners. The video data from the 360-degree camera is then processed by an offline unsupervised computer vision algorithm. To validate the data collection method, the technique is then evaluated on a series of eight experiments. Analysis shows that the collected data are highly accurate, with a mean …", "num_citations": "27\n", "authors": ["1396"]}
{"title": "UAV search: Maximizing target acquisition\n", "abstract": " In situations where a human operator is unable to perform tactical control of an unmanned aerial vehicle (UAV), it may be necessary to have the UAV make or suggest tactical decisions. The interaction of the UAV computers with those of the human decision makers requires that choices for the human decision maker be easy to interpret and intuitive to implement or approve. This paper provides closed-form solutions to maximize detection of a slow-moving ground target by a UAV. The output of these solutions is a height at which the UAV should fly in order to maximize probability of detection, which informs the operator whether a single vehicle is sufficient. We assume that the UAV can travel faster than the ground target with some bounded speed (but no certain direction). The ground target is detected when it is inside a field of view which is a function of the state of the UAV, so the controller for motion affects whether …", "num_citations": "19\n", "authors": ["1396"]}
{"title": "Computationally aware control of autonomous vehicles: a hybrid model predictive control approach\n", "abstract": " Model predictive control (MPC) is a common approach to the control of trajectory-following systems. For nonlinear plants such as car-like robots, methods for path planning and following have the advantage of concurrently solving problems of obstacle avoidance, feasible trajectory selection, and trajectory following. A prediction function for the plant is used to simulate the trajectory with a candidate stream of inputs. Constraints on control inputs and state values, used to ensure safe trajectories and to avoid obstacles, are encoded into a cost function, and optimization routines (at runtime) compute the trajectories and their corresponding control inputs. Such approaches are computationally intensive, and in the nonlinear case the computational burden generally grows as a predictive model more closely approximates a nonlinear plant. In situations where system safety is paramount, guaranteeing model …", "num_citations": "18\n", "authors": ["1396"]}
{"title": "A hybrid model predictive controller for path planning and path following\n", "abstract": " The use of nonlinear model-predictive methods for path planning and following has the advantage of concurrently solving problems of obstacle avoidance, feasible trajectory selection, and trajectory following, while obeying constraints on control inputs and state values. However, such approaches are computationally intensive, and may not be guaranteed to return a result in bounded time when performing a non-convex optimization. This problem is an interesting application to cyber-physical systems due to their reliance on computation to carry out complex control. The computational burden can be addressed through model reduction, at a cost of potential (bounded) model error over the prediction horizon. In this paper we introduce a metric called uncontrollable divergence, and discuss how the selection of the model to use for the predictive controller can be addressed by evaluating this metric, which reveals the …", "num_citations": "16\n", "authors": ["1396"]}
{"title": "Data-driven HVAC optimization\n", "abstract": " A system and method for data-driven HVAC optimization for outputting HVAC setpoints to a thermostat and determining a predicted HVAC usage of an HVAC unit based on the HVAC setpoints and an outdoor temperature. The system may further determine and output a predicted cost of the HVAC unit heating or cooling a structure based on the HVAC setpoints. The system may further select optimized HVAC setpoints such that the predicted cost is less than or equal to a user defined cost constraint and minimize deviation from user-preferred HVAC setpoints.", "num_citations": "15\n", "authors": ["1396"]}
{"title": "A data-driven linear approximation of HVAC utilization for predictive control and optimization\n", "abstract": " Home energy made up nearly 25% of all energy consumed in the United States in 2010, and 31% of this energy is estimated to come from home heating, ventilation, and air conditioning systems. Yet, the inputs available to a homeowner for those systems are not easily correlated to the energy consequences, making it difficult (if not impossible) for a homeowner to choose set points to meet a budget each month. This brief presents a novel management framework targeted toward end users, which incorporates a light-weight data-driven prediction component to dynamically learn the data relationships of the underlying system and estimate its future behavior within a given time horizon. Traditional prediction methods to close the loop require a state update function, but such an approach would require installation of additional sensors, and frequent modification of the optimization functions as parameters to these state …", "num_citations": "15\n", "authors": ["1396"]}
{"title": "Motorized mobility scooters: The use of training/intervention and technology for improving driving skills in aging adults-a mini-review\n", "abstract": " Background: Motorized mobility scooters (MMS) have become the most acceptable powered assistive device for those with impaired mobility, who have sufficient upper body strength and dexterity, and postural stability. Although several benefits have been attributed to MMS usage, there are likewise risks of use, including injuries and even deaths. Objective: The aim of the current review was to summarize results from clinical studies regarding the enhancement of MMS driver safety with a primary focus on improving driving skills/performance using clinical approaches. We addressed three main objectives:(1) to identify and summarize any available evidence (strong, moderate, or weak evidence based on the quality of studies) regarding improved driving skills/performance following training/intervention;(2) to identify types of driving skills/performance that might be improved by training/intervention, and (3) to identify …", "num_citations": "15\n", "authors": ["1396"]}
{"title": "Online safety calculations for glide-slope recapture\n", "abstract": " As unmanned aerial vehicles (UAVs) increase in popularity and usage, an appropriate increase in confidence in their behavior is expected. This research addresses a particular portion of the flight of an aircraft (whether autonomous, unmanned, or manned): specifically, the recapture of the glide slope after a wave-off maneuver during landing. While this situation is rare in commercial aircraft, its applicability toward unmanned aircraft has been limited due to the complexity of the calculations of safety of the maneuvers. In this paper, we present several control laws for this glide-slope recapture, and inferences into their convergence to the glide slope, as well as reachability calculations which show their guaranteed safety. We also present a methodology which theoretically allows us to apply these offline-computed safety data to all kinds of unmanned fixed-wing aerial vehicles while online, permitting the use of …", "num_citations": "15\n", "authors": ["1396"]}
{"title": "A passenger comfort controller for an autonomous ground vehicle\n", "abstract": " Trajectory-following controllers for autonomous ground vehicles must carefully consider the possibility of vehicle instability. Previous approaches have provided a reference velocity along with a trajectory to follow, and a supervisory controller selects low velocity if turns are anticipated. However, such an approach is not robust across different vehicle platforms, and does not take into account passenger comfort. This paper provides a controller and design methodology to couple an existing trajectory controller with a speed limiting controller, where the speed-limiting controller is created based on user driving data. The result is a controller that can be optimized using a set of linearized controllers, and which is also demonstrated to remain below the velocity/turnrate thresholds established by human drivers: a conservative approximation for stability thresholds to prevent rollovers and skidding. Analysis is performed on …", "num_citations": "14\n", "authors": ["1396"]}
{"title": "Automated software generation and hardware coprocessor synthesis for data-adaptable reconfigurable systems\n", "abstract": " We present an overview of a data-adaptable reconfigurable embedded systems design methodology. The paper presents a novel paradigm for hardware/software code sign and reconfigurable computing driven by data-adaptability. The data-adaptable approach allows designers to directly model the data configurability of the target application, thereby enabling a solution that permits dynamic reconfiguration based on the data profile of the incoming data stream. This approach permits low-power, small form-factor hardware implementations of algorithms that might otherwise consume significant resources, or perhaps exceed the available space of the reconfigurable hardware.", "num_citations": "14\n", "authors": ["1396"]}
{"title": "Feedback control algorithms for the dissipation of traffic waves with autonomous vehicles\n", "abstract": " This article considers the problem of traffic control in which an autonomous vehicle is used to regulate human-piloted traffic to dissipate stop-and-go traffic waves. We first investigated the controllability of well-known microscopic traffic flow models, namely, (i) the Bando model (also known as the optimal velocity model), (ii) the follow-the-leader model, and (iii) a combined optimal velocity follow-the-leader model. Based on the controllability results, we proposed three control strategies for an autonomous vehicle to stabilize the other, human-piloted traffics. We subsequently simulate the control effects on the microscopic models of human drivers in numerical experiments to quantify the potential benefits of the controllers. Based on the simulations, finally, we conduct a field experiment with 22 human drivers and a fully autonomous-capable vehicle, to assess the feasibility of autonomous vehicle-based traffic …", "num_citations": "13\n", "authors": ["1396"]}
{"title": "Automatic control of vtol micro air vehicle during transition maneuver\n", "abstract": " Development of automatic controls for micro air vehicles (MAVs) with vertical take-off and landing (VTOL) capabilities presents a challenging research and engineering problem. The development of such vehicles has been discussed in the literature1-3. The ability of autopilots to robustly control VTOL MAVs has not been wellestablished. Autopilot improvement is vital to the progress of VTOL MAV technology. Design methodology and general theoretical control principles for large VTOL aircraft are well-developed and have been summarized in the literature4, 5. There is a sufficient amount of relevant data and knowledge to begin exploring autonomous flight concepts with applications to VTOL MAVs. Available off-the-shelf autopilots and micro-avionics components (especially micro-sensors) are expensive, relatively heavy, and of poor quality. Industrial developments, being generally proprietary, do not disseminate …", "num_citations": "13\n", "authors": ["1396"]}
{"title": "Modeling of data adaptable reconfigurable embedded systems\n", "abstract": " Many applications require high flexibility, high configurability and high processing speeds. The physical constraints of a highly flexible system's hardware implementation preclude a hardware solution that satisfies all configuration options. Similarly for pure software implementations, even if configurability is satisfied, process efficiency will be sacrificed. Thus for applications of any significant size, there can be no single hardware or software configuration that can efficiently support all the configurability options of the applications. The Data-Adaptable Reconfigurable Embedded System (DARES) approach tackles this problem through combination of the hardware-software co-design and reconfigurable computing methodologies. Data-adaptability means that as data streams change, the system is reconfigured along the baselines defined within the system's specifications. In this project we use the concepts of Model …", "num_citations": "12\n", "authors": ["1396"]}
{"title": "A safe autonomous vehicle trajectory domain specific modeling language for non-expert development\n", "abstract": " Managing complexity while ensuring safely designed behaviors is important for cyber-physical systems as they are continually intro-duced to consumers, such as autonomous vehicles. Safety consid-erations are important as programming interfaces become open to experts and non experts of varying degrees. Autonomous vehicles are an example system where many domain experts must collab-orate together to ensure safe operation. Through the use of higher level abstraction, domain experts may provide verification tools to check dynamic behavioral constraints. Similarly, higher level mod-eling tools may generate lower level artifacts for a working system. With modeling and verification tools, smaller teams and potentially non-experts may program custom behaviors while ensuring a cor-rectly behaved system. A high level domain specific modeling language was created with a focus on non-domain experts. The …", "num_citations": "11\n", "authors": ["1396"]}
{"title": "Analysis of a metamodel to estimate complexity of using a domain-specific language\n", "abstract": " This paper considers the complexity of building models by analyzing the structure of the metamodel that defines a domain-specific modeling language. An algorithm is presented that generates a state model to produce at least one instance of every model in the metamodel, and the complexity of that state model provides insight into the complexity of the modeling language.", "num_citations": "11\n", "authors": ["1396"]}
{"title": "Simulator development for transition flight dynamics of a vtol mav\n", "abstract": " This paper presents the simulation and validation of models for transition between forward flight and hover for a micro air vehicle (MAV). A dynamical simulation environment is developed, based on measured aerodynamic properties of a fixed-wing tail-sitter MAV with vertical take-off and landing (VTOL) capabilities. The simulator is validated against recorded flight data of transition from forward flight to hover using the physical platform. Specifically, the flight transition maneuver in the vertical plane (vertical-to-horizontal and horizontal-to-vertical) is studied in detail. The development and evaluation of a VTOL MAV called Mini-Vertigo 2 (MV2) is presented. A non-linear longitudinal dynamic model of MV2 flight is derived, and semi-empirical aerodynamic formulas for thrust, lift, drag and pitching moment based on wind tunnel testing are applied to the dynamic model. Nonlinearities during transition to/from hover are …", "num_citations": "11\n", "authors": ["1396"]}
{"title": "Synthesizing executable simulations from structural models of component-based systems\n", "abstract": " Experts in robotics systems have developed substantial software tools for simulation, execution, and hardware-in-the-loop testing. Unfortunately, many of these robotics-domain software infrastructures pose challenges for a robotics expert to use, unless that robotics expert is also familiar with middleware programming, and the integration of heterogeneous simulation tools. In this paper, we describe a novel modeling language designed to bridge these two domains in an intuitive visual representation. Using this metamodel-defined modeling language, we can design and build structural models of robotics systems, and synthesize experiments from these constructed models. The restrictions implicit (and explicit) in the visual language guide modelers to build only models that can be synthesized, a\" correct by construction\" approach. We discuss the impact of this language with a running example of an autonomous ground vehicle, and the hundreds of configuration parameters and several simulation tools that are necessary in order to simulate this complex example.", "num_citations": "11\n", "authors": ["1396"]}
{"title": "Empirical evaluation of an autonomous vehicle in an urban environment\n", "abstract": " Operation in urban environments creates unique challenges for research in autonomous ground vehicles. Due to the presence of tall trees and buildings in close proximity to traversable areas, GPS outage is likely to be frequent and physical hazards pose real threats to autonomous systems. In this paper, we describe a novel autonomous platform developed by the Sydney-Berkeley Driving Team for entry into the 2007 DARPA Urban Challenge competition. We report empirical results analyzing the performance of the vehicle while navigating a 560-meter test loop multiple times in an actual urban setting with severe GPS outage. We show that our system is robust against failure of global position estimates and can reliably traverse standard two-lane road networks using vision for localization.", "num_citations": "11\n", "authors": ["1396"]}
{"title": "Fault tolerant data flow modeling using the generic modeling environment\n", "abstract": " Designing embedded software for safety-critical, real-time feedback control applications is a complex and error prone task. Fault tolerance is an important aspect of safety. In general, fault tolerance is achieved by duplicating hardware components, a solution that is often more expensive than needed. In applications such as automotive electronics, a subset of the functionalities has to be guaranteed while others are not crucial to the safety of the operation of the vehicle. In this case, we must make sure that this subset is operational under the potential faults of the architecture. A model of computation called fault-tolerant data flow (FTDF) was recently introduced to describe at the highest level of abstraction of the design the fault tolerance requirements on the functionality of the system. Then, the problem of implementing the system efficiently on a platform consists of finding a mapping of the FTDF model on the …", "num_citations": "11\n", "authors": ["1396"]}
{"title": "Runtime hardware/software task transition scheduling for data-adaptable embedded systems\n", "abstract": " Data-adaptable reconfigurable embedded systems enable a flexible runtime implementation in which a system can transition the execution of tasks between hardware and software while simultaneously continuing to process data during the transition. Efficient runtime scheduling of task transitions is needed to optimize system throughput and latency of the reconfiguration and transition periods. In this paper, we present and analyze several runtime transition scheduling algorithms and highlight the latency and throughput tradeoffs for an example system.", "num_citations": "10\n", "authors": ["1396"]}
{"title": "Anemic: Automatic interface enabler for model integrated computing\n", "abstract": " A domain-specific language provides domain experts with a familiar abstraction for creating computer programs. As more and more domains embrace computers, programmers are tapping into this power by creating their own languages fitting the particular needs of the domain. Graphical domain-specific modeling languages are even more appealing for non-programmers, since the modeling language constructs are automatically transformed into applications through a special compiler called a translator. The Generic Modeling Environment (GME) at Vanderbilt University is a meta-programmable model-ing environment. Translators written to interface with GME models typically use a domain-independent API. This paper presents a tool called ANEMIC that generates a domain-specific API for GME translators using the same metamodel that generates the language.", "num_citations": "10\n", "authors": ["1396"]}
{"title": "Autonomous vehicles: From vehicular control to traffic contro\n", "abstract": " This article provides an overview of the converging areas of control for autonomous vehicles, and control of the larger transportation system in which a small number of autonomous vehicles serve as actuators of traffic flow. The overview begins by describing the verification techniques and realistic sensor and control interfaces for safe real-time control of autonomous vehicles. Shifting towards a period when autonomous vehicles are present in large numbers, the article reviews classical traffic modeling, estimation, and control techniques, and then considers new methods available to model and use these autonomous vehicles to actuate bulk traffic flow composed primarily of human-piloted vehicles.", "num_citations": "8\n", "authors": ["1396"]}
{"title": "Computationally aware switching criteria for hybrid model predictive control of cyber-physical systems\n", "abstract": " This paper describes hybrid model predictive controllers that switch between two predictor functions based on the uncontrollable divergence metric. The uncontrollable divergence metric relates the computational capabilities of the model predictive controller, to the error of the system due to model mismatch of the predictor function during computation of the solution. The contribution of this paper is in its treatment of the model predictive controller to permit optimization to take multiple timesteps to occur, but still rely on the uncontrollable divergence metric. The results demonstrate the approach for control of a vertical takeoff-and-landing aerial vehicle.", "num_citations": "8\n", "authors": ["1396"]}
{"title": "Hardware/software communication middleware for data adaptable embedded systems\n", "abstract": " Recent trends toward increased flexibility and configurability in emerging applications present demanding challenges for implementing systems that incorporate such capabilities. The resulting application configuration space is generally much larger than any one hardware implementation can support. We present an overview of a new data-adaptive approach to rapid design and implementation of such highly configurable applications. In support of this data-adaptable approach, we demonstrate an efficient and flexible hardware/software communication middleware to support the seamless communication between hardware and software tasks at runtime. We highlight the flexibility of this interface and present an initial case study with results demonstrating the performance capabilities and area requirements.", "num_citations": "8\n", "authors": ["1396"]}
{"title": "Using integrative models in an advanced heterogeneous system simulation\n", "abstract": " This paper is an academic experience report describing the use by researchers at the University of Arizona of a domain-specific language developed by the Institute for Software Integrated Systems (at Vanderbilt University). The domain in question is heterogeneous, distributed simulation of quad-rotor unmanned aerial vehicles (UAVs) as they respond to command and control requests from a human operator. We describe in detail how our individual designs of the controller and guidance laws for the UAV, its rendering and position updates, on-board sensors, and the various commands to delegate mission-critical behaviors, all interact using the ISIS-developed modeling language. We then discuss the outlook for this domain (heterogeneous system simulation and integration) for domain-specific languages and models, specifically for unmanned vehicle control and interaction.", "num_citations": "8\n", "authors": ["1396"]}
{"title": "Generative Components for Hybrid Systems Tools.\n", "abstract": " Generative techniques, while normally associated with programming languages or code generation, may also be used to produce non-executable artifacts (eg, configuration or toolchain artifacts). Coupled with domain-specific modeling, generative techniques provide a way to consolidate toolchains and complex domains into a relatively compact space, by providing generators that produce artifacts in the appropriate semantic domain. This paper describes the motivation and usage of one such environment, in the domain of hybrid systems, as well as discussion and goals for future research.", "num_citations": "8\n", "authors": ["1396"]}
{"title": "A closed-loop model-based design approach based on automatic verification and transformation\n", "abstract": " Domain-specific modeling languages effectively constrain structural concepts, but constraints that are not easily captured with structural constraints are still important to fix at design time. In practice these kinds of constraints are implicitly left to be carried out by the domain modelers. This paper explores the process of incorporating system behavioral (not just structural) constraints into a DSML, and studies the way of generating feasible transformation solutions if those constraints fail, based on a transformation library constructed in advance. Our approach is to carry out the verification process through code generation, but utilize the results of verification as an input to a model transformation generator. The output transformation then operates on the original model. As a case study, we applied the approach to finite state machine (FSM) models that control a cyber-physical system.", "num_citations": "7\n", "authors": ["1396"]}
{"title": "Model based development with the skeleton design method\n", "abstract": " In the template design method, an algorithm is defined in abstract terms. The template can then be used to create various subclasses to override that abstract behavior. This paper discusses a way in which the template method can be extended to the generation of software artifacts from models. Specifically, this new method will be an amalgam of techniques for applying template design concepts to modeling. This extended method is referred to as the skeleton method and has two major sub- methodologies that compose it. First, skeleton files are created to represent the end artifacts of the modeling language. Second, an interpreter template can be constructed from which language interpreters can be derived. As such, the modeling language can be easily extended to generate software for new programming languages or for new third party middleware. This paper presents two modeling languages which use the …", "num_citations": "7\n", "authors": ["1396"]}
{"title": "Simplification of semantically-rich model transformations through generated transformation blocks\n", "abstract": " This paper demonstrates a novel concept for the simplification of model transformations in which composite or complex objects are inserted into an existing model through a well-defined interface. The technique utilizes a model transformation from the domain of the modeling language into the domain of model transformation languages. The user specifies these semantically rich blocks using the original domain-specific modeling language. Then, a transformation generates the necessary model transformation graph to create an instance of the semantically rich, user-defined pattern. Users insert these generated patterns into their customized transformations. The approach is helpful for endogenous transformations in which existing objects may be refactored. It will also serve as a teaching tool for users who are unfamiliar with model transformations: specifically how to represent a newly-created model in the …", "num_citations": "7\n", "authors": ["1396"]}
{"title": "Message modeling for the joint architecture for unmanned systems (JAUS)\n", "abstract": " The Joint Architecture for Unmanned Systems (JAUS) is a standard for sensing, control, and computational communication of components for unmanned systems. This paper presents a modeling environment capable of producing a domain-specific prototype of the software necessary for inter-computer communications. A metamodel is used to provide the domain-specific modeling language to model both the messages used in JAUS, and the shell interfaces for components that transmit and receive those messages. The produced artifacts are C and C++ code that can be used in unmanned systems and simulations of such systems, including tests that validate the structure and behavior of the generated code. The generated code is compatible with standard JAUS implementations, and is validated using the Open JAUS open source API and framework. Future work describes the second spiral of features and …", "num_citations": "7\n", "authors": ["1396"]}
{"title": "The 9th OOPSLA workshop on domain-specific modeling\n", "abstract": " Domain-Specific Modeling raises the level of abstraction beyond programming by specifying the solution directly using visual models to express domain concepts. In many cases, final products can be generated automatically from these high-level specifications. This automation is possible because both the language and generators fit the requirements of only one domain. This paper introduces Domain-Specific Modeling and describes the related 2-day workshop (25th and 26th October 2009).", "num_citations": "7\n", "authors": ["1396"]}
{"title": "A visual language for describing instruction sets and generating decoders\n", "abstract": " We detail the syntax and semantics of ISA_ML, a visual modeling language for describing Instruction Set Achitectures of microprocessors, and an accompanying tool that takes a description in the language and generates decoders from it in the form of a disassembler and a micro-architectural trace interfacer. The language and tool were built using the Generic Modeling Environment (GME), and leverage the concepts of meta-modeling to increase productivity and to provide extensive error checking to the modeler. Using this tool, we were able to construct a model of significant subsets of the MIPS, ARM, and PowerPC instruction sets each in 8 hours or less. This language can be retargeted for other purposes, such as generating synthesizable instruction decoders.", "num_citations": "7\n", "authors": ["1396"]}
{"title": "Generating model transformations for mending dynamic constraint violations in cyber physical systems\n", "abstract": " Cyber physical systems (CPSs) by definition involve design constraints addressing the computation and communication necessary to control physical systems. These systems have been modeled using domain specific modeling languages, but some limitations exist in the continued application of such a modeling approach to more complex, or safety-critical, systems. Specifically, it is well known how to formulate constraints in a domain-specific modeling language in order to prevent users from building invalid structures, but existing constraint-based techniques do not take into consideration design requirements that may require analysis in the physical domain (ie dynamic constraints). Those analysis results, when interpreted by a domain expert, can inform changes to the model: unfortunately, this``by hand''process does not scale. This paper presents an approach to automate the process of evolving models based …", "num_citations": "6\n", "authors": ["1396"]}
{"title": "Efficient reconfiguration methods to enable rapid deployment of runtime reconfigurable systems\n", "abstract": " Today's sensing and processing algorithms operate on vast data streams coming from a broad range on input sources. In response, embedded computing applications require a large degree of configurability and adaptability to operate on a variety of data inputs where the characteristic of the data inputs may also change over time. To address these challenges, runtime reconfigurable systems can enable efficient implementations in which hardware accelerators can be reconfigured in response to the characteristics of the current data inputs. In this paper, we present an overview of the framework and runtime reconfiguration methods developed in the data-adaptable reconfigurable embedded systems (DARES) project. We provide an overview of the rapid deployment and runtime reconfiguration capabilities of this methodology, showcasing an adaptable implementation of a JPEG2000 image compression application.", "num_citations": "6\n", "authors": ["1396"]}
{"title": "Model-based software synthesis for self-reconfigurable sensor network in water monitoring\n", "abstract": " Many mobile sensing platforms take advantage of a common ubiquitous mobile device for computation, communication, and control tasks: a mobile phone. Tasks are frequently based on data from GPS sensors, accelerometers, etc. However, the realization of concurrent tasks in these devices introduces unnecessary complexities if new tasks are added without a design overhaul of the system. In this paper, we present a domain-specific modeling language for the specification of concurrent tasks to be deployed on a single mobile device, even if that device has hand-written code on board. The language utilizes mobile device concepts as events, and synthesizes software that runs as independent services. For example, one task may be to send a text message with the current location, if the phone's battery is low in charge. The results are applied to algorithms used by a floating sensor testbed of drifters, which monitor …", "num_citations": "6\n", "authors": ["1396"]}
{"title": "Time-triggered buffers for event-based middleware systems\n", "abstract": " Application developers utilizing event-based middleware have sought to leverage domain-specific modeling for the advantages of intuitive specification, code synthesis, and support for design evolution. For legacy and cyber-physical systems, the use of event-based middleware may mean that changes in computational platform can result anomalous system behavior, due to the presence of implicit temporal dependencies. These anomalies are a function not of the component implementation, but of the model of computation employed for supporting system composition. In order to address these behavioral anomalies, the paper presents an approach where time-based blocks are inserted into the system to account for the temporal dependencies. An advantage of capturing the system composition in a domain-specific modeling language is the ability to efficiently refactor an application to include time-triggered …", "num_citations": "6\n", "authors": ["1396"]}
{"title": "Darpa urban challenge technical paper: Sydney-Berkeley driving team\n", "abstract": " Team is a collaboration between academic and research personnel from (in alphabetical order) the National Information and Communication Technology of Australia, University of California, Berkeley, University of Sydney, and the University of Technology, Sydney. This document describes the planning, actuation, simulation, communication, theoretical tasks, advancements, and projections necessary for the team to compete in the DARPA Urban Challenge. Among our major accomplishments, we claim the ability for distributed code development through the use of our component-based middleware, a high-confidence testbed which was designed and implemented from the ground up by our engineers, prototype testing in months, and robust software design and development allowing a seamless transition between simulation and online testing.", "num_citations": "6\n", "authors": ["1396"]}
{"title": "Real-time distance estimation and filtering of vehicle headways for smoothing of traffic waves\n", "abstract": " In this paper we describe an experience report and field deployment of real-time filtering algorithms used with a robotic vehicle to smooth emergent traffic waves. When smoothing these waves in simulation, a common approach is to implement controllers that utilize space gap, relative velocity and even acceleration from smooth ground truth information, rather than from realistic data. As a result, many results may be limited in their impact when considering the dynamics of the vehicle under control and the discretized nature of the laser data as well as its periodic arrival. Our approach discusses trade-offs in estimation accuracy to provide both distance and velocity estimates, with ground-truth hardware-in-the-loop tests with a robotic car. The contribution of the work enabled an experiment with 21 vehicles, including the robotic car closing the loop at up to 8.0 m/s with the filtered estimates, stressing the importance of …", "num_citations": "5\n", "authors": ["1396"]}
{"title": "Dissipation of emergent traffic waves in stop-and-go traffic using a supervisory controller\n", "abstract": " This paper presents the use of a quadratic band controller in an autonomous vehicle (AV) to regulate emergent traffic waves resulting from traffic congestion. The controller dampens the emergent traffic waves through modulating its velocity according to the relative distance and velocity of the immediately preceding vehicle in the flow. At the same time, it prevents any collision within the range specified by the design parameters. The approach is based on a configurable quadratic band that allows smooth transitions between (i) no modification to the desired velocity; (ii) braking to match the speed of the preceding vehicle; and (iii) braking to avoid collision with the lead vehicle. By assuming that the lead vehicle's velocity will be oscillatory, the controller's smooth transition between modes permits any vehicle following the AV to have a smoother reference velocity. The configurable quadratic band allows design …", "num_citations": "5\n", "authors": ["1396"]}
{"title": "A lidar error model for cooperative driving simulations\n", "abstract": " Cooperative driving and vehicular network simulations have done huge steps toward high realism. They have become essential tools for performance evaluation of any kind of vehicular networking application. Yet, cooperative vehicular applications will not be built on top of wireless networking alone, but rather fusing together different data sources including sensors like radars, LiDARs, or cameras. So far, these sensors have been assumed to be ideal, i.e., without any measurement error. This paper analyzes a set of estimated distance traces obtained with a LiDAR sensor and develops a stochastic error model that can be used in cooperative driving simulations. After implementing the model within the Plexe simulation framework, we show the impact of the model on a set of cooperative driving control algorithms.", "num_citations": "5\n", "authors": ["1396"]}
{"title": "Rapid prototyping of dmitri, a hexapod robot\n", "abstract": " Dmitri is a hexapod robot designed to explore biologically influenced behaviors, manufactured using 3D printing. The use of 3D printing results in not only rapid turnaround time of the physical components, but helps to evaluate software or simulation. Biologically inspired robots may involve complex shapes to correctly mimic biology, and such designs are only economically feasible through the use of 3D printing. Rapid prototyping of software also works in a symbiotic relationship with the mechanical design, so an iterative process may change based on the evaluation of the complete electromechanical system. Presented is the rapid prototyping methods used to develop Dmitri in both hardware and software. Artifacts and considerations using 3D printing in robotics is also discussed.", "num_citations": "5\n", "authors": ["1396"]}
{"title": "Modeling autonomous systems\n", "abstract": " Middleware designed to describe sensing, control, and computational communications of components within unmanned systems enables the creation of clean interfaces between the low-level mechanics of such systems and the higher-level logic designed to control them. This paper presents a modeling environment with a domain-specific ontology for autonomous systems, capable of generating software necessary for intercomputer communications according to existing autonomous systems middleware standards. Metamodels are used to specify the domain-specific modeling language to model the messages used, the interfaces between components, and some of the functionality of the components that transmit and receive messages. The generated code supports the high data rates expected in autonomous systems that use lossy message compression. Tests for the messaging infrastructure are also generated …", "num_citations": "5\n", "authors": ["1396"]}
{"title": "Template based planning and distributed control for networks of unmanned underwater vehicles\n", "abstract": " A decentralized control scheme for large packs of unmanned underwater vehicles (UUV) is proposed and investigated. This scheme is based on shared knowledge of a template, which includes operational plans, modes of operation, contingencies including the ability to adapt individual plans within the template to changing operational conditions, and the protocols for disseminating individual state, network and command information between UUVs. This template-based control enables complex and cooperative functionality by the network within the bounds of severe communications limitations and provides for a highly scalable solution for distributed control. Simulation results of medium-sized packs of UUVs are presented and the road ahead to physical implementation, experimentation and deployment is described.", "num_citations": "5\n", "authors": ["1396"]}
{"title": "Experience report: Constraint-based modeling of autonomous vehicle trajectories\n", "abstract": " Autonomous vehicles and other robotics systems are frequently implemented using a general-purpose programming language such as C++, and prototyped using domain-specific tool such as MATLAB/Simulink, and LabVIEW. Such an approach is not efficient when programming primitive motions of autonomous vehicles when considering important safety constraints, and when promoting the broad access to robotic systems through involvement of students and aspiring students who do not know conventional low-level programming languages. Aside from general-purpose programming languages, there are languages that are specifically designed to model autonomous vehicles, such as SHIFT, but these languages are typically for simulation purposes only. This experience report discusses the creation of a domain-specific language that allows for faster programming of autonomous vehicles while ensuring valid …", "num_citations": "4\n", "authors": ["1396"]}
{"title": "Generating a ROS/JAUS bridge for an autonomous ground vehicle\n", "abstract": " Robotic systems have benefitted from standardized middleware that can componentize the development of new capabilities for a robot. The popularity of these robotic middleware systems has resulted in sizable libraries of components that are now available to roboti-cists. However, many robotic systems (such as autonomous vehicles) must adhere to externally defined standards that do not contain a large repository of components. Due to the real-time and safety concerns that accompany the domain of unmanned systems, it is not trivial to interface these middleware systems. However, previous attempts to do so have succeeded at the cost of ad hoc design and implementation. This paper describes a domain-specific approach to the synthesis of a bridge between the popular Robotic Operating System (ROS) and the Joint Architecture for Unmanned Systems (JAUS). The domain-specific nature of the approach …", "num_citations": "4\n", "authors": ["1396"]}
{"title": "Constrained data acquisition for mobile citizen science applications\n", "abstract": " The popularity and ubiquity of personal mobile computing devices' coupled with their powerful sensing capabilities' allow their application in the structured collection of data for societal benefit and science applications. Citizen scientists are willing users and active contributors to scientific research and applications, but if they gather data in an unconstrained or ad hoc manner, their efforts may be of little scientific value. In this paper, we present a user interface for a mobile device which is properly constrained to permit the gathering of valid scientific data. This helps to achieve the goal that any individual with a basic familiarity of the device (but not of the science) should be able to obtain useful data with little learning required. As a use case for this concept, we present a mobile application that allows user to collect location-stamped images to supplement satellite data for climate change research.", "num_citations": "4\n", "authors": ["1396"]}
{"title": "Teaching students to learn to learn mobile phone programming\n", "abstract": " This paper describes experiences of the instructor of a course dealing with mobile phone programming. This instance of the course (offered yearly since 2010) reuses the academic content of a traditional software engineering course, but requires mobile phone application development for concrete deliverables that exemplify competency of the academic concepts of the course. The paper describes the tradeoffs between teaching the material vs. students learning the material, group dynamics and constraints, as well as technical recommendations for faculty who are considering offering a course that concentrates on mobile phone applications.", "num_citations": "4\n", "authors": ["1396"]}
{"title": "Fuzzy control of an autonomous car using a smart phone\n", "abstract": " This paper presents preliminary results on the development of a vision-based controller with a smart phone in the loop for autonomous vehicles. Our approach involves the use of the low cost vision sensors available on a smart phone to implement speed control for a lead-follower application, under stop-and-go traffic conditions. The controller uses fuzzy logic to determine commands based on estimated car position and speed with respect to the target vehicle being followed. We define constraints for system parameters associated with the minimum resolution and distance required for the controller to operate efficiently. The proposed design was successfully demonstrated on the University of Arizona CAT Vehicle by having it identify and follow a chosen human-driven lead vehicle.", "num_citations": "3\n", "authors": ["1396"]}
{"title": "A modular framework to enable rapid evaluation and exploration of energy management methods in smart home platforms\n", "abstract": " Numerous efforts focus on developing smart grid and smart home platforms to provide monitoring, management, and optimization solutions. In order to more effectively manage energy resources, a holistic view is needed; however the involved platforms are complex and require integration of a multitude of parameters such as the end-user behavior, underlying hardware components, environment, etc., many of which operate on varying time scale at various levels of detail. A general and modular framework is presented to enable designers to focus on modeling, simulating, analyzing, or optimizing specific sub-components without requiring a detailed implementation across all levels. We incorporate two case studies in which the proposed framework is utilized to help an end user evaluate platform configurations given an energy usage model, as well as integrate an energy optimization module to investigate …", "num_citations": "3\n", "authors": ["1396"]}
{"title": "A hybrid controller for autonomous vehicle lane changing with epsilon dragging\n", "abstract": " Trajectory control for an autonomous ground vehicle typically utilizes the error from the desired path or trajectory (i.e., crosstrack error) to produce velocity and steering commands. If an obstacle is in the path, previous techniques have synthesized a new trajectory that avoids the obstacles, and the vehicle directly follows this new path. This approach has drawbacks at high velocity, because the synthesized trajectory must satisfy the stability criteria of the vehicle. This paper introduces a technique which we call epsilon dragging. The approach modifies the existing trajectory by some value e in order to avoid an obstacle at high speeds, while preserving the original trajectory as the desired path. Epsilon dragging is performed by inducing an additional error to the crosstrack error of the vehicle; this induced error can be bounded in order to stay within the velocity/turnrate profile that governs safe behavior at high speeds …", "num_citations": "3\n", "authors": ["1396"]}
{"title": "System throughput optimization and runtime communication middleware supporting dynamic software-hardware task migration in data adaptable embedded systems\n", "abstract": " The complexity of embedded applications has led to highly configurable algorithms and standards that support a wide range of data inputs. Design time optimization of these algorithms is not possible due to combinatorial explosion of data configurations - or data profiles - that can be observed at runtime. To address these challenges, data adaptable design methodologies can be utilized to directly model the correlation of data profiles and algorithmic requirements. This approach enables a reconfigurable implementation that adapts the system execution at runtime to utilize profile-specific hardware tasks in response to changes in the data profile of the current input data. In this paper, we present a simulation-based methodology and heuristic search methodology for determining system configurations considering available hardware accelerators and the sizes of FIFO queues within those accelerators to determine …", "num_citations": "3\n", "authors": ["1396"]}
{"title": "Heterogeneous multi-core systems: UML profiles vs. DSM Approaches\n", "abstract": " This paper examines tradeoffs in extending a UML profile, or developing a new DSML for a particular domain. Questions are presented which help to make an objective decision. A case study is presented to address system design in heterogeneous multi-core systems. Since throughput, application-specific data streams, and the desired output executable language are each complicated by design constraints or process constraints, this decision is weighed against timeliness of delivery, and the availability of tools to analyze, design, and validate the solution.", "num_citations": "3\n", "authors": ["1396"]}
{"title": "On the Extraction and Analysis of a Social Network with Partial Organizational Observation\n", "abstract": " The behavior of an organization may be inferred based on the behavior of its members, their contacts, and their connectivity. One approach to organizational analysis is the construction and interpretation of a social network graph, where entities of an organization (persons, vehicles, locations, events, etc.) are nodes, and edges represent varying kinds of connectivity between entities. This paper describes a transformation based approach to the extraction of a social network graph, where the original data comprising (partial) observation of the organization are embedded on a graph with a different ontology, and with many entities and edges that are unrelated to the organization of interest. Social network extraction allows the inference of implied relationships, and the selection of relationships relevant for intended analysis techniques. The analysis of the resulting social network graph is based on organizational and …", "num_citations": "3\n", "authors": ["1396"]}
{"title": "Model-based autosynthesis of time-triggered buffers for event-based middleware systems\n", "abstract": " Robotics software in general Individual task complexity and dynamic real-time nature [1] Generalization of algorithms nontrivial Large number of software contributors Distributed, cross-platform computing environments are non-intuitive for domain experts Individual projects Necessity of regression tests [2] Simulation complexity increases dramatically when realistic simulations used", "num_citations": "3\n", "authors": ["1396"]}
{"title": "Recovering models of a four-wheel vehicle using vehicular system data\n", "abstract": " This paper discusses efforts to parameterize the actuation models of a four-wheel automobile for the purposes of closed-loop control. As a novelty, the authors used the equipment already available or in use by the vehicle, rather than expensive equipment used solely for the purpose of system identification. After rudimentary measurements were taken of wheelbase, axle width, etc., the vehicle was driven and data were captured using a controller area network (CAN) interface. Based on this captured data, we were able to estimate the feasibility of certain closed-loop controllers, and the models they assumed (ie, linear, or nonlinear) for control. Examples were acceleration and steering. This work served to inform the separation of differences in simulation and vehicle behavior during vehicle testing.", "num_citations": "3\n", "authors": ["1396"]}
{"title": "Transitioning control and sensing technologies from fully-autonomous driving to driver assistance systems\n", "abstract": " Based on our experience in the DARPA Urban Challenge and on current trends in consumer automobiles, we believe that driver assistance systems can be significantly improved by new techniques in control and sensing that have been developed for fully-autonomous driving.In particular, from the control community, real-time Model Predictive Control (MPC) can be used as the next generation of cruise control for automobiles, offering a principled method for robustly incorporating information from automobiles’ existing sensing systems, such as GPS and odometry, as well as from additional sensors that will be used in future, complimentary driver assistance systems, such as visible-light cameras, infrared (IR) cameras and laser scanners.", "num_citations": "3\n", "authors": ["1396"]}
{"title": "A paradigm for teaching modeling environment design\n", "abstract": " Model-Integrated Computing (MIC) is a generic term for the practice of coupling models of a complex system with the execution of that system. Although MIC has been in use for years by experts who learn its techniques in an ad hoc manner, it is only recently that system modeling—as a science—has begun to be taught as a subject. This paper presents a paradigm in use in a course designed specifically to teach the design of domain-specific modeling environments. The work describes how this paradigm grows throughout the course to complement the expanding nomenclature, mapping technologies, visitor and object-oriented technologies, and design decisions encountered by the students.", "num_citations": "3\n", "authors": ["1396"]}
{"title": "WiP Abstract: String stability of commercial adaptive cruise control vehicles\n", "abstract": " Adaptive cruise control (ACC) is the first wave of vehicle automation that will reach the mainstream. It has been shown in [3] that automation of a small fraction of vehicles in traffic (eg, 5%) can change the emergent properties of the flow, for example by dissipating phantom jams. Substantial theoretical and experimental underpinnings of vehicle automation and platooning were established in the from the USDOT Automated Highway System effort [1]. However, it is not yet clear whether the ACC vehicles that are currently commercially available will dampen or amplify phantom jams. The relevant measure for phantom traffic jam occurrence is string stability, which tells whether small perturbations from the equilibrium flow are amplified (unstable) or dissipated (stable) as they propagate from one vehicle to another along a string of vehicles. It has been shown that by using vehicle connectivity, ACC controllers can be designed to be string stable. Yet the commercially available ACC vehicles do not use connectivity. There is also significant interest to model the real impacts of ACC vehicles in the traffic flow by the traffic engineering community.In this work, we conduct a series of car-following experiments with seven different ACC vehicles and use the collected data to model the car-following behavior of each vehicle. Using a linear stability analysis, the string stability of each tested vehicle is analyzed. Additionally, platoon experiments with platoons of up to eight identical vehicles are conducted to validate the stability findings. Previously, only one commercial ACC system has been evaluated for string stability [2]. The visual aspects of the data make this …", "num_citations": "2\n", "authors": ["1396"]}
{"title": "Wip abstract: Stabilizing traffic with a single autonomous vehicle\n", "abstract": " This work focuses on technologies for cyber physical systems (CPS) to mitigate traffic instabilities that adversely affect fuel consumption (e.g., stop-and-go waves) via precise velocity control of a small number of autonomous vehicles (AVs) on the highway. The main finding is that even a single autonomous vehicle may substantially reduce undesirable traffic waves in its vicinity when properly controlled. The general approach is to use AVs and their sensors to detect congestion events, and then close the loop by carefully following prescribed velocity controllers that are demonstrated to reduce the fuel consumption of the overall traffic flow.", "num_citations": "2\n", "authors": ["1396"]}
{"title": "DSM'14: the 14th workshop on domain-specific modeling\n", "abstract": " Domain-Specific Modeling (DSM) has proven to be a viable solution to the challenges related to abstraction mismatches between the problem and solution spaces. In many cases, DSM assists in the generation of final products from high-level models that are specific to a domain in terms of abstractions and representation. This automation is possible because both the language and generators are tailored for one domain. This paper introduces DSM and describes the related workshop at SPLASH 2014 (21 October 2014, Portland, Oregon).", "num_citations": "2\n", "authors": ["1396"]}
{"title": "An overseer control methodology for data adaptable embedded systems\n", "abstract": " The performance of software algorithms can be improved by performing those algorithms on specialized embedded hardware. However, complex algorithms that rely on input data at runtime for configuration have a combinatorial explosion of possible configurations, which has historically put hardware acceleration out of reach for applications wishing to serve large configuration spaces. Data adaptable embedded systems overcome this limitation by allowing for hardware reconfiguration during runtime, but the complexity of the specification of these systems is difficult to manage with traditional techniques. In this paper, a modeling approach is discussed in order to concurrently model two aspects of the final system: dependencies between algorithm tasks, and desired hardware configurations for each task. The contribution of the work is the model-based generation of hardware and software tasks, as well as a control …", "num_citations": "2\n", "authors": ["1396"]}
{"title": "autoVHDL: a domain-specific modeling language for the auto-generation of VHDL core wrappers\n", "abstract": " Reconfigurable embedded hardware is a staple of many applications in defense technology and applied engineering. The integration of various embedded hardware\" cores\"(ie, the computing units) is complicated by the unintended complexities inherent in the consistent and correct construction of communication pathways-specified using VHDL. This paper presents a domain-specific modeling approach to reducing this complexity. The results include demonstration of the tool, where generated VHDL code with complex data and processing requirements is simulated.", "num_citations": "2\n", "authors": ["1396"]}
{"title": "Modeling languages applied to decision controllers for embedded human systems\n", "abstract": " Embedded Human Systems are systems where components are necessarily human and computational. When these systems are heavily impacted by physical constraints, or safety requirements, a modeling approach to their design is merited, especially when certain aspects of the design can be automated, or verified, using computation methods. In this paper we review one such element of the design-the decision controller-and discuss the physical and computational methods that can be used to design and validate these controllers.", "num_citations": "2\n", "authors": ["1396"]}
{"title": "Large-scale Cognitive Modeling Using Modelintegrated Computing\n", "abstract": " Research in cognitive modeling is increasingly addressing large-scale models that interact with complex synthetic task environments. These efforts bring with them a number of new challenges, including the need to manage the complexity of large models, to integrate the models into complex software simulations, and to understand and debug models that are specified at high levels of abstraction. These challenges are difficult in isolation; together they constitute an enormous obstacle combining the significant challenges of large-scale software engineering with the complexity of knowledge-based systems.This workshop will describe and debate the potential of a bold new solution to these challenges based on Model Integrated Computing (MIC). MIC is a modeling and systems integration paradigm, maturing at the vanguard of systems/software engineering (Sztipanovits & Karsai, 1997; Karsai, Agarwal, & Ledeczi, 2003). MIC is a promising foundation for large-scale cognitive modeling (LSCM) because it:(a) allows modelers to specify models in domainspecific, high-level languages;(b) efficiently combines models expressed in these languages; and (c) automates the integration of models into larger systems and task environments (Balasubramanian, Schmidt, Molnár, & Lédeczi, 2008).", "num_citations": "2\n", "authors": ["1396"]}
{"title": "5th OOPSLA Workshop on Domain-Specific Modeling (DSM´ 05)\n", "abstract": " 5th OOPSLA Workshop on Domain-Specific Modeling (DSM05) — Aalto University's research portal Skip to main navigation Skip to search Skip to main content Aalto University's research portal Logo Accessibility statement English Suomi Home Profiles Research output Datasets Projects Prizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name or affiliation 5th OOPSLA Workshop on Domain-Specific Modeling (DSM05) JP. Tolvanen, J. Sprinkle, M. Rossi Department of Information and Service Management Research output: Book/Report › Anthology › Scientific › peer-review 1 Citation (Scopus) Overview Original language English Place of Publication Jyväskylä Publisher University of Jyväskylä Number of pages 118 ISBN (Print) 9513922022 Publication status Published - 2005 MoE publication type C2 Edited books Publication series Name Publisher University of Jyväskylä ISSN …", "num_citations": "2\n", "authors": ["1396"]}
{"title": "Automated Model-Based Optimization of Data-Adaptable Embedded Systems\n", "abstract": " Dynamic data-driven applications such as object tracking, surveillance, and other sensing and decision applications are largely dependent on the characteristics of the data streams on which they operate. The underlying models and algorithms of data-driven applications must continually adapt at runtime to changes in data quality and availability to meet both functional and designer-specified performance requirements. Given the dynamic nature of these applications, point solutions produced by traditional design tools cannot be expected to perform adequately across varying execution scenarios. Additionally, the increasing diversity and interdependence of application requirements complicates the design and optimization process. To assist designers of data-driven applications, we present a modeling and optimization framework that enables developers to model an application's data sources, tasks, and …", "num_citations": "1\n", "authors": ["1396"]}
{"title": "The arizona ring experiments dataset (ared)\n", "abstract": " Naturalistic driving data from a series of experiments to understand the development of phantom traffic jams.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Safe Control of Autonomous & Connected Vehicles (SCAV'17) Report from the 1st International Workshop at CPSWeek 2017\n", "abstract": " In this report, we summarize topics, challenges, and research questions discussed in the workshop contributions and during the sessions of our workshop. This summary has the purpose of leveraging the transfer of our findings into future activities of the automatic vehicle control (AVC) community.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Task transition scheduling for data-adaptable systems\n", "abstract": " Data-adaptable embedded systems operate on a variety of data streams, which requires a large degree of configurability and adaptability to support runtime changes in data stream inputs. Data-adaptable reconfigurable embedded systems, when decomposed into a series of tasks, enable a flexible runtime implementation in which a system can transition the execution of certain tasks between hardware and software while simultaneously continuing to process data during the transition. Efficient runtime scheduling of task transitions is needed to optimize system throughput and latency of the reconfiguration and transition periods. In this article, we provide an overview of a runtime framework enabling the efficient transition of tasks between software and hardware in response to changes in system inputs. We further present and analyze several runtime transition scheduling algorithms and highlight the latency and …", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Dissipation of Stop-and-Go Waves via Control of Autonomous Vehicles: Experimental Results: Data\n", "abstract": " This is the data that accompanies the paper titled, \"Dissipation of stop-and-go waves via control of autonomous vehicles: experimental results\" and includes all the data and code to generate all the figures that appeared in the paper.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Model-driven optimization of data-adaptable embedded systems\n", "abstract": " Complex sensing and decision applications such as object tracking and classification, video surveillance, unmanned aerial vehicle flight decisions, and others operate on vast data streams with dynamic characteristics. As the availability and quality of the sensed data changes, the underlying models and decision algorithms should continually adapt in order to meet desired high-level requirements. Due to the complexity of such dynamic data-driven systems, traditional design time techniques are often incapable of producing a solution that remains optimal in the face of dynamically changing data, algorithms, and even availability of computational resources. To assist developers of these systems, we present a modeling and optimization methodology that enables developers to capture application task flows and data sources, define associated quality metrics with data types, specify each algorithm's data and quality …", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Stabilizing traffic with a single autonomous vehicle: Wip abstract\n", "abstract": " This work focuses on technologies for cyber-physical systems (CPS) to mitigate traffic instabilities that adversely affect fuel consumption (eg, stop-and-go waves) via precise velocity control of a small number of autonomous vehicles (AVs) on the highway. The main finding is that even a single autonomous vehicle may substantially reduce undesirable traffic waves in its vicinity when properly controlled. The general approach is to use AVs and their sensors to detect congestion events, and then close the loop by carefully following prescribed velocity controllers that are demonstrated to reduce the fuel consumption of the overall traffic flow.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "The 11th workshop on domain-specific modeling\n", "abstract": " Domain-Specific Modeling (DSM) raises the level of abstraction beyond programming by specifying the solution directly using visual models to express domain concepts. In many cases, final products can be generated automatically from these high-level specifications. This automation is possible because both the language and generators fit the requirements of only one domain. This paper introduces DSM and describes the related 2-day workshop at SPLASH 2011 (23-24 October 2011, Portland, OR).", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Transitioning Intelligence to Embedded Platforms\n", "abstract": " This paper addresses ongoing work with the OCP along with hardware and software to enable its use on test beds and platforms which are better suited for embedded processors and more affordable for research teams.Descriptors:", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Computing meg signal sources\n", "abstract": " This paper deals with the complexity of the inverse computation of brain currents from magnetoencephalography (MEG) signals. MEG measures the magnetic field outside the head: in effect, the resultant field from the flow of current inside the brain. We describe our current techniques to perform this inverse computation (called source estimation in much of the literature), which provides a view of brain activity that is less sensitive to disturbances which affect other kinds of brain activity measurements, though much more expensive to record.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Toward design parameterization support for model predictive control\n", "abstract": " Research into the autonomous behavior of Un-manned Aerial Vehicles (UAVs) requires concise and dependable specification techniques in order to provide behavioral descriptions for the controllers of these aircraft. Practical issues with autonomous aircraft involve the safety and reliability of the controller (eg, guarantee of stability), as well as verification of the high-level intention of the autonomous behavior. Since most behaviors are implemented orthogonally to their high-level specification, improvements in the ability to rapidly specify the models that govern the behavior are certainly welcome. This paper describes the framework for decreasing the abstraction required to specify the behavior of an autonomous controller implemented through model predictive control.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Improving CBS tool development with technological spaces\n", "abstract": " The complexity of computer based systems (CBSs) requires that multiple levels of abstraction be available to a designer in order to facilitate their formal specification. Generating final executable code from the model of the system is preferred to hand-coding the implementation, but this is seldom done in one step-usually there are several cascading transformations that eventually result in the executable system. We explain how the concept of the technological space (TS) can be used to define and describe the layers between cascading transformations, and the transformations themselves. TSs are also shown as a categorization that better distinguishes between a domain and the technology used to store information in a domain.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Managing Intent: Propagation of Meaning During Model Transformations\n", "abstract": " The Model Driven Architecture (MDA) maintains that systems can be abstractly specified, and specifically instantiated. The abstract specification is created using formally defined models; thus in order to fulfill these ambitions, model transformations must be employed on some level. The definition of these transforms—however—is not a trivial task. In addition to the basic problems of the transformation syntax, and an intuitive interface, there is a more significant and difficult problem: the translation of the platform-independent models (PIMs) into platform-specific models (PSMs) such that they are “correct” in the language of the PSM. This paper philosophically discusses the root causes of transformations, specifically the syntax and semantics changes that require MDA-like transformations between modeling languages. It also examines the difference between the intent of the modeler, and that of the model—an important distinction when creating transformations.", "num_citations": "1\n", "authors": ["1396"]}
{"title": "Model integrated program synthesis of agent interaction protocols\n", "abstract": " A Multi-Agent System (MAS) is a cooperation focused implementation of multiple programs called agents that coordinate with each other to attempt to converge on the solution to one or more tasks. Agent negotiation is the convergence upon this solution through compromise and communication. It is the communication portion of negotiation that is the focus of this thesis.", "num_citations": "1\n", "authors": ["1396"]}