{"title": "Safety-critical systems, formal methods and standards\n", "abstract": " Standards concerned with the development of safety-critical systems, and the software in such systems in particular, abound today as the software crisis increasingly affects the world of embedded computer-based systems. The use of formal methods is often advocated as a way of increasing confidence in such systems. The paper examines the industrial use of these techniques, the recommendations concerning formal methods in a number of current and draft standards, and comments on the applicability and problems of using formal methods for the development of safety-critical systems on an industrial scale. Some possible future directions are suggested.< >", "num_citations": "516\n", "authors": ["1594"]}
{"title": "Seven more myths of formal methods\n", "abstract": " New myths about formal methods are gaining tacit acceptance both outside and inside the system-development community. The authors address and dispel these myths based on their observations of industrial projects. The myths include: formal methods delay the development process; they lack tools; they replace traditional engineering design methods; they only apply to software; are unnecessary; not supported; and formal methods people always use formal methods.< >", "num_citations": "504\n", "authors": ["1594"]}
{"title": "Ten commandments of formal methods\n", "abstract": " Producing correct, reliable software in systems of ever increasing complexity is a problem with no immediate end in sight. The software industry suffers from a plague of bugs on a near-biblical scale. One promising technique in alleviating this problem is the application of formal methods that provide a rigorous mathematical basis to software development. When correctly applied, formal methods produce systems of the highest integrity and thus are especially recommended for security- and safety-critical systems. Unfortunately, although projects based on formal methods are proliferating, the use of these methods is still more the exception than the rule, which results from many misconceptions regarding their costs, difficulties, and payoffs. Surveys of formal methods applied to large problems in industry help dispel these misconceptions and show that formal methods projects can be completed on schedule and within …", "num_citations": "397\n", "authors": ["1594"]}
{"title": "Digital Technologies and the Museum Experience: Handheld guides and other media\n", "abstract": " The biggest trend in museum exhibit design today is the creative incorporation of technology. Digital Technologies and the Museum Experience: Handheld Guides and Other Media explores the potential of mobile technologies (cell phones, digital cameras, MP3 players, PDAs) for visitor interaction and learning in museums, drawing on established practice to identify guidelines for future implementations.", "num_citations": "375\n", "authors": ["1594"]}
{"title": "Applications of Formal Methods\n", "abstract": " The main goal of the series has been to develop, illustrate and promulgate the scientific basis of computer programming, and its application in software engineering on an industrial scale. It is very encouraging to publish a record of success in this endeavour. Jonathan Bowen and Michael Hinchey have put together a varied collection of industrial case studies under the title Applications of Formal Methods. I hope they will be welcomed by the practitioner, removing some of the fear (but none of the challenge or benefit) of keeping to the forefront of the state of the art.", "num_citations": "351\n", "authors": ["1594"]}
{"title": "Formal Specification and Documentation using Z: A case study approach\n", "abstract": " Formal methods are becoming more accepted in both academia and industry as one possible way in which to help improve the quality of both software and hardware systems. It should be remembered however that they are not a panacea, but rather one more weapon in the armoury against making design mistakes. To quote from Prof. Tony Hoare:Of course, there is no fool-proof methodology or magic formula that will ensure a good, efficient, or even feasible design. For that, the designer needs experience, insight, flair, judgement, invention. Formal methods can only stimulate, guide, and discipline our human inspiration, clarify design alternatives, assist in exploring their consequences, formalize and communicate design decisions, and help to ensure that they are correctly carried out.", "num_citations": "266\n", "authors": ["1594"]}
{"title": "The Oxford Companion to the History of Modern Science [Computer science]\n", "abstract": " Containing 609 encyclopedic articles written by more than 200 prominent scholars, The Oxford Companion to the History of Modern Science presents an unparalleled history of the field invaluable to anyone with an interest in the technology, ideas, discoveries, and learned institutions that have shaped our world over the past five centuries. Focusing on the period from the Renaissance to the early twenty-first century, the articles cover all disciplines (Biology, Alchemy, Behaviorism), historical periods (the Scientific Revolution, World War II, the Cold War), concepts (Hypothesis, Space and Time, Ether), and methodologies and philosophies (Observation and Experiment, Darwinism). Coverage is international, tracing the spread of science from its traditional centers and explaining how the prevailing knowledge of non-Western societies has modified or contributed to the dominant global science as it is currently understood. Revealing the interplay between science and the wider culture, the Companion includes entries on topics such as minority groups, art, religion, and science's practical applications. One hundred biographies of the most iconic historic figures, chosen for their contributions to science and the interest of their lives, are also included. Above all The Oxford Companion to the History of Modern Science is a companion to world history: modern in coverage, generous in breadth, and cosmopolitan in scope. The volume's utility is enhanced by a thematic outline of the entire contents, a thorough system of cross-referencing, and a detailed index that enables the reader to follow a specific line of inquiry along various threads from multiple starting …", "num_citations": "221\n", "authors": ["1594"]}
{"title": "Personalization and the web from a museum perspective\n", "abstract": " Web sites are increasingly adapted tow ards their users by a variety of dynamic techniques, providing improved personalization for the individual. In this paper we discuss various possible approaches from a museological as w ell as a technical point of view. A number of Web sites, some produced by museums and some in other fields such as ecommerce or Internet based information services, w ill be considered as case studies. All use personalization techniques in w ays that could be beneficial also for the cultural sector. Other possible applications such as audio guides or interactive devices w ill also be considered, especially w ith respect to how this technique could help in the personalization of museum Web sites. Currently most museums lag w ell behind the state of the art w ith respect to on-line personalization. Perhaps this paper w ill inspire some museums to add personalization facilities to their Web sites the next time they undertake major updates.", "num_citations": "176\n", "authors": ["1594"]}
{"title": "Ten commandments of formal methods ...Ten years later\n", "abstract": " How have the formal methods commandments fared over the past decade? Are they still valid in the current industrial setting, and have attitudes toward formal methods improved? The authors revisit their ten maxims to answer these questions.", "num_citations": "172\n", "authors": ["1594"]}
{"title": "Formal methods in safety-critical standards\n", "abstract": " There is great interest in ensuring correctness of safety-critical embedded systems since on the one hand the use of software gives greatly increased functionality and flexibility and on the other hand it provides unprecedented possibilities for errors. Formal methods are one technique that could improve the situation. Their use is now being suggested by an increasing number of standards in the safety-critical area. The paper compares the recommendations given by a number of important existing and emerging standards and tries to identify future trends in this area. A bibliography of standards and related publications is included.< >", "num_citations": "120\n", "authors": ["1594"]}
{"title": "Industrial-Strength Formal Methods in Practice\n", "abstract": " Industrial Strength Formal Methods in Practice provides hands-on experience and guidance for anyone who needs to apply formal methods successfully in an industrial context. Each chapter is written by an expert in software engineering or formal methods, and contains background information, introductions to the techniques being used, actual fragments of formalised components, details of results and an analysis of the overall approach. It provides specific details on how to produce high-quality software that comes in on-time and within budget. Aimed mainly at practitioners in software engineering and formal methods, this book will also be of interest to the following groups; academic researchers working in formal methods who are interested in evidence of their success and in how they can be applied on an industrial scale, and students on advanced software engineering courses who need real-life specifications and examples on which to base their work.", "num_citations": "118\n", "authors": ["1594"]}
{"title": "Formal versus agile: Survival of the fittest\n", "abstract": " Many research have focused on new formal methods, integrating formal methods into agile ones, and assessing the agility of formal methods. This paper proves that formal methods can survive in an agile world; they are not obsolete and can be integrated into it. The potential for combining agile and formal methods holds promise. It might not always be an easy partnership, and succeeding will depend on a fruitful interchange of expertise between the two communities. Conducting a realistic trial project using a combined approach with an appropriate formal methods tool in a controlled environment will help assess the effectiveness of such an approach.", "num_citations": "117\n", "authors": ["1594"]}
{"title": "The REDO Compendium: Reverse Engineering for Software Maintenance\n", "abstract": " The REDO compendium | Guide books ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksThe REDO compendium: reverse engineering for software maintenance ABSTRACT No abstract available. Index Terms 1.The REDO compendium 1.Social and professional topics 1.Professional topics 1.Management of computing and information systems 1.Project and people management 2.Software management 1.Software maintenance 2.Software and its engineering 1.Software creation and management 1.Designing software 1.Software implementation planning 1.Software design techniques 2.Software development process …", "num_citations": "100\n", "authors": ["1594"]}
{"title": "The ethics of safety-critical systems\n", "abstract": " Any scientifically based activity requires a level of responsibility and it is important those involved understand the associated moral questions. Science has developed technology such as nuclear fission and fusion that have the potential for great harm as well as good. When developing safety-critical systems, it is even more critical to consider the ethical questions involved in software development. Here we examine a number of undesirable practices to avoid in order to help ensure success in a safety-critical project involving software. While these considerations cannot ensure favorable results, they may help to avoid failure, which is all too easy an outcome in software-based projects. A software developer has a wide choice of techniques to apply. Making a decision as to what is cost effective is a difficult part of the engineering process. It is often recommended that a more rigorous approach be used in critical …", "num_citations": "90\n", "authors": ["1594"]}
{"title": "The virtual museum\n", "abstract": " Jonathan Bowen is considered by many as the ‘founding father’ of the Virtual Library museums pages, one of the premier Internet sites in the museum field. He is a lecturer at the Department of Computer Science, University of Reading (United Kingdom), where he leads the Formal Methods and Software Engineering Group, and was previously a senior researcher at the Oxford University Computing Laboratory. He has worked in the field of computing in both industry and academia since 1977 and has served on more than fifteen programme committees including a major working group within the European Union information technologies programme, ESPRIT. The author of 140 publications including nine books, Jonathan Bowen won the 1994 IEE (Institution of Electrical Engineers) Charles Babbage Premium award. In 1997 he was honorary chair, workshop presenter and an invited speaker at the first ‘Museums …", "num_citations": "84\n", "authors": ["1594"]}
{"title": "Z and HOL\n", "abstract": " A simple ‘shallow’ semantic embedding of the Z notation into the HOL logic is described. The Z notation is based on set theory and first order predicate logic and is typically used for human-readable formal specification. The HOL theorem proving system supports higher order logic and is used for machine-checked verification. A well-known case study is used as a running example. The presentation is intended to show people with some knowledge of Z how a tool such as HOL can be used to provide mechanical support for the notation, including mechanization of proofs. No specialized knowledge of HOL is assumed.", "num_citations": "82\n", "authors": ["1594"]}
{"title": "Towards correct executable semantics for Z\n", "abstract": " There are many ad hoc tools aimed at the animation of executable subsets of the formal specification language Z. This paper presents an approach to rigorously establishing the correctness of such Z animation tools, drawing on ideas from the field of abstract interpretation. Enough of the standard Z syntax is treated to cover most uses of Z schemas and expressions, after schema calculus constructs have been expanded and embedded schema references replaced.", "num_citations": "79\n", "authors": ["1594"]}
{"title": "Decompilation: The enumeration of types and grammars\n", "abstract": " While a compiler produces low-level object code from high-level source code, a decompiler produces high-level code from low-level code and has applications in the testing and validation of safety-critical software. The decompilation of an object code provides an independent demonstration of correctness that is hard to better for industrial purposes (an alternative is to prove the compiler correct). But, although compiler compilers are in common use in the software industry, a decompiler compiler is much more unusual.It turns out that a data type specification for a programming-language grammar can be remolded into a functional program that enumerates all of the abstract syntax trees of the grammar. This observation is the springboard for a general method for compiling decompilers from the specifications of (nonoptimizing) compilers.This paper deals with methods and theory, together with an application of the …", "num_citations": "74\n", "authors": ["1594"]}
{"title": "The industrial take-up of formal methods in safety-critical and other areas: A perspective\n", "abstract": " Formal methods may be at the crossroads of acceptance by a wider industrial community. In order for the techniques to become widely used, the gap between theorists and practitioners must be bridged effectively. In particular, safety-critical systems offer an application area where formal methods may be engaged usefully to the benefit of all. This paper discusses some of the issues concerned with the general acceptance of formal methods and concludes with a summary of the current position and how the formal methods community could proceed to improve matters in the future.", "num_citations": "73\n", "authors": ["1594"]}
{"title": "Reinforced condition/decision coverage (RC/DC): A new criterion for software testing\n", "abstract": " A new Reinforced Condition/Decision Coverage (RC/DC) criterion for software testing is proposed. This criterion provides further development of the well-known Modified Condition/Decision Coverage (MC/DC) criterion and is more suitable for testing of safety-critical software. Formal definitions in the Z notation for RC/DC, as well as MC/DC, are presented. Specific examples of using of these criteria are considered and some features are formally proved.", "num_citations": "71\n", "authors": ["1594"]}
{"title": "Formal Methods: State of the Art and New Directions\n", "abstract": " They envy the distinction I have won; let them therefore, envy my toils, my honesty, and the methods by which I gained it.", "num_citations": "69\n", "authors": ["1594"]}
{"title": "Mobile multimedia: Reflections from ten years of practice\n", "abstract": " In the past decade, museums have experienced a revolution with the arrival of new technologies capable of enhancing their visitors’ experiences with multimedia content. Amid these new technologies, website and computer-based interactives in the gallery have augmented exhibitions to provide additional educational material. However, the Web is mainly suitable for access to information before, after, or even instead of visiting an exhibition or museum. A kiosk provides a physically fixed facility that can be used during a visit to an exhibition, but only for part of it. In contrast, a multimedia tour delivered through a handheld device allows the visitor to gain information at any point during the visit and in any order, without interfering with the aesthetics of the gallery. This means it has some unique properties that could be beneficial, if used suitably.A multimedia tour is a guide of a museum’s permanent collection, temporary exhibitions, or architecture and history, combining a variety of media including audio, text, images, videos, and occasionally also interactive programs. Because of their audiovisual nature, multimedia tours are available to visitors via screen-based handheld devices such as personal digital assistants (PDAs), iPods, and mobile phones. The level of interactivity and the supported multimedia content types vary according to the specific needs of the institution as well as the kind of device adopted. For example, iPods have mainly been used for playing videos, images, and audio, while touchscreen or", "num_citations": "68\n", "authors": ["1594"]}
{"title": "Formalization of software testing criteria using the Z notation\n", "abstract": " Describes an approach to formalization of criteria of computer systems software testing. A brief review of control-flow criteria is introduced. As a formal language for describing the criteria, the Z notation is selected. Z schemas are presented for definitions of the following criteria: statement coverage, decision coverage, condition coverage, decision/condition coverage, full predicate coverage, modified condition/decision coverage, and multiple condition coverage. This characterization could help in the correct understanding of different types of testing and also the correct application of a desired testing regime.", "num_citations": "68\n", "authors": ["1594"]}
{"title": "Modern Formal Methods and Applications\n", "abstract": " Formal methods are a robust approach for problem solving. It is based on logic and algebraic methods where problems can be formulated in a way that can help to find an appropriate solution. This book shows the basic concepts of formal methods and highlights modern modifications and enhancements to provide a more robust and efficient problem solving tool. Applications are presented from different disciplines such as engineering where the operation of chemical plants is synthesized using formal methods. Computational biology becomes easier and systematic using formal methods. Also, hardware compilation and systems can be managed using formal methods. This book will be helpful for both beginners and experts to get insights and experience on modern formal methods by viewing real applications from different domains.", "num_citations": "66\n", "authors": ["1594"]}
{"title": "Virtual visits to virtual museums\n", "abstract": " Traditionally museum visitors have had to physically go to a museum to experience what it has to offer. However, many museums can now be accessed directly from anywhere in the world via an Internet connection. Of course the facilities on offer on-line are different and not of the same quality as the real museum itself. However access to some resources such as the museum store and records could potentially be better than those available at the actual museum. This article explores how museums", "num_citations": "65\n", "authors": ["1594"]}
{"title": "A fully homomorphic crypto-processor design\n", "abstract": " A KPU is a replacement for a standard CPU that natively runs encrypted machine code on encrypted data in registers and memory – a ‘crypto-processor unit’, in other words. Its computations are opaque to an observer with physical access to the processor but remain meaningful to the owner of the computation. In theory, a KPU can be run in simulation and remain as secure (or otherwise) as in hardware. Any block cipher with a block-size of about a word is compatible with this developing technology, the long-term aim of which is to make it safe to entrust data-oriented computation to a remote environment.               Hardware is arranged in a KPU to make the chosen cipher behave as a mathematical homomorphism with respect to computer arithmetic. We describe the architecture formally here and show that ‘type-safe’ programs run correctly when encrypted.", "num_citations": "64\n", "authors": ["1594"]}
{"title": "Seven more myths of formal methods: Dispelling industrial prejudices\n", "abstract": " For whatever reason, formal methods remain one of the more contentious techniques in industrial software engineering. Despite some improvement in the uptake of formal methods, it is still the case that the vast majority of potential users of formal methods fail to become actual users. A paper by Hall in 1990 [31] examined a number of ‘myths’ concerning formal methods, assumed by some to be valid. This paper considers a few more beliefs held by many and presents some counter examples.", "num_citations": "63\n", "authors": ["1594"]}
{"title": "Handbook of Research on Socio-technical Design and Social Networking Systems [Virtual collaboration and community]\n", "abstract": " The focus of this book is not how to make technology more efficient, nor even how technology harms or helps society, but rather how to successfully combine society and technology into socio-technical performance. The Handbook of Research on Socio-Technical Design and Social Networking Systems provides a state-of-the-art summary of knowledge in this evolving, multi-disciplinary field distinctive in its variety of international authors' perspectives, depth and breadth of scholarship, and combination of practical and theoretical views. This noteworthy Handbook of Research extends a useful collection for anyone interested in modern socio-technical systems where knowledge of social principles can mean the difference between success and failure.", "num_citations": "60\n", "authors": ["1594"]}
{"title": "Ten commandments revisited: A ten-year perspective on the industrial application of formal methods\n", "abstract": " Ten years ago, our 1995 paper Ten Commandments of Formal Methods [5] suggested some guidelines to help ensure the success of a formal methods project. It proposed ten important requirements (or\" commandments\") for formal developers to consider and follow, based on our knowledge of several industrial application success stories, most of which have been reported in more detail in two books [17],[18]. The paper was surprisingly popular, is still widely referenced, and used as required reading in a number of formal methods courses. However, not all have agreed with some of our commandments, feeling that they may not be valid in the long-term. We re-examine the original commandments ten years on, and consider their validity in the light of a further decade of industrial best practice and experiences.", "num_citations": "59\n", "authors": ["1594"]}
{"title": "The use of industrial-strength formal methods\n", "abstract": " Formal methods are used in a surprisingly wide variety of applications and ways throughout the world. While they may still be considered a niche market, there is growing evidence that they can be used successfully in industry if applied judiciously. The paper discusses same of the issues concerning the successful application of formal methods and surveys a number of examples of industrial usage, with a large bibliography for further reading on the state of the art in this area.", "num_citations": "57\n", "authors": ["1594"]}
{"title": "Developing correct systems\n", "abstract": " The goal of the Provably Correct Systems project (ProCoS) is to develop a mathematical basis for development of embedded, real-time, computer systems. This survey paper introduces novel speci cation languages and veri cation techniques for four levels of development: Requirements de nition and design; Program speci cations and their transformation to parallel programs; Compilation of programs to hardware; and Compilation of real-time programs to conventional processors.", "num_citations": "57\n", "authors": ["1594"]}
{"title": "Usability, design and content issues of mobile apps for cultural heritage promotion: The Malta Culture Guide experience\n", "abstract": " The paper discusses the experience of producing and distributing an iPhone app for promotion of the Maltese Cultural Heritage on behalf of the Malta Tourism Authority. Thanks to its position at the heart of the Mediterranean Sea, Malta has been a crossroads of civilisations whose traces are still visible today, leaving a particularly rich and varied cultural heritage, from megalithic temples to baroque palaces and Caravaggio masterpieces. Conveying all these different aspects within a single application, using textual, visual, and audio means, has raised many different issues about the planning and production of cultural content for mobile usage, together with usability aspects regarding design and distribution of a mobile app. In this paper, we outline all of these aspects, focusing on the design and planning strategies for a long-term user commitment and how to evaluate results for cultural mobile applications. We include experience of all the steps of developing a mobile app, information that is of possible benefit to other app developers in the cultural sector.", "num_citations": "56\n", "authors": ["1594"]}
{"title": "A shallow embedding of Z in HOL\n", "abstract": " A simple ‘shallow’ semantic embedding of the Z notation into the higher order logic, as supported by the HOL theorem proving system, is presented. Z is typically used for human-readable formal specification whereas HOL is used for machine-checked verification. The paper is intended to show how a tool such as HOL can be used to provide mechanical support for Z, including mechanization of proofs. No specialized knowledge of Z or HOL is assumed. An explanation of shallow and deep embedding as well as a survey of other related research are also included.", "num_citations": "56\n", "authors": ["1594"]}
{"title": "Digitalism: The new realism?\n", "abstract": " Today's society is increasingly digitalised, with mobile smartphones being routinely carried and used by a significant percentage of the population. This provides an augmented experience for the individual that does not depend on their geographical separation with respect to their community of friends and other contacts. This changes the nature of relationships between people. Individuals may live in a “digital bubble„, close to others physically, but far away from them in their digital world. More specifically, digital images can be generated and shared with ever greater ease. Sometimes the digital image takes on an important part of the individual's experience of reality. This paper explores examples of the phenomenon, within the context of the arts in particular and culture in general. We also consider the assortment of terms used in a variety of ways by researchers in different fields with regard to our ever more digital society, such as digitalism, digitality, digitalisation, digital culture, digital philosophy, etc. We survey these terms, exploring them from alternative viewpoints, including sociological and philosophical aspects, and attempt to pinpoint some of these terms more precisely, especially in a cultural and artistic context.", "num_citations": "55\n", "authors": ["1594"]}
{"title": "System and Software Safety in Critical Systems\n", "abstract": " The safety aspects of computer-based systems as increasingly important as the use of software escalates because of its convenience and exibility. However the complexity of even modestly sized programs is such that the elimination of errors with a high degree of con dence is extremely di cult. There are a number of approaches to enhancing safety in safety-critical control systems. These are surveyed and compared with particular emphasis on systems with software in the controlling system. A glossary of terms and an extensive bibliography for further reading are included.", "num_citations": "54\n", "authors": ["1594"]}
{"title": "Museums and technology: Being inclusive helps accessibility for all\n", "abstract": " This paper explores accessibility issues for museums in the context of growing dependence on technology. The background of these issues is described, along with the evolution from physical access to digital access—for example, via the Web—and, increasingly, mobile technology. The authors are people with different disabilities and they describe personal experiences, giving a sense of the various barriers and benefits that are involved. The aim of this paper is to provide museums with a disabled person's point of view, which could help in inspiring improvements for the future. Often the task is one of understanding as much as financial constraints, since many solutions can be implemented at little additional cost.", "num_citations": "52\n", "authors": ["1594"]}
{"title": "Provably Correct Systems: Modelling of communication languages and design of optimized compilers [chapter]\n", "abstract": " Provably Correct Systems | Guide books ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksProvably Correct Systems: Modelling of Communication Languages and Design of Optimized Compilers ABSTRACT No abstract available. Comments Login options Check if you have access through your login credentials or your institution to get full access on this article. Sign in Full Access Get this Publication Information Contributors Published in Guide books cover image Provably Correct Systems: Modelling of Communication Languages and Design of Optimized Compilers October 1994 175 pages ISBN:0077090527 Author: Jifeng He …", "num_citations": "52\n", "authors": ["1594"]}
{"title": "Museums and Digital Culture: New perspectives and research\n", "abstract": " This richly illustrated book offers new perspectives and research on how digital culture is transforming museums in the 21st century, as they strive to keep pace with emerging technologies driving cultural and social change, played out not only in today’s pervasive networked environment of the Internet and Web, but in everyday life, from home to work and on city streets. In a world where digital culture has redefined human information behavior as life in code and digits, increasingly it dominates human activity and communication. These developments have radically changed the expectations of the museum visitor, real and virtual, the work of museum professionals and, most prominently, the nature of museum exhibitions, while digital art and life in a digitally saturated world is changing our ways of seeing, doing, our senses and aesthetics. Overall, this book creates a new picture of the 21st-century museum field. As …", "num_citations": "51\n", "authors": ["1594"]}
{"title": "A PREttier Compiler-Compiler: Generating higher-order parsers in C\n", "abstract": " Top‐down (LL) context‐sensitive parsers with integrated synthesis and use of attributes are easy to express in functional programming languages, but the elegant functional programming model can also serve as an exact prototype for a more efficient implementation of the technology in ANSI C. The result is a compiler‐compiler that takes unlimited lookahead and backtracking, the extended BNF notation, and parameterized grammars with (higher‐order) meta‐parameters to the world of C programming. This article reports on the utility in question three years after public release. Precc generates standard ANSI C and is ‘plug compatible’ with lex‐ generated lexical analyzers prepared for the UNIX yacc compiler‐compiler. In contrast to yacc, however, the generated code is modular, which allows parts of scripts to be compiled separately and linked together incrementally. The constructed code is relatively efficient, as …", "num_citations": "49\n", "authors": ["1594"]}
{"title": "Specification, verification and prototyping of an optimized compiler\n", "abstract": " This paper generalizes an algebraic method for the design of a correct compiler to tackle specification and verification of an optimized compiler. The main optimization issues of concern here include the use of existing contents of registers where possible and the identification of common expressions. A register table is introduced in the compiling specification predicates to map each register to an expression whose value is held by it. We define different kinds of predicates to specify compilation of programs, expressions and Boolean tests. A set of theorems relating to these predicates, acting as a correct compiling specification, are presented and an example proof within the refinement algebra of the programming language is given. Based on these theorems, a prototype compiler in Prolog is produced.", "num_citations": "48\n", "authors": ["1594"]}
{"title": "The Turing Guide\n", "abstract": " Alan Turing has long proved a subject of fascination, but following the centenary of his birth in 2012, the code-breaker, computer pioneer, mathematician (and much more) has become even more celebrated with much media coverage, and several meetings, conferences and books raising public awareness of Turing's life and work. This volume will bring together contributions from some of the leading experts on Alan Turing to create a comprehensive guide to Turing that will serve as a useful resource for researchers in the area as well as the increasingly interested general reader. The book will cover aspects of Turing's life and the wide range of his intellectual activities, including mathematics, code-breaking, computer science, logic, artificial intelligence and mathematical biology, as well as his subsequent influence.", "num_citations": "45\n", "authors": ["1594"]}
{"title": "ZB 2002: Formal Specification and Development in Z and B: 2nd International Conference of B and Z Users Grenoble, France, January 23–25, 2002, Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the Second International Conference of B and Z Users, ZB 2002, held in Grenoble, France in January 2002. The 24 papers presented together with three invited contributions were carefully reviewed and selected for inclusion in the book. The book documents the recent advances for the Z formal specification notion and for the B method; the full scope is covered, ranging from foundational and theoretical issues to advanced applications, tools, and case studies.", "num_citations": "45\n", "authors": ["1594"]}
{"title": "Time for renovations: A survey of museum web sites\n", "abstract": " A significant number of museums have now had Web sites for several years. However, a Web site that is not maintained and developed regularly starts to look tired and outdated much more quickly than the matching physical organization because of the fast-changing nature of the technology, and hence also the expectations of many on-line users. This paper explores what museums have achieved so far and discusses what second-generation museum Web sites might consider adding to their on-line facilities, through consideration of the results from two on-line museum surveys. The first surveyed virtual museum visitors, which may be a useful consideration for museums thinking about updating their Web site. The second more recent survey covers virtual museum sites themselves, and illustrates the current situation with respect to a significant cross-section of museum Web sites. Both surveys were undertaken in …", "num_citations": "44\n", "authors": ["1594"]}
{"title": "Tolerance of control-flow testing criteria\n", "abstract": " Effectiveness of testing criteria is the ability to detect failure in a software program. We consider not only effectiveness of some testing criterion in itself but a variance of effectiveness of different test sets satisfied the same testing criterion. We name this property \"tolerance\" of a testing criterion and show that, for practical using a criterion, a high tolerance is as well important as high effectiveness. The results of empirical evaluation of tolerance for different criteria, types of faults and decisions are presented. As well as quite simple and well-known control-flow criteria, we study more complicated criteria: full predicate coverage, modified condition/decision coverage and reinforced condition/decision coverage criteria.", "num_citations": "43\n", "authors": ["1594"]}
{"title": "User Interface Languages: A survey of existing methods\n", "abstract": " This report gives a survey of user interface languages and formal representations of user interfaces. The following aspects of User Interface Languages are considered: expressiveness readability evaluation (is it possible to evaluate the ergonomic and functional quality of the user interface from the representation) manipulation compilation/interpretation possibility to include knowledge representation.", "num_citations": "43\n", "authors": ["1594"]}
{"title": "From MC/DC to RC/DC: Formalization and analysis of control-flow testing criteria\n", "abstract": " This paper describes an approach to the formalization of existing criteria used in computer systems software testing and proposes a new Reinforced Condition/Decision Coverage (RC/DC) criterion. This new criterion has been developed from the well-known Modified Condition/Decision Coverage (MC/DC) criterion and is more suitable for the testing of safety-critical software where MC/DC may not provide adequate assurance. As a formal language for describing the criteria, the Z notation has been selected. Formal definitions in the Z notation for RC/DC, as well as MC/DC and other criteria, are presented. Specific examples of using these criteria for specification-based testing are considered and some features are formally proved. This characterization is helpful in the understanding of different types of testing and also the correct application of a desired testing regime.", "num_citations": "42\n", "authors": ["1594"]}
{"title": "The building of online communities: An approach for learning organizations, with a particular focus on the museum sector\n", "abstract": " This paper considers the move toward and potential of building online communities, with a particular focus on the museum sector. For instance, the increase in the use of `personalized' toolkits that are becoming an integral part of the online presence for learning organizations, like museums, can provide a basis for creating and sustaining communities. A set of case studies further illustrates working examples of the ways in which personalization and specific tools are developing collaborative spaces, community channels and group interactions.", "num_citations": "42\n", "authors": ["1594"]}
{"title": "Z logic and its consequences\n", "abstract": " This paper provides an introduction to the specification language Z from a logical perspective. The possibility of presenting Z in this way is a consequence of a number of joint publications on Z logic that Henson and Reeves have co-written since 1997. We provide an informal as well as formal introduction to Z logic and show how it may be used, and extended, to investigate issues such as equational logic, the logic of preconditions, the issue of monotonicity and both operation and data refinement.", "num_citations": "42\n", "authors": ["1594"]}
{"title": "A ProCoS II Project final report: ESPRIT Basic Research project 7071\n", "abstract": " An overview of the research and associated activities of the Europeancollaborative ESPRIT Basic Research ProCoS II project (no. 7071) on``Provably Correct Systems''which ran from 1992 to 1995 is presented. This was a follow-on project to ProCoS (no. 3104) and ran inparallel with the ProCoS Working Group (no. 8694), all previouslyannounced in the Bulletin of the EATCS. Acomprehensive bibliography of publications with selected projectdocuments is included for those wishing to study the results of theproject in greater depth.", "num_citations": "40\n", "authors": ["1594"]}
{"title": "Experimental evaluation of the variation in effectiveness for DC, FPC and MC/DC test criteria\n", "abstract": " Given a test criterion, the number of test-sets satisfying the criterion may be very large, with varying fault detection effectiveness. This paper presents an experimental evaluation of the variation in fault detection effectiveness of all the test-sets for a given control-flow test criterion and a Boolean specification. The exhaustive experimental approach complements the earlier empirical studies that adopted analysis of some test-sets using random selection techniques. Three industrially used control-flow testing criteria, decision coverage (DC), full predicate coverage (FPC) and modified condition/decision coverage (MC/DC) have been analysed against four types of faults. The Boolean specifications used were taken from a past research paper and also generated randomly. To ensure that it is the test-set size, a variation of DC, decision coverage/random (DC/R), has also been considered against FPC and MC/DC criteria …", "num_citations": "39\n", "authors": ["1594"]}
{"title": "A brief history of early museums online\n", "abstract": " BackgroundMuseums are in a unique position of both recording the history of human communication through networks and also using the medium to their own advantage. Fast communication of messages at long distance dates back much earlier than the Internet on which many people rely today. For example, at Masada in Israel, there are the remains of a two thousand year old columbarium tower or dovecot (see Figure 1) on the well-fortified hilltop, now a UNESCO World Heritage Site, which could have enabled communication with the outside world from this isolated outpost. During the Napoleonic Wars of the late 18 th and early 19 th century, in England a set of shutter telegraph links was set up from London to allow fast communication with the navy on the coast, as presented at the Royal Signals Museum (see Figure 2). Of course there was a delay as each relay station forwarded the message since line-of-sight viewing was necessary between each neighbouring location. Later in the 19 th century, optical communication techniques gave way to electrical communication in the form of the electrical telegraph, using cable connections and eventually via wireless signals (see Figure 3). This has been dubbed the ‘Victorian Internet’in the light of later developments (Standage, 1998).In the late 20 th century, telecommunications of all sorts became increasingly dominated by computer networks and specifically the Internet, which started as the ARPANET, originally in 1969 with four nodes in the US. The original connection at each node was via a computerbased Interface Message Processor (IMP), designed in the 1960s by Bolt, Beranek and …", "num_citations": "37\n", "authors": ["1594"]}
{"title": "ZB 2000: Formal Specification and Development in Z and B: First International Conference of B and Z Users, York, UK, August 29 – September 2, 2000, Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the First International Conference of B and Z Users, ZB 2000, held in York, UK in August/September 2000. The 25 revised full papers presented together with four invited contributions were carefully reviewed and selected for inclusion in the book. The book documents the recent advances for the Z formal specification notion and for the B method; the full scope, ranging from foundational and theoretical issues to advanced applications, tools, and case studies, is covered.", "num_citations": "35\n", "authors": ["1594"]}
{"title": "Test conditions for fault classes in Boolean specifications\n", "abstract": " Fault-based testing of software checks the software implementation for a set of faults. Two previous papers on fault-based testing [Kuhn 1999; Tsuchiya and Kikuno 2002] represent the required behavior of the software as a Boolean specification represented in Disjunctive Normal Form (DNF) and then show that faults may be organized in a hierarchy. This article extends these results by identifying necessary and sufficient conditions for fault-based testing. Unlike previous solutions, the formal analysis used to derive these conditions imposes no restrictions (such as DNF) on the form of the Boolean specification.", "num_citations": "34\n", "authors": ["1594"]}
{"title": "Wiki software and facilities for museums\n", "abstract": " • Marshall McLuhan–“the medium is the message” and “global village” in the 1960s• WELL (Whole Earth'Lectronic Link)–started in 1985", "num_citations": "33\n", "authors": ["1594"]}
{"title": "A ProCoS II Project description: ESPRIT Basic Research project 7071\n", "abstract": " An overview of the current and planned activities of the ESPRIT Basic Research ProCoS II project (no. 7071) on\\Provably Correct Systems\" is presented. This is a follow-on project to ProCoS (no. 3104) previously announced in the Bulletin of the EATCS 3] and subsequently reported elsewhere (eg, see 2, 4, 30]). A selected bibliography for both phases of the project is included.", "num_citations": "33\n", "authors": ["1594"]}
{"title": "Formal methods and software safety\n", "abstract": " The safety of software is becoming increasingly important as computers pervade control systems on which human life depends. Whilst hardware has become significantly more reliable over the years, the same cannot be said of software. This has become more complex and methods to ensure its correctness have been slow in development. One approach is to mathematically verify software in such systems. This paper investigates the industrial use of these techniques, their advantages and disadvantages, and the introduction of standards and their recommendations concerning formal methods in this area. The cost of safety is also considered.", "num_citations": "33\n", "authors": ["1594"]}
{"title": "Formal specification in Z as a design and documentation tool\n", "abstract": " A general specification language, Z, based on set theory and developed at Oxford University is presented. A major advantage of a formal notation is that it is precise and unambiguous and thus the formal notation always provides the definitive description in the case of any misunderstanding. A number of examples are discussed, including network services, window systems, and microprocessor instruction sets. This paper is split into two main parts. The first half deals with the nature of formal specification and why it should be used. Additionally, a brief introduction to Z and how it is used is also presented in general terms, without covering the notation itself. The second half of the paper deals with the experiment gained using Z for the design and documentation of network services and during some case studies of existing systems. Finally some conclusions are drawn about the advantages and disadvantages of using …", "num_citations": "33\n", "authors": ["1594"]}
{"title": "An approach to verifiable compiling specification and prototyping\n", "abstract": " A compiler may be specified as a set of theorems, each describing how a construct in the programming language is translated into a sequence of machine instructions. The machine may be specified as an interpreter written in the programming language itself. Using refinement algebra, it can then be verified that interpreting a compiled program is the same or better than executing the original source program. The compiling specification is very similar to a logic program and thus a prototype compiler (and interpreter) may easily be produced in a language such as Prolog. A subset of the occam programming language and the transputer instruction set are used to illustrate the approach. An advantage of the method is that new programming constructs can be added without necessarily affecting existing development work.", "num_citations": "32\n", "authors": ["1594"]}
{"title": "Smart cities and cultural heritage – review of developments and future opportunities\n", "abstract": " Soja & Kanai (2006) use the terms “global city region” to refer to “a new metropolitan form characterised by sprawling polycentric networks of urban centres …” Such networks are becoming identified with both the potential and the reality of ‘smart’ city infrastructures of connected transportation, financial, energy, health, information and cultural systems.", "num_citations": "30\n", "authors": ["1594"]}
{"title": "Web-based discussion groups at stake: The profile of museum professionals online\n", "abstract": " Online forums help in stimulating debates and reflection on a wide range of cultural topics, as well as providing answers for museum professionals working in specialised areas. The main objective of this paper is to concentrate on the relevance of individuals interacting virtually within an informal knowledge setting, from which to judge the value of Web‐based discussion groups. However, little is known about how museum‐related forums target their audience and which subjects are of real interest to them. Arising from the statistical results of an international survey of users of online museum forums, the authors have investigated the users’ socio‐demographic profile, their content preference, and favourite Web‐based discussions (e.g. e‐mail lists, newsgroups, forums). The outcome of the collected data should be useful in further binding together the worldwide museum community, as there is great scope for …", "num_citations": "30\n", "authors": ["1594"]}
{"title": "Web access to cultural heritage for the disabled\n", "abstract": " Physical disabled access is something that most cultural institutions such as museums consider very seriously. Indeed, there are normally legal requirements to do so. However, online disabled access is still a relatively novel and developing field. Many cultural organizations have not yet considered the issues in depth and web developers are not necessarily experts either. The interface for websites is normally tested with major browsers, but not with specialist software like text to audio converters for the blind or against the relevant accessibility and validation standards. We consider the current state of the art in this area, especially with respect to aspects of particular importance to the access of cultural heritage.", "num_citations": "29\n", "authors": ["1594"]}
{"title": "An animatable operational semantics of the Verilog Hardware Description Language\n", "abstract": " An operational semantics of a significant subset of the Verilog hardware description language (HDL) is presented. The semantics is encoded using the logic programming language Prolog in a literate programming style. This allows the associated documentation to be maintained in step with the semantics, and the printed version to be presented in a standard mathematical operational semantics style. It also enables the semantics to be directly animated using a Prolog interpreter. Using this approach allows the exploration of sometimes subtle behaviours of parallel programs and the possibility of rapid changes or additions to the semantics of the language covered that could be missed otherwise. In addition, it provides and extra check on the validity of the operational semantics.", "num_citations": "29\n", "authors": ["1594"]}
{"title": "From programs to object code and back again using logic programming: Compilation and decompilation\n", "abstract": " A compiler may be specified by a description of how each construct of the source language is translated into a sequence of object code instructions. It is possible to produce a compiler prototype almost directly from this specification in the form of a logic program. This defines a relation between allowed high‐level and low‐level program constructs. Normally a high‐level program is supplied as input to a compiler and object code is returned. Because of the declarative nature of a logic program, it is possible for the object code to be supplied and the allowed high‐level programs returned, resulting in a decompiler, provided enough information is available in the object code. This paper discusses the problems of adopting such an approach in practice. A simple compiler and decompiler are presented in full as an example in the logic programming language Prolog, together with some sample output. The possible …", "num_citations": "29\n", "authors": ["1594"]}
{"title": "Time interval semantics and implementation of a real-time programming language\n", "abstract": " The authors present a real-time programming language, including concurrency, which could be used in the formal development of embedded systems. The semantics of the language is provided in the form of a time interval semantics and also a number of algebraic refinement laws. The laws allow convenient reasoning and transformation of programs. In particular, a compiler for a sequential subset of the language is defined as a set of theorems relating high-level program constructs to a low-level machine specified as an interpreter in the high-level language. In addition, a prototype compiler may be produced very directly from Ihe lheorems in Ihe form of a logic program.", "num_citations": "28\n", "authors": ["1594"]}
{"title": "Typed assembler for a RISC crypto-processor\n", "abstract": " Our general purpose crypto-processor runs RISC machine code in an encrypted environment, reading encrypted inputs and generating encrypted outputs while maintaining data encrypted in memory. Its intended use is secure remote processing. However, program addresses are processed unencrypted, resulting in a mix of encrypted and unencrypted data in memory and registers at any time. An aspect of compiling for it is typing the assembler code to make sure that those instructions that expect encrypted data always get encrypted data at execution time, and those that expect unencrypted data get unencrypted data. A type inference system is specified here and transformed into an executable typing algorithm, such that a type-checked asembler program is guaranteed type-safe.", "num_citations": "27\n", "authors": ["1594"]}
{"title": "Experience teaching Z with tool and web support\n", "abstract": " This short paper describes experiences of presenting the formal Z notation on one and later two course modules to computer science undergraduates, especially with respect to providing supporting web-based resources and using tool support. The modules were part of a more general course unit on formal methods.", "num_citations": "27\n", "authors": ["1594"]}
{"title": "Z on the web using Java\n", "abstract": " Displaying the formal Z notation within a World Wide Web browser using standard HTML (HyperText Markup Language) pages is problematic because of the non-standard fonts used in Z, making it difficult to view Z documents on-line for some. This paper presents a solution to this problem. The formal text is formatted using a specially developed Java applet where the Z specification to be displayed is specified as a parameter to the applet, following the Z Interchange Format in the draft Z standard. A separate Java application program may be used to create and edit the Z specification. Other possible solutions and future directions are also discussed.", "num_citations": "27\n", "authors": ["1594"]}
{"title": "Formal specification and documentation of microprocessor instruction sets\n", "abstract": " The specification language Z (“zed”), based on set theory, has been used to define a microprocessor based system in a formal notation. The 8-bit Motorola 6800 was chosen as an example because of its simplicity. Memory configuration and interrupts were included. This paper presents parts of this specification. The use of a formal description language allows the possibility of verification of the instruction set. Z could also be used at the design stage. Additionally, the use of Z combined with informal text is sufficently readable for the specification to be used for documentation purposes. With the experience gained, a more complicated or a completely new microprocessor could now be attempted.", "num_citations": "27\n", "authors": ["1594"]}
{"title": "To formalize or not to formalize\n", "abstract": " It may seem strange to have two academics contributing to such a roundtable. However, our recent work in editing a collection of essays on the industrial application of formal methods has brought us into contact with a wide range of industrial projects, giving us some useful insights. 1 Broadly speaking, we can identify four reasons for industry's reluctance to take formal methods to heart.MISCONCEPTIONS OF MYTHS. Claims that formal methods can guarantee correct hardware and software, eliminate the need for testing, and so on have led some to believe that formal methods are something almost magical. 2 Similarly, and even more significantly, myths that formal methods are difficult to use, delay the development process and raise development costs have led many to believe that formal methods are not for them. We hope that the examples in our study will help to dispel some of these myths.", "num_citations": "26\n", "authors": ["1594"]}
{"title": "Curating digital life and culture: Art and information\n", "abstract": " The space between digital life and real life continues to fade and nowhere is this more apparent than in arts and cultural contexts. Facilitated by digital capture and curation, social media, the network, Internet, and the web, these forces combine to empower artists to be digital curators of their own work, giving voice and narration to their artistic expression. In the paper entitled Digitalism: the New Realism, the authors focus on how digital tools and technology have changed ways of doing, knowing, and being, while here we look at how today’s digital landscape is changing ways of artistic expression, narration, communication, and human interaction. The growing use of digital tools and technology in the arts and culture is dramatically transforming traditional curatorial practice and by extension archival practice, so that we are moving from a gatekeeping model to an open model steeped in digital relationships across global networks and the Internet. As we immerse ourselves in the digital world, where anyone with a smartphone can be a digital curator and marshal a range of Internet services, such as Instagram, Pinterest, Twitter, Facebook, YouTube, and more specifically for example Behance (for online portfolios), artists are enabled to freely engage and interact with their audience using to their advantage crowdsourcing, “likes”, chat, blogs, games and email. Emerging artists are particularly expert digitally and are able to curate their life and work directly, living naturally between physical and digital states. To demonstrate this, our study presents specific examples of how artists and GLAM (Galleries, Libraries, Archives, and Museum) institutions are …", "num_citations": "25\n", "authors": ["1594"]}
{"title": "A formal analysis of MCDC and RCDC test criteria\n", "abstract": " The Modified Condition Decision Coverage (MCDC) test criterion is a mandatory requirement for the testing of avionics software as per the DO‐178B standard. This paper presents a formal analysis for the three different forms of MCDC. In addition, a recently proposed test criterion, Reinforced Condition Decision Coverage (RCDC), has also been investigated in comparison with MCDC. In contrast with the earlier analysis approaches that have been based on empirical and probabilistic models, the principles of Boolean ogic are used here to study the fault detection effectiveness of the MCDC and RCDC criteria. Based on the properties of Boolean specifications, the analysis identifies the detection conditions for six kinds of faults. The results allow the measurement of the effort required in testing and the effectiveness of generated test sets satisfying the MCDC and RCDC criteria. Copyright © 2004 John Wiley & Sons …", "num_citations": "25\n", "authors": ["1594"]}
{"title": "Animating the Semantics of VERILOG using Prolog\n", "abstract": " Eclogue: 1 The logic programming language Prolog is used to provide a rapid-prototype simulator for the VERILOG Hardware Description Language (HDL). The simulator is based on an operational semantics of a significant subset of the language. Using this approach allows the exploration of sometimes subtle behaviours of parallel programs and the possibility of rapid changes or additions to the semantics of the language covered. It also acts as a check on the validity of the original operational semantics.", "num_citations": "25\n", "authors": ["1594"]}
{"title": "Hardware compilation\n", "abstract": " Chapters 8 and 9 showed how to design a microprocessor using formal methods, and HOL in particular, in a relatively conventional manner. This chapter presents a novel approach to compiling a program written in a subset of Occam into a normal form close to a netlist of simple digital components, suitable for loading into a Field-Programmable Gate Array (FPGA). This allows the possibility of repeatably generating different provably correct microprocessor designs, by compiling an interpreter written in Occam which specifies the desired operation of the processor. A simple state-machine model is adopted for specifying the behaviour of a synchronous circuit, where it is assumed that the longest time delay in the combinational circuitry is shorter than the length of a clock cycle, and the observable state includes the control path and the data path of the circuit. We identify the behaviour of a circuit with a normal form …", "num_citations": "25\n", "authors": ["1594"]}
{"title": "Life in code and digits: When Shannon met Turing\n", "abstract": " Claude Shannon (1916–2001) is regarded as the father of information theory. Alan Turing (1912–1954) is known as the father of computer science. In the year 1943, Shannon and Turing were both at Bell Labs in New York City, although working on different projects. They had discussions together, including about Turing’s “Universal Machine,” a type of computational brain. Turing seems quite surprised that in a sea of code and computers, Shannon envisioned the arts and culture as an integral part of the digital revolution – a digital DNA of sorts. What was dreamlike in 1943, is today a reality, as digital representation of all media, accounts for millions of “cultural things” and massive music collections. The early connections that Shannon made between the arts, information, and computing, intuit the future that we are experiencing today. This paper considers foundational aspects of the digital revolution, the current state, and the possible future. It examines how digital life is increasingly becoming part of real life for more and more people around the world, especially with respect to the arts, culture, and heritage.", "num_citations": "24\n", "authors": ["1594"]}
{"title": "Decompilation\n", "abstract": " Decompilation | The REDO compendium ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksThe REDO compendium: reverse engineering for software maintenanceDecompilation chapter Decompilation Share on Authors: Jonathan P. Bowen profile image JP Bowen View Profile , Peter T. Breuer profile image PT Breuer View Profile Authors Info & Affiliations Publication: The REDO compendium: reverse engineering for software maintenanceApril 1993 Pages 131–138 1citation 0 Downloads Metrics Total Citations1 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get Citation Alerts New Citation Alert added! This alert has been …", "num_citations": "24\n", "authors": ["1594"]}
{"title": "Formal specification of the ProCoS/SAFEMOS instruction set\n", "abstract": " Two collaborative projects, the European ESPRIT BRA ProCoS project and the UK IED safemos project, are currently investigating methods to prove software and hardware systems correct at a number of different levels of abstraction. Both projects intend to concentrate on subsets of Occam, and the transputer instruction set. The projects will aim to use the same machine language so that results obtained on both projects will be compatible. The initial selection of the projects (a simple subset of the transputer) is presented using the specification language Z. The role of the specification in the two projects is explained and the benefits and drawbacks of such a specification are discussed.", "num_citations": "24\n", "authors": ["1594"]}
{"title": "Formalization of control-flow criteria of software testing\n", "abstract": " This paper describes an approach to formalization of criteria of complex computer systems software testing. A brief review of control-flow criteria is introduced. As a formal language for describing the criteria, the Z notation is selected. Z schemas are presented for definitions of the following criteria: statement coverage, decision coverage, condition coverage, decision/condition coverage, full predicate coverage, modified condition/decision coverage, and multiple condition coverage. This characterization could help in the correct understanding of different types of testing and also the correct application of a desired testing regime.", "num_citations": "23\n", "authors": ["1594"]}
{"title": "EVA London 2016: Electronic Visualisation and the Arts\n", "abstract": " The Electronic Visualisation and the Arts London 2016 conference (EVA London 2016) is co-sponsored by the Computer Arts Society (CAS) and BCS, the Chartered Institute for IT, of which the CAS is a specialist group. Since 1990, the EVA conference has established itself as one of the most innovative and interdisciplinary conferences in the field of digital visualisation. The papers in this volume touch on music, performance, arts, visualisation, interdisciplinarity, animation, cultural heritage, 3D scanning, imaging, virtual tour, virtual heritage, museum, as well as other interdisciplinary areas. The latest research by established scholars, early career researchers, practitioners, and students can be found here.", "num_citations": "22\n", "authors": ["1594"]}
{"title": "Support for teaching formal methods\n", "abstract": " This report describes a growth path for the area referred to as formal methods within the computing education community. We define the term formal methods and situate it within our field by highlighting its role in Computing Curricula 1991, Computing Curricula 2001, and the SoftWare Engineering Body Of Knowledge (SWEBOK). The working group proposes an enhancement to an existing web resource, which is a rich collection of materials and links related to formal methods. The new resource is designed to provide a bridge between the general computing education community and the formal methods community. The goal is to allow the latter to provide useful support for the former for the ultimate benefit of all of our students. Eventually, the working group aspires to see the concepts of formal methods integrated seamlessly into the computing curriculum so that it is not necessary to separate them in our discussions.", "num_citations": "22\n", "authors": ["1594"]}
{"title": "From programs to object code using logic and logic programming\n", "abstract": " A compiler may be specified by a description of how each construct of the source language is translated into a sequence of object code instructions. If the machine that interprets the object code is specified in the source language itself, then the compiler may be verified using algebraic laws about the programming language constructs. By adopting a subset of the programming language occam, we can benefit from the large number of existing laws which have already been proved for this language.               The compiling specification theorems are all Horn clauses in general. Thus it is possible to produce an executable compiler prototype almost directly from this specification in the form of a logic program. The target object code for the transputer has variable-length instruction sequences. Thus in some cases it is necessary to transform the theorems into a form which can be more efficiently executed by …", "num_citations": "22\n", "authors": ["1594"]}
{"title": "Alan Turing: Virtuosity and visualisation\n", "abstract": " Alan Turing (1912–1954) has been increasingly recognised as an important mathematician who, despite his short life, developed mathematical ideas that today have led to foundational aspects of computer science, especially with respect to computability, artificial intelligence and morphogenesis (the growth of biological patterns, important in mathematical biology). Some of Turing’s mathematics and related ideas can be visualised in interesting and even artistic ways, aided using software. In addition, a significant corpus of the historical documentation on Turing can now be accessed online as a number of major archives have digitised material related to Turing. This paper introduces some of the major scientific work of Turing and ways in which it can be visualised, often artistically. Turing’s fame has, especially since his centenary in 2012, reached a level where he has had a cultural influence on the arts in general. Although the story of Turing can be seen as one of tragedy, with his life cut short, from a historical viewpoint Turing’s contribution to humankind has been triumphant.", "num_citations": "21\n", "authors": ["1594"]}
{"title": "From algebraic semantics to denotational semantics for Verilog\n", "abstract": " This paper considers how the algebraic semantics for Verilog relates with its denotational semantics. Our approach is to derive the denotational semantics from the algebraic semantics. We first present the algebraic laws for Verilog. Every program can be expressed as a guarded choice that can model the execution of a program. In order to investigate the parallel expansion laws, a sequence is introduced, indicating which instantaneous action is due to which exact parallel component. A head normal form is defined for each program by using a locality sequence. We provide a strategy for deriving the denotational semantics based on head normal form. Using this strategy, the denotational semantics for every program can be calculated. Program equivalence can also be explored by using the derived denotational semantics.", "num_citations": "21\n", "authors": ["1594"]}
{"title": "The PRECC compiler compiler\n", "abstract": " PRECC is a UNIX utility that has been designed to extend the capabilities of the familiar LEX and YACC front-end design and implementation tools. The utility is a compiler-compiler that takes unlimited lookahead and backtracking, the extended BNF notation, and parametrized grammars with (higher order) meta-parameters to the world of C programming. The generated code is standard ANSI C and isplug compatible'with LEX-generated lexical analysers prepared for YACC. In contrast to YACC, however, the generated code is modular and thus allows parts of scripts to be compiled separately and linked in incrementally. But it remains e cient in practice, and the generated code has run as fast or faster than YACC-generated code in trials with real programming language specifications.", "num_citations": "21\n", "authors": ["1594"]}
{"title": "Personalization issues for science museum Web sites and E-learning\n", "abstract": " E-learning has the potential to be a very personalized experience and can be tailored to the individual involved. So far, science museums have yet to tap into this potential to any great extent, partly due to the relative newness of the technology involved and partly due to the expense. This chapter covers some of the speculative efforts that may improve the situation for the future, including the SAGRES project and the Ingenious Web site, among other examples. It is hoped that this will be helpful to science museums and centers that are considering the addition of personalization features to their own Web site. Currently, Web site personalization should be used with caution, but larger organizations should be considering the potential if they have not already started to do so.", "num_citations": "20\n", "authors": ["1594"]}
{"title": "Experimental evaluation of the tolerance for control-flow test criteria\n", "abstract": " Fault‐detection effectiveness of coverage criteria has remained one of the controversial issues in recent years. In order to detect a fault, a test set must execute the faulty statement, cause infection of the data state and then propagate the faulty data state to bring about a failure. This paper sheds some light on the earlier contradictory results by investigating the infection aspect of coverage criteria. For a given test criterion, the number of test sets satisfying the criterion may be very large, with varying fault‐detection effectiveness. In a recent work the measure of variation in effectiveness of a test criterion was defined as ‘tolerance’. This paper presents an experimental evaluation of tolerance for control‐flow test criteria by exhaustive test set generation, wherever possible. The approach used here is complementary to earlier empirical studies that adopted analysis of some test sets using random selection techniques …", "num_citations": "20\n", "authors": ["1594"]}
{"title": "Electronic Visualisation in Arts and Culture\n", "abstract": " © Springer-Verlag London 2013", "num_citations": "19\n", "authors": ["1594"]}
{"title": "Creating online collaborative environments for museums: A case study of a museum wiki\n", "abstract": " Museums have been increasingly adopting Web 2.0 technology to reach and interact with their visitors. Some have experimented with wikis to allow both curators and visitors to provide complementary information about objects in the museum. An example of this is the Object Wiki from the Science Museum in London. Little has been done to study these interactions in an academic framework. In the field of knowledge management, the concept of “Communities of Practice” has been posited as a suitable structure in which to study how knowledge is developed within a community with a common interest in a particular domain, using a sociological approach. Previously this has been used in investigating the management of knowledge within business organizations, teachers‟ professional development, and online e-learning communities. The authors apply this approach to a museum-based wiki to assess its applicability for such an endeavour.", "num_citations": "19\n", "authors": ["1594"]}
{"title": "Online museum discussion forums: What do we have? What do we need?\n", "abstract": " Virtual communities have become increasingly popular for the general public, using electronic mailing lists, new sgroups, WWeb-based forums, chat rooms, etc. How ever, it appears that online forums are not w ell integrated into the sphere of museums. Curators have therefore not capitalized on w idening their mandate and engaging visitors as w ell as museum professionals themselves in effective online interaction.This paper presents a survey of existing museum-related forums available for discussion by museum professionals and the general public w ith an interest in museums. Some of the softw are and facilities available to museums for the establishment and maintenance of mailing lists, WWeb-based discussion forums and more innovative service like WWeb logs, often freely available, are also explored. A museum discussion forum facility has been implemented experimentally (see under http://forums. museophile. net) using open source softw are. As w ell as local forums, this integrates topical information of interest to museum personnel from aw ide range of online sources. Finally, some thoughts for the future are discussed.", "num_citations": "19\n", "authors": ["1594"]}
{"title": "An approach to the specification and verification of a hardware compilation scheme\n", "abstract": " The use of Field Programmable Gate Arrays (FPGA) to produce custom hardware circuits rapidly using a completely software-based process is becoming increasingly widespread. Specialized Hardware Description Languages (HDL) are used to describe and develop the required circuits. In this paper, we advocate using an even more general purpose programming language, based on Occam, for the automatic compilation of high-level programs to low-level circuits. The parallel constructs of Occam can map directly to hardware as conveniently as to software, with potentially dramatic speed-up of highly parallel algorithms. We demonstrate that the compilation process can be verified using algebraic refinement laws, increasing the confidence in its correctness. Verification is particularly important in high-integrity systems where safety or security is paramount. A prototype compiler has also been produced …", "num_citations": "19\n", "authors": ["1594"]}
{"title": "The Formal Specification of a Microprocessor Instruction Set\n", "abstract": " The specification language Z is used to define a microprocessor based system in a formal notation. The Motorola 6800 8-bit microprocessor is chosen as an example. Its simplicity allows the entire instruction set to be covered. Memory configuration and interrupts are also included. The use of a formal description language allows the possibility of verification of the instruction set. Additionally the use of Z combined with informal text is sufficiently readable for the specification to be used for documentation purposes.", "num_citations": "19\n", "authors": ["1594"]}
{"title": "Gender issues in HCI design for web access\n", "abstract": " We consider the design and provision of Web sites, with respect to gender issues, from various perspectives. A general view of the field is given, and educational issues are specifically considered in relation to gender differences in the use of IT as an effective educational aid, especially by children. Human-computer interaction (HCI) models at different levels of abstraction are presented, together with how gender issues could impinge at each of these levels. A number of examples, both from the commercial and cultural fields, are discussed as design case studies of home pages for Web sites that exhibit gender-related orientation. Finally, looking to the future, online gaming is discussed in the context of usage. It is hoped that the guidance provided here will help minimize any gender discrimination on Web sites with respect to their interfaces, increasing general accessibility in the process.", "num_citations": "18\n", "authors": ["1594"]}
{"title": "Visiteurs virtuels et musées virtuels\n", "abstract": " Les musées ont développé de nouveaux moyens de communication afin de mieux rayonner au niveau international. Grâce à l'Internet, les visiteurs de musées d'art peuvent désormais prendre connaissance des expositions sans avoir à se déplacer, parce que les musées sont désormais accessibles à partir de notre environnement physique immédiat. Bien entendu, les services qu'offrent les musées en ligne présentent une démarche différente de celle des musées réels.L'objet de cet article est de montrer comment certains musées ont utilisé l'Internet pour mettre en ligne leurs collections, et comment ils sont susceptibles d'utiliser cette technologie dans le futur.", "num_citations": "18\n", "authors": ["1594"]}
{"title": "The World Wide Web and the Virtual Library museums pages\n", "abstract": " The World Wide Web (WWW) has been expanding exponentially since it was launched. It provides a unifying way to navigate and present information around the world in seconds using the Internet computer network. Many types of organization have been caught up in the revolution and are struggling to cope with the effects and keep pace with the development of the technology. One such community is that of museums. This paper presents the way museums are currently using the Web internationally, and how their use could develop in the future. Included is a description of the Virtual Library museums pages (VLmp), a leading directory of online museums, recently adopted by the International Council of Museums. Some of the ‘virtual’ visitor statistics are also presented and discussed.", "num_citations": "18\n", "authors": ["1594"]}
{"title": "States of being: Art and identity in digital space and time\n", "abstract": " This one-day Symposium explored themes of personhood, modernity and digital art, bringing together speakers from a range of disciplines to consider technology, artistic practice and society. It seeks a renewed consideration of the role of art in illuminating human identity in a positive relation with technology, and its transformative effects upon space and time. The concerns for the role of art amidst the forces of a post-modern world are influenced by important legacies of the past, by which ideas about human identity and difference have been made meaningful in the relation of history and technology. In the frequently transient and conflicting forces of humanness and forces of modernity, the digital world of the arts emerges as a means by which new ideas of space and time can be considered, with new perspectives of human identity seen as states of being, towards the possibilities of experience, technology, individuality and society.", "num_citations": "17\n", "authors": ["1594"]}
{"title": "Alan Turing: Founder of computer science\n", "abstract": " In this paper, a biographical overview of Alan Turing, the 20th century mathematician, philosopher and early computer scientist, is presented. Turing has a rightful claim to the title of ‘Father of modern computing’. He laid the theoretical groundwork for a universal machine that models a computer in its most general form before World War II. During the war, Turing was instrumental in developing and influencing practical computing devices that have been said to have shortened the war by up to two years by decoding encrypted enemy messages that were generally believed to be unbreakable. After the war, he was involved with the design and programming of early computers. He also wrote foundational papers in the areas of what are now known as Artificial Intelligence (AI) and mathematical biology shortly before his untimely death. The paper also considers Turing’s subsequent influence, both scientifically …", "num_citations": "17\n", "authors": ["1594"]}
{"title": "Algebraic approach to linking the semantics of web services\n", "abstract": " Web services have become more and more important in these years, and BPEL4WS (BPEL) is a de facto standard for the Web service composition and orchestration. It contains several distinct features, including the scope-based compensation and fault handling mechanism. We have considered the operational semantics and denotational semantics for BPEL, where a set of algebraic laws can be achieved via these two models respectively. In this paper, we consider the inverse work, deriving the operational semantics and denotational semantics from algebraic semantics for BPEL. In our model, we introduce four types of typical programs, by which every program can be expressed as the summation of these four types. Based on the algebraic semantics, the strategy for deriving the operational semantics is provided and a transition system is derived by strict proof. This can be considered as the soundness …", "num_citations": "17\n", "authors": ["1594"]}
{"title": "Formalization and assessment of regulatory requirements for safety-critical software\n", "abstract": " Regulatory requirements, as opposed to requirements for a particular system, have a generic nature, are applicable to a wide range of systems and are the basis for certification or licensing process. The important tasks in requirement engineering are resolving requirements inconsistencies between regulators and developers of safety-critical computer systems and the validation of regulatory requirements. This paper proposes a new approach to the regulatory process, including the use of formal regulatory requirements as a basis for the development of software assessment methods. We address the differences between prescriptive and nonprescriptive regulation, and suggest a middle approach. The notion of a normative package is introduced as the collection of documents to be used by a regulator and provided to a developer. It is argued that the normative package should include not only regulatory …", "num_citations": "17\n", "authors": ["1594"]}
{"title": "Advances in Universal Web Design and Evaluation: Research, Trends and Opportunities: Research, Trends and Opportunities [chapter]\n", "abstract": " As the Internet has become more pervasive, information disseminated through the Web grows in an exponential rate, creating a call for more universal design so more people from different backgrounds are able to access this information. Advances in Universal Web Design and Evaluation: Research, Trends and Opportunities covers various aspects of universal Web design from disabilities to cultural differences, including various aspects of Web design: prototyping, analysis, and evaluation with an emphasis on universal and inclusive design. Advances in Universal Web Design and Evaluation: Research, Trends and Opportunities highlights several prominent issues in this area such as ageing and gender issues and provides the basis of a framework for the development and evaluation of Web sites for people with special needs.", "num_citations": "17\n", "authors": ["1594"]}
{"title": "Weaving the museum web: The Virtual Library museums pages\n", "abstract": " Museums have been discovering the Internet over the past few years like many other information provision sectors. Rather uniquely, they span both educational and commercial sectors, with a concentration of the original objects even in this virtual world. In 1994 the author developed the Virtual Library museums pages (VLmp), an online international distributed museum directory. This is part of the WWW Virtual Library and is also supported by the International Council of Museums (ICOM). The directory is probably still the foremost such resource in this area, but commercial pressures are building, and the resource must develop to ensure its long‐term future. This paper explores the important developments so far, the current situation especially with regard to automatically collected virtual visitor statistics, and possible future directions for the VLmp directory and related resources.", "num_citations": "17\n", "authors": ["1594"]}
{"title": "The Virtual Library museums pages (VLmp): Whence and whither?\n", "abstract": " The Virtual Library museums pages (VLmp) were started as a personal project in 1994, forming part of the Virtual Library distributed information repository initiated by the original inventors of the World Wide Web. The VLmp resource provides a leading directory of online museums and associated resources which has grown exponentially in size and use since its inception. In 1996 the directory was adopted by the International Council of Museums (ICOM), helping to ensure its long-term future. This presentation provides a brief history of the development and use of VLmp, and considers its possible future directions.", "num_citations": "17\n", "authors": ["1594"]}
{"title": "Of museums and digital culture: A landscape view\n", "abstract": " The digital world is full of dubious and ephemeral material, much of it dubbed “fake news” by some people. On the other hand, museums are institutions that have much worthwhile content and stories based around their collections. The Internet and web have been and will continue to be a wonderful resource for outreach from museums into the world, without geographical boundaries. Museums are now part of the digital culture of everyday life. With this in mind, a new book (Giannini & Bowen 2019) is planned to cover the interleaving of museums and digital culture with respect to a number of different aspects and viewpoints.", "num_citations": "16\n", "authors": ["1594"]}
{"title": "Linking operational semantics and algebraic semantics for a probabilistic timed shared-variable language\n", "abstract": " Complex software systems typically involve features like time, concurrency and probability, with probabilistic computations playing an increasing role. However, it is currently challenging to formalize languages incorporating all those features. Recently, the language PTSC has been proposed to integrate probability and time with shared-variable concurrency (Zhu et al. (2006, 2009) [51], [53]), where the operational semantics has been explored and a set of algebraic laws has been investigated via bisimulation. This paper investigates the link between the operational and algebraic semantics of PTSC, highlighting both its theoretical and practical aspects.The link is obtained by deriving the operational semantics from the algebraic semantics, an approach that may be understood as establishing soundness of the operational semantics with respect to the algebraic semantics. Algebraic laws are provided that suffice to …", "num_citations": "16\n", "authors": ["1594"]}
{"title": "From a Community of Practice to a Body of Knowledge: A case study of the formal methods community\n", "abstract": " A Body of Knowledge (BoK) is an ontology for a particular professional domain. A Community of Practice (CoP) is the collection of people developing such knowledge. In the paper we explore these concepts in the context of the formal methods community in general and the Z notation community, as has been supported by the Z User Group, in particular. The existing SWEBOK Software Engineering Body of Knowledge is considered with respect to formal methods and a high-level model for the possible structure of of a BoK is provided using the Z notation.", "num_citations": "16\n", "authors": ["1594"]}
{"title": "Abstract State Machines, B and Z: First International Conference, ABZ 2008, London, UK, September 16-18, 2008. Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the First International Conference of Abstract State Machines, B and Z, ABZ 2008, held in London, UK, in September 2008. The conference simultaneously incorporated the 15th International ASM Workshop, the 17th International Conference of Z Users and the 8th International Conference on the B Method. The 44 revised full papers presented together with 4 invited contributions were carefully reviewed and selected from numerous submissions. The conference fosters the cross-fertilization of three rigorous methods for the design and analysis of hardware and software systems-both in academia and industry-namely Abstract State Machines, B, and Z. Covering a wide range of research spanning from theoretical and methodological foundations to tool support and practical applications, the contributions are organized in topical sections on abstract state machines, B papers, Z papers, ABZ short papers, and the papers of the Verified Software Repository Network (VSR-net) workshop.", "num_citations": "16\n", "authors": ["1594"]}
{"title": "Coded communication: Digital senses and aesthetics, merging art and life\n", "abstract": " This one-day symposium framed several central questions in digital practice and digital theory, examining historical and contemporary themes across art, science and the humanities. Art has been transformed by the digital age, changing the tools and processes of practice, moving to digital expressions and digital seeing. These changes are balanced by the recurrent questions of the human condition, and of the ways that art both defines and transcends its time. In what ways does digital art address the social, cultural and historical debates of this time, without being simply determined by its technologies? And how can emergent disciplines around digital aesthetics and the digital humanities converse with the work of artists, innovators and technologists? In what ways does the new digital palette afforded by contemporary media open new ways of seeing, sensing and understanding the world? The symposium organisers invited a range of artists and theorists to discuss these themes, framed in the broader contexts of electronic visualisation and digital art of the EVA London conference.", "num_citations": "15\n", "authors": ["1594"]}
{"title": "Certifying machine code safe from hardware aliasing: RISC is not necessarily risky\n", "abstract": " Sometimes machine code turns out to be a better target for verification than source code. RISC machine code is especially advantaged with respect to source code in this regard because it has only two instructions that access memory. That architecture forms the basis here for an inference system that can prove machine code safe against ‘hardware aliasing’, an effect that occurs in embedded systems. There are programming memes that ensure code is safe from hardware aliasing, but we want to certify that a given machine code is provably safe.", "num_citations": "15\n", "authors": ["1594"]}
{"title": "Visualising virtual communities: From Erdős to the arts\n", "abstract": " Monitoring communities has become increasingly easy on the web as the number of visualisation tools and amount of data available about communities increase. It is possible to visualise connections on social and professional networks such as Facebook in the form of mathematical graphs. It is also possible to visualise connections between authors of papers. In particular, Microsoft Academic Search now has a large corpus of information on publications, together with author and citation information, that can be visualised in a number of ways. In mathematical circles, the concept of the \"Erd\\H{o}s number\" has been introduced, in honour of the Hungarian mathematician Paul Erd\\H{o}s, measuring the \"collaborative distance\" of a person away from Erd\\H{o}s through links by co-author. Similar metrics have been proposed in other fields, including acting. The possibility of exploring and visualising such links in arts fields is proposed in this paper.", "num_citations": "15\n", "authors": ["1594"]}
{"title": "Alan Turing\n", "abstract": " Alan Turing Page 1 Alan Turing Prof. Jonathan P. Bowen Professor of Computer Science Birmingham City University www.jpbowen.com “Founder of computer science” Page 2 Alan Turing, The purpose of Ordinal Logics, 1938 “Mathematical reasoning may be regarded rather schematically as the exercise of a combination of two facilities, which we may call intuition and ingenuity.” Page 3 Alan Turing: The Enigma Definitive biography by Andrew Hodges, Wadham College, Oxford. 1st edition, 1983. Centenary edition, 2012. Page 4 Overview • Alan Mathison Turing, OBE, FRS (23 June 1912 – 7 June 1954) • Mathematician and codebreaker • “Founder/father of computer science” • Centenary meetings at Bletchley Park, Cambridge, Manchester, Oxford, etc., in 2012 • Increasingly in the public consciousness Page 5 • Cake at Oxford centenary meeting. Happy Birthday Alan Turing! (2012) Page 6 Turing citations Google …", "num_citations": "15\n", "authors": ["1594"]}
{"title": "Dulwich OnView: An art museum-based virtual community generated by the local community\n", "abstract": " Dulwich OnView  (DOV) is a museum blog magazine run by the Friends of Dulwich Picture Gallery (DPG) for the surrounding community in south London. It includes articles concerning both the gallery and the local community, helping to promote DPG in the process, in a fast-moving informal way that complements the official DPG website. For example, a competition for online artworks has been undertaken using DOV in association with a temporary exhibition of works by the 20 th  century British artist Paul Nash. This paper provides an overview of the progress of the blog, since its launch in January 2008, including statistical information. A redesign of the DOV blog has been undertaken in 2010, aimed at a better structuring of the increasing number of articles into categories and the integration between the more formal and static DPG website and the more informal and dynamic DOV website, with suitable interconnecting links. As part of the redesign process for the DOV website a usability review was conducted. DOV has also been part of a wider study, investigating a number of varied museum-based virtual communities in an art education context using the social science Community of Practice (CoP) framework.", "num_citations": "15\n", "authors": ["1594"]}
{"title": "Continuity aspects of embedded reconfigurable computing\n", "abstract": " In embedded systems, dynamically reconfigurable computing can be partially modified at runtime without stopping the operation of the whole system. In this paper, we consider a reorganization mechanism for dynamically reconfigurable computing in embedded systems to guarantee that invariants of the design are respected. This reorganization is considered as a visual transformation of the logical configuration by the formulated rules. The invariant is recognized under the restructuring of the configuration using reconfiguration rules.", "num_citations": "15\n", "authors": ["1594"]}
{"title": "Smart Cities and Digital Culture: Models of Innovation\n", "abstract": " A smart city is an urban area that broadly refers to a collective model in which technological advancements are used to enhance systemic capabilities aiming to enhance competitiveness, effectiveness, quality of life and sustainability. A major focus of the chapter is a review of smart city platforms and participatory-centric approaches and their potential translation to innovations across digital culture and smart city developments. The results provide a landscape view and further scope for identifying models of innovation and future opportunities in developing smart digital culture services and evolving directions, particularly within the museum sector.", "num_citations": "14\n", "authors": ["1594"]}
{"title": "Avoiding hardware aliasing: Verifying RISC machine and assembly code for encrypted computing\n", "abstract": " 'Hardware aliasing' classically arises when a processor through failure or design has fewer bits than required to address each memory location uniquely, and also - nowadays - in the context of homomorphically encrypted computing. In such contexts, different physical locations may sporadically be accessed by the same address due to factors not directly under the control of the programmer but still deterministic in nature. We check RISC machine and assembly code to ensure that each memory address is calculated in exactly the same way at one write to and the next read from it, which allows programs to work correctly even in a hardware aliasing context.", "num_citations": "14\n", "authors": ["1594"]}
{"title": "From MC/DC to RC/DC: Formalization and analysis of control-flow testing criteria [reprint]\n", "abstract": " This chapter describes an approach to the formalization of existing criteria used in computer systems software testing and proposes a Reinforced Condition/Decision Coverage (RC/DC) criterion. This criterion has been developed from the well-known Modified Condition/Decision Coverage (MC/DC) criterion and is more suitable for the testing of safety-critical software where MC/DC may not provide adequate assurance. As a formal language for describing the criteria, the Z notation has been selected. Formal definitions in the Z notation for RC/DC, as well as MC/DC and other criteria, are presented. Specific examples of using these criteria for specification-based testing are considered and some features are formally proved. This characterization is helpful in the understanding of different types of testing and also the correct application of a desired testing regime.", "num_citations": "14\n", "authors": ["1594"]}
{"title": "The development of science museum websites: Case studies\n", "abstract": " Science museums have embraced the technology of the Web to present their resources online. The nature of the technology naturally fits with the ethos of science. This chapter surveys the history, development and features of a number of contrasting pioneering museum Web sites in the field of science that have been early adopters of the technology. This includes case studies of Web sites associated with the Natural History Museum of Los Angeles, the Museum of the History of Science in Oxford, the Science Museum in London and the completely virtual Alan Turing Home Page. The purpose is to demonstrate a diverse set of successful scientifically-oriented Web sites related to science museums and the history of science, giving an insight into Web developments in this area over the past decade.", "num_citations": "14\n", "authors": ["1594"]}
{"title": "Instant HTML Web Pages\n", "abstract": " Now anyone can create Web pages-instantly! All the source code for the Web pages described in the book is contained on the CD-ROM, allowing the reader to access and then customize their own Web pages. Thousands of businesses, professionals, and organizations are rushing to become part of the Web explosion. This book/CD-ROM package gets there-fast!--CD-ROM contains code for all the Web page examples in the book", "num_citations": "14\n", "authors": ["1594"]}
{"title": "Glossary of Z notation\n", "abstract": " Fl A Non-empty set of finite subsets AnB Set intersection AuB Set union A\\B Set difference Generalized union of a set of sets Generalized intersection of a set of sets first x First element of an ordered pair second x Second element of an ordered pair# A Size of a finite set", "num_citations": "14\n", "authors": ["1594"]}
{"title": "A brief history of algebra and computing: An eclectic Oxonian view\n", "abstract": " This can of course be solved using algebra. The first treatise on algebra was written by Diophantus of Alexandria in the 3rd century AD. The term derives from the Arabic al-jabr or literally\\the reunion of broken parts.\" As well as its mathematical meaning, the word also means the surgical treatment of fractures. It gained widespread use through the title of a book ilm al-jabr wa'l-mukabala| the science of restoring what is missing and equating like with like| written by the mathematician Abu Ja'far Muhammad (active c800 {847), who subsequently has become know as al-Kharazmi,", "num_citations": "14\n", "authors": ["1594"]}
{"title": "The World Wide Web virtual library of museums\n", "abstract": " The World Wide Web (WWW) Virtual Library of museums is an interactive directory of on-line museums on the global Internet computer network of networks. Virtual ‘visitors’ can select a ‘hyperlink’to a museum of their choice (categorised by country) and view on-line hypermedia information and exhibits provided by that museum. Since its inception in 1994, the page has received over 200,000 visits, with around a thousand a day recently, easily the most popular page at our site. The paper includes a brief introduction to this library, some of the museum sites linked to it, visitor statistics, and possible future directions.", "num_citations": "14\n", "authors": ["1594"]}
{"title": "A fully encrypted microprocessor: The secret computer is nearly here\n", "abstract": " A high-speed pre-production superscalar microprocessor that ‘works encrypted’ is described here. Data in registers, on buses, and (in consequence) in memory, is kept in encrypted form. It is intended to protect user data being processed remotely or overseen by untrusted operators.", "num_citations": "13\n", "authors": ["1594"]}
{"title": "A New York museums and Pratt partnership: Building Web collections and preparing museum professionals for the digital world\n", "abstract": " The New York Art Resources Consortium (NYARC) involves the research libraries of the Brooklyn Museum, Frick, and MoMA. Together with the Pratt Institute, the Brooklyn Museum and then NYARC have undertaken partnership projects to implement digitization of collections in a museum-education setting. This paper explores challenges including integrating digital information within the physical museum and on the Web, recognizing the crucial role this plays in user engagement. Education is a key aspect, and information on a new master program to support professionals in the interdisciplinary skills needed is also presented. Leading museums realize the importance of an integrated digital approach. The Cooper Hewitt Museum’s newly redeveloped display is presented as a model example. Educational underpinning and inventive use of digital technology, with regard for social and cultural issues, are key aspects for success.", "num_citations": "13\n", "authors": ["1594"]}
{"title": "Formal methods\n", "abstract": " For almost four decades, formal methods have been considered as a software engineering approach to developing reliable systems. Their power lies in the use of a mathematical notation to specify properties of a system, and computer computation to check correctness of the same. Although formal methods have successfully evolved over the years to meet the requirements of modern software development, their application has been relatively slow. The problem is that to be applied successfully, formal methods need both engineering skills and expert knowledge. This entry introduces formal methods in terms of formal notations and formal tools. Moreover, it concentrates on best practices that help to use them properly and thus gain from increased system reliability and cost reduction.", "num_citations": "13\n", "authors": ["1594"]}
{"title": "Virtual collaboration and community\n", "abstract": " This chapter introduces the concept of a Virtual Organization (VO), using the Internet to link geographically separated participants in an efficient and novel manner. In particular, the chapter contrasts the attributes of Project VOs and Community VOs. The former tend to be more formal and arise for a particular collaborative goal with a limited lifetime. The latter are less formal and more open-ended, with a less specific purpose, largely aimed at developing an online community as an end in itself. The features of Project and Community VOs are compared and the various technologies are discussed. Two case studies are presented as examples. This is a rapidly changing area with new technologies becoming rapidly available, but the underlying concepts and reasons for the existence of VOs in the support of virtual collaborative practice remain more stable.", "num_citations": "13\n", "authors": ["1594"]}
{"title": "PTSC: Probability, time and shared-variable concurrency\n", "abstract": " Complex software systems typically involve features like time, concurrency and probability, where probabilistic computations play an increasing role. It is challenging to formalize languages comprising all these features. In this paper, we integrate probability, time and concurrency in one single model, where the concurrency feature is modelled using shared-variable-based communication. The probability feature is represented by a probabilistic nondeterministic choice, probabilistic guarded choice and a probabilistic version of parallel composition. We formalize an operational semantics for such an integration. Based on this model we define a bisimulation relation, from which an observational equivalence between probabilistic programs is investigated and a collection of algebraic laws are explored. We also implement a prototype of the operational semantics to animate the execution of probabilistic programs.", "num_citations": "13\n", "authors": ["1594"]}
{"title": "Semantics of RTL and validation of synthesized RTL designs using formal verification in reconfigurable computing systems\n", "abstract": " The functional validation of a state-of-the-art reconfigurable computing system design is usually a laborious, ad hoc and open-ended task. It can be accomplished through two basic approaches: simulation and formal verification. In validation using a formal verification approach, it attempts to establish that the register transfer level (RTL) design synthesized from the algorithmic behavioral specification is mathematically correct. Therefore, finding the verification methods to provide accurate and fast validation easily would be very useful. In this paper, we develop a semantics based on a partial order based model (POM) for RTL and, through this semantics, propose a formal verification method to prove the correctness of the RTL synthesis result. This method can be used to achieve the following. On one hand, it can accurately verify an RTL description with respect to a behavioral specification of the system; on the other …", "num_citations": "13\n", "authors": ["1594"]}
{"title": "Generating Decompilers\n", "abstract": " Compiler compilers are in widespread use, but decompiler compilers are a more novel concept. This paper presents an approach for the decompilation of object code back to source code using a decompiler generator. An example decompilation is presented. Potential applications include reverse engineering, quality assessment, debugging and safety-critical code validation or verification.", "num_citations": "13\n", "authors": ["1594"]}
{"title": "Museums and Wikipedia\n", "abstract": " Wikipedia (http://www. wikipedia. org) is an on-line and multilingual encyclopaedia that can be interactively updated by any user. It has become an increasingly popular and comprehensive source of up-to-date information. All museums should consider ensuring that they have an entry for informational and (indirectly) promotional purposes. As a minimum, the entry should include location information, a brief overview, correct categorization within Wikipedia and a link to the museum's Web site. A more comprehensive entry could include further, more detailed information on the museum's history, collections, organization, one or more photographs, etc. It should be noted that Wikipedia entries are intended to provide an independent and informational view, so direct promotional material should be avoided and used only on the museum's own Web site. An entry on Wikipedia can help by improving search engine rankings (especially Google), directing Web users to a museum Web site, etc.Our demonstration at MW2006 is intended to give advice to museums on how to create an initial Wikipedia entry if there is none for the museum in question and how to improve the entry if one exists already. A tour of the English-language Wikipedia museums section (http://en. wikipedia. org/wiki/Category: Museums) can also be provided. It may even be possible to create and update entries during the demonstration itself.", "num_citations": "12\n", "authors": ["1594"]}
{"title": "Ordering mutants to minimise test effort in mutation testing\n", "abstract": " Mutation testing is a fault-based testing approach based on the competent programmer, and coupling effect hypotheses. One of the main difficulties faced in practice is due to the large number of mutants that can be generated for a given implementation. Earlier research to solve this problem has suggested variants of mutation testing, and finding an effective set of mutation operators. This paper presents an alternative approach for reducing the cost of testing by the identification of hierarchies among first-order mutants. The theory described here is also applicable to the quantitative assessment of testing effort and can be used to guide successive testing steps in fault-based testing.", "num_citations": "12\n", "authors": ["1594"]}
{"title": "Formalising configuration relocation behaviours for reconfigurable computing\n", "abstract": " Although the partially reconfigurable FPGA design is powerful if two different configurations were mapped at compile time to overlapping locations in the FPGA, only one of these configurations can be present in the array at any given moment. They cannot operate simultaneously. However, if somehow the final FPGA location can be determined at runtime, one or both of these overlapping configurations can be relocated to a new location that was previously unused to allow for simultaneous use. The configurations can be relocated by either rotation or shifting in an FPGA fabric. In this paper, our research has shown that the relocating configurations can be specified and reasoned formally by algebraic laws for checking whether a chip of given size and a given feasible schedule allow a feasible placement. Our examination is done on a generic partially reconfigurable FPGA and Ruby algebra is used to specify and reason in this case.", "num_citations": "12\n", "authors": ["1594"]}
{"title": "Collections of collections\n", "abstract": " In 1994 I discovered some on-line information provided by a small number of museums, mainly in the US, available on the World Wide Web (WWW), the global graphical hypermedia system which has made navigation of the Internet easy for everyone. With a wife in the museum world, and a natural affinity for collecting myself, I decided to form a personalcollection'of on-line museums, in the form of a directory with hyperlinks directly to each of the museums concerned.The inventors of the WWW, then based at CERN in Switzerland, had also started a catalogue of information available on-line around the world known as the WWW Virtual Library. Individuals were (and still are) invited to maintain pages of on-line links in specialist subjects, and I volunteered to include my collection of museums in the library. This quickly became the most popular WWW page at our site and has remained so ever since. It now receives …", "num_citations": "12\n", "authors": ["1594"]}
{"title": "A Concrete Z Grammar\n", "abstract": " This article presents a concrete grammar for the specification language Z, following as precisely as possible the BNF-like syntax description in the widely used Z Reference Manual. The grammar has been used as a starting point for several projects associated with Z. It is written in an extended BNF format for the public domain compiler-compiler PRECC. The grammar has also been used as a basis for grammars aimed at other compiler-compilers, including yacc and PCCTS. The important goal in publishing it here is to make the accepted ZRM grammar for Z publicly available in concrete form and thus to promote the production of Z-based utilities. The formalization has been tested by interpreting it standardly 1) in PRECC as a parse-tree builder, and, more abstractly, 2) as a generator of its valid phrases. In the non-standard configuration it has generated a suite of test expressions for the standard parser and some examples from that test suite are provided here. The first of these has a rigorous claim to the title of most trivial non-trivial Z specification possible, but all are good tests for any parser of Z.", "num_citations": "12\n", "authors": ["1594"]}
{"title": "Personal view: Formal methods: Epideictic or apodeictic?\n", "abstract": " If you are confused by the above title, you are in the same boat as the vast majority of software producers when confronted with a display of formal methods. The easiest option when dealing with an activity which look impenetrable and whose benefits are doubtful is to ignore it and do without This is precisely what most software developers do and not necessarily to the detriment of their business (unless this business has safety implications); witness Microsoft, which makes millions of dollars selling MS-DOS* and Windowsf without a single quantifier in sight § . Even a successful mathematical product such as Mathematica**, which supports the interactive computerbased use of mathematics, consists of the order of a million lines of C-based code produced with no formal developmentDespite the unfriendly face of some formal methods, some people do use them for commercial development We ask for what purpose …", "num_citations": "12\n", "authors": ["1594"]}
{"title": "Formal specification of window systems\n", "abstract": " Window management systems are now used extensively for user interfaces to computer systems. Part I of this monograph introduces some of the fun damental ideas in window systems using a formal notation. Part II outlines three real systems and attempts to ca. pture the essence of each system using the same formal notation and ideas introduced in Part 1. Low-level detail is avoided to keep the length to a, manageable size. In Part I, chapter 1 introduces general concepts useful for specifying pixel maps and window systems. Chapter 2 defines the raster-op function which is fundamental to many graphics operations and chapter 3 introd\\lees a simple example window system. In Part II, chapters 4-6 detail three particular window systems. Chapter 7 remarks on experience gained by formally specifying the three window systems. The formal notation used, Z, is based on set theory, and has been devel oped at the Programming Research Group in Oxford.", "num_citations": "12\n", "authors": ["1594"]}
{"title": "Art and activism at museums in a post-digital world\n", "abstract": " Once quiet places protected by walls, museums are increasingly besieged by activist groups. Spurred by social and political causes, they storm the gates bypassing the gatekeepers, to deliver their message and insist that museums become relevant, participatory and interactive, and give voice to their communities and audience. With no place to hide in a sea of digital connections, museums are challenged to find new directions and strategies for the post-digital world. This paper traces these trends, illustrating them using recent examples of art and activism at museums in New York and London, and explores strategies for museums to collaborate with their community and find common ground.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Digital Culture\n", "abstract": " We trace the foundations of digital culture  to Claude Shannon  and Alan Turing , pioneers of information theory  and computer science  including algorithms, machine learning , and artificial intelligence , demonstrating how these developments are shaping our digital life  and digital future. We examine life in code and digits in the context of digital ways of doing, knowing, being, and living, covering, for example, digital information behavior and the impacts of the convergence of all digital media , a digital tipping point at the heart of digital culture . This chapter provides the background and context for the rest of the book in the framework of museums and related cultural and heritage institutions.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "From analogue to digital in literature and art\n", "abstract": " Our increasingly digital world affects all aspects of people’s lives, including the arts, culture and heritage. The visual medium of art and the more informational medium of literature and writing have both been significantly changed in the ways in which they can reach their viewers and readers. Here we record overviews of four presentations by experts in their various fields, setting out their views and experience of topics relating to this issue.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Galois connections: Mathematics, art, and archives\n", "abstract": " Évariste Galois (1811–1832) has been increasingly recognised as an important mathematician who despite his short life developed mathematical ideas that today have led to applications in computer science (such as Galois connections) and elsewhere. Some of Galois’ mathematics can be visualised in interesting and even artistic ways, aided using software. In addition, a significant corpus of the historical documentation on Galois and his family (including his brother Alfred Galois, who was an artist), can now be accessed online as a growing number of institutional archives digitise their collections. This paper introduces some of the mathematics of Galois, ways in which it can be visualised, and also considers the issues and new opportunities with respect to visualising information on Galois and his family (including the connections between them). Although the story of Galois and his close relations can be seen as one of tragedy with lives cut short, from a historical viewpoint Évariste Galois’ contribution to humankind has been a triumph.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Formality, agility, security, and evolution in software development\n", "abstract": " Complex systems have always been problematic with respect to software development. Simplicity is desirable, but the reality of dealing with a customer means that requirements are likely to change, resulting in a corresponding loss of elegance in the solution. A good software engineer will design with the knowledge that the system is likely to evolve over time, even if the exact nature of the changes is unknown. Such expertise only comes with experience and an innate aptitude, especially in the understanding and use of abstraction. Software engineering approaches such as object orientation and modularization—for example, the Z notation schema construct—can help minimize change-related problems if used carefully, following standard patterns of use. Formal methods have been advocated for improving the correctness of software systems, 1 and agile software development has been promoted by the Agile Manifesto (http://agilemanifesto. org) and others for enabling adaptive development in the face of changing requirements, typically introducing additional complexity in the process.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Ten commandments of formal methods… Ten years on\n", "abstract": " How have the formal methods commandments fared over the past decade? Are they still valid in the current industrial setting, and have attitudes toward formal methods improved? The authors revisit their ten maxims to answer these questions.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "The virtual library of museums\n", "abstract": " I am not amuseum person'but I am married to a museum director. I have had some association with the Science Museum in the past. If you visit the Telecommunications Gallery, you can listen to a Morse code demonstration that I programmed many years ago. I've now moved on to networks and I have been combining my interest in computing and networks with museums, and they seem to be merging symbiotically in a very interesting and fast manner.People are used to having to visit museums. Museums provide information and there are a lot of people who are trying to gather information-schools, general public, tourists, etc.-all of whom are your customers. Of course they are used to having to come to your museum. Now, however, there is the possibility that you can actually present part of your museum directly to people in their homes. The following quotation is from an online article on the World Wide Web by …", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Occam's Razor: The cutting edge of parser technology\n", "abstract": " Yacc is well established in the compiler-compiler field, but is beginning to show its age. Issues which were important when hardware resources were more scarce are now less critical. Precc is a new compiler-compiler tool that is much more versatile than yacc, whilst retaining efficiency of operation on modern computers. It copes with the context-dependent BNF grammar descriptions and higher order meta constructions that are naturally encountered in semi-formal concrete syntax specifications, building fast and efficient infinite-lookahead tools in the form of ANSI-compliant C code. This paper provides a demonstration of this state-of-the-art compiler-compiler technology using the programming language occam as an example. The parsing of occam is particularly difficult compared to some programming languages since the indentation is an integral part of the language. However the precc tool allows a natural implementation of an occam parser that follows the syntax very closely.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "POS: Formal specification of a Unix tool\n", "abstract": " A simple text processing tool which allows positioning of lines within a document is presented using the formal specification language Z. Implementation details such as the use of tab characters and newline sequences are covered. The program has been implemented under the Unix operating system. It is hoped that the use of similar techniques will become widespread in the field of software engineering.< >", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Specifying System Implementations in Z\n", "abstract": " In an introductory chapter, an outline is presented of some techniques for specifying the building of systems from subsystems using the formal notation Z. These techniques have heen applied to the specification of implementations for services in a distributed system.The major part of the monograph consists of an extended example showing bow the implementation of a simple file server can he specified using some of the outlined techniques. The example file service is implemented in terms of a lower-level storage service. The specification includes the handling of errors th at may arise because of this dependency.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Distributed Computing Software project\n", "abstract": " The Distributed Computing Software project at Oxford University is using formal specification techniques to explore the design of services in a distributed operating system. Our goal is to construct and publish the specification of a loosely-coupled distributed operating system consisting of a number of autonomous services. Some design principles have been proposed from consideration of conventional business practice. Several services have already been designed and implemented according to these principles.", "num_citations": "11\n", "authors": ["1594"]}
{"title": "Turing's genius – Defining an apt microcosm\n", "abstract": " Alan Turing (1912–1954) is widely acknowledged as a genius. As well as codebreaking during World War II and taking a pioneering role in computer hardware design and software after the War, he also wrote three important foundational papers in the fields of theoretical computer science, artificial intelligence, and mathematical biology. He has been called the father of computer science, but he also admired by mathematicians, philosophers, and perhaps more surprisingly biologists, for his wide-ranging ideas. His influence stretches from scientific to cultural and even political impact. For all these reasons, he was a true polymath. This paper considers the genius of Turing from various angles, both scientific and artistic. The four authors provide position statements on how Turing has influenced and inspired their work, together with short biographies, as a starting point for a panel session and visual music performance.", "num_citations": "10\n", "authors": ["1594"]}
{"title": "The Brooklyn Visual Heritage website: Brooklyn's museums and libraries collaborate for Project CHART\n", "abstract": " Abstract The Brooklyn Visual Heritage website (http://brooklynvisualheritage. org) represents a new visual resource for cultural heritage. The site was created as part of Project CHART (Cultural Heritage, Access, Research and Technology), a three-year collaborative project (2010-2013) funded by the Institute of Museum and Library Services (IMLS) between Pratt School of Information and Library Science and three of New York’s leading cultural Institutions, the Brooklyn Historical Society, Brooklyn Museum, and Brooklyn Public Library. This paper examines the Brooklyn Visual Heritage website from the diverse perspectives of these cultural institutions and the communities they serve, from geographic communities to those of scholars, historians, and educators, while also addressing technical aspects of user experience and the challenges of cross institutional collaboration. We consider questions of shared decision-making on website design, public access and use as well as issues regarding how the BVH collections will continue to grow, while expanding the use of social media to promote greater community participation as part of a sustainable model.", "num_citations": "10\n", "authors": ["1594"]}
{"title": "Formalization of data flow computing and a coinductive approach to verifying flowware synthesis\n", "abstract": " Reconfigurable computing refers to the notions of configware and flowware. Configware means structural programming, or programming in space to execute computation in space. Flowware means data-flow programming that schedules the data flow for output from or input to the configware architecture. In this paper, data flows of a synthesized computation are formalized. This means that data flow is specified as a behavioral stream function in stream calculus, which is used to underpin the semantics for Register Transfer Level (RTL) synthesis. A stream representation allows the use of coinductive principles in stream calculus. In particular, using the coinductive proof principle, we show that behavioral stream functions in the three-stage synthesis process (scheduling, register allocation and binding, allocation and binding of functional units) are always bisimilar regardless of changes in a scheduling …", "num_citations": "10\n", "authors": ["1594"]}
{"title": "Introduction to Formal Methods\n", "abstract": " Computers do not make mistakes, or so we are told. However, computer software is written by, and hardware systems are designed and assembled by, humans, who certainly do make mistakes. Errors in a computer system may be the result of misunderstood or contradictory requirements, unfamiliarity with the problem, or simply human error during design or coding of the system. Alarmingly, the costs of maintaining software—the costs of rectifying errors and adapting the system to meet changing requirements or changes in the environment of the system—greatly exceed the original implementation costs. As computer systems are being used increasingly in safety-critical applications—that is, systems where a failure could result in the loss of human life, mass destruction of property, or significant financial loss—both the media (eg,[84]) and various regulatory bodies involved with standards, especially covering safety …", "num_citations": "10\n", "authors": ["1594"]}
{"title": "A provably correct functional programming approach to the prototyping of formal Z specifications\n", "abstract": " This paper describes a systematic way of constructing correct prototypes in a functional language such as Miranda or Haskell from Z specifications. A formal relationship between Z specifications and functional prototypes is established. This relationship is based on model refinement in the sense of specification refinement in the model-oriented specification style. To reduce the number of proofs required in model refinement, we have defined a set of rules that allow us to derive a prototype from a specification. The use of such a set of rules implicitly guarantees the correctness of the derivation.", "num_citations": "10\n", "authors": ["1594"]}
{"title": "Combining operational semantics, logic programming and literate programming in the specification and animation of the Verilog Hardware Description Language\n", "abstract": " An operational semantics for a significant subset of the Verilog Hardware Description Language (HDL) has been developed. An unusual aspect of the semantics is that it was formulated as a Prolog logic program. This allows the possibility of simulating the semantics. In addition, a literate programming style has been used, so the semantics can be processed by the LATEX document preparation system with minimal and fully automated preprocessing. Bringing together the paradigms of operational semantics, logic programming and literate programming in this manner has proved a great aid in a number of ways. It has helped improve the understanding of the semantics, in the formalization of semantic aspects left informal in the original mathematical formulation of the semantics, and in the maintenance of the formal semantics and its associated informal description. Civilization advances by extending the …", "num_citations": "10\n", "authors": ["1594"]}
{"title": "The website of the UK Museum of the Year, 1999\n", "abstract": " The Website of the UK Museum of the Year, 1999 Page 1 08/08/2017 The Website of the UK Museum of the Year, 1999 | museumsandtheweb.com https://www.museumsandtheweb.com/biblio/the_website_of_the_uk_museum_of_the_year_1999.html 1/2 Founded by Archives & Museum Informatics www.archimuse.com Managed by Museums and the Web LLC 703 Dale Drive Silver Spring MD 20910 USA info @ museumsandtheweb.com Terms and Conditions MUSEUMS AND THE WEB An annual conference exploring the social, cultural, design, technological, economic, and organizational issues of culture, science and heritage on-line. 2012 2011 2010 2009 2008 ... MUSEUMS AND THE WEB 2013 What's new About Blogs Discussions Jobs Best of the Web Bibliography YOU ARE HERE MW / The Website of the UK Museum of the Year, 1999 The Website of the UK Museum of the Year, 1999 Title The Website of …", "num_citations": "10\n", "authors": ["1594"]}
{"title": "Museum Websites of the First Wave: The rise of the virtual museum\n", "abstract": " In this paper, we analyse trends of the first wave of museum websites (from the 1990s to the early 2000s) to understand how the characteristics of the Internet (specifically the World Wide Web), of museum staff, and museum audiences shaped the adoption of technology and new forms of participation and what they can tell us about engagement for museums of the future. The early development of online museum resources parallels the development of the EVA conference, which was establishing itself at a similar time.", "num_citations": "9\n", "authors": ["1594"]}
{"title": "The impact of Alan Turing: Formal methods and beyond\n", "abstract": " In this paper, we discuss the influence and reputation of Alan Turing since his death in 1954, specifically in the field of formal methods, especially for program proving, but also in a much wider context. Although he received some recognition during his lifetime, this image was tarnished by the controversy at the time of his death. While he was known and appreciated in scientific circles, he did not enter the public’s consciousness for several decades. A turning point was the definitive biography produced by Andrew Hodges in 1983 but, even then, the tide did not turn very rapidly. More recent events, such as the celebrations of his birth centenary in 2012 and the official British royal pardon in 2013, have raised Turing’s fame and popularity among the informed general public in the United Kingdom and elsewhere. Cultural works in the arts featuring Turing have enhanced his profile still further. Thus, the paper …", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Fully encrypted high-speed microprocessor architecture: The secret computer in simulation\n", "abstract": " The architecture of an encrypted high-performance microprocessor designed on the principle that a nonstandard arithmetic generates encrypted processor states is described here. Data in registers, in memory and on buses exists in encrypted form. Any block encryption is feasible, in principle. The processor is (initially) intended for cloud-based remote computation. An encrypted version of the standard OpenRISC instruction set is understood by the processor. It is proved here, for programs written in a minimal subset of instructions, that the platform is secure against 'Iago' attacks by the privileged operator or a subverted operating system, which cannot decrypt the program output, nor change the program's output to a particular value of their choosing. Performance measures from cycle-accurate behavioural simulation of the platform are given for 64-bit RC2 (symmetric, keyed) and 72-bit Paillier (asymmetric, additively …", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Can Twitter save Bletchley Park?\n", "abstract": " Bletchley Park is the historic site of secret British codebreaking activities during World War II and birthplace of the modern computer. The work carried out there is said to have shortened WWII by two years saving possibly 22 million lives. The Park is now a museum, with a 26 acre site, many exhibitions and working rebuilds of machines such as the Colossus, a forerunner of today's computers, invented to mechanize codebreaking. The museum is staffed by a 75% volunteer workforce and is grossly underfunded compared to its historical importance.After a visit by Sue Black to Bletchley Park in July 2008 a campaign was launched to save it. A letter to the UK broadsheet newspaper The Times signed by 97 eminent UK computer scientists was published and highlighted in a BBC news broadcast. Following on from traditional media coverage a blog was established and then social media, particularly Twitter, which have been used to great effect to raise awareness and support for the campaign. Other Web 2.0 technologies including Facebook have also been used as part of the campaign.", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Global Information Technologies: Concepts, Methodologies, Tools, and Applications\n", "abstract": " Global Information Technologies: Concepts, Methodologies, Tools, and Applications compiles a defining body of authoritative research on these topics, resulting in a complete reference collection that cuts across all major areas of concern in the global information domain. Among the 269 chapters from over 450 international experts are examinations of culture in information systems, IT in developing countries, global e-business, and the worldwide information society. A matchless compendium on this topic for reference collections in libraries worldwide, Global Information Technologies: Concepts, Methodologies, Tools, and Applications provides a critical mass of knowledge to fuel the future work of researchers, academicians and practitioners in a variety of fields that engage with the implications of global information technology.", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Establishing formal regulatory requirements for safety-critical software certification\n", "abstract": " Formal methods are usually used for computer system specification, production and verification. In this paper, a new direction for the use of formal methods is proposed, namely formalization of the regulatory requirements for software of safety-critical control systems. Formal regulatory requirements, as opposed to formal specifications for a concrete system, have a generic nature, are applicable for a wide range of safety-critical control systems and are the basis for certification or licensing process. The use of formal regulatory requirements could help to eliminate ambiguity or misunderstanding of informal definitions, to allow rigorous assessment of satisfaction with respect to requirements and finally to increase the safety level of a system. As a formal method for describing the regulatory requirements, the Z notation is proposed. To demonstrate the approach, requirements for protection against common mode software failures and requirements for protection against unauthorized access are considered. Z schemas for these requirements are presented.", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Only connect!\n", "abstract": " Jonathan Bowen is considered by many as the ‘founding father’ of the Virtual Library museums pages, one of the premier Internet sites in the museum field. He is a lecturer at the Department of Computer Science, University of Reading (United Kingdom), where he leads the Formal Methods and Software Engineering Group, and was previously a senior researcher at the Oxford University Computing Laboratory. He has worked in the field of computing in both industry and academia since 1977 and has served on more than fifteen programme committees including a major working group within the European Union information technologies programme, ESPRIT. The author of 140 publications including nine books, Jonathan Bowen won the 1994 IEE (Institution of Electrical Engineers) Charles Babbage Premium award. In 1997 he was honorary chair, workshop presenter and an invited speaker at the first ‘Museums …", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Formal methods: Point-counterpoint\n", "abstract": " It may seem strange to have two academics contributing to such a roundtable. However, our recent work in editing a collection of essays on the industrial application of formal methods has brought us into contact with a wide range of industrial projects, giving us some useful insights. 1 Broadly speaking, we can identify four reasons for the industry's reluctance to take formal methods to heart.", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Annotated Z bibliography\n", "abstract": " This annotated Z bibliography contains a selected list of some pertinent publications for Z users. Most of those included are readily available, either as books or in journals. A few unpublished items have been included, where they are particularly relevant and can be obtained reasonably easily.", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Exhibitions in the ether\n", "abstract": " Museums are starting to make information, virtual multimedia exhibitions and even collection databases available online. Links to museums that provide such information are held as part of the Virtual Library, a distributed repository of knowledge initiated and coordinated by the original inventors of the World Wide Web.", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Distributed operating systems\n", "abstract": " DiscussionThat the new technology can meet these immediate social pressures is one thing, but it can provide far more, and in turn increase social expectations. Distributed systems can offer greater adaptability. Their nature forces them to be designed in a modular way and this can be used to advantage to allow incremental (and possibly dynamic) changes in performance and functionality by the addition or removal of elements. The performance of distributed systems can be made much better than that of centralized systems and with the fall in the price of microprocessors can also be very much cheaper. However, this performance gain is usually manifested in the form of greater capacity rather than response. Increasing the latter is currently limited by our ability to make use of parallelism, which is mainly a software problem, and will probably see more progress in the area of tightly coupled systems. These are multiprocessor systems with very fast communications, such as is provided by shared memory systems and transputer systems. This is in contrast to the loosely coupled systems which we consider here, typified by asynchronous, autonomous computers on a", "num_citations": "9\n", "authors": ["1594"]}
{"title": "Museums and Digitalism\n", "abstract": " The  distinguishing characteristic of digitalism  is its focus on human behavior  in cultural and social contexts. When we think of the developments of computer science  and “information theory”  that spawned the digital revolution , the focus generally defaults to digital tools  and technology, as opposed to its effects on human life and culture and how advances in computing, digital communications and technology are transforming our ways of doing, seeing, knowing, learning, living and loving, to name a few examples. The impact of digitalism  is all encompassing, touching all disciplines and human pursuits. How will museums change and transform themselves to connect in authentic ways with their communities while remaining relevant in a world transformed by digital culture  that is moving full speed ahead, advancing in a state of constant change and development? While museums have been cautious and …", "num_citations": "8\n", "authors": ["1594"]}
{"title": "Provably Correct Systems\n", "abstract": " ProCoS is the acronym for “Provably Correct Systems”, a basic research project funded in two phases by the European Commission from 1989 to 1995. This project was planned by Tony Hoare (Oxford University), Dines Bjørner (DTU, Technical University of Denmark, Lyngby), and Hans Langmaack (University of Kiel). Its goal was to develop a mathematical basis for the development of embedded, real-time computer systems.", "num_citations": "8\n", "authors": ["1594"]}
{"title": "Empirical patterns in Google Scholar citation counts\n", "abstract": " Scholarly impact can be measured crudely by the number of citations as a approximate indication of impact in terms of influencing other researchers, but this metric varies in applicability between disciplines. The number of citations for each publication of an author can be mapped as a graph in various ways. In doing so, certain empirical patterns may be discerned. This paper explores these patterns, using citation data from Google Scholar for a number of authors.", "num_citations": "8\n", "authors": ["1594"]}
{"title": "Online communities: Visualization and formalization\n", "abstract": " Online communities have increased in size and importance dramatically over the last decade. The fact that many communities are online means that it is possible to extract information about these communities and the connections between their members much more easily using software tools, despite their potentially very large size. The links between members of the community can be presented visually and often this can make patterns in the structure of sub-communities immediately obvious. The links and structures of layered communities can also be formalized to gain a better understanding of their modelling. This paper explores these links with some specific examples, including visualization of these relationships and a formalized model of communities using the Z notation. It also considers the development of such communities within the Community of Practice social science framework. Such approaches may be applicable for communities associated with cybersecurity and could be combined for a better understanding of their development.", "num_citations": "8\n", "authors": ["1594"]}
{"title": "Dulwich OnView: A museum blog run by the community for the community\n", "abstract": " Dulwich OnView (DOV) is an online blog magazine associated with the Dulwich Picture Gallery (DPG) in south London. Uniquely, it has been set up by some Friends of DPG in the local community, with a symbiotic relationship between that community and the museum. DPG benefits from the marketing and publicity generated by DOV. DOV benefits from the status that DPG brings to it. This paper explores recent developments of DOV in the context of its community, including a study based on the Community of Practice (CoP) approach and a usability review for a planned redesign of the Web site.", "num_citations": "8\n", "authors": ["1594"]}
{"title": "Can small museums develop compelling, educational and accessible web resources? The case of Accademia Carrara\n", "abstract": " Due to the lack of budget, competence, personnel and time, small museums are often unable to develop compelling, educational and accessible web resources for their permanent collections or temporary exhibitions. In an attempt to prove that investing in these types of resources can be very fruitful even for small institutions, we will illustrate the case of Accademia Carrara, a museum in Bergamo, northern Italy, which, for a current temporary exhibition on Cezanne and Renoir's masterpieces from the Paul Guillaume collection, developed a series of multimedia applications, including an accessible website, rich in content and educational material [www.cezannerenoir.it].", "num_citations": "8\n", "authors": ["1594"]}
{"title": "An algorithmic approach by heuristics to dynamical reconfiguration of logic resources on reconfigurable FPGAs\n", "abstract": " Efficient management of the logic resource available is one of the biggest problems faced by the embedded systems based on FPGA, in which their functionality can be partially modified at run-time without stopping the operation of the whole system. When the sequence of reconfigurations to be performed is not predictable, resource allocation decisions have to be made on-line. Dynamical reconfiguration can be necessary to relocate a running physical configuration, and to rearrange the logic resources into the variety of physical portions. Our proposed algorithm is formally developed to enable implementing an on-line management of FPGA logic resources, supporting the rearrangement of running functions, releasing enough contiguous space for configuration of new incoming functions, and performing the defragmentation in a way completely transparent to the applications currently running. Therefore, on-line …", "num_citations": "8\n", "authors": ["1594"]}
{"title": "Creative visualisation in chemistry\n", "abstract": " Visualisation of molecules in the field of chemistry has been important for understanding their structure, whether simple or complicated. Initially, this was done by hand, but latterly software has come to the aid of researchers and the vast majority of chemistry visualisation is now computer-generated. As well as aiding understanding, many molecules, especially if complex in nature, can take on an artistic quality when visualised, using artificial colour for example. Often these are used for creative reasons on the front of chemistry journals, for example, and sometimes as an inspiration for more pure art forms. This paper introduces molecular graphics in the context of creative computing. It also provides a history of the development of visualisation in chemistry, especially more recently with the use of software and the increasing use on journal covers. A brief survey of some of the software involved is included. Finally, some …", "num_citations": "7\n", "authors": ["1594"]}
{"title": "The Z notation: Whence the cause and whither the course?\n", "abstract": " The Z notation for the formal specification of computer-based systems has been in existence since the early 1980s. Since then, an international Z community has emerged, academic and industrial courses have been developed, an ISO standard has been adopted, and Z has been used on a number of significant software development projects, especially where safety and security have been important. This chapter traces the history of the Z notation and presents issues in teaching Z, with examples. A specific example of an industrial course is presented. Although subsequent notations have been developed, with better tool support, Z is still an excellent choice for general purpose specification and is especially useful in directing software testing to ensure good coverage.", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Electronic visualisation in chemistry: From alchemy to art\n", "abstract": " Chemists now routinely use software as part of their work. For example, virtual chemistry allows chemical reactions to be simulated. In particular, a selection of software is available for the visualisation of complex 3-dimensional molecular structures. Many of these are very beautiful in their own right. As well as being included as illustrations in academic papers, such visualisations are often used on the covers of chemistry journals as artistically decorative and attractive motifs. Chemical images have also been used as the basis of artworks in exhibitions. This paper explores the development of the relationship of chemistry, art, and IT. It covers some of the increasingly sophisticated software used to generate these projections (e.g., UCSF Chimera) and their progressive use as a visual art form.", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Communicating the public understanding of science: The Royal Society website\n", "abstract": " The Royal Society is widely considered to be the foremost UK scientific society and a leading scientific institution internationally. Like all modern organisations, it has been developing its website to meet the increasingly sophisticated demands of its users, from the public to its members. This paper surveys the development of the website from its simple initial offering to the dynamic resource available today, from a public viewpoint. This progress has been rapid over a decade for a 300-year old institution. The services are considered in the context of the \"public understanding of science\", an important remit of the Society.", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Integrating probability with time and shared-variable concurrency\n", "abstract": " Complex software systems typically involve features like time, concurrency and probability, where probabilistic computations play an increasing role. It is challenging to formalize languages comprising all these features. In this paper, we integrate probability, time and concurrency in one single model, where the concurrency feature is modelled using shared-variable based communication. The probability feature is represented by a probabilistic nondeterministic choice, probabilistic guarded choice and a probabilistic version of parallel composition. We formalize an operational semantics for such an integration. Based on this model we define a bisimulation relation, from which an observational equivalence between probabilistic programs is investigated and a collection of algebraic laws are explored. We also implement a prototype of the operational semantics to animate the execution of probabilistic programs", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Teaching Formal Methods: Practice and Experience\n", "abstract": " This volume contains the proceedings of the Teaching Formal Methods: Practice and Experience workshop [1] held in London, UK, organized by Oxford Brookes University's Department of Computing [2] and the BCS Formal Aspects of Computing Science Specialist Group [3].", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Copyright and promotion: Oxymoron or opportunity?\n", "abstract": " Copyright in the cultural sphere can act as a barrier to the dissemination of high-quality information. On the other hand it protects works of art that might not be made available otherwise. This dichotomy makes the area of copyright difficult, especially when it applies to the digital arena of the web where copying is so easy and natural. Here we present a snapshot of the issues for online copyright, with particular emphasis on the relevance to cultural institutions. We concentrate on Europe and the US; as an example we include a special section dedicated to the situation in Italy.", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Deriving correct prototypes from formal Z specifications\n", "abstract": " This paper describes a systematic way of constructing correct prototypes in a functional language such as Miranda from Z specifications. A formal relationship between Z specifications and functional prototypes is established. This relationship is based on model refinement in the sense of specification refinement in the model-oriented specification style. To reduce the number of proofs required in model refinement, we have defined a set of rules which allow to derive a prototype from a specification. The use of such set of rules implicitly guarantee the correctness of the derivation.", "num_citations": "7\n", "authors": ["1594"]}
{"title": "On-line museums\n", "abstract": " The Internet worldwide computer network of networks provides an unparalleled opportunity for organizations ranging from individuals to multinational companies to make information rapidly and easily available on a global scale. In particular, the World Wide Web (WWW) allows access to multimedia hyperlinked resources in a form usable by the majority of people. One group of organizations that are exploring the increasing possibilities are museums. This article presents a number of museums that are using the Internet, the Virtual Library museums pages (VLmp) which provide a directory of on-line museums, and statistics on virtual museumvisits'. Finally possible future directions are explored.", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Report on Z User Meeting (ZUM'94)\n", "abstract": " With 140 delegates from 15 countries attending, the numbers were substantially increased from previous years, and the conference was expanded to fill an entire working week. Halfday and full-day tutorials on introductory Z, B and the B-method, project management issues, dependable real-time systems, and object-oriented specification in Z, were presented on Monday and Tuesday, 27th and 28th June, and proved to be very popular indeed. The main sessions were held on Wednesday and Thursday, 29th and 30th June, and were followed by a half-day session on educational issues of formal methods, held in the 12th century School of Pythagoras on the morning of July 1st. This provided an opportunity for educators and industrialists to discuss their ideas on the teaching of formal methods in general, and Z in particular. Four full papers were presented, and there were a number of poster displays. Fortuitously, the location and timing of the meeting added a historical flavour to the event. Forty-five years previously to the week, the first ever European conference on computer science was held in Cambridge, in which the early EDSAC computer, designed and constructed by Prof. Maurice V. Wilkes and his team at the University of Cambridge, was discussed. This historic event was commemorated with a highly entertaining after-dinner speech at the ZUM’94 conference dinner by the organizer of the 1949 EDSAC meeting, Prof. Wilkes himself. The London Science Museum and the Whipple Museum of the History of Science very kindly organized a small display of some historical memorabilia, including the core memory of EDSAC-2, and a fragment …", "num_citations": "7\n", "authors": ["1594"]}
{"title": "Towards verified systems: The SAFEMOS project\n", "abstract": " The collaborative safemos project has investigated the formal development of embedded systems from speci cation through to a real-time programming language, compilation to object code and the formal design (and even automatic compilation) of a hardware machine to execute that code. The project has used Occam and the Transputer as an inspiration for its investigations, with real-time extensions where required. HOL has been used for mechanical veri cation where appropriate. A close liaison with the related collaborative European ESPRIT ProCoS project has been maintained to ensure that research on both projects is coordinated. This paper gives an overview of the work of the project with particular regard to the mathematical techniques used for the speci cation and veri cation process.", "num_citations": "7\n", "authors": ["1594"]}
{"title": "A Personal View of EVA London: Past, Present, Future\n", "abstract": " I first encountered EVA London in 1995 through my establishment of the Virtual Library museums pages (VLmp), part of the World Wide Web Virtual Library. In 2003, I was invited back as a keynote speaker on the subject of website accessibility for cultural heritage resources. Since then I have been involved with every EVA London conference either as an author or since 2007 as a proceedings editor. This paper summarises the developments of the EVA London conference over the past 25 years from a personal viewpoint and celebrates the 30th anniversary of EVA London and the whole family of international EVA conferences. The development of the community around EVA (Electronic Visualisation and the Arts) is evaluated in the context of a Community of Practice. The paper also considers possible future directions for EVA.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "The Digital Future for Museums\n", "abstract": " We discuss possible directions that museums could take with respect to the rapidly developing digital culture in which they find themselves. Successful museums must be very adaptable to the changing nature of public expectations. Some of the important aspects to be considered have been covered in earlier chapters in this book. Here we take this knowledge and speculate how museums could adapt to survive in the digital environment that is increasingly integrated as part of the real environment, in what will rapidly become a postdigital world. The chapter summarizes the prospective directions for museums and related institutions in the context of changes in the digital landscape of the rest of society.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Provably Correct Systems: Community, connections, and citations\n", "abstract": " The original European ESPRIT ProCoS I and II projects on Provably Correct Systems took place around a quarter of a century ago. Since then, the legacy of the initiative has spawned many researchers with careers in formal methods, forming a community of researchers with a common interest in this area. This chapter uses one of the leaders on the ProCoS initiative, Ernst-Rüdiger Olderog, as an example in demonstrating connections within and around the ProCoS research community. This is formalized using the Z notation to make the description more precise, especially with respect to collaborations undertaken through coauthorship of publications and subsequent citations to this research output. Matching visualizations of the relationships are included. The social science concept of a Community of Practice (CoP) is introduced in this context. Finally, consideration of citation metrics is also included.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Unifying Theories of Programming: 6th International Symposium, UTP 2016 Reykjavik, Iceland, June 4–5, 2016 – Revised Selected Papers\n", "abstract": " This book constitutes the refereed proceedings of the 6th International Symposium on Unifying Theories of Programming, UTP 2016, held in Reykjavik, Iceland, in June 2016, in conjunction with the 12th International Conference on Integrated Formal Methods, iFM 2016. The 8 revised full papers presented were carefully reviewed and selected from 10 submissions. They deal with the fundamental problem of combination of formal notations and theories of programming that define in various different ways many common notions, such as abstraction refinement, choice, termination, feasibility, locality, concurrency, and communication. They also show that despite many differences, such theories may be unified in a way that greatly facilitates their study and comparison.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "A relational approach to an algebraic community: From Paul Erdős to He Jifeng\n", "abstract": " Scholarly advance depends on the interaction of researchers in a large number of overlapping communities in different disciplines (mathematics, computer science, etc.) and fields within these disciplines (e.g., algebra, formal methods, etc.). Now that academic publications are largely accessible on the Internet, these connections are directly available through a number of resources and visualization tools that are available online. Academic links are typically in the form of co-authors, citations, supervisor/student, etc., forming different types of relations between pairs of researchers. This paper explores these links with some specific examples, including visualization of these relationships and their formalization using the Z notation.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Ten commandments ten years on: Lessons for ASM, B, Z and VSR-net\n", "abstract": " Just over a decade ago, a paper Ten Commandments of Formal Methods [16] suggested some guidelines to help ensure the success of a formal methods project. It proposed ten important requirements (or “commandments”) for formal developers to consider and follow, based on our knowledge of several industrial application success stories, most of which have been reported in more detail in two books [32,33]. The paper was surprisingly popular, is still widely referenced, and used as required reading in a number of formal methods courses. However, not all have agreed with some of our commandments, feeling that they may not be valid in the long-term. We re-examine the original commandments over ten years on, and consider their validity in the light of a further decade of industrial best practice and experiences, especially with respect to formal notations like ASM, B and Z. We also cover the activities of …", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Ten commandments ten years on: An assessment of formal methods usage\n", "abstract": " The application of formal methods has been slower than hoped by many in the formal methods community. Over the last decade, there have been some advances and important developments. Despite this, formal methods remain a specialist area, but have an increasingly important niche in the development of critical systems, especially where safety and security are involved. In this paper we examine the use of formal methods within the framework of ten “commandments”(rules for guidance) that were originally published in 1995. These remain remarkably relevant even ten years later, but this paper provides an update with the decade of experience that has been gained since then.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "A provable algorithm for reconfiguration in embedded reconfigurable computing\n", "abstract": " Dynamically reconfigurable computing within embedded computer-based systems can be partially modified at runtime without stopping the operation of the whole system. In this paper, a provable algorithm for runtime evolution of a logical configuration is formally represented by the appropriate graph transformation. In other words, programming is considered as a visual transformation of the logical configuration by the formulated rules. Their soundness is proved. A logical configuration in evolution is provable from another by applying these rules. Subsequently, an algorithmic approach to programming is formally developed and analyzed", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Search engines and online museum access on the web\n", "abstract": " We can consider Web browsing as a similar experience to visiting a museum, when we take decisions about where to stop and where to skip over the exhibited objects. This is the same in museums; there are some tools available to help people select what they want to see such as maps, brochures, etc. Just as in a real museum, where maps and brochures help people organize their visit, search engines support the user in their navigation on the Web by assisting them in finding the most relevant material, while ignoring the rest. The Web is a unique\" museum\" where there are all sorts of data, including multimedia objects, so it is particularly crucial to respect the potentially different attitudes of users that may have various interests and different perspectives.(This is once again the same in museums.) The role of search engines is particularly problematic because they have to guarantee the efficiency of the service without betraying the multiplicity of users' purposes. The aim of this paper is to show the result of testing the difficulty of access to useful museum-related resources that are not very well known, but contain relevant information when search engines and other query techniques are used. We will show that many museum Web sites and databases belong to the hidden part of the Web that is not accessible unless the precise URL is known. We will discuss some practical issues on finding museum information and how museums could improve their search rankings and their own searching facilities, especially with respect to the widely used Google search engine. Further, we will introduce some promising solutions for finding museums' Web sites …", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Museophile: A community for museum e-commerce\n", "abstract": " Large national museums can afford to create their own on-line mass communication services and to undertake e-commerce activities themselves. However, for other museums, this can be a daunting prospect, both technically and financially. It is also likely to be much less effective. A solution could be to create an on-line museum community of small to medium sized museums who alone would struggle to make such an enterprise a success but who together, with suitable help, could rival the efforts of national museums. This mini-workshop examines existing example of museum e-commerce and facilities that could be used by museums. It then goes on to propose a possible infrastructure for museums wishing to take their initial steps in ecommerce at low cost and low risk.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "On-line collections access at the Museum of English Rural Life\n", "abstract": " The last part of the paper gives an overview of what is planned for the last part of the project. Not many museum collections are available on-line in a comprehensive form, especially from smaller museums, so this project aims to be exemplary of what can be achieved given appropriate resources", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Risks to the public in computers and related systems\n", "abstract": " A man sent his ex-wife (who had apparently asked him to retrieve some inaccessible files) a computer diskette that destroyed her entire hard disk, including software and manuscripts, and then displayed a vengeful limerick. James Welsh, a 32-year-old accountant, has pleaded not guilty to three counts of\" introducing a virus\" into the computer. He could face three years in prison if convicted. Welsh's ex-wife, writer Kathleen Shelton, said she had a problem with a computer they formerly owned together. Welsh apparently sent her a computer disk with instructions for correcting the trouble. Police said,\" She followed Welsh's instructions, which resulted in the destruction of approximately $8,000 worth of software and manuscripts, leaving only [an abrasive] limerick explaining Welsh's actions against her.\" Detectives searched Welsh's home, seized $4,000 worth of computer hardware and allegedly found evidence of the …", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Z Bibliography\n", "abstract": " Author Comments: Created 30 October 1990 from a UNIX\" refer\" format database. Acknowledgement: Ruaridh Macdonald, RSRE, Malvern, started and helped maintain the original database. Joan Arnold, ESPRIT ProCoS-WG Working Group secretary at the PRG, has also helped in maintaining the bibliography.Entries not included in the Master Z Bibliography are may be in an older Z Bibliography. This includes older unpublished documents such as technical reports, MSc theses, draft papers, etc., particularly if they have subsequently been published elsewhere. Please send new entries to Jonathan Bowen.", "num_citations": "6\n", "authors": ["1594"]}
{"title": "Computing the Future: Digital encounters in art and science when da Vinci meets Turing\n", "abstract": " Computing the future, as life and research moves to the Internet, we are engaged increasingly in digital encounters from present to past and into the future with real people, events and documents. This paper focuses on the newly born-digital relationship between Alan Turing, father of computer science, and Leonardo da Vinci, master of Renaissance art and science – both revered as visionary geniuses, prophets of the future. Given the continued growth of digitised materials that are daily entering global consciousness, it is only relatively recently that both da Vinci’s notebooks and paintings, and Turing’s archive, are online and searchable. Thus we are able for the first time to relatively easily juxtapose and compare their work, and see that they have much in common in terms of what it means to human in science, art and the natural world, from da Vinci’s in-depth studies of the mechanisms of the human body, mind, and soul, foundational to his art, and to Turing’s discoveries in Artificial Intelligence (AI), machine learning, and morphogenesis. Considering their points of concurrence in the digital world brings into focus our global network of digital places and spaces, where science, art, and nature, including real and artificial life, become unbounded.", "num_citations": "5\n", "authors": ["1594"]}
{"title": "Theoretical and practical aspects of linking operational and algebraic semantics for MDESL\n", "abstract": " Verilog is a hardware description language (HDL) that has been standardized and widely used in industry. Multithreaded discrete event simulation language (MDESL) is a Verilog-like language. It contains interesting features such as event-driven computation and shared-variable concurrency. This article considers how the algebraic semantics links with the operational semantics for MDESL. Our approach is from both the theoretical and practical aspects. The link is proceeded by deriving the operational semantics from the algebraic semantics. First, we present the algebraic semantics for MDESL. We introduce the concept of head normal form. Second, we present the strategy of deriving operational semantics from algebraic semantics. We also investigate the soundness and completeness of the derived operational semantics with respect to the derivation strategy. Our theoretical approach is complemented by a …", "num_citations": "5\n", "authors": ["1594"]}
{"title": "Life and work\n", "abstract": " A few months after Alan Turing’s tragically early death, in 1954, his colleague Geoffrey Jefferson (professor of neurosurgery at Manchester University) wrote what might serve as Turing’s epitaph: Alan in whom the lamp of genius burned so bright—too hot a flame perhaps it was for his endurance. He was so unversed in worldly ways, so childlike it sometimes seemed to me, so unconventional, so non-conform [ing] to the general pattern. His genius flared because he had never quite grown up, he was I suppose a sort of scientific Shelley. After his short but brilliant career Alan Mathison Turing’s life ended 15 days short of his fortysecond birthday. 2 His ideas lived on, however, and at the turn of the millennium Time magazine listed him among the twentieth-century’s one hundred greatest minds, alongside the Wright brothers, Albert Einstein, DNA busters Crick and Watson, and Alexander Fleming, the discoverer of …", "num_citations": "5\n", "authors": ["1594"]}
{"title": "Algebraic approach to linking the semantics of web services\n", "abstract": " Web services have become more and more important in these years, and BPEL4WS (BPEL) is a de facto standard for the web service composition and orchestration. It contains several distinct features, including the scope-based compensation and fault handling mechanism. We have considered the operational semantics and denotational semantics for BPEL, where a set of algebraic laws can be achieved via these two models, respectively. In this paper, we consider the inverse work, deriving the operational semantics and denotational semantics from algebraic semantics for BPEL. In our model, we introduce four types of typical programs, by which every program can be expressed as the summation of these four types. Based on the algebraic semantics, the strategy for deriving the operational semantics is provided and a transition system is derived by strict proof. This can be considered as the soundness …", "num_citations": "5\n", "authors": ["1594"]}
{"title": "Disabled Access for Museum Websites\n", "abstract": " Physical disabled access is something that most museums consider very seriously. Indeed, there are normally legal requirements to do so. However, online disabled access is still a relatively novel field. Most museums have not yet considered the issues in depth. The Human-Computer Interface for their websites is normally tested with major browsers, but not with specialist browsers or against the relevant accessibility and validation standards. We consider the current state of the art in this area and mention an accessibility survey of some museum websites.", "num_citations": "5\n", "authors": ["1594"]}