{"title": "Operating method and system for supporting lane keeping of a vehicle\n", "abstract": " A system and an operating method are provided for supporting lane keeping of a vehicle equipped with a steering device. The system and operating method include providing vehicle related information; providing environment related information; combining vehicle and environment related information; predicting a future trajectory of the vehicle based on vehicle and environment related information; estimating a desired lateral lane position of the vehicle and/or a guiding force; comparing the future trajectory and the desired lateral lane position; deciding if a guiding force is to be provided to the steering device; and, if guiding force is to be provided, defining an amount of said guiding force depending on a hierarchically ordered set describing a predetermined driving behavior of the vehicle, adapting the amount of guiding force depending on the direction in which the vehicle is intended to move and activating one or …", "num_citations": "102\n", "authors": ["2270"]}
{"title": "Using extreme value theory for vehicle level safety validation and implications for autonomous vehicles\n", "abstract": " Much effort is put right now into how to make autonomous vehicles as capable as possible in order to be able to replace humans as drivers. Less focus is put into how to ensure that this transition happens in a safe way that we can put trust in. The verification of the extreme dependability requirements connected to safety is expected to be one of the largest challenges to overcome in the commercialization of autonomous vehicles. Using traditional statistical methods to validate complete vehicle safety would require the vehicle to cover extreme distances to show that collisions occur rare enough. However, recent research has shown the possibility of using near-collisions in order to estimate the frequency of actual collisions using Extreme Value Theory. To use this method, there is a need for a measure related to the closeness of a collision. This paper shows that the choice of this threat measure has a significant impact …", "num_citations": "62\n", "authors": ["2270"]}
{"title": "Worst-case analysis of automotive collision avoidance systems\n", "abstract": " Automotive collision avoidance (CA) systems help drivers to avoid collisions through autonomous interventions by braking or steering. If the decision to intervene is made too early, the intervention can become a nuisance to the driver, and if the decision is made too late, the safety benefits of the intervention will be reduced. The decision to intervene is commonly based on a threat function. The dimensionality of the input state space for the threat function is, in general, very large, making exhaustive evaluation in real vehicles intractable. This paper presents a method for efficient estimation of a conservative bound on CA system performance, i.e., the worst-case performance. Closed-form expressions are derived for the worst-case performance, in terms of early or unnecessary interventions, with regard to longitudinal or lateral prediction and measurement errors. In addition, we derive closed-form expressions for robust …", "num_citations": "38\n", "authors": ["2270"]}
{"title": "How to reach complete safety requirement refinement for autonomous vehicles\n", "abstract": " The introduction of highly automated driving and autonomous road vehicles will imply new functional safety challenges. The higher complexity and the partly implicit definition of the tasks for the E/E systems will make it harder to argue completeness and correctness of the safety requirements in each phase of the ISO 26262 lifecycle. This paper discusses the new situation in terms of an increasing semantic gap, and recommends to perform more safety refinement steps. As a consequence, ISO 26262 should be amended with activities prescribing new refinements levels.", "num_citations": "30\n", "authors": ["2270"]}
{"title": "Reliable vehicle pose estimation using vision and a single-track model\n", "abstract": " This paper examines the problem of estimating vehicle position and direction, i.e., pose, from a single vehicle-mounted camera. A drawback of pose estimation using vision only is that it fails when image information is poor. Consequently, other information sources, e.g., motion models and sensors, may be used to complement vision to improve the estimates. We propose to combine standard in-vehicle sensor data and vehicle motion models with the accuracy of local visual bundle adjustment. This means that pose estimates are optimized with regard not only to observed image features but also to a single-track vehicle model and standard in-vehicle sensors. The described method has been experimentally tested on challenging data sets at both low and high vehicle speeds as well as a data set with moving objects. The vehicle motion model in combination with in-vehicle sensors exhibit good accuracy in estimating …", "num_citations": "21\n", "authors": ["2270"]}
{"title": "Verification of collision avoidance systems using reachability analysis\n", "abstract": " This paper presents a method for formal verification of automotive collision avoidance systems. Using viability theory and reachability analysis, we define when the system should intervene, i.e. the unsafe set, and when the system should not intervene, i.e. the safe set. Given these sets, we formulate the problem of verifying that a given system does not make incorrect decisions as an optimization problem. The method is demonstrated on a collision avoidance system example and, given the models used and absence of measurements errors, we show that the system does not make incorrect decisions. Furthermore, we describe and demonstrate how to evaluate the robustness to measurement errors, using the proposed framework.", "num_citations": "21\n", "authors": ["2270"]}
{"title": "The need for an environment perception block to address all asil levels simultaneously\n", "abstract": " In order to perform safety assessment of vehicles for highly automated driving, it is critical that the vehicle can be proven to adapt its driving according to the sensed objects that might become a hinder. There is a complicated relation between the confidence of what hinders that might exist coming out of an environment perception block, and the tactical decisions about the driving style done by the autonomous vehicle. A good strategy that enables safety assessment according to ISO26262 implies that the environment perception block should address its safety requirements for all the ASIL attribute values simultaneously. In this paper we argue why every functional safety requirement allocated to an environment perception block should preferable be instantiated four times, each with a different ASIL value.", "num_citations": "19\n", "authors": ["2270"]}
{"title": "Disarming the trolley problem–why self-driving cars do not need to choose whom to kill\n", "abstract": " Many claim that the “Trolley problem” is hindering the introduction of self-driving cars. Self-driving cars must, as all safety-critical products, be designed such that the probability of morally hard (“trolley”) situations is acceptably low. In this paper we argue that the introduction of self-driving cars can solve this ethical dilemma. In short the solution to the trolley problem is that a self-driving car must be able to estimate its own operational capability for handling surprising situations, and adjust its own tactical behavior accordingly. By limiting the risk for the case of not being able to handle all surprising events in a similar way as for other safety goals today, the remaining risk for the trolley problem can be argued as low as any other acceptable risk of vehicle E/E implemented functionality.", "num_citations": "18\n", "authors": ["2270"]}
{"title": "Driving tests for self-driving cars\n", "abstract": " At a test track east of Gothenburg, Sweden, people are ushered into autonomous vehicles for a test drive. But there's a twist: The vehicles aren't actually autonomous-there's a hidden driver in the back-and the people are participating in an experiment to discover how they'll behave when the car is chauffeuring them around. At Zenuity-a joint venture between Volvo and Autoliv, a Swedish auto-safety company-this test is just one of many ways we make sure not just that autonomous vehicles work but that they can drive more safely than humans ever could. If self-driving cars are ever going to hit the road, they'll need to know the rules and how to follow them safely, regardless of how much they might depend on the human behind the wheel.", "num_citations": "17\n", "authors": ["2270"]}
{"title": "Method and system for steering assistance in a vehicle\n", "abstract": " A method for steering assistance in an autonomous or semi-autonomous vehicle comprises identifying an upcoming curve, detecting an inner lane boundary and an outer lane boundary of the upcoming curve, determining a safety distance between the vehicle and the outer lane boundary, and controlling a position of the vehicle in the curve with respect to the inner and outer lane boundary such that the vehicle is at a distance from the outer lane boundary which is equal to or larger than the safety distance. A steering assistance system is also described capable of performing the method for steering assistance.", "num_citations": "16\n", "authors": ["2270"]}
{"title": "Computational verification methods for automotive safety systems\n", "abstract": " This thesis considers computational methods for analysis and verification of the class of automotive safety systems which support the driver by monitoring the vehicle and its surroundings, identifying hazardous situations and actively intervening to prevent or mitigate consequences of accidents. Verification of these systems poses a major challenge, since system decisions are based on remote sensing of the surrounding environment and incorrect decisions are only rarely accepted by the driver. Thus, the system must make correct decisions, in a wide variety of traffic scenarios. There are two main contributions of this thesis. First, theoretical analysis and verification methods are presented which investigate in what scenarios, and for what sensor errors, the absence of incorrect system decisions may be guaranteed. Furthermore, methods are proposed for analyzing the frequency of incorrect decisions, including the …", "num_citations": "16\n", "authors": ["2270"]}
{"title": "Method and arrangement for determining safe vehicle trajectories\n", "abstract": " A method and arrangement for determining safe vehicle trajectories for a vehicle equipped with sensors for monitoring a surrounding environment, taking into account sensing limitations, as well as a vehicle including such an arrangement. The method includes detecting observable obstacles, detecting unobservable areas, adding virtual obstacles in unobservable areas, associating each observable obstacle and each virtual obstacle with one or more hypothetical events and assigning an occurrence probability to each combination of obstacle and one or more events, and determining safe vehicle trajectories based on both observable obstacles and virtual obstacles and the occurrence probability of each combination of obstacle and one or more events.", "num_citations": "14\n", "authors": ["2270"]}
{"title": "Comparing collision threat measures for verification of autonomous vehicles using extreme value theory\n", "abstract": " The verification of safety is expected to be one of the largest challenges in the commercialization of autonomous vehicles. Using traditional methods would require infeasible time and resources. Recent research has shown the possibility of using near-collisions in order to estimate the frequency of actual collisions using Extreme Value Theory. However, little research has been done on how the measure for determining the closeness to a collision affect the result of the estimation. This paper compares a collision-based measure against one that relates to an inevitable collision state. The result shows that using inevitable collision states is more robust and that more research needs to be made into measures of collision proximity.", "num_citations": "13\n", "authors": ["2270"]}
{"title": "Device and method for safety stoppage of an autonomous road vehicle\n", "abstract": " A device and method for safety stoppage of an autonomous road vehicle having a localization system and sensors for monitoring the vehicle surroundings and motion, and a signal processing system for processing sensor signals enabling an autonomous drive mode. A processor continuously predicts where a drivable space exists, calculates and stores a safe trajectory to a stop within the drivable space, determines a current traffic situation, and determines any disturbances in sensor data, vehicle systems or components enabling the autonomous drive mode. If an incapacitating disturbance is determined, a request for a driver to take control is signaled and it is determined if the driver has assumed control. If not, the vehicle is controlled to follow the most recent safe trajectory to a stop in a safe stoppage maneuver during which, or after, one or more risk mitigation actions adapted to the determined current traffic …", "num_citations": "12\n", "authors": ["2270"]}
{"title": "Performance evaluation method for mobile computer vision systems using augmented reality\n", "abstract": " This paper describes a framework which uses augmented reality for evaluating the performance of mobile computer vision systems. Computer vision systems use primarily image data to interpret the surrounding world, e.g to detect, classify and track objects. The performance of mobile computer vision systems acting in unknown environments is inherently difficult to evaluate since, often, obtaining ground truth data is problematic. The proposed novel framework exploits the possibility to add virtual agents into a real data sequence collected in an unknown environment, thus making it possible to efficiently create augmented data sequences, including ground truth, to be used for performance evaluation. Varying the content in the data sequence by adding different virtual agents is straightforward, making the proposed framework very flexible. The method has been implemented and tested on a pedestrian detection …", "num_citations": "12\n", "authors": ["2270"]}
{"title": "Functional safety and evolvable architectures for autonomy\n", "abstract": " The presented paper presents the ongoing Swedish national research project FUSE (FUnctional Safety and Evolvable architectures for autonomy). Some of the research questions addressed in this project are summarized. The research questions are related both to functional safety and the E/E architecture of vehicles aimed for higher degrees of automation, including fully autonomous ones.", "num_citations": "8\n", "authors": ["2270"]}
{"title": "Pedestrian detection using augmented training data\n", "abstract": " Detecting pedestrians is a challenging and widely explored problem in computer vision. Many approaches rely on large quantities of manually labelled training data to learn a pedestrian classifier. To reduce the need for collecting and manually labelling real image training data, this paper investigates the possibility to use augmented images to train a pedestrian classifier. Augmented images are generated by rendering virtual pedestrians onto real image backgrounds. Classifiers learned from real or augmented training data are evaluated on real image test data from the widely used Daimler Mono Pedestrian benchmark data set. Results show that augmented training data generated from a single 200 frame image sequence reach 70 % average detection rate at one False Positives Per Image (FPPI), compared to 81 % for a classifier trained by a large-scale real data set. Results also show that complementing real …", "num_citations": "8\n", "authors": ["2270"]}
{"title": "Vehicle system, vehicle comprising a vehicle system and method for allowing transition from an autonomous driving mode\n", "abstract": " A vehicle system is arranged for allowing transition from an autonomous driving mode to a second driving mode in a road vehicle having autonomous driving capabilities and including a vehicle compartment, a steering wheel and at least one pedal. The vehicle system includes a control arrangement, a first switch arranged at a first position at the steering wheel, a second switch arranged at a second position within the vehicle compartment, and a first determination arrangement for determining if the at least one pedal is depressed. The control arrangement is configured to allow the transition when the at least one pedal of the vehicle is depressed when the first switch and the second switch are simultaneously activated.", "num_citations": "7\n", "authors": ["2270"]}
{"title": "A strategy for assessing safe use of sensors in autonomous road vehicles\n", "abstract": " When arguing safety for an autonomous road vehicle it is considered very hard to show that the sensing capability is sufficient for all possible scenarios that might occur. Already for today’s manually driven road vehicles equipped with advanced driver assistance systems (ADAS), it is far from trivial how to argue that the sensor systems are sufficiently capable of enabling a safe behavior. In this paper, we argue that the transition from ADAS to automated driving systems (ADS) enables new solution patterns for the safety argumentation dependent on the sensor systems. A key factor is that the ADS itself can compensate for a lower sensor capability, by for example lowering the speed or increasing the distances. The proposed design strategy allocates safety requirements on the sensors to determine their own capability. This capability is then to be balanced by the tactical decisions of the ADS equipped road …", "num_citations": "7\n", "authors": ["2270"]}
{"title": "Disabling onboard input devices in an autonomous vehicle\n", "abstract": " Systems and methods for disabling autonomous vehicle input devices are provided. In one example embodiment, a computer implemented method includes identifying an operating mode of an autonomous vehicle. The method includes determining one or more vehicle input devices to be disabled based at least in part on the operating mode of the autonomous vehicle. The vehicle input devices are located onboard the autonomous vehicle. The method includes disabling the one or more vehicle input devices based at least in part on the identified operating mode of the autonomous vehicle such that an input by a user with respect to the one or more vehicle input devices does not affect an operation of the autonomous vehicle.", "num_citations": "6\n", "authors": ["2270"]}
{"title": "Bundle adjustment using single-track vehicle model\n", "abstract": " This paper describes a method for estimating the 6-DoF viewing parameters of a calibrated vehicle-mounted camera. Visual features are combined with standard in-vehicle sensors and a single-track vehicle motion model in a bundle adjustment framework to produce a jointly optimal viewing parameter estimate. Results show that the vehicle motion model in combination with in-vehicle sensors exhibit good accuracy in estimating planar vehicle motion. This property is preserved, when combining these information sources with vision. Furthermore, the accuracy obtained from vision-only in direction estimation is not only maintained, but in fact further improved, primarily in situations where the matched visual features are few.", "num_citations": "6\n", "authors": ["2270"]}
{"title": "Using augmentation techniques for performance evaluation in automotive safety\n", "abstract": " This chapter describes a framework which uses augmentation techniques for performance evaluation of mobile computer vision systems. Computer vision systems use primarily image data to interpret the surrounding world, e.g. to detect, classify and track objects. The performance of mobile computer vision systems acting in unknown environments is inherently difficult to evaluate since, often, obtaining ground truth data is problematic. The proposed novel framework exploits the possibility to add new agents into a real data sequence collected in an unknown environment, thus making it possible to efficiently create augmented data sequences, including ground truth, to be used for performance evaluation. Varying the content in the data sequence by adding different agents or changing the behavior of an agent is straightforward, making the proposed framework very flexible. A key driver for using augmentation …", "num_citations": "6\n", "authors": ["2270"]}
{"title": "Vehicle brake-control-system, vehicle comprising a brake-control-system and a method for controlling a vehicle brake system\n", "abstract": " A vehicle, a method and a vehicle brake-control-system are provided. The host vehicle comprises a steering wheel, a vehicle brake system, at least one sensor arranged to monitor a sensor monitoring area of a host vehicle surrounding and an autonomous operating arrangement which is arranged to control steering and velocity of the host vehicle in an autonomous operating mode at least partly based on information received from the at least one sensor. The vehicle brake-control-system is arranged to determine if the steering wheel is manually operated when the vehicle is operating in the autonomous driving mode, and if so control the vehicle brake system to perform braking of the host vehicle.", "num_citations": "5\n", "authors": ["2270"]}
{"title": "Safe transitions between a driver and an automated driving system\n", "abstract": " This paper presents a methodology for achieving functional safety for an automated driving system (SAE Level 4) with respect to safe transitions between the driver and the system. Safety analysis and assessment of an implementation example show how to allocate safety requirements on Human-Machine Interface (HMI) components to handle the risks of unfair transition, mode confusion and stuck in transition, respectively. The methodology is appropriate for different assumptions on driver failures. The paper shows how to identify safety requirements on the HMI components, given that there is an assumption of a set of single, double or multiple failures by the driver. Results from this example show that it is sufficient to allocate safety requirements on the sensor and the lock of a control to ensure safe transitions. No safety requirements are needed on visual feedback to the driver, eg, displays.", "num_citations": "5\n", "authors": ["2270"]}
{"title": "A sensor management framework for autonomous UAV surveillance\n", "abstract": " This paper presents components of a sensor management architecture for autonomous UAV systems equipped with IR and video sensors, focusing on two main areas. Firstly, a framework inspired by optimal control and information theory is presented for concurrent path and sensor planning. Secondly, a method for visual landmark selection and recognition is presented. The latter is intended to be used within a SLAM (Simultaneous Localization and Mapping) architecture for visual navigation. Results are presented on both simulated and real sensor data, the latter from the MASP system (Modular Airborne Sensor Platform), an in-house developed UAV surrogate system containing a gimballed IR camera, a video sensor, and an integrated high performance navigation system.", "num_citations": "5\n", "authors": ["2270"]}
{"title": "Method and vehicle for activating an autonomous braking maneuver\n", "abstract": " Embodiments herein relate to a method performed by an autonomous vehicle for activating an autonomous braking maneuver of the autonomous vehicle having an autonomous drive system. The autonomous vehicle detects at least one user initiated request for an autonomous braking maneuver of the vehicle when the vehicle is in a first autonomous drive mode at a speed. The autonomous braking maneuver is at least one of: speed reduction or stop. When the request has been detected, the autonomous vehicle activates the autonomous braking maneuver of the vehicle which reduces the speed and/or brakes the vehicle to a stop.", "num_citations": "4\n", "authors": ["2270"]}
{"title": "Safe transitions of responsibility in highly automated driving\n", "abstract": " This paper presents a method for achieving functional safety for an automated vehicle system with respect to safe transitions between a manual and an automated driver, where any single mistake of the human driver is tolerated. Safety analysis and assessment of an implementation example show how to allocate safety requirements on Human-Machine Interface (HMI) components to handle the risks of unfair transitions and mode confusion. Results from this example show that it is sufficient to allocate safety requirements on the sensor of, and the lock of, a single lever to ensure safe transitions. No safety requirements are needed on visual feedback to the driver, eg, displays.", "num_citations": "3\n", "authors": ["2270"]}
{"title": "Sensitivity analysis and tuning for active safety systems\n", "abstract": " Active safety systems utilize information about the vehicle's state and possibly the surrounding environment to assist the driver if a traffic situation is considered hazardous. The decision to assist the driver is based on sensors that are more or less subjected to errors. In this paper, we study the influence of input perturbations on decision functions in active safety systems. We present a framework for evaluation of system performance, specification of input requirements and decision function tuning. By introducing a robustness measure, describing the robustness to error for the decision function, we derive efficient methods for analyzing the system performance. The framework is demonstrated on experimental data.", "num_citations": "3\n", "authors": ["2270"]}
{"title": "On worst case performance of collision avoidance systems\n", "abstract": " Automotive Collision Avoidance and Mitigation (CA/CM) systems help drivers to avoid collisions through autonomous interventions by braking or steering. If the decision to intervene is made too early, the intervention can become a nuisance to the driver and if the decision is made too late, the safety benefits of the intervention will be reduced. Decision timing is thus crucial for the successful operation of a CA/CM system. The decision to intervene is commonly taken when a threat function reaches a specific threshold. The dimensionality of the input state space for the threat function is in general very large making exhaustive evaluation in real vehicles expensive and time consuming. This paper presents a method for efficient estimation of a lower bound on CA/CM system performance, i.e. the worst case performance. The method is applied on an example system for a set of longitudinal single object escape scenarios …", "num_citations": "3\n", "authors": ["2270"]}
{"title": "Visual Landmark Selection and Recognition for Autonomous Unmanned Aerial Vehicle Navigation\n", "abstract": " Reliable localisation is an essential component of a successful autonomous vehicle system. Using GPS makes the vehicle dependent on an external system. Possible technical and political problems make it impossible to guarantee continuous accessability to this system. Simultaneous Localisation and Map Building (SLAM) is the process of concurrently building a feature based map of the environment and using this map to estimate the locations of the vehicle and the landmark positions. For a SLAM system to function satisfactorily, it needs reliable relative observations of landmarks (features) as input.", "num_citations": "3\n", "authors": ["2270"]}
{"title": "Vehicle observability enhancing system, vehicle comprising such system and a method for increasing vehicle observability\n", "abstract": " A vehicle, a method and a vehicle observability enhancing system are provided. The system is configured to determine if a host vehicle is positioned within selectively one of an observable zone (A) of at least one detected vehicle, or an unsafe unobservable zone (B) of the at least one detected vehicle. If the host vehicle is positioned within the observable zone (A), the system is arranged to generate a control signal indicative of maintaining the host vehicle in the observable zone (A) of the at least one detected vehicle for at least a predefined time duration before the host vehicle is allowed to enter an unsafe unobservable zone (B) of the at least one detected vehicle.", "num_citations": "1\n", "authors": ["2270"]}
{"title": "Validation of collision frequency estimation using extreme value theory\n", "abstract": " There is a lot of focus right now on how to build an autonomous vehicle, which can handle all the situations that a human driver is experiencing. Less is done on how to ensure that these vehicles are safe enough to be released to the public. Using traditional statistical methods would require one to drive extensive distances without incidents to prove the safety to a sufficient degree. Recent research has shown the possibility of using near-collisions in order to estimate the frequency of actual collisions using Extreme Value Theory. In order to trust these estimations, the precision of these estimates needs to be validated. The results from a 250 000 km field test shows that the Extreme Value estimations are reasonable in relation to a crash statistics estimate for rear-end collisions. This further suggests that extreme value is a method that can be used to predict collision frequencies from data containing no collisions.", "num_citations": "1\n", "authors": ["2270"]}