{"title": "CASS: A context-aware simulation system for smart home\n", "abstract": " Ubiquitous computing (ubicomp) environments provide access to information and computing resources for users at any time and anywhere. In the approaching ubiquitous ear, many self-adaptive applications are emerging. These can be made to adapt to the environment within which the application operates. Context information is the key to producing self-adaptive applications in ubicomp environments. However, the supporting infrastructure that generates context information can be made dynamically responsive to the environment. Therefore, for the development of self-adaptive applications, it is necessary to demonstrate that valid context information can be created by virtual sensors instead of physical sensors. In this paper we present a context aware simulation system called CASS. In particular, it generates the context information associated with virtual sensors and virtual devices in a smart home domain. By …", "num_citations": "90\n", "authors": ["2206"]}
{"title": "Variability modeling to develop flexible service-oriented applications\n", "abstract": " To cope with requirement changes flexibly and rapidly, the existing component-based paradigm is being evolved into a service-oriented computing paradigm. The main characteristic of the service-oriented computing paradigm is that service-oriented applications are developed as loosely coupled services that reflect business concerns. This paradigm also promotes business agility, facilitating quick reactions to business changes. Therefore, to enhance and support the benefits of the service-oriented computing paradigm, we must consider how to improve flexibility and reusability during the development of service-oriented applications. We propose the variability modeling approach to specify and control the common and distinguishing characteristics of service-oriented applications. That is, the key concepts of product-line technology can be used to make service-oriented applications more flexible and …", "num_citations": "27\n", "authors": ["2206"]}
{"title": "An approach to developing reusable domain services for service oriented applications\n", "abstract": " Today, the software environment paradigm is shifting to service-oriented computing, based on key features that reflect business concerns. The SOMA and SOUP methodologies can be used to develop service-oriented applications. However, these approaches focus on developing monolithic service applications. Therefore, we propose a feature-based reusable domain service development approach to create more reusable and flexible domain services offering commonality and variability.", "num_citations": "20\n", "authors": ["2206"]}
{"title": "Virtual cloud bank: consumer-centric service recommendation process and architectural perspective for cloud service brokers\n", "abstract": " A paradigm shift from a PC-centric to a cloud computing environment has occurred because of rapid and continuous improvements in the IT environments. With the expansion of cloud computing, various types of cloud services are emerging, collectively known as XaaS (that is, “everything as a service”), including Infrastructure as a Service, Platform as a Service, and Software as a Service. Therefore, an intermediation entity known as a CSB (cloud service broker) is required that interrelates cloud service providers and cloud consumers. However, CSBs remain an active research area in industry and academia. With the diversification of cloud services and the emergence of services with similar functions, the role of the CSB to recommend cloud services that meet the requirements of various consumers has become increasingly important. In this paper, to allow CSBs to provide appropriate cloud services from …", "num_citations": "12\n", "authors": ["2206"]}
{"title": "Development of simulation system for validating contextual rule in smart home\n", "abstract": " The realization of a smart home is accelerating with the approach of the ubiquitous computing era. A smart home should provide proper service as user's preference. In addition, it should guarantee appropriate responses to changes in the external environment. To achieve these objectives, a smart home requires a service definition that is provided by smart home environment and a validation approach for a defined service activity. If these steps are not included in smart home implementation, then a lot of time will be spent in fixing errors and for maintenance. Therefore, for high quality smart homes and for testing various situations, a simulation system is required. We propose such a simulation system for providing a personalized smart home.", "num_citations": "12\n", "authors": ["2206"]}
{"title": "An approach to enhancing reusabilities in service development\n", "abstract": " Service-oriented computing is an emerging environment for business agility in the software industry. Today, there is a focus on developing service-oriented software. In this environment, service is a key feature reflecting business concerns. However, there is still debate about how best to reflect business concerns in services and how to create more reusable services. Therefore, in this paper, we propose an approach to enhancing the reusability of service development based on the concept of the product line.", "num_citations": "10\n", "authors": ["2206"]}
{"title": "The BCD view model: Business analysis view, service Composition view and service Design view for service oriented software design and development\n", "abstract": " Service-Oriented Architecture (SOA) is a conceptual architecture that was proposed for supporting service-oriented computing. To obtain a successful design and development of service-oriented software, an architectural view model to represent and document various aspects of service-oriented software based on the SOA conceptual template is required. Various architectural view models have been proposed to support the design and development of objectoriented and component-based software, e.g., the 4+1 view model and Soni's architecture. However, research and academic literature on architectural approaches for service-oriented software are still scarce. We propose a practical and simple architectural view model focused on the design and development of service-oriented software called BCD, which consists of a Business analysis view, a service Composition view, and a service Design view. Using the …", "num_citations": "10\n", "authors": ["2206"]}
{"title": "NSAF: An approach for ensuring application-aware routing based on network QoS of applications in SDN\n", "abstract": " The advent of software-defined networking (SDN) has led to the paradigm of programmable network environments. Conceptually, the structure of SDN is divided into three layers: application, control, and infrastructure. The SDN controller in the control layer can configure and execute the routing of applications to the infrastructure layer consisting of network devices, including hosts and switches. Current studies on SDN have predominantly focused on control layer aspects, such as controller development, performance aspects of the controller, and interaction among different controllers and between controllers and network devices. However, to provide seamless network services and efficiently manage network environments, application-aware routing is essential because applications may have different quality of service (QoS) requirements, such as maximum bandwidth and minimum delay. This study proposes the Network Situation-Aware Framework (NSAF) to more efficiently handle application routing based on the QoS requirements and changing network status. A mechanism for supporting the NSAF consisting of application registration, network status monitoring, violation detection, and routing control is also presented. The applicability and feasibility of the proposed NSAF are verified by implementing a prototype. The NSAF may be used as a reference model for efficiently managing SDN-based networks to ensure application QoS.", "num_citations": "8\n", "authors": ["2206"]}
{"title": "Approach for cloud recommendation and integration to construct user-centric hybrid cloud\n", "abstract": " Hybrid cloud is an emerging cloud deployment model that integrates public and private clouds. The key technology in building a hybrid cloud environment is the method of integration of different types of clouds. However, research on cloud integration technology and related solutions is lacking. Therefore, the adoption of hybrid cloud environment has been delayed. In this paper, we propose a hybrid CSB (cloud service broker) architecture, which supports hybrid cloud construction by extending the concept of CSB to solve this problem. This paper focuses on service recommendation and integration functions, which are the most important functions of hybrid CSB, and suggests a recommendation method considering user requirements and private cloud environments; further, it describes the process of integrating different types of clouds using an integration script. The recommendation and integration method …", "num_citations": "7\n", "authors": ["2206"]}
{"title": "A modeling approach for business processes based on variability\n", "abstract": " The business processes of an enterprise are its core asset, enabling a prompt and flexible response to business changes. Recently, business processes have attracted considerable interest with the emergence of service-oriented computing environments. In these environments, the business process acts as a connection point between the business and information technology. Therefore, a systematic and practical process model is required to develop business processes efficiently. We propose a process model that consists of a business definition and a business decision, and a process definition phase for developing a business process by combining product-line concepts. The proposed process model can facilitate the efficient development of a business process by providing explicit templates and supporting tools.", "num_citations": "7\n", "authors": ["2206"]}
{"title": "C-RCE: an approach for constructing and managing a cloud service broker\n", "abstract": " Recent years have seen a paradigm shift from PC-centric computing to cloud computing. The advent of cloud computing has led to the emergence of various cloud services and providers. Cloud service brokers (CSBs) were introduced to serve as intermediaries between cloud service providers and cloud users who wish to select an appropriate cloud service. A CSB requires intermediation technologies with service recommendation, contract management, and cloud service usage assistance (such as evaluation) capabilities. These intermediation technologies enable CSBs to increase the quality of cloud service usage. However, currently commercially available CSBs fail to satisfy user requirements. In addition, many open research problems remain in the technologies and approaches underpinning CSB intermediation technologies. This paper proposes Cloud Service—Recommendation, Contract, and …", "num_citations": "6\n", "authors": ["2206"]}
{"title": "Virtual cloud bank: Cloud service broker for intermediating services based on semantic analysis models\n", "abstract": " With the expansion of the cloud computing paradigm, various cloud services are emerging. As a consequence, the utilization of cloud services has increased. However, the complexity of cloud service usage is also increasing, because the cloud providers have different performance levels and prices for cloud services that offer similar functions. Therefore, there is a need for a Cloud Service Brokerage (CSB). CSBs act as intermediaries to the cloud services to fulfill the requirements of the tenants. In this paper, we present a CSB called a Virtual Cloud Bank (VCB). This includes a Tenant Analysis Model, which is used to collect and analyze the tenant requirements, a Service Analysis Model, which is used for the specification and analysis of various cloud services, and a Cloud-service Query and Inference Model, which is used for querying and inference of the cloud services. Our VCB can be utilized as a reference …", "num_citations": "6\n", "authors": ["2206"]}
{"title": "Registry and discovery of services with variability based on 2-level UDDI\n", "abstract": " Through the introduction of SOA(Service Oriented Architecture), enterprises have recently had the benefit of legacy software reuse, heterogeneous environment integration, and ROI(Return On Investment) maximization. SOA consists of a service client, service provider, and service registry. Within this environment, we proposed a service with variability on the basis of a product line concept. Services with variability are generalized services that have similar domain functions, however, they differ in their applications. They require a variability management mechanism with registry and discovery capability for proper registry and use in an SOA interaction model. In this paper, we propose and design an approach for registering and discovering a service with variability based on a 2-level UDDI for reusing a service with variability as a service. First-level registry and discovery consist of registering a service with variability …", "num_citations": "6\n", "authors": ["2206"]}
{"title": "Virtual cloud bank: an architectural approach for intermediating cloud services\n", "abstract": " With the recent advent of the cloud computing paradigm, the concept of a cloud service broker (CSB) is rapidly emerging. The general role of the CSB is to intermediate cloud services. However, to adopt and realize this concept, we need to identify the primary stakeholders, define key requirements, and define the overall structure of the CSB. It is these architectural concerns on which the present paper is focused. We propose a CSB we refer to as the virtual cloud bank (VCB). It intermediates tenant-centric cloud services that fulfill the requirements of tenants. We also define the stakeholders, their requirements, and the architecture of VCB. VCB is proposed in part for wider use as an architectural template and base model for the realization and adoption of CSBs within a cloud computing paradigm.", "num_citations": "5\n", "authors": ["2206"]}
{"title": "A feedback-based approach to validate SWRL rules for developing situation-aware software\n", "abstract": " Recently, the Web Ontology Language (OWL) and Semantic Web Rule Language (SWRL) have been widely used to construct situation-aware environments. However, incorrect situations can be inferred, and these decrease the quality of situation-aware services. SWRL rules are one of the main causes of incorrectly inferred situations. Therefore, in this paper, we propose an approach to validate SWRL rules by applying feedback, a key concept used in software cybernetics research. We propose a feedback-based approach that consists of preparation, structural analysis, contextual analysis, and SWRL rule adaptation. Using the proposed approach, we can systematically detect errors and adapt the SWRL rules accordingly. Furthermore, our method can be used as a base model to validate SWRL rules for situation-aware software.", "num_citations": "5\n", "authors": ["2206"]}
{"title": "Quality metrics of cloud service based on cross-cutting and SLA specification mechanism\n", "abstract": " Depending on the increase amongst various cloud services, the technology of the Cloud Service Broker (CSB) to find the most appropriate services to meet the needs of cloud service consumers has emerged. In order to advance for cloud services to be used through the CSB, it is important to ensure the quality level that meets the demands of consumers through a negotiation process based on the Service Level Agreement (SLA). However, quality metrics of cloud services are different from each other based on the measurement scale, which represents the quality level, and the calculation for each type of cloud services. Therefore, it is necessary to analyze the variability of the quality of cloud services and establish a SLA model for ensuring and improving the level of quality. In this paper, we analyze the quality metrics for the specific type of cloud services by applying the cross-cutting concept and propose a Virtual SLA (VSLA) meta-model.", "num_citations": "4\n", "authors": ["2206"]}
{"title": "Variability-based Service Specification Method for Brokering Cloud Services\n", "abstract": " As the prevalence of cloud computing increases, various cloud service types have emerged, such as IaaS, PaaS, and SaaS. The growth and diversification of these cloud services has also resulted in the development of technology for cloud service brokers (CSBs), which serve as intermediate cloud services that can assist cloud tenants (users) in deploying services that fit their requirements. In order to broker cloud services, CSBs require the specification of structural models in order to facilitate the analysis and search for cloud services. In this study, we propose a variability-based service analysis model (SAM) that can be used to describe various cloud services. This model is based on the concept of variability in the software product line and represents the commonality and variability of cloud services by binding variants to each variation point that exists in the specification, quality, and pricing of the services. We also propose a virtual cloud bank architecture as a CSB that serves as an intermediate to provides tenants with appropriate cloud services based on the SAM.", "num_citations": "4\n", "authors": ["2206"]}
{"title": "Approach for selecting and integrating cloud services to construct hybrid cloud\n", "abstract": " With the popularization of cloud computing, various cloud services have emerged, and hybrid clouds that can take advantage of combining public and private clouds are attracting attention. However, because of their variety, determining a combination of cloud services suited to the user’s current environment and requirements is expensive when deploying a hybrid cloud. Even if the required services are available, there is a lack of tools to connect them, manage them in batches, and utilize the integrated environment. To solve these problems, this paper proposes a cloud selection and integration process (C-SIP), which selects and integrates a combination of cloud services through a hybrid cloud service broker (hybrid CSB), which is an automation solution supporting hybrid cloud deployment. Moreover, the proposed method is realized using a script including the application programming interface of each cloud …", "num_citations": "3\n", "authors": ["2206"]}
{"title": "An approach to creating an ontology and rule set for situation aware software in mobile environments\n", "abstract": " With the recent advent of mobile devices such as smart phones and tablet PCs, everyone wants to receive personalized service and control the environment using a mobile device (i.e., ubiquitous computing). To fulfill this requirement, the necessary, key technology is situation awareness. Today, ontology-models are widely used for representing and constructing the information of a situation. However, the existing approaches to developing ontology models lack considerations for situation awareness and the design of rule sets that can be used to infer the nature of a situation. In this paper, we propose a methodology to creating an ontology and rule set for mobile situation-aware software. This methodology is based on the proposed ontology, namely, Core Ontology for Mobile (COM). This approach enables us to develop and create the necessary ontology and rule set for mobile situation-aware software in a …", "num_citations": "3\n", "authors": ["2206"]}
{"title": "An Approach for Reconstructing Applications to Develop Container-Based Microservices\n", "abstract": " Microservices are small-scale services that can operate independently. An application consisting of microservice units can be developed independently as a service unit, and it can handle individual logic without being affected by other services. In addition, it is possible to rapidly distribute the configured microservices by a container, and a container orchestration technology that manages the distributed multiple containers can be realized; thus, it is possible to update and distribute the microservices separately. Therefore, many companies are moving away from existing monolithic structures and attempting to switch to microservices. In this paper, we present a method for reconstructing a monolithic application into a container-based microservice unit. The microservices of data units are derived through the collection and analysis of monolithic design data. Furthermore, we propose a method to generate a template script based on deployment design data so that the derived microservice and support distribution can be implemented in a container environment. The results of a case study conducted verified that the container-based microservices deployed in this study work properly. In addition, for the development of monolithic applications and the development of container-based microservices presented in this paper, we confirmed that developing on the basis of microservices is efficient by conducting execution time performance evaluation for API calls at various iterations. Finally, we show that microservices constructed using the proposed method have higher reusability than those constructed using existing methods.", "num_citations": "2\n", "authors": ["2206"]}
{"title": "Pattern-based cloud service recommendation and integration for hybrid cloud\n", "abstract": " Hybrid Cloud, which is a cloud deployment model that integrates the public cloud and private cloud, is gaining considerable attention recently. The key technology for building a Hybrid Cloud environment involves the integration of different types of clouds. In this paper, the concept of Hybrid CSB and a method to solve the cloud integration problem are proposed. We present a structure for recommending a service based on a pattern according to users' requirements. In addition, we propose a method for integrating the recommended services with an integration script and a script generation process. The recommendation and integration method proposed in this study is expected to be used as an underlying technology to facilitate the transition to the Hybrid Cloud environment.", "num_citations": "2\n", "authors": ["2206"]}
{"title": "An approach to realizing a service with variability for service oriented applications\n", "abstract": " CiNii 論文 - An approach to realizing a service with variability for service oriented applications CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年 まで 検索 検索 検索 CiNii窓口業務の再開について An approach to realizing a service with variability for service oriented applications PARK J. 被引用文献: 1件 著者 PARK J. 収録刊行物 J. KIISE : Software and Applications J. KIISE : Software and Applications 38(2), 2011 被引用 文献: 1件中 1-1件を 表示 1 Two-Level Service-Oriented Architecture Based on Product-Line PARK Joonseok , MOON Mikyeong , YEOM Keunhyuk IEICE transactions on information and systems 95(12), 2971-2981, 2012-12-01 参考文献24件 Tweet 各種コード NII論文ID(NAID) …", "num_citations": "2\n", "authors": ["2206"]}
{"title": "Two-Dimensional Framework for Analyzing Variabilities in Software Product Lines\n", "abstract": " Commonality and variability play central roles in all product line development processes. Indeed, at each phase of core assets development, variabilities can exist at different levels of abstraction and in addition can be concretized by different artifacts. In this paper, we suggest a 2-dimensional framework for analyzing variabilities of core assets in software product lines. In the vertical analysis, variations are analyzed at different abstract levels, in which the region of commonality is first identified, and variation points are accordingly defined. In the horizontal analysis, variation types are elaborated according to the characteristics of requirements and architecture. With this framework, the variability of assets can be consistently and explicitly described, allowing variations to be traced in core assets and seamless reuse of core assets across the entire life cycle.", "num_citations": "2\n", "authors": ["2206"]}
{"title": "Architecture of virtual cloud bank for mediating cloud services based on cloud user requirements\n", "abstract": " The concept of Cloud Service Brokerage (CSB) has been introduced as a result of the expansion of the cloud-computing paradigm. Cloud services that provide similar functionality are registered with a CSB. A CSB intermediates cloud services between cloud users and providers. However, there are differences in the price and performance offered by each of the cloud providers. Thus, cloud users have difficulty in finding suitable services to use. Therefore, a CSB is required in order to provide an approach for cloud services to fulfill the requirements of cloud users. In this paper, we propose a virtual cloud bank architecture that includes both a Service Analysis Model (SAM) that can be used to specify and analyze various cloud services and a requirement analysis method that can be used to collect and analyze the cloud user requirements. The VCB architecture that is herein proposed can be used as a reference architecture to provide user-centric cloud services.", "num_citations": "1\n", "authors": ["2206"]}
{"title": "Mobile situation‐aware framework for developing smart mobile software\n", "abstract": " Advances in mobile technology and significantly increasing utilization of mobile devices such as smartphones and tablets have resulted in a paradigm shift from PC‐centric computing to mobile computing. The results of careful analysis conducted of this mobile landscape indicate that there is a growing demand for smart, user‐centric, situation‐aware mobile software. Invariably, concomitant with this demand is the need for methodologies that can provide support the development of this type of software. In this paper, we propose a semantic framework, called the mobile situation‐aware framework, which supports efficient modeling, construction, processing, management, and inference of mobile situation information. The framework comprises two phases, situation modeling and situation construction, and can serve as a guide and a template in the development of situation‐aware applications for the mobile …", "num_citations": "1\n", "authors": ["2206"]}
{"title": "Two-Level Service-Oriented Architecture Based on Product-Line\n", "abstract": " Software product-line engineering is the successful reuse of technology when applied to component-based software development. The main concept and structure of this technology is developing reusable core assets by applying commonality and variability, and then developing new software reusing these core assets. Recently, the emergence of service-oriented environments, called SOA, has provided flexible reuse environments by reusing pre-developed component structure as service units; this is platform-independent and can integrate into heterogeneous environments. The core asset of an SOA is the service. Therefore, we can increase the reusability of an SOA by combining it with the concept of a product-line. These days, there exists research that combines SOA and product-lines, taking into account reusability. However, current research does not consider the interaction between the provider and …", "num_citations": "1\n", "authors": ["2206"]}
{"title": "An Approach to Developing Service Descriptions Based on Product Line\n", "abstract": " Software product line engineering is an approach to creating core assets by systematically exploits common that can be highly reusableand different characteristics in related system families that is domain. By adapting this approachin object and component paradigm, software productivity is extended. Recently, Software development paradigm is changed to service oriented paradigm which is using services that are core assets. Therefore, to develop service oriented software more flexible, systematic and to enhance business agility about business changes, we need adaptation of product line to creation of services that are core assets. In this paper, we propose an approach to create and specify domain service through combine of product line and service oriented paradigm. Domain service explicitly specifies commonality and variability by domain service common/optional property variability, operation type variability, message type variability. By using this approach, it can support efficient and flexible service oriented development by producing various services through customization of domain service for the purpose.", "num_citations": "1\n", "authors": ["2206"]}
{"title": "An Approach for Designing Self-Adaptive Software based on Context Information\n", "abstract": " 최근 유비쿼터스 컴퓨팅 환경의 실현 가능성이 높아지면서 동적으로 변화하는 외부 환경에서의 소프트웨어 역할이 중요해지고 있다. 유비쿼터스 환경의 소프트웨어는 다양한 센서로부터 입력되는 문맥정보를 분석하고 그 결과에 따라 적절하게 서비스를 제공할 수 있는 자기적응형 (self-adaptive) 소프트웨어 형태가 되어야 한다. 이러한 특징을 가진 소프트웨어를 개발하기 위해서는 문맥정보에 대한 정적분석 활동과 문맥 변화에 상호 작용하는 동적분석 활동이 개발 전 과정에 걸쳐 체계적으로 수행되어야 한다. 본 연구에서는 외부 환경의 문맥정보에 가변적으로 반응하는 자기적응형 소프트웨어의 요구사항을 분석하고, 문맥정보 조건에 따라 재구성 가능한 컴포넌트 기반 아키텍처를 설계하기 위한 자기적응형 소프트웨어 설계 방법을 제시한다. 또한 본 연구의 방법을 적용하여 설계한 스마트 홈 시스템에 대한 사례연구를 소개한다.", "num_citations": "1\n", "authors": ["2206"]}