{"title": "Open innovation and public administration: transformational typologies and business model impacts\n", "abstract": " Extant research demonstrates that e-Government initiatives often fall short of achieving innovative forms of government and governance due to a techno-centric focus that limits such initiatives to minor improvements in service delivery. While it is evident that innovation is central to modernising and transforming governmental organisations, and that the co-creation of services by public authorities and community groups is an essential component of realising the benefits of investment in information and communication technology, there is little research focusing on the nature of innovation in transforming governmental organisations and services. Addressing this gap in the literature, this paper explores how open innovation strategies can transform public administration by examining how a network of municipalities in Sweden transforms value creation and service delivery by collaborating with each other and with …", "num_citations": "188\n", "authors": ["897"]}
{"title": "‘Orchestrating’sustainable crowdsourcing: A characterisation of solver brokerages\n", "abstract": " Exemplars of open innovation have revealed that intellectual property (IP) need not only be sourced through existing hierarchical or market relationships. Rather IP can be acquired from individuals and firms with whom an organization has no prior relationship. In such cases, an intermediary, operating as an innovation exchange or brokerage, frequently facilitates the development and acquisition of IP. This paper examines one type of innovation intermediary, the ‘Solver Brokerage,’ which enables innovation exchanges between organizations and unknown external firms and individuals (i.e. a crowdsourcing process). While the commercial success of Solver Brokerages indicates the potency of arguments concerning the potential of crowdsourcing, little is known about the operation of such brokerages or the crowdsourcing processes that they enable. This paper examines extant research on innovation networks …", "num_citations": "170\n", "authors": ["897"]}
{"title": "Emerging technologies and the democratisation of financial services: A metatriangulation of crowdfunding research\n", "abstract": " Crowdfunding has grown quickly and attracted significant scholarly attention. However, the diverse approaches to crowdfunding that have emerged, as well as the uncertain relationship of these approaches to the umbrella concept of crowdsourcing, means it is not clear to what extent crowdfunding presents theoretically novel behaviours, nor what those behaviours may be. This study addresses this lack of clarity through a metatriangulation of 120 peer-reviewed studies on crowdfunding. These studies are distributed across the four dominant categories of crowdfunding, namely crowd lending, crowd equity, crowd patronage, and crowd charity. Research for each category is analysed separately to determine the topics of interest, the dominant theoretical perspectives, the methods employed, and the typical focus of analysis. We bridge these categories to identify three common variables relating to funding behaviours …", "num_citations": "118\n", "authors": ["897"]}
{"title": "Designing a core IT artefact for Knowledge Management Systems using participatory action research in a government and a non-government organisation\n", "abstract": " There is a growing interest in the application of information technologies (IT) for Knowledge Management (KM) in the public sector; there is, however, a dearth of research on the design and development of effective, integrated Knowledge Management Systems (KMS). Consequently, public sector organisations and private sector enterprises are offered little in the way of guidance in designing KMS from the bewildering range of information technologies said to capture, store, retrieve, transfer and apply knowledge. Action research, with its emphasis on praxis and on the importance of ‘situated, practical theory,’ is an ideal vehicle for deepening the IS field’s understanding of the design of IT-enabled Knowledge Management Systems for use in Government and Non-Government Organisations. This paper reports on the outcomes of two related participatory action research studies involving a University R&D team …", "num_citations": "101\n", "authors": ["897"]}
{"title": "Does heart or head rule donor behaviors in charitable crowdfunding markets?\n", "abstract": " Crowdfunding has matured into a meaningful online marketplace, both for traditional e-commerce activities and for charitable fundraising. For charities, crowdfunding presents novel donation behaviors, including those where donors may proactively seek out causes and give (often anonymously) to help others with whom they share little social connectivity. Understanding these behaviors is challenging compared to traditional fundraising behaviors, where charitable giving is partly explained by factors such as guilt avoidance, reciprocity, image, vicarious enjoyment, and group-level benefits. This suggests that some subset of charitable motivations is brought uniquely into focus in crowdfunding marketplaces. These marketplaces are often inhabited by fundseeking individuals and larger formal organizations. This adds further complexity, given that donors traditionally perceive and interact differently with charitable …", "num_citations": "98\n", "authors": ["897"]}
{"title": "Institutionalising information asymmetry: governance structures for open innovation\n", "abstract": " Purpose – This paper aims to explore the ways in which firms utilise hierarchical relationships and the market system to supply and acquire intellectual property (IP) and/or innovation capabilities from sources external to the firm.Design/methodology/approach – The authors conduct a field study to explore emerging governance structures for open innovation, using multiple data sources including documents (e.g. white papers) and interviews published by the firms studied, analysis of the firms' web‐based systems (where applicable), secondary content (e.g. news articles) and elite interviews with key personnel.Findings – The analysis of seven exemplars of open innovation reveals that inter‐organisational relationships that facilitate open innovation can be categorised based on whether they are mediated or direct, and seek to exchange intellectual property or innovation capability. Using this categorisation, the …", "num_citations": "85\n", "authors": ["897"]}
{"title": "Social media as a support for learning in universities: an empirical study of Facebook Groups\n", "abstract": " This paper explores social media use for learning in universities, through a study of the use of Facebook Groups by undergraduate students. The objective of the research is specifically to understand what motivates students to use Facebook Groups and what benefits they receive from doing so. The study is grounded in the Guo et al. (2012) Student Technology Use Hierarchical Framework (STUH), drawn from Uses and Gratifications Theory (U&G), and from Means End Chain Theory (MEC). The STUH Framework was adapted by this research, and validated and revised through survey research to create an amended STUH framework for Facebook Groups. The findings conclude that the attributes of Facebook Groups lead to interaction which in turn satisfies the higher level information and decision making needs of students. The findings have important implications for software designers and educators, as well as …", "num_citations": "73\n", "authors": ["897"]}
{"title": "A rift in the ground: Theorizing the evolution of anchor values in crowdfunding communities through the oculus rift case study\n", "abstract": " Recently, many people have discussed crowdfunding’s role in developing new products and new businesses. However, crowdfunding is driven not only by economics but also by a set of shared values; values that unite communities of funders and anchor them to specific projects. We theorize how these anchor values evolve by analyzing one extreme case, specifically the Oculus Rift virtual reality headset developer kits. The Oculus Rift had significant success on Kickstarter fundraising and generating interest in virtual reality. However, they also caused controversy when the company was subsequently sold to Facebook for US $2 billion, a move that some argued contradicted the principles of crowdfunding. We perform a grounded theory analysis of public discourse from mid-2012 to mid-2014. That analysis suggests the Kickstarter community’s response to events around the Oculus Rift was ultimately self …", "num_citations": "71\n", "authors": ["897"]}
{"title": "New kid on the block: a strategic archetypes approach to understanding the Blockchain\n", "abstract": " Emerging Blockchain technologies have received considerable attention in the financial services domain. This is due to the potential of those technologies to radically disrupt existing financial systems by introducing new types of assets and new ways of managing transactions. Yet many of these technologies are so new and seemingly complex that strategic decision-makers may not fully understand the alternative Blockchain technologies on offer, let alone the costs and benefits associated with specific instantiations. This paper reviews the Blockchain literature and identifies eight key system design characteristics. From this, four Blockchain archetypes emerge, each of which is presented using a recognizable existing system to allow tangible discussion of similarities and differences across archetypes. The identification of these archetypes provides an important foundation for future research, enabling in-depth research to be conducted that will outline the costs, benefits, risks, and issues associated with each archetype.", "num_citations": "48\n", "authors": ["897"]}
{"title": "Social identity and social media activities in equity crowdfunding\n", "abstract": " The existence of crowdfunding platforms has helped creators to bring their innovative products to market. In recent years, equity crowdfunding has increased in popularity as an alternative form of finance, and has helped thousands of innovating entrepreneurs to raise money, and join a broader conversation with large numbers of potential investors. Early-stage startup investment is no longer restricted to venture capital firms and high net worth angel investors. Using Social Identity Theory (SIT) as a basis, we look at a sample of crowdfunding campaigns from the UK-based platform, Crowdcube. In this study we are trying to understand how groups of potential crowdfunding investors act in relation to the social media activities of those campaigns. We examine how different social media activities of can have an impact upon the funding of a crowdfunding campaign. This study has significant implications for fundraisers …", "num_citations": "41\n", "authors": ["897"]}
{"title": "Exploring the affordances of social networking sites: An analysis of three networks\n", "abstract": " Social network sites (SNS) are becoming increasingly important, both for individuals and organizations. These systems have affected social and cultural activities, work practices, and in particular the ways in which we discover, share and consume information goods. The functionality of SNS is emergent, shaped by user appropriation choices. In this paper, affordances are proposed as a way to understand the potential uses and future evolution of SNS. Affordances describe the characteristics of an interactive system which suggests how the system should be used. The objective of this study is to explore the affordances of SNS. The study comprises an inventory of the affordances of three popular SNS. The study reveals a diverse collection of software features which afford user behaviour in six areas of activity: social connectivity, social interactivity, profile management, content discovery, content sharing and content aggregation. The findings of the study provide a rich foundation for future research on user appropriation of SNS, the future evolution of SNS, and the design of SNS systems.", "num_citations": "40\n", "authors": ["897"]}
{"title": "Delivering the whole product: business model impacts and agility challenges in a network of open source firms\n", "abstract": " It has been argued that competitive necessities will increasingly require OSS companies to participate in cooperative business networks in order to offer the complete product/service (whole product) demanded by customers. It is envisaged that these business networks will enhance the business models of participant firms by supplementing their value-adding activities and increasing responsiveness to customers. However, while such propositions have intuitive appeal, there is a lack of empirical research on such networks. This article examines Zea Partners, a network of small open source companies cooperating to deliver the ‘whole product’in the area of content management systems (CMSs). It investigates how participation in the network augments the business models of participant companies and identifies the business agility challenges faced by the network. The article concludes that reconciling the …", "num_citations": "40\n", "authors": ["897"]}
{"title": "Information sharing and user behavior in internet-enabled peer-to-peer lending systems: an empirical study\n", "abstract": " Internet-based information systems (IS) have enabled various forms of collective intelligence, action, and resources (e.g. open source software, innovation marketplaces, crowdsourcing, and crowdfunding). Within the domain of crowdfunding, Internet-enabled Peer-to-Peer Lending Systems (IP2PLS) have emerged as a disruptive technology, with implications for the financial services sector, business capitalization strategies, and personal and community development. IS research investigating user behavior in IP2PLS has revealed the saliency of social identity and personal transparency (as expressed through information sharing) in such systems. Prior research has largely focused on a small number of IP2PLS providers, thus this study examines a very large but under-researched platform. The study tests a theoretical model based on Social Identity Theory and prior IP2PLS studies, through an analysis of 116,667 …", "num_citations": "36\n", "authors": ["897"]}
{"title": "Developing open source software: a community-based analysis of research\n", "abstract": " Open source software (OSS) creates the potential for the inclusion of large and diverse communities in every aspect of the software development and consumption life cycle. However, despite 6 years of effort by an ever growing research community, we still don’t know exactly what we do and don’t know about OSS, nor do we have a clear idea about the basis for our knowledge. This paper presents an analysis of 155 research artefacts in the area of open source software. The purpose of the study is to identify the kinds of open source project communities that have been researched, the kinds of research questions that have been asked, and the methodologies used by researchers. Emerging from the study is a clearer understanding of what we do and don’t know about open source software, and recommendations for future research efforts", "num_citations": "35\n", "authors": ["897"]}
{"title": "Promoting knowledge sharing in government and non-government organizations using open source software: the pKADS story\n", "abstract": " This paper reports on the development of an innovative Open Source Software solution called the Portable Knowledge Asset Development System (pKADS). pKADS is a desktop-based knowledge management system whose purpose is to promote knowledge sharing in government and nongovernment organisations, which the United Nations views a being pivotal to the inclusion of developing nations in the knowledge society. The institutional context for the development of this system is delineated, as are the system’s conceptual and technical architectures. The paper concludes with suggestions for the application of pKADS and its implications in shaping subsequent e-Government initiatives.", "num_citations": "27\n", "authors": ["897"]}
{"title": "Exploring the application of blockchain technology to combat the effects of social loafing in cross functional group projects\n", "abstract": " Today, many multi-national organisations operate in a dispersed geographical environment. Teams consisting of members from around the globe can be assembled on an as-needed basis. However, this can prove to be a complex managerial task. Individuals, who believe that their efforts are not being effectively monitored by upper management, lose their motivation to fully contribute to the best of their abilities as they do not believe there is any correlation between the effort they exert and the reward they receive. With low levels of intrinsic involvement among employees, a lack of task visibility from upper management and limited social interaction among group members, many organisations struggle to combat the issue of social loafing in cross functional working groups. Blockchain technology, widely acknowledged as enabling openness, can facilitate the development of an immutable, transparent, secure and …", "num_citations": "25\n", "authors": ["897"]}
{"title": "Procedurally transparent design science research: A design process model\n", "abstract": " This paper presents a process model for Information Systems (IS) scholars conducting Design Science Research (DSR). The paper argues that the impact of DSR on the IS discipline has been inhibited by perceived limitations in the rigor of DSR studies, and that such perceptions are often due to a lack of procedural transparency surrounding the development process in DSR studies. To help address this issue, the paper presents the Process Model for increased Procedural Transparency (PMPT). A range of design literature is analyzed to identify and characterize the distinct stages of design-oriented research. These stages are laid out in a process model, which is then bound in a recursive instantiation, and demonstrated through an application. The paper concludes with a discussion of the contribution of PMPT, as well as opportunities for future research.", "num_citations": "21\n", "authors": ["897"]}
{"title": "Seeking the entanglement of immersion and emergence: Reflections from an analysis of the state of IS research on virtual worlds\n", "abstract": " This paper critically reviews the state of virtual world research within the Information Systems field; revealing areas of interest evident in research studies between 2007-2011, the methods employed to conduct such research, the theories/frameworks used to ground VW research, as well as reoccurring memes/concepts. We argue that virtual worlds are best interpreted as both an immersive and emergent co-creative process,‘performed’by users’ actions and interactions both with other users and with artifacts such as virtual goods. Nevertheless, our analysis reveals a near neglect of the substantive nature of digital materiality and of the emergent nature of virtual worlds. We conclude that this ‘human-centric’stance has taken focus away from the unique nature of the virtual world artifact itself, and posit a research agenda that focuses on virtual world objects as well as the immersive and emergent activities of ‘world-builders’ as necessary to advance virtual world research.", "num_citations": "17\n", "authors": ["897"]}
{"title": "Co‐operatively re‐engineering a financial services information supply chain: A case study\n", "abstract": " This paper presents a case study of the co‐operative design, development, and implementation of an XBRL‐enabled interorganizational system (IOS) by the Australian Prudential Regulation Authority, the Reserve Bank of Australia (central bank), and the Australian Bureau of Statistics to revolutionize reporting by financial institutions in Australia. The findings illustrate that the complexity of data consumption patterns drove increased interdependence within the financial information supply chain requiring the co‐operative development of context sensitive data exchanges and commodity‐like IT infrastructures. The paper concludes that the co‐operative model to IOS development exhibited here is likely to be more suited to the development of systems for financial information supply chains than the hub and spoke model characteristic of IOS in other sectors. Copyright © 2009 ASAC. Published by John Wiley & Sons, Ltd.", "num_citations": "17\n", "authors": ["897"]}
{"title": "The impact of social network sites on the consumption of cultural goods\n", "abstract": " Social Media has altered the way in which people interact, collaborate and communicate. In particular, social network sites (SNS) have grown tremendously popular and are creating new forms of Web use. The social interactive nature of SNS enables people to share cultural tastes and content across the Web. Cultural goods are hedonic experiential goods and are used in SNS as a means of acquiring and maintaining friendship networks amongst other purposes. Music, in particular, is discussed, shared, and sampled across SNS. The objective of this research is to understand the impact of social networking software on the consumption of cultural goods. Specifically we investigate the affect the functional affordances of SNS have on the consumption tasks for discovering cultural goods (music). This research-in-progress paper defines SNS, outlines the key affordances of SNS, and describes the nature of cultural goods consumption. This is followed by a description of the research objectives, proposed research model, and planned activities for the next stage of the research project.", "num_citations": "16\n", "authors": ["897"]}
{"title": "A categorisation framework for a feature-level analysis of social network sites\n", "abstract": " Social media (SM) have enabled new forms of communication, interaction, and connectivity that affect individuals on a personal and professional level. But SM is a broad term that encompasses a wide range of technologies with both distinct and shared capabilities. In addition, while there is an agreed-upon definition of these systems, a comprehensive list of features and their affordances does not exist. Hence, this study sought to create a feature-level categorisation framework for analysing the use of social network sites (SNS). This categorisation was undertaken using the concept of affordances, which framed the high-level characteristics as well as distinct SNS features, to better understand the divergence in SNS capabilities and inform the study of different types of SM. The framework was created from an analysis of the literature on SNS affordances and a system investigation into three types of SNS (Facebook …", "num_citations": "15\n", "authors": ["897"]}
{"title": "Leveraging ‘the crowd’: an exploration of how solver brokerages enhance knowledge mobility\n", "abstract": " The concept of open innovation has drawn considerable interest from both researchers and practitioners in recent years. We conceptualize the emerging phenomenon of Open Innovation intermediaries (or ‘Solver Brokerages’) as intermediaries that facilitate innovation exchanges between organizations and crowds. The study presents a theoretical model based on extant research, which is refined through a field study consisting of elite interviewing, with representatives from four solver brokerages as well as stakeholders from an innovation-seeking organisation and a solution provider. In exploring how Solver Brokerages enhance knowledge mobility, the paper examines the ways in which providing access to a knowledgeable and diverse solution community, facilitating problem decomposition and articulation, and mechanisms for increasing appropriability affect knowledge mobility. In addition, the paper examines the ways in which filters and rewards affect appropriability as well as the roles played by collaborative mechanisms in mediating these effects.", "num_citations": "15\n", "authors": ["897"]}
{"title": "Investigating collaborative development activities in a virtual world: An activity theory perspective\n", "abstract": " Contemporary virtual worlds provide unique environments in which users may collaborate in the development of shared digital artifacts. However, the ways in which such collaboration takes place is to date under researched. This paper uses an activity theory perspective to analyze the development activities of two communities within the virtual world of Second Life, based on data gathered using ethnographic methods. The study reveals (1) the complimentary and diverging practices utilized by these two different communities of practice,(2) the mediating function of various tools, rules, and work roles in collaborative development activities,(3) the tensions created in such activities and the manner in which users overcome these tensions.", "num_citations": "13\n", "authors": ["897"]}
{"title": "Leveraging distributed collective intelligence: an investigation of solver engagement with innovation challenges\n", "abstract": " There is growing interest in the potential of Internet-enabled crowdsourcing platforms to leverage distributed collective intelligence for innovation purposes. Central to the promise of such platforms is the broad participation of self-selecting innovators. However, the factors affecting solver engagement with specific challenges remains only partially understood. This paper presents a study of the engagement of 15 contestants with 5 different challenges on InnoCentive. The results reveal the effects of a solver’s attitude, their assessment of risk, expected value, challenge characteristics, coping mechanisms and the characteristics of the intermediaries’ website on a solver’s engagement with specific challenges. The analysis reveals that the decision making of solvers can be characterized as an ‘attitude vs. risk’calculus rather than a ‘cost vs. benefit’calculus. Given these results, the paper concludes by discussing our conceptualization of the solver as a “Speculative Freelancer,” which we posit represents a unique emergent form of knowledge work.", "num_citations": "12\n", "authors": ["897"]}
{"title": "\" We Have Everything to Win\": Collaboration and Open Innovation in Public Administration\n", "abstract": " While the concept of open innovation has attracted significant industry and research interest in the past five years, there remains a paucity of research on the application of the concept in noncommercial settings. This paper presents an exploration of a network of Swedish municipal authorities. Within this network, we have observed a move from isolated innovation to the purposive leveraging of knowledge inflows and outflows in a manner characteristic of the open innovation paradigm. This paper presents a characterization of these knowledge exchanges using an existing framework of open innovation archetypes, as well as a description of the business model impacts of these innovation approaches for the participant municipalities. The paper concludes by discussing the implications of the findings for future research.", "num_citations": "12\n", "authors": ["897"]}
{"title": "Thoughts on Studying Open Source Software Communities\n", "abstract": " This speculative paper offers a preliminary discussion of the academic study of open source software (OSS) communities. The paper includes (1) a description of the general growth of OSS research, (2) the argument that an understanding of OSS communities is critical to understanding OSS, (3) a review of the research to date which approaches OSS from a social or ethnographic viewpoint, and (4) an examination of one of the key issues to be addressed in future research on the subject.", "num_citations": "12\n", "authors": ["897"]}
{"title": "Complexity and context: Emerging forms of collaborative inter-organizational systems\n", "abstract": " The paper analyses the collaborative development of emergent IOS in three data intensive industry sectors (telecommunications, news media, and financial services). The findings reveal that environmental complexities (the complexity of data consumption patterns and increased interdependence within value webs) require context-sensitive value exchanges operationalised within co-operatively developed commodity-like IT infrastructures. The paper concludes by examining the implications of the study findings for developing IOS to support pooled, sequential, and reciprocal inter-organisational interdependencies.", "num_citations": "11\n", "authors": ["897"]}
{"title": "Meeting challenges and surviving success: The 2nd workshop on open source software engineering\n", "abstract": " Since Making Sense of the Bazaar: The 1st Workshop on Open Source Software Engineering was held at ICSE 2001, interest in Open Source Software (OSS) has continued to gain momentum, both in the practitioner and research communities. The last year alone has seen the publication of several collections of research [1-4] dealing with both the theory and practice of OSS.", "num_citations": "11\n", "authors": ["897"]}
{"title": "Governance structures for open innovation: A preliminary framework\n", "abstract": " This research-in-progress paper presents a preliminary framework of four open innovation governance structures. The study seeks to describe four distinct ways in which firms utilize hierarchical relationships, organizational intermediaries, and the market system to supply and acquire intellectual property and/or innovation capabilities from sources external to the firm. This paper reports on phase one of the study, which involved an analysis of six open innovation exemplars based on public data. This phase of the study reveals that governance structures for open innovation can be categorized based on whether they (1) are mediated or direct or (2) seek to acquire intellectual property or innovation capability. We analyze the differences in four governance structures along seven dimensions, and reveal the importance of knowledge dispersion and uncertainty to the use of open innovation hierarchies …", "num_citations": "10\n", "authors": ["897"]}
{"title": "The servicitization of peer production: Reflections on the open source software experience\n", "abstract": " The concept of what Yochai Benkler called “peer production” as an alternative mechanism to traditional hierarchies and markets has captured the imagination of numerous communities in contexts ranging from t-shirt design to software to gold mining. While some question the suitability and potential longevity of this mode of production, others are focused on determining ways in which peer-produced products and services can be suitably packaged to meet the requirements of consumers. In particular, the mature peer production phenomenon known as open source software has emerged as a credible alternative to its proprietary counterpart and presents a compelling challenge to both industry and academia as we seek to understand how firms and other organizations can build sustainable business models leveraging the public commons of open source products and the collaborative engine that created them.", "num_citations": "9\n", "authors": ["897"]}
{"title": "Toward sustainable freemium software: The roles of user satisfaction and use context\n", "abstract": " Freemium software provides basic features free of charge and premium features for additional payment. It is a prevailing business model in the software industry. The model could be a long-awaited solution for software providers suffering from sustainability and retention problems. However, software providers are still experiencing low conversion rates from free users to paid users. Satisfactory services do not guarantee additional spending by free users for services. User satisfaction with core services has been considered a key component of user loyalty. However, this belief is being challenged. This study investigates the effect of satisfaction on loyalty intentions (continuance intention and intention to purchase) of freemium software. The study develops a research model based upon the use context framework including user characteristics, relational characteristics, and marketplace characteristics. The results from a series of regressions show that satisfaction affects continuance intention but does not influence purchase intention although it indirectly affects purchase intention by interacting with various characteristics. The results suggest several strategies that freemium software providers can pursue according to their objectives. Rather than satisfactory services, interactions among users or carefully designed additional features can lead to sustainable profitability.", "num_citations": "8\n", "authors": ["897"]}
{"title": "Collaborative development in the virtual world: discourse, digital artefacts and the construction of intersubjective meaning\n", "abstract": " The misconception of virtual worlds as „games‟ has prevented these immersive environments from being treated as legitimate areas of inquiry by the Information Systems community. In this paper we argue that these environments challenge our conceptualisation of technology mediation due to the immersive and co-created nature of the digital environment, and particularly, challenges our understanding of information technology mediated collaborative development activities. Acknowledging the interrelated roles played by both human and non-human actors within virtual worlds, we investigate the construction of intersubjective meaning within three small synchronous collaborative development groups. Our findings highlight the complex roles of mediators within such collaborative activities in immersive environments, and the ways in which such mediation manifests through integrated socio-technical systems that are culturally developed.", "num_citations": "8\n", "authors": ["897"]}
{"title": "Complex network-based information systems (CNIS) standards: Toward an adoption model\n", "abstract": " This paper proposes an adoption model for complex network-based information systems (CNIS) standards which extends current diffusion of innovation theory within a specific technological context, that of ambient intelligence (AmI). The issue of open and closed standards is especially important for networked information systems; however, a range of factors impact the adoption decision and challenge existing models of adoption. Such models are based on DOI theories that have their roots in more simplistic technological innovations. In order to extend the current view on adoption, the adoption context must be closely considered. Agile organizations must constantly survey the external environment to determine the potential of emerging technology. Open standards may make organizations less vulnerable to environmental flux due to uncertainties caused by the lack of transparency of proprietary standards …", "num_citations": "8\n", "authors": ["897"]}
{"title": "What kind of cause unites a crowd? Understanding crowdfunding as collective action\n", "abstract": " This paper explores the types of shared goals that underlie fundraising activities in web-enabled charitable crowdfunding, as well as how these goals unite donors and fundseekers. A grounded theory analysis is undertaken using a stratified sample of records from Pledgie. com, a crowdfunding website dedicated to charitable causes. Content analysis of these records reveals three types of information sharing associated with successful fundraising (1) information supporting impact (2) information supporting morality and (3) information supporting external relationships. These information types are related back to existing literature on collective action to explain how and why communities of donors form around specific fundraising initiatives. Findings suggest that while most existing models of charitable crowdfunding adopt a view of information sharing based on dyadic communication between donors and fundseekers, charitable crowdfunding should also be viewed as a technological paradigm capable of forming action-oriented collectives based around specific causes, beliefs, and/or identities.", "num_citations": "7\n", "authors": ["897"]}
{"title": "Managing risk in business centric crowdfunding platforms\n", "abstract": " Crowdfunding is a rapidly growing phenomenon and is becoming a viable alternative to traditional financial institutions for small business fund seekers. Crowdfunding involves harnessing small individual investments from a large number of investors. This paper explores four key risks associated with crowdfunding: Money Laundering, IP Theft, Fraud, and\" Failure by Success.\" The paper then outlines key research questions for the next stage of the research, which will empirically investigate how crowdfunding platforms self-govern against these risks.", "num_citations": "7\n", "authors": ["897"]}
{"title": "Observations of Non-linear Information Consumption in Crowdfunding\n", "abstract": " The number and scale of crowdfunding platforms has grown rapidly within a short period of time. While some of these platforms offer donors specific financial or material rewards, others ask donors to contribute to campaigns for charitable or philanthropic reasons. This fundamental difference means it is difficult to model interpersonal communication and information consumption in simple linear economic terms. Yet to date the dominant research paradigm for charitable crowdfunding has done exactly that. This study seeks to investigate and model non-linear information consumption based upon a field study of Pledgie.com, an established charitable crowdfunding platform. Quantitative analyses of data from over 5,000 individual crowdfunding campaigns reveal several curvilinear relationships between the information provided and the level of funding received. This suggests that information consumption by …", "num_citations": "6\n", "authors": ["897"]}
{"title": "Open source innovation networks: exploring high and low-density models\n", "abstract": " The concept of open innovation, of which open source software is a well-cited example, has grown in popularity over the past decade. Firms engaged in open innovation leverage external knowledge to accelerate innovation and exploit innovation more effectively. One way in which firms can connect with external sources of knowledge is by participating in value networks with a multitude of external stakeholders. Nevertheless, there are few studies of open innovation value networks, with relatively little known about the characteristics that impact such networks. We seek to address this gap by exploring the networking arrangements of eight European firms that have a formal strategy around open source software (OSS). The findings reveal that firms selectively engage in two types of value networks in order to benefit from open collaboration and innovation – one a high-density network comprising a limited number of familiar partners, the other a low-density network comprising a larger number of often unknown partners. Additionally, these networks are influenced by certain characteristics such as the level of commitment, knowledge exchange, the alignment of objectives and governance.", "num_citations": "6\n", "authors": ["897"]}
{"title": "Conceptualizing the Commons-Based Peerproduction of Software: an Activity Theoretic Analysis\n", "abstract": " Commons-based peer-production (CBPP), as exemplified by community-based open source software (OSS) development, has been posited by Yochai Benkler as an alternative to hierarchies and markets for organizing the production of information goods. This study seeks to conceptualize viable CBPP through an Activity Theoretic analysis of 524 peer-reviewed OSS research artifacts. The analysis reveals the reliance of peer-production communities on complex systems of interrelated tools, rules, and roles as mediating components enabling communities to (i) exploit the two theorized advantages of CBPP (resource allocation and information processing) and (ii) overcome the two theorized challenges associated with this mode of production (motivation and organization). The study clarifies and extends extant understanding of CBPP in several significant ways, and concludes that in order for CBPP to be viable, participants must operate in a sustainable fashion that both enhances the commons and leaves the community intact.", "num_citations": "6\n", "authors": ["897"]}
{"title": "The Australian Prudential Regulation Authority: Managing Regulatory Complexity with XBRL\n", "abstract": " In March 2003, Charles Littrell addressed The Global Association of Risk Professionals luncheon in Sydney, Australia 1. In his speech, Littrell, the Executive General Manager for Policy, Research and Consulting at the Australian Prudential Regulation Authority (APRA), explained the APRA approach to prudential regulation.Littrell stated that APRA’s task was to prudentially supervise Australia’s regulated deposit takers, insurance companies, and superannuation funds (these funds, in total, amount to over 1.5 trillion dollars, ie, more than half Australia’s wealth). He described APRA’s statutory mission “to ensure, to the extent reasonably possible, that regulated financial institutions meet their promises” and noted that APRA “must balance this safety objective with the need to consider competitiveness, contestability, and innovation in the financial system. This means that safety is APRA’s primary but not absolute …", "num_citations": "6\n", "authors": ["897"]}
{"title": "Do you have a source for that? Understanding the Challenges of Collaborative Evidence-based Journalism\n", "abstract": " WikiTribune is a pilot news service, where evidence-based articles are co-created by professional journalists and a community of volunteers using an open and collaborative digital platform. The WikiTribune project is set within an evolving and dynamic media landscape, operating under principles of openness and transparency. It combines a commercial for-profit business model with an open collaborative mode of production with contributions from both paid professionals and unpaid volunteers. This descriptive case study captures the first 12-months of WikiTribune's operations to understand the challenges and opportunities within this hybrid model of production. We use the rich literature on Wikipedia to understand the WikiTribune case and to identify areas of convergence and divergence, as well as avenues for future research. Data was collected on news articles with a focus on the time it takes for an article to …", "num_citations": "5\n", "authors": ["897"]}
{"title": "When to use rewards in charitable crowdfunding\n", "abstract": " Charitable crowdfunding is an important source of funds for charitable organizations. The offer of tokens or rewards is often used to entice potential donors to donate to a cause. This study investigates when it is beneficial to offer rewards in a charitable crowdfunding campaign. Three design principles are developed from the current literature which aim to help in the creation of a successful crowdfunding campaign. Important factors identified were types of donations a charitable organization usually receives, the groups of donors associated with that organization and the need for one time considerably large donations.", "num_citations": "5\n", "authors": ["897"]}
{"title": "Large crowds or large investments? how social identity influences the commitment of the crowd\n", "abstract": " Equity crowdfunding is increasing in popularity as an alternative to traditional financing for start-ups and growth companies to raise money for their business. This study discusses how equity crowdfunding is different from traditional financing, such as angel investors and venture capitalists. We argue this difference is brought further into focus when large numbers of crowd members invest small amounts, as opposed to fewer individuals making large investments. Building on existing research on Social Identity Theory, we look at why some crowdfunding campaigns are more likely to attract these contrasting types of investment (numerous small investments or fewer large investments). A model is presenting linking different characteristics of campaigns to total investment and average investment. This proposed model will be tested using public data gathered from Crowdcube, a leading UK-based equity crowdfunding platform. This study has significant implications for fundraisers who may wish to target different types of crowds according to the nature of their business, ie smaller numbers of passionate investors to provide informed input or larger numbers of casual investors to help create awareness and spread positive word of mouth.", "num_citations": "4\n", "authors": ["897"]}
{"title": "Digital selves and decision-making contexts: towards a research agenda\n", "abstract": " The self is increasingly digitised, manifesting as a number of identities, accounts or profiles related to engagement with social, public and commercial services. These identities are multiplied across the civic, social, commercial, professional and personal contexts of their use, and the vulnerabilities of this atomised citizen are not well understood. This paper discusses the intellectual, organisational and social trends that underpin the emergence of the digital self. Building on this, the paper conceptualises the nature of the digital self and the value exchange and decision-making contexts in which it resides and acts. The conceptualisation is discussed in order to articulate a proposed agenda of research questions for the decision support systems, information systems, and related research communities.", "num_citations": "4\n", "authors": ["897"]}
{"title": "Crowdfunding: past research, future directions\n", "abstract": " Crowdfunding: Past Research, Future Directions was hosted on June 6, 2013 by University College Cork’s Technology-Enabled Organisational Transparency and Openness Project (TOTO), co-located with the European Conference for Information Systems (ECIS) 2013 in Utrecht, NL, and funded by the Lewis Charitable Foundation (USA).", "num_citations": "4\n", "authors": ["897"]}
{"title": "An action research study on the design and development of core IT artifacts for knowedge management systems\n", "abstract": " Researchers report mixed findings on the successful application of information technologies (IT) for Knowledge Management (KM). Action Research, with its emphasis on praxis and on the importance ‘practical theory,’is an ideal vehicle for deepening the IS field’s understanding of developing ITenabled Knowledge Management Systems. It can also help identify IT artifacts that are core, as opposed to non-core, KM Tools. This paper reports on the outcomes of two related action research studies involving the University R&D team and practitioners from the United Nations Population Fund (UNFPA) and a Government Department. The first of these studies focused on the design and development, using ‘practical theory,’of a desktop-based IT artifact for knowledge sharing, while the second elaborated, extended, and applied the lessons learned from the first, to develop an enterprisewide IT artifact for the Government Department’s Knowledge Management System (KMS). These studies contribute to both research and practice by:(1) offering a conceptual schema based on practical theory to inform the design and development of a core IT artifact for KMS;(2) presenting a list of features for the core IT artifact; and (3) differentiating between core and non-core IT artifacts for knowledge sharing in organizations.", "num_citations": "4\n", "authors": ["897"]}
{"title": "Re-Engineering a Financial Information Supply Chain with XBRL: An Exploration of Co-Operative IOS Design and Development.\n", "abstract": " Financial markets worldwide have been experiencing dramatic changes since the mid-1990s. It has been claimed that XBRL, an XML vocabulary for business reporting, is capable of introducing greater integration and transparency into financial information systems, and thus addressing some of the challenges presented by these changes. This paper presents an exploratory case study of the cooperative design, development and implementation of an XBRL-enabled inter-organisational system (IOS) by the Australian Prudential Regulation Authority (APRA), the Reserve Bank of Australia (central bank) and the Australian Bureau of Statistics to revolutionise reporting by financial institutions in Australia. The study describes how the three agencies modernised and harmonised reporting requirements through a gradual review of the reporting returns required by each agency. This harmonisation enabled the reengineering of the reporting process, as each financial institution now has to submit just one set of figures to meet the needs of all three agencies. The findings illustrate that the complexity of data consumption patterns drove increased interdependence within the financial information supply chain requiring the co-operative development of context sensitive data exchanges and commodity-like IT infrastructures. The paper concludes that the co-operative approach to IOS development exhibited in this study is likely to be more suited to the development of XBRL-enabled systems for financial information supply chains than the ‘hub and spoke’model characteristic of IOS developments in other industrial sectors.", "num_citations": "4\n", "authors": ["897"]}
{"title": "Peer produced innovation: An exploration of'the wisdom of crowds' in virtual worlds\n", "abstract": " While researchers have examined the role of individuals in crowdsourcing for open innovation purposes (wisdom in crowds) there is a gap in our understanding of the collective intelligence of communities for such purposes (wisdom of crowds). The objective of this exploratory study is therefore to explore the peer production of innovation; specifically the challenges in leveraging the collective intelligence of online communities. Through an analysis of the crowdsourced innovation activities of Studio Wikitecture, a virtual community operating within and beyond an immersive social virtual world, we reveal six challenges associated with leveraging a peer production innovation model. These include the challenges of (1) the participatory unit;(2) orchestration;(3) granularity;(4) filtration;(5) attribution; and (6) reward. In our analysis and discussion we briefly propose three types of underlying mechanisms (informating …", "num_citations": "3\n", "authors": ["897"]}
{"title": "Human-centred design: existing approaches and a future research agenda\n", "abstract": " This paper presents an analysis of Human-Centred Design (HCD), using a metatriangulation of scientific literature. This metatriangulation comprises a systematic overview of recent HCD research, in which literature is categorised and analysed using both engineering lens and cognitive science paradigmatic lenses. The study reveals that the most popular HCD approaches do not accommodate software aimed at a broad or anonymous user-base. This shortcoming can be attributed, at least in part, to the popularity of HCD approaches focusing on highly-conscious user cognition based on conceptual models. These forms of cognition rely upon learned conventions and accumulated understanding and, as a result, design approaches focusing upon them are fundamentally limited to catering for a specific subset of the human population. We identify an emerging HCD approach, which we label'Foundational Design'. This approach focuses on cognitive regularities which exist in less-conscious processing, independent of culture or individual experience, and thus possibly offers a solution to the dilemma described above. Thus a future research agenda focused on the Foundational Design approach and the emerging NeuroIS research stream is proposed and discussed.", "num_citations": "3\n", "authors": ["897"]}
{"title": "Opening public administration: Exploring open innovation archetypes and business model impacts\n", "abstract": " This work-in-progress paper presents an exploration of a network of Swedish municipal authorities. Within this network, we have observed a move from isolated innovation to leveraging inflows and outflows of knowledge in a manner characteristic of the open innovation paradigm. This paper presents a characterization of these knowledge exchanges using an existing framework of open innovation archetypes, as well as an initial description of the business model impacts of this innovation approach on the participant municipalities, and the enabling role of information technology. The paper concludes by drawing preliminary conclusions and outlining ongoing research.", "num_citations": "3\n", "authors": ["897"]}
{"title": "Reviewing the contributing factors and benefits of distributed collaboration\n", "abstract": " Distributed collaboration has become increasingly common across domains ranging from software development to information processing, the creative arts, and entertainment. As of early 2020, distributed collaboration has entered the limelight as the COVID-19 pandemic has forced employees across the world to work from home. However, while researchers have applied myriad terms to define these operations, we first address this issue by defining distributed collaboration in a way that represents all its forms. Existing research has identified several factors that contribute to distributed collaborationsâ   success. Yet, researchers and practitioners typically discuss these factors in modular theoretical terms, which means that they often struggle to identify and synthesize literature that spans multiple domains and perspectives. In this paper, we systematically review the literature to synthesize core findings into one amalgamated model. This model categorizes the contributing factors for distributed collaboration along two axes 1) whether they are social or material and 2) whether they are endemic or relational. We also explicitly discuss the relationships between factors in the model. The model further links these contributing factors to different collaborative outcomes, specifically mutual learning, relationship building, communication, task completion speed, access to skilled personnel, and cost savings.", "num_citations": "2\n", "authors": ["897"]}
{"title": "Does Miner Pooling Impact Bitcoin's Ability to Stay Decentralized?\n", "abstract": " The Emerging Blockchain technologies have earned substantial attention in the area of Financial Technology in recent years. Its decentralized environment allows for the mining of Bitcoins by miners either independently or in groups. The community of miners have faith in the integrity of each other to sustain the network, through mining pools remaining at a reasonable level of mining power. Blockchain's decentralized system is one of its main selling points and is a source of great attraction for users. However, when these mining pools start to grow and increase their mining power to dangerous levels it can result in a shift towards a centralized environment. This push goes against foundational principles of Bitcoin, leading to ongoing debate among various stakeholders.", "num_citations": "2\n", "authors": ["897"]}
{"title": "Reputation, User Feedback, and Perceived Information Quality in Social Internet Media: An Empirical Study.\n", "abstract": " As the internet evolved into a more collaborative and interactive environment in which users both produce and consume content, related changes have occurred in terms of the factors affecting perceived information quality (PIQ). Two factors have emerged as being highly important in social internet media (SIM): community feedback and individual user reputation. This paper reports on a quantitative empirical study exploring the impact of reputation and user feedback on perceived information quality in SIM contexts. The paper presents a theoretical model derived from the literature, and the results of regression analysis of data gathered from a web-based knowledge sharing community. The findings support several prior studies but challenge others, and provide stimulus for fruitful avenues of further research. The study makes several contributions, including a refined conceptualization of PIQ and feedback and an improved understanding of the relationships between feedback, reputation, and PIQ.", "num_citations": "2\n", "authors": ["897"]}
{"title": "Personal transparency and unexpected information sharing in peer-to-peer lending success: an empirical study\n", "abstract": " Internet technologies underpin a variety of systems enabling collective action (eg open source software), collective intelligence (eg innovation marketplaces), and the aggregation of collective resources (eg crowdfunding). In the latter category, peer-to-peer lending has emerged as a rapidly growing phenomenon in society, and an object of interest for researchers in information systems and cognate disciplines. The saliency of social identity and personal transparency in such environments has been the focus of frequent inquiry, however we argue that the current state of knowledge is limited by biases towards particular lending platforms. In this paper, we report on the findings of a study of a large but underresearched platform. Through an analysis of 116,669 loan records, and a subsequent analysis of 1000 records manually coded through a content analysis process, we theorize the impact of personal transparency (both hard financial data and soft biographical data) on multi-party success (loan acquisition and loan repayment) in such environments. Our findings reveal relationships and behaviors that frequently contradict the findings from prior research on other platforms. In the paper, we discuss the contributions of our work towards a more complete and heterogeneous picture of peer-to-peer lending behavior, and highlight the implications of our work for both future research and practice.", "num_citations": "2\n", "authors": ["897"]}
{"title": "Architectures of participation and emergent forms of inter-organisational activity: A preliminary analysis\n", "abstract": " In their 2004 paper Hevner et. al proposed a set of guidelines for conducting design science research projects in the IS discipline. While useful, these guidelines have a relatively high level of abstraction. However, various IT artifacts such as models, methods, techniques and implementations require IS researchers to apply differing methods in order to construct and evaluate purposeful artifacts respectively. In this paper we discuss a particular class of IT artifacts: conceptual modeling languages. As constituent parts of software development methods, a multitude of such languages has been proposed and discussed. Yet, in the related literature on method design only little guidance is provided on how to derive appropriate conceptual modeling languages from empirical data. We believe that “good methods” need to be rigorously grounded in empirical findings. Taking a look at the related literature on inductive theory building reveals that at there are prominent similarities between the elements that constitute theories and those that constitute conceptual modeling languages: whereas theories comprise of constructs and relationships between these, conceptual modeling languages comprise of language constructs and relationships among these. We draw from the body of literature on grounded theory building and propose a new approach to designing conceptual modeling languages.", "num_citations": "2\n", "authors": ["897"]}
{"title": "An exploratory conceptual model for digital entrepreneurs within entrepreneurial ecosystems\n", "abstract": " The entrepreneurial ecosystem is a well-known concept in supporting the creation and growth of entrepreneurs, driving the economy in a region. However, entrepreneurship is evolving, as more and more novel digital technologies are introduced into our lives. Accordingly, this paper focuses on digital entrepreneurs, who are defined as the entrepreneurs, who utilize innovation based on digital technology to create economic or social value by starting new ventures or transform existing ones (European Commission, 2015), and the relevant ecosystem that supports them. The change in the relationship between digital entrepreneurs and an entrepreneurial ecosystem, as they evolve towards digital products and customer engagement is the focus of this research. We reviewed the literature on the topic of digital entrepreneurs and entrepreneurial ecosystem using a concept-centric matrix, capturing 14 elements of an entrepreneurial ecosystem. These elements include networks, policy and government, professional and support services, capital services, human capital, culture, markets, knowledge sources, intermediaries, informal networks, leadership, physical infrastructure, engagement, and cooperative companies. The identified elements were then used to develop a conceptual framework, which will form the basis for the research strategy. This study sets out to establish the existence of these elements in the ecosystems and the extent of their usefulness. Therefore, this paper seeks to address the research gap of how digital entrepreneurs utilize each ecosystem element to understand their importance in the conceptual framework. We intend to …", "num_citations": "1\n", "authors": ["897"]}
{"title": "Jumping the Fence: How Consumer Sentiment on Social Media Changes after Crowdfunding\n", "abstract": " Crowdfunding has helped thousands of entrepreneurs to finance their innovative products by engaging with large numbers of potential investors. The most effective way for fundraisers to engage with potential backers, is through social media. If used in the right way, social media can enable fundraisers to raise awareness of their campaign, engage with potential investors, and will ultimately have a positive impact on a crowdfunding campaign. Through social media, fundraisers are able to gauge how the public feels about their product or company, which is the main focus of this study. This study brings together research around organisational and marketing image, suggesting that as consumers invest, they move from external consumers to investors that are within the boundary of the company. This brings into question whether consumer sentiment towards the company changes after fundraising, as they become stakeholders. Thus, we use social media to investigate the public sentiment towards a company during different stages of their equity crowdfunding campaign.", "num_citations": "1\n", "authors": ["897"]}
{"title": "Wise Crowds, Safe Crowds: Balancing Diversity and Protection in Crowd Investing\n", "abstract": " Small and medium-sized enterprises (SMEs) represent 99% of the businesses in Europe and are a major source of jobs and innovation. SMEs, however, perpetually face a lack of sufficient funding. Traditional financing mechanisms such as bank loans, venture capital, and angel investments are often not available to many SMEs. Peer-to-peer financing in the form of crowdfunding is increasingly filling a funding gap for companies that are unable to obtain traditional financing or are too early in their lifecycle to attract angel investors and venture capitalists. Indeed, it was predicted the amount of funding received through crowdfunding would exceed venture capital in 2016.", "num_citations": "1\n", "authors": ["897"]}
{"title": "Where is the crowd?\n", "abstract": " Crowdfunding has received increasing attention in the financial services space in the past few years. This is because crowdfunding has become a viable alternative to traditional capital investment and thus a threat to investors in that sector. Various platforms exist which allow fundraisers to pitch an idea and spread awareness with the intention of acquiring backers. Most backers of crowdfunding campaigns come to the platform with the fundraiser rather than from the platform itself [25]. Fundraisers must find and engage a crowd and not rely on the platform for provision of the crowd. This paper sets out four action design principles for identifying and engaging a crowd. Using a boundary object theory approach, the crowdfunding campaign is broken down based on backer’s social worlds which define the crowd and their interests.", "num_citations": "1\n", "authors": ["897"]}
{"title": "SCOPED: a set of design hypotheses targeting the visual perceptibility of interface items\n", "abstract": " Effective software use is mediated by the ability of users to perceive and interact with elements presented through the user interface. As user interfaces are frequently visual, it is unsurprising that prior research has often focused on optimising visual interfaces for user processing. However, this body of research is limited by the fact that it has largely ignored the biological mechanisms that enable such processing. We seek to address this deficiency by developing a set of design hypotheses that draw upon the neuroscience of visual perception to increase the visual perceptibility of interface items. This development takes place within a series of laboratory experiments involving over 500 participants. We conclude with five validated and complimentary design hypotheses, collectively given the title of shape, colour and position for effective decomposition' (SCOPED).", "num_citations": "1\n", "authors": ["897"]}
{"title": "Applying theory-building techniques to the design of modelling languages\n", "abstract": " In their 2004 paper Hevner et. al proposed a set of guidelines for conducting design science research projects in the IS discipline. While useful, these guidelines have a relatively high level of abstraction. However, various IT artifacts such as models, methods, techniques and implementations require IS researchers to apply differing methods in order to construct and evaluate purposeful artifacts respectively. In this paper we discuss a particular class of IT artifacts: conceptual modeling languages. As constituent parts of software development methods, a multitude of such languages has been proposed and discussed. Yet, in the related literature on method design only little guidance is provided on how to derive appropriate conceptual modeling languages from empirical data. We believe that “good methods” need to be rigorously grounded in empirical findings. Taking a look at the related literature on inductive theory building reveals that at there are prominent similarities between the elements that constitute theories and those that constitute conceptual modeling languages: whereas theories comprise of constructs and relationships between these, conceptual modeling languages comprise of language constructs and relationships among these. We draw from the body of literature on grounded theory building and propose a new approach to designing conceptual modeling languages.", "num_citations": "1\n", "authors": ["897"]}
{"title": "Using XML Vocabularies To Exploit Changing Business Models: The NewsML Experience\n", "abstract": " In 1998, Reuters committed resources to exploring the use of XML (Extensible Markup Language) as the foundation for their next-generation news content management system. This was in response to changes in the news industry business model resulting from changing value webs and content delivery methods. The result was ReutersNewsML, an XML vocabulary for\" wrapping\" news content items from multiple sources into a single package. In 1999 Reuters submitted the concept to the International Press Telecommunications Council (IPTC), which managed the development of the NewsML specification. NewsML was ratified as an IPTC standard for the entire global news media industry in 2000. This paper explores the development of NewsML as an illustration of how XML standards can be exploited within complex business webs.", "num_citations": "1\n", "authors": ["897"]}