{"title": "Experiences in the application of software process improvement in SMES\n", "abstract": " During the last few years, many Software Process Improvement methods (SPI) have been presented to increase the quality of products and services provided by a software organization. Current Software Process Improvement (SPI) methods (i.e. ISO 15504, CBA-IPI,...), are difficult to apply to Small and Medium-sized Enterprises (SMES) due to the costs (financial, time, and resource) associated with their application. Also, these methods are principally focused on the assessment stage. This paper presents a new SPI method, called MESOPYME, which main focus is to reduce effort and time on the SPI implementation. This method focuses on the improvement implementation stage, which is based on a concept called Action Package, whose components are described (in Section 2.1.). The results obtained in the application of a Requirements Engineering Action Package in three organizations are also …", "num_citations": "138\n", "authors": ["1155"]}
{"title": "Critical success factors taxonomy for software process deployment\n", "abstract": " Many organizations have adopted methods, models, and standards to improve their software processes. However, despite these efforts, they can still find it difficult to deploy processes throughout the organization because most of them focus more on the technical rather than human aspects. This paper proposes a taxonomy of critical success factors for software process deployment. A method to create this taxonomy was developed and applied based on a systematic review of existing literature and is complemented with industry experiences where software processes have been deployed or implemented. Finally, the categories, subcategories, and items of this taxonomy are presented.", "num_citations": "63\n", "authors": ["1155"]}
{"title": "Virtual Reality as good practice for teamwork with engineering students\n", "abstract": " Virtual reality is an alternative for student's motivation, allowing them actions like flying or observing the environment from different perspectives in a controlled way. Multiuser interaction in virtual reality leads to collaborative virtual environments that promote the development of social skills in teamwork, in particular with members in different geographic locations. In these contexts there are different virtual reality application proposals transporting students to environments where they make team decisions for achieving intended goals. However, such proposals do not emphasize the importance of identifying the strengths of each team member for the improvement in the team performance. This paper presents a virtual reality-based videogame incorporating gamification principles for promoting and improving teamwork in engineering students.", "num_citations": "49\n", "authors": ["1155"]}
{"title": "Building an IT service catalog in a small company as the main input for the IT financial management\n", "abstract": " IT departments in non-IT small companies lack guidelines for defining the services they provide and for assigning costs to these services. This article compares international models and standards and describes an approach that can be used by these companies in order to define and implement their service catalog to be used as an input for their IT financial management. The proposed solution is based on the concept of a process asset library. The proposal has been tested in a non-IT small company. The results provide useful insights for companies interested in defining their own service catalog from a standard service catalog.", "num_citations": "42\n", "authors": ["1155"]}
{"title": "Gestión del proceso software\n", "abstract": " 3.-METODOLOGÍA.Se alternan clases expositivas (usando pizarra, retroproyector y cañón) con clases de problemas al final de cada tema. Paralelamente se desarrollan clases de laboratorio donde se usan herramientas CASE que apoyen lo visto en teoría.Se pretende completar la formación del alumno sobre Ingeniería del Software, proporcionando una visión de conjunto. El principal objetivo es fomentar la capacidad del alumno para aplicar de forma efectiva los principios de la Ingeniería del software al desarrollar un proyecto completo, desde la fase de especificación hasta la entrega al cliente.", "num_citations": "42\n", "authors": ["1155"]}
{"title": "Methodology for process improvement through basic components and focusing on the resistance to change\n", "abstract": " This paper describes a multi‐model methodology that implements a smooth and continuous process improvement, depending on the organization's business goals and allowing users to establish their improvement implementation pace. The methodology focuses on basic process components known as ‘best practices’. Besides, it covers following the topics: knowledge management and change management. The methodology description and the results of a case study on project management process are included. Copyright © 2010 John Wiley & Sons, Ltd.", "num_citations": "37\n", "authors": ["1155"]}
{"title": "A proposed model for reuse of software requirements in requirements catalog\n", "abstract": " Nowadays, the demand for higher quality in software products causes the increased complexity of these products. These two aspects (quality and complexity) combined with productivity are key elements for improving the competitiveness between software companies and differentiating success from failure in the software industry. In this sense, software reuse, and requirements reuse in particular, has been widely recognized as an effective way to improve software quality and productivity. In this paper, we propose a model to reuse the software requirements in a Requirements Catalog. This research aims to define the guidelines to carry out the requirements reuse process through four principal activities: searching, selecting, adapting, and implementing. Also, the commercial tool Computer‐Aided Requirements Engineering Rational RequisitePro was tailored to make feasible the implementation of the proposed …", "num_citations": "35\n", "authors": ["1155"]}
{"title": "Using a web-based tool to define and implement software process improvement initiatives in a small industrial setting\n", "abstract": " Top-down process improvement approaches provide a high-level model of what the process of a software development organisation should be. Such models are based on the consensus of a designated working group on how software should be developed or maintained. They are very useful in that they provide general guidelines on where to start improving, and in which order, to people who do not know how to do it. However, the majority of models have only worked in scenarios within large companies. The authors aim to help small software development organisations adopt an iterative approach by providing a process improvement web-based tool. This study presents research into a proposal which states that a small organisation may use this tool to assess and improve their software process, identifying and implementing a set of agile project management practices that can be strengthened using the CMMI …", "num_citations": "35\n", "authors": ["1155"]}
{"title": "Critical success factors in software process improvement: A systematic review\n", "abstract": " Many methods, models and standards for software process improvement have been developed. However, despite the efforts, they still come up against difficulties in their deployment and the processes are not institutionalized. There is a set of factors that influence the successful deployment of new or modified processes. In this paper we describe the methodology and results from a systematic review of critical success factors in software process improvement and deployment. A total of 28 primary studies were analyzed as a result of the systematic review. Some of the top factors for process improvement and process deployment initiatives are: commitment, alignment with the business strategy and goals, training, communication, resources, skills, improvement management and staff involvement. The obtained results show that is important to take into account organizational, technical and people issues in …", "num_citations": "32\n", "authors": ["1155"]}
{"title": "Comparative Study of Cybersecurity Capability Maturity Models\n", "abstract": " According to ESET, cybersecurity can be defined as the protection of information assets, through the treatment of threats that put at risk the information that is processed, stored and transported by information systems that are interconnected; and a process that involves prevention, detection and reaction or response. This article aims to describe and compare the most used cybersecurity capability maturity models, as a result of a systematic review (SR) of published studies from 2012 to 2017. For this, a taxonomy for comparing cybersecurity capability maturity models was developed, based on Halvorsen and Conradi’s taxonomy. Also, the taxonomy is adapted and applied to the cybersecurity capability maturity models identified in the SR. It was observed that the cybersecurity capability maturity models have similar elements because they use processes and levels of maturity, they also manage the risk …", "num_citations": "25\n", "authors": ["1155"]}
{"title": "Managing the software process with a software process improvement tool in a small enterprise\n", "abstract": " Top‐down process improvement approaches provide a high‐level model of what the process of a software development organization should be. Such models are based on the consensus of a designated working group on how software should be developed or maintained. They are very useful in that they provide general guidelines on where to start improving, and in which order. However, the majority of them have only worked in scenarios within large companies. We aim to help small software development organizations to adopt an iterative approach by providing a Process Improvement Web‐based Tool (SysProVal). This paper presents research into the proposal that a small organization may use this tool to define and implement a set of project management practices that can be strengthened using the CMMI‐DEV 1.2 model as reference. Copyright © 2010 John Wiley & Sons, Ltd.", "num_citations": "22\n", "authors": ["1155"]}
{"title": "Review of critical success factors related to people in software process improvement\n", "abstract": " Information systems are designed, constructed, and used by people, using a set of defined processes previously deployed, as a result of software process improvement initiative. Software process improvement is not a purely technical task, but a complex psycho-socio-technical process. This paper presents a systematic review to identify the categories most used in literature to classify software process improvement success factors and the critical success factors related to people. We found several studies related to critical success factors, but only 10 of them proposed a critical success factors classification. The quantitative data from a systematic review were analyzed using descriptive statistics. As a result the following common categories are identified: organization, people and process. The critical success factors related to people are presented in this paper.", "num_citations": "19\n", "authors": ["1155"]}
{"title": "Introducing scrum in a very small enterprise: A productivity and quality analysis\n", "abstract": " The very small enterprises are seriously affected by the actual global economic crisis. At this scenario the competitiveness is a key factor and productivity enhancements are needed. This article shows an experience about introducing an agile methodology in a very small enterprise. The organization needed to improve their projects productivity without compromising the quality and decided to introduce Scrum in order to verify its efficiency. The goal of this paper is to analyze the productivity and quality by comparing the Scrum pilot project with a previous similar experience based in TSPi.", "num_citations": "19\n", "authors": ["1155"]}
{"title": "Reusing functional software requirements in small-sized software enterprises: a model oriented to the catalog of requirements\n", "abstract": " Software reuse can be defined as the process of creating software products from the existing ones rather than developing software from scratch. Thus, software reuse is normally proposed to increase software productivity and quality and leads to economic benefits. In this sense, the reuse of software requirements has received important attention because it provides a solid support to develop quality software through obtaining and reusing quality software requirements [i.e., software product line (SPL) approach used in large-sized software enterprises]. However, the small-sized enterprises—which represent up to 85 % of all software organizations in many countries around the world—cannot implement a SPL approach because it does not fit with the context, properties, and complexity of their software projects. Moreover, the software engineering community has not adequately explored a more proper …", "num_citations": "18\n", "authors": ["1155"]}
{"title": "State of the art for risk management in software acquisition\n", "abstract": " This paper presents the state of the art for risk management in software acquisition. To determine it, a systematic review protocol for Software Engineering is used. Furthermore, the systematic re-view focuses on identifying initiatives and reports of risk manage-ment proposals for software acquisition in small settings. Results show increasing research in risk management and the need for more in-depth studies.", "num_citations": "18\n", "authors": ["1155"]}
{"title": "A software project management framework\n", "abstract": " This article reports the results of research into software project management. The main contribution of this research is a software project management framework that consists of a static structure, shown in an entity-relationship diagram, and a description of each component of the framework. It also describes the procedure to design and validate the framework. This consists of integrating the solutions of a traditional model (information model) and a formal model (domain analysis). This software project management framework is a key element for rapid and effective project management process improvement of a software organization.OFTWARE PROJECT MANAGEMENT IS A software life-cycle process in the management process category. This category consists of a set of processes that contain procedures that can be used by managers for any type of software development project. Most software projects have …", "num_citations": "18\n", "authors": ["1155"]}
{"title": "Una Propuesta Organizativa de los Procesos SD y SS en ITIL\n", "abstract": " La gestión de servicios de TI (Tecnologías de la Información) se está convirtiendo en un factor decisivo para el éxito de la mayoría de los negocios. Ya en los años 80 se comenzó en el Reino unido el desarrollo de un estándar llamado ITIL para dicha gestión. ITIL tiene dos áreas principales de Gestión de Servicios: el Soporte del Servicio, Service Support (SS) y la Provisión del Servicio, Service Delivery (SD). En este artículo se presenta una propuesta organizativa que permite identificar la secuencia de implantación de los procesos de las áreas de SS y SD. Para ello, se utilizan técnicas de teoría de grafos con objeto de representar las relaciones entre los procesos de ITIL, de forma que se encuentren procesos o agrupaciones de procesos fuertemente relacionados. Estas agrupaciones ayudarán a determinar la prioridad de implantación de los procesos de servicios.", "num_citations": "16\n", "authors": ["1155"]}
{"title": "How small and medium enterprises can begin their implementation of ITIL?\n", "abstract": " Sequencing of Information Technology Infrastructure Library (ITIL) processes related to their order of implementation is one of the pending issues in the ITIL handbooks. Other frameworks and process models related to service management (eg, COBIT, COSO and CMMI-SVC) are quite well described in the literature and their handbooks. However, the identification of the first process to be implemented has not been deeply analysed in the previous frameworks and models, and it is also a complex question to answer for organizations, especially Small and Medium Enterprises (SMEs). Moreover, SMEs are the organizations that have the largest presence in the world economy; official data of General Business Directory, show that their range of presence in different countries around the world is between 93% and 99%, and the average of employment contribution is around 60%. Consequently, the improvement of information technology service management is of vital importance to accomplish in this type of enterprises. This research has focused on two surveys that aim at helping SMEs to select the ITIL process by which starting the implementation of ITIL. In the first survey, data were gathered through a questionnaire to SMEs registered in the region of Madrid. The second survey obtained data from experts and enterprises in countries as Spain, Ecuador, Chile, Luxembourg, Colombia, Norway, El Salvador, and Venezuela. Finally, the results of both surveys show that the tendency for starting an ITIL implementation in SMEs points to one of the processes included in the Service Operation.", "num_citations": "15\n", "authors": ["1155"]}
{"title": "Comparison of models and standards for implementing IT service capacity management\n", "abstract": " FELIZ-SANCHEZ, Alleinni and CALVO-MANZANO, Jose Antonio. Comparison of models and standards for implementing IT service capacity management. Rev. fac. ing. univ. Antioquia [online]. 2015, n. 74, pp. 86-95. ISSN 0120-6230.", "num_citations": "15\n", "authors": ["1155"]}
{"title": "A serious game for teaching the fundamentals of ISO/IEC/IEEE 29148 systems and software engineering–Lifecycle processes–Requirements engineering at undergraduate level\n", "abstract": " In the context of software engineering education, there is a recurrent demand for new approaches and techniques that support the application and transfer of knowledge to real-life situations with the aim of encouraging a more active learning among students. In particular, serious games have recently become an important learning resource for teaching the fundamentals of software process standards at undergraduate level. However, poor effort has been made to create a serious game that supports the teaching of the ISO/IEC/IEEE 29148:2011 Systems and Software Engineering – Lifecycle Processes – Requirements Engineering, an international standard that specifies the required processes that are to be implemented by requirements engineering for systems and software products (including services) throughout the lifecycle. With this in mind, a serious game called “Requengin” has been developed to provide …", "num_citations": "14\n", "authors": ["1155"]}
{"title": "Perfiles del ciclo de vida del software para pequeñas empresas: los informes técnicos ISO/IEC 29110\n", "abstract": " Las pymes son una pieza clave en la economía mundial. La mayoría del software desarrollado lo realizan pymes. Este tipo de empresas necesita prácticas eficientes de ingeniería del software adaptadas a su tamaño y tipo de negocio. En este sentido, y para apoyar a las pequeñas empresas en sus esfuerzos de mejora de procesos, ISO ha conformado el grupo de trabajo denominado SC7-WG24 con el objetivo de que sus estándares para la mejora de procesos de software se puedan aplicar a pequeñas empresas desarrolladoras de software. Este grupo de trabajo está estableciendo un marco común para describir perfiles evaluables del ciclo de vida de software para su uso en las pymes.", "num_citations": "14\n", "authors": ["1155"]}
{"title": "Hacia la gestión cuantitativa en la gestión de proyectos en el ámbito de las pymes\n", "abstract": " La gestión de proyectos es un aspecto clave en el éxito de los proyectos de software. Si, además, se tiene en cuenta que las pequeñas y medianas empresas en España constituyen el 99, 87% de las empresas españolas, es evidente que resulta crucial para estas empresas, y para la economía nacional, una buena implantación de los procesos involucrados en la gestión de proyectos. Aunque existen modelos de procesos y herramientas que cubren los aspectos de gestión de proyectos, sin embargo estos modelos y herramientas se han orientado a las grandes empresas, lo que hace necesaria su adaptación a las condiciones particulares de las pequeñas y medianas empresas. Se presenta una solución complementaria para este tipo de empresas basada en la implantación de un repositorio de activos de proceso que permita establecer un proceso estándar de gestión de proyectos y su adaptación a las condiciones específicas de cada proyecto de la empresa.", "num_citations": "14\n", "authors": ["1155"]}
{"title": "Experiences of using a game for improving learning in software requirements elicitation\n", "abstract": " Many recent studies have demonstrated that the traditional methods used in teaching software requirements elicitation are ineffective because they frequently produce unskilled graduates who are inappropriately trained to apply their practical knowledge in the workplace. Therefore, the combination of traditional teaching approaches and modern learning tools has been used to better prepare undergraduate students. Biyubi is a game that has been developed to complement traditional teaching in order to facilitate the learning of requirements elicitation activities on an undergraduate Software Engineering course. Biyubi provides a simulated environment for students so that they can explore, analyze, and discover the wishes and needs of the correct stakeholders. This game has been tested and validated by undergraduate students from the NovaUniversitas University, Mexico. The use of Biyubi achieved an …", "num_citations": "13\n", "authors": ["1155"]}
{"title": "Establecimiento del estado del arte sobre el aligeramiento de procesos de software\n", "abstract": " Existen varios modelos utilizados en la mejora de procesos de software tales como CMMI e ISO/IEC 15504, cuya implementación adecuada, implica no sólo la definición de los procesos, si no también introducir a las empresas de software en el desarrollo de una cultura de mejora continua. Un camino factible que tienen estas empresas para lograr la mejora continua es la optimización de sus procesos mediante su aligeramiento. Este artículo presenta un resumen de protocolo de la revisión sistemática llevado a cabo para esta investigación, así como los resultados del análisis de estrategias para el aligeramiento de procesos de software actualmente utilizados.", "num_citations": "13\n", "authors": ["1155"]}
{"title": "A process asset library to support software process improvement in small settings\n", "abstract": " A main factor to the success of any organization process improvement effort is the Process Asset Library implementation that provides a central database accessible by anyone at the organization. This repository includes any process support materials to help process deployment. Those materials are composed of organization’s standard software process, software process related documentation, descriptions of the software life cycles, guidelines, examples, templates, and any artefacts that the organization considers useful to help the process improvement. This paper describes the structure and contents of the Web-based Process Asset Library for Small businesses and small groups within large organizations. This library is structured using CMMI as reference model in order to implement those Process Areas described by this model.", "num_citations": "13\n", "authors": ["1155"]}
{"title": "AVARCIBER: a framework for assessing cybersecurity risks\n", "abstract": " The identification and assessment of risks are a fundamental part of cybersecurity. Determining the elements that participate in this field is difficult because there is no exclusive approach to cybersecurity. This document aims to provide a framework to identify and assess cybersecurity risks. For this, a systematic review of the studies related to cybersecurity risk taxonomies was carried out. The main elements of the proposed conceptual model and framework have been determined by applying the snowball technique. To validate the implementation of the proposed framework, a case study has been implemented at the Ecuadorian Social Security Institute. The first task was to consolidate the information in a baseline. Once the baseline was obtained, the defined framework has been applied. As a result, through the use of the proposed framework, the assessment process has improved the decision-making process …", "num_citations": "12\n", "authors": ["1155"]}
{"title": "A prototype to manage cybersecurity in small companies\n", "abstract": " Cybersecurity is defined as the protection of information assets through the treatment of threats that put information at risk. Enterprises, regardless of their size, must manage the cybersecurity risks to improve the security and resilience of their assets. The large enterprises are increasingly investing in cybersecurity. However, the perception of this danger in smaller companies is limited, and few of them have among their list of priorities to protect their information systems. In the market, there are few cybersecurity systems for small businesses focused on asset management, and cybersecurity vulnerabilities and threats. For this reason, this paper seeks to identify cybersecurity management tools for small enterprises and it describes some of the requirements that a cybersecurity management tool should have to cover the needs of small enterprises. These requirements will be reflected in a prototype.", "num_citations": "12\n", "authors": ["1155"]}
{"title": "Trends and Applications in Software Engineering: Proceedings of the 6th International Conference on Software Process Improvement (CIMPS 2017)\n", "abstract": " This book includes a selection of papers from the 2017 International Conference on Software Process Improvement (CIMPS’17), presenting trends and applications in software engineering. Held from 18th to 20th October 2017 in Zacatecas, Mexico, the conference provided a global forum for researchers and practitioners to present and discuss the latest innovations, trends, results, experiences and concerns in various areas of software engineering, including but not limited to software processes, security in information and communication technology, and big data. The main topics covered are organizational models, standards and methodologies, software process improvement, knowledge management, software systems, applications and tools, information and communication technologies and processes in non-software domains (mining, automotive, aerospace, business, health care, manufacturing, etc.) with a demonstrated relationship to software engineering challenges.", "num_citations": "12\n", "authors": ["1155"]}
{"title": "Understanding sprint velocity fluctuations for improved project plans with Scrum: a case study\n", "abstract": " Starting from the documentation of high sprint velocity fluctuations in a Scrum project, this paper presents a thorough approach to identify the sources of issues arising in the context of Scrum implementation. Given that Scrum provides guidance on identifying process issues but not their root causes, various approaches are explored. This is of great relevance because Scrum defines project schedules relying heavily on sprint velocity and because it is the most widely used agile methodology. The findings provide a new approach to evaluate such fluctuations and establish a more realistic project assessment than what is currently defined by Scrum. In this respect, this paper contributes to improve the understanding of the software development process using this agile framework. Copyright © 2014 John Wiley & Sons, Ltd.", "num_citations": "11\n", "authors": ["1155"]}
{"title": "Evaluación de los procesos software de una organización enfocando en la disminución de la resistencia al cambio\n", "abstract": " En este artículo se describe un método para la evaluación del rendimiento de los procesos software de una organización de desarrollo de software utilizando técnicas alternativas a los cuestionarios (utilizados actualmente como técnica principal para evaluar el rendimiento de los procesos software en las organizaciones de desarrollo software). La importancia de la evaluación de procesos de una organización radica en qué, si es realizada de manera correcta, esta actividad permite identificar las oportunidades de mejora y dirigir el esfuerzo de la mejora hacia los procesos software que necesitan ser mejorados para alcanzar los objetivos del negocio establecidos por la alta dirección con la finalidad de generar ventajas competitivas respecto de sus competidores y garantizar su permanencia en el mercado.", "num_citations": "11\n", "authors": ["1155"]}
{"title": "A solution for establishing the information technology service management processes implementation sequence\n", "abstract": " This paper addresses the implementation sequence of Services Management processes defined in ITIL v2, from a topological perspective. Graphs Theory is used to represent the existing dependencies among the ITIL v2 processes, in order to find clusters of strongly connected processes. These clusters will help to determine the implementation priority of the service management processes. For it, OPreSSD (Organizational Procedure for Service Support and Service Delivery) is proposed in order to identify the processes implementation sequence related to the Service Support (SS) and Service Delivery (SD) areas.", "num_citations": "11\n", "authors": ["1155"]}
{"title": "High‐maturity levels: achieving CMMI ML‐5 in a consultancy company\n", "abstract": " Most organizations that use the Capability Maturity Model Integration (CMMI) stop their process improvement journey at Maturity Level 3 or less. The discussion about CMMI high‐maturity levels has always been controversial, going most of the times through the consideration of return of investment, provider selection, and interpretation issues. Achieving Level 5 is not an easy task; it derives a lot of steps during the way. This article will show an example of the implementation of Level 5 in a consultancy company in two constellations: development and service. It depicts the example in steps, to help the understanding of the whole process. Copyright © 2014 John Wiley & Sons, Ltd.", "num_citations": "10\n", "authors": ["1155"]}
{"title": "Impact of TSPi on software projects\n", "abstract": " This paper describes the effect of TSPi (introduction to the team software process) on key performance dimensions in software projects, including the ability to estimate, the quality of the software produced and the productivity achieved. The study examines the impact of the TSPi on the performance of 31 software teams. Finally an analysis comparing the results through two iterations is discussed.", "num_citations": "10\n", "authors": ["1155"]}
{"title": "Requirements for a knowledge management framework to be used in software intensive organizations\n", "abstract": " The project ''GPS: a platform to model, reuse and measure software process management (TIN-2004-0783)\" (funded by Spanish government) has as the main goal to make a tool that helps software engineers satisfy effective practices as they have been defined by most well-known international institutions such us ISO, SEI and PMI. The purpose of this article is to show the initial phase results of the GPS project. These results were obtained from experience gained by a research team using the most important software process improvement reference models, software process management tools, process modeling languages and the classification techniques in knowledge retrieval.", "num_citations": "10\n", "authors": ["1155"]}
{"title": "A proposal for implementation of ITIL incident management process in SMEs\n", "abstract": " According to previous findings, in a situation where an ITIL implementation is performed, the Incident Management Process could be the first process to be implemented; however, the ten activities defined in the process are too extensive to be implemented in a SME. For this reason, it is relevant to develop a strategy for implementing all ITIL processes in order to encourage the SMEs starting a formal ITIL implementation. In this article, an implementation strategy using a profile scheme has been developed, this is done by means of two different instruments. Firstly, a deep analysis of selected process and secondly an ISO 29110 structural analysis are revised too. After this, the proposal strategy was applied to Incident Management Process. For this purpose a Delphi study with some experts in the area was conducted in order to validate some constrains related to Incident management activities. As a result, a proposal …", "num_citations": "9\n", "authors": ["1155"]}
{"title": "Software engineering education for a graduate course: A web‐based tool for conducting process improvement initiatives with local industry collaboration\n", "abstract": " In recent years, there has been an on‐going demand for better services and functionality in software products; as a consequence many models, techniques, and tools have been developed such as CMMI‐DEV v1.2, TSP, or Scrum. However, software products still suffer from excessive costs, delays in delivery, and low quality. Furthermore, there is a lack of educational material providing high levels of interaction between students and the software industry to learn about how enterprises adopt these models, techniques, and tools into their daily work. This article describes a web‐based Tool (EduSysProVAL) to support a graduate course in collaboration with the local software industry. The main goal of this research is to demonstrate that a Software Engineering course may use the EduSysProVAL tool to improve students' practical and professional skills, thus increasing their participation and effort in improvement …", "num_citations": "9\n", "authors": ["1155"]}
{"title": "Taxonomía de Factores Críticos para el Despliegue de Procesos Software.\n", "abstract": " Diversos métodos, modelos y estándares para la mejora de procesos software han sido desarrollados y adoptados por las organizaciones para mejorar sus procesos software. Sin embargo, a pesar de los esfuerzos realizados, presentan aun dificultades en el despliegue de sus procesos a través de la organización. Esto es debido a que en su gran mayoría, los esfuerzos realizados están más orientados hacia los aspectos técnicos, soslayando los aspectos relacionados con las personas. Existe un conjunto de factores que condicionan el éxito del despliegue de los procesos nuevos o que han sido modificados. En este artículo, se presenta una taxonomía de factores críticos que condicionan el éxito del proceso de despliegue, que se traduce en lograr la institucionalización de los procesos. La elaboración de la taxonomía de factores críticos de éxito se sustenta en una revisión sistemática de la bibliografía existente en las bases de datos especializadas y en experiencias en organizaciones que han desplegado procesos basados en el modelo CMMI.", "num_citations": "8\n", "authors": ["1155"]}
{"title": "The effects of game‐based learning in the acquisition of “soft skills” on undergraduate software engineering courses: A systematic literature review\n", "abstract": " The software industry is becoming an increasingly important part of the economy in countries that have realized that the education of future software engineers is crucial to having a vibrant software industry. However, software engineering education is still influenced by traditional teaching impeding the acquisition of soft skills. Game‐based learning (GBL) combines learning with different known resources, such as games, to support and improve the teaching/learning process and/or student evaluation through active learning. This study presents a systematic literature review on the use of GBL for teaching software engineering at the undergraduate level, from 2001 to 2020, by addressing four research questions: What kinds of games have been developed for software engineering education? Which software engineering areas have been addressed by these games? Which soft skills have been promoted by using …", "num_citations": "7\n", "authors": ["1155"]}
{"title": "Quantitative Project Management in Small and Medium-sized Software Enterprises\n", "abstract": " Taking into account that small and medium enterprises make up 99.85% of businesses, it is vital that they implement the processes involved in project management. Although there are process models and tools that cover project management, they are generally oriented to larger enterprises. So it is necessary to adapt them to the particular necessities of small and medium-sized software enterprises. To ease an effectively support these tasks, the FQPMSE is proposed: a framework for achieving quantitative project management in small and medium-sized enterprises. Finally, experimentation results are provided through the FQPMSE implementation in three software companies.", "num_citations": "7\n", "authors": ["1155"]}
{"title": "Implementing the modeling-based approach for supporting the software process assessment in SPI initiatives inside a small software company\n", "abstract": " Software Process Improvement (SPI) has become more and more important during the past ten years, since competition is increasingly determined by the proportion of software products and services. Over the years, many different SPI approaches have been developed; most of them are either best-practice-oriented approaches or continuous improvement approaches, which require an accurate assessment process as a basis from which to begin the improvement. Usually, almost all research is focused on a questionnaire-based approach for process’ assessment. However, without the organizational commitment it is too difficult obtain realistic and accurate results. The main achievement of this paper, lies in the development of an integrated mechanism for assessing software processes, using a hybrid mechanism that incorporates modeling-based assessment. This mechanism was evaluated using the …", "num_citations": "7\n", "authors": ["1155"]}
{"title": "Análisis de decisiones en la selección de proveedores de tecnologías de la información: una revisión sistemática\n", "abstract": " En este artículo se aplica un protocolo de revisión sistemática de Ingeniería de Software para la decisión en la selección de proveedores de Tecnologías de la Información (TI). El objetivo es la búsqueda de documentos relacionados con la toma de decisión en la selección de proveedores de TI. Además, la revisión sistemática se centra en identificar las iniciativas y los informes de la toma de decisión en la selección de proveedores de TI. Los resultados obtenidos demuestran que existe una necesidad de más estudios y definen 16 criterios de evaluación para utilizarse en la selección de proveedores de TI.", "num_citations": "7\n", "authors": ["1155"]}
{"title": "Introducing gamification to increase staff involvement and motivation when conducting SPI initiatives in small-sized software enterprises\n", "abstract": " Small-sized software enterprises have tried for years to make major changes to improve the software development process and, consequently, the quality of their products. Many small companies are focusing their efforts on conducting software process improvement (SPI) initiatives to mature their software processes and to deliver products on time and on budget. Nevertheless, these initiatives are not always successful because human factors are still difficult to control leading to a high failure rate due to lack of involvement and motivation. Gamification can be used to motivate staff and increase participation and commitment to improve the chances of success when an SPI initiative is conducted in these companies. In this study, a gamification strategy was designed to add game-like elements into the GamiSPI tool for supporting SPI activities. Significant research has been carried out, but the authors’ approach aims to …", "num_citations": "6\n", "authors": ["1155"]}
{"title": "Systematic Review: Cybersecurity Risk Taxonomy\n", "abstract": " In cybersecurity, the identification of risks is a fundamental part because this activity is not unique to cybersecurity and it is hard to know what the risks in this area are. This study aims to identify if there are some risk taxonomies in cybersecurity. For this, a systematic review of the studies published from 1990 to 2017 was carried out. We found 132 papers and some of them mention some risk taxonomies within the scope of IT (information technologies) cybersecurity, although only five primary elements were selected, identifying the main risk taxonomies. A classification of cybersecurity risk taxonomy types has been adapted, with the inclusion of new categories, categorized according to their perspective and domain. We have analysed the taxonomies form a proposed five level perspective. Finally, it has been observed that risk taxonomies may be shifting the focus from the asset level to service and business …", "num_citations": "6\n", "authors": ["1155"]}
{"title": "Integrating governance, service management and project management of IT\n", "abstract": " IT governance is critical for business improvement in organizations. In the same way, the value of IT must be improved. Often the product of an IT project is an IT Service. A good management of IT projects help to improve IT Services value. For this purpose, some frameworks and standards have been developed. Among them, project management framework PRINCE2 and the IT governance and management standards ISO/IEC 38500 and ISO/IEC 20000 are highlighted. Their application means a clear improvement, but this is far from covering the organizations expectations. IT project approach integrating the needs of business and technology that support is a key to achieve the expected success for IT projects in organizations. This paper presents a summary of the study performed to find out if PRINCE2 meets the governance and management requirements of ISO/IEC 38500 and ISO/IEC 20000. The study …", "num_citations": "6\n", "authors": ["1155"]}
{"title": "A practical approach to project management in a very small company\n", "abstract": " This article shows how a very small company has tailored Scrum according to its own needs. The main additions made were the “sprint design” phase and the “sprint test” phase. Before the sprint 0, the requirements elicitation and the functional specification were made in order to meet deadlines and costs agreed with clients. Besides, the introduction of an agile project management tool has supported all the process and it is considered the main success factor for the institutionalization of the Scrum process.", "num_citations": "6\n", "authors": ["1155"]}
{"title": "Approach to Identify Internal Best Practices in a Software Organization.\n", "abstract": " Current approaches to software process improvements (SPI) in software organizations is based on identifying gaps by comparing the way organizations work with respect to practices contained in the reference models. Later, these gaps will be targeted for establishing software process improvements. This paper presents an approach for identifying best practices within the organization. This is considered a key element in order to compare the way software organizations work with the reference models. After that, these practices will be complemented with practices contained in these models depending on the organization's business goals.", "num_citations": "6\n", "authors": ["1155"]}
{"title": "MATURE: a model driven based tool to automatically generate a language that supports CMMI process areas specification\n", "abstract": " Many companies have achieved a higher quality in their processes by using CMMI. Process definition may be efficiently supported by software tools. A higher automation level will make process improvement and assessment activities easier to be adapted to customer needs. At present, automation of CMMI is based on tools that support practice definition in a textual way. These tools are often enhanced spreadsheets. In this paper, following the Model Driven Development paradigm (MDD), a tool that supports automatic generation of a language that can be used to specify process areas practices is presented. The generation is performed from a metamodel that represents CMMI. This tool, differently from others available, can be customized according to user needs. Guidelines to specify the CMMI metamodel are also provided. The paper also shows how this approach can support other assessment methods.", "num_citations": "6\n", "authors": ["1155"]}
{"title": "The forgotten practices of subcontracting\n", "abstract": " For many software projects the complexity of the final product has increased to a level where it is impossible to build the whole application from the scratch. So, many organizations consider subcontracting as an option for software development. This paper shows generic problems related to software subcontracting. Also, an analysis of CMMI-DEV subcontracting practices to solve these problems is presented. The review also highlights that there are many critical management practices related to outsourcing to ensure a successful overall project.", "num_citations": "6\n", "authors": ["1155"]}
{"title": "How is CMMI-DEV applying when using TSPi project planning\n", "abstract": " Nowadays organizations require better-qualify software engineers in order to face two major challenges: 1 their process improvements and, 2 quality software development teamwork, due to actually large amount of software is developed by teams. This article aims to clarify the relationship between two technologies Capability Maturity Model Integration for Development (CMMI-DEV) and Team Software Process introduction (TSPi) for the project planning.", "num_citations": "6\n", "authors": ["1155"]}
{"title": "Requirements Management and Acquisition Management Experiences in Spanish Public Administrations\n", "abstract": " As a part of the activities of the first Symposium on Process Improvement Models and Software Quality of the Spanish Public Administration, working groups were formed to discuss the current state of the Requirements Management and Supplier Agreement Management processes. This article presents general results and main contributions of those working groups. The results have allowed the obtention of a preliminary appraisal of the current state of these two processes in the Spanish Public Administration.", "num_citations": "6\n", "authors": ["1155"]}
{"title": "Software process improvement: MESOPYME model and method\n", "abstract": " Product quality stems from the quality of the process used to develop and maintain it. For this reason, organizations have developed models and methods to continuously improve their software process. At this moment, these methods are onl y applicable to large organizations due to the costs required to begin an improvement program.", "num_citations": "6\n", "authors": ["1155"]}
{"title": "Diagnostic Assessment Tools for Assessing the Implementation and/or Use of Agile Methodologies in SMEs: An Analysis of Covered Aspects.\n", "abstract": " Nowadays, small and medium enterprises (SMEs) are using agile methodologies in an effort to produce software that meets the time requested by the market. However, a lack of knowledge of how to correctly apply agile methodologies might be contributing to inefficient software development in certain cases. To resolve this, a set of diagnostic assessment tools that aim to help SMEs In assessing the knowledge regarding an agile methodology has been developed.", "num_citations": "5\n", "authors": ["1155"]}
{"title": "Establishing the state of the art of frameworks, methods and methodologies focused on lightening software process: A systematic literature review\n", "abstract": " There are several models used in the software process improvement such as CMMI and ISO/IEC 15504 that provide advantages to software organizations, like their improvement in ability and maturity which is reflected in their competitiveness. However, most of the time they are not properly implemented, demanding too many resources and long-term commitments, hindering its implementation in software organizations. Moreover, a properly implementation of a model or standard, involves not only the definition of processes, but introducing the organizations in the development of a continuous process improvement culture. In this context, a feasible way to achieve continuous process improvement is the optimization of processes through their lightening. This paper presents the results of a systematic review method in order to establish the state of art for lightening software process, focusing on three aspects …", "num_citations": "5\n", "authors": ["1155"]}
{"title": "A taxonomy for software testing projects\n", "abstract": " This article establishes taxonomy for software testing projects, allowing the development team or testing personnel to identify the tests to which the project must be subjected for validation. The taxonomy is focused on identifying software projects according to their technology. To establish the taxonomy, a development method comprised of 5 phases was applied. The developed taxonomy is comprised of 9 categories and 27 subcategories and was validated by a group of information technology (IT) managers and professionals in the field of IT through the use of a survey. The results obtained from the survey are subjected to the Mann-Whitney U test, which indicates that the taxonomy is validated. The taxonomy can be implemented in development organizations with or without a testing team that provides a classification for technology projects.", "num_citations": "5\n", "authors": ["1155"]}
{"title": "Changing the software engineering education: a report from current situation in Mexico\n", "abstract": " Nowadays, in Mexico software engineering education has two problems when satisfying software industry necessities: the quantity of young and skilled students and the quality of their formation. In this sense, it is necessary to improve education at the undergraduate level. We have identified five malfunctions in the current situation of software engineering education. The correction of these problems requires the design of a module-oriented curriculum, creation of networks with local industry, federal and state funding, and alternative educational paradigms for software engineering. This paper shows the strategy and federal programs established to modernize the software engineering curriculum.", "num_citations": "5\n", "authors": ["1155"]}
{"title": "Statistical analysis of the implementation for best practices in software development organizations\n", "abstract": " The software industry is formed by 90% of small and medium organizations formally reported to government agencies. The needs of such organizations worldwide are particular and are far from the needs of large organizations. Large organizations are capable of supporting and implementing large and complex structures of international standards and models for software process improvement. The provision of facilities to small and medium sized organizations to implement best practices in software development based on the recommendations of the international standards and models is: a) a need for these organizations, b) a duty of both industry and academia. Therefore, it is necessary to make a diagnosis to identify the needs of these organizations in the area of best practices in software development. The goal of this paper is to analyze the current state of the implementation of best practices in software …", "num_citations": "5\n", "authors": ["1155"]}
{"title": "Perspectivas de la mejora de procesos de software\n", "abstract": " El software se ha convertido en un aspecto estratégico en cualquier tipo de negocio. Por ello, la mejora del proceso software se ha convertido en una ventaja estratégica en la mayoría de las organizaciones. Por tanto, la investigación en los distintos aspectos de mejora en universidades y centros de investigación, así como la participación de las empresas y de las administraciones y los organismos públicos, son fundamentales para la implantación con éxito de los proyectos de mejora de procesos. La Cátedra de Mejora de Procesos Software en el Espacio Iberoamericano (MPSEI) de la Universidad Politécnica de Madrid (UPM) nació en el año 2005 y está actualmente patrocinada por la Fundación Everis. Pretende ser un elemento estabilizador de la investigación en este campo así como un catalizador entre las investigaciones llevadas a cabo en la Universidad y las necesidades del mundo empresarial …", "num_citations": "5\n", "authors": ["1155"]}
{"title": "A case study related to the control of IT services in a small enterprise\n", "abstract": " This paper shows a case study related to the implementation of the financial management process in a small enterprise whose core business is not Information Technology (IT). A brief description of ITIL v3 financial management process is presented. Then, the target enterprise and its IT infrastructure are described. Finally, it shows how it has begun to implement the financial management process through IT costs accounting of the previous year, which makes the baseline, to make the IT budget for the current year.", "num_citations": "5\n", "authors": ["1155"]}
{"title": "Outsourcing Contracts: A Systematic Review\n", "abstract": " This paper presents the application of a systematic review protocol for Software Engineering. This protocol is used as a formal model by applying systematic review of outsourcing contracts. The objective is to search for papers related to outsourcing contracts in the software acquisition process. Furthermore, the systematic review is focused in order to identify initiatives and reports of outsourcing contract proposals for the software acquisition. Results obtained show that most of the studies that tried to define a model for outsourcing did not exactly develop a fixed model to be used in the IT area and that there is a need for more in-depth studies.", "num_citations": "5\n", "authors": ["1155"]}
{"title": "Implementación de una biblioteca de activos de proceso orientada a la gestión de la capacidad de servicios de TI\n", "abstract": " Una forma de mejorar la calidad en las organizaciones es mejorar sus procesos, por lo que mantener el conocimiento de estos procesos (activos) es vital para cualquier organización. Un modo de organizar estos activos es a través de la biblioteca de activos de proceso (Process Asset Lybrary, PAL), aunque para la creación de PAL efectivas surgen una serie de problemas. Se presenta una nueva aproximación práctica, y un breve caso de estudio centrado en la gestión de la capacidad de servicios de TI.", "num_citations": "4\n", "authors": ["1155"]}
{"title": "Estado de arte sobre métodos de evaluación de metodologías ágiles en las pymes (Art state about evaluation methods of agile methodologies in pymes)\n", "abstract": " Muchas organizaciones pequeñas y medianas empresas (pymes) están usando las metodologías ágiles, tales como SCRUM, XP, Kanban, entre otras. Sin embargo, el poco conocimiento en el uso de procesos y metodologías, da como resultado que las pymes adopten las metodologías ágiles empíricamente, y en algunas ocasiones sin seguir los principios marcados en el manifiesto ágil. En este contexto, el objetivo del artículo es el establecimiento del estado del arte referente a los frameworks, métodos y metodologías que existen para evaluar la implementación y el uso de las metodologías ágiles enfocado en las pymes de Latinoamérica. Para lograr el objetivo, se realiza un protocolo de revisión sistemática, del cual se obtuvieron 35 estudios primarios, que han permitido identificar la metodología ágil más utilizada en las pymes, y los métodos, frameworks y herramientas existentes para evaluar si una organización lleva correctamente una metodología ágil y por lo tanto, los principios ágiles.", "num_citations": "4\n", "authors": ["1155"]}
{"title": "A review of software project testing\n", "abstract": " In this article a review of software projects based on a taxonomy project is established, allowing the development team or testing personnel to identify the tests to which the project must be subjected for validation. The taxonomy is focused on identifying software projects according to their technology. To establish the taxonomy, a development method comprised of 5 phases was applied. The developed taxonomy is comprised of 10 categories and 35 subcategories and was validated by a group of information technology (IT) managers and professionals in the field of IT through the use of a survey. The results obtained from the survey are subjected to the Mann-Whitney U test, which indicates that the taxonomy is validated. The taxonomy can be implemented in development organizations with or without a testing team that provides a classification for technology projects.", "num_citations": "4\n", "authors": ["1155"]}
{"title": "Involvement of Stakeholders in Software Processes Improvement to Reduce Change Resistance\n", "abstract": " Organizational software process improvement offers a key opportunity for organizations to become more efficient. However, most of time implements software process improvements initiatives in organizations become a path full of obstacles mainly because stakeholders feel it as an imposition of anybody processes and its implementation as a threat of their jobs. As a result, most of the time the effort in the implementation of software process improvement fails, stakeholders feel frustrated and organizations are more convinced than ever that they must continue doing their work as before even when they do not have the expected results in their job performance. This paper presents an overview of how can be involved stakeholder throughout the implementation of software process improvements so that they feel key elements in order to have a successful software process improvement initiative. Therefore the …", "num_citations": "4\n", "authors": ["1155"]}
{"title": "Method to evaluate process performance focused on minimizing resistance to change\n", "abstract": " Software process improvement is a way that allows organizations to get a competitive advantage toward its competitors, therefore, in order to implement a successfully software process improvements process assessment is a key element, because it is the firsts step to know the performance of the organizational software process. Unfortunately, the current approaches to evaluate processes performance in software organizations most of the time increase the people resistance to perform software process improvement initiatives because they are based on applying questionnaires that people perceive as an assessment of their job. Besides, questionnaires used in those approaches are adaptations from models and standards mainly ISO 15504 and CMMI. Consequently the processes gaps are not focus on organization needs, however, organizations use these gaps as targets in the implementation of software …", "num_citations": "4\n", "authors": ["1155"]}
{"title": "A State of Art of Software Improvement Implementation Support Tools in SMEs\n", "abstract": " Nowadays becoming competitive is a critical challenge for organizations and software process improvement is an obvious and logical way to address this increasing need in the software industry, unfortunately not all software process improvements have the expected results, because of the lack of knowledge on how to do it and the lack of support available for organizations specially SMEs. This paper presents a state of art of research focused on software tools which help organizations in performing a successful implementation of software process improvements initiatives.", "num_citations": "4\n", "authors": ["1155"]}
{"title": "CMMI-ACQ: a formal implementation sequences of the processes areas at maturity level 2\n", "abstract": " Nowadays, the information technology outsourcing is having a fast growth worldwide. However, according to recent studies, 20 to 25 percent of large IT acquisition projects fail within two years and 50 percent fail within five years. CMMI-ACQ is a model that provides guidance to organizations on the acquisition of software products and related services. This paper addresses an implementation sequence of the processes areas at maturity level 2. To achieve this objective, graphs theory is used to represent the existing dependencies among CMMI-ACQ processes areas, in order to find strongly connected cluster and cyclic processes areas. These clusters using formal criteria have helped to determine the implementation sequences of the acquisition processes areas at maturity level 2.", "num_citations": "4\n", "authors": ["1155"]}
{"title": "Identificando caminos para iniciar la implementación de mejora de procesos de software en organizaciones de desarrollo de software\n", "abstract": " En la actualidad, uno de los principales obstáculos de las organizaciones de desarrollo de software en la implementacion del Modelo CMMI-Dev es como iniciar su implementación y aumentar la probabilidad de éxito en una evaluación SCAMPI. Este método de evaluación permite validar, establecer e identificar las oportunidades de mejora de procesos para obtener un nivel de madurez. Sin embargo, el método de evaluación SCAMPI no garantiza una evaluación exitosa, debido a que el proceso de evaluación es empírico basado en la experiencia del equipo auditor experto en Mejora de Procesos de Software con respecto a este modelo. Este artículo propone la identificacion de alternativas de caminos a traves de una herramienta para lograr una efectiva implementación en el modelo CMMIDEV Nivel 2, considerando sus objetivos de negocio de la organización.", "num_citations": "3\n", "authors": ["1155"]}
{"title": "Analysis of Tools for Assessing the Implementation and Use of Agile Methodologies in SMEs\n", "abstract": " Nowadays, small and medium enterprises are using agile methodologies as an effort to produce software to meet the time requested by the market. However, the lack of knowledge on how to use them adequately results in their empirical adoption with an inefficient software development. In this context, a set of software tools that pretend to help SMEs in the implementation of an agile methodology have been developed. Unfortunately, most of them list a set of questions without providing the expected support. This paper aims to analyze a set of the most used software tools found in the literature in order to identify which elements are covered and focused by the software tools. Besides, this analysis allowed us to identify deficiencies in the actual tools and a set of key elements that should be taken into account to help SMEs in the correct implementation and the achievement of maturity on the use of an agile …", "num_citations": "3\n", "authors": ["1155"]}
{"title": "Security by design factors for developing and evaluating secure software\n", "abstract": " Secure by Design (SbD) is a project management oriented philosophy to develop secure software. This paper is the result of research based on the practices proposed by SbD. A security factors structure to manage such projects is defined. The factors are structured into three organizational levels (strategic, tactical and operational). The purpose is to facilitate the implementation and evaluation of SbD. The security factors structure for software engineering projects has been mapped with the most representative frameworks and standards and the results are shown.", "num_citations": "3\n", "authors": ["1155"]}
{"title": "Implementation of Software Process Improvement through TSPi in Very Small Enterprises\n", "abstract": " This article shows an experience in a very small enterprise related to improving software quality in terms of test and process productivity. A customized process from the current organizational process based on TSPi was defined and the team was trained on it. The pilot project had schedule and budget constraints. The process began by gathering historical data from previous projects in order to get a measurement repository. Then the project was launched and some metrics were collected. Finally, results were analyzed and the improvements verified.", "num_citations": "3\n", "authors": ["1155"]}
{"title": "Identificación de las Mejores Prácticas de una Organización de Desarrollo de Software Mediante la Gestión de su Conocimiento\n", "abstract": " En este artículo se describe un método para la identificación de las mejores prácticas de una organización de desarrollo de software, enfocándose en la disminución de la resistencia al cambio, a través de la gestión de su conocimiento. La importancia de la identificación de las mejores prácticas de una organización radica en que esta actividad permite conocer cómo trabaja una organización mediante la formalización, conservación y promoción de su conocimiento clave, lo cual, permitirá que las iniciativas de mejora de los procesos de la organización sean llevadas a cabo con éxito.", "num_citations": "3\n", "authors": ["1155"]}
{"title": "Análisis de la calidad y productividad en el desarrollo de un proyecto software en una microempresa con TSPi\n", "abstract": " Este artículo presenta el análisis de los resultados obtenidos al aplicar TSPi en el desarrollo de un proyecto software en una microempresa desde el punto de vista de la calidad y la productividad. La organización en estudio necesitaba mejorar la calidad de sus procesos pero no contaba con los recursos económicos que requieren modelos como CMMI-DEV. Por esta razón, se decidió utilizar un proceso adaptado a la organización basado en TSPi, observándose una reducción en la desviación de las estimaciones, un incremento en la productividad, y una mejora en la calidad.", "num_citations": "3\n", "authors": ["1155"]}
{"title": "Team Software Process (TSP): Mejoras en la Estimación, Calidad y Productividad de los Equipos en la Gestión del Software\n", "abstract": " Este artículo presenta los resultados de una experiencia basada en Team Software Process (TSP), los cuales muestran que a medida que los equipos incrementan sus conocimientos y adquieren mayor experiencia en su uso, éstos van mejorando en estimaciones, disminuyen la densidad de los defectos e incrementan la productividad. Los resultados están basados en un análisis de los datos suministrados por 22 equipos de trabajo formados por 5 a 6 estudiantes del cuarto curso de la carrera Informática, en los formularios ajustados a formato TSP,. Se recogieron datos de estimaciones de tamaño, esfuerzo, así como de sus valores reales y de los defectos. A partir de estos datos primarios, se ha realizado el análisis de las desviaciones obtenidas al estimar el tamaño a lo largo de los dos ciclos. Se ha analizado también la calidad en términos de defectos/KLOC, así como la planificación en términos de productividad y costes. Finalmente, se presentan las lecciones aprendidas de la utilización de la metodología TSP haciendo hincapié en la calidad del proceso de medida y en el entrenamiento.", "num_citations": "3\n", "authors": ["1155"]}
{"title": "A software process improvement solution for small and medium-size enterprises\n", "abstract": " The focus of this paper is to outline the main structure of an alternative software process improvement method for small- and medium-size enterprises. This method is based on the action package concept, which helps to institutionalize the effective practices with affordable implementation costs. This paper also presents the results and lessons learned when this method was applied to three enterprises in the requirements engineering domain.", "num_citations": "3\n", "authors": ["1155"]}
{"title": "Agile-CMMI Alignment: Contributions and To-Dos for Organizations\n", "abstract": " We discuss the extent to which Capability Maturity Model Integration (CMMI) v2.0 addresses Agile alignment challenges. We identify the two most significant CMMI v2.0 artifacts for integration, and highlight important issues that organizations need to tackle.", "num_citations": "2\n", "authors": ["1155"]}
{"title": "Implementing the Ki Wo Tsukau® model to strengthen the commitment of small-sized software enterprises in software process improvement initiatives\n", "abstract": " In spite that the lack of commitment and motivation has been directly linked to a high degree of failures in software process improvement initiatives, these two aspects have not received yet enough attention by researchers. In this regard, small enterprises are more susceptible to fail when committing an effort for improving because the people involved do not know what to do or how to act with this change. Moreover, the Ki Wo Tsukau® model is promoting the use of proper levels of energy, commitment, and motivation in different contexts. Therefore, this paper introduces an alternative approach to strengthen the commitment of a Mexican small-sized software enterprise, by implementing some basic principles of the Ki Wo Tsukau® model in a software process improvement initiative.", "num_citations": "2\n", "authors": ["1155"]}
{"title": "A systematic review in the decision analysis of selecting an IT outsourcing supplier\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "2\n", "authors": ["1155"]}
{"title": "MEDEPRO: a method to deploy processes focused on people\n", "abstract": " Nowadays, organizations need to respond to customer demands with quality products and services. Methodologies and process models have been developed to help organizations to achieve these objectives. However, despite the efforts of organizations, they still come up against difficulties in their deployment and the processes are not institutionalized. Difficulty in process institutionalization arises due to the fact that most of these efforts focus on technical issues, and people issues are ignored. This paper presents the critical success factors to take into account in the process deployment, and a process deployment method to be used in software projects. These highlight the importance of having an effective process deployment strategy to adopt, use and institutionalize the process. The results of a case study are included.", "num_citations": "2\n", "authors": ["1155"]}
{"title": "Project management and IT governance. Integrating PRINCE2 and ISO 38500\n", "abstract": " IT governance is becoming a critical area for the improvement and business continuity in organizations. The value of the services, as a product of IT projects, must be improved. A good definition of IT projects, according to business needs, helps to improve product value. For this purpose, some frameworks and standards have been developed by internationally recognized institutions. Among them project management framework “PRINCE2” and the IT governance standard ISO/IEC 38500 are highlighted. The application of these frameworks and standards has meant figures have improved, but they are far from covering the expectations of organizations. A IT project approach that integrates the needs of business and technology that supports it is a key to achieve the expected success for IT projects in organizations. This paper presents a summary of the study performed to find out how PRINCE2 meets the …", "num_citations": "2\n", "authors": ["1155"]}
{"title": "Método para seleccionar un modelo de procesos para desplegar procesos software\n", "abstract": " Seleccionar un modelo o estándar que sirva de referencia para desplegar los procesos usados en el desarrollo de software es una tarea compleja. Se requiere contar con personas que tengan la habilidad y los conocimientos para comparar el contenido del modelo y/o estándar teniendo en cuenta la variedad de estructuras y descripciones que presentan los modelos, y tomando en consideración las necesidades de la organización. El propósito de este artículo es describir un método para seleccionar un modelo de referencia para desplegar los procesos software, basado en las necesidades de la organización. Dichas necesidades se traducen en criterios relacionados a los factores críticos de éxito de una iniciativa de mejora. El método ha sido aplicado para seleccionar el modelo de referencia a usar en el diseño de una estrategia de despliegue de procesos con una mayor garantía de éxito.", "num_citations": "2\n", "authors": ["1155"]}
{"title": "Proposal for identifying teamwork roles in software engineering through the construction of a virtual rube goldberg machine\n", "abstract": " One of the most important factors in teamwork is the integration of the people who compose it because is strongly linked to the level of cohesion and team performance. Therefore the activities to integrate it are very important because they allow building and strengthening both the personal and professional relationships among the team members. Nowadays there is a great variety of activities to carry out the integration of a team that aims to improve communication coordination and teamwork. These activities are a very important support for improving the teamwork regardless the area where the team carries out its activities. In this context this paper presents a proposal to carry out the identification of teamwork roles for a software development team based on building a Rube Goldberg machine and the activities carried out in TSPi methodology toward the integration of a team.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "MyPMP: A plug-in for implementing the metamodeling approach for project management in small-sized software enterprises\n", "abstract": " Nowadays, with the recurrent demands of high quality, delivery on time and no    extra costs, the task of managing a software project could be extremely    complex for any software enterprise. Furthermore, small-sized software    enterprises face several problems (e.g., lack of knowledge, human and    financial resources, time, and size of staff) that, undoubtedly, make this    task more difficult. In this context, obtaining a simplified version of the    management activities can be a helpful alternative for these enterprises. In    this way, that an inexperienced project manager can define the management    process that best fits with a particular project is not an easy task. Thus,    this paper introduces the metamodeling approach in order to help project    managers to define a process for managing a software project. Therefore, with    the aim to validate its feasibility an add-in program was developed as a part    of a case study. The achieved results show an important reduction in    project’s effort and time needed to develop a new software product.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "Diseno de un instrumento pedagogico para la ensenanza de la mejora de procesos software: Instrumento de ensenanza para ambientes universitarios y empresariales\n", "abstract": " Software development organizations focus their efforts and invest resources on improving their processes and motivating their teams. The goal of this initiative is to develop high quality software products; however, some difficulties related to the learning process can be found in the dynamics interactions of the professional teams within the organization. A potential cause for these difficulties can be attributed to the use and implementation of teaching methodologies with lower levels of team member motivation. Gamification offers a possible solution for these deficiencies providing more thought-provoking environments for the learning experience. In this paper we propose a teaching instrument based on the principles of gamification to achieve a required level of motivation in teams involved in process improvement. Thus, motivation makes possible a successful implementation of the continuous improvement cycle in software development organizations.© 2014 AISTI.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "Process Deployment: A Taxonomy of Critical Success Factors\n", "abstract": " Various methods, models and standards for software process improvement have been adopted by organizations to improve their software processes. However, despite these efforts they still encounter difficulties in their process deployment throughout the organization. This is because the vast majority of these efforts focus more on the technical aspects, bypassing the human aspects. There is a set of factors that influence the successful deployment of new or modified processes. This paper presents taxonomy of critical success factors in software process deployment to achieve the processes institutionalization. The development of a taxonomy related to these critical success factors is based on a systematic review of existing literature on specialized databases and industrial experiences that have deployed or implemented processes.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "Outsourcing and acquisition models comparison related to IT supplier selection decision analysis\n", "abstract": " This paper presents a comparison of acquisition models related to decision analysis of IT supplier selection. The main standards are: Capability Maturity Model Integration for Acquisition (CMMI-ACQ), ISO/IEC 12207 Information Technology/Software Life Cycle Processes, IEEE 1062 Recommended Practice for Software Acquisition, the IT Infrastructure Library (ITIL) and the Project Management Body of Knowledge (PMBOK) guide. The objective of this paper is to compare the previous models to find the advantages and disadvantages of them for the future development of a decision model for IT supplier selection.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "Assessment of organization software processes performance focusing on minimizing resistance to change\n", "abstract": " This paper describes a method to assess process performance in software development organizations by using alternative techniques to the questionnaires, which are actually using as a main technique to assess the software process performance. The process assessment is important because if it is performing in a right way; it allows organizations to identify improvement opportunities and to address the improvement effort toward those software processes that need to be improved in order to achieve business goals established by senior management. Therefore, organizations could create strategic advantages with respect to its competitors and to ensure their marked continued.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "A Multi-model Workflow before Establishing an Acquisition Contract Based on CMMI-ACQ Model\n", "abstract": " CMMI-ACQ is a model that provides guidance to organizations on the acquisition of software products and related services. This paper addresses an organizational proposal that establishes a multi-model workflow in order to implement specific practices of the Solicitation and Supplier Agreement Development (SSAD) process area of CMMI-ACQ model. To achieve this, the Organization of the Acquisition Processes (OAP) procedure is implemented. OAP have helped to determine the implementation sequences of the acquisition processes areas at maturity level 2. Once the sequence is obtained, the explicit dependencies and prioritization of the practices within the SSAD process area are analyzed, in order to establish the workflow and its multi-model environment.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "Quality and productivity analysis in a very small enterprise using TSPi\n", "abstract": " This article shows the benefits of developing a software project using TSPi in a \"Very Small Enterprise\" based in quality and productivity measures. An adapted process from the current process based on the TSPi was defined and the team was trained in it. The pilot project had schedule and budget constraints. The workaround began by gathering historical data from previous projects in order to get a measurement repository, and then the project metrics were collected. Finally, the process, product and quality improvements were verified", "num_citations": "1\n", "authors": ["1155"]}
{"title": "PROMEP: A Metamodel for Define, Implement and Improve the Project Management Processes in SMEs\n", "abstract": " This paper aims to show an alternative metamodel to improve the quality of project management process. This work is based on effective practices through the analysis and study of relevant models and standards related to project management. It is true that there are many models that improve the project management effectiveness, but most of them are focused only on two processes: Project Planning and Project Monitoring and Control, neither of which is affordable for small and medium enterprises. Our study proposes a new meta-model to achieve higher performance levels in these types of organizations.", "num_citations": "1\n", "authors": ["1155"]}
{"title": "Experiences of Spanish public administration in requirements management and acquisition management processes\n", "abstract": " This paper shows the main contributions of the 1st Symposium on Improvement Process Models and Software Quality of Public Administrations. The obtained results expose the need to promote the implementation of Software Maturity Models and show possible advantages of its application in software processes of Public Administrations. Specifically, it was analyzed the current status in two process areas: Requirements Management and Subcontracting Management.", "num_citations": "1\n", "authors": ["1155"]}