{"title": "Prediction of wind pressure coefficients on building surfaces using artificial neural networks\n", "abstract": " Knowing the pressure coefficient on building surfaces is important for the evaluation of wind loads and natural ventilation. The main objective of this paper is to present and to validate a computational modeling approach to accurately predict the mean wind pressure coefficient on the surfaces of flat-, gable- and hip-roofed rectangular buildings. This approach makes use of artificial neural network (ANN) to estimate the surface-average pressure coefficient for each wall and roof according to the building geometry and the wind angle. Three separate ANN models were developed, one for each roof type, and trained using an experimental database. Applied to a wide variety of buildings, the current ANN models were proved to be considerably more accurate than the commonly used parametric equations for the estimation of pressure coefficients. The proposed ANN-based methodology is as general and versatile as to …", "num_citations": "182\n", "authors": ["1847"]}
{"title": "A fast and accurate method to solve the incompressible Navier‐Stokes equations\n", "abstract": " The purpose of this paper is to highlight the possibilities of a novel Lagrangian formulation in dealing with the solution of the incompressible Navier‐Stokes equations with very large time steps.", "num_citations": "62\n", "authors": ["1847"]}
{"title": "Lagrangian versus Eulerian integration errors\n", "abstract": " The possibility to use a Lagrangian frame to solve problems with large time-steps was successfully explored previously by the authors for the solution of homogeneous incompressible fluids and also for solving multi-fluid problems (Idelsohn et al. 2012; 2014; 2013). The strategy used by the authors was named Particle Finite Element Method second generation (PFEM-2).The objective of this paper is to demonstrate in which circumstances the use of a Lagrangian frame with particles is more accurate than a classical Eulerian finite element method, and when large time-steps and/or coarse meshes may be used.", "num_citations": "25\n", "authors": ["1847"]}
{"title": "An extended validation of the last generation of particle finite element method for free surface flows\n", "abstract": " In this paper, a new generation of the particle method known as Particle Finite Element Method (PFEM), which combines convective particle movement and a fixed mesh resolution, is applied to free surface flows. This interesting variant, previously described in the literature as PFEM-2, is able to use larger time steps when compared to other similar numerical tools which implies shorter computational times while maintaining the accuracy of the computation. PFEM-2 has already been extended to free surface problems, being the main topic of this paper a deep validation of this methodology for a wider range of flows. To accomplish this task, different improved versions of discontinuous and continuous enriched basis functions for the pressure field have been developed to capture the free surface dynamics without artificial diffusion or undesired numerical effects when different density ratios are involved. A collection of …", "num_citations": "25\n", "authors": ["1847"]}
{"title": "Modeling of compressible fluid problems with openfoam using dynamic mesh technology\n", "abstract": " Computational simulation of phenomena that are present in internal combustion engines is a suitable design tool for energetic efficiency optimization. OpenFOAM capabilities as computational code need to be extended to approach more complex problems that appear in the modelling of thermodynamic engine cycles. The present work reports the development and testing of a new application for Open-FOAM that enables the use of a compressible fluid solver with dynamic mesh technology. Both features are essential to model internal combustion engines. Therefore, the implementation in OpenFOAM suite of a topological mesh adaptation technique known as layering is presented. The layering technique is added to the diffusion based mesh movement among others, in the mesh dynamics capabilities of Open-FOAM. This approach is used in the compressible solver called rhoPimpleDyMFoamMC to solve fluid problems where the energy transfer on moving domains is carried out. The new computational tool is used to solve several problems with different boundary conditions in a closed piston-cylinder system. A detailed analysis of the accuracy and convergence of the pressure-velocity-energy coupling is achieved and the results are compared with theoretical change of state equations.", "num_citations": "24\n", "authors": ["1847"]}
{"title": "Conservative handling of arbitrary non-conformal interfaces using an efficient supermesh\n", "abstract": " This work presents a new and efficient strategy to handle non-conformal interfaces with the aim of assuring the conservation of fluxes in Finite Volume problems. A conservative interpolation is developed for general transport equations. Due to the arbitrary connectivity between the interfaces, the interpolations require flux-based weights defining a complex numerical stencil. In this context, a new method is proposed to simplify the coupling at the interface based on the construction of a simplified supermesh. Here, a supermesh is not completely defined, instead, the interface faces are logically duplicated (or multiplied) to generate a one-to-one connectivity between them. The simplified supermesh named pseudo-supermesh eliminates the interpolations and assures the conservation of fluxes based on the trivial connectivity. The area and the geometrical centroid of the new faces are redefined according to the …", "num_citations": "15\n", "authors": ["1847"]}
{"title": "Optimization of RANS turbulence models using genetic algorithms to improve the prediction of wind pressure coefficients on low-rise buildings\n", "abstract": " Being associated with natural ventilation, the pressure distribution on surfaces is relevant for energy consumption, thermal comfort, and air quality in buildings. The aim of this work is to present a simulation-based optimization methodology to recalibrate the closure coefficients of Reynolds-averaged Navier-Stokes (RANS) turbulence models in order to improve the prediction of wind surface-averaged pressure coefficients on a wide range of isolated low-rise buildings. To accomplish this, genetic algorithms and Computational Fluid Dynamics (CFD) simulations are dynamically coupled to find the closure coefficients set which minimize the CFD prediction error regarding wind-tunnel experimental data. The methodology is applied to two turbulence models, the renormalization group k-epsilon model (RNG) and the Spalart-Allmaras model (SA), considering as target cases buildings with different roof types (flat, gable …", "num_citations": "14\n", "authors": ["1847"]}
{"title": "Evaluating the performance of the particle finite element method in parallel architectures\n", "abstract": " This paper presents a high performance implementation for the particle-mesh based method called particle finite element method two (PFEM-2). It consists of a material derivative based formulation of the equations with a hybrid spatial discretization which uses an Eulerian mesh and Lagrangian particles. The main aim of PFEM-2 is to solve transport equations as fast as possible keeping some level of accuracy. The method was found to be competitive with classical Eulerian alternatives for these targets, even in their range of optimal application. To evaluate the goodness of the method with large simulations, it is imperative to use of parallel environments. Parallel strategies for Finite Element Method have been widely studied and many libraries can be used to solve Eulerian stages of PFEM-2. However, Lagrangian stages, such as streamline integration, must be developed considering the parallel strategy …", "num_citations": "14\n", "authors": ["1847"]}
{"title": "Elemental enriched spaces for the treatment of weak and strong discontinuous fields\n", "abstract": " This paper presents a finite element that incorporates weak, strong and both weak plus strong discontinuities with linear interpolations of the unknown jumps for the modeling of internal interfaces. The new enriched space is built by subdividing each triangular or tetrahedral element in several standard linear sub-elements. The new degrees of freedom coming from the assembly of the sub-elements can be eliminated by static condensation at the element level, resulting in two main advantages: first, an elemental enrichment instead of a nodal one, which presents an important reduction of the computing time when the internal interface is moving all around the domain and second, an efficient implementation involving minor modifications allowing to reuse existing finite element codes. The equations for the internal interface are constructed by imposing the local equilibrium between the stresses in the bulk of the …", "num_citations": "12\n", "authors": ["1847"]}
{"title": "Computational modeling of natural ventilation in low-rise non-rectangular floor-plan buildings\n", "abstract": " Natural ventilation (NV) is a relevant passive strategy for the design of buildings in seek of energy savings and the improvement of the indoor air quality and the thermal comfort. The main aim of this work is to present a comprehensive NV modeling study of a non-rectangular floor-plan dwelling. Given the arbitrary shape of the building, recourse is made to computational fluid dynamics (CFD) to determine the surface-averaged pressure coefficients (). The CFD model was calibrated to match experimental data from an extensive wind tunnel database for low-rise buildings. Then,  computation via CFD is used to feed the building performance simulation software EnergyPlus, in replacement of the built-in Swami and Chandra parametric model that is only valid for estimating  in rectangular floor-plan buildings. This computational tool is used to investigate the effect of NV on the thermal performance and the …", "num_citations": "10\n", "authors": ["1847"]}
{"title": "Surface tension problems solved with the particle finite element method using large time-steps\n", "abstract": " In previous works [S. R. Idelsohn, J. Marti, P. Becker, E. Oñate, Analysis of multifluid flows with large time steps using the particle finite element method, International Journal for Numerical Methods in Fluids 75 (9) (2014) 621–644. doi:10.1002/fld.3908. URL http://dx.doi.org/10.1002/fld.3908, Juan M. Gimenez and Leo M. González, An extended validation of the last generation of particle finite element method for free surface flows, J Comput Phys 284 (0) (2015) 186–205. doi:http://dx.doi.org/10.1016/j.jcp.2014.12.025. URL http://www.sciencedirect.com/science/article/pii/S0021999114008420 ], the authors have presented a highly efficient extension of the Particle Finite Element Method, called PFEM-2, to solve two-phase flows. The methodology which uses X-IVS [S. Idelsohn, N. Nigro, A. Limache, E. Oñate, Large time-step explicit integration method for solving problems with dominant convection, Comp Methods in …", "num_citations": "10\n", "authors": ["1847"]}
{"title": "Improvements to solve diffusion-dominant problems with PFEM-2\n", "abstract": " Particle Finite Element Method-Second generation (PFEM-2) is a method characterized by using both particles and mesh to solve physics equations.", "num_citations": "9\n", "authors": ["1847"]}
{"title": "Numerical investigation of bund overtopping under storage tank failure events\n", "abstract": " In this paper computational fluid dynamics simulations (CFD) were carried out in order to investigate the efficiency of bund designs and top wall deflectors (breakwaters) under several tank failure modes. Investigation was performed over laboratory scale configurations, some of them were also experimentally studied. Simulations were performed using the Volume of Fluid (VOF) method and literature data were used for assessing the solver prior to investigate the different bund designs. Numerical and experimental results agreed, showing the suitability of numerical methods to predict overtopping. The amount of liquid lost showed a low dependency with the containment shape (square, circular or rectangular), but a high one with the bund height. On the contrary, the use of breakwaters showed to be a suitable and very efficient way to reduce liquid loss, although inducing significant extra mechanical efforts over the …", "num_citations": "8\n", "authors": ["1847"]}
{"title": "An assessment of the potential of PFEM-2 for solving long real-time industrial applications\n", "abstract": " The latest generation of the particle finite element method (PFEM-2) is a numerical method based on the Lagrangian formulation of the equations, which presents advantages in terms of robustness and efficiency over classical Eulerian methodologies when certain kind of flows are simulated, especially those where convection plays an important role. These situations are often encountered in real engineering problems, where very complex geometries and operating conditions require very large and long computations. The advantages that the parallelism introduced in the computational fluid dynamics making affordable computations with very fine spatial discretizations are well known. However, it is not possible to have the time parallelized, despite the effort that is being dedicated to use space–time formulations. In this sense, PFEM-2 adds a valuable feature in that its strong stability with little loss of …", "num_citations": "8\n", "authors": ["1847"]}
{"title": "A New Approach to Solve Incompressible Navier Stokes Equations Using a Particle Method\n", "abstract": " The goal of this work is to present a new methodology to solve computational fluid dynamics (CFD) problems based on a particle method minimizing the usage of mesh based solvers in order to get a potential computational efficiency to get rid of the new challenges of engineering and science. Thanks to the recent advances in hardware, in particular the possibility of using graphic processors (GPGPU), high performance computing is now available if and only if software development gives an important jump to incorporate this technology. Due to the complexity in programming over such a platform the best way to take advantage of its performance rests on the design of numerical methods able to be viewed as cellular automata. In this sense explicit methods seem to be an attractive choice. However it is well known that explicit methods have a severe stability limitation. On the other hand, the spatial discretization of particle methods offers some advantages against others like finite elements or finite volumes in terms of computational costs. The main reasons of this rest on the low dimensionality of this method (particle methods are a zero dimensional representation of the solution of a given set of PDE’s while finite elements are 3D and finite volume are part 2D and part 3D). In addition particle methods are generally written in Lagrangian formulation avoiding the necessity of defining a spatial stabilization in convection dominated flows. Finite elements and finite volume are generally designed using an Eulerian formulation with some extra diffusion in the solution due to this stabilization requirement. However, some particle methods often require a mesh …", "num_citations": "8\n", "authors": ["1847"]}
{"title": "Evolución de la Trypanosomosis bovina por Trypanosoma vivax en Formosa (Argentina). Años 2007-2012 y su potencial dispersión en el país.\n", "abstract": " En base al diagnóstico parasitológico para para tripanosomas de bovinos, se describe la evolución de la onda epizoótica del T. vivax iniciada en Argentina hacia finales del año 2006. Analiza la frecuencia de animales infectados en los diferentes meses del año, a demás de las diferentes características clínicas y epidemiológicas de esta nueva enfermedad en el ganado de Argentina. En base al historial epidemiológico de esta tripanosomosis en países de la región se alerta sobre la propagación de la enfermedad a las principales regiones ganaderas de la Mesopotamia y de la Pampa Húmeda Argentina.", "num_citations": "7\n", "authors": ["1847"]}
{"title": "gdbOF: A debugging tool for OpenFOAM®\n", "abstract": " OpenFOAM® libraries are a great contribution to CFD community and a powerful way to create solvers and other tools. Nevertheless in this creative process a deep knowledge is needed concerning with classes structure, for value storage in geometric fields and also for matrices resulting from equation systems, becoming a hard task for debugging.To help in this process a new tool, called gdbOF, attachable to gdb (GNU debugger) is presented in this paper. It allows to analyze classes structure at debugging time. This application is implemented by gdb macros, these macros can access to code classes and also to their data in a transparent way, giving the requested information. This tool is tested for different application cases, such as the assemble and storage of matrices in a scalar advective–diffusive problem, non orthogonal correction methods in purely diffusive tests and multiphase solvers based on Volume of …", "num_citations": "7\n", "authors": ["1847"]}
{"title": "Instability onset for submerged cylinders\n", "abstract": " This paper describes how the global stability of a circular cylinder is affected when submerged in a two-phase gravitational flow. The flow behavior is governed by both the Reynolds and the Froude number, while the depth of the cylinder has been varied to create different scenarios for the stability analysis. The baseflow obtained by the numerical solution of the 2D Navier-Stokes equations has been analyzed, and the first bifurcation (i.e., Hopf type) has been explored for different depths, Reynolds numbers, and Froude numbers. In addition to the typical vortex shedding instabilities associated with the isolated cylinders, the presence of an interface between fluids creates new instabilities associated with the free surface which present more complex and deformed structures. According to the region of the parameter space studied here, two main causes of instabilities have been found: the ones provoked by vortex …", "num_citations": "6\n", "authors": ["1847"]}
{"title": "Multifluid flows with weak and strong discontinuous interfaces using an elemental enriched space\n", "abstract": " In a previous paper, the authors presented an elemental enriched space to be used in a finite‐element framework (EFEM) capable of reproducing kinks and jumps in an unknown function using a fixed mesh in which the jumps and kinks do not coincide with the interelement boundaries. In this previous publication, only scalar transport problems were solved (thermal problems). In the present work, these ideas are generalized to vectorial unknowns, in particular, the incompressible Navier‐Stokes equations for multifluid flows presenting internal moving interfaces. The advantage of the EFEM compared with global enrichment is the significant reduction in computing time when the internal interface is moving. In the EFEM, the matrix to be solved at each time step has not only the same amount of degrees of freedom (DOFs) but also the same connectivity between the DOFs. This frozen matrix graph enormously improves …", "num_citations": "6\n", "authors": ["1847"]}
{"title": "Enlarging time-steps for solving one and two phase flows using the particle finite element method\n", "abstract": " The development of numerical methods for one-phase flows have undergone a tremendous progress and impressive results. The case of multi-phase flows is a field placed far from being completely understood and the available numerical tools are still in a developing stage. An additional issue of current numerical strategies is the considerable computational effort required to solve problems where complex geometries are present requiring high level of detail and large simulation times. In this context, the current thesis presents a highly efficient numerical tool to solve one- and two-phase flows called Particle Finite Element Method Two (PFEM-2). This method presents a hybrid spatial discretization, which uses Lagrangian particles and Eulerian mesh, for the numerical solution of the transport equations written in Lagrangian formulation. The improved methodology includes a novel strategy of explicit integration of particles trajectories following the streamlines, which gives it the capability of using large time-steps without significant accuracy loss.  The body of this thesis presents a high performing implementation, able to be executed over scientific clusters, and the extension of PFEM-2 to solve two-phase flows considering the treatment of discontinuities at the interfaces and surface tension without loosing the feature of employing large time-steps. Also, new strategies of projection from particles to mesh, mathematical formulation of integration errors, solution of complex academical and industrial problems, among other novel topics treated, gives a robust frame of analysis for PFEM-2 and positioning it among the fastest methods to solve …", "num_citations": "6\n", "authors": ["1847"]}
{"title": "Particle transport in laminar/turbulent flows\n", "abstract": " The implementation of a Lagrangian particle transport model in non-homogeneous turbulent flow is presented. The model proposes one-way interaction between the continuous and the discrete phases where the behavior of the continuous one is previously solved with other CFD software. Particle dynamics include four forces terms: buoyancy, inertial, drag and added mass. Also, a Discrete Random Walk (DRW) formulation is added to model the changes on the trajectory of the particles due to turbulence.", "num_citations": "6\n", "authors": ["1847"]}
{"title": "Thermal coupling in particle finite element method-second generation\n", "abstract": " In previous papers (Idelsohn et al., 2012) the numerical method called Particle Finite Element Method-Second Generation (PFEM-2) was presented. It solves scalar and vectorial transport phenomena such as Navier Stokes equations for transient, laminar and incompressible flows. This method is characterized by a Lagrangian formulation that uses both particles and mesh to solve physics equations. Taking advantage of that, particles can transport physics variables that any model includes, this paper presents an evolution of the method for solving equations that govern the fluid flow coupled with passive-scalar transport equations, such as species concentrations or temperature. Also, the explicit streamline integration strategy used by the method allows to update each variable following its own physic law in an efficient way. This paper places particular emphasis in the thermal coupling through a buoyancy term added to fluid acceleration and transporting at each particle its temperature. Regarding to the implementation, it follows the parallel computing strategy presented above. Finally, results obtained in typical benchmark cases, such as thermal square and cubic cavity, are presented, comparing with bibliographic and experimental data.", "num_citations": "6\n", "authors": ["1847"]}
{"title": "A pseudo-DNS method for the simulation of incompressible fluid flows with instabilities at different scales\n", "abstract": " In this work, a new model for the analysis of incompressible fluid flows with massive instabilities at different scales is presented. It relies on resolving all the instabilities at all scales without any additional model, i.e., following the direct numerical simulation style. Nevertheless, the computation is carried out at two levels or scales, termed the coarse and the fine. The fine-scale simulation is performed on representative volume elements providing the homogenized stress tensor as a function of several dimensionless numbers characterizing the flow. Consequently, the effect of the fine-scale instabilities is transferred to the coarse level as a homogenized stress tensor, a procedure inspired by standard multi-scale methods used in solids. The present proposal introduces a new way for the treatment of the flow at the fine scale, simulating not only the coarse scale but also the fine scale with all the necessary detail, but …", "num_citations": "5\n", "authors": ["1847"]}
{"title": "A second-order in time and space particle-based method to solve flow problems on arbitrary meshes\n", "abstract": " This work presents a novel proposal of a second-order accurate (in time and space) particle-based method for solving transport equations including incompressible flows problems within a mixed Lagrangian–Eulerian formulation. This methodology consists of a symmetrical operator splitting, the use of high-order operators to transfer data between the particles and the background mesh, and an improved version of the eXplicit Integration Following the Streamlines (X–IVS) method. In the case of incompressible flows, a large time-step iterative solver is employed where the momentum equation is split to improve the numerical approximation of the convective term.New interpolation and projection operators are evaluated and quadratically accurate solutions of scalar transport tests are presented. Then, incompressible flow problems are solved where the rate of convergence of the method is assessed using both …", "num_citations": "5\n", "authors": ["1847"]}
{"title": "Juegos interactivos en ARDUINO y Java, para motivar y despertar el interés en Informática\n", "abstract": " Esta línea de investigación, se inició en 2003, en la UNPSJB. Este trabajo destaca elementos de Tecnologías de la Información y la Comunicación (TICs), empleados dentro de un contexto educativo, que pueden apoyar a los estudiantes, y favorecer el autoaprendizaje, la autonomía y la creatividad. Introduce recursos de la Web 2.0, características del aprendizaje significativo (AS), herramientas de trabajo colaborativo (TC), que se emplearon dentro del proyecto y apoyan el carácter adaptativo del trabajo del desarrollador de software (DS). Identifica condiciones para poder generar conocimiento, y AS. Presenta el concepto de motivación y distintas percepciones. Destaca las características de los juegos, y la organización y resultados de un evento de transferencia, con el desarrollo de juegos interactivos, en ARDUINO y java, empleados dentro de una estrategia de motivación, tendiente a fortalecer el avance en carreras de Informática (CI), la incorporación de alumnos en proyectos de investigación, y el desarrollo de juegos. Uno de los objetivos del evento, fue el de realizar prueba de uso del juego denominado: juegoDSSB “Juego de símbolos. Sistema binario”, desarrollado dentro del proyecto, implementado por integrantes que realizaron prácticas profesionales en “Programación orientada a objetos”, en 2014.", "num_citations": "5\n", "authors": ["1847"]}
{"title": "Parallel Implementation of the Particle Finite Element Method-Second Generation\n", "abstract": " Particle Finite Element Method-Second Generation (PFEM-2) is a numerical method written in a Lagrangian formulation that uses both particles and a mesh to solve the physics equations in an uncoupled way. The method uses fractional-steps with explicit and implicit calculations as needed.", "num_citations": "5\n", "authors": ["1847"]}
{"title": "gdbOF: A Debugging Tool for OpenFOAM\n", "abstract": " OpenFOAM® libraries are a great contribution to CFD community and a powerful way to create solvers and other tools. Nevertheless in this creative process a deep knowledge is needed concerning with classes structure, for value storage in geometric fields and also for matrices resulting from equation systems, becoming a hard task for debugging. To help in this process a new tool, called gdbOF, attachable to gdb (GNU debugger) is presented in this paper. It allows to analyze classes structure at debugging time. This application is implemented by gdb macros, these macros can access to code classes and also to their data in a transparent way, giving the requested information. This tool is tested for different application cases, such as the assemble and storage of matrices in a scalar advective–diffusive problem, non orthogonal correction methods in purely diffusive tests and multiphase solvers based on Volume of Fluid Method. In these tests several types of data are checked, such as: internal and boundary vector and scalar values from solution fields, fluxes in cell faces, boundary patches and boundary conditions. As additional features of this tool data dumping to file and a graphical monitoring of fields are presented.  All these capabilities give to gdbOF a wide range of use not only in academic tests but also in real problems.", "num_citations": "4\n", "authors": ["1847"]}
{"title": "PFEM based solvers implemented in the OpenFOAM suite\n", "abstract": " Why OpenFOAM? is one of the top 3 most used CFD software. is one of the top 5 most used software on HPC. is open source-free of charge and with an open source code the library is structured to develop reliable and efficient computational continuum-mechanics algorithms. general polyhedral meshes running in thousands of cores multiphysics software with a large set of: numerical schemes turbulence models pre-process, coprocess and postprocess tools it already has a particle model spatial discretization with Finite Volumes (as most CFD software)", "num_citations": "2\n", "authors": ["1847"]}
{"title": "Algoritmos y Estructuras de Datos\n", "abstract": " Este libro corresponde al curso Algoritmos y Estructura de Datos que se dicta en la currícula de Ingeniería Informática y Analista en Informática Aplicada de la Facultad de Ingeniería y Ciencias Hídricas (http://www. fich. unl. edu. ar) de la Universidad Nacional del Litoral (http://www. unl. edu. ar).Página web del curso: La página web del curso es http://www. cimec. org. ar/aed. En esa página funciona un wiki, listas de correo y un repositorio de archivos donde se puede bajar la mayor parte del código que figura en el libro. Este libro se puede bajar en formato PDF de esa página también.", "num_citations": "2\n", "authors": ["1847"]}
{"title": "Contrastación de modelos para combustión premezclada en aplicaciones de motores de combustión interna\n", "abstract": " El empleo de la Dinámica de Fluidos Computacional (CFD, por Computational Fluid Dynamics) se ha constituido actualmente en una etapa ineludible para el análisis detallado del flujo de gas dentro de los motores de combustión interna, tanto en el diseño como en su optimización, con el objetivo de aumentar rendimiento, prestaciones y reducir emisiones. La combustión es uno de los procesos más importantes relacionados con estos objetivos, requiriendo por lo tanto de modelos lo más robustos y precisos posible. Además, dado que la combustión en un motor de combustión interna se desarrolla en régimen turbulento, la modelación de la turbulencia y su interacción con el proceso de combustión son aspectos que deben considerarse en conjunto. En este trabajo se presentan resultados de la implementación de una librería de modelos para combustión premezclada en la suite OpenFOAM® integrada a un solver para flujo compresible. En particular, los modelos implementados corresponden a propuestas disponibles en la literatura donde se utiliza el concepto de flamelet para describir el frente de llama y una ecuación de transporte para la Densidad de Superficie de Llama (FSD, por Flame Surface Density), conocidos como modelos de combustión ECFM (Extendend Coherent Flame Model ). La ecuación para la FSD se resuelve en conjunto con una ecuación de transporte adicional para una variable de progreso de la combustión, además de las correspondientes ecuaciones de continuidad, momento y energía. La modelización de la turbulencia se realiza mediante modelos tipo RANS (Reynolds-Average Navier-Stokes), la cual es …", "num_citations": "2\n", "authors": ["1847"]}
{"title": "Numerical comparison of the particle finite element method against an eulerian formulation\n", "abstract": " The main goal of this paper is to validate experimentally the principal conclusions previously published in [17]. Two manufactured test cases were considered with their respective analytic solutions. First, a scalar transport equation is considered written in such a way that several parameters are included to stress the limiting situation where the Eulerian and the Lagrangian approaches behave better. The results show conditions to be fulfilled in order to choose between both formulations, according to the problem parameters. A brief discussion about the projection needed for PFEM-2 method is included, specially due to its impact on the error convergence rate. Lately, an extension to Navier-Stokes equations is introduced using also a manufactured case to verify again the same conclusions. This paper intends to establish the first steps towards a mathematical error analysis for the particle finite element …", "num_citations": "2\n", "authors": ["1847"]}
{"title": "Engine simulation using layering and sliding interfaces mesh dynamics technologies\n", "abstract": " The optimization of internal combustion engines is an important strategy to reduce the global energy requirements and pollutant emissions. The design of new engines needs to use efficient engineering tools to reduce development time and economic resources. Regarding to this, computational fluid dynamics in general and the OpenFOAMR suite in particular have shown to be adequate tools for the development of engines with the advantages for the latter of being a free code with a large users community.", "num_citations": "2\n", "authors": ["1847"]}
{"title": "Recent advances in the particle finite element method towards more complex fluid flow applications\n", "abstract": " This paper presents a state of the art in the Particle Finite Element Method, normally called PFEM, its emphasis in the new ideas oriented to extend its application not only to solve fluid structure interaction and multifluid problems, also bring new opportunities to shorten the gap between engineering design times and computational simulation times for general problems when Eulerian formulation were typically chosen. In order to reduce the long history of this method here the starting point begins with the reformulation of the method to solve academic and real problems in real time or at least in drastically reduced computational times. The main topics involved in this paper are around the stability and the accuracy of Lagrangian formulations against its Eulerian counterpart shown through several academic benchmarks and a deep analysis of the efficiency revealing that the original method needs some new …", "num_citations": "2\n", "authors": ["1847"]}
{"title": "The Pseudo-Direct Numerical Simulation method for multi-scale problems in mechanics\n", "abstract": " We present an overview of the Pseudo-Direct Numerical Simulation (P-DNS in short) method for the solution of multi-scale phenomena. The method can be seen as an adaptation of the variational multi-scale (VMS) method, where the fine solution is solved numerically instead of analytically. Also, from the point of view of homogenization methods it can be seen as an evolution of Finite Element square (FE 2) methods, where the most expensive part of the computations is performed offline. The name of P-DNS arises from the premise that in all multi-scale simulations the numerical result obtained with a very fine discretization is correct without the need to introduce any additional model (ie turbulence models) or stabilization procedures for transport equation terms (as in residual-based VMS methods). What is intended here is that the P-DNS solution tends to the DNS solution of the problem, accepting as a premise …", "num_citations": "1\n", "authors": ["1847"]}
{"title": "Advances in the Pseudo-DNS Methodology: Database Construction for the Averaged Inertial Stresses on the Internal RVE\n", "abstract": " Pseudo Direct Numerical Simulation (pseudo-DNS) is a novel concurrent multiscale methodology which splits the numerical solution into two: the coarse and the fine parts. Here, the coarse scale solution is computed as usual using a relatively coarse mesh but including the pre-computed inertial stresses from the fine-scale solution. To introduce the basis of the method, in this work the pseudo-DNS model is first applied to the classical convection-diffusion problem. Secondly, in the context of Navier-Stokes solutions far from walls, a database for the fine-scale response is constructed. Several DNSsimulations varying the dimensionless tensor Id, which can be reduced to two parameters, are carried out on a Representative Volume Element (internal RVE) to obtain the averaged internal stresses. Numerical results reveal that some critic Id magnitude, named Idc, can be found. The latter allows distinguishing two kinds of …", "num_citations": "1\n", "authors": ["1847"]}
{"title": "Development of a parallelised fluid solver for problems with mesh interfaces and deforming domains\n", "abstract": " Numerical simulation of piston–cylinder problems such as internal combustion engines suffers from two difficulties related to discretization: the non-matching interfaces between cylinder and ports and the large deformation of the cylinder region. In this context, this paper presents a parallelized computational strategy, based on the Finite Volume method, where the mentioned issues are overcome. The non-matching discretization between regions is addressed with a new methodology which integrates the Arbitrary Coupled Mesh Interface (ACMI) method with the pseudo-supermesh approach to couple conservatively mesh interfaces with partial overlapping. For the large cylinder deformations, a layer addition/removal strategy is enhanced with mesh deformation to improve the handling of the mesh resolution. All methodologies are integrated and implemented for parallel computing obtaining a good scalability and …", "num_citations": "1\n", "authors": ["1847"]}
{"title": "Optimización de tanques de separación de agua libre mediante CFD\n", "abstract": " Los tanques cortadores se utilizan en la producción de petróleo para separar el agua libre de crudo que se extrae de los pozos. En este trabajo se consideran tanques diseñados para los casos en que la proporción de agua presente en el crudo es mayor al 80% y procesan crudos livianos. Estos tanques de sedimentación utilizan para separar el petróleo del agua solamente las fuerzas gravitacionales y para su dimensionamiento es comúnmente basado en el tiempo de residencia. El diseño de tanques cortadores en la industria del petróleo históricamente se ha realizado utilizando métodos empíricos y experiencias del funcionamiento de tanques existentes. Sin embargo, estos métodos de diseño generalmente conducen a sobredimensionamientos que encarecen el costo de los tanques en gran medida. Debido a los altos costos de estas instalaciones ya que la situación mundial del precio del crudo exige que las empresas sean cada vez más eficientes en sus gastos, se ha realizado este estudio con el objetivo de reducir el tamaño de los equipos, así como la cantidad y dimensiones de sus internos, al mismo tiempo que se maximiza el caudal de petróleo y agua tratado. Para realizar la optimización, se utilizaron las herramientas de CFD de la suite OpenFOAM con un modelo de flujo multifásico de tipo mezcla. La formulación tiene en cuenta el comportamiento de las emulsiones que se presentan en estos tanques. En esta primera fase del trabajo se ajustó el modelo con condiciones reales de un tanque en operación encontrando un buen acuerdo entre los resultados numéricos y el comportamiento real del tanque. Adicionalmente, se …", "num_citations": "1\n", "authors": ["1847"]}
{"title": "OpenFOAM DNS for Constructing a Boundary Layer Database for the Pseudo-DNS MODEL\n", "abstract": " This paper presents advances in the development of pseudo-DNS, a new turbulence modelbased on precomputed inertial stresses and a concurrent multiscale approach. The model relies on solving a “coarse” subproblem by computing, on a relatively coarse grid, the flow of a pseudofluid, using a database of sub-grid inertial stresses precomputed in separate “fine” subproblem simulations. These inertial stresses are assumed to depend only on a dimensionless tensor, namely Id, related to the kinematic viscosity of the real fluid and the local velocity gradient and local coarse mesh size. Databases are assembled using DNS simulations of a set of fine problems in hexahedral domains with structured meshes, using “jump” boundary conditions to impose the desired velocity gradients. Each fine subproblem is simulated until a statistically steady state is achieved. The results are post-processed to obtain time-mean inertial stresses averaged in a subdomain, called Representative Volume Element or RVE. The RVE simulation results are stored in the database. A distinction is made between a “boundary layer RVE” (or “wall RVE”, characterized by having one of its faces in contact with a solid wall), and an “internal RVE” otherwise. Pseudo-DNS requires a database to be built for each one of these two types. For the wall RVE, fortunately, the tensorial Id may be reduced to a scalar one. The present work focuseson the construction of the wall RVE database, using DNS simulations of incompressible turbulent flow between parallel moving plates with null imposed pressure gradient. We present a mesh convergence analysis and the resulting wall RVE …", "num_citations": "1\n", "authors": ["1847"]}
{"title": "Resolución de flujos incompresibles turbulentos mediante técnicas de multiescala\n", "abstract": " Es bien conocida la importancia que tiene la turbulencia en problemas de la mecánica de fluidos, tanto en casos compresibles como incompresibles, a una o varias fases, con fines científicos o industriales. Inicialmente los modelos de turbulencia utilizaron filtros estadísticos tanto temporales, como espaciales o en experimentos sobre todas las escalas, olvidando los aún más primitivos modelos algebraicos que empleaban un grado de empirismo elevado. Estos modelos, denominados RANS (Reynolds average Navier-Stokes) permitieron abordar el modelado de problemas industriales en épocas donde los escasos recursos computacionales sólo soportaban discretizaciones muy gruesas y hasta incluso modelos bidimensionales y estacionarios, siendo que la turbulencia es un fenómeno caótico (no armónico), no estacionario y tridimensional. Habiéndose detectado la existencia de ciertas estructuras para la turbulencia y siendo que estas estructuras coherentes eran completamente anisotrópicas se pensó en sólo filtrar aquellas escalas que existían por debajo del tamaño que propone la grilla. Así nacieron los filtros del tipo LES (Large Eddy Simulation) donde las escalas de subgrilla eran nuevamente resueltas con un modelo universal isótropo que requiere de un refinamiento exagerado de la malla para hacer válida la hipótesis de isotropía que normalmente plantean los modelos de subgrilla, especialmente en las zonas cercanas a los cuerpos sólidos donde la turbulencia es controlada por la interacción del flujo con las paredes. Debido a esto últimamente se están empleando con mayor frecuencia los modelos híbridos que usan …", "num_citations": "1\n", "authors": ["1847"]}
{"title": "Applying the volume of fluid technique on atomization simulations\n", "abstract": " Atomization is a complex phenomenon, particularly difficult to simulate due to its physical characteristics, such as its long range of scales and discontinuous nature of the interphase. There are several alternatives to represent the interphase. The Volume of Fluid (VoF) is a widely adopted technique that employs a phase volume fraction function to distinguish between the fluids involved. An open-source implementation is available on the the OpenFoam FVM suite for incompressible immiscible flows, called interFoam. This application solves the color function advection equation using High Resolution Schemes limited with a Flux Corrected Transport in conjunction with a compression flux in order to reduce diffuses errors. The momentum equation is solved applying the PISO algorithm. In this work, the solver performance is studied comparing numerical results with experimental data and linear theory solutions …", "num_citations": "1\n", "authors": ["1847"]}
{"title": "Implementación del método PFEM sobre arquitecturas paralelas\n", "abstract": " El método de Partículas y Elementos Finitos (PFEM) es un método numérico de discretización espacial híbrida, utiliza partículas lagrangianas y malla Euleriana, para la solución de ecuaciones de transporte escritas en formulación de derivada material. Su evolución, denominada PFEM-2, incluye una novedosa estrategia de integración explícita siguiendo las líneas de corriente, X-IVAS, que le confiere la capacidad de utilizar grandes pasos de tiempo sin pérdida significante de precisión. Las estrategias paralelas para las etapas eulerianas han sido ampliamente estudiadas, sin embargo, para las etapas lagrangianas, deben ser desarrolladas atendiendo a la discretización híbrida y la estrategia de paralelización seleccionada. La implementación sobre memoria compartida es utilizada para determinar el enfoque PFEM-2 más apropiado para continuar con el desarrollo algorítmico. El principal problema en las simulaciones con este método es la gran cantidad de memoria necesaria, esto conlleva la necesidad de tener una implementación en memoria distribuida. A diferencia del enfoque de memoria compartida, en memoria distribuida al utilizar descomposición del dominio se logra aislar automáticamente la memoria de cada proceso. Sin embargo en esta última se debe lograr un particionamiento tanto de la malla como de las partículas que garantice la máxima eficiencia del método, minimizando la comunicación entre procesos y balanceando su carga de trabajo. Finalmente se presentan extensiones del método para la solución de flujos más complejos. Los resultados preservan la capacidad de utilizar grandes pasos de tiempo de …", "num_citations": "1\n", "authors": ["1847"]}