{"title": "Opportunities and risks of Blockchain Technologies–a research agenda\n", "abstract": " Blockchain technologies offer new open sourcebased opportunities for developing new types of digital platforms and services. While research on the topic is emerging, it has this far been predominantly focused to technical and legal issues. To broaden our understanding of blockchain technology based services and platforms, we build on earlier literature on payments and payment platforms and propose a research agenda divided into three focal areas of 1) organizational issues; 2) issues related to the competitive environment; and 3) technology design issues. We discuss several salient themes within each of these areas, and derive a set of research question for each theme, highlighting the need to address both risks and opportunities for users, as well as different types of stakeholder organizations. With this research agenda, we contribute to the discussion on future avenues for Information Systems research on blockchain technology based platforms and services.", "num_citations": "218\n", "authors": ["877"]}
{"title": "Open data services: Research agenda\n", "abstract": " Open data promises an increased availability of previously private, mostly , governmental datasets for service development. However, research on the topic is only starting to surface. In this article we propose a research agenda for open data service research. We review earlier relevant literature to extrapolate open data as a phenomenon from the perspective of the information systems field. Based on a classification of research challenges, we build a research agenda, and outline a set of research questions. We contribute to the discussion on future avenues for research on open data in IS.", "num_citations": "68\n", "authors": ["877"]}
{"title": "Industrial open data: Case studies of early open data entrepreneurs\n", "abstract": " Open data entrepreneurship is required to create novel services and sustainable value networks based on government released datasets. However, the business is still in its infancy. This paper investigates the emerging open data value network structure based on empirical findings from 14 Finnish organizations. The data was collected through interviews of early adopter open data entrepreneurs during the spring of 2012. We identified business models such as: saving costs with co-creation, creating new user interfaces by combining data from several sources, and analyzing and visualizing data. Understanding the business models, as well as the emerging OD value network, will help companies to better reap the benefits of open data, while contributing to academic discussion on how to establish an open data service ecosystem.", "num_citations": "50\n", "authors": ["877"]}
{"title": "Definition of open data services in software business\n", "abstract": " New software businesses are extending the software industry via private enterprises that build new and innovative services on top of Open Data (OD) sets released by government and public bodies. What are the tenable value propositions and income-generating mechanisms for these private enterprises and what are the new opportunities for service development? This paper combines conceptual and empirical investigations of OD definition to clarify the benefits open data sets hold for service development.", "num_citations": "49\n", "authors": ["877"]}
{"title": "Business roles in the emerging open-data ecosystem\n", "abstract": " Software specialists know the merits of information visualizations, mashups, and other types of open-data enrichments that serve customers' needs. Commercial services based on these enrichments hold great potential as new businesses. A proposed model categorizes the roles of businesses in enriching open data. This model could help entrepreneurs looking for business opportunities and professionals in companies with underused data resources.", "num_citations": "39\n", "authors": ["877"]}
{"title": "Matching open source software licenses with corresponding business models\n", "abstract": " Scores of software producers have turned towards Open Source licenses to improve service for their customers. For these companies, choosing the correct Open Source license determines business success. When the available Open Source stack and licensing options grow, so does the need to understand the interplay between licensing, sourcing decisions and business goals. We propose a model of license choice that emphasizes the different licenses and rationalizes the choice of OSS license. This is crucial for smaller companies and start-ups that do not have the tools and knowledge to perform a thorough investigation of all the consequences of their license choice every time they employ OSS.", "num_citations": "38\n", "authors": ["877"]}
{"title": "Applying open source development practices inside a company\n", "abstract": " Open Source Software development is seen as a panacea by many companies. The promise of community-style development, innovation and cost savings drive the wider adoption of OSS in companies. However, it is still difficult to institutionalize the open and agile culture of sharing innovation especially into larger departmentalized organizations. The aim of this research paper is to investigate the characteristics of one successful OSS development implementation approach limited inside a company (Inner source). Based on our data, we argue that there are possibilities for employing OSS as a new kind of development process within a company and leveraging thus the innovation potential inside the company.", "num_citations": "37\n", "authors": ["877"]}
{"title": "Journal copyright restrictions and actual open access availability: a study of articles published in eight top information systems journals (2010–2014)\n", "abstract": " Most scholarly journals have explicit copyright restrictions for authors outlining how published articles, or earlier manuscript versions of such articles, may be distributed on the open web. Empirical research on the development of open access (OA) is still scarce and methodologically fragmented, and research on the relationship between journal copyright restrictions and actual free online availability is non-existent. In this study the free availability of articles published in eight top journals within the field of Information Systems (IS) is analyzed by observing the availability of all articles published in the journals during 2010–2014 (1515 articles in total) through the use of Google and Google Scholar. The web locations and document versions of retrieved articles for up to three OA copies per published article were categorized manually. The web findings were contrasted to journal copyright information and …", "num_citations": "29\n", "authors": ["877"]}
{"title": "Similarities of open data and open source: Impacts on business\n", "abstract": " What are the similarities of open data and open source software when building a business? Despite their differences as phenomena (one is about applications and one is about data), the two also have many similarities. Both for example share the idea that the transparency of the artifact enables contribution. Many developers of open data have experience with open source development. But do the companies that build their offerings on open data and open source have similarities, and if so, what are the similarities? Drawing on fieldwork and interviews with software entrepreneurs and managers, this paper investigates these questions through an empirical focus on openness in business and clarifies the links between commercial organizations engaged with open source and open data. The article reports similarities on how the managers use the terms open data and open source to describe their business dynamic. These similarities are of importance to those who are interested in developing services that rely on open source or open data or who are interested in community management and legal and business issues or policy.", "num_citations": "28\n", "authors": ["877"]}
{"title": "Choosing an open source software license in commercial context: A managerial perspective\n", "abstract": " Increasing number of companies conduct their business employing various Open source software (OSS) licenses. The choice of correct license determines the business potential of a given software. When the available OSS stack and licensing options grow, so does the need for research concerning the interplay between OSS licensing, sourcing decisions and business goals. We aim to fill this research gap by building a model of license choice that emphasizes how software companies perceive the different licenses and rationalize their choice of OSS license. Results indicate how companies perceived the open source licenses as interconnected, complicated and turgid, and that only large companies had systematic processes for choosing licenses.", "num_citations": "28\n", "authors": ["877"]}
{"title": "Open data business models\n", "abstract": " Open data business models — Aalto University's research portal Skip to main navigation Skip to search Skip to main content Aalto University's research portal Logo Accessibility statement English Suomi Home Profiles Research output Datasets Projects Prizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name or affiliation Open data business models Yulia Tammisto, Juho Lindman Department of Information and Service Management Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Overview Original language English Title of host publication Information Systems Research Seminar in Scandinavia (IRIS), Turku, Finland, August 16-19, 2011 Editors Timo Leino Place of Publication Turku Publisher TURKU CENTRE FOR COMPUTER SCIENCE Pages 762-777 ISBN (Print) 978-952-12-2648-9 Publication status …", "num_citations": "23\n", "authors": ["877"]}
{"title": "Beyond the business model: Incentives for organizations to publish software source code\n", "abstract": " The software stack opened under Open Source Software (OSS) licenses is growing rapidly. Commercial actors have released considerable amounts of previously proprietary source code. These actions beg the question why companies choose a strategy based on giving away software assets? Research on outbound OSS approach has tried to answer this question with the concept of the “OSS business model”. When studying the reasons for code release, we have observed that the business model concept is too generic to capture the many incentives organizations have. Conversely, in this paper we investigate empirically what the companies’ incentives are by means of an exploratory case study of three organizations in different stages of their code release. Our results indicate that the companies aim to promote standardization, obtain development resources, gain cost savings, improve the quality of …", "num_citations": "14\n", "authors": ["877"]}
{"title": "Understanding open source in an industrial context\n", "abstract": " This paper discusses the meaning of open source in an industrial context. Building a grounded theory from an industry-driven R&D project, our analysis shows that open source in an industrial context is multifaceted. We find that the meaning of open source must be established in the context of the individual organization.", "num_citations": "13\n", "authors": ["877"]}
{"title": "Open source technology changes intra-organizational systems development-a tale of two companies\n", "abstract": " This paper explores how two organizations have changed their software development practices by implementing Open Source technology. Our aim is to understand the institutional changes needed in and emerging from this process. The paper develops a conceptualization building on the insights of entrepreneurial institutionalism and concentrating on the changing relationships of organizational groups in the areas of reward and communication. We identify the links between the 1) emerging yet embedded technology and 2) the underlying institutional reward and communication structures. In terms of contribution, we propose to move the Open Source 2.0 research agenda forward by concentrating empirical work on the", "num_citations": "12\n", "authors": ["877"]}
{"title": "Effects of open source software on the business patterns of software industry\n", "abstract": " Effects of open source software on the business patterns of software industry Effects of open source software on the business patterns of software industry | Login Aaltodoc → 1b Maisterivaiheen opinnäytetyöt / Master’s theses → [gradu] Kauppakorkeakoulu / BIZ → View Item Effects of open source software on the business patterns of software industry Title: Effects of open source software on the business patterns of software industry Author(s): Lindman, Juho Date: 2004 Language: en Department: Johtamisen laitos Major/Subject: Information systems Science Keywords: Ohjelmistot, Tietotekniikka, Liiketalous, Strategia, Johtaminen, Tietojärjestelmät » Show full item record Permanent link to this item: http://urn.fi/URN:NBN:fi:aalto-2020111715835 Email this Export to RefWorks QR Code Print BibTex Tweet Files in this item Files Size Format View There are no open access files associated with this item. This item appears …", "num_citations": "11\n", "authors": ["877"]}
{"title": "Open source technology in intra-organisational software development—private markets or local libraries\n", "abstract": " This chapter explores how two organisations have changed their software development practices by introducing Open Source technology. Our aim is to understand the institutional changes that are needed in, and emerge, from this process. This chapter develops a conceptualisation building on the insights of entrepreneurial institutionalism, concentrating on the changing relationships of organisational groups in the areas of decision-making, rewarding and communication. We identify the links between the (1) emerging, yet embedded technology and (2) the underlying institutional decision-making, reward and communication structures. We move the Open Source 2.0 research agenda forward by concentrating empirical work on the nuances of institutional change that open source brings about in large hierarchical organisations. We will discuss the appropriateness of internal accounting organised according …", "num_citations": "10\n", "authors": ["877"]}
{"title": "How open source has changed the software industry: Perspectives from open source entrepreneurs\n", "abstract": " The emergence of F/LOSS (free/libre open source software) has triggered several changes in the software industry. F/LOSS has been cited as an archetypal form of open innovation; it consists of the convergence and collaboration of like-minded parties. An increasing number of software firms have taken upon this approach to link outsiders into their service development and product design. Also, software firms have been increasingly grounded their business models on user-centric and service-oriented operations.This article describes a study that investigates these changes from the perspective of F/LOSS entrepreneurs. The findings are summarized into four issues that are critical in managing an F/LOSS business: i) dealing with organizational changes in the innovation process; ii) mastering user involvement; iii) successfully using resources; and iv) designing revenue models.", "num_citations": "10\n", "authors": ["877"]}
{"title": "Support mechanisms provided by FLOSS foundations and other entities\n", "abstract": " Foundations function as a vital institutional support infrastructure for many of the most successful open-source projects, but the different roles played by these support entities are understudied in Free/Libre and Open Source Software (FLOSS) research. Drawing on Open Hub (formerly known as Ohloh) data, this paper empirically investigates how these entities support projects and interact with other projects. This study was conducted using the Theoretical Saturation Grounded Theory approach given the large volume of data on hand. The findings are synthesized as a taxonomy of support entities, a categorization of support mechanisms and a set of dynamics of the interactions between different FLOSS support entities.", "num_citations": "9\n", "authors": ["877"]}
{"title": "Investigating Relationships Between FLOSS Foundations and FLOSS Projects\n", "abstract": " Foundations function as vital institutional support infrastructures for many of the most successful open source projects, but the role of these support entities remains an understudied phenomenon in FLOSS research. Drawing on Open Hub (formerly known as Ohloh) data, this paper empirically investigates the different ways these entities support projects and interact with different projects and with each other.", "num_citations": "9\n", "authors": ["877"]}
{"title": "Experiences Applying  Value Modeling in a Cross-Company Study\n", "abstract": " Driven by business interests, (product/customer) value has become a critical topic in system and software engineering as well as enterprise planning. The conceptual modeling community has responded to this challenge with several modeling approaches, including  value modeling, focusing on capturing and analyzing value flows in value networks. This modeling approach has risen from practical e-commerce experiences and has been further studied in an academic context. In this experience paper, we report the advantages and disadvantages of applying  value modeling as part of a cross-company case study focusing on understanding the internal and external value of APIs from a strategic perspective. We found that value modeling was generally well-received and understood by the company representatives, but also found drawbacks when used in our context, including challenges in modeling …", "num_citations": "8\n", "authors": ["877"]}
{"title": "Opportunities and risks of blockchain technologies (Dagstuhl Seminar 17132)\n", "abstract": " This report documents the program and the outcomes of Dagstuhl Seminar 17132\" Opportunities and Risks of Blockchain Technologies\". Blockchain-based applications such as Bitcoin or Ethereum are emerging technologies, but a dramatic increase in industrial and academic interest in the technology is evident. Start-ups and large financial players are working intensely on blockchain-based applications, making this one of the most promising drivers of financial innovation. However, the design and implementation of blockchain-based systems requires deep technical know-how in various areas, as well as consideration of economic and societal issues. These opportunities and challenges provided the starting point for the Dagstuhl Seminar where we analyzed and synthesized the current body of knowledge on the emerging landscape of blockchain technologies. We linked cryptographic economic systems to already established research streams around trust-related issues in payment systems and digital currencies, and digital asset management.", "num_citations": "8\n", "authors": ["877"]}
{"title": "Co-creation, commercialization and intellectual property-challenges with 3D printing\n", "abstract": " 3D printing (3DP) has high transformative potential as it is not only distinctive from other existing manufacturing techniques but also presents several previously unimaginable advantages. Its digital nature coupled with the availability of internet access offers the potential for radical decentralization of industrial production, as well as collaborative design of the artefacts produced. This important characteristic is advantageous not only to end users but also to commercial companies that are currently attempting to introduce this technique for manufacturing final products. One important advantage that companies could gain from this model is the possibility to engage in co-creation activities with the user community, and in this way benefiting from usersâ€™ contributions.", "num_citations": "8\n", "authors": ["877"]}
{"title": "Open Source and Open Data: Business perspectives from the frontline\n", "abstract": " Open data initiatives on governmental data seem often to be linked to small software companies, which also use and release software under OSS licenses. This paper calls for more research to understand the similarities between open data and open source software vendors. We build a theoretical linkage between the more established OSS research and emerging research on open data in the context of small software companies.", "num_citations": "8\n", "authors": ["877"]}
{"title": "Not accidental revolutionaries: essays on open source software production and organizational change\n", "abstract": " Open Source Software research has established that OSS technology (tools and practices) holds untapped potential. Based on a systematic literature review and a research engagement over a three-year period of data gathering, my dissertation describes how organizations leverage OSS practices to produce software. Leveraging OSS can be divided into two processes: 1) inbounding (moving public assets inside a company) and 2) outbounding(publishing) OSS. I outline the structural consequences these changes in software production entail and provoke. My research question is: What is the relation between local renegotiation of the term OSS and the organizational change provoked by OSS technology?  I chose a qualitative approach to examine the case companies, informed by OSS research and institutional theory. The bulk of the data emerges from the industrial ITEA-COSI project, which focused on software commodification. I aim to provide a narrative of how the term OSS travels from the writings of enthusiasts to the daily work practices of software producing organizations. The findings underline the importance of local renegotiation of the term OSS. This renegotiation provokes structural changes in 1) the organizations that adopt OSS technology, but more widely also in 2) the industries these companies operate in.  The main contribution of this research thesis, reported in four essays, is directed at two audiences: first, at academics, to promote the idea that OSS in organizations should be researched in a sensitivized manner. This requires moving away from too simplistic institutional contexts and ”the OSS business model”. Second, it is …", "num_citations": "8\n", "authors": ["877"]}
{"title": "Emerging perspectives of application programming interface strategy: A framework to respond to business concerns\n", "abstract": " Software specialists increasingly find themselves in situations where their application programming interface (API)-related decisions have implications on software business. We present a strategic API framework to aid in consideration of business concerns when designing, updating, or maintaining APIs.", "num_citations": "7\n", "authors": ["877"]}
{"title": "Emerging perspectives of API strategy\n", "abstract": " Software specialists find themselves increasingly in situations where their decisions related to implementing effective and efficient API strategies have strong implications on business decisions. Through a long-lasting research collaboration with software specialists responsible for APIs in large industrial software-intense products from several companies we have established an analytical framework, reported here. We combine earlier work on layering of digital technologies and governance to provide a multidisciplinary framework that is of interest for professionals working with API design and development.", "num_citations": "7\n", "authors": ["877"]}
{"title": "Systeemisen muutoksen haasteet ja innovaatiotoiminnan mahdollisuudet\n", "abstract": " Tekes on tutkimus-ja kehitystyön ja innovaatiotoiminnan rahoittaja ja asiantuntija. Tekesin toiminta auttaa yrityksiä, tutkimuslaitoksia, yliopistoja ja korkeakouluja luomaan uutta tietoa ja osaamista ja lisäämään verkostoitumista. Tekes jakaa rahoituksellaan teollisuuden ja palvelualojen tutkimus-ja kehitystyön riskejä. Toiminta uudistaa elinkeinoja, kasvattaa jalostusarvoa, tuottavuutta ja työelämän laatua, lisää vientiä sekä luo työllisyyttä ja hyvinvointia. Tekesillä on vuosittain käytettävissä avustuksina ja lainoina noin 600 miljoonaa euroa tutkimus-ja kehitysprojektien rahoitukseen.", "num_citations": "7\n", "authors": ["877"]}
{"title": "The uncertain promise of blockchain for government\n", "abstract": " Blockchain remains a hot topic for digital transformation and innovation. In the private sector, blockchain has demonstrated disruptive potential through proven use cases. However, despite strong interest and greater awareness, blockchain has had minimal impact on the public sector, where few projects have moved beyond small pilots. At the same time, there is a growing scepticism and cynicism about public sector blockchain. This paper seeks to understand why this is, by analysing the latest research in the area and identifying and analysing government experiences with successful and unsuccessful projects. It provides early findings on beliefs, characteristics, and practices related to government blockchain projects and the organisations that seek to implement them, with a focus on factors contributing to success or non-success. Although blockchain has yet to affect government in the ways that early hype …", "num_citations": "6\n", "authors": ["877"]}
{"title": "Mobile applications as carriers of institutional pressures: a case of the Finnish taxi industry\n", "abstract": " While the worldwide market expansion of Uber has raised controversy, Uber has also received praise for its mobile phone app. Its many features – taxi ordering, pricing, real-time location information, paying, and service evaluation – have provided significant customer value. When Uber entered Finland in November 2014, few other taxi apps were available. Between 2014 and 2018, this shortage of taxi apps turned into an abundance, with many companies introducing their own taxi apps. By leaning on institutional theory, and more specifically by applying coercive, mimetic and normative pressures as a lens, we provide an explanation for why three Finnish taxi apps now resemble Uber in some features, whereas they differ in others. Based on our interviews, we can explain the present-day differences between these apps by coercive and normative pressures in the institutional environment of the Finnish taxi …", "num_citations": "6\n", "authors": ["877"]}
{"title": "Bitcoin: A social movement under attack\n", "abstract": " Bitcoin is a social movement in the financial industry. It came into existence at a time when investors were looking for an alternative system for the traditional financial institutions. They wanted a system, which offers high transparency, low transaction fee, and high returns on their investment. Bitcoin is a decentralized system, which reveals all the transactions to the investors, providing a high degree of transparency. It operates without a centralized authority, so the transaction fee will be lower than the traditional financial institutions. The value of the Bitcoin can increase over a period and investors can expect high returns on their investment. As the market for the Bitcoin expanded, Bitcoin exchanges were formed, where investors can trade the fiat currencies for Bitcoins and vice versa. They became targets for the cyber criminals and lost bitcoins worth of millions of dollars in cyber-attacks, diminishing the value of Bitcoin. There is a lack of transparency in disclosing the details of the cyber-attacks to their customers by the exchanges. Bitcoin is failing to provide a solution for these issues and is operating like a traditional financial institution. In this paper, we will discuss how Bitcoin is a social movement using framing theory, examine various kinds of cyber-attacks that occurred on Bitcoin exchanges, their impact on Bitcoin, and make suggestions for the Bitcoin community to continue as a social movement in the financial industry.", "num_citations": "6\n", "authors": ["877"]}
{"title": "Measuring perceived trust in open source software communities\n", "abstract": " We investigate the different aspects of measuring trust in Open Source Software (OSS) communities. In the theoretical part we review seminal works related to trust in OSS development. This investigation provides background to our empirical part where we measure trust in a community (in terms of kudo). Our efforts provide further avenues to develop trust-based measurement tools. These are helpful for academics and practitioners interesting in quantifiable traits of OSS trust.", "num_citations": "6\n", "authors": ["877"]}
{"title": "From open access to open data markets: Increasing the subtractability of open data\n", "abstract": " Much of earlier emphasis on open data as a public good has been focused primarily upon accessibility and has ruled out the role of rivalry in the creation of horizontal and vertical complements. Rather than framing open data as a public good, this paper positions open data as a common pool resource, which is subject to subtraction by commercial interests. Contrary to the prior depiction that the subtract ability of common pool resources is deleterious, we argue that subtraction is essential to attracting private investment. Specifically, making open data more subtract able, will not only attract further private and public use but also induce eventual releases of private and commercial data to form a marketplace of data complements. We further argue that most of the current open data initiatives should direct their attention towards the creation of a platform market to harness the distributed resources for creating digitalised …", "num_citations": "6\n", "authors": ["877"]}
{"title": "Introduction to open data services minitrack\n", "abstract": " Following the successful Open Data Services Mini-track of HICSS-46 and workshop discussing Open Data service research agenda in HICSS-47, this is now the second HICSS Mini-track focusing on different aspects of open data services.", "num_citations": "5\n", "authors": ["877"]}
{"title": "Open access: A cause, but not the cause\n", "abstract": " This paper joins the debate on OA publishing by providing some critical notions on open access in information systems because it seems that IS scholars are not at the forefront of OA publishing. In what follows, I describe the OA situation in IS (2013) and then comment on the arguments put forward by Kingsley and Kennan (2015). Towards the end of the paper, I discuss how we can move forward.", "num_citations": "5\n", "authors": ["877"]}
{"title": "Blockchain-based electronic identification: cross-country comparison of six design choices\n", "abstract": " Electronic identification (eID) solutions constitute a critical element in digitalised society. As such, eID has been studied from a variety of perspectives, yet most, if not all existing solutions that have been studied rely on a centralised approach. With the introduction of decentralised technologies such as the blockchain, new avenues for designing eID solutions become feasible. In order to accelerate the creation of blockchain-based eID solutions and their study, this paper offers a comparison of two traditional eID initiatives in Finland and Sweden and one blockchain-based eID initiative in Taiwan. Based on this comparison, we derive insights in the form of design choices for a blockchain-based eID initiative. The findings show that the repertoire for design choices in eID solutions is expanded by the application of the blockchain. These findings are used as a foundation for discussing the design of blockchain-based eID solutions and the need for future research.", "num_citations": "4\n", "authors": ["877"]}
{"title": "Modeling support for strategic API planning and analysis\n", "abstract": " APIs provide value beyond technical functionality. They enable and manage access to strategic business assets and play a key role in enabling software ecosystems. Existing work has begun to consider the strategic business value of software APIs, but such work has limited analysis capabilities and has not made use of established, structured modeling techniques from software and requirements engineering. Such modeling languages have been used for strategic analysis of ecosystems and value exchange. We believe these techniques expand analysis possibilities for APIs, and we apply them as part of a cross-company case study focused on strategic API planning and analysis. Results show that goal, value, and workflow modeling provide new, API-specific benefits that include mapping the API ecosystem, facilitating incremental API planning, understanding dynamic API-specific roles, identifying …", "num_citations": "4\n", "authors": ["877"]}
{"title": "Shared assumption concerning technical determination in apache web server developer community\n", "abstract": " Our main finding is that OSS community seems to coordinate its activities by relying on technical determination. First, we review previous literature to understand OSS community coordination mechanisms. Then we empirically review OSS Apache Web Server community by using qualitative case study methods. Our data consist of developer list’s email-discussions. Finally, we speculate that coordination rests on community’s members’ shared assumption concerning technical determination.", "num_citations": "4\n", "authors": ["877"]}
{"title": "3.5 Open Source Software Research and Blockchain\n", "abstract": " This short paper investigates ways in which earlier open source software (OSS) research can help us explain blockchain-related phenomena. We review OSS literature and identify three such areas: 1) blockchain and OSS 2.0, 2) community development, and 3) forks.Introduction. Earlier work on cryptocurrencies has used the openness of the software source code to decrease the risks of a system being perceived as a security black box and thus increase development trust. Both early examples of blockchain technology–Bitcoin and Ethereum–were open source projects. However, it should be noted that OSS is also contested in this context: There is an ongoing discussion regarding the importance of the source code openness and the underlying technological infrastructure. In this paper, we do not try to solve this issue but instead provide some insights OSS research may offer as blockchain moves forward.", "num_citations": "4\n", "authors": ["877"]}
{"title": "Latent Groups in Online Communities: a Longitudinal Study in Wikipedia\n", "abstract": " Research on online communities has shown that content production involves manifest groups and latent users. This paper conceptualizes a related but distinct phenomenon of latent groups. We ground this contribution in a longitudinal study on the Finnish Wikipedia (2007–2014). In the case of experts working on content within their area of expertise, individuals can constitute a group that maintains itself over time. In such a setting, it becomes viable to view the group as an acting unit instead of as individual nodes in a network. Such groups are able to sustain their activities even over periods of inactivity. Our theoretical contribution is the conceptualization of latent groups, which includes two conditions: 1) a group is capable of reforming after inactivity (i.e., dormant), and 2) a group is difficult to observe to an outsider (i.e., non-manifest).", "num_citations": "3\n", "authors": ["877"]}
{"title": "Goals, workflow, and value: Case study experiences with three modeling frameworks\n", "abstract": " It is beneficial to understand the benefits and drawbacks of enterprise modeling approaches in certain contexts. We report experiences applying different combinations of three modeling approaches to industrial cases. Specifically, we report on experiences from four companies using a combination of goal modeling, e3 value modeling, and workflow modeling. Our findings help to guide enterprise modeling approach selection in similar contexts, and can be used to make recommendations to improve future applications of the selected modeling approaches.", "num_citations": "3\n", "authors": ["877"]}
{"title": "Sosiaalinen media ja kampanjointitapojen muutos: Pekka Haavisto ja presidentinvaalit 2012\n", "abstract": " The forms of Finnish polical campaigning underwent dramatic changes during the 2012 presidental election. Especially the campaign of Pekka Haavisto (green) succeeded in embracing different platforms of the new digital media and evoking a new kind of participation in users of said platforms. The role played by the social media and fundraising changed the organization, networks and the political content of the presidential campaign, which he subsequently lost. The campaign however raises a number of interesting questions addressed in this article. In addition, we speculate on the implications these changes will have for the future election campaigns.", "num_citations": "3\n", "authors": ["877"]}
{"title": "Strategic API Analysis and Planning: APIS Technical Report\n", "abstract": " Traditionally, software APIs (application programming interfaces) have been viewed from a technical perspective, as a means to separate implementation from functional calls, and as a way to define a contract of software functionality. The technical benefits of APIs have been reported in numerous studies. Several reports from industry offer useful practical design considerations for APIs, including advice on collecting usage data, monetization strategies, and at what point to open an API to external parties. Although this advice can be useful, the focus is still often on the API, only without considering the role the API plays in the wider organization or how it fits into an organizational strategy. Our industrial experiences show that more information is needed about the challenges and best practices of API design and management in an organizational context. Furthermore, it has become apparent that APIs are able to play a key role as part of a strategic business plan for software-intensive companies. In this report, we present the results of our work with companies to build a framework that synthesizes and summarizes API strategies from several perspectives, including: strategic API lifecycle, lifecycle stage characteristics, lifecycle use cases and transition points, API layered architecture, BAPO, value modeling, ecosystem mapping with goal models, API metrics, goal models with metrics, and API governance guidance. Our research was carried out with an industry-academic collaboration. The framework was developed iteratively through workshops and discussions with company partners. We show how conceptual frameworks can be used to drive API …", "num_citations": "2\n", "authors": ["877"]}
{"title": "Introduction to the minitrack on novel uses, opportunities and challenges of blockchain for digital services\n", "abstract": " The first Open Data Services Mini-track was organized in HICSS-46, followed by a workshop discussing Open Data service research agenda in HICSS-47, a minitrack focusing on different aspects of open data services in HICSS-48, on digital service innovations based on\" open\" phenomena and practices in HICSS-49 and on Open digital services and platforms in HICSS-50. In HICSS-51, we continued the discussion about different digital services and platforms. In HICSS-52 we now turn to a specific novel set of technologies: blockchain. New platforms and platform technologies, such as blockchain, offer new opportunities, especially for developing radically new transactional digital services. According to HBR,“blockchain could dramatically reduce the cost of transactions” 1 by replacing private trust services with an open mode. There are examples of use of blockchain for identity management, maintenance of shipping records in cross-border shipping, and even for tracking copies digital art to name a few. At the same time, the volatility of blockchain implementations of currencies (especially cryptocurrencies), most notably Bitcoin, has made the same settlement mechanisms complicated. For example, returns and cancellations can become problematic if the value of the underlying cryptocurrency changes dramatically between the original transaction and the cancellation. Until recently, blockchain service implementations and platforms have been the domain of computer science, and the main focus of research has been on technical aspects. Now, however, we are moving into an era of utilizing blockchain platforms that create novel opportunities as …", "num_citations": "2\n", "authors": ["877"]}
{"title": "FLOSS-induced changes in the software business: insights from the pioneers\n", "abstract": " Companies that build their offerings with Free/Libre Open Source Software (FLOSS) communities have evoked fundamental changes in the operating environment of software firms. However, prior literature has not paid sufficient attention to how the managers of software firms perceive these changes and the impact of FLOSS activity on their business. This study investigates the perceptions of the entrepreneurs and senior managers in Finnish software firms regarding these issues. Based on narratives obtained from discussions with the managers, we group the findings into four categories that provide insight into the ongoing changes in the software industry.", "num_citations": "2\n", "authors": ["877"]}
{"title": "Towards an internet of things society: Perspectives from government agencies in Sweden\n", "abstract": " Digitalization in general, and the Internet of Things (IoT) in particular, is dramatically transforming societies, affecting both industry and the public sector. Government agencies have a role to play in how successful distribution and implementation of IoT technologies are. We conducted an explorative, qualitative study based on 16 interviews with key respondents from government agencies in Sweden to discover the public sector agencies’ current maturity. We focused on society as a whole and drilled down into individual sectors: energy, food, transportation, health care, financial services, information and communication, and security. Governance challenges are identified related to the complex ecosystem interplay of public and private actors, including lack of common guidelines, sparsity of expertise, and each respective agency’s evolving roles in an increasingly connected society.", "num_citations": "1\n", "authors": ["877"]}
{"title": "Procedural Knowledge Requirements in the Design of Genome Data Services\n", "abstract": " Genome data holds tremendous value potential for humanity. Downstream services are needed to increase the use of currently dispersed data. There is a research gap related to how companies should design these: They struggle to balance (1) dynamic (exploration) knowledge requirements that are of interest to genome researchers and (2) stable (exploitation) knowledge requirements that are of interest to clinical users. In this paper, we investigate how one specific company takes into account the various audiences in the designing of their services by asking: How do procedural knowledge requirements impact the design of information systems that produce genome data services? We show how different types of knowledge requirements lead to different services and discuss how it could link to IS platform and infrastructure literature. In practice, understanding and explaining these mechanisms increases downstream data value for genome research and clinical use, increasing the advance of science and care for patients.", "num_citations": "1\n", "authors": ["877"]}
{"title": "Managing Organizatinal Resources as Platform Boundary Resources.\n", "abstract": " Approaching digital innovation via digital platforms shifts firms’ locus of attention to the different actors in their ecosystems. Firms tend to empower the platform’s ecosystem through expanding developer contribution via introducing boundary resources such as application programming interfaces (APIs). This study addresses the challenge of platform owners managing their internal assets as platform boundary resources. We seek to answer how platform owners can identify and visualize values of potential boundary resources by conducting a single case study at a large international company active in embeded software development area. This study suggests e3 value modelling as a tool to assist platform owners in understanding the platform ecosystem actors, the values of assets for the ecosystem and how these values can be interchanged among the actors.", "num_citations": "1\n", "authors": ["877"]}
{"title": "Introduction to Open Digital Services and Platforms Minitrack\n", "abstract": " The first Open Data Services Mini-track was organized in HICSS-46, followed by a workshop discussing Open Data service research agenda in HICSS-47, a minitrack focusing on different aspects of open data services in HICSS-48, and on digital service innovations based on\" open\" phenomena and practices in HICSS-49. In HICSS-50, we extend the discussion to the different digital services and platforms. Can the value provided by open digital services disrupt markets and advance digitalization? Open digital services and platforms are no longer a novelty, and their importance for individuals, organizations as well as societies is expected to grow fast. As the available service stack grows, we can see the proliferation of innovations in many areas (eg traffic, news, environmental monitoring etc.). Seeking novel research describing open services, service systems or service platforms, our focus this year is on new …", "num_citations": "1\n", "authors": ["877"]}
{"title": "Long-term Business from Open Data\n", "abstract": " Long-term Business from Open Data — Haris - Hankens forskningsportal Återgå till huvudnavigering Återgå till sök Gå direkt till huvudinnehållet Haris - Hankens forskningsportal Logo Hjälp & FAQ English Svenska Hemma Profiler Publikationer Projekt Aktiviteter Priser Tidningsurklipp Forskningsenheter Dataset Sök per experter, namn eller tillhörighet Long-term Business from Open Data Tomi Kinnari, Juho Lindman, Matti Rossi Informationsbehandling, Helsingfors Forskningsoutput: Kapitel i bok/rapport/konferenshandling › Konferensbidrag › Vetenskaplig › Peer review Översikt Originalspråk Engelska Titel på gästpublikation Proceedings 22nd Nordic Academy of Management Conference Utgivningsdatum 21.08.2013 ISBN (elektroniskt) 2298-3112 Status Publicerad - 21.08.2013 MoE-publikationstyp A4 Artikel i en konferenspublikation Evenemang NFF - Reykjavik, Island Varaktighet: 21.08.2013 → 23.08.2013 …", "num_citations": "1\n", "authors": ["877"]}
{"title": "OSS as a way to sell organizational transformation\n", "abstract": " Open Source Software (OSS) has gained industrial and organizational credibility both as a development style and as an organizational form based on voluntarism, distributed and global ideals practices. It has attracted hype both among software development professionals and the general public. In the first phase of OSS commercialisation companies were interested about ways to directly benefit from OSS generated revenue stream. Now in the second phase commercial actors are reviewing ways to leverage OSS products and practices in hierarchical organisations. The aim of this research paper is to explore two OSS inspired implementations in Europe-based multinational companies. Based on these experiences we conclude that implementations are thorough organizational changes, which can be beneficially viewed as introducing a market inside a company and followed by all the accompanying challenges …", "num_citations": "1\n", "authors": ["877"]}
{"title": "Case study of company’s relationship with open source community in open source software development\n", "abstract": " Open Source Software (OSS) development success in business context is determined by the relationship between the developer community and the benefiting company. The purpose of this case study is to examine this relationship. We review extant literature on the OSS development, characteristics of the OSS communities and OSS development, moving on to the business rationales of a companies engaging in OSS development. We construct a framework for analyzing a company-community relationship and test our framework with data from semi-structured interviews of corporate representatives who have worked closely with open source software development. As a result, we propose a framework for analyzing company-community relationship in the OSS development context.", "num_citations": "1\n", "authors": ["877"]}