{"title": "An event-driven manufacturing information system architecture for Industry 4.0\n", "abstract": " Future manufacturing systems need to be more flexible, to embrace tougher and constantly changing market demands. They need to make better use of plant data, ideally utilising all data from the entire plant. Low-level data should be refined to real-time information for decision-making, to facilitate competitiveness through informed and timely decisions. The Line Information System Architecture (LISA), is presented in this paper. It is an event-driven architecture featuring loose coupling, a prototype-oriented information model and formalised transformation services. LISA is designed to enable flexible factory integration and data utilisation. The focus of LISA is on integration of devices and services on all levels, simplifying hardware changes and integration of new smart services as well as supporting continuous improvements on information visualisation and control. The architecture has been evaluated on both real …", "num_citations": "312\n", "authors": ["1410"]}
{"title": "Translating Grafcet specifications into Mealy machines for conformance test purposes\n", "abstract": " Conformance test is a black-box test technique aiming at checking whether an implementation conforms to its specification. Numerous results have been already obtained in this field for specifications expressed in a formal language. However, these results cannot be applied for conformance test of industrial logic controllers whose specifications are given in standardized specification languages. To contribute to solve this issue, this paper proposes a method to obtain, from a Grafcet specification, an equivalent Mealy machine, without semantics loss. This method permits to describe explicitly and formally all the states and transitions that are implicitly represented in a Grafcet model.", "num_citations": "52\n", "authors": ["1410"]}
{"title": "Review of model-based testing approaches in production automation and adjacent domains-current challenges and research gaps\n", "abstract": " As systems have been and are becoming more and more complex, the task of quality assurance is increasingly challenging. Model-based testing is a research field addressing this challenge and many approaches have been suggested for different applications. The goal of this paper is to review these approaches regarding their suitability for the domain of production automation in order to identify current trends and research gaps. Adjacent domains where approaches are introduced in order to identify promising techniques which may be interesting for the field of production automation. The different approaches are classified and clustered according to their main focus which is either testing and test case generation of/from formal models, test case generation from semi-formal models, test case generation from fault models or test case selection and regression testing.", "num_citations": "46\n", "authors": ["1410"]}
{"title": "An event-driven manufacturing information system architecture\n", "abstract": " Future manufacturing systems need to be more flexible, to embrace tougher and constantly changing market demands. They also need to make better use of plant data, ideally utilizing all data from the entire plant. Low-level data should be refined to real-time information for decision making, to facilitate competitiveness through informed and timely decisions.The Line Information System Architecture, LISA, is designed to enable flexible factory integration and data utilization. In LISA, international standards and established off-the-shelf technologies have been combined with the main objective to be industrially applicable. LISA is an event-driven architecture with a prototype-oriented information model and formalized transformation services. It features loose coupling, flexibility, and ease of retrofitting legacy devices. The architecture has been evaluated on both real industrial data and industrial demonstrators and is …", "num_citations": "39\n", "authors": ["1410"]}
{"title": "A systematic survey on sensor failure detection and fault-tolerance in ambient assisted living\n", "abstract": " Ambient Assisted Living (AAL) systems aim to enable the elderly people to stay active and live independently into older age by monitoring their behaviour, provide the needed assistance and detect early signs of health status deterioration. Non-intrusive sensors are preferred by the elderly to be used for the monitoring purposes. However, false positive or negative triggers of those sensors could lead to a misleading interpretation of the status of the elderlies. This paper presents a systematic literature review of the sensor failure detection and fault tolerance in AAL equipped with non-intrusive, event-driven, binary sensors. The existing works are discussed, and the limitations and research gaps are highlighted. View Full-Text", "num_citations": "29\n", "authors": ["1410"]}
{"title": "Generation of single input change test sequences for conformance test of programmable logic controllers\n", "abstract": " Conformance test is a functional test technique which is aiming to check whether an implementation, seen as a black-box with inputs/outputs, conforms to its specification. Numerous theoretical worthwhile results have been obtained in the domain of conformance test of finite state machines. The optimization criterion, which is usually selected to build the test sequence, is the minimum-length criterion. Based on experimental results, this paper focuses on the generation of a single input change (SIC) test sequence from a specification model represented as a Mealy machine; such a sequence is aiming at preventing from erroneous test verdicts due to incorrect detection of synchronous input changes by the programmable logic controller (PLC) under test. A method based on symbolic calculus to obtain the part of the specification that can be tested with a SIC sequence is first presented. Then, an algorithm to build the …", "num_citations": "25\n", "authors": ["1410"]}
{"title": "A formal semantics for Grafcet specifications\n", "abstract": " This paper shows how the behavior of a model described in the specification language proposed by the IEC 60848 standard can be represented, without semantics loss, in a formal manner, by a finite state machine (FSM) with logic inputs and outputs. This contribution is illustrated on a nontrivial example; this case study points out that the duration of the construction of the equivalent FSM complies with the requirements of designers of automation systems.", "num_citations": "23\n", "authors": ["1410"]}
{"title": "From task allocation towards resource allocation when optimising assembly systems\n", "abstract": " The article discusses the question; is it possible to reach route flexibility and system proactivity through resource allocation and task optimisation. In order to answer this, differences between three types of optimisation regarding task and resource allocation are discussed: Global Task and Resource optimisation, Task optimisation and local resource allocation, but with resource alternatives, Task optimisation and local resource allocation (optimisation), with prioritised resources, shown as a possible solution in this paper in order to increase the route flexibility and proactivity in the system planning. An example of the last approach will be shown using a logic language (SOP) with help of software tool called Sequence Planner (SP).", "num_citations": "14\n", "authors": ["1410"]}
{"title": "Dynamic Software Updating of IEC 61499 Implementation Using Erlang Runtime System\n", "abstract": " Dynamic Software Updates (DSU) permit to decrease downtimes caused by updates or bug fixes and thus increase productivity, which is an ever present target during development of industrial production systems. This study implements a compiler to transform an IEC 61499 model into executable code for the Erlang Runtime System (ERTS) which natively features DSU, and investigates its feasibility. As a case study, a small production plant is implemented and updated on-the-fly with new features and safety fixes. This case study shows that DSU by using the ERTS is feasible. However, additional information for the update structure, content and schedule is required from an external source.", "num_citations": "12\n", "authors": ["1410"]}
{"title": "Testing programmable logic controllers from finite state machines specification\n", "abstract": " This paper shows, on the basis of experiments, that execution of conformance tests of programmable logic controllers with minimum-length test sequences built from specifications in FSMs may yield spurious results. A new approach to build test sequences is then proposed to remove, or at least strongly lessen, this issue.", "num_citations": "12\n", "authors": ["1410"]}
{"title": "Test sequence construction from SFC specification\n", "abstract": " This paper focuses on conformance test of electronic programmable devices whose specification is given in Sequential Function Chart (SFC). More precisely, a method is proposed to obtain automatically, from this specification, one minimum length test sequence which permits the exhaustive test of the behavior of the device. This method takes advantage of previous results on construction of the state machine representation of a SFC and on test of Mealy machines; conversely, it extends the industrial use possibilities of this latter technique. The contribution is exemplified on a simple model.", "num_citations": "11\n", "authors": ["1410"]}
{"title": "PLC implementation of symbolic, modular supervisory controllers\n", "abstract": " The Supervisory Control Theory was introduced in 1987 by Ramadge and Wonham (1987), and industrial applications are still scarce. This paper outlines an automatic code generation framework to construct the control logic for a programmable logic controller (PLC) from a symbolic, modular supervisor. The modeling and supervisor generation is performed with Supremica (Malik et al. (2017)), and the supervisor is implemented with the IEC 61131-3 programming language Structured Text. This framework is used to teach model-based approaches and SCT to mechanical engineering students.", "num_citations": "10\n", "authors": ["1410"]}
{"title": "IEC 61499 runtime environments: A state of the art comparison\n", "abstract": " Networked automation devices, as needed for Industry 4.0 or Cyber Physical Production Systems, demand for new programming languages like the one defined in the IEC 61499 standard. IEC 61499 was originally released in 2005. Since then, different runtime environments—academic and commercial—surfaced: They partly differ in their execution semantics and behavior, and in the features they offer, eg Multitasking, Real-time performance, or Dynamic Reconfiguration. Users who want to apply this standard to their problem have to choose the right tool. This paper compares a selection of IEC 61499 runtime environments and outlines topics for further research.", "num_citations": "8\n", "authors": ["1410"]}
{"title": "A model-based testing framework with reduced set of test cases for programmable controllers\n", "abstract": " In testing of programmable controllers, manual selection of test cases is still the most common method in practice. This is however tailor-made, time consuming and error-prone. Traditional model-based methods can hardly handle industrial scale systems which usually possess a significant number of states, and signals of sensors and actuators. In this paper, we propose a model-based testing framework that utilizes simplified plant features to reduce the number of test cases, and at the same time also guarantees a full coverage of nominal behavior of system under test. The proposed framework has been illustrated on a case study.", "num_citations": "8\n", "authors": ["1410"]}
{"title": "SIC-testability of sequential logic controllers\n", "abstract": " SIC (Single Input Change) test sequences must be privileged for conformance test of logic controllers, to prevent from erroneous test results when the test-bench and the implementation under test are not synchronized. This paper proposes first a definition of the SIC-testable part of a sequential specification model, i.e. the part of the model that can be tested by using a sequence starting from the initial state and for which only one input can change at one at the same time. Then, an algorithm to determine the SIC-testable part is given; if this part is the whole specification, the specification model is declared totally SIC-testable. Once the SIC-testable part obtained, a SIC sequence for conformance test of an implementation of this part can be generated. These contributions are exemplified on an example.", "num_citations": "8\n", "authors": ["1410"]}
{"title": "Development of a Methodology for Monitoring and Prediction of Road Surface Conditions in Highly Automated Driving\n", "abstract": " This paper addresses vertical dynamics comfort in Highly Automated Driving (HAD). Based on the assumption that a reduction of vertical acceleration inputs will result in increased passenger comfort, we develop an approach to minimize the effect of road surface anomalies on HAD users. We propose a participative method to identify, process and distribute road quality data using a plurality of vehicles exchanging information with a central server. By activating automated responses to warn about, avoid or counteract the appearance of any type of discomfort prompted by vertical vibrations, we strive to increase the maturity of HAD technology.", "num_citations": "6\n", "authors": ["1410"]}
{"title": "An educational toolbox on supervisory control theory using MATLAB Simulink stateflow: From Theory to practice in one week\n", "abstract": " Since the Supervisory Control Theory (SCT) was introduced by Ramadge and Wonham in 1987, many researchers contributed to its theoretical basis and to the development of algorithms. In academia, several self-contained tools are used to model systems and analyze their behavior. Despite that, there are still too few application tools of SCT in industry. Therefore, we developed the MATLAB Supervisory Controlar Implementation toolbox (MSCI) for applying supervisory control theory, in order to have a first step in bridging the gap. It is based on MATLAB Simulink and Stateflow since MATLAB is a widespread and accepted environment in the industry. Results from a student practical lab prove that it is possible to teach SCT in a short time by using this toolbox.", "num_citations": "6\n", "authors": ["1410"]}
{"title": "DTT-MAT: A software toolbox on a design-to-test approach for testing of embedded programmable controllers\n", "abstract": " This paper presents a continuation of previous results on a design-to-test (DTT) approach for black-box testing of embedded programmable controllers, where the specifications and implementations can be modeled as finite state machines [1]. The proposed approach checks the specification models and modifies them in order to improve the testability of their physical implementation with limited design and testing overhead. This approach also guarantees by design that the behavior of the implementation remains unchanged during its normal execution (i.e. when not connected to a test-bench). Based on proposed refinements of technical details and improvements of algorithms, a MATLAB toolbox `DTT-MAT' has been developed.", "num_citations": "6\n", "authors": ["1410"]}
{"title": "Design-to-test approach for black-box testing of programmable controllers\n", "abstract": " This paper focuses on a global consideration of design and testing phases of a safety-critical automation system with programmable controllers. A design-to-test approach is proposed to improve the testability of programmable controllers and reduce overhead during the testing phase, under the premise that the nominal behavior of a system is guaranteed to remain unchanged during normal execution. This approach is elaborated and illustrated on a medium scale case study throughout the paper, and then applied to a larger case study in order to illustrate its scalability.", "num_citations": "6\n", "authors": ["1410"]}
{"title": "Conformance test of logic controllers of critical systems from industrial specifications\n", "abstract": " This paper presents a synthesis of works performed in the frame of an industry/academia cooperative research. The overall objective of this research is to automate the construction of test sequences for conformance test of industrial logic controllers when the expected behavior is described in industrial specification languages. The first contribution is aimed at preventing from combinatorial explosion by preliminary verifications on the implementation so as to check whether it satisfies some structural properties. The second contribution is a method to translate an industrial specification into a formal model to take benefit from theoretical results on conformance test of formal models for discrete event systems description. These two contributions are exemplified on case studies from the domain of energy production.", "num_citations": "5\n", "authors": ["1410"]}
{"title": "Sensor Failure Detection in Ambient Assisted Living Using Association Rule Mining\n", "abstract": " Ambient Assisted Living (AAL) is becoming crucial to help governments face the consequences of the emerging ageing population. It aims to motivate independent living of older adults at their place of residence by monitoring their activities in an unobtrusive way. However, challenges are still faced to develop a practical AAL system. One of those challenges is detecting failures in non-intrusive sensors in the presence of the non-deterministic human behaviour. This paper proposes sensor failure detection and isolation system in the AAL environments equipped with event-driven, ambient binary sensors. Association Rule mining is used to extract fault-free correlations between sensors during the nominal behaviour of the resident. Pruning is then applied to obtain a non-redundant set of rules that captures the strongest correlations between sensors. The pruned rules are then monitored in real-time to update the health status of each sensor according to the satisfaction and/or unsatisfaction of rules. A sensor is flagged as faulty when its health status falls below a certain threshold. The results show that detection and isolation of sensors using the proposed method could be achieved using unlabelled datasets and without prior knowledge of the sensors’ topology. View Full-Text", "num_citations": "4\n", "authors": ["1410"]}
{"title": "FBBeam: an erlang-based IEC 61499 implementation\n", "abstract": " The IEC 61499 is a modeling language for distributed control systems. Despite numerous research results existing on this topic, industry acceptance is lacking. This paper aims to investigate the benefits of reusing an existing soft real-time runtime system for the implementation of the IEC 61499. For this purpose, FBBeam, a compiler that automatically converts IEC 61499 models to Erlang source code, was implemented. Possible execution semantics are presented and compared to the Erlang execution model. An initial case study examines the scalability of a multi-tasking runtime environment. The results indicate that Erlang is able to utilize multiple CPU cores efficiently and can distribute the load dynamically. FBBeam represents an opportunity to reutilize an existing runtime environment for research on dynamic updating, distribution, monitoring, maintenance, and fault-tolerance for Industry 4.0 or Cyber Physical …", "num_citations": "4\n", "authors": ["1410"]}
{"title": "Multi-view hand tracking using epipolar geometry-based consistent labeling for an industrial application\n", "abstract": " This paper addresses a visual tracking and analysis method for automatic monitoring of an industrial manual assembly process, where each worker sequentially picks up components from different boxes during an assembling process. Automatic surveillance of assembling process would enable to reduce assembling errors by giving early warning. We propose a hand tracking and trajectory analysis method from videos captured by several uncalibrated cameras with overlapping views. The proposed method consists of three modules through single-view hand tracking, consistent labeling across views, and optimal decision from multi-view temporal dynamics. The main novelties of the paper include: (a) target model learning with multiple instances through K-means clustering applied to accommodate different levels of light reflection; (b) optimal criterion for consistent labeling of tracked hands across views, based on …", "num_citations": "4\n", "authors": ["1410"]}
{"title": "Online support for shop-floor operators using body movements tracking\n", "abstract": " This paper presents results of experimentations on the integration of human operators and automation in the context of assembly systems. Several experiments have been conducted to evaluate the use of augmented reality applications in order to provide dynamic work instructions and online feedback information to a shop-floor operator. Based on these results, an experimental platform has been developed so that the shop-floor operator and the automated system behave as a closed-loop system.", "num_citations": "4\n", "authors": ["1410"]}
{"title": "Training convolutional neural networks with synthesized data for object recognition in industrial manufacturing\n", "abstract": " Visual tasks such as automated quality control or packaging require machines to be able to detect and identify objects automatically. In recent years object detection systems using deep learning have made significant advancements achieving better scores at a higher performance. However, these methods typically require large amounts of annotated images for training, which are costly and labor intensive to create. Therefore, it is an attractive alternative to generate the training data synthetically using computer-generated imagery (CGI). In this paper, we investigate how to add realistic texture to CAD objects to generate synthetic data for training of an instance segmentation network (Mask R-CNN) for recognition of manufacturing components. The results show that it is possible to create synthetic data with negligible human effort when using simple procedural materials.", "num_citations": "3\n", "authors": ["1410"]}
{"title": "Implementation and evaluation of IEC 61499 basic function blocks in Erlang\n", "abstract": " Despite several architectural advantages for the challenges of future manufacturing systems, the IEC 61499 standard is currently not widely accepted by industry. One advantage of the IEC 61499 is the concept of downtimeless system evolution. An extension of this, dynamic software updating, which allows switching out running processes and deal with unplanned changes, is readily available in the programming language Erlang. This paper investigates the real-time performance of an asynchronous, parallel IEC 61499 basic function block implementation in Erlang, a functional programming language with a soft real-time, concurrent runtime environment. As a result, although hard real-time performance is not guaranteed and the runtime environment is executed on top of a regular operating system, the performance is consistent and promising for future implementations and extensions.", "num_citations": "3\n", "authors": ["1410"]}
{"title": "Event-driven production rescheduling in job shop environments\n", "abstract": " Unpredictable incoming orders and the required nesting process highly complicate production planning and scheduling in sheet metal job shop environments and cause extremely high lead times as well as intermediate stocks. For this, numerous advanced planning and scheduling (APS) algorithms exist, aiming at creating a globally optimized production schedule. Due to the complexity of the multi-objective optimization and the large amount of unforeseen shop-floor events, effective and applicable solutions have not been presented so far. This work introduces an event-driven rescheduling concept based on lean principles leading to a high responsiveness of the production process to any kind of deviation. The achieved, significantly smaller buffer occupancies enable shorter lead times and improved delivery time estimations. Excellent performance results of the rescheduling concept are shown in different …", "num_citations": "3\n", "authors": ["1410"]}
{"title": "Using plant model features to generate reduced test cases for programmable controllers\n", "abstract": " Complete conformance testing is a model-based test technique for programmable controllers. It checks whether an implementation conforms to its specifications with regard to all possible combinations of input signals, which is useful for small scale and safety critical systems. However, the state space explosion issue limits its application to large scale systems. This paper presents a method for reducing state space in generation of test cases by utilizing not only specification models but also features extracted from plant models. The application on a benchmark case study shows that the number of test cases is reduced significantly.", "num_citations": "3\n", "authors": ["1410"]}
{"title": "Design-to-test: an approach to enhance testability of programmable controllers for critical systems-two case studies\n", "abstract": " Design-to-test: an approach to enhance testability of programmable controllers for critical systems-two case studies", "num_citations": "3\n", "authors": ["1410"]}
{"title": "Technical report on Conformance Test of Programmable Logic Controllers-Execution of Minimum-Length Test Sequences\n", "abstract": " Conformance test is a functional test technique which is aiming to check whether an implementation, seen as a black-box with inputs/outputs, conforms to its specification. Numerous theoretical worthwhile results have been obtained in the domain of conformance test of finite state machines. The optimization criterion which is usually selected to build the test sequence is the minimum-length criterion. On the basis of several experiments, this technical report shows that this kind of test sequence may lead to erroneous test verdicts when the implementation is a Programmable Logic Controller (PLC) that executes a control program. The error rates that have been obtained for different configurations of the PLC under test are given as well as guidelines for conformance test of PLCs from finite state machines.", "num_citations": "3\n", "authors": ["1410"]}
{"title": "Human operator and robot resource modeling for planning purposes in assembly systems\n", "abstract": " To achieve high productivity and flexibility, assembly systems commonly need to use different Levels of Automation, ie both robots or machines and human operators are considered as resources. Tasks allocation between these resources is often planned in the design phase of the system due to machine investments, etc. However, if task allocation is done in early design phases, occurrence of unpredicted events leads to an inflexible system that cannot be dynamic and proactive during execution. For instance, if a robot breaks down, this robot cannot continue to assemble products and it must be repaired; this will have two consequences. The first consequence is that the tasks, or operations, allocated to the robot must be reallocated. The second consequence is that a repair task must be performed on this robot by another resource.For consistency reasons, in the remainder of this paper, the term operation will refer to what the resources of the assembly system can perform or execute, and the term task will refer to high-level phases, eg design tasks. For complex systems, the dynamic allocation of operations cannot be performed manually. Thus, in order to perform optimization on this allocation of operations, both operations and resources need to be precisely modeled. This paper is aiming to define these operation and resource models. The proposed method for modeling resources will be illustrated in the paper through a simple example. The sequence of operations and the allocation of operations for this example are generated using the Sequence Planner software [3].", "num_citations": "3\n", "authors": ["1410"]}
{"title": "Introducing plant features to model-based testing of programmable controllers in automation systems\n", "abstract": " This paper proposes a model-based test generation approach for programmable controllers that aims at reducing the length of a test sequence by applying plant features. The proposed approach does not require detailed or full knowledge of the plant behavior of a system under test, but it can achieve a remarkable reduction with simple plant features. As a result, the obtained test sequence can be significantly shorter than ones generated by complete testing methods; and meanwhile, it still reaches full coverage of the nominal behavior of the system under test. This makes it feasible to test large-scale systems, or to serve as an early test in the validation of safety critical systems. The proposed approach has been illustrated on a large-scale case study.", "num_citations": "2\n", "authors": ["1410"]}
{"title": "Framework for flexible, adaptive support of test management by means of software agents\n", "abstract": " In the context of system testing on hardware-in-theloop test benches, performing functional tests on electrical control units comes with various challenges. Especially planning the execution of test cases for a test cycle and nightly batch runs is cumbersome. In order to support the test managers, this letter proposes an adaptable and flexible test management assistance system. Therefore, a set of requirements for such an assistance system has been identified and proposed solutions from the literature have been recalled. Out of those, software agents appear to be a suitable method for building up the framework of the assistance system. The framework proposed in this letter is divided into two phases: static prioritization of test scripts and dynamic execution ordering. The agents of the former phase aggregate relevant available data from various sources to calculate a test script priority. In the latter, the agents negotiate …", "num_citations": "2\n", "authors": ["1410"]}
{"title": "A Signal-Interpreted Approach to the Supervisory Control Theory Problem\n", "abstract": " After highlighting the difficulties encountered when implementing a supervisor on a real controller and the limitations of existing solutions to handle them, this paper presents a signal-interpreted approach to the Supervisory Control Theory problem. Due to the differences between event- and signal-based approaches, new algorithms are introduced to apply a Supervisory Control Theory (SCT) approach on the basis of signal-interpreted Boolean Finite Automata extended with variables (EBFAs). The advantages of the proposed signal-interpreted approach are illustrated both on simple structures throughout the paper and on a case study at the end.", "num_citations": "2\n", "authors": ["1410"]}
{"title": "Planning in assembly systems—A common modeling for products and resources\n", "abstract": " This paper presents a method for modeling robot and human resources in the context of assembly systems planning. In assembly systems, several redundant resources can be used to increase system flexibility. However, the “quality” of a sequence planning strongly depends on the “quality” of the system modeling. Furthermore, occurrence of unexpected events or variations in availability of resources may have significant impact on the actual planning. Instead of using simplistic models such as available or unavailable resources, the method presented in this paper proposes a more detailed modeling of resource abilities. Products and resources are considered on the same levels and matched together on a final step. The aim of this modeling is to permit analyses and to increase system flexibility.", "num_citations": "2\n", "authors": ["1410"]}
{"title": "Comparative study of flexible and decentralized agent-based and service-oriented control architectures for production systems\n", "abstract": " The purpose of this paper is the presentation and comparison of control architectures for the modular factory. In the last few years, service-oriented architectures and agent systems evolved to the most suitable technologies for flexible and versatile production systems which cope with challenges resulting from shortened product life cycles and product customization. However, decentralization as a rising concept to reduce complexity in production systems is often ignored. Therefore, this paper introduces service-oriented and agent-based control architectures which are based on the Production Priority Plan guaranteeing more flexibility and enabling decentralized decision-making in order to react to unexpected events. The architectures are compared in test scenarios derived from future production system challenges. The study demonstrates the great potential of the flexible, versatile and decentralized architectural …", "num_citations": "1\n", "authors": ["1410"]}
{"title": "Extension of the Plant Feature Approach Introducing Temporal Relations\n", "abstract": " Testing of controllers with a large number of inputs and outputs suffers from the curse of dimensionality in terms of the combinatorial explosion of possible input combinations. In particular for conformance testing, this results in unbearable large numbers of test cases. To mitigate this problem, the plant feature approach has been proposed, which guarantees full coverage of the nominal behavior of the controller. This nominal behavior corresponds to the reachable state space when combining in a closed-loop the controller with its fault-free plant. Plant features are identified as intuitive basic knowledge about a system based on its physical behavior. Considering such physical limitations allows to reduce the scope of testing to the actual relevant behavior.", "num_citations": "1\n", "authors": ["1410"]}
{"title": "Dynamic Software Update of Stateflow Charts using Erlang Runtime System\n", "abstract": " Reprogramming the controller of an industrial automation system usually requires to halt the system. In this paper, a novel method that allows reprogramming a controller at runtime is presented. The control behavior is modeled using parallel finite state machines, Stateflow being used as an example of modeling tool. Automatic translation to Erlang code is implemented and Dynamic Software Update is enabled using Erlang Runtime System. The presented method is applied and evaluated on a case study as a proof of concept.", "num_citations": "1\n", "authors": ["1410"]}
{"title": "Implementation of a cloud-based service-oriented architecture for hardware control systems supported by neural network\n", "abstract": " Embedded systems control and regulate applications in everyday life, thus changing the conventional way of work to a human-robot symbiosis. This paper describes a new approach of controlling mobile robots through a cloud-based service-oriented architecture supported by neural networks. The proposed architecture permits to operate with large and complex networks even on mobile robotic systems as illustrated on a case-study. Therefore the proposed architecture is based on dividing the management for the high-level on a computer or server and for the low-level directly on the mobile robot. Aiming at copying the cognitive capabilities of human beings, the system is reducing the amount of required sensors significantly. Successfully applied experimentally, the proposed architecture could also be replicated in various other industrial situations.", "num_citations": "1\n", "authors": ["1410"]}