{"title": "On non-functional requirements in software engineering\n", "abstract": " Essentially a software system’s utility is determined by both its functionality and its non-functional characteristics, such as usability, flexibility, performance, interoperability and security. Nonetheless, there has been a lop-sided emphasis in the functionality of the software, even though the functionality is not useful or usable without the necessary non-functional characteristics. In this chapter, we review the state of the art on the treatment of non-functional requirements (hereafter, NFRs), while providing some prospects for future directions.", "num_citations": "916\n", "authors": ["1459"]}
{"title": "Non-functional requirements: from elicitation to conceptual models\n", "abstract": " Nonfunctional requirements (NFRs) have been frequently neglected or forgotten in software design. They have been presented as a second or even third class type of requirement, frequently hidden inside notes. We tackle this problem by treating NFRs as first class requirements. We present a process to elicit NFRs, analyze their interdependencies, and trace them to functional conceptual models. We focus our attention on conceptual models expressed using UML (Unified Modeling Language). Extensions to UML are proposed to allow NFRs to be expressed. We show how to integrate NFRs into the class, sequence, and collaboration diagrams. We also show how use cases and scenarios can be adapted to deal with NFRs. This work was used in three case studies and their results suggest that by using our proposal we can improve the quality of the resulting conceptual models.", "num_citations": "356\n", "authors": ["1459"]}
{"title": "Requirements validation through viewpoint resolution.\n", "abstract": " Requirements modeling depends on having available the knowledge of what should be modeled. Acquiring, or eliciting, this knowledge is recognized to be a hard problem, and different suggestions have been made to address it. In this paper we examine one such approach—viewpoint resolution. It is based on the tact that software requirements can and should be elicited from different viewpoints, and that examination of the differences resulting from them can be used as a way of assisting in the early validation of requirements. Our research proposes a language for expressing views from different viewpoints and a set of analogy heuristics to perform a syntacticly oriented analysis of views. This analysis of views is capable of differentiating between missing information and conflicting information, thus providing support for viewpoint resolution. We also present empirical evidence of the effectiveness of these …", "num_citations": "351\n", "authors": ["1459"]}
{"title": "A strategy for conceptual model acquisition\n", "abstract": " A strategy for conceptual model acquisition is proposed. Knowledge acquisition is performed with a simple structure, i.e., the lexicon. Using the lexicon and an AI-based approach, a conceptual model is derived. The approach assists in the construction of a first cut version of the conceptual model, which should undergo a validation process. A prototype is built using an object-oriented AI shell. The system is tested with a library example (a 50 entries lexicon).< >", "num_citations": "215\n", "authors": ["1459"]}
{"title": "A framework for integrating non-functional requirements into conceptual models\n", "abstract": " The development of complex information systems calls for conceptual models that describe aspects beyond entities and activities. In particular, recent research has pointed out that conceptual models need to model goals, in order to capture the intentions which underlie complex situations within an organisational context. This paper focuses on one class of goals, namely non-functional requirements (NFR), which need to be captured and analysed from the very early phases of the software development process. The paper presents a framework for integrating NFRs into the ER and OO models. This framework has been validated by two case studies, one of which is very large. The results of the case studies suggest that goal modelling during early phases can lead to a more productive and complete modelling activity.", "num_citations": "182\n", "authors": ["1459"]}
{"title": "Ontology as a requirements engineering product\n", "abstract": " The \"semantic Web\" community poses a new nonfunctional requirement for Web applications. In order to secure interoperability and allow autonomous agent interaction, software for the Web will be required to provide machine processable ontologies. We understand that the responsibility, not only for making explicit this requirement, but also to implement the ontology, belongs to requirements engineers. As such, we see the ontology of a Web application as a sub-product of the requirements engineering activity. In this tutorial we survey the basic principles behind ontologies as they are being implemented and used by the semantic Web community today. Those include ontology languages, tools and construction methods. We focus on a process for ontology construction centered on the concept of application languages. This concept is rooted on a representation scheme called the language extended lexicon (LEL …", "num_citations": "171\n", "authors": ["1459"]}
{"title": "Software transparency\n", "abstract": " Software transparency is a new and important concern that software developers must deal with. As society moves towards increased automation, if citizens wish to exercise their right to know, the transparency of public services and processes acquires fundamental importance. Informed discourse is only possible if processes affecting the public are open to evaluation. Achieving software transparency to this level of openness faces several roadblocks. The paper reports on initial findings on exploring the obstacles for enabling software transparency.", "num_citations": "151\n", "authors": ["1459"]}
{"title": "The world sa stage: a survey on requirements engineering using a real-life case study\n", "abstract": " In this article we present a survey on the area of Requirements Engineering anchored on the analysis of a real life case study, the London Ambulance Service [56]. We aim at bringing to context new methods, techniques and tools that should be of help to both reaserchers and practitioners. The case study in question is of special interest in that it is available to the public and deals with a very large system, of which the software system is only a part of. The survey is divided into four topics of interest: viewpoints, social aspects, evolution and non-functional requirements. This division resulted from the work method adopted by the authors. Our main goal is to bridge recent findings in Requirements Engineering research to a real world problem. In this light, we believe this article to be an important educational device.", "num_citations": "104\n", "authors": ["1459"]}
{"title": "Using UML to Reflect Non-functional Requirements\n", "abstract": " The way requirements should drive the rest of the software development process has been a subject of many research projects in the past. Unfortunately, all of them focus primarily, when not exclusively, on the functional requirements regardless of the fact that non-functional requirements (NFR) are among the most expensive and difficult to deal with [6][13][4][10]. This work evolves out of a previous one [11] and aims at filling this gap, proposing a systematic approach to assure that conceptual models will reflect the NFRs elicited. We focus our attention on conceptual models expressed using the UML [25], and therefore, some heuristics are proposed to make UML suitable to handle NFRs.", "num_citations": "98\n", "authors": ["1459"]}
{"title": "A client oriented requirements baseline\n", "abstract": " Traceability, a major issue in software engineering, is seldom present at the initial requirements engineering process. The paper reports a proposal for organizing requirements statements as a model, where change and evolution are taken into consideration. The model uses natural language statements as its basic representation, which helps the communication between clients and software engineers. The model is supported by a customized software system for which a prototype was built and used in an industrial setting.", "num_citations": "92\n", "authors": ["1459"]}
{"title": "Avaliação da usabilidade em sistemas de informação: o caso do sistema submarino\n", "abstract": " A informação de qualidade é essencial para qualquer organização e, assim, as organizações necessitam de sistemas de informação fáceis de serem usados. Essa necessidade de informação qualificada e de boa usabilidade torna a interface com o usuário parte fundamental dos sistemas de informação. Por ser a parte visível do software, por meio da qual os usuários se comunicam com os sistemas para executarem suas tarefas, é preciso que ela seja amigável, ou seja, de fácil utilização e que atenda as expectativas e necessidades de seus usuários. Para obter tais interfaces, deve ser dada atenção especial aos requisitos relacionados às entradas de dados e à exibição de informação. Apesar da obviedade das afirmações, não é freqüente na definição de sistemas de informação uma preocupação com sua usabilidade. O nosso objetivo é demonstrar por meio de uma análise de um site de comércio eletrônico, uma série de requisitos não funcionais que deveriam estar sempre presentes no projeto de interfaces de software que dão apoio a sistemas de informação.", "num_citations": "87\n", "authors": ["1459"]}
{"title": "An NFR pattern approach to dealing with NFRs\n", "abstract": " Non-functional requirements (NFRs), such as security and cost, are generally subjective and oftentimes synergistic or conflicting with each other. Properly dealing with such NFRs requires a large body of knowledge-goals to be achieved, problems or obstacles to be avoided, alternative solutions to mitigate the problems, and the best compromising alternative solution to be selected. However, few patterns exist for dealing with these kinds of knowledge of NFRs. In this paper, we present four kinds of NFR patterns for capturing and reusing knowledge of NFRs-objective pattern, problem pattern, alternatives pattern and selection pattern. NFR patterns may be visually represented, and organized by rules of specialization to create more specific patterns, of composition to build larger patterns, and of instantiation to create new patterns using existing patterns as templates. We have applied the NFR pattern approach to the …", "num_citations": "83\n", "authors": ["1459"]}
{"title": "Draco-PUC: a technology assembly for domain oriented software development\n", "abstract": " Draco-PUC is a partial implementation of the Draco Paradigm for software development. The Draco paradigm states that it is possible to develop software based on the reuse of high level abstractions which are described as special purpose languages. These languages are called Domain languages. Draco-PUC is a meta program generator that makes it possible the construction and usage of domain languages. In this paper, we review the basic aspects of the Draco paradigm and point out our experience in building and using Draco-PUC. We stress the problems faced with the supporting technologies and provide some reusability data for the User Interface Domain.< >", "num_citations": "77\n", "authors": ["1459"]}
{"title": "Integrating non-functional requirements into data modeling\n", "abstract": " Complex information systems need conceptual models to deal with aspects beyond the usual entity and activity framework. Recent research has pointed out that conceptual models need to deal with goals, in order to model complex situations that happen in the real world. Our work investigated a new strategy that allows the integration of non-functional requirements (NFR) into data models. Integration is done by representing the NFRs in a data model and investigating how NFR's satisfaction affects the data model. We adopted the widely used ER conceptual model as the data modeling representation schema. In order to start the validation of our strategy we applied it to a real system. The results so far confirm our hypothesis that NFR's integration into data models do help in achieving better understanding of what is being modeled.", "num_citations": "75\n", "authors": ["1459"]}
{"title": "Reflections on the modularity of business process models: the case for introducing the aspect‐oriented paradigm\n", "abstract": " Purpose – The aspect‐oriented (AO) paradigm is first proposed to deal with programing modularity issues, but different researchers have been exploring AO concepts in the designing and definition of software systems. The goal of this paper is to discuss and present a proposal that addresses the application of AO concepts to the design of business processes (BPs) in order to improve usability and understandability of process models.Design/methodology/approach – The paper departs from previous work on analyzing the application of AO for software design. The observations were backed by a case study, which was used to illustrate the issues by means of examples.Findings – The paper presents findings on important issues related to the integration of AO paradigm and BP modeling, such as crosscutting representation, crosscutting composition, quantification, and join point exposure.Originality/value – The …", "num_citations": "60\n", "authors": ["1459"]}
{"title": "Viewpoint analysis: a case study\n", "abstract": " Requirements modeling demands that the knowledge of what should be modeled be available. Ac-quiring this knowledge or eliciting the necessary requirements ia recognized to be a very hard problem. Different enggestione have been made to alleviate this problem. We examine the application of one such approach, viewpoint resolution, towards the IWSSD library problem. This approach ie baeed on the idea of very early validation. The case study presented help8 justify the claim that early validation is a desirable characteristic of the software conetruction process. Four different view8 of the library problem are analyzed by an automated sndyzer, which is capable of identifying problem8 of correct-ness and completeness in a psir of views. The re-sults obtained, besides showing the benefits of early validstion, show how viewpoint resolution can help very early validation.", "num_citations": "53\n", "authors": ["1459"]}
{"title": "Non-functional requirements: from elicitation to modelling languages\n", "abstract": " Although Non-Functional Requirements (NFRs) have been present in many software development methods, they have been presented as a second or even third class type of requirement, frequently hidden inside notes and therefore, frequently neglected or forgotten. Surprisingly, despite the fact that non-functional requirements are among the most expensive and difficult to deal with there are still few works that focus on NFRs as first class requirements. Although these works have brought a contribution on how to represent and deal with NFRs, two aspects remain not sufficiently explored: how to elicit NFRs and how to merge these NFRs with conceptual models. Our work aims at filling this gap, proposing a strategy to elicit NFRs and to integrate them into conceptual models We focus our attention on conceptual models expressed using UML, and therefore, we propose extensions to UML such that NFRs can be …", "num_citations": "52\n", "authors": ["1459"]}
{"title": "Mapping quality requirements for pervasive mobile games\n", "abstract": " Games have not received the full attention of the requirements engineering community. This scenario is becoming more critical as we move towards newer forms of games, such as pervasive games. Pervasiveness (the quality that distinguishes pervasive games from traditional digital games) holds several meanings, including being ubiquitous, permeating something, or spreading something, somewhere, in a physical space. Pervasiveness can be recognized in by the boundaries of the game expanding every time it is played, from the virtual (or fictional) world to the real world. Pervasive games are a new form of digital entertainment that has evolved in different forms, such as alternate reality games, transmedia games, and crossmedia games. Sensor technologies, networking capabilities, augmented reality systems, computer vision technology, the internet, and, especially, mobile devices have been …", "num_citations": "47\n", "authors": ["1459"]}
{"title": "Capturing transparency-related requirements patterns through argumentation\n", "abstract": " Transparency is a critical concern to democratic societies. As software permeates our social lives, Software Transparency is becoming a quality criterion that demands more attention from software developers. We present in this paper our approach to capture transparency-related requirements patterns through argumentation. We represented initial transparency knowledge as requirements patterns. These initial patterns stimulated stakeholders' arguments on an open discussion about transparency of a given software. We apply an argumentation framework to capture the stakeholders' arguments on argumentation graphs. Transparency-related requirements patterns are identified by formally analyzing consensus on the argumentation graph. Basically, the identified patterns are possible operationalizations to transparency-related softgoals.", "num_citations": "44\n", "authors": ["1459"]}
{"title": "An aspect-oriented approach to business process modeling\n", "abstract": " Traditional methods to business process modeling build the model in a unified way, which gives rise to complex models, where different concerns are scattered and tangled. In this paper we propose the use of an aspect-oriented approach to modularize business process modeling. We propose a meta Aspect Oriented Process Modeling Language (AOPML) that is independent of any specific business process language. In order to show the applicability of the approach we instantiate it using the Business Process Model Notation (BPMN) in a case study that takes advantage of AOPML.", "num_citations": "42\n", "authors": ["1459"]}
{"title": "A framework for scenario evolution\n", "abstract": " We report on a framework for scenario evolution. We have studied, based on a laboratory case study, the evolution of scenarios from elicitation to coding, thus using the requirements baseline in a full cycle. Considering our observations of over a hundred and fifty scenarios we discovered a series of relationships and operations that occurred during the evolution. Our framework is a contribution to better understand scenario evolution and to help the tractability and identification of those actions belonging to the environment and those shared with the software.", "num_citations": "41\n", "authors": ["1459"]}
{"title": "C&L: Generating model based test cases from natural language requirements descriptions\n", "abstract": " Software testing tasks are usually time-consuming, especially if one considers complex projects. Requirements engineering artifacts are a valuable starting point for the development of software products, and most of software requirements specifications are written in natural language. This paper presents a tool that implements an approach for generating test cases based on Natural Language (NL) requirements specifications. The C&L tool translates automatically NL requirements descriptions into behavioral models to support automated testing. Our approach is easy to use and aims to decrease the time and the effort with respect to test case generation. Demonstration of the feasibility of the proposed approach is based on an example of use that describes the operation of the C&L tool.", "num_citations": "38\n", "authors": ["1459"]}
{"title": "Domain independent regularities in scenarios\n", "abstract": " Scenario is a description technique which has attracted much attention not only from practitioners but also from researchers. Literature on this topic shows the possibilities that this description technique provides to enhance the understanding of task-related descriptions and the communication among stakeholders. On the other hand, the idea of pattern, as a description of a problem which occurs over and over again in our environment and its solution, has also attracted lots of attention, especially in software design. The paper describes an initial taxonomy of domain-independent-scenario patterns and proposes a preliminary process to use this taxonomy for scenario construction.", "num_citations": "38\n", "authors": ["1459"]}
{"title": "Viewpoints on viewpoints\n", "abstract": " This paper expresses the viewpoints, or opinions of the author on the use of viewpoints in the software development process. 1 will concentrate most of my attention on requirements engineering, but I also treat the topic in the broader environment of software development. I will state without much justification, besides the presentation itself, key concepts that 1 believe are the basics for the use of viewpoints. I classify viewpoint research in three areas: opinions, specifications and services, each of which is described in detail. I conclude listing topics in need for further research.", "num_citations": "38\n", "authors": ["1459"]}
{"title": "Exploring business process transparency concepts\n", "abstract": " Transparency has been, for long, a general requirement for democratic societies. According to Leite [6], transparency will be a central issue in producing software. This work assumes that, for providing software transparency, it is necessary that the processes to be supported or automated be transparent as well. As such, using a requirements point of view, it is necessary that organizations implement process transparency to enable transparency in their automation or support. This work is based on Business Process Management concepts, NFR framework and quality management.", "num_citations": "37\n", "authors": ["1459"]}
{"title": "Exploring i* Characteristics that Support Software Transparency.\n", "abstract": " This work presents the idea of software transparency. It posits that software transparency must be based on requirements, which will be the baseline for downstream traceability as well as upstream traceability. In that context, ik models are viewed as providing the support for several of the nonYfunctional requirements that impact the software transparency NFR. In particular, we will explore the SA (strategic actor) model.", "num_citations": "35\n", "authors": ["1459"]}
{"title": "Rastreabilidade de requisitos\n", "abstract": " Requirements traceability is central to the issue of requirements management, which is essential for producing quality software. Our focus on requirements traceability addresses aspects related to software development and evolution. Our survey deals both with technical and managerial aspects and aims at contextualizing requirements traceability as well as providing basic reference on the subject. Two traceability reference models are used to help the definition of a traceability policy by developers. These models are also reference to the open problems in the area.", "num_citations": "34\n", "authors": ["1459"]}
{"title": "Supporting scenario evolution\n", "abstract": " Scenarios have been shown to be very helpful in identifying and communicating requirements for computer-based systems (CBSs). However, they appear not to be applicable to the rest of the CBS development process. Making scenarios more useful for the entire software development lifecycle requires integrating scenarios to other representations used during CBS development. This integration is achieved with tracing technology. Having integrated scenarios into the entire software development lifecycle creates the necessity to maintain scenarios through the inevitable changes that they and other documents undergo and to subject them to configuration management. We have prototyped automated support for full-lifecycle scenario management and have applied it to some non-trivial systems.", "num_citations": "34\n", "authors": ["1459"]}
{"title": "Lexicon based ontology construction\n", "abstract": " In order to secure interoperability and allow autonomous agent interaction, software for the web will be required to provide machine processable ontologies. Traditional deliverables of the software development process are the code, technical documentation, to support development and maintenance and use documentation, to provide user support. In the case of web applications, ontologies will also be part of the deliverables. Ontologies will allow machines to process and integrate Web resources intelligently, enable quick and accurate web search, and facilitate communication between a multitude of heterogeneous web-accessible agents [1]. We understand that the responsibility, not only for making explicit this requirement, but also to implement the ontology, belongs to software engineers. Currently the development of ontologies is more of a craft then a systematic discipline. We are proposing a process …", "num_citations": "33\n", "authors": ["1459"]}
{"title": "Requirements elicitation driven by interviews: the use of viewpoints\n", "abstract": " Requirements elicitation in the context of organizational information systems is a very hard task, being very dependent on the experience and cleverness of the team performing the elicitation. In such a context the use of interviews is common and seen as the major technique for obtaining the requirements from the actors in the organization. We have been working with the idea of a general interview assistant and our first results are promising. We elaborate on our original proposal in order to augment its assistant capability without losing its simplicity. We show how the use of viewpoint analysis improves the inference capability of our assistant.", "num_citations": "32\n", "authors": ["1459"]}
{"title": "Deriving requirements specifications from the application domain language captured by Language Extended Lexicon\n", "abstract": " Understanding the context of a software system during requirements specification is a difficult task. Sometimes application domains are very complex, other times the limits of the application are fuzzy. Thus, it is difficult to elicit and write the initial set of requirements. This difficulty frustrates requirements engineers and restricts the process of analysis, which could lead to a final software requirement specification of low quality. In such situations technologically outstanding software systems can be built, but they may fail to suit the needs of the client. Hence, clients are unsatisfied and development projects fail. In this paper we propose a strategy to use the application domain language captured by the Language Extended Lexicon in order to obtain different products related to requirements specification. Products vary from classic requirements which state “the system shall…” to products such as Use Cases and User Stories. The strategy focuses on obtaining the initial set of functional requirements. We believe that by minimizing the gap between the problem and the initial set of requirements, we provide engineers with a preliminary product they can work on and refine to reach the quality needed.", "num_citations": "30\n", "authors": ["1459"]}
{"title": "Comparing GORE Frameworks: i-star and KAOS.\n", "abstract": " Goal-Oriented Requirements Engineering (GORE) is an approach to requirements engineering dealing with intentionality in accordance with the relations among different actors. KAOS and i*(i-star) frameworks have been receiving many references as being important GORE proposals. This paper presents an conceptual analysis comparing characteristics of those methods giving examples related to actors’ relations definition, goal organizational model, tasks representation, risk analysis, and non-functional requirements. The aim of this work is to show both frameworks benefits and drawbacks. We believe that this analysis helps the understanding of the core concepts of GORE as well as it draws attention to key representation issues for both KAOS and i*.", "num_citations": "30\n", "authors": ["1459"]}
{"title": "Viewpoint resolution in requirements elicitation\n", "abstract": " It is the thesis of this work that viewpoint resolution can be used as a means for very early validation in the process of requirements elicitation.  Requirements elicitation is the process in requirements analysis responsible for understanding, finding and gathering information. As a part of requirements elicitation, the objective of fact-validation is to make sure that the facts gathered reflect the original intent, as well as to help unfold the knowledge not yet recorded as facts. Viewpoint resolution is a different approach to very early validation. It takes place in the process of fact-validation, and it is based on the acknowledgement that software requirements can be elicited from different viewpoints. The thesis proposes a language for expressing views from different viewpoints and an automated static analyzer of views that is capable of differentiating between missing information and conflicting information, thus providing …", "num_citations": "30\n", "authors": ["1459"]}
{"title": "Modeling organizational alignment\n", "abstract": " In the world of business, even small advantages make a difference. As such, establishing strategic goals becomes a very important practice. However, the big challenge is in the designing of processes aligned with the goals. Modeling goals and processes in an integrated way improves the traceability among strategic and operational layers, easing up the alignment problem.", "num_citations": "29\n", "authors": ["1459"]}
{"title": "Transparência de Processos Organizacionais\n", "abstract": " The demand for trust based on transparency increases in the context of global transformations. The value of openness in the flow of information is creating an open society in which the idea is to create a democratic society with engaged cittizens able to understand and use the information that is accessible to them [Holzner, 2006]. This reality has brought to the organizations the need of the establishment of mechanisms in their business processes to demonstrate this transparency. So, is necessary a true understanding of what the concept of organizational process transparency is and how to establish it. This paper seeks offer a better and deeper understanding of what is organizational process transparency through a taxonomy and systematization of this concept.", "num_citations": "27\n", "authors": ["1459"]}
{"title": "Teaching software engineering with SimulES-W\n", "abstract": " This work presents an educational board and card game named SimulES-W, as a tool for teaching Software Engineering. It encompasses 5 years of evolution, in which the game Problems and Programmers was the fundamental source. SimulES-W innovates in three distinct areas: it is a web based game, it relies on a broad view of the software process and it is customizable for content. SimulES-W is supported by collaborative software that implements the SimulES board game. The paper describes the game, stresses its strong points, provides initial data on its use and discusses its future.", "num_citations": "26\n", "authors": ["1459"]}
{"title": "Eliciting multi-agent systems intentionality: from language extended lexicon to i* models\n", "abstract": " MAS methods still lack coverage to the goal elicitation process, especially on how to identify goals from corporate information, mission statements and from interviews with stakeholders. Only after eliciting goals we will be able to properly deal with goal models. On the other hand, intentionality models, for example the i* framework, are, usually, complex and difficult to read. By contrast, this paper proposes an indirect inquire process that can identify goals in a bottom-up and simple elicitation approach together with a proposal to reduce the problem of scalability of i* models.", "num_citations": "26\n", "authors": ["1459"]}
{"title": "Test scenario generation from natural language requirements descriptions based on petri-nets\n", "abstract": " Test generation from functional requirements in natural language (NL) is often time-consuming and error prone, especially in complex projects. In this context, formal representations like Petri-Nets are increasingly used as input for automated test scenario generation. However, formal representations are not trivial, and it requires a strong knowledge on formal modeling. In this paper we propose an approach to generate test scenarios that takes as input a Restricted-form of Natural Language (RNL) requirements specification. This approach translates automatically RNL requirements specified as Scenarios into executable Petri-Net models; these Petri-Nets are used as input model for test scenario generation. Our approach checks the quality of the input models and aims to decrease the time and the effort with respect to test scenario generation process. Demonstration of the feasibility of the proposed approach is …", "num_citations": "25\n", "authors": ["1459"]}
{"title": "Using the Language Extended Lexicon to Support Non-Functional Requirements Elicitation.\n", "abstract": " Although Non-Functional Requirements (NFR) have been present in many software development methods, they have been faced as a second or even third class type of requirement, frequently hided inside notes and therefore frequently neglected or forgotten. Surprisingly, despite the fact that nonfunctional requirements (NFR) are among the most expensive and difficult to deal with [5][12][3][10], even today there are only a few works that focus on NFR as first class requirements (eg [7][8][10]. Not so surprisingly, stakeholders’ demand for NFR has been continuously increasing. During 2001 edition of ICSE Mantis Chen from ACD System presented the 3 most important aspects for a software in the stakeholders’ point of view and the 3 most important one in the developers’ point of view. All the 6 were non-functional requirements. This work intends to show how we used the Language Extended Lexicon as a way of supporting initial NFR elicitation.", "num_citations": "25\n", "authors": ["1459"]}
{"title": "Ontologias–Como e porque criá-las\n", "abstract": " A medida em que a Internet está migrando em direção a uma Web Semântica, onde a informação codificada poderá ser interpretada por seres humanos e máquinas, cresce a necessidade de métodos, técnicas e ferramentas que apóiem o desenvolvimento de ontologias. Neste trabalho apresentamos os conceitos fundamentais necessários ao projeto e construção de ontologias. Introduzimos um método simples, baseado em uma técnica de modelagem de requisitos de software, que permite a construção de ontologias por não especialistas.", "num_citations": "24\n", "authors": ["1459"]}
{"title": "Transparency versus security: early analysis of antagonistic requirements\n", "abstract": " Information systems designers have been increasingly convinced about the importance of dealing with quality issues at early stages of development. Over the landscape of quality issues, several proposals have been published as to help with respect to security. On the other hand, designers do also need to care about other quality issues; for instance, transparency. Transparency is the quality of having open information to the public. At first, the general intuition is that security and transparency conflict, but how should designers deal with these antagonistic issues? Departing from the use of the Non-Functional Requirements Framework we propose a process, based on Personal Construct Theory, to perform early analysis of antagonistic design issues. Having early analysis of antagonistic quality issues makes it possible for informed decision to be taken early on during IS design. We use the election domain to …", "num_citations": "23\n", "authors": ["1459"]}
{"title": "Managing user stories\n", "abstract": " Assuming that the system documentation produced by the Extreme Programming (XP) process is the actual code, we propose to enrich this documentation by aggregating the user stories (system requirements) to the final product, the code. In XP system requirements are elicited from clients using a template named user story cards that are further discarded. By simply annexing the user stories as they are to the correspondent piece of code they relate to, we would already have the following gains:We go beyond annexing the user stories to code and propose a new organization to the information that is already elicited through the user stories. We base our proposal in our past experience developing software using scenarios. We are providing a scenario structure in which to capture and record the use stories that will provide", "num_citations": "23\n", "authors": ["1459"]}
{"title": "Process reuse architecture\n", "abstract": " This paper proposes a systematic way to organize and describe processes, in order to reuse them. To achieve that, a process reuse architecture has been developed. This architecture is based on processes and their types (standard, pattern, usual and solution), on process frameworks, based on the theory of application framework and on different kinds of process modeling languages, which are specified in XML, to describe each type of process. In order to facilitate the reuse and retrieval of information, we use facets, reuse guidelines, as well a process patterns taxonomy. Some processes of requirements engineering have been analyzed so that it was possible to create a process framework and a web tool has been developed to enable a case study to validate the proposed architecture.", "num_citations": "23\n", "authors": ["1459"]}
{"title": "Scenario evolution: A closer view on relationships\n", "abstract": " We show the results of an extensive research on scenario evolution. We investigated twelve case studies spanning over 200 scenarios that contained over 800 episodes. The research aimed at capturing data on scenario evolution in order to confirm previous results and to elicitate the requirements for a scenario evolution support environment. Our findings are organised in a three tier framework, that deals with scenario evolution in the process, product and instance levels. We concentrate on the product and instance levels showing scenario relationships. Scenarios do not exist in a vacuum, they are connected to other scenarios in an intricate and complex network of relationships. We provide a taxonomy for classification and heuristics for the identification of scenario relationships.", "num_citations": "23\n", "authors": ["1459"]}
{"title": "Software transparency as a key requirement for self-driving cars\n", "abstract": " Self-Driving cars is a fast-growing area of study both in academia and industry. It is part of a broader domain which involves the development of software for Highly Automated Vehicles (HAV) and notions extracted from Artificial Intelligence/Autonomous Systems (AI/AS). There are many challenges that must be overcome to deliver self-driving cars in a manner that is readily accepted by consumers and society. Studies have shown that although many people are comfortable with the idea of AI helping them to operate their houses or schedule appointments, not many people are comfortable with the idea of cars being driven by AI algorithms. At the same time, insurance companies are concerned about vehicle liability issues and how to demonstrate who/what caused an accident. We believe that self-driving cars that demonstrate transparency in their operations will increase consumer trust which is pivotal to its …", "num_citations": "22\n", "authors": ["1459"]}
{"title": "Facing the challenges of teaching requirements engineering\n", "abstract": " This paper reports on our experience of teaching Requirements Engineering for undergraduate students. It is well known, the obstacles educators have in teaching requirements engineering. These obstacles are related to the very nature of requirements engineering: a multidisciplinary field that deals with both computer science and social sciences concepts. Teaching requirements engineering just with problems descriptions, as a basis for the construction of requirements specifications or requirements models, misses the point. Educators should also provide students with ways of gathering client information. However, to be effective in this regard, there is the need that students interact with clients. Our pedagogical strategy is designed to tackle these challenges. Notwithstanding, we need to have feedback about the strategy, which lead to the design of an assessment to gauge the efficacy of our pedagogical …", "num_citations": "22\n", "authors": ["1459"]}
{"title": "Porting COBOL programs using a transformational approach\n", "abstract": " Transformation systems have been applied in several areas of software engineering. This paper describes the use of the transformational engine Draco‐PUC in porting COBOL programs. We describe the porting strategy for going from COBOL to C/C++ and give examples of such a strategy applied to a radar application and also to a payroll system. Although targeting an object‐orientated language, we do not claim to generate code that strictly follows the OO guidelines. This paper gives special attention to the knowledge structure we have been using to help guide the transformation process as well as to help in the process of design recovery. © 1997 by John Wiley & Sons, Ltd. J. Software Maintenance 9: 3–31, 1997", "num_citations": "22\n", "authors": ["1459"]}
{"title": "Recovering business rules from structured analysis specifications\n", "abstract": " Reports on research geared toward recovering high-level abstractions from structured specifications. Our research goal is to investigate how other sources besides code can be used in the reverse engineering of software systems. Departing from structured specifications, we designed a process to recover business rules and domain facts. We use a simple representation scheme based on natural language with the objective to help the communication between software engineers and clients. Our results made us believe that our process is feasible and should aggregate value to the traditional code-level reverse engineering approaches.", "num_citations": "22\n", "authors": ["1459"]}
{"title": "Geração de Ontologias Subsidiada pela Engenharia de Requisitos.\n", "abstract": " Cresce a necessidade do uso de ontologias em aplicações Web devido ao fato da maioria das informações publicadas estar em linguagem natural e, portanto, serem processadas apenas por humanos. Tais informações compõem o universo de informação da aplicação (UdI) que no processo de desenvolvimento de software é elicitado, modelado e analisado pela comunidade de engenharia de requisitos. Acreditamos que com o apoio de técnicas e métodos desenvolvidos e em utilização por esta comunidade podemos apoiar o processo de geração de ontologias por não especialistas. Neste trabalho apresentamos uma ferramenta que fornece apoio semiautomático a geração de ontologias tendo como base o Léxico Ampliado da Linguagem (LAL).", "num_citations": "21\n", "authors": ["1459"]}
{"title": "Draco 1.3 users manual\n", "abstract": " 1. When an analyst with experience in developing many systems in a certain problem domain decides that the domain is sufficiently comprehensible, he defines a language which can comfortably and easily describe other systems in the problem domain. This person is called the Domain Analyst, and the language described is called the Domain Language. The Domain Analyst describes the domain and its internal form with the parser generator part of the BUILD subsystem of Draco, which is described in Chapter 2.2. Once the Domain Analyst has described the external and internal form of the domain, he describes how to print the domain program fragments clearly and accurately. This is called prettyprinter generation, and it is done by the Draco BUILD subsystem using the notations described in Chapter 3.", "num_citations": "21\n", "authors": ["1459"]}
{"title": "Aspect‐oriented business process modeling: analyzing open issues\n", "abstract": " Purpose – The aspect‐oriented paradigm provides mechanisms to modularize crosscutting concerns. Applying aspect‐oriented concepts in business process modeling raises the possibilities of modularization, but brings out several concerns related both to process and to product. This paper aims to provide an overview of the aspect‐oriented business process modeling area, point out the open issues and analyze possible solutions to such issues.Design/methodology/approach – This paper is based on a research project, where real business process models from a large oil and gas organization were analyzed, re‐modeled and re‐analyzed to put the AO‐BPM approach in practice.Findings – The paper indicates the need for more research on aspect‐orientation applied to business process models, backed by open issues that are faced in this research. The authors categorized the open issues as: aspects …", "num_citations": "20\n", "authors": ["1459"]}
{"title": "Driving non-functional requirements to use cases and scenarios\n", "abstract": " Today, companies are continuously changing and improving their business strategies. As a consequence, stakeholders are demanding more flexible and complex software to be built. To handle this complexity, conceptual models have to describe aspects beyond entities and activities. Recent research has pointed out that dealing with goals in order to capture intentions associated with complex situations is a major aspect to handle this new reality [14]. Non-Functional Requirements are a particular class of these goals that has to be dealt with since the early stages of software development. Therefore, expressing these NFRs in use cases and scenarios models is a must. In this work we show a strategy to drive elicited NFR towards use cases and scenarios that reflect the functional requirements of the software. We tested our proposal through two case studies and the results suggest that our strategy can help developers to deal with complex conceptual models and might result in a more complete software specification and thus, to a shorter time-to-the-market.", "num_citations": "20\n", "authors": ["1459"]}
{"title": "Using Goal-Models to Analyze Variability.\n", "abstract": " On our ongoing research on variability analysis, two major drawbacks have been identified: a) the lack of an effective tracing from the rationale to the selected variant, and b) the lack of an effective support to decide what variability should be implemented. In order to perform variability analysis we propose to combine goal-oriented requirements strategies with the concept of early aspects. This paper aims to contribute to the general discussion of variability, in particular variability analysis. We stress some of our initial findings on a meta-model to handle the amalgamation of a goals network with the concept of early aspect. We discuss some of the problems we are facing and the possible ways of addressing them.", "num_citations": "19\n", "authors": ["1459"]}
{"title": "Eliciting requirements using a natural language based approach: the case of the meeting scheduler problem\n", "abstract": " Requirements elicitation is a process in which the software engineer works toward understanding and discovering what is expected from a planned software system. Although it is common belief that it is a hard task, several researchers are attacking the problem using different frameworks. One of these frameworks is based on the use of natural language. One strong reason for a natural language based framework is to avoid the introduction of artificial languages at the beginning of the software development process. We believe that, although using this framework, it is possible to achieve more precision. Our group has been investigating one approach, called the Language Extended Lexicon (LEL), that fits in such framework. We have used the LEL mainly for eliciting application vocabulary directly from actors in an application universe of discourse. In this study we report in a variation of our approach. We show how …", "num_citations": "19\n", "authors": ["1459"]}
{"title": "Generating Requirements Views: A Transformation-Driven Approach\n", "abstract": " This paper reports the use of transformations based on XML to generate requirements views. A strategy to generate views is defined and scenarios and class diagrams are automatically created from a goal oriented model; the V-graph.", "num_citations": "18\n", "authors": ["1459"]}
{"title": "Análisis de Variabilidad con Modelos de Objetivos.\n", "abstract": " Dentro del campo de la variabilidad, o la habilidad de cambio o personalización de un sistema, no es común que dicha variabilidad se tenga en cuenta en la definición de requisitos. En las propuestas donde si se contemplan se utilizan directamente features, aunque no son una técnica de elicitación de requisitos, sino que más bien están a medio camino entre los requisitos y la definición de la arquitectura. También existen propuestas que usan casos de usos, más cercanos a la elicitación de requisitos, pero que tienen problemas para modelar la variabilidad. En este artículo se propone aplicar técnicas de la Ingeniería de Requisitos (IR) al estudio de variabilidad utilizando un enfoque basado en modelos de objetivos, escenarios (incluyendo casos de uso) y features, para la especificación y análisis de requisitos de sistemas con variabilidad. De esta manera, se espera mejorar la fase de requisitos en este tipo de sistemas. Además, los modelos de objetivos proporcionan un mecanismo de decisión de alto nivel (los objetivos del usuario) y permiten incorporar los requisitos no funcionales (RNF).", "num_citations": "18\n", "authors": ["1459"]}
{"title": "Non-Functional Requirements for Object-Oriented Modeling.\n", "abstract": " Recently, it has been pointed out that the majority of the requirements engineering methods do not take into account non-functional requirements (NFRs)[10][11]. Consequently, we have been experiencing serious problems during the development of software systems, such as cost and schedule overruns. In order to diminish this negligence of NFRs and its consequences, this work proposes a strategy (OONFR) that brings NFRs to object-oriented modeling. The OONFR strategy uses as input a Language Extended Lexicon of the Universe of Discourse (LEL of UofD) and outputs a class diagram with indications of what classes, attributes, operations and relationships are responsible for satisficing1 NFRs. This strategy consists of the following activities: build the Language Extended Lexicon of Universe of Discourse-NFR (LEL of UofD-NFR), build the scenarios and build the class diagram.", "num_citations": "17\n", "authors": ["1459"]}
{"title": "Using goals to identify aspects in business process models\n", "abstract": " Modularization of business process models using aspects is a new line of research. Aspectual languages in this context have been proposed and are still under development. However, most of the guidelines for aspects identification in this domain is still dependent on the idea of process model elements repetition. In this paper, we explore a new way of identifying aspects, based on the ideas of the GPM (Generic Process Model) and process goals. We present a procedure for aspect identification and provide an example to illustrate its application", "num_citations": "16\n", "authors": ["1459"]}
{"title": "Time-constrained requirements elicitation: reusing GitHub content\n", "abstract": " Requirements elicitation is the activity of identifying facts that compose the system requirements. One of the steps of this activity is the identification of information sources, which is a time-consuming task. Text documents are typically an important and abundant information source. However, their analysis to gather useful information is also time consuming and hard to automate. Because of its characteristics, the identification of information sources and analysis of text documents are critical in time-constrained projects, which are typically addressed through agile approaches. This paper presents a strategy for time-constrained elicitation, which is based on mining GitHub content. The strategy aims the identification of information sources (similar projects) and the automatic analysis of textual documents (projects content) through text mining techniques. Furthermore, it maintains the traceability between the data mined …", "num_citations": "15\n", "authors": ["1459"]}
{"title": "Service identification in aspect-oriented business process models\n", "abstract": " A Service-Oriented Architecture (SOA) can be created through the use of various approaches; among them, service identification from business process models is recognized as a promising starting point. In this approach, the concept of modularization plays an important role. Modularization is also central to the aspect-oriented business process modeling (AO-BPM) approach. We understand that the combination of these two approaches can bring improvements to service identification. This paper proposes adaptations to an existing service identification method using, as input, an aspect-oriented business process modeling approach. An example is provided to demonstrate the effectiveness of our proposal.", "num_citations": "15\n", "authors": ["1459"]}
{"title": "A Strategy for Information Source Identification\n", "abstract": " Eliciting requirements is well known to be a difficult task. Several strategies exist that makes it possible to elicit information from different information sources. These strategies vary and should be selected in accordance with the situation at hand. For instance, selecting a strategy to a situation where there are available COTS solutions is different from a tailored and specialized software application. This article reports on a strategy to be used before the selection of an elicitation strategy. We are concerned in how to select the information sources that should be taken in consideration for the requirements elicitation. We consider this activity of fundamental importance to the elicitation process. Selecting the appropriate sources is fundamental as to deliver quality requirements. The article describes the proposed strategy and exemplifies it with a well known and published case, The London Ambulance Service.", "num_citations": "15\n", "authors": ["1459"]}
{"title": "Dealing with softgoals at runtime: A fuzzy logic approach\n", "abstract": " One of the first frameworks to deal with NonFunctional Requirements, or softgoals, is the NFR Framework. This framework allows - among other contributions - softgoals analysis by applying propagation rules. This analysis is commonly performed during design activities. Instead of working with softgoals at design time, the proposal described in this paper combines propagation rules, fuzzy logic and Multi-Agent Systems in order to provide support for dealing with softgoals at runtime. Observing, for example, how the Requirements Engineering community deals with softgoals analysis by using propagation rules, we developed a propagation simulator centered on a specific algorithm. This simulator tries to replicate the requirements engineers' practices when using propagation rules to make decisions at design time. Based on this propagation simulator, we propose an intentional-MAS-driven reasoning engine …", "num_citations": "14\n", "authors": ["1459"]}
{"title": "Evolución de un Juego Educacional de Ingeniería de Software a través de Técnicas de Elicitación de Requisitos\n", "abstract": " La ingeniería de requisitos tiene como tarea principal representar las necesidades de un contexto estudiado. El entendimiento y el uso de técnicas apropiadas para representar estas necesidades pueden asegurar la satisfacción de los interesados. Para ello la ingeniería de requisitos se vale de diferentes estrategias para la captura de esta información. Basados en estos conceptos queremos mostrar cómo la elección y la aplicación oportuna de estas estrategias pueden llevar a la evolución y mejora de los sistemas. Nuestro objetivo es mostrar como a través de la aplicación de técnicas de elicitación de requisitos fue concebida la evolución de un juego de cartas educacional. Este juego contaba con un modelo situacional como fuente de información y derivó para un modelo intencional, este último como parte de la representación evolucionada del juego.", "num_citations": "14\n", "authors": ["1459"]}
{"title": "Using business rules in extreme requirements\n", "abstract": " Extreme Requirements (XR) is a proposal that tries to improve the quality of Extreme Programming (XP). XP is a well known agile method for software production. XP key elements are: little documentation, simplicity, analysis as constant activity, evolutionary design, integration and daily test. XR defines a requirements strategy that can be coupled with XP. In this article, we present an XR business rules based process. Our process is oriented to the customer, based on natural language, facilitating construction and validation. One of the strongest aspects of our proposed process is communication with customers, making them active participants in the software production process.", "num_citations": "14\n", "authors": ["1459"]}
{"title": "Integrating business processes with requirements elicitation\n", "abstract": " Our objective is to integrate business engineering with requirements engineering. Towards this end we develop a conceptual model based on total quality principles with a view to structuring information about business processes in a company. The conceptual model is redefined to ensure its implementation as a hypertext. Once organized in this way, relevant process information can be used to elicit requirements. A structured access directed towards a requirements specification representation helps requirements elicitation. We instantiate the conceptual model with business data from a unit of a large company certified in accordance with ISO 9001 standards.", "num_citations": "14\n", "authors": ["1459"]}
{"title": "Managing Transparency Guided by a Maturity Model\n", "abstract": " Transparency is a concept that is widely shared, but with a wide spectrum of distinct interpretations. We have been working on nailing down the transparency concept within the organizational context. As such, we have created a conceptual model of transparency, focusing on its relationships with other qualities (accessibility, ease of use, understandability, informativeness and auditability). Departing from this conceptualization of Transparency we are building a normative guide to measure the level of transparency of an organization. Similar to the Nolan stage model for Information Systems adoption, we are proposing five maturity stages to gauge the advancements of the organizations towards Transparency maturity. Within the scope of Simons bounded rationality our conceptual model has ways to judge how far or close an organization may be with respect to certain expected Transparency practices. Our work aims to establish a way of attributing, in a transparent way, stars to organizations, according to how they “satisfice” our conceptual model. As such a five star system, could better inform the organization itself as well as the market how mature they are with respect to Transparency. Each level (opaque, disclosed, comprehended, reliable, participative) has to “satisfice” some criteria in our conceptual model, which are translated to real practices being performed within an organization. Our work is defining such practices, and how they can be observed by the organization, that is which work products are necessary for sustaining the practices or which are produced by the practices. We are also drawing from the work done by the ISO organization …", "num_citations": "13\n", "authors": ["1459"]}
{"title": "Eliciting Non-Functional Requirements Interactions Using the Personal Construct Theory\n", "abstract": " Complex goal oriented information models such as i* and the non functional requirements framework bring up the need to model relationships between goals. In particular when dealing with non-functional goals, also known as softgoals, the modeler faces the problem of how to elicit the complex web of intertwined relationships that exist between them. We tackle this problem by using the personal construct theory (PCT), a well known work in cognitive science. We describe the results of applying PCT to the problem of finding relationships between nonfunctional goals. The process is a heuristic one, and our results, so far, are positive", "num_citations": "13\n", "authors": ["1459"]}
{"title": "Ensino de Engenharia de Software: Relato de Experiências\n", "abstract": " Este artigo relata a experiência adquirida com um método de ensino aplicado à disciplina Princípios de Engenharia de Software oferecida pela PUC-Rio aos alunos de Engenharia de Computação. O método visa despertar o interesse dos alunos em engenharia de software, apresentando os aspectos teóricos e oferecendo uma experiência prática da aplicação destes conceitos. Nesta experiência prática adotamos uma filosofia de desenvolvimento cooperativo, calcado no processo Extreme Programming (XP).Abstract. This paper presents our experience teaching Software Engineering. The proposed method aims to motivate the students in this discipline. We present the theoretical aspects and explore them in a study case. In this experience we use a cooperative development philosophy based on the Extreme Programming process (XP).", "num_citations": "13\n", "authors": ["1459"]}
{"title": "Exemplificando aspectos de usabilidade em sistemas de informação\n", "abstract": " Informação é essencial para qualquer organização. Como as organizações não funcionam sem informação, elas necessitam de sistemas fáceis de serem usados, que lhes permitam obter informação de qualidade.Essa necessidade de qualidade e de boa usabilidade torna a interface com o usuário uma parte fundamental dos sistemas de informação. Por ser a parte visível do software, através da qual os usuários se comunicam com os sistemas para executarem suas tarefas, tem um papel importante na operação de um sistema de informação.", "num_citations": "13\n", "authors": ["1459"]}
{"title": "A generative approach to componentware\n", "abstract": " Componentware practice faces several problems to handle the evolutionary aspects of software. We focus on four major problems in the area and propose the use of domain-oriented generic software generators as one possible solution. Motivated by the Draco-PUC project, this proposal defines an agenda for improving the Draco-PUC component model and for making it interoperable with CORBA.", "num_citations": "13\n", "authors": ["1459"]}
{"title": "Organizando Processos de Requisitos.\n", "abstract": " Considerando que a definição e a documentação de processos é um ponto importante para a gerência de requisitos o presente artigo propõe um esquema básico para organização de processos de requisitos, cuja ênfase está na descrição de padrões. Organizando os processos em três tipos (padrão de processo, processo padrão e processo solução) procuramos fornecer informações sob três pontos de vista, de modo a facilitar a aplicação e adaptação de processos. Como damos ênfase nas descrições de padrões de processo, os apresentamos em diferentes níveis de abstração (padrão indivíduo, padrão em família e padrão em comunidade). Nas descrições de processos utiliza-se a idéia do LAL; a idéia de hipertexto; e estrutura-se mais a linguagem natural que descreve os padrões.", "num_citations": "13\n", "authors": ["1459"]}
{"title": "Transparently teaching in the context of game-based learning: the case of simulES-W\n", "abstract": " This work presents a pedagogical proposal, in the context of game-based learning (GBL), that uses the concept of Transparency Pedagogy. As such, it aims to improve the quality of teaching, and the relationship between student, teacher and teaching methods. Transparency is anchored in the principle of information disclosure. In pedagogy, transparency emerges as an important issue that proposes to raise student awareness about the educational processes. Using GBL as an educational strategy we managed to make the game, a software, transparent. That is we made the inner processes of the game known to the students. As such, besides learning by playing, students had access to the game design, through intentional modeling. We collected evidence that, by disclosure of the information about the design, students better performed on learning software engineering.", "num_citations": "12\n", "authors": ["1459"]}
{"title": "Features and Checklists to Assist in Pervasive Mobile Game Development\n", "abstract": " Pervasive games are a recent form of entertainment that aims at bringing the game experience out of a game device. However, this area still lacks consensus on definitions and formalisms as researchers explore pervasive games from several viewpoints, from game studies to contextaware computing. Practical guidelines for mobile game developers are even scarcer. Firstly, this paper critically analyses the definitions of pervasive games found in the literature. Secondly, it proposes a set of pervasive features and checklists that can help both the task of classifying a preexisting mobile game and the task of designing a new mobile pervasive game. This paper ends with an example of applying checklists and features in a pervasive mobile game that we have developed.", "num_citations": "12\n", "authors": ["1459"]}
{"title": "Development of Agent-Driven Systems: from i* Architectural Models to Intentional Agents Code\n", "abstract": " The intentionality concept can improve the cognitive capacity of software agents, especially if the proposed intentional reasoning engine deals with softgoals at runtime. In this scenario, the use of an intentionality-based technological set to develop agent-driven systems from i* models to code is adequate. In this paper, we propose heuristics to improve the development of agent-driven systems from i* models to Belief-Desire-Intention-based code. Moreover, we apply a fuzzy-logic-based mechanism to deal with softgoals “on the fly”, improving the reasoning engine of intentional agents. We compare our efforts with related work and illustrate our contributions with a case study.", "num_citations": "12\n", "authors": ["1459"]}
{"title": "Integração de Características Transversais Durante a Modelagem de Requisitos\n", "abstract": " O princípio de separação e composição de características transversais 3 vem sendo usado pela comunidade de Desenvolvimento Orientado a Aspectos para tratar os problemas de espalhamento e entrelaçamento, no nível de implementação. Neste trabalho apresentamos uma proposta de integração de características transversais na fase de definição de requisitos. Utilizamos modelos de metas e os conceitos do desenvolvimento orientado a aspectos para prover a separação, composição e visualização de características transversais, facilitando a modelagem e rastreabilidade delas.", "num_citations": "12\n", "authors": ["1459"]}
{"title": "Extreme requirements (xr)\n", "abstract": " This paper builds upon the work of Kent Beck on Extreme Programming. Here we advance some ideas on how requirements engineering research can improve Extreme Programming and how the managerial common sense exposed by Beck can improve requirements management. The ideas expressed in the paper are anchored on Becks book and on our long experience in Software Engineering. Our main argument is that a family of processes, called XR, can provide more quality to Extreme Programming projects.", "num_citations": "12\n", "authors": ["1459"]}
{"title": "Nfrfinder: a knowledge based strategy for mining non-functional requirements\n", "abstract": " A challenge in requirements elicitation is to identify quality requirements, ie non-functional requirements (hereafter, NFR). In general, stakeholders need NFRs, but these requirements are not always explicit, they can be part of the tacit knowledge. The usual strategy adopted by requirements engineers to elicit NFRs is to act proactively by asking stakeholders their interests in qualities based on lists or catalogs. NFRFinder is a semi-automated process strategy for mining keywords. The strategy uses the keywords to find possible NFRs in unstructured texts, eg the meeting minutes that occur during an elicitation task. The strategy relies on catalogs, according to the NFR Framework, as a supporting knowledge base. However, to gain more confidence on the NFRFinder, we have applied it to a set of structured texts. We report on the recall and precision of NFRFinder using a gold standard built from different actors, for …", "num_citations": "11\n", "authors": ["1459"]}
{"title": "SimulES-W: A collaborative game to improve software engineering teaching\n", "abstract": " SUESCUN MONSALVE, Elizabeth et al. SimulES-W: A Collaborative Game to Improve Software Engineering Teaching. Comp. y Sist.[online]. 2018, vol. 22, n. 3, pp. 953-983. ISSN 1405-5546. https://doi. org/10.13053/cys-22-3-2711.", "num_citations": "11\n", "authors": ["1459"]}
{"title": "Uma Linguagem de Modelagem de Requisitos Orientada a Aspectos.\n", "abstract": " Durante a modelagem de requisitos percebemos que muitos dos requisitos estão fortemente relacionados, entrelaçados ou sobrepostos, influenciando ou restringindo uns aos outros. Todos estes relacionamentos tornam a rastreabilidade entre requisitos fator crucial para modelagem e para evolução de software. Neste trabalho, para abordar os problemas de entrelaçamento e espalhamento de requisitos, apresentamos uma linguagem de modelagem que utiliza conceitos da programação orientada a aspectos, de maneira a registrar o impacto que os requisitos exercem uns sobre os outros. Esta linguagem é parte de um método para separação e composição de características transversais, que visa facilitar a modelagem, entendimento, reuso e evolução de requisitos.", "num_citations": "11\n", "authors": ["1459"]}
{"title": "Suporte Automatizado à Gerência da Evolução de Cenários.\n", "abstract": " Neste artigo discutimos aspectos relacionados à evolução de especificações baseadas em cenários. Apresentamos resultados de estudos realizados nesta área, traduzidos em um conjunto de operações. A partir destes resultados tecemos comentários sobre o apoio automatizado a especificações baseadas em cenários.", "num_citations": "11\n", "authors": ["1459"]}
{"title": "Documentu: a flexible architecture for documentation production based on a reverse‐engineering strategy\n", "abstract": " Good documentation is essential to the production and evolution of quality software. Based on a survey on program documentation, we propose a documentation architecture that aims to fulfil several requirements of an ideal solution. The architecture integrates a powerful transformation system (Draco‐PUC) and a versatile CASE tool (Talisman) in order to produce documents using reverse‐engineering strategies. We have implemented such an approach in a prototype tool called Documentu, which uses a database to store system‐wide information and uses a standard HTML hypertext browser to help the access and navigation of system documentation. The prototype was used on a large scientific system that belongs to an oil company, with positive results. © 1998 John Wiley & Sons, Ltd.", "num_citations": "11\n", "authors": ["1459"]}
{"title": "Utilizando Requisitos Não Funcionais para Análise de Modelos Orientados a Dados.\n", "abstract": " Recentes pesquisas apontam para a necessidade de modelos conceituais serem capazes de lidar com metas, de forma a poderem retratar situações complexas que existem no mundo real. Este trabalho aborda o uso de requisitos não funcionais (RNF) na análise de modelos orientados a dados. Esta análise é baseada no uso do Léxico Ampliado da Linguagem (LAL) como âncora para a construção de um grafo de RNFs e para a construção do modelo de dados e de heurísticas para a validação do modelo de dados. Nós adotamos o largamente utilizado modelo entidade relacionamento como o modelo de representação de dados. Apesar de apresentarmos apenas o modelo ER, acreditamos que o método apresentado neste artigo possa ser estendido para outros modelos de dados.", "num_citations": "11\n", "authors": ["1459"]}
{"title": "A tool-supported compliance process for software systems\n", "abstract": " Laws and regulations impact the design of software systems, as they may introduce additional requirements and possible conflicts with pre-existing requirements. We propose a systematic, tool-supported process for establishing compliance of a software system with a given law. The process elicits new requirements from the law, compares them with existing ones and manages conflicts, exploiting a set of heuristics, partially supported by a tool. We illustrate our proposal through an exploratory study using the Italian Privacy Law. We also present results of a preliminary empirical study that indicates that adoption of the process improves compliance analysis for a simple compliance scenario.", "num_citations": "10\n", "authors": ["1459"]}
{"title": "Extracting requirements patterns from software repositories\n", "abstract": " Open Source Software (OSS) hosted in Repositories such as GitHub can be valuable as a source of information for requirements engineers, especially in the apprentice phase of a new application. In this context, we propose a strategy to speed up the discovery of valuable information, since manual search may be time consuming in the vast dataset of GitHub projects. Our strategy is based on the identification of requirements patterns as a way to summarize requirements-related information. Initial work has been performed using Music Application as a domain exemplar, and focusing on the Read-me perspective of GitHub projects. We explore some of our earlier findings, as well as present an overall architecture where patterns will be central in organizing information.", "num_citations": "10\n", "authors": ["1459"]}
{"title": "Perspectives on Software Requirements\n", "abstract": " Requirements engineering is a field of knowledge concerned with the systematic process of eliciting, analyzing and modeling requirements. Requirements engineering is usually understood in relation to software system requirements, most of its principles and some of its techniques can be adapted to other problems dealing with complex sets of requirements. The engineering vision indicates that this should be a practical and well-defined process where trade-offs have to be considered to obtain the best results. Mature software development needs mature requirements engineering. This was true ten years ago when requirements engineering became an important component of the software development process. It remains true today when the pressure to deliver code on time and on budget is increasing, and the demand for higher quality software also increases. Perspectives On Software Requirements presents perspectives on several current approaches to software requirements. Each chapter addresses a specific problem where the authors summarize their experiences and results to produce well-fit and traceable requirements. Chapters highlight familiar issues with recent results and experiences, which are accompanied by chapters describing well-tuned new methods for specific domains. Perspectives On Software Requirements is designed for a professional audience, composed of researchers and practitioners in industry. This book is also suitable as a secondary text for graduate-level students in computer science and engineering.", "num_citations": "10\n", "authors": ["1459"]}
{"title": "Estrategias para la ldentificación de Reglas de Negocio\n", "abstract": " Las reglas de negocio constituyen un importante concepto en el proceso de definición de los requisitos de los sistemas de información computarizados. Desde nuestro punto de vista, las reglas deben considerarse como sentencias muy genéricas sobre la forma en que la organización realiza sus negocios. Este modelo de reglas debe integrarse con los diferentes modelos que se generan durante la etapa de requisitos y que conforman la base de requisitos. Esta integración hace posible analizar los cambios desde el punto de vista de las reglas de la organización, las cuales son fácilmente comprendidas por las gerencias de nivel medio y superior. En este trabajo se presenta una extensión a una estrategia de identificación de reglas. La propuesta busca sentencias que refieran a los límites, responsabilidades y derechos de las entidades de la organización considerando la estabilidad de estas sentencias. La tarea de determinar el grado de estabilidad de las reglas está facilitada porque las relaciones entre el modelo de reglas y el léxico del lenguaje permiten una mejor comprensión de los símbolos involucrados en las mismas.", "num_citations": "10\n", "authors": ["1459"]}
{"title": "Non-functional requirements orienting the development of socially responsible software\n", "abstract": " Nowadays, software is ubiquitous and present in almost everything we buy and use. Artificial intelligence (AI) is becoming prevalent in software products. The use of AI entices consumer inquisitiveness, promising software products that can make our lives easier, productive, and in some mission-critical applications safer. Similar reasoning can be applied to systems exploring Internet of Things, cloud services, and mobile technologies. However, there is a trust deficit when it comes to accepting AI as well as the other above-mentioned features, as a reliable technology platform. This paper argues that the more critical the domain is, the less consumers seem to trust software to make decisions on their behalf or even to be used. Aspects such as safety, privacy, and ethics challenges the perception of trustworthy computing. In the past two decades, several works have suggested that Corporate Social …", "num_citations": "9\n", "authors": ["1459"]}
{"title": "A Corpus Builder: Retrieving Raw Data from GitHub for Knowledge Reuse In Requirements Elicitation\n", "abstract": " Requirement elicitation is an important task, which can lead to cost reduction in the overall software process, as it avoids failures due to lack of proper understanding about what to build. However, usually, there is a lack of time devoted to proper elicitation during software construction. We assume information from similar projects is a valuable knowledge for requirements engineers when facing a new project in the same or related domain, and its acquisition can be speeded up by knowing their main features. This information is usually located in Readme documents of GitHub. We present a tool that helps in handle this large amount of information by retrieving a corpus of Readme documents given a domain-related query. It is described, in detail, how a corpus is created and stresses the importance of having a quality corpus as base for data mining, or as input for tools of qualitative data analysis.", "num_citations": "9\n", "authors": ["1459"]}
{"title": "The challenges of representing transparency as patterns\n", "abstract": " Patterns are an invaluable tool for capturing and reusing Non-Functional Requirements (NFR) knowledge. Their construction, however, requires one to pay close attention to the semantics of its elements. This paper reports two important insights realized when developing a collection of Transparency patterns; they concern the semantics of the HELP contribution link and of the correlation link between NFR softgoals. The drawbacks of using these interdependency types are discussed and solutions are presented. The discussion is relevant to anyone attempting to develop precise catalogs for capturing NFR knowledge.", "num_citations": "9\n", "authors": ["1459"]}
{"title": "A rich traceability model for social interactions\n", "abstract": " In 1993, Goguen published a research note addressing the social issues in Requirements Engineering. He identified in the requirements process three major social groups: the client organization; the requirements team; and the development team. However, nowadays there is a lack of technological support that traces requirements to social issues on the requirements team or development team. From early published traceability metamodels to current requirements traceability literature, the client organization and the stakeholders are first-class citizens, but the software engineers and the interactions between these groups are not. In this paper we present a partially formalized RichPicture traceability model to fill this gap. ITrace is a flexible model to weave together the social network graph, the information sources graph, the social interactions graph, and the Requirements Engineering artifacts evolution graph. We …", "num_citations": "9\n", "authors": ["1459"]}
{"title": "Using i* Meta Modeling for Verifying i* Models\n", "abstract": " The i* Framework has been regarded as a suitable organizational modeling approach for representing early requirements of complex software systems. Intentionality in organizational context is the aim of i* Framework. We believe that a general lack of awareness about the i* language is the main reason for some authors mistakes including the lack of focus on intentionality. Aiming to help changing this scenario we made an exercise of modeling i* modeling using only i* concepts. Considering that building any diagram is more difficult than reading it we propose to use the i* meta model as basis for a series of check-list based questions. Based on the meta-model these questions work as a check-list for building an i* model, or if used after model creation as a basis for check-list reading as per Fagan’s inspection. We believe our contribution relies on providing a systematic and well founded way of improving i* models quality.", "num_citations": "9\n", "authors": ["1459"]}
{"title": "C&L: Um Ambiente para Edição e Visualização de Cenários e Léxicos\n", "abstract": " Scenario is a description technique that has been used for some time. This technique helps the understanding of a specific situation of a software application, with focus in its behavior. The process of scenario construction is related with the Language Extended Lexicon (LEL) existence, where your terms give the denotation and connotation of the terms of the application. Many approaches for the scenario representation are known, including informal and formals approaches. The C&L tool is presented in this paper. It is based on one representation that helps the comprehension with the use of natural language and forces the organization of the information with a well defined structure. The tool is created using the ideas from the development of open source community and its target public is the software engineering students and people interested in requirements engineering area.Resumo. Cenário é uma técnica de descrição que vem sendo utilizado por algum tempo. Esta técnica auxilia o entendimento de uma situação específica de uma aplicação de software, priorizando o seu comportamento. O processo de construção de cenários está relacionado à existência do Léxico Ampliado da Linguagem (LAL), onde seus termos expressam a denotação e a conotação dos conceitos da aplicação. Existem várias propostas para a representação de cenários, desde a mais informal até representações formais. A ferramenta C&L, apresentada neste artigo, baseia-se em uma representação que, ao mesmo tempo em que facilita a compreensão através da utilização de linguagem natural, força a organização da informação através de uma estrutura bem …", "num_citations": "9\n", "authors": ["1459"]}
{"title": "Ownership relevance in aspect-oriented business process models\n", "abstract": " Purpose                – The purpose of this paper is to propose a representation scheme based on the i* strategic actor model to represent the process owner information and show how to incorporate this approach into the event driven process chain and Business Process Modeling Notation-BPMN meta-models and also into the aspect-oriented business process modeling (BPM) context.                                        Design/methodology/approach                – The authors use a case study in a real setting to evaluate the proposal and a controlled experiment to get more evidence about its relevance.                                        Findings                – The authors presented evidence both from a case study in a real-world library showing the importance of representing – previously unavailable – process owner information, and from an experiment which involved participants analyzing the same models of the case study, confirming …", "num_citations": "8\n", "authors": ["1459"]}
{"title": "The Monopoly Game to Teach ERi* c-Intentional Requirements Engineering\n", "abstract": " Intentional Requirements Engineering (The ERi* c-Engenharia de Requisitos Intencional) is a GORE method under evolution. After the first publication of ERi* c, in March/2008, the method has received several changes in order to mitigate the complexity of tasks and artifacts. ERi* c follows the i-star Framework and NFR Framework ideas and consequently deals with actors, goals, softgoals, tasks and resources. Although the most laborious parts of the method have been facilitated by three tools (LEL, AGFL and iStar Diagnoses, as well as OME, used in modelling), we realized that students in an undergraduate software engineering course needed an incentive in the introduction of the new concepts in order to improve their understanding of what intentionality means in the context of requirements for a software project. It was necessary to find a way to keep students motivated and at the same time to tame the new concepts and consequently help their understanding. In this context, we explore the idea of using a game based learning strategy (GBL) as the motivational factor. We decided to adapt the Monopoly game to help teaching the ERi* c method to be used as a motivational factor. This article shows how the concepts were prepared and what was included in the game to teach ERi* c to UERJ's undergraduate students.", "num_citations": "8\n", "authors": ["1459"]}
{"title": "Transparência Aplicada a Modelos de Negócio\n", "abstract": " O presente artigo explora o uso do conceito de transparência em processos de negócio (BPM). Demonstra-se, através de um exemplo, como um processo de negócio pode tornar-se mais transparente e como a teoria de aspectos ajuda a modularizar o modelo do processo. Particularmente, ajudamos a comprovar a eficácia de aspectos na operacionalização de requisitos de clareza e simplicidade. O artigo utilza um exemplo baseado em um processo de solicitação de financiamento para aquisições num ambiente universitário.", "num_citations": "8\n", "authors": ["1459"]}
{"title": "Applying personal construct theory to requirements elicitation\n", "abstract": " One of the main approaches to Requirements Engineering is Goal-Oriented Requirement Engineering. This approach, based in Artificial Intelligence models, argues that goals are a natural and high level abstraction concept to elicit and represent requirements. Another advantage of goals is that they help non-functional requirements representation and reasoning. Although the goal oriented approach helps in representation and analysis, the problem of eliciting goals and their refinement is not trivial. In this article, we explore several applications to goal elicitation using a psychological theory: the Personal Construct Theory (PCT). This theory, stated by Kelly in 1955, can be used to elicit goals and their relationships. The choice of this theory is based in that it has a statistical base, therefore it is more precise and user independent than others. Finally, PCT can be amenable to automation by means of the Repertory …", "num_citations": "8\n", "authors": ["1459"]}
{"title": "É possível substituir processos de Engenharia de Requisitos por Contagem de Pontos de Função?.\n", "abstract": " O principal problema que afeta os projetos de desenvolvimento de software é o de especificações de requisitos com baixa qualidade. As especificações de requisitos com baixa qualidade dificultam o desenvolvimento de software de alta qualidade. Propomos a utilização do método de Contagem Estimativa de Pontos de Função (CEPF), para estimar o tamanho de software, como um processo substituto de Engenharia de Requisitos (ER), especialmente para as organizações que não aplicam um processo de ER. Durante a contagem de Pontos de Função, o profissional que realiza contagem pode descobrir requisitos omissos, requisitos incompletos e inconsistências na especificação de requisitos. Assim, estas organizações podem aplicar a CEPF como um processo substituto de ER. Este artigo apresenta uma aplicação do método a uma parte do processo de construção de requisitos, mais especificamente à verificação de requisitos.", "num_citations": "8\n", "authors": ["1459"]}
{"title": "Aplicaciones de la Teoría de Constructos Personales a la Elicitación de Requisitos\n", "abstract": " Dentro de la Ingeniería de Requisitos, uno de los principales enfoques es el de la orientación a objetivos. Según este enfoque, los objetivos son un concepto natural y de alto nivel de abstracción para la elicitación y representación de requisitos. Además, permiten una sistematización del manejo de los requisitos no funcionales. Sin embargo, la elicitación de los objetivos mismos y sus relaciones apenas se ha desarrollado. El problema de toda elicitación es recoger la información precisa, sobre todo aquella que está oculta por ser difícil de expresar. Dentro de la Psicología, existen diversos métodos para obtener este conocimiento. En este artículo se exploran varias aplicaciones de una teoría psicológica, la Teoría de Constructos Personales para la elicitación de objetivos. Esta teoría tiene la ventaja de tener una base estadística y, por tanto, ser más rigurosa e independiente, y la posibilidad de ser automatizada …", "num_citations": "8\n", "authors": ["1459"]}
{"title": "Software engineering for large-scale multi-agent systems-SELMAS 2003: workshop report\n", "abstract": " This paper is intended to sum up the results of the Second International Workshop on Software Engineering for Large-Scale Multi-Agent Systems (SELMAS'03) held in Portland, Oregon, USA, May 3--4, 2003, as part of the International Conference on Software Engineering (ICSE'03). The main purpose of this workshop was to share and pool the collective experience of people, both academics and practitioners, who are actively working on software engineering for large-scale multi-agent systems. The call for papers elicited some 26 submissions, of which 19 papers were accepted for presentation. A selected set of the workshop papers and invited papers are to appear in the 2nd edition of the book Software Engineering for Large-Scale Multi-Agent Systems (LNCS, Springer, 2003). The workshop consisted of an opening presentation, several paper presentations organized into five sessions, and three panels. During …", "num_citations": "8\n", "authors": ["1459"]}
{"title": "FAES: a CASE tool for information acquisition\n", "abstract": " It has become a trend that new CASE based tools be more focused. FAES is such a case. It assists the software engineer in the interview process during an information systems' requirements phase. FAES inherited important concepts from the IS literature and embodies them in a conceptual model that drives the interview process. Special heuristics associated with the conceptual model were proposed and tested before inclusion on FAES. The goal of those heuristics is to provide an up front analysis of the information as the interview proceeds. Artificial intelligence techniques were used in order to provide FAES with the intelligent assistance capability.< >", "num_citations": "8\n", "authors": ["1459"]}
{"title": "Is there a demand of software transparency?\n", "abstract": " This paper uses data about bills proposed to the Brazilian Congress to better understand transparency demand. The legislative process starts with bills, proposed by members of congress, which after the discussion on both chambers, may become a law. Webcitizen, a software company, offers to the Brazilian public an internet based software system with which people can vote on bills. This software interface is a site named Votenaweb, which gathers votes and publicize the results. As such, it aims to show how citizens value the proposed bills. Our study identifies bills related to transparency by using non-functional requirements (hereafter, NFRs) of the Transparency Softgoal Interdependency Graph (hereafter, SIG). Based on these results, we argue that there is a real future demand for software transparency, as advocated by previous work on software transparency.", "num_citations": "7\n", "authors": ["1459"]}
{"title": "Reusing non-functional patterns in i∗ modeling\n", "abstract": " Patterns are an important concept for capturing and reusing Non-Functional Requirements (NFR) knowledge. This paper reports on the use of NFR patterns as a means for reusing cataloged information. In particular we stress its use for intentional models written in i*. This paper focuses on the NFR awareness and details some of its patterns. The integration with i* is done by means of specification patterns, which integrates the cataloged information with the i* model. An example is shown as to argue about the feasibility of our proposal.", "num_citations": "7\n", "authors": ["1459"]}
{"title": "Ultrasonic pulse propagation in a bonded three-layered structure\n", "abstract": " Bonded layers are used in the assembly of many critical functional parts of industrial equipment. In this work, ultrasonic pulse propagation in a steel-rubber-rubber bonded composite structure is investigated by means of computer simulation and pulse echo experimental evaluation. Ultrasonic pulse propagation is modelled using a 2D time domain finite-difference software. For the experimental measurements, two test samples were fabricated by bonding a thin layer of steel and two thin layers of rubber, including debonded areas at marked regions of each interface. Several ultrasonic traces were acquired by contact pulse-echo testing, using a 5 MHz wideband transducer, from the external steel surface. The large acoustic impedance mismatch existing between steel and rubber layers makes that only a very small part of the ultrasonic energy is transmitted through the first (steel-rubber)interface. The high attenuation in rubber materials and the possible overlapping of multiple echoes are additional characteristics of the complex ultrasonic pulse propagation in this flat structure. Some differences in time and frequency domains, between the received signals from normal bonded areas and completely debonded areas are discussed, looking for defect detection at the first (steel-rubber) and second (rubber-rubber) interfaces.", "num_citations": "7\n", "authors": ["1459"]}
{"title": "i* Diagnoses: A Quality Process for Building i* Models\n", "abstract": " Modeling with i* is not a trivial task. Our work describes i* Diagnoses Framework, a quality oriented process to analyze i* models. Our process is similar to some of the reading techniques of inspection methods and bears some similarity with the inquiry based requirement analysis approach. Our process focuses on defect prevention considering both the efficiency and effectiveness of Multi-Agent System development.", "num_citations": "7\n", "authors": ["1459"]}
{"title": "Uso de Agentes no Processo de Requisitos em Ambientes Distribuídos de Desenvolvimento.\n", "abstract": " Dentre as atividades de Engenharia de Software desenvolvidas no decorrer do desenvolvimento de um sistema de software, as mais intensivas em comunicação são aquelas ocorridas na fase do Processo de Requisitos. Nesta fase interagem diferentes atores ou interessados: usuário, cliente, desenvolvedor, engenheiro de requisitos, coordenador do projeto, inspetores de qualidade. Cada um desses atores desempenha um papel no processo, visando atingir seus próprios objetivos; todos colaboram visando atingir um objetivo comum, que é a obtenção, ao final do processo de desenvolvimento, de um produto de qualidade que atenda às necessidades dos clientes e usuários. Defendemos a idéia que o paradigma de agentes é adequado para apoiar a solução de problemas encontrados no desenvolvimento distribuído de software, no qual fatores como distância, dificuldades de comunicação e diferenças em fusos horários colocam dificuldades adicionais aos atores. Nossa argumentação é validada pela modelagem das atividades de verificação e validação de requisitos, com o uso da modelagem i* para mostrar a intencionalidade de diferentes atores nesse processo.", "num_citations": "7\n", "authors": ["1459"]}
{"title": "Design Recovery-A Multi-Paradigm Approach\n", "abstract": " One of the reutilization aspects that is of major concern is how to get old code and turn it into a reusable asset. Our article proposes and analyzes a multi-paradigm approach to the problem of Design Recovery. Design Recovery is the first step in turning old code into a resuable product. Our aproach is being used in a special kind of old code, the Draco Prototype, a system that implements the concept of reusable components to the point of achieving reusability of Analysis, Design and Code. In recovering the Draco design, we have used Inspections, JSD, and Prototyping. The combination of those different paradigms is analyzed in detail and the results are reported.", "num_citations": "7\n", "authors": ["1459"]}
{"title": "Reengineering for accessibility: A strategy based on software awareness\n", "abstract": " Almost a decade after the release of the W3C Web Content Accessibility Guidelines (WCAG) version 2.0, the low level of accessibility in web sites and web applications is still worrying. A problem that aggravates this situation involves the fact that web accessibility requirements are often addressed when the application is fully developed. Such delayed processing often results in significant rework, increasing costs with new recoding analyzes, which may be totally outside the scope and budget of the project. As we believe that the need for accessibility may vary according to the users and their context, in this article, we approach a strategy to promote web accessibility in legacy systems through the use of software awareness. In this process of reengineering, we deal with the interaction of web accessibility with another nonfunctional requirement: Software Awareness. In this way, we use self-adaptation strategies to …", "num_citations": "6\n", "authors": ["1459"]}
{"title": "GH4RE: Repository Recommendation on GitHub for Requirements Elicitation Reuse\n", "abstract": " One of the challenges of requirements engineers is to understand domain issues and elicit requirements effectively. One of the possible strategies is to perform a manual inspection of similar projects to quickly gain leverage of domain concepts underlying the projects. However, this task is time-consuming and limited to the projects at hand. To ensure comprehensive elicitation using more widely available systems, we propose to use GitHub projects as information sources. To handle the large amount of data and facilitate access to suitable sources, we propose the creation of project profiles with useful attributes for requirements engineering, and thereby achieve a meaningful recommendation of projects. In this paper, we describe the GitHub assets to be mined, its implementation and the assessment of our approach by using a corpus of readmes related to Real Estate projects.", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Using correctness, consistency, and completeness patterns for automated scenarios verification\n", "abstract": " Scenario-based approaches are often used for Software Requirements Specification (SRS). Since scenarios are usually written in natural language, they may be ambiguous and, sometimes, inaccurate, which impair requirements quality. One of the major factors for this problem is because interactions among scenarios are seldom represented explicitly. As such, the importance of correctness, consistency and completeness, in the context of scenario-based representations should be rethought. In this paper, we employ the NFR approach to organize the non-functional requirements related to correctness, consistency and completeness as a catalog of non-functional requirements (NFR). We represent the initial catalog as non-functional requirements patterns. These initial patterns can be effectively used for automated scenario-based SRS verification. The identified patterns can be operationalized by evaluating …", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Analysis of Scenarios with Petri-Net Models\n", "abstract": " Requirements analysis plays a key role in the software development process. Scenario-based representation is often used for software requirements specification (SRS). Scenarios written in natural language may be ambiguous, and, sometimes, inaccurate. This problem is partially due to the fact that interactions among scenarios are rarely represented explicitly. As scenarios are used as input to subsequent activities of the software development process (SD), it is very important to enable their analysis, especially to detect flaws or problems due to wrong or missing information. This work proposes a Petri-Net based approach as an effective way to analyze the acquired scenarios. To enable the automated analysis, scenarios are translated into equivalent Place/Transition Petri-Nets. Scenarios and their resulting Petri-Nets can be automatically analyzed to evaluate some properties related to correctness, consistency …", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Using i* for Transparent Pedagogy\n", "abstract": " Pedagogy,“the principles and methods of instruction”(Wordnet), implies a relationship among actors playing the roles of teacher and student and has a direct impact on the students' learning performance. In the past, the teacher was a transmitter of knowledge and the student a passive receiver. Nowadays, students are encouraged to challenge, deepen and create their own knowledge and teachers are supposed to lead this process. For that reason, transparency emerges as an important concern that aims to enhance this relationship by improving student awareness about the process and the contents of learning. The purpose of this research is to address the potential of i* within pedagogy transparency. We discuss the role of i* models as providing transparency for a game-based learning (GBL) strategy.", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Analysis of heuristics to identify crosscutting concerns in business process models\n", "abstract": " One of the results of BPM (Business Process Management) is the knowledge about the business processes performed by an organization. Conventional process modeling notations and languages are used to document these processes. Principles for functional decomposition and organization of elements are generally applied. However, they are not enough to separate orthogonal concerns that appear within different elements of the same process or in different process. Incorporation of aspect-orientation ideas in the modularization of business process models is a new line of research to address this problem. In such context most of the guidelines to aspect identification are dependent on the idea of concepts repetition. In this paper we analyze some heuristics used to identify the crosscutting concerns in business process models to show that repetition criteria is not enough to identify an aspect.", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Aplicación de un Enfoque Intencional al Análisis de Variabilidad.\n", "abstract": " El interés por el estudio de la variabilidad, es decir la habilidad de cambio o adaptación de un sistema, ha aumentado significativamente durante los últimos años. Esto se debe a su utilidad en diversos campos, desde la personalización del software a las líneas de producto o la adaptación automática de sistemas. Dicho estudio ha estado centrado principalmente en cuestiones de diseño, y solo recientemente se ha empezado a abordar desde los requisitos del sistema. Las primeras propuestas, basadas en features, están claramente enfocadas a facilitar la obtención de la arquitectura del sistema. Debido a la necesidad de contemplar la elicitación de los requisitos del usuario han aparecido nuevas técnicas basadas en casos de uso, que facilitan la elicitación, pero fallan en la representación global de la variabilidad, dificultando la obtención de la arquitectura. También existen enfoques que unen ambas técnicas, compaginándose entre si. El problema común de estas técnicas es que ignoran el tratamiento de los Requisitos No Funcionales (RNF). Si bien los RNF son fundamentales para todo tipo de sistemas, en el caso de la variabilidad lo son aún más, puesto que explican la existencia de distintas variantes para una misma funcionalidad. En este artículo se presenta un ejemplo de aplicación de técnicas de la ingeniería de requisitos orientada a objetivos en el campo de la variabilidad, aplicada a la obtención de los requisitos ya la selección óptima de variantes, teniendo en cuenta los objetivos del usuario tanto funcionales como no funcionales.", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Qualidade em Requisitos\n", "abstract": " Neste artigo procuraremos abordar técnicas para aferição e melhoria da qualidade de um documento de requisitos, documento este gerado segundo uma das metodologias clássicas de desenvolvimento de software. Publicações recentes apontam que aproximadamente 50% das falhas detectadas na fase de testes são oriundas de problemas no documento de requisitos; defeitos em requisitos, isoladamente, é a maior falha em projetos de software. A qualidade de um artefato de requisitos pode ser avaliada através da utilização de métricas, indicadores ou testes; a análise crítica desses artefatos pode ser realizada através de inspeções. Métricas fornecem subsídios importantes para o gerenciamento do projeto, e podem ser aplicadas em diferentes etapas do processo de desenvolvimento. As inspeções ajudam a encontrar defeitos em artefatos, antes que se passe à fase seguinte do processo; no cerne do processo de inspeção estão a identificação das informações a serem checadas e a técnica a ser utilizada para identificar defeitos nessas informações. Apresentaremos métricas e técnicas de leitura aplicáveis a documentos de requisitos gerados pelo uso de metodologias clássicas de desenvolvimento de software.", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Is there a gap between RE research and RE practice?\n", "abstract": " The author takes the position that yes, as in most disciplines there are gaps between research and practice. However, since we are dealing with engineering, the novelty may also come from practice. He lists the main obstacles against my optimistic view, as well as the major incentives towards a better communication between industry and RE research. The obstacles are: 1) Lack of formal education, university level, on requirements engineering. Few universities are providing RE courses as part of their software curricula. 2) More and more customers demand constant evolution on very tight schedules. 3) The \"model everything\" mentality. Software engineers when faced with business models still adopt the idea that all the details must be in the model. 4) The technology transfer problem, mainly with respect to packing. Usually software research results are not packed as the industry expects. The incentives are: 1) A …", "num_citations": "6\n", "authors": ["1459"]}
{"title": "Elicit@ 99 um Protótipo de Ferramenta para a Elicitação de Requisitos.\n", "abstract": " No presente trabalho apresenta-se o editor de requisitos Elicit@ 99, um protótipo de ferramenta para a elicitação de requisitos. Este protótipo está baseado no modelo Serbac-m, o qual é parte do “Requirements Baseline”. Elicit@ 99 implementa duas estratégias para a elicitação de requisitos: o uso do acesso estruturado ou enlace hipertextual, que víncula o editor de requisitos ao modelo de negócio, para a captura tanto dos Requisitos Funcionais (RFs) como dos Requisitos Não Funcionais (RNFs), e do repositorio de requisitos para a captura exclusiva dos RNFs de Qualidade.", "num_citations": "6\n", "authors": ["1459"]}
{"title": "A method to assess pervasive qualities in mobile games\n", "abstract": " Software designers are facing huge challenges imposed by a new generation of applications that mix real and digital worlds, such as pervasive games. This type of game has recently become a worldwide phenomenon, with thousands of people walking in the streets with smartphones to interact with the physical environment. In this paper, we propose a new method to assess pervasive qualities in pervasive mobile games, which can be customized and extended to other ubiquitous applications. This method generates a quality report, which consists of a quality spreadsheet (containing metric values and comments) and a quality vector (representing the game quality profile in the form of a bar chart). In addition, we can compare quality vectors using similarity criteria. In this paper, we apply the proposed method to commercial and academic prototype games to shed more light on their pervasive characteristics …", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Um processo colaborativo para a construção de léxicos: o caso da divulgação de transparência\n", "abstract": " O léxico ampliado da linguagem (LAL) é uma representação proposta para registrar o vocabulário de um contexto, estendendo o conceito de dicionário denotacional para um léxico circular com denotações e conotações. É uma linguagem utilizada por várias pesquisas para ancorar a modelagem de requisitos na linguagem corrente do contexto. Esse artigo descreve um processo colaborativo para a construção de léxicos. Em particular, aplicou-se o processo para a construção de um léxico de transparência. Esse léxico foi ancorado em dois livros clássicos sobre o tema. Diferentes técnicas de colaboração são explicitadas e mapeadas em modelos colaborativos. Nessa proposta de processo foi adicionada uma ferramenta de visualização de forma a melhorar a legibilidade de léxicos. O visualizador também contribui para a divulgação de léxico para leitores em geral. O trabalho contribui tanto para uma melhor compreensão do processo de evolução de léxicos, como para maneiras eficazes de práticas colaborativas durante esse processo.", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Towards software modularization from requirements\n", "abstract": " One of the most important activities during software design is to organize the software in modules. Once the modularization is well made, it is possible to develop each module independently, the adaption is facilitated and the system can be more easily understood. Nevertheless, this activity has to be done during the early stages of software development, where the knowledge about the Universe of Discourse (UofD) is modeled through requirements artifacts. Therefore it is interesting to base the decisions about software modularization in these artifacts, since they are the only ones available. In this work we proposed an approach which derives software modularity based on requirements engineering representations (Language Extended Lexicon and Scenarios). The novelty of the strategy is to provide modularity as a consequence of a reification process, in which modularity is achieved both by situations of the real …", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Incorporando Transparência na Pedagogia através do Uso de Jogos para Ensino\n", "abstract": " Na sociedade em constante transformação, a educação é quem facilita a adaptação do ser humano ao mundo, sendo a pedagogia a responsável em criar uma educação mais eficaz. Neste contexto, se olharmos o passado a pedagogia era fundamentalmente voltada para uma relação professor-aluno e menos numa sinergia aluno-professor, ou seja, o papel do estudante era menos ativo. Novas propostas pedagógicas incluem o olhar a pedagogia com o foco da transparência, informação revelada. Pedagogia com transparência oferece um equilíbrio entre professor e aluno. E faz com que este último participe mais e seja ciente sobre processos e conteúdos educativos. Nesse contexto, jogos surgem como uma alternativa de ensino em que existe mais participação do aluno. Nosso trabalho pretende explorar as noções de transparência pedagógica.", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Aplicação de Modelos Intencionais e Sistemas Multiagentes para Estabelecer Políticas de Monitoração de Transparência de Software\n", "abstract": " O artigo apresenta uma proposta de monitoração de características de transparência de software a partir de sistemas multiagentes. É um primeiro esforço para o entendimento de políticas e modelos intencionais aplicados a agentes autônomos monitores.", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Buenas prácticas en la especificación del dominio de una aplicación\n", "abstract": " La ingeniería de requerimientos es un área crítica en el desarrollo de software y particularmente lo es la especificación de requerimientos. Se pueden construir productos tecnológicamente adecuados pero si ellos no cumplen con los requerimientos carecen de utilidad. Sin embargo, no es una tarea sencilla el construir una especificación correcta que describa y logre transmitir el conocimiento, necesidades y deseos de los stakeholders. Por este motivo, es necesario contar con guías que faciliten la tarea de escribir especificaciones de requerimientos. En este artículo, se presentan una serie de guías que tienen por objetivo mejorar la descripción del Léxico Extendido del Lenguaje (LEL). La identificación de las guías se realizó durante un ejercicio de escritura del LEL en donde se recurrió a la literatura para identificar las guías a aplicar como buenas prácticas, y finalmente se realizó un experimento para verificar la interpretación de las especificaciones realizadas utilizando las buenas prácticas propuestas.", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Método ERi* c-Engenharia de Requisitos Intencional.\n", "abstract": " Objetivo:“Elicitação e refinamento das metas para Sistemas Multi-Agentes”(SMA). A primeira etapa é composta de três atividades: A) Preparar LAL-Léxico Ampliado da Linguagem, B)", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Incorporación de Patrones al Proceso de Construcción de Escenarios.\n", "abstract": " La idea central del uso de patrones en la construcción de escenarios consiste en aportar la experiencia acerca de situaciones similares acumulada en los patrones a las técnicas existentes. Analizando desde un punto de vista estructural las situaciones, es posible asociar la situación, completa o parcialmente, con uno o más patrones de un catálogo. Una vez determinado el patrón que más se aproxime a la situación real, se reusa su estructura con el fin de derivar el escenario más fácil y directamente. En el presente artículo se propone una modificación a la heurística de construcción de escenarios y se analizan los resultados obtenidos al aplicarla a dos casos de estudio cuyos escenarios ya habían sido obtenidos sin patrones.", "num_citations": "5\n", "authors": ["1459"]}
{"title": "Working results on software re-engineering\n", "abstract": " We view software re-engineering as a new approach to software maintenance. Instead of performing maintenance at the source code of systems, we work on high level abstractions. From these abstractions we proceed in a forward manner reusing the available implementations, when it is the case. As such, we view re-engineering as centered on design recovery. We have been working on methods for re-engineering and applying them to real cases. Our studies are centered on the idea of using JSD [Jackson 83] as a way of casting the recovered design. We worked with two small systems and a complex one. Our objective here is to highlight our approach, report on what has been done and point out what was learned.", "num_citations": "5\n", "authors": ["1459"]}
{"title": "An Automated Approach of Test Case Generation for Concurrent Systems from Requirements Descriptions.\n", "abstract": " Concurrent applications are frequently written, however, there are no systematic approaches for testing them from requirements descriptions. Methods for sequential applications are inadequate to validate the reliability of concurrent applications and they are expensive and time consuming. So, it is desired that test cases can be automatically generated from requirements descriptions. This paper proposes an automated approach to generate test cases for concurrent applications from requirements descriptions. The Scenario language is the representation used for these descriptions. Scenario describes specific situations of the application through a sequence of episodes, episodes execute tasks and some tasks can be executed concurrently; these descriptions reference relevant words or phrases (shared resources), the lexicon of an application. In this process, for each scenario a directed graph is derived, and this graph is represented as an UML activity diagram. Because of multiple interactions among concurrent tasks, test scenario explosion becomes a major problem. This explosion is controlled adopting the interaction sequences and exclusive paths strategies. Demonstration of the feasibility of the proposed approach is based on two case studies.", "num_citations": "4\n", "authors": ["1459"]}
{"title": "Confirmando a Demanda por Transparência: Um Estudo Inicial sobre um Sistema de Avaliação de Projetos de Lei\n", "abstract": " This work examines a set of law proposals, in a given time frame, to check how laws classified as implementation of target transparency are being received by the public. The site votenaweb, which publicizes Brazilian congress law proposals, also provides a simple feedback mechanism to users, which may vote on approval or disapproval of the proposals. Our results are limited to the information on votenaweb, but provides partial data that support the general interest on transparency.Resumo. Este trabalho tem como objetivo estudar de que forma são avaliados projetos de lei do legislativo brasileiro relacionados ao conceito de transparência. Diferentemente da lei de acesso, que é uma norma geral sobre divulgação de informações, vários projetos de lei recentemente propostos tem como objetivo disponibilizar informações sobre determinado interesse, caracterizando uma transparência focada. O sítio votenaweb, divulga propostas de projetos de leis e permite que cidadãos votem a favor ou contra a iniciativa parlamentar. Nosso estudo inicial mostra que projetos classificados como transparência focada obtêm alto nível de aceitação, o que acreditamos é uma confirmação da demanda da sociedade por transparência.", "num_citations": "4\n", "authors": ["1459"]}
{"title": "A Proposal for Ownership Representation in the Context of Business Process Models\n", "abstract": " The literature on Business Process Management (BPM) confirms the importance of establishing process ownership but conventional approaches as BPMN or EPC do not offer a way to represent the process owner. The aspect-oriented business process (AO-BPM) approach makes this issue more prominent because of the separation between crosscutting concerns and the core elements of a process. In this paper we present a way to represent the ownership based on the Strategic Actor model from i* and incorporate this approach to the EPC meta-model. We also provide a proof of concept by means of an example that illustrates our solution.", "num_citations": "4\n", "authors": ["1459"]}
{"title": "Bula de software: Uma estrutura definida para promover a melhoria da transparência em software\n", "abstract": " This article presents a novel proposal for software documentation that is founded on package insert (patient information leaflets) for drugs. The objective of our proposal, called Software Bula, is to provide for users and developers software information that are at the same time clean and well structured and organized.", "num_citations": "4\n", "authors": ["1459"]}
{"title": "Uma Proposta para Avaliação de Equipes de Requisitos.\n", "abstract": " Software Engineering has, as one of its main goals, the duty of helping software managers perform their jobs as better as possible. As such, technical management, which embodies software engineering expertise, is the central aspect in software management. Managing human resources is difficult for any production scheme, but is particular challenging for software, a knowledge intensive production process. This paper tackles the issue of evaluating requirements teams. An evaluation method is proposed to help managers better control their teams productivity. The proposed method stands on the shoulders of previous literature and on early feedback from its use in two laboratory projects conducted at PUC-Rio.", "num_citations": "4\n", "authors": ["1459"]}
{"title": "An architectural framework for software transformation\n", "abstract": " Software transformation is typically understood as a termrewriting activity. As such, transformational infrastructure is built around rewriting engines, where transformers are described through a rule-based notation. When this kind of approach is put to practice, several workarounds take place in order to successfully develop transformational solutions. Two are the main factors that make the pure rule-based approach to be dropped: the need for flexible control and the need for interconnectivity with external agents. A mix between rule-based and procedural notations is then commonly adopted as an alternative. By introducing a procedural approach to transformers, issues concerning the problems of design organization and maintainability of procedural programs start to apply to software transformers. Based on our experience with the Draco-PUC machine, our current research work concentrates on how to build architecture-based infrastructure for the design of software transformers. The long-term aim of such work is to develop an infrastructure that can help tackle the problems of using mixed architectural styles on transformation systems.", "num_citations": "4\n", "authors": ["1459"]}
{"title": "Aplicando reuso de software na construção de ferramentas de engenharia reversa\n", "abstract": " Engenharia reversa é uma área de interesse emergente principalmente pelo volume de sistemas legados que precisam evoluir. Diz-se engenharia reversa, porque ao contrário da engenharia tradicional, partimos do produto para a sua definição. Portanto, antes de evoluir um determinado sistema de software, faz-se necessário reverte-lo à descrições mais abstratas para então modificá-lo.", "num_citations": "4\n", "authors": ["1459"]}
{"title": "Improving Urban Mobility for the Visually Impaired using the Awareness Quality\n", "abstract": " Urban mobility for disabled people is a hard challenge. The technology of the Internet of Things (IoT) might empower these individuals by contributing to their safety and security. In the case of the visually impaired, smart canes are critical components for tackling the challenge of mobility for this population. These types of devices, when integrated into the IoT ecology, may augment their effectiveness. However, this integration is tricky, and we should plan it accordingly. We show how the use of quality requirements (NonFunctional Requirements) can contribute to the development of these types of systems. In this context, self-adaptive systems may improve the solution. To properly accomplish the expected benefits from self-adaptation, we demonstrate how the reuse of an awareness catalog contributes to the derivation of modular software architecture. Our demonstration focus on a real self-adaptive system, which …", "num_citations": "3\n", "authors": ["1459"]}
{"title": "The prevalence of code over models: turning it around with transparency\n", "abstract": " Over the last ten years, there has been an increasing shift in software production from plandriven processes towards lean software processes. These lean processes are based either on agile strategies or in open source environments. One instance of this trend is the growing use of GitHub as a software construction platform. More and more, software developers are relying on text as representation and collaboration as a way of producing quality software. As such, the adoption of more abstract representations (model oriented), as the research community have been forecasting, is yet to happen. Taking a bias position, anchored on the concept of transparency as a quality, we look at the factors for the prevalence of code over models. We try to forecast possible ways to foster the use of models in software production. Our vision is based on bringing transparency to collaborative modeling.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "The clash between requirements volatility and software contracts\n", "abstract": " Acquisition of Information Technology (IT) by the Brazilian Federal Government is governed by law. In the specific case, the Law 8.666/1993 establishes the rules for such contracts, forcing their planning. The Requirements Engineering literature emphasizes evolution in definition process but this is often disregarded. Therefore, there is a clear conflict in requirements definition during the IT acquisition by current legislation. Defining requirements before software procurement is imposed by law and generates problems in contract management. This dichotomy among the volatility of requirements and legal rigidity in the procurement process had inspired an exploratory research with public organizations. Our research provides transparency in problems experienced by these agencies in IT procurement. We performed a preliminary analysis of these problems and pointed out possible solutions.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Existe uma Demanda de Transparência? Análise de comentários à Projetos de Lei\n", "abstract": " Em 2014, Engiel et al. verificaram manualmente a demanda por transparência no site Votenaweb para os projetos de lei no ano de 2013. Em 2016, Engiel et al. usaram técnicas de mineração, cobrindo os projetos de lei até aquela data (5011) com o mesmo objetivo. Foram encontrados 131 projetos de leis classificados nos 10+ votados e 10+ transparentes. Dos 10+ transparentes, esse trabalho minerou os comentários existentes no site para verificar o que a população estava falando e se existia alguma tendência ou demanda. Como resultado, 6 projetos de lei foram identificados por possuir comentários que demandam transparência. Uma análise qualitativa é apresentada sobre esses comentários.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Eliciting concepts from the Brazilian access law using a combined approach\n", "abstract": " Lately, organizations have been subject to regulation promoting information transparency; one example of this is the Brazilian Information Access Law. This paper presents a novel way of performing requirements elicitation using both the law and a Non-Functional Requirements Patterns catalog as the information sources. Since organizations must follow the law, its information systems must also implement the law as requirements. Our process is guided by pattern matching, text mining and grounded analysis. We examine the special case of the Brazilian Access Law using our approach, which compares a previously encoded transparency knowledge base with the law.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "A Evolução do Modelo de Maturidade em Transparência Organizacional\n", "abstract": " The concept of organizational transparency was built based on the relationship among other quality characteristics of organizational information (accessibility, usability, informative, understandability and auditability). From this conceptualization, an organizational transparency maturity model was designed. This model aims to guide an organization to implement transparency practices. The level 2 of this model already was built. For the subsequent levels, only their definitions were taken. This work aims to present the evolvement of this model since the publication of level 2.Resumo. O conceito de transparência organizacional foi construído com base no relacionamento com outras características de qualidade das informações organizacionais (acessibilidade, usabilidade, informativo, entendimento, e auditabilidade). A partir desta conceitualização, foi idealizado um modelo de maturidade de transparência organizacional. Este modelo tem como objetivo orientar uma organização na implementação das práticas de transparência. O detalhamento do nível 2 deste modelo já foi finalizado. Para os demais níveis, apenas sua definição foi feita. Este trabalho tem como objetivo apresentar as evoluções realizadas no modelo desde a publicação do nível 2.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Requirements Engineering with a Perspective of Software Evolution Anticipating requirements based on organizational change\n", "abstract": " Software Evolution is a fact in industrial life. More than that, maintenance is one of the most expensive phases on software life cycle. Additionally, social and organizational aspects are increasingly gaining greater importance for information systems development. In this context, Organizational Semiotics has been considered a promising tool, providing the framework MEASUR for requirements gathering. In this work, it has been studied how to apply Organizational Semiotics in Requirements Engineering with the purpose of Software Evolution.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Building Intentional Models Using the ERi* c Method\n", "abstract": " Requirements elicitation is the backbone of modeling. People aroundthe world do not give very much attention to early requirements elicitation andmore precisely to actors' goals elicitation before eliciting and modelingrequirements. This fault will incur in several losses either during thedevelopment, or worse, later. Goals {flexible (softgoals) and concrete} are thefoundation of GORE and consequently of i*. The ERi* c Method goalelicitation maturity was consolidated by its use in several academic projectsand can support not only to the entire requirements process, but also to reengineer, to change the model of a system, in order to include the use of newtechnology. This paper shows the strength of the ERi* c Method using as anexample a published i* SR model. It also focuses on how the ERi* c Methodcan split an SR model of an Information System into several comprehensiblemodels, applying the concept of SDsituations (Strategic Dependencysituations).", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Softwaretransparenz\n", "abstract": " Softwaretransparenz stellt eine neuartige und bedeutende Anforderung dar, mit der sich Softwareentwickler auseinandersetzen müssen. Der Beitrag liefert erste Untersuchungsergebnisse zur Problematik der Softwaretransparenz. Zur Definition des Transparenzbegriffs und zur Erfassung der Semantik von Softwaretransparenz wird ein SIG (Softgoal Interdependence Graph) genutzt, der in drei Versionen weiterentwickelt wurde. Anhand von drei Beispielsituationen wird die Anwendung des Transparenz-SIG demonstriert.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "AGFL-Agent Goals from Lexicon-Eliciting Multi-Agent Systems Intentionality.\n", "abstract": " 9AgentYOriented Software Methods9 deals with agents' goals, commitments, beliefs, and abilities, but very few of these methods properly deal with the elicitation of these concepts. We believe that to build a goal model, first of all, we must accurately elicit and work with goals in several levels. Our approach named AGFL±Agent Goals from Lexicon is an indirect inquire process that can recognize goals via a simple elicitation strategy. In order to support this activity we will develop a software tool integrated with C&L, a software tool for lexicons and scenarios management. We posit that our approach helps the elicitation process and helps the production of more solid ik models.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Perspectives on Software Requirements: An introduction\n", "abstract": " Requirements engineering is a young field. Nonetheless it is maturing very quickly. The first gathering of researchers to discuss the engineering of requirements did happen in 1993 with the IEEE International Symposium on Requirements Engineering. This meeting was important since for the first time requirements was seen as a frontier field in computer science, but with strong links to other sciences, as well. In particular, the community started to recognize the importance of elicitation [2] as something to be seen as research topic as well as the topics of modelling and analysis.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Requirements elicitation through scenarios–a hands-on tutorial\n", "abstract": " “The largest decision is the subdivision of the whole problem: it is the largest in scale, and the largest in its consequences. Yet the decision is taken first, when nothing is yet known and everything remains to be discovered: if it is wrong, most or even all the work that follows will be wrong or useless.” M. Jackson", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Eliciting business rules through iso 9000 documentation: A domain oriented conceptual model\n", "abstract": " Although business rules have been largely used in database modeling, very little can be found in requirements engineering literature. Many articles have been written about the use of business rules but only a few on how to elicit them. This article focuses on business rules as prescribed procedures that should be followed to achieve the business’s goals. Companies that are according to ISO 9000 standards have to maintain a set of documents describing the quality system that include policies, procedures and instructions to assure the final product’s conformance with ISO 9000 requirements. Partly for this reason, it is contended here that ISO 9000 standards and associated documents can be of a great help for business rules elicitation. This article aims at filling an important gap in business rules research. It details a conceptual model to elicit business rules using ISO 9000 documentation.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Reusing domains for the construction of reverse engineering tools\n", "abstract": " One of the challenges of reverse engineering is the extraction of a specification from source code. Our work proposes a singular approach to the construction of reverse engineering tools. Using a transformation based software machine we have built two languages designed to help the construction of reverse engineering tools. Each one of these languages embodies an important domain in reverse engineering. This approach is based on the idea that reuse in a high level of abstraction is possible, if a domain is written for a class of problems. This is the premise of the Draco paradigm, a reuse based strategy for software construction. We also demonstrate the use of these languages, by writing a reverse engineering tool that was able to derive a specification from a system built by others and of which we had no previous knowledge. This paper explains how we have built the languages and how they were reused for …", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Using ISO 9000 to elicit business rules\n", "abstract": " Business rules have been largely used in database modeling and more recently in the field of information technology, but rarely in requirements engineering. This article focuses on business rules as prescribed procedures that should be followed to achieve the business's goals. The ISO 9000 documentation includes policies, procedures and instructions to assure the final product's conformance with ISO 9000 requirements. Partly for this reason, it is contended that ISO 9000 standards and associated documents can be of a great help for business rule elicitation. The authors' main contribution is to propose a conceptual model for not only eliciting business rules, but also integrating them into a software requirements baseline model. This proposal uses ISO 9000 characteristics and integrates them with the idea of natural language-based requirements description.", "num_citations": "3\n", "authors": ["1459"]}
{"title": "Raciocinando sobre a propagação de impactos em mode-los de metas através de Redes de Petri\n", "abstract": " Tratar Requisitos Não Funcionais (RNFs) na concepção de um software é uma tarefa não trivial. O tratamento de RNFs é complexo na medida em que, além dos impactos nos requisitos funcionais, os RNFs podem estar interdependentes em diferentes situações. Analisar essa interdependência é muito importante para evitar retralho na construção de software. Essa classe de requisitos, RNFs, compreende as características de qualidade de uma aplicação. Isto implica que, ao tratar de requisitos subjetivos, precisamos do conceito de “satisfação a contento”. Modelos que reflitam o conhecimento, de forma concisa e clara, dessa subjetividade dos RNFs são necessários. Esses modelos devem ajudar o engenheiro de requisitos no tratamento desses requisitos, tanto nos impactos como nas interdependências. Esse tratamento, quando feito de maneira adequada é base para a tomada de decisões arquiteturais. Este artigo aborda o início de uma pesquisa sobre estratégias de análise da propagação de rótulos e o consequente impacto desses requisitos não funcionais, considerando o uso de catálogos de conhecimento do tipo SIG (“Softgoal Interdependency Graph”). Em particular, pretendemos investigar como o uso de Redes de Petri, pode ajudar no refinamento do grau de granularidade dos rótulos de um SIG, de forma a que a propagação de operacionalizações de RNFs sejam mais informativas.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Mapping Textual Scenarios to Analyzable Petri-Net Models\n", "abstract": " With the growing use of user-oriented perspectives at requirements engineering, transforming requirements models into executable models is considered to be significant. One of the key elements in this perspective is the notion of scenarios; scenarios are used to describe specific behaviors of the application through a flow of events based on user-perspective. Since scenarios are often stated in natural languages, they have the advantage to be easy to adopt, but the requirements can then hardly be processed for further purposes like analysis or test generation; partly because interactions among scenarios are rarely represented explicitly. In this work, we propose a transformation method that takes textual description of scenarios as input and generates an equivalent Petri-Net model as output. The resulting Petri-Net model can be further processed and analyzed using Petri-Net tools to verify model properties, to identify concurrency problems and to optimize the input and output models. Demonstration of the feasibility of the proposed method is based on two examples using a supporting tool.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Alinhamento de operacionalizações entre Transparência e MPS. BR\n", "abstract": " O MPS. BR é um modelo de maturidade projetado para a indústria de software brasileira, porém também utilizado em outros países. Com o objetivo de ampliar a excelência da qualidade de produção de software na indústria brasileira, o MPS. BR possui um conjunto de níveis bem definidos que estabelecem resultados de maturidade para uma organização de desenvolvimento de software. Por outro lado, a Transparência é uma demanda atual da sociedade. Como o software está fortemente entrelaçado às nossas atividades diárias, a transparência de software torna-se um desafio para os produtores de software. Entregar Transparência como um modelo de qualidade com atributos tem sido um esforço de pesquisas anteriores. Neste artigo, apresentamos a associação de um modelo de transparência com o modelo MPS. BR. Nosso objetivo é demonstrar a semelhança dos diferentes atributos de qualidade de ambos os modelo, proporcionando um mapa de como estes dois modelos se cruzam.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Representando o Conceito de Transparência Através de um Léxico Ampliado da Linguagem\n", "abstract": " The Language Extended Lexicon (LEL) is a representation approach to register context vocabulary, that is the vocabulary of a language spoken in a given context. The LEL register both the denotation, used in dictionaries, and the connotation, that is a contextualized meaning of the lexicon entry in the given context. The LEL should be written using the principle of circularity that is entries in the LEL should refer to each other thus forming a hypertext. Many researches use the LEL to anchor requirements modeling within a given context. This paper describes a transparency’s lexicon based in two seminal transparency books. The LEL was built using a collaboration techniques based on a collaborative model. We have also created a visualization tool giving more legibility to the LEL lexicons’s. The visualization tool also contributes to publicize the transparency’s lexicon for citizens.Resumo. O Léxico Ampliado da Linguagem (LAL) é uma representação proposta para registrar o vocabulário de um contexto, estendendo o conceito de dicionário denotacional para um léxico com denotações, conotações e referências a outras palavras do léxico permitindo a circularidade. É uma linguagem utilizada por várias pesquisas para ancorar a modelagem de requisitos na linguagem corrente do contexto. Esse artigo descreve o léxico de transparência que foi baseado em dois livros clássicos sobre o tema. Diferentes técnicas de colaboração foram mapeadas e utilizadas em modelos colaborativos. Nessa proposta, foi criada uma ferramenta de visualização de forma a melhorar a legibilidade de léxicos. O visualizador também contribui para a divulgação do …", "num_citations": "2\n", "authors": ["1459"]}
{"title": "From Unknown to Known Impacts of Organizational Changes on Socio-technical Systems.\n", "abstract": " Keeping organizations and their Socio-technical System (STS) aligned over time is a complex endeavour. We believe understanding the organizational dynamics of changes, and of the impacts these changes will have, can support the evolution of STSs. Reasoning on the organizational changes in advance also supports the development of an STS more likely to be aligned to the dynamics of the organization. This work presents the design and the application of a Dynamic Organizational Framework (DOF), constituted of a dynamic organizational model (DOM) on which to base the reasoning, a database of questions (DBQ) to explore possible organizational impacts, and a method to reason on changes and impacts within goal models. We apply this framework to analyse the impacts of the introduction of a system into the customers’ attendance process in a Post Office in London. First results show contributions towards to the awareness about the organization, and to the quality and accuracy of requirements.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "O Processo de Construção de Léxico Ampliado da Linguagem para a Transparência\n", "abstract": " Atualmente existe uma grande demanda para que empresas, principalmente públicas, disponibilizem determinadas informações, ou seja, tornemse transparentes para a sociedade. Este trabalho apresenta um processo de criação de um Léxico Ampliado da Linguagem (LAL) sobre Transparência, Este Léxico foi modelado a partir da discussão de dois livros de autores com perfis distintos, um com características sócio históricas e outro com a preocupação mais voltada ao governo e à legislação. A partir deste LAL pretende-se elaborar uma ontologia sobre Transparência.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "A Social Interaction Based Pre-Traceability for i* Models\n", "abstract": " There is a lack of work focusing on i* models pre-traceability. Most of traceability work on i* models is centered on forward or backward traceability, ie, tracing i* models to design models or design models to i* models. It seems that the stakeholders' needs and the organizational process are first-class citizens, but the requirements engineering process is not. We present in this paper our approach to i* models pre-traceability, which focuses on tracing the requirements engineering process (designing the design). Using ITrace models, our approach focuses on the requirements process. Our approach is based on argumentation graphs to trace stakeholders' arguments on social interactions, as these arguments justify what is represented on i* models.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Atribuição de Responsabilidade aos Gestores em Processos de Negócio Transversais\n", "abstract": " In the area of Business Process Management (BPM), the responsibility for processes is traditionally attributed to a particular manager. In AO-BPM (Aspect-Oriented Business Process Modeling), as the models of business processes consist of core processes and aspect processes, it is necessary to identify responsibilities for each type of process. This paper presents proposals for allocating responsibility for the aspectual processes.Resumo. Na área de Gestão de Processos de Negócio (BPM), a responsabilidade por processos é tradicionalmente atribuída a um determinado gestor. Na AO-BPM (Aspect-Oriented Business Process Modeling), como os modelos de processos de negócio são compostos por processos base e processos aspectuais, faz-se necessário identificar responsabilidades para cada um destes tipos de processo. Este artigo apresenta propostas para atribuição de responsabilidade para os processos aspectuais.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Meta-modelo para el Análisis de Variabilidad Guiado por Metas\n", "abstract": " Durante los últimos años ha aumentado el interés sobre la variabilidad de los sistemas software. Este interés se debe a varios factores: por un lado, los sistemas software tienden a integrar una funcionalidad cada vez mayor, debido por la necesidad de ofrecer aplicaciones con un mayor valor añadido frente a los competidores. Esta mayor funcionalidad permite una mayor flexibilidad a los usuarios, pero también puede producir una sobrecarga sobre los usuarios con un gran número de funcionalidades que nunca van a utilizar.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Sistemas de Informação Globalizados: Desafios Culturais\n", "abstract": " Algumas organizações estão e estarão, cada vez mais, negociando fora do seu espaço nacional. Esse fato torna fundamental a disponibilidade de informações de qualidade para o mercado global, e faz com que os sistemas de informação precisem estar adequados para lidar com as diferenças culturais entre os vários países. A importância da informação e o processo de globalização são um dos fatores responsáveis pelo crescimento constante do mercado de tecnologia da informação e do uso da Internet. Qualquer sistema de informação é um produto e, como tal, ao ser lançado em um mercado internacional, passa a ser utilizado por novos usuários com diferentes culturas, e conseqüentemente e passa a ter novos requisitos. Deve, portanto, passar por processos de internacionalização e localização. O presente trabalho trata dos requisitos não-funcionais de usabilidade, mas com a atenção centrada em …", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Module interconnection features in object-oriented development tools\n", "abstract": " The black-box reuse of library classes in the construction of an object-oriented (OO) application is difficult: the principle of information hiding may be violated if classes must know their partners, and code must be typically rewritten. One of the possible ways to increase class decoupling and thus reuse is to employ interconnection languages to describe OO architectures. In this paper we present a decoupling paradigm for individual classes or class collections that facilitates reuse, introducing interconnection features at the design and programming levels. We give examples in a new, second generation OO development system, using asynchronous messages sent to generically identified receivers.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "A Case Study on Requirements Recovery from Structured Specifications\n", "abstract": " Requirements recovery is a process to produce software requirements from specifications. In order to test a proposed method for requirements recovery we conducted an experience involving six systems analysts and ten structured analysis specifications. The data already available shows several aspects of both the specifications and the recovered requirements. We include the raw data in this report.", "num_citations": "2\n", "authors": ["1459"]}
{"title": "Using Colorimetric Concepts for the Evaluation of Goal Models\n", "abstract": " Goal-oriented models have become important tools for the analysis of non-functional requirements (NFRs). However, the treatment of NFRs is a non-trivial task, considering that this class of requirements covers quality characteristics. This implies that when dealing with subjective requirements, we need to focus on mechanisms that can enrich the semantics of their representation. This is the case of assigning and propagating labels in the evaluation of goal-oriented models. The definition of labels on existing models has low granularity and often fails to reflect the full in-formational potential that this type of artifact could offer. This is the case of the NFR Framework. Propagation in the model is bot-tom-up and understanding about the degree of satisficing a goal becomes difficult. This paper explores a rationale to increase the informative power of the labels assigned to the goals, using the concepts of colorimetry in the …", "num_citations": "1\n", "authors": ["1459"]}
{"title": "A Critical View Over iStar Visual Constructs\n", "abstract": " The impact of the iStar (i*) on the requirements engineering community is corroborated by the large amount of research that cites, analyzes, and/or uses this modeling language. Since the creation of iStar, researchers have been using/evolving this language in different ways. Considering that iStar is strongly based on the use of graphic forms, it is important to pay special attention to the notation of its elements. This paper proposes a reflection over the modifications suggested for the graphical notation of iStar, based on the Physics of Notations. Our goal is to discuss the possible impacts of these suggestions, stressing some of its disadvantages.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Challenges in Modeling Non-Functional Requirements Collaboratively\n", "abstract": " Modeling Non-Functional Requirements (NFRs) is a challenge, mainly from the subjective character of their elicitation. Modeling NFRs as a collaborative process may create a consensus among stakeholders, combining modeling and elicitation in a learning cycle. However, the collaboration presents challenges, such as the different viewpoints, the influence of creativity, the modeling tool, the domain/scope of the target software system, and the fundamental aspects of configuration management. This paper reports our observations on collaboratively modeling an intentional model for the handling of fruits and vegetables in a futuristic kitchen.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Negotiation-Collaboration for Quality of Quality Requirements\n", "abstract": " In general, Non-Functional Requirements (NFRs) are handled during activities related to software architecture, and often also in implementation. This results in higher costs and low quality softwares. This work studies mechanisms to promote the NFRs from the understanding of human relationships occurring in the collaborative dynamics, permeated by negotiations during the requirements construction activities. A collaborative strategy for the construction of NFRs and their computational support are proposed. To evaluate this research, a qualitative experiment will be carried out in a real organization, in the Telecommunication area.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Relacionando requisitos de software e competências de recursos humanos através de modelos organizacionais: uma abordagem visando o alinhamento organizacional\n", "abstract": " O alinhamento organizacional é uma qualidade relacionada ao desempenho organizacional. Muitas ações são implementadas para auxiliar no alinhamento, especialmente quando voltado para o alcance de estratégias, entretanto, alcançá-lo prossegue sendo uma tarefa difícil. Os recursos humanos, por serem componentes transversais em uma organização, são elementos chave para o sucesso do alinhamento porque atuam em tarefas e tomam decisões importantes para a organização. Por sua vez, a TI oferece suporte computacional para a realização de processos. Portanto há uma intercessão entre estas áreas nas tarefas cotidianas e seu alinhamento pode ser benéfico quando orientados para os objetivos da organização. As organizações possuem requisitos que podem ser satisfeitos por pessoas e/ou tecnologia. As falhas de alinhamento na estrutura de RH podem ser mitigadas pela TI ampliando as possibilidades de sucesso da organização. Neste artigo, investigamos as relações entre requisitos humanos e de software para melhor prospectar as formas de alinhamento das duas áreas. Para isso, elicitamos requisitos de software usando como insumo um exemplo de modelo organizacional, incrementado com a modelagem de competências humanas que são requeridas aos atores organizacionais. Posteriormente cruzamos as informações de competências humanas com os requisitos de software para identificar e avaliar as correlações visando encontrar elementos relevantes para auxiliar na decisão em ações de TI e de RH.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Relacionando requisitos de software e competências de recursos humanos através de modelos organizacionais\n", "abstract": " Business process models can be used as input for eliciting software requirements. One of the motivations for using these models is the search for alignment between IT and the organization, considering that they more faithfully represent the flow of tasks and information in an organization. However, business process models are insufficient in representing the complex organizational environment. Organizational modeling can integrate elements from different areas in order to enable deeper analysis of the interaction of modeled concepts aiming, for example, to favor organizational alignment. The GPI (Goal, Process, Indicators) language has been developed in this sense, adding specific Human Resources domain concepts to allow modeling and evaluation of its alignment. The objective of this paper is to analyze the potential of this information present in organizational models as an input for requirements elicitation. To do this we map human competency information with potential software requirements extracted from organizational models. The relationships between human competencies and software requirements prove to be relevant and useful to assist in organizational decision making involving software projects.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Aplicando Transparência no Domínio de Informação Sobre Saúde na Internet: Uma Abordagem Visando o Cidadão\n", "abstract": " A internet renovou a forma como a comunicação e o acesso às informações de saúde são feitos. Porém, a internet está sujeita a dificuldades referentes à busca e qualidade da informação sobre saúde. A Transparência é uma demanda atual da sociedade, e o fornecimento de informações de saúde mais transparentes vai de encontro às tecnologias como a internet como um item de qualidade. O problema abordado neste trabalho está relacionado com a busca e com o acesso a informação de boa qualidade em saúde disponível na internet. Afim de tratar esta questão, uma abordagem baseada na identificação, seleção e consolidação de informações foi proposta. Tal abordagem culminou no desenvolvimento de um protótipo, que foi utilizado em uma avaliação preliminar, cujos resultados são descritos.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Tornando a Legislação Transparente para o Engenheiro de Requisitos\n", "abstract": " Laws and regulations impact the design of software systems, as they may introduce additional requirements and possible conflicts. Laws are inherently voluminous, consisting of hundreds of pages of text and written in legal language 1, being difficult to the requirement engineering to understand what is written. This research proposes a process that aims to help to turn transparent the regulatory requirements to the requirement engineering. With more transparent legal requirements, it will be easy to develop complaint software.Resumo. Leis e regularizações impactam o projeto de sistemas de informação, uma vez que estas podem introduzir novos requisitos e possíveis conflitos. Leis são volumosas, consistem em centenas de páginas de texto escritas em linguagem legal, sendo difícil para o engenheiro de requisitos o seu entendimento. Este trabalho propõe um processo que ajuda a tornar os requisitos regulatórios mais transparentes para o engenheiro de requisitos contribuindo para o desenvolvimento de um software em conformidade com a legislação.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Mineração de informações no Ecossistema Github para apoiar à Elicitação de Requisitos\n", "abstract": " This paper describes the work in progress for mining texts in the development ecosystem GitHub. It is explained how the content from similar projects can be useful for reuse and thus assist in the tasks of requirements elicitation. Text-mining techniques and GitHub's metadata are the methods used to select relevant projects and the texts within them. An approach to achieve our proposal is explained and initial results are reported.Resumo. Este artigo descreve o trabalho em andamento para a mineração de textos no ecossistema de desenvolvimento GitHub. É explicado como o conteúdo de projetos semelhantes podem ser úteis para a reutilização e, assim, ajudar nas tarefas de elicitação de requisitos. Técnicas de mineração de textos e metadados de GitHub são os métodos utilizados para selecionar projetos relevantes e os textos dentro deles. Uma abordagem para atingir nossa meta é explicada, bem como descrevemos os resultados alcançados até aqui.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Implementing GPI, a language for Organizational Alignment\n", "abstract": " Organizational alignment aims to align strategic, tactical and operational decision levels in a given organization. The traditional operational view, focused on processes, produces gaps between strategic and operational layers. As such, many tools and techniques were developed giving more focus on one of the layers failing to promote their integration. In our current research, we are trying to identify ways to better represent organizational alignment, for an improved organizational analysis. Following in this direction, we integrated a process and a goal modeling notations (BPMN and i*) and inserted metric oriented elements, generating the GPI (Goal, Process and Indicators) language. Then a tool was created by reusing the Oryx architecture. This paper briefly present the GPI language, details its implementation in the Oryx editor and reports on ongoing research on alignment based on this infrastructure.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Extração de casos de teste a partir de modelos de processos de negócio\n", "abstract": " A modelagem de processos de negócio é um recurso que vem sendo empregado com diversas finalidades, entre as quais, planejamento e alinhamento estratégico. Na engenharia de requisitos, os modelos de processos de negócio também são utilizados como insumos na extração de requisitos de software, os quais deverão ser utilizados com base para testes posteriores. Neste sentido, propomos um método de extração de suítes de testes a partir de modelos de processo de negócio. A identificação dos casos de testes é baseada na junção de heurísticas de identificação de requisitos e novas heurísticas inspiradas em métodos de geração de casos de testes a partir de casos de uso e diagrama de estados. O produto é uma suíte de casos de teste definida ainda nas fases iniciais do desenvolvimento, com base em informações de contexto.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "The Experience of Using ERi* c in a Telecom Corporation\n", "abstract": " Intentional Requirements Engineering (ERi* c–Engenharia de Requisitos Intencional) is a method that produces i* models. It is a six steps interactive process that uses the notion of “Strategic Dependency Situations” a modularization strategy applied to situations of an organization. ERi* c uses an elicitation strategy that mines goals from the description of the context vocabulary. This paper reports on its use in the context of Investment Contracts-of a Telecom Company. The experience of using ERi* c served as basis for the dissertation of one student at UERJ (State University of Rio de Janeiro). A summary of the method application is provided as well as the final remarks on the effects of the modeling experience. Although not institutionalized in the company, the process used in the modeling experience did enact changes on important decision processes.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Aspect-Oriented Goal Modeling and Composition with AOV-Graph\n", "abstract": " As software complexity increases, so does the difficulty of manipulating its models. More complex models make it more difficult to define the impact of changes, to modify the models, or to reuse model parts in other projects. Part of the problem is that concerns are strongly interconnected. Traditional modularization minimizes this coupling. However, mostly, it considers only one dimension in software artifacts (for instance classes or functions). Therefore, the concerns in other dimensions are scattered and tangled, i.e., crosscutting. This chapter reports on the application of goals and aspect-oriented concepts in requirements modeling. Firstly, AOV-graph and its mechanisms to separation, composition, and visualization of crosscutting concerns are presented and after that, we discuss AOV-graph in the context of the Crisis Management case study.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Reasoning about dynamic aspectual requirements\n", "abstract": " Aspect-oriented requirements modelling separates the early crosscutting concerns as quality requirements such that one can reason about such requirements without cluttering with another. In this chapter, we propose a step further to reason about the dynamic goal models while the separated aspectual requirements are also dynamic. The key to this step is a list of change propagation rules for the goal models such that it is possible to reuse as much previous reasoning results as possible. To demonstrate, we use the Crisis Management System case study to indicate the application of these rules.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Um processo para construção de software mais transparente\n", "abstract": " À medida que o software está cada vez mais presente em nossas vidas, se tornando parte de nosso cotidiano, a sociedade também exigirá sua transparência. Cabe, portanto à engenharia de software, como disciplina, propor métodos e ferramentas para apoiar esta nova demanda. Um software é transparente quando manipula informações transparentes e informa sobre si mesmo, como funciona, o que faz e porque o faz. Devido à complexidade deste novo requisito, ele foi entendido como um conjunto de qualidades que contribuem individualmente para transparência. Neste trabalho, procuramos abordar o requisito de transparência sob a ótica da simbiose entre modelos de requisitos e artefatos de arquitetura e código, com o objetivo de abranger um maior conjunto das qualidades exigidas para tornar o software transparente.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "O Método de Inspeção Semiótica Aplicado ao Requisito Usabilidade.\n", "abstract": " O requisito usabilidade é de suma importância para os artefatos de software principalmente na área de jogos computacionais, pois permite medir a capacidade de uso de um artefato de software. Classifica-se esse requisito como um requisito de qualidade ou Requisito Não-Funcional (RNFF). Nosso trabalho centra-se na operacionalização do requisito usabilidade no contexto de um jogo educacional usando o Método de Inspeção Semiótica (MIS), oriundo da área de Interação Humano--Computador (IHC). O SimulES-W é a primeira versão digital do jogo SimulES usado para o ensino da engenharia de software de forma lúdica e colaborativa entre os jogadores.Abstract. The usability requirement is extremely important to software artifacts especially in the area of computer games. This requirement can be classified as a quality or a nonfunctional requirement. Our work focuses on the operationalization of usability in the context of an educational game using the Semiotics Inspection method from the area of Human--Computer Interaction. SimulES-W is the first digital version of the game SimulES aiming at teaching software engineering in a fun and collaborative way.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Modelagem Intencional de Requisitos de Segurança.\n", "abstract": " Adding security requirements to software architectures after they are built is hard and error prone. Security concepts must be an issue on the entire software development process, from requirement engineering to deployment, passing by design, coding and test. This work presents a process to security requirements modeling based on i*.Resumo. Adicionar requisitos de segurança às arquiteturas de software após elas terem sido construídas é uma tarefa bastante difícil. Conceitos de segurança devem permear todo o ciclo de desenvolvimento do software, desde a engenharia de requisitos, passando por desenho (design), implementação, testes e distribuição. Este trabalho apresenta um processo para modelagem de requisitos de segurança baseado em i*.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Understanding the Word “Analysis” in the Context of Requirements Engineering\n", "abstract": " I have been teaching, in reality, preaching, the importance of a clear understanding for the word “analysis”. It is my conclusion, after years of exposure to the term “system analysis”, that it has mislead lots of young people how wishes to understand the process of software construction, in special the initial steps of the process. My main point is that you can only analyze something that you know. However, educators in the areas of information systems and software engineering always focused the “system analysis” as a modeling discipline, where specifications were written and formalization was sought at the very early stages of conceptions of a system. Based on this bias on modeling, analysis was a way of enforcing syntax rules of a given modeling language, which provide ways of applying verification protocols. As such, not enough emphasis was directed to the goal of really understanding the concepts involved and the needs of the clients.  (Párrafo extraído del texto a modo de resumen)", "num_citations": "1\n", "authors": ["1459"]}
{"title": "C&L: Uma ferramenta de edição e visualização de cenários e léxicos\n", "abstract": " Este artigo apresenta a ferramenta C&L, que implementa um ambiente colaborativo para auxílio à edição de cenários e léxicos. Com o C&L é possível descrever resultados de tarefas de elícitação de requisitos. Esta ferramenta baseia-se em uma representação que, ao mesmo tempo em que facilita a compreensão através da utilização de linguagem natural, força a organização da informação através de uma estrutura bem definida. A ferramenta foi criada nos moldes da filosofia de desenvolvimento de software livre e tem como público alvo o engenheiro de software, estudantes e interessados na área de requisitos.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Domain networks in the software development process\n", "abstract": " Domain Network (DN) is a set of domains interconnected by transformations. A previous implementation of this concept has been done by using the Draco-Puc machine, a software system that provides a very powerful transformation engine. In order to obtain the integration of this DN with approaches that use XML related technologies, we present a new DN implementation that allows an XML application to become a Draco-Puc domain. We believe that in this way we can use the power of Draco-Puc and gain a broadly use of DN by enabling the use of XML applications.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "Scenario-based software process\n", "abstract": " Scenarios are becoming ubiquitous artefacts in software development. Many researchers view scenarios as the product of the collaboration among developers and users during the requirements definition stage. We believe scenarios should be used in a wider scope, covering the whole development process. In this light, scenarios would be produced at different stages and, like other artefacts, would be in constant evolution. In order to support the scenario evolutionary process and aid the migration between stages, springs the need for a scenario-based software process. Recent research evidenced that the process dimension of scenarios is seldom considered in the literature. In this paper we propose a scenario-based process framework to support the evolution of scenarios. The framework relies on a set of scenario operations/relationships described previously and incorporates configuration management …", "num_citations": "1\n", "authors": ["1459"]}
{"title": "From application domains to executable domains: Achieving reuse with a Domain Network\n", "abstract": " Software generators are among the most effective methods for achieving software reuse. Describing an application using a domain specific language and then performing a single refinement step to an executable language is the approach used by most generators. This paper shows how to use the Domain Network (DN) concept, a set of interconnected domains, as a way to improve reuse in the context of software generation.", "num_citations": "1\n", "authors": ["1459"]}
{"title": "International workshop on software transformation systems\n", "abstract": " Automated support for the structural and semantic manipulation of software leads to higher levels of quality and productivity in software. To that end, researchers have been trying to merge symbolic manipulation techniques with compiler technologies to produce sojhvare transformation systems, or more concisely, trans $ ormation vstems.Transformation systems are language-oriented environments allowing the specification of problems in domain-specific terms, or low or high level specification and the de&&ion of sets of manipulation operators (ie, transformations) that can be applied to these components. A target program specification, constructed by composing spec-tication fragments, is given to the transformation system. Guided by design plans and strategies, a transformation engine-the kernel of the transformation system-is responsible for applying the manipulation operators to the target program specification …", "num_citations": "1\n", "authors": ["1459"]}