{"title": "Modelling concurrent interactions\n", "abstract": " In UML 2.0 sequence diagrams have been considerably extended but their expressiveness and semantics remains problematic in several ways. In other work we have shown how sequence diagrams combined with an OCL liveness template gives us a much richer language for inter-object behaviour specification. In this paper, we give a semantics of these enriched diagrams using labelled event structures. Further, we show how sequence diagrams can be embedded into a true-concurrent two-level logic interpreted over labelled event structures. The top level logic, called communication logic, is used to describe inter-object specification, whereas the lower level logic, called home logic, describes intra-object behaviour. An interesting consequence of using this logic relates to how state-based behaviour can be synthesised from inter-object specifications. Plans of extending the Edinburgh Concurrency Workbench …", "num_citations": "80\n", "authors": ["604"]}
{"title": "Enriching OCL using observational mu-calculus\n", "abstract": " The Object Constraint Language is a textual specification language which forms part of the Unified Modelling Language[8]. Its principal uses are specifying constraints such as well-formedness conditions (e.g. in the definition of UML itself) and specifying contracts between parts of a system being modelled in UML. Focusing on the latter, we propose a systematic way to extend OCL with temporal constructs in order to express richer contracts. Our approach is based on observational mu-calculus, a two-level temporal logic in which temporal features at the higher level interact cleanly with a domain specific logic at the lower level. Using OCL as the lower level logic, we achieve much improved expressiveness in a modular way. We present a unified view of invariants and pre/post conditions, and we show how the framework can be used to permit the specification of liveness properties.", "num_citations": "77\n", "authors": ["604"]}
{"title": "Formalizing liveness-enriched sequence diagrams using ASMs\n", "abstract": " In UML 2.0 sequence diagrams have been considerably extended, influenced by Live Sequence Charts (LSCs), a very expressive extension of Message Sequence Charts (MSC) with liveness. Nonetheless, fundamental liveness properties can still not be expressed in the new sequence diagrams. In recent work, we have proposed to solve this by enriching sequence diagrams with a simple but powerful Object Constraint Language (OCL) template for liveness. In this paper, we show how to formalize our liveness-enriched sequence diagrams using Abstract State Machines.               Sequence diagrams still have several open problems. For example, the semantics of some of the newly introduced operators is ambiguous, and it is not clear how they can be used or combined with other operators. We address some of these issues in the paper.               Finally, a further advantage of using ASMs as a semantic …", "num_citations": "35\n", "authors": ["604"]}
{"title": "The Troll Approach to Conceptual Modelling: Syntax, Semantics, and Tools\n", "abstract": " In this paper, we present the use of Troll for the conceptual modelling of distributed information systems. Troll offers both textual and graphical notations. Troll has been used in practice to model an industrial information system. We use an extract of this case study to describe briefly the syntax and underlying semantics of the language. We also show a set of software tools that are being developed to support the modelling with Troll. These tools include editors, checkers as well as an animator for validating Troll specifications. We report on the experiences we gained by applying the language to the industrial project. Finally, a short description on further work is given.", "num_citations": "34\n", "authors": ["604"]}
{"title": "Our data, our society, our health: A vision for inclusive and transparent health data science in the United Kingdom and beyond\n", "abstract": " The last 6 years have seen sustained investment in health data science in the United Kingdom and beyond, which should result in a data science community that is inclusive of all stakeholders, working together to use data to benefit society through the improvement of public health and well‐being. However, opportunities made possible through the innovative use of data are still not being fully realised, resulting in research inefficiencies and avoidable health harms. In this paper, we identify the most important barriers to achieving higher productivity in health data science. We then draw on previous research, domain expertise, and theory to outline how to go about overcoming these barriers, applying our core values of inclusivity and transparency. We believe a step change can be achieved through meaningful stakeholder involvement at every stage of research planning, design, and execution and team‐based data …", "num_citations": "33\n", "authors": ["604"]}
{"title": "Combining sequence diagrams and OCL for liveness\n", "abstract": " Sequence diagrams in UML 2.0 have been considerably extended, partially influenced by variants of Message Sequence Charts (MSCs) and Live Sequence Charts (LSCs). However, sequence diagrams cannot satisfactorily express liveness/progress properties or differentiate between necessary and possible behaviour. To address this limitation, we propose to use an OCL template for liveness and enrich sequence diagrams with constraints as needed. We argue that our extended sequence diagrams are more expressive than LSCs. Further, if automatic code generation from inter-object behaviour specifications is feasible it will lead to more realistic solutions.Additionally, we discuss several problems and ambiguities in sequence diagrams as defined in the UML 2.0 superstructure specification. We discuss directions for future work.", "num_citations": "30\n", "authors": ["604"]}
{"title": "Formal transformation from sequence diagrams to coloured petri nets\n", "abstract": " In this paper we define a formal strongly consistent transformation from UML2 sequence diagrams to coloured Petri nets (CPNs). We define the language of sequence diagrams (set of legal traces) and show how this is mapped onto an equivalent language of CPNs through formal transformation rules. The rules defined can be extended to consider modelling aspects such as stochastic and real-time behaviour. This work is part of a more general framework based on model driven transformations to validate UML models using Petri nets, and hence exploit existing Petri net analysis and verification tools for UML-based design.", "num_citations": "29\n", "authors": ["604"]}
{"title": "Fundamentals of a module logic for distributed object systems\n", "abstract": " Our general goal is to provide a semantic foundation for the specification of concurrent and distributed object systems. We use Troll, a formal object-oriented language, for system specification. It is now widely accepted that object classes are unsuitable modularisation units when it comes to dealing with very large systems. An intermediate concept between the system and the objects is needed for allowing reusability of specifications and providing a clearer system structure. Enriching Troll with a module concept forces us to develop new theoretical constructs ensuring an appropriate underpinning of the language. We propose a module logic Mdtl for specifying and reasoning about the dynamic aspects of distributed and modular object systems. The main features of the logic include the ability to express module interaction and internal module concurrency. In this paper, we present the syntax and model-theoretic semantics of the module logic Mdtl. The logic is illustrated and...", "num_citations": "28\n", "authors": ["604"]}
{"title": "A logic-based formalization for component specification\n", "abstract": " We consider a component-based approach to modelling complex systems using UML. We describe how component concepts at a specification level (interfaces, components, architectures) can be formalized in a uniform way using a distributed logical framework. In the logic Mdtl, each component has associated to it a local logic consisting of a home logic and a communication logic. Component contracts are captured by formulae in Mdtl. In particular, a clear distinction between usage and realization contracts is made: the former is captured as formulae in the home logic of the interface specification, whilst the latter is expressed by formulae in the communication logic of the component specification. Moreover, we are investigating an extension of the framework for expressing dependability requirements.", "num_citations": "27\n", "authors": ["604"]}
{"title": "A formal model for integrating multiple views\n", "abstract": " In this paper we show how to use labelled event structures as a unique mathematical representation for design models consisting of different UML 2.0 diagrams/notation. Each diagram is used to capture a particular aspect or view of the system including structural and behavioural aspects. Our approach enables the analysis of complex systems designed in a combination of UML 2.0 notation, and serves as a means to detect inconsistencies in design.", "num_citations": "26\n", "authors": ["604"]}
{"title": "Decomposing interactions\n", "abstract": " In UML 2.0 sequence diagrams have been considerably extended and are now fundamentally better structured. Interactions in sequence diagrams can be structured using so-called interaction fragments, including alt (alternative behaviour), par (parallel behaviour), neg (forbidden behaviour), assert (mandatory behaviour) and ref (reference another diagram). The operator ref in particular greatly improves the way diagrams can be decomposed. In previous work we have given a semantics to a subset of sequence diagrams using labelled event structures, a true-concurrent model that naturally captures alternative and parallel behaviour. In this paper, we expand that work to address refinement and show how to obtain a refined model by means of a powerful categorical construction over two categories of labelled event structures. The underlying motivation for this work is reasoning and verification of complex …", "num_citations": "25\n", "authors": ["604"]}
{"title": "General discussion\n", "abstract": " Dr. DN L. McGown (University of Nottingham) said: It appears from table 2a of Romo’s paper that the potential energy barriers to coagulation for alumina dispersions are high enough on either side of the zero point of charge to provide considerable stabilization. For this reason the form expected for the curves in fig. 1 is not merely a slight break at the ZPC but a pronounced minimum. That such a result was not obtained indicates that water is having a more profound effect on stability than is reflected in the zeta potential. Extension of the work that Parfitt and I reported in our paper leads one to a similar conclusion. The deviations we mentioned, which occur above a water content of 60 ppm at constant surfactant concentration, take the form of a maximum in zeta potential at about 100 ppm of water 1 followed by a steady decrease to very low potential at about 300 ppm, which is not seen in the stability ratio. The stability …", "num_citations": "25\n", "authors": ["604"]}
{"title": "Optimizing protocol rewrite rules of CIL specifications\n", "abstract": " For purposes of security analysis, cryptographic protocols can be translated from a high-level message-list language such as CAPSL into a multiset rewriting (MSR) rule language such as CIL. The natural translation creates two rules per message or computational action. We show how to optimize the natural rule set by about 50% into a form similar to the result of hand encoding, and prove that the transformation is sound because it is attack-preserving, and unique because it is terminating and confluent. The optimization has been implemented in Java.", "num_citations": "23\n", "authors": ["604"]}
{"title": "From interaction overview diagrams to pepa nets\n", "abstract": " In this paper we show how to model mobility and performance information at the design level using UML 2.0 notation, namely interaction overview diagrams (IODs)[3]. IODs are a highlevel structuring mechanism for sequence diagrams and a special kind of activity diagram (AD). Whilst ADs have been used to model mobility, they are not adequate to capture at the same time the structure of the system (locations), how objects move between locations, and how objects behave/interact within locations. By contrast, this is possible using IODs. An IOD allows us to describe a mobile system at two levels. The higher level describes the locations of the system and how objects move between locations. The lower level describes how objects behave and interact locally and is given by the individual nodes of the IOD, namely sequence diagrams. Both levels are enriched with performance related information (ie, activities). Furthermore, our approach of using IODs for modelling interactions and mobility enhanced with performance information offers a novel and natural UML counterpart for PEPA nets [1], a performance modelling language which consists of a restriction of Petri nets where tokens are terms in a stochastic process algebra PEPA [2]. We describe the formal translation of IODs into PEPA nets. Essentially, the structure given by the IOD corresponds to the high level net structure of the PEPA net, and the behaviour described in the IOD nodes (sequence diagrams) can be translated onto PEPA terms. Our translation allows a designer using UML 2.0 to model and analyse his/her models formally using the underlying tools available for PEPA nets.The …", "num_citations": "21\n", "authors": ["604"]}
{"title": "A logical approach for behavioural composition of scenario-based models\n", "abstract": " As modern systems become more complex, design approaches model different aspects of the system separately. When considering (intra and inter) system interactions, it is usual to model individual scenarios using UML’s sequence diagrams. Given a set of scenarios we then need to check whether these are consistent and can be combined for a better understanding of the overall behaviour. This paper addresses this by presenting a novel formal technique for composing behavioural models at the metamodel level through exact metamodel restriction (EMR). In our approach a sequence diagram can be completely described by a set of logical constraints at the metamodel level. When composing sequence diagrams we take the union of the sets of logical constraints for each diagram and additional behavioural constraints that describe the matching composition glue. A formal semantics for composition in …", "num_citations": "16\n", "authors": ["604"]}
{"title": "Avoiding medication conflicts for patients with multimorbidities\n", "abstract": " Clinical pathways are care plans which detail essential steps in the care of patients with a specific clinical problem, usually a chronic disease. A pathway includes recommendations of medications prescribed at different stages of the care plan. For patients with three or more chronic diseases (known as multimorbidities) the multiple pathways have to be applied together. One common problem for such patients is the adverse interaction between medications given for different diseases. This paper proposes a solution for avoiding medication conflicts for patients with multimorbidities through the use of formal methods. We introduce the notion of a pharmaceutical graph to capture the medications associated to different stages of a pathway. We then explore the use of an optimising SMT solver (Z3) to quickly find the set of medications with the minimal number and severity of conflicts which is assumed to be the …", "num_citations": "14\n", "authors": ["604"]}
{"title": "Formal specification of Catalysis frameworks\n", "abstract": " Frameworks are increasingly being recognised as very useful components in the emerging paradigm of component-based software development (CBD). They are widely accepted as better units of reuse than objects. The CBD methodology Catalysis, for instance, uses frameworks. However, at present, Catalysis frameworks are described only informally, which means we cannot reason formally about frameworks, in particular their composition, and thereby their reuse. For this, we would need to specify frameworks (and their composition) formally. In this paper, we describe our approach for doing so.", "num_citations": "14\n", "authors": ["604"]}
{"title": "Foundations of a module concept for distributed object systems\n", "abstract": " This thesis provides a logical and mathematical foundation for object-oriented specification languages with a further modularisation unit between the system and object classes. The unit is denoted object-oriented module, or module for short, and initially described in an informal way. Modules offer a better approach to reusability and provide better structuring of large, complex and distributed systems.In our approach, systems and single modules are represented by theory presentations in a module logic. These presentations, also called module specifications, are pairs consisting of a module signature and a set of module axioms. The axioms are formulae in a newly developed module logic Mdtl (Module Distributed Temporal Logic). This is a true-concurrent branchingtime discrete distributed first-order temporal logic that is interpreted over labelled event structures.", "num_citations": "14\n", "authors": ["604"]}
{"title": "Concurrent logic and automata combined: A semantics for components\n", "abstract": " In this paper, we describe a true-concurrent hierarchical logic interpreted over concurrent automata. Concurrent automata constitute a special kind of asynchronous transition system (ATS) used for modelling the behaviour of components as understood in component-based software development. Here, a component-based system consists of several interacting components whereby each component manages calls to and from the component using ports to ensure encapsulation. Further, a component can be complex and made of several simpler interacting components. When a complex component receives a request through one of its ports, the port delegates the request to an internal component. Our logic allows us to describe the different views we can have on the system. For example, the overall component interactions, whether they occur sequentially, simultaneously or in parallel, and how each component …", "num_citations": "13\n", "authors": ["604"]}
{"title": "Guaranteeing temporal validity with a real-time logic of knowledge\n", "abstract": " In applications where data needs to be shared among distributed components it is desirable to have overall data consistency at all times. This is crucial for safety-critical systems, where inconsistency can lead to failures. Overall continuous data consistency is, however, rarely possible to achieve. For distributed systems, a relaxed view based on the temporal validity of data can be proven sufficient. If components in a distributed computer-based system have different temporal validity constraints for the same data, then as long as these constraints are satisfied overall system inconsistency is not harmful. We propose the use of a formal analysis technique for guaranteeing temporal validity of shared data. The approach is based on a real-time temporal logic of knowledge suitable for verification through model checking. It allows us to check that the shared data in the system is consistent \"enough\" and cannot be a source …", "num_citations": "13\n", "authors": ["604"]}
{"title": "Towards a model for asynchronously communicating objects\n", "abstract": " In this paper we propose a language-independent model for concurrent distributed object systems where objects interact with each other by asynchronous message passing. Objects are modeled by sequential labelled event structures. These event structures are combined into an asynchronous system model by means of a new relation, the so called communication arrow, that expresses directed asynchronous object interaction. We give an inductive construction of a specific asynchronous system model, and prove that it is sound. This paper is a first step towards denotational semantics of and reasoning about asynchronously communicating object societies. 1 Introduction One of the main principles of the object-oriented framework is the idea of encapsulation. Objects are self-contained units concurrently put together to global systems in which they interact with each other by message passing. Thus, objects constitute modular units which can be accessed according to their interfaces. The int...", "num_citations": "13\n", "authors": ["604"]}
{"title": "A framework for automated conflict detection and resolution in medical guidelines\n", "abstract": " Common chronic conditions are routinely treated following standardised procedures known as clinical guidelines. For patients suffering from two or more chronic conditions, known as multimorbidity, several guidelines have to be applied simultaneously, which may lead to severe adverse effects when the combined recommendations and prescribed medications are inconsistent or incomplete. This paper presents an automated formal framework to detect, highlight and resolve conflicts in the treatments used for patients with multimorbidities focusing on medications. The presented extended framework has a front-end which takes guidelines captured in a standard modelling language and returns the visualisation of the detected conflicts as well as suggested alternative treatments. Internally, the guidelines are transformed into formal models capturing the possible unfoldings of the guidelines. The back-end takes the …", "num_citations": "12\n", "authors": ["604"]}
{"title": "Weaving true-concurrent aspects using constraint solvers\n", "abstract": " Large system models usually consist of several simpler models that can be understood more easily. Making changes to the behaviour of a component will likely affect several models and could introduce accidental errors. Aspects address this by modelling new functionality required in several places as an advice, which can be integrated with the original base models by specifying a pointcut. Before checking that the overall outcome is correct, we need to weave the cross-cutting advice into the base models, and obtain new augmented models. Although considerable research has been done to weave models, many such approaches are not fully automated. This paper looks at aspect weaving of scenario-based models, where aspects are given a true-concurrent semantics based on event structures. Our contribution is a novel formal automated technique for weaving aspects using the Z3-SMT solver. We compare the …", "num_citations": "12\n", "authors": ["604"]}
{"title": "Modelling mobility with uml2. 0 and pepa nets\n", "abstract": " We show how UML2.0 together with PEPA nets can be used to model dynamic aspects of mobile applications. UML2.0 provides a new form of high-level description of interactions called interaction overview diagram. The combination of interaction overview diagrams and sequence diagrams is naturally translated into PEPA nets, a performance modelling language. In this way, the designers using UML can analyse their models formally using available tools for PEPA nets", "num_citations": "12\n", "authors": ["604"]}
{"title": "On dynamic aspects of OOD frameworks in component-based software development in computational logic\n", "abstract": " In component-based software development, object-oriented design (OOD) frameworks are increasingly recognised as better units of reuse than objects. This is because OOD frameworks are groups of interacting objects, and as such they can better reflect practical systems in which objects tend to have more than one role in more than one context. In an earlier paper, we described a formal semantics of the static aspects of OOD frameworks in computational logic. In this paper, we make a preliminary attempt to extend this to the dynamic aspects.", "num_citations": "12\n", "authors": ["604"]}
{"title": "The serums tool-chain: ensuring security and privacy of medical data in smart patient-centric healthcare systems\n", "abstract": " Future-generation healthcare systems will be highly distributed, combining centralised hospital systems with decentralised home-, work-and environment-based monitoring and diagnostics systems. These will reduce costs and injury-related risks whilst both improving quality of service, and reducing the response time for diagnostics and treatments made available to patients. To make this vision possible, medical data must be accessed and shared over a variety of mediums including untrusted networks. In this paper, we present the design and initial implementation of the SERUMS tool-chain for accessing, storing, communicating and analysing highly confidential medical data in a safe, secure and privacy-preserving way. In addition, we describe a data fabrication framework for generating large volumes of synthetic but realistic data, that is used in the design and evaluation of the tool-chain. We demonstrate the …", "num_citations": "11\n", "authors": ["604"]}
{"title": "Automated Composition of Sequence Diagrams via Alloy\n", "abstract": " Design of large systems often involves the creation of models that describe partial specifications. Model composition is the process of combining partial models to create a single coherent model. This paper presents an automatic composition technique for creating a sequence diagram from partial specifications captured in multiple sequence diagrams with the help of Alloy. Our contribution is twofold: a novel true-concurrent semantics for sequence diagram composition, and a model-driven transformation of sequence diagrams onto Alloy that preserves the semantics of composition defined. We have created a tool called SD2Alloy that implements the automated technique and works as follows: two given sequence diagrams are transformed in two Alloy models, and then combined according to a set of logical constraints, determined by our compositional semantics, into a final composed Alloy model. The technique …", "num_citations": "11\n", "authors": ["604"]}
{"title": "Timed knowledge-based modelling and analysis: on the dependability of socio-technical systems\n", "abstract": " We are concerned with the analysis of socio-technical systems, in particular, safety-critical systems involving considerable human intervention. Experience shows that evolving knowledge distribution in socio-technical systems may trigger catastrophic events affecting system dependability. This paper presents a knowledgebased approach to model and analyse evolving scenarios in socio-technical systems. The timed knowledge-based approach captures the nature of socio-technical systems, which consist of hybrid resources continuously interacting each other. The analysis and modelling of a case study drawn from the Air Traffic Control domain shows the applicability of the proposed approach.", "num_citations": "11\n", "authors": ["604"]}
{"title": "Matching and merging scenarios automatically with Alloy\n", "abstract": " The design of large systems often involves the creation of models that describe partial specifications. Model composition is the process of combining partial models to create a single coherent model. This paper presents an automatic composition technique for creating a sequence diagram from partial specifications captured in multiple sequence diagrams with the help of Alloy. Our contribution is twofold: a novel true-concurrent semantics for sequence diagram composition, and a model-driven transformation of sequence diagrams to Alloy that preserves the semantics of composition defined. We have created a tool SD2Alloy that implements the technique as follows: two given sequence diagrams are transformed into two Alloy models, and merged according to a set of syntactic logical constraints describing how their elements should be matched. These constraints are in accordance to our compositional …", "num_citations": "9\n", "authors": ["604"]}
{"title": "Correct composition of dephased behavioural models\n", "abstract": " Scenarios of execution are commonly used to specify partial behaviour and interactions between different objects and components in a system. To avoid overall inconsistency in specifications, various automated methods have emerged in the literature to compose (behavioural) models. In recent work, we have shown how the theorem prover Isabelle can be combined with the constraint solver Z3 to efficiently detect inconsistencies in two or more behavioural models and, in their absence, generate the composition. Here, we extend our approach further and show how to generate the correct composition (as a set of valid traces) of dephased models. This work has been inspired by a problem from a medical domain where different care pathways (for chronic conditions) may be applied to the same patient with different starting points.", "num_citations": "8\n", "authors": ["604"]}
{"title": "An integrated framework for verifying multiple care pathways\n", "abstract": " Common chronic conditions are routinely treated following standardised procedures known as clinical pathways. For patients suffering from two or more chronic conditions, referred to as multimorbidities, several pathways have to be applied simultaneously. However, since pathways rarely consider the presence of comorbidities, applying several pathways may lead to potentially harmful (medication) conflicts. This paper proposes an automated framework to detect, highlight and resolve conflicts in the treatments used for patients with multimorbidites. We use BPMN as a modelling language for capturing care guidelines. A BPMN model is transformed into an intermediate formal model capturing the possible unfoldings of the pathway. Putting together the constraint solver Z3 and the theorem prover Isabelle, we combine treatment plans and check the correctness of the approach. We illustrate the approach with an …", "num_citations": "8\n", "authors": ["604"]}
{"title": "Mind the gap: addressing behavioural inconsistencies with formal methods\n", "abstract": " In complex system design, it is important to construct several design models focusing on different aspects of a system to gain a better understanding of individual component structure and behaviour. Scenarios of execution are commonly used to specify partial behaviour and interactions between a group of system objects or components. However, partial specifications may hide inconsistencies or an otherwise unintentionally incomplete or underspecified behavioural model. This paper proposes a new powerful technique combining constraint solvers and theorem provers to complete partial specifications and determine overall model inconsistencies. We use a true-concurrent model, namely labelled event structures, which can be used as the underlying semantics of widely used workflow or scenario-based languages. We show how an interplay between the theorem prover Isabelle and constraint solver Z3 can be …", "num_citations": "8\n", "authors": ["604"]}
{"title": "Synthesising pepa nets from iods for performance analysis\n", "abstract": " The object-based Unified Modeling Language (UML) is a popular medium for effective design of most systems. PEPA nets are a performance modelling technique which offers capabilities for capturing notions such as location, synchronisation and message passing, and are thus suited for performance modelling of mobile and distributed software. In this paper, we provide a new constructive approach that links both models by deriving a PEPA net which realises the same language (legal set of traces) as a given Interaction Overview Diagram (IOD) in UML2. We prove that the languages are strongly consistent (equivalent) by establishing the one-to-one correspondence between the traces of the models.", "num_citations": "8\n", "authors": ["604"]}
{"title": "The effects of timing and collaboration on dependability in the neonatal intensive care unit\n", "abstract": " Computer-based systems are now routinely deployed in many complex dynamic domains, such as aviation and industrial process control. The critical nature of these systems means that their operators rely on them to do the right thing at the right time when called upon. In other words, they are expected to have a high level of what Laprie (1995) defines as dependability. To date dependability research has largely focused on developing techniques for improving the dependability of hardware and software in safety critical applications (e.g., Leveson, 1995). Dependability, however, is a property of the whole socio-technical system: people, computers and context. It is therefore important not only to understand these components, but also how the interactions between them affect dependability.", "num_citations": "8\n", "authors": ["604"]}
{"title": "Formalising well-behaved components\n", "abstract": " Present-day software systems are challenged by increasing demands for modifiability and evolvability to cater for changing requirements. Component-based development emerges as a key methodology for creating large-scale, evolvable systems in a timely fashion as it advocates the assembly of the final system from prefabricated replaceable software components. However, it is often the case that undesirable or unpredictable behaviour emerges when components are combined. This is partly due to lack of behavioural information about the individual components. In this paper, we describe a formal model for component specification which can be used to identify potential instances of undesirable behaviour. The approach considers component behaviour modelled by so-called behavioural presentations, a powerful model of true-concurrency. Moreover, the framework is compositional as has been shown in a companion paper [12]. Finally, we outline directions for future work.", "num_citations": "8\n", "authors": ["604"]}
{"title": "Balancing prescriptions with constraint solvers\n", "abstract": " Clinical guidelines are evidence-based care plans which detail the essential steps to be followed when caring for patients with a specific clinical problem, usually a chronic disease (e.g. diabetes, cardiovascular disease, chronic kidney disease, cancer, chronic obstructive pulmonary disease, and so on). Recommendations for chronic diseases include the medications (or group of medications) to be given at different stages of the treatment plan. We present an automated approach which combines constraint solvers and theorem provers to find the best solutions for treatment according to different criteria, and avoiding adverse drug reactions as much as possible. We extended the approach here to further refine the choice(s) to avoid dangerous or undesirable side effects.", "num_citations": "7\n", "authors": ["604"]}
{"title": "On a time enriched OCL liveness template\n", "abstract": " It is increasingly recognised that non-functional requirements should be considered at the earliest stages of system development. Unified modelling language (UML), as a standard, should therefore include notation to capture such requirements. Among these, timing has received considerable attention by the modelling community with several timed extensions of UML diagrams, a UML profile and tools. However, timing constraints are, generally, not captured in a satisfactory way during design. We propose to use UML's object constraint language (OCL) for this purpose, and provide a simple time enriched liveness template for OCL. We describe the benefits of using this template.               Having verification in mind, several logic-based formalisms could be chosen to underly OCL. We consider a novel real-time logic of knowledge, and argue why logics of knowledge are useful and promising in this context. We …", "num_citations": "7\n", "authors": ["604"]}
{"title": "Using a modular distributed temporal logic for in-the-large object specification\n", "abstract": " Our general goal is to provide a semantic foundation for in-the-large speci cation of distributed information systems. We use Troll, an object-oriented formal language, for system speci cation. Our claim is that objects are not enough as a modularisation unit when it comes to deal with very large systems. An intermediary concept between the system and the objects is needed for allowing reusability of speci cations and provide a clearer system structure. Enriching Troll with a module concept enforces us to develop new theoretical constructs ensuring an appropriate underpinning of the language. A modular distributed temporal logic Mdtl has been developed which describes the dynamic aspects of modular systems. The main features of the logic are its own modularity, the ability to express inter-module (a) synchronous communication and intra-module concurrency. It also seems promising to support module re nement. Mdtl is based on n-agent logics and interpreted over labelled prime event structures. In this paper we present the logic and semantics underlying the modular object-oriented speci cation language by means of a small toy example.", "num_citations": "7\n", "authors": ["604"]}
{"title": "Seventh-day Adventists and the US courts: Road signs along the route of a denominationalizing sect\n", "abstract": " Sects, according to Stark and Bainbridge, are marked by a high\" state of tension\" with their\" surrounding sociocultural environments.\"'Tension is characterized by difference, separation, and antagonism, for a sect and its surrounding society\" disagree over proper beliefs, norms, and behavior.\" 2 It is not surprising that differences, tensions, and an-tagonisms have often resulted in conflicts that have been fought out in the courts. The first case to argue the Free Exercise Clause of the US Constitution before the Supreme Court3 upheld the ban on polygamy among Mormons. 4 Jehovah's Witnesses have also been the focus of major cases before the US Supreme Court. The Minersville School District v. Gobitis decision (1940) held that American schools had the right to compel children to salute the national flag during daily assembly. In the wake of this decision, violence and intimidation against Wit-nesses increased …", "num_citations": "7\n", "authors": ["604"]}
{"title": "A verified algorithm enumerating event structures\n", "abstract": " An event structure is a mathematical abstraction modeling concepts as causality, conflict and concurrency between events. While many other mathematical structures, including groups, topological spaces, rings, abound with algorithms and formulas to generate, enumerate and count particular sets of their members, no algorithm or formulas are known to generate or count all the possible event structures over a finite set of events. We present an algorithm to generate such a family, along with a functional implementation verified using Isabelle/HOL. As byproducts, we obtain a verified enumeration of all possible preorders and partial orders. While the integer sequences counting preorders and partial orders are already listed on OEIS (On-line Encyclopedia of Integer Sequences), the one counting event structures is not. We therefore used our algorithm to submit a formally verified addition, which has been …", "num_citations": "6\n", "authors": ["604"]}
{"title": "Model checking cancer automata\n", "abstract": " Cancer is a chronic disease where cells grow and multiply in an uncontrollable manner ultimately spreading and invading surrounding tissue, and metastasising in other parts or organs of the body. Automata can be used to capture cancer evolving through a (discrete finite) sequence of progressive stages called phenotypes. Automata consist of states (known as hallmarks of cancer) and transitions between states, indicating a progression or regression of the cancer. We explore extensions and combinations of different variants of timed automata and associated tools to model and analyse a model of the disease in different ways. We combine patient information and comorbidities with the cancer automaton through composition. The goal of this work is to use model checking as an analysis technique to provide further insights into the effectiveness of treatment plans for a given patient, and how these could potentially …", "num_citations": "6\n", "authors": ["604"]}
{"title": "Parametric transformations for flexible analysis\n", "abstract": " We present an approach for flexible analysis of complex system models based on a parametric model-to-model (M2M) transformation where the target model has variants. We describe a M2M transformation from sequence diagrams (SDs) to coloured Petri nets (CPNs) with (untimed, timed, stochastic) variants enabling different forms of dependability and performance analysis. The transformation is parametric on the chosen variant with the core set of rules defining the transformation from SDs to CPNs. Moreover, the flexibility of the framework lies in the incremental nature of the transformation: given a SD (with stochastic and time annotations) and corresponding untimed CPN, we can generate other CPN variants by incrementally applying the specific variant rules. This paper contributes towards the theoretical foundations of parametric transformations, defines and proves the semantic correctness of a parametric …", "num_citations": "6\n", "authors": ["604"]}
{"title": "Strongly consistent transformation of partial scenarios\n", "abstract": " We present a formal approach for partial transformation of scenario-based specifications. Scenarios are captured as sequence diagrams (SDs) and (partially) transformed into coloured Petri nets (CPNs). Partial transformation is of interest for local analysis, or within an incremental development approach where interaction specifications are built incrementally and combined with previous iteration models. In previous work we defined a strongly consistent trans- formation from SDs to CPNs. In this paper, we extend the approach for partial transformation whilst preserving the strongly consistent nature of the transformation.", "num_citations": "6\n", "authors": ["604"]}
{"title": "Giving life to agent interactions\n", "abstract": " Agent UML (AUML) is an extension of the standard object-oriented modelling language UML adapted for agent-based systems. In AUML sequence diagrams are extended to describe specific dynamic aspects of agents including dynamic role assignment, nondeterministic choice in agent decisions and concurrent communication. These diagrams are used to describe agent interaction protocols. We describe some of the problems of extended sequence diagrams in AUML. Not all of these problems are specific to agent sequence diagrams and have been previously identified in UML’s sequence diagrams and Message Sequence Charts (MSCs). Live Sequence Charts (LSCs) are a very expressive extension of MSCs that addresses many of these issues in the context of object-oriented systems. We propose an extension of LSCs for agents, and show how it is useful for modelling agent interactions, agent …", "num_citations": "6\n", "authors": ["604"]}
{"title": "Modelling parameterisation in concurrent object systems\n", "abstract": " J. Küster Filipe, Modelling Parameterisation in Concurrent Object Systems - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Modelling Parameterisation in Concurrent Object Systems J. Küster Filipe Logic Journal of the Igpl 5 (6) (1997) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories No categories specified (categorize this paper) Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 59,916 External links This entry has no external links. Add one. Setup an account with your affiliations in order to access resources via your University's proxy …", "num_citations": "6\n", "authors": ["604"]}
{"title": "Interacting with next-generation smart patient-centric healthcare systems\n", "abstract": " There is a recognised move towards more personalised health with citizens at the centre of healthcare provision. In particular, there is an emphasis on the right of citizens to decide who, why and when, should have access to their medical records. The EU project SERUMS is developing a tool-chain for the secure access of distributed medical information preserving the privacy levels imposed by GDPR, national and/or organisational regulations. We propose a user-centred approach to demonstrate how technologies can converge to enable doctors and patients to interact with integrated healthcare records. In addition, it will allow us to evaluate and evolve our tool-chain.", "num_citations": "5\n", "authors": ["604"]}
{"title": "Designing a patient-centric system for secure exchanges of medical data\n", "abstract": " Designing patient-centric healthcare systems which consider the smart integration of distributed medical data is challenging. This includes handling numerous architectural dependencies and requirements as a result of blending a variety of future generation technologies. Examples of recent approaches are proposals of a unified format for medical records to facilitate efficient healthcare provision, transparent data access control using blockchain technology, and emergent authentication mechanisms and privacy-preserving techniques for data analytics. The Serums project proposes an innovative design for a Smart Health Centre System in a distributed development effort. The goal is a comprehensive solution for integration and access of transnational medical records. This paper focuses on the architectural design workflow as a way of delivering artefacts for development iterations and contribute towards …", "num_citations": "5\n", "authors": ["604"]}
{"title": "Integrating Healthcare Data for Enhanced Citizen-Centred Care and Analytics\n", "abstract": " The potential of healthcare systems worldwide is expanding as new medical devices and data sources are regularly presented to healthcare providers which could be used to personalise, improve and revise treatments further. However, there is presently a large gap between the data collected, the systems that store the data, and any ability to perform big data analytics to combinations of such data. This paper suggests a novel approach to integrate data from multiple sources and formats, by providing a uniform structure to the data in a healthcare data lake with multiple zones reflecting how refined the data is: from raw to curated when ready to be consumed or used for analysis. The integration further requires solutions that can be proven to be secure, such as patient-centric data sharing agreements (smart contracts) on a blockchain, and novel privacy-preserving methods for extracting metadata from data sources, originally derived from partially-structured or from completely unstructured data. Work presented here is being developed as part of an EU project with the ultimate aim to develop solutions for integrating healthcare data for enhanced citizen-centred care and analytics across Europe.", "num_citations": "5\n", "authors": ["604"]}
{"title": "On predicting the outcomes of chemotherapy treatments in breast cancer\n", "abstract": " Chemotherapy is the main treatment commonly used for treating cancer patients. However, chemotherapy usually causes side effects some of which can be severe. The effects depend on a variety of factors including the type of drugs used, dosage, length of treatment and patient characteristics. In this paper, we use a data extraction from an oncology department in Scotland with information on treatment cycles, recorded toxicity level, and various observations concerning breast cancer patients for three years. The objective of our paper is to compare several different techniques applied to the same data set to predict the toxicity outcome of the treatment. We use a Markov model, Hidden Markov model, Random Forest and Recurrent Neural Network in our comparison. Through analysis and evaluation of the performance of these techniques, we can determine which method is more suitable in different …", "num_citations": "5\n", "authors": ["604"]}
{"title": "A flexible approach for finding optimal paths with minimal conflicts\n", "abstract": " Complex systems are usually modelled through a combination of structural and behavioural models, where separate behavioural models make it easier to design and understand partial behaviour. When partial models are combined, we need to guarantee that they are consistent, and several automated techniques have been developed to check this. We argue that in some cases it is impossible to guarantee total consistency, and instead we want to find execution paths across such models with minimal conflicts with respect to a certain metric of interest. We present an efficient and scalable solution to find optimal paths through a combination of the theorem prover Isabelle with the constraint solver Z3. Our approach has been inspired by a healthcare problem, namely how to detect conflicts between medications taken by patients with multiple chronic conditions, and how to find preferable alternatives …", "num_citations": "5\n", "authors": ["604"]}
{"title": "SD2CPN: A model transformation tool for software design models\n", "abstract": " The growth of software system development using Model Driven Development (MDD) approach has increased the need for modelling, model-to-model (M2M) transformations and analyses at the design level for system verification. SD2CPN is a scenario-based model transformation prototype with analysis capabilities. This tool models scenarios using UML2 sequence diagrams (SDs) and transform those into coloured Petri nets (CPNs) that enables different analysis of the synthesised model. The model transformations are based on the M2M transformation rules that are formally defined in our previous work. This paper presents the features, design and the analysis methods of SD2CPN tool.", "num_citations": "5\n", "authors": ["604"]}
{"title": "When things go wrong: Interrupting conversations\n", "abstract": " This paper presents a true-concurrent approach to formalising integration of Small-to-Medium Enterprises (SMEs) with Web services. Our approach formalises common notions in service-oriented computing such as conversations (interactions between clients and web services), multi-party conversations (interactions between multiple web services) and coordination protocols, which are central in a transactional environment. In particular, we capture long-running transactions with recovery and compensation mechanisms for the underlying services in order to ensure that a transaction either commits or is successfully compensated for.", "num_citations": "5\n", "authors": ["604"]}
{"title": "Using OCL for expressing temporal validity constraints\n", "abstract": " BackgroundIn DIRC, a UK EPSRC funded project, we are looking at dependable socio-technical systems.", "num_citations": "5\n", "authors": ["604"]}
{"title": "Intra-and inter-OOD-framework interactions in component-based software development in computational logic\n", "abstract": " In [13, 14, 10] we present a formalisation of OOD frameworks (ie groups of interacting objects) in component-based software development (CBD) in computational logic. In that formalisation, the only form of interactions between objects are associations (relations) between objects, and operations on objects which only affect their local state. However, in practical systems, an OOD framework F also needs to express operations between objects within F, as well as operations between F and other frameworks. In this paper we extend our formalisation to such intra-and inter-OOD-framework interactions. These interactions are called joint actions in the CBD methodology Catalysis, and we illustrate our formalisation by means of a Catalysis example.", "num_citations": "5\n", "authors": ["604"]}
{"title": "On a Distributed Temporal Logic for Modular Object Systems\n", "abstract": " In this paper we present Mdtl, a distributed temporal logic for reasoning about both synchronously and asynchronously communicating modular object systems. Mdtl is an extension of Dtl reflecting besides communication and non-determinism also concurrency and supporting asynchronous communication. It is based on n-agent logics. Formulae written in Mdtl are interpreted over labelled prime event structures. A model construction for (a) synchronous concurrent composition has been provided in previous work. The model theory together with Mdtl allows a whole range of issues, like reasoning and verification.", "num_citations": "5\n", "authors": ["604"]}
{"title": "Annotated BPMN models for optimised healthcare resource planning\n", "abstract": " There is an unquestionable need to improve healthcare processes across all levels of care in order to optimise the use of resources whilst guaranteeing high quality care to patients. However, healthcare processes are generally very complex and have to be fully understood before enhancement suggestions can be made. Modelling with widely used notation such as BPMN (Business Process Modelling and Notation) can help gain a shared understanding of a process, but is not sufficient to understand the needs and demands of resources. We propose an approach to enrich BPMN models with structured annotations which enables us to attach further information to individual elements within the process model. We then use performance analysis (e.g., throughput and utilisation) to reason about resources across a model and propose optimisations. We show the usefulness of our approach for an A&E …", "num_citations": "4\n", "authors": ["604"]}
{"title": "A blockchain-based healthcare platform for secure personalised data sharing\n", "abstract": " To facilitate personalised healthcare provision across Europe, we envision solutions that enable the secure integration and sharing of medical health records. These solutions should address privacy concerns, such as granular access control to personal data, establishing what should be accessible when and by whom, whilst complying with collective regulatory frameworks such as the European General Data Protection Regulation (GDPR) and adhering to international standards on how to manage information security. The proposed healthcare system design integrates technologies such as blockchain and scalable data lakes with adequate system routines to guarantee the secure access of confidential data. In this paper, we present the essential architectural components for the secure integration of medical records in a blockchain-based platform. We present a patient-centric data retrieval approach which incorporates a structured format to compose access rules.", "num_citations": "3\n", "authors": ["604"]}
{"title": "An integrated approach to a combinatorial optimisation problem\n", "abstract": " We take inspiration from a problem from the healthcare domain, where patients with several chronic conditions follow different guidelines designed for the individual conditions, and where the aim is to find the best treatment plan for a patient that avoids adverse drug reactions, respects patient’s preferences and prioritises drug efficacy. Each chronic condition guideline can be abstractly described by a directed graph, where each node indicates a treatment step (e.g., a choice in medications or resources) and has a certain duration. The search for the best treatment path is seen as a combinatorial optimisation problem and we show how to select a path across the graphs constrained by a notion of resource compatibility. This notion takes into account interactions between any finite number of resources, and makes it possible to express non-monotonic interactions. Our formalisation also introduces a discrete temporal …", "num_citations": "3\n", "authors": ["604"]}
{"title": "Tool support for transforming Unified Modelling Language sequence diagram to coloured Petri nets\n", "abstract": " Modern software systems are expected to be dependable and the development of such systems requires strong modelling and analysis methods. Model-Driven Development is becoming a mainstream practice in software development to cater for that need. Models help to cope with the large scale and complexity of software systems by specifying the structural and behavioural aspects of the system and providing a means of communication between domain experts, analysts, designers and developers. Consequently, there is an increasing need for being able to combine the benefits of popular design approaches and formal models to contribute to better software products. Sequence Diagram-to-Coloured Petri Net (SD2CPN) is a scenario-based model transformation tool with analysis capabilities. It captures scenarios using Unified Modelling Language sequence diagrams and transforms them into coloured Petri nets that enable reliable analysis of the system models. The model transformations are based on the strongly consistent model-to-model transformation rules that are formally defined previously as part of this research. This paper presents the design, implementation, main features and usage of SD2CPN tool.", "num_citations": "3\n", "authors": ["604"]}
{"title": "Putting synchronous and asynchronous object modules together: An event-based model for concurrent composition\n", "abstract": " In this paper we show how by means of a categorical framework we can compose systems of concurrent object modules satisfying some interaction rules given by a specification. Module interaction can be either synchronous or asynchronous and both cases are considered separately. The behaviour of object modules is modelled by labelled prime event structures. The category of labelled prime event structures has (co) products. A product in the category of labelled prime event structures is given accordingly to Winskel and Nielsen but denotes parallel composition in a sense that does not have much practical interest. For synchronously communicating modules, by applying to the product a restriction on the allowed life cycles by means of the categorical concept of a functor induced by a co bration and a morphism on labels, we achieve the desired joint behaviour. A way to model asynchronous composition of modules is to construct a coproduct and extend it by their interaction rules. At the end of...", "num_citations": "3\n", "authors": ["604"]}
{"title": "Trends in diabetes medication use in Australia, Canada, England, and Scotland: a repeated cross-sectional analysis in primary care\n", "abstract": " Background Several new classes of glucose-lowering medications have been introduced in the past two decades. Some, such as sodium-glucose cotransporter 2 inhibitors (SGLT2s), have evidence of improved cardiovascular outcomes, while others, such as dipeptidyl peptidase-4 inhibitors (DPP4s), do not. It is therefore important to identify their uptake in order to find ways to support the use of more effective treatments.Aim To analyse the uptake of these new classes among patients with type 2 diabetes.Design and setting This was a retrospective repeated cross-sectional analysis in primary care. Rates of medication uptake in Australia, Canada, England, and Scotland were compared.Method Primary care Electronic Medical Data on prescriptions (Canada, UK) and dispensing data (Australia) from 2012 to 2017 were used. Individuals aged ≥40 years on at least one glucose-lowering drug class in each year of …", "num_citations": "2\n", "authors": ["604"]}
{"title": "Combining patient pathway visualisation with prediction outcomes for chemotherapy treatments\n", "abstract": " The Edinburgh Cancer Centre (ECC) contains NHS Lothian cancer patient data from multiple resources. However, the lack of proxy between numerous scattered resources hinders the capability to use the information collected in a useful way. ECC data is very varied and includes patient characteristics (e.g., age, weight, height, gender), information on diagnosis (e.g., stage, site, comorbidities) and treatments (e.g., surgery, chemotherapy, radiotherapy). The visualisation of a fraction of ECC data in the form of a patient timeline can aid and enhance the process of observing and identifying the overall condition of the patient, as well as understand how it may compare with cohorts of patients with similar characteristics. We have previously developed machine learning models for predicting treatment outcomes for breast cancer patient data that have undergone chemotherapy. In this paper, we describe, examine, and propose a solution to connect all these aspects and provide a bridge for several resources. This will make it easier for clinicians and other healthcare professionals to support service planning, deliver better quality of care and consequently improve service outcome within NHS Lothian.", "num_citations": "2\n", "authors": ["604"]}
{"title": "Formal verification of CNL health recommendations\n", "abstract": " Clinical texts, such as therapy algorithms, are often described in natural language and may include hidden inconsistencies, gaps and potential deadlocks. In this paper, we propose an approach to identify such problems with formal verification. From each sentence in the therapy algorithm we automatically generate a parse tree and derive case frames. From the case frames we construct a state-based representation (in our case a timed automaton) and use a model checker (here UPPAAL) to verify the model. Throughout the paper we use an example of the algorithm for blood glucose lowering therapy in adults with type 2 diabetes to illustrate our approach.", "num_citations": "2\n", "authors": ["604"]}
{"title": "Transformation and composition of software design models for Model Driven Development\n", "abstract": " Software models play a significant role with the growth of software system development based on Model Driven Development (MDD) approach. Model transformations and compositions are the heart of MDD and allow the development of complex systems and their automated derivation. Moreover, software development of large and complex systems uses a collection of models, where model composition and decomposition are required. Various research studies have been done on specifying and executing MDD processes; however only a few of those have considered the validity of such transformations, thus safe composition and decomposition of models. This paper presents a general approach for model composition for the transformation from UML sequence diagrams to Coloured Petri Nets and validates the correctness of model composition using a mathematical proof. These transformations are based on …", "num_citations": "2\n", "authors": ["604"]}
{"title": "A Categorical Hiding Mechanism for Concurrent Object Systems\n", "abstract": " We present a categorical mechanism to model interfaces in concurrent modular object systems. The behaviour of objects is modelled by sequential labelled prime event structures. Objects can be grouped into modules denoting system parts which are modelled by labelled event structures. The behaviour of systems is achieved from its interconnected modules by combining compositional and hiding mechanisms. A forgetful functor from the category of labelled prime event structures into the category of labels is introduced and proved to be a cofibration. We define two kinds of hiding morphisms on labels: total and partial. The total induces with the cofibration a functor that is useful for hiding actions, while the partial allows us to hide entire objects and thus obtain module interfaces. Moreover, an interesting application of the latter shows how to model asynchronous communication via synchronous one.", "num_citations": "2\n", "authors": ["604"]}
{"title": "On the Benefits and Security Risks of a User-Centric Data Sharing Platform for Healthcare Provision\n", "abstract": " With data breaches on the rise especially after a Covid pandemic, a huge challenge is to design secure platforms for sensitive data sharing and to support vital decisions for both healthcare provision and enhanced personalised patient care. Recently proposed is the design of a patient-centric tool chain to integrate cross-border medical records. The aim is to demonstrate how emerging technologies for authentication, authorisation, and big data storage can converge in a healthcare platform to enable citizens (and researchers) to securely retrieve vital patient health information whilst aligned with data protection regulations and standards. We develop an initial risk model with four common threat scenarios, discussing risk factors such as threat, vulnerability, impact, and likelihood. We detail how the healthcare platform design can mitigate the underlying vulnerabilities with countermeasures that do not compromise the …", "num_citations": "1\n", "authors": ["604"]}
{"title": "Graph‐based risk assessment and error detection in radiation therapy\n", "abstract": " Purpose The objective of this study was to formalize and automate quality assurance (QA) in radiation oncology. Quality assurance in radiation oncology entails a multistep verification of complex, personalized radiation plans to treat cancer involving an interdisciplinary team and high technology, multivendor software and hardware systems. We addressed the pretreatment physics chart review (TPCR) using methods from graph theory and constraint programming to study the effect of dependencies between variables and automatically identify logical inconsistencies and how they propagate.   Materials and methods We used a modular approach to decompose the TPCR process into tractable units comprising subprocesses, modules and variables. Modules represented the main software entities comprised in the radiation treatment planning workflow and subprocesses grouped the checks to be performed by …", "num_citations": "1\n", "authors": ["604"]}
{"title": "Studying trajectories of multimorbidity: a systematic scoping review of longitudinal approaches and evidence.\n", "abstract": " Objectives: Multimorbidity, the co-occurrence of at least two chronic diseases in an individual, is an important public health challenge in ageing societies. The vast majority of multimorbidity research takes a cross-sectional approach, but longitudinal approaches to understanding multimorbidity are an emerging research area, being encouraged by multiple funders. To support development in this research area, the aim of this study is to scope the methodological approaches and substantive findings of studies which have investigated longitudinal multimorbidity trajectories. Design: We conducted a systematic search for relevant studies in four online databases (Medline, Scopus, Web of Science, and Embase) using pre-defined search terms and inclusion and exclusion criteria. The search was complemented by searching reference lists of relevant papers. From the selected studies we systematically extracted data on study methodology and findings, and summarised them in a narrative synthesis.  Results: We identified 34 studies investigating multimorbidity longitudinally, all published in the last decade, and predominantly in high-income countries from the Global North. Longitudinal approaches employed included constructing change variables, multilevel regression analysis (e.g. growth curve modelling), longitudinal group-based methodologies (e.g. latent class modelling), analysing disease transitions, and visualisation techniques. Commonly identified risk factors for multimorbidity onset and progression were older age, higher socio-economic and area-level deprivation, overweight, and poorer health behaviours. Conclusion: The nascent …", "num_citations": "1\n", "authors": ["604"]}
{"title": "Dialogue games for explaining medication choices\n", "abstract": " SMT solvers can be used efficiently to search for optimal paths across multiple graphs when optimising for certain resources. In the medical context, these graphs can represent treatment plans for chronic conditions where the optimal paths across all plans under consideration are the ones which minimize adverse drug interactions. The SMT solvers, however, work as a black-box model and there is a need to justify the optimal plans in a human-friendly way. We aim to fulfill this need by proposing explanatory dialogue protocols based on computational argumentation to increase the understanding and trust of humans interacting with the system. The protocols provide supporting reasons for nodes in a path and also allow counter reasons for the nodes not in the graph, highlighting any potential adverse interactions during the dialogue.", "num_citations": "1\n", "authors": ["604"]}
{"title": "Correct composition in the presence of behavioural conflicts and dephasing\n", "abstract": " Scenarios of execution are commonly used to specify partial behaviour and interactions between different objects and components in a system. To avoid overall inconsistency in specifications, various automated methods have emerged in the literature to compose scenario-based models. In recent work, we have shown how the theorem prover Isabelle/HOL can be combined with an SMT solver to detect inconsistencies between sequence diagrams and, only in their absence, generate the behavioural composition. In this paper, we exploit this combination further and present an efficient approach that generates all valid composed traces giving us an equivalent representation of the conflict-free valid composed model. In addition, we show a novel way to prove the correctness of the computed results, and compare this method with the implementation and verification done within Isabelle alone. To reduce the …", "num_citations": "1\n", "authors": ["604"]}
{"title": "Computer aided verification of radiotherapy treatment plans\n", "abstract": " Purpose: Quality assurance (QA) in radiation oncology entails a multi-step verification of complex, high-technology treatments involving an inter-disciplinary team and multi-vendor software and hardware. Here, we extend our work on the pre-treatment physics chart review (TPCR) using a modular approach and formal methods from computer science to automatically identify logical inconsistencies in a patient’s treatment plan and how they propagate.Methods: The TPCR process was decomposed into modules, subprocesses and moduleassociated variables for input to the subprocesses. The checks in the subprocesses and their order were formalized as constraints in an activity workflow diagram. The TPCR process was converted into a Satisfiability Modulo Theory (SMT) problem and solvers were used to 1) detect and correct logical inconsistencies in the TPCR specification through an iterative learning approach and 2) detect logical inconsistencies in a proposed patient treatment plan automatically.Results: The model for the TPCR process comprises 5 modules, 17 sub-processes and approximately 300 variables (~ 70 distinct). Modules comprise “Patient Manager”,“Treatment Planning System”,“Independent MU Calculation” and “Record and Verify”. Subprocesses include “Dose Prescription”,“Documents”,“CT Integrity”,“Anatomical Contours”,“Beam Configuration”,“Dose Calculation”,“3D Dose Distribution Quality”,“IMRT QA” and “Treatment Approval”. We previously formulated our model to detect inconsistencies in the dose prescription, treatment modality and dose distribution. We have now extended the model to detect inconsistencies in …", "num_citations": "1\n", "authors": ["604"]}
{"title": "Reporting Procedure of construction accidents in Sri Lanka\n", "abstract": " A cohesive and centralised recording system of occupational accidents is a significant element of construction industry of any country which requires an effective reporting procedure to feed information into it. It is a valuable management tool that can be used as an aid to risk assessment, to prevent deaths, injuries and ill health conditions, and to minimise costs for accidental losses. However, the absence of an effective reporting procedure will form shortfalls in management of occupational accidents. Sri Lanka is one of the countries that suffers from lack of an efficient recording system. It is revealed that ineffectiveness of existing accident reporting procedure is the main cause for this gap. Therefore, it created a necessity to study the existing reporting procedure of construction accidents in Sri Lanka with the aim of upgrading it by addressing its gaps. Accordingly, the research problem was approached through a document survey and an expert survey which followed by semi structured interviews. Ten experts who are involved in industrial health and safety management were interviewed. The findings revealed that safety representatives of most of the construction organisations reluctant to report to the Labour Department through the district factory inspecting engineer when incidents occur, due to unawareness of legal provisions and burden of paper work. Further, other organisations such as workmen’s compensation department; insurance companies; hospitals and police stations, where construction accidents are reported, are not properly linked with the Labour Department. Therefore, Labour Department as the ultimate data storekeeper does not …", "num_citations": "1\n", "authors": ["604"]}
{"title": "Strongly Consistent Languages for Modelling Mobility\n", "abstract": " A seamless approach suitable for both design and analysis of mobile and distributed software systems is a challenge. The object-based Unified Modeling Language (UML) is a popular medium for effective design of most systems. PEPA nets are a recent performance modelling technique which offers capabilities for capturing notions such as location, synchronisation and message passing, and are thus suited for performance modelling of mobile and distributed software. In this paper, we provide a new constructive approach that links both models by deriving a PEPA net which realises the same language (legal set of traces) as a given Interaction Overview Diagram (IOD) in UML2. We prove that the languages are strongly consistent (equivalent) by establishing the one-to-one correspondence between the traces of the models.", "num_citations": "1\n", "authors": ["604"]}
{"title": "A Formal Approach to Constructing Well-Behaved Systems Using Components\n", "abstract": " Present-day software systems are in increasing need of modification and evolution due to changing requirements. Component-based development constitutes a key methodology for creating large-scale, evolvable systems in a timely fashion as it advocates the (re)use of prefabricated replaceable software components. However, it is often the case that undesirable or unpredictable behaviour emerges when components are combined. This is partly due to lack of behavioural information about the individual components. In this paper, we describe a formal model for component specification which can be used to support the analysis and predictability of component composition and to identify undesirable behaviour. In our approach, component behaviour is modelled by so-called behavioural presentations, a powerful model of true-concurrency. Moreover, the framework is compositional and supports the assembly of …", "num_citations": "1\n", "authors": ["604"]}
{"title": "Limits in modelling evolving computer-based systems\n", "abstract": " This paper explores the limitations of one technique for modelling computer-based systems with evolving requirements. A case study is introduced which highlights the importance of taking a multi-perspective on dependable computer-based systems. This should be reflected in the modelling technique. Such considerations motivate our ongoing research agenda.", "num_citations": "1\n", "authors": ["604"]}