{"title": "A framework of knowledge management systems: issues and challenges for theory and practice\n", "abstract": " As the basis of value creation increasingly depends on the leverage of the intangible assets of firms, knowledge management systems (KMS) are emerging as powerful sources of competitive advantage. However, the general recognition of the importance of such systems seems to be accompanied by a technology-induced drive to implement systems with inadequate consideration of the fundamental knowledge problems that the KMS are likely to solve. This paper contributes to the stream of research on knowledge management systems by proposing an inductively developed framework for this important class of information systems, classifying KMS based on the locus of the knowledge and the a priori structuring of contents. This framework provides a means to explore issues related to KMS and unifying dimensions underlying different types of KMS. The contingencies that we discuss—the size and diversity of networks, the maintenance of knowledge flows and the long term effects of the use of KMS—provide a window into work in a number of reference disciplines that would enrich the utility of KMS and also open up fruitful areas for future research.", "num_citations": "425\n", "authors": ["907"]}
{"title": "How do we understand a system with (so) many diagrams? Cognitive integration processes in diagrammatic reasoning\n", "abstract": " In order to understand diagrammatic reasoning with multiple diagrams, this study proposes a theoretical framework that focuses on the cognitive processes of perceptual and conceptual integration. The perceptual integration process involves establishing interdependence between relevant system elements that have been dispersed across multiple diagrams, while the conceptual integration process involves generating and refining hypotheses about a system by combining higher-level information inferred from the diagrams. This study applies a diagrammatic reasoning framework of a single diagram to assess the usability of multiple diagrams as an integral part of a system development methodology. Our experiment evaluated the effectiveness and usability of design guidelines to aid problem solving with multiple diagrams. The results of our experiment revealed that understanding a system represented by …", "num_citations": "191\n", "authors": ["907"]}
{"title": "Research Note—Continued Participation in Online Innovation Communities: Does Community Response Matter Equally for Everyone?\n", "abstract": " In this study, we focus on the factors that influence online innovation community members' continued participation in the context of open source software development (OSSD) communities. Prior research on continued participation in online communities has primarily focused on social interactions among members and benefits obtained from these interactions. However, members of these communities often play different roles, which have been examined extensively, albeit in a separate stream of research. This study attempts to bridge these two streams of research by investigating the joint influence of community response and members' roles on continued participation. We categorize OSSD community members into users and modifiers and empirically examine the differential effects of community response across these roles. By analyzing a longitudinal data set of activities in the discussion forums of more than 300 …", "num_citations": "108\n", "authors": ["907"]}
{"title": "Big data and analytics in healthcare: introduction to the special section\n", "abstract": " Aging populations and lifestyle changes pose increasing pressures on healthcare systems around the world. These trends accompanied by the digitization of health and patient data through advances in information technology, including medical sensors, have led to the generation of large volumes of primary and secondary data in the healthcare domain. The demand for big data is also spurred by a shift to evidencebased medicine as opposed to subjective clinical decisions. While the trove of data offers significant opportunities for improving healthcare delivery, management, and policy making, new information systems and approaches are needed to make effective use of the big data. Indeed, big data has been referred to as data that is too large and complex to be analyzed and managed by traditional computing tools. The complexity of analyzing big data arises from its three dimensions, ie, variety, velocity, and …", "num_citations": "107\n", "authors": ["907"]}
{"title": "Why are some diagrams easier to work with? Effects of diagrammatic representation on the cognitive intergration process of systems analysis and design\n", "abstract": " Various diagrams have been used heavily in systems analysis and design without proper verification of their usability. However, different diagrammatic representations of the same information may vary in the computational efficiency of working with these diagrams. The objective of this research was to explore the effects of diagrammatic representations on the task of integrating multiple diagrams. The domain of systems analysis and design was used to generate examples and test the theory. A cognitive model of diagram integration was proposed, and an experimental study was conducted, both to explore the effects of representa-tional features of diagrams on the cognitive process of diagram integration. Results of the experiment show that the representational features of the diagrams   acted as the criteria for selecting among various methods for analyzing and designing the integrated diagram. In addition, the …", "num_citations": "103\n", "authors": ["907"]}
{"title": "Information technology spillover and productivity: the role of information technology intensity and competition\n", "abstract": " We study interindustry information technology (IT) spillover wherein IT investments made by supplier industries increase the productivity of downstream industries. Using data from U.S. manufacturing industries, we find that industries receive significant IT spillover benefits in terms of total factor productivity growth through economic transactions with their respective supplier industries. More importantly, we find that two characteristics of downstream industries, namely, IT intensity and competitiveness, which have been shown to moderate the effect of internal IT investments, play an important role in IT spillovers as well. Our results suggest that IT intensity as well as competitiveness of the downstream industry moderate the effect of IT spillovers—industries that are more IT intensive and more competitive benefit more from IT spillovers. Finally, our results suggest that the long-term effects of spillovers are greater than …", "num_citations": "92\n", "authors": ["907"]}
{"title": "Momentum and organizational risk taking: Evidence from the National Football League\n", "abstract": " This study examines how momentum shapes organizational risk taking. We define momentum as a sustained and systematic trajectory in performance over time, and we argue that such trends impact interpretations of current performance as well as expectations of future performance. Drawing on the variable focus of attention model, we posit that momentum therefore directs the focus of organizational attention between concerns of aspirations, survival, and slack. Our conceptual model accounts for momentum that occurs within a performance period as well as that which occurs across periods. We propose that within- and across-period momentums are unique in terms of when and how each type impacts risk taking. We tested and found support for our hypotheses in the context of 22,603 play-by-play decisions made by the 32 teams of the National Football League during the 2000–2005 regular season games …", "num_citations": "75\n", "authors": ["907"]}
{"title": "Knowledge management systems and organizational knowledge processing challenges: A field experiment\n", "abstract": " This paper investigates the appropriateness of knowledge management system (KMS) designs for different organizational knowledge processing challenges. Building on the theory of task-technology fit (TTF), we argue that different KMS designs are more effective for different knowledge tasks. An exploratory field experiment was conducted in the context of Internet-based knowledge sharing services to provide empirical support for our hypotheses. The results of our experiment show that a KMS designed to support the goal GENERATE is more appropriate for divergent type knowledge problems because of its affordances for iterative brainstorming processes. Conversely, for convergent type knowledge processing challenges, a KMS with the goal CHOOSE that supports the ability to clarify and to analyze is more effective.", "num_citations": "62\n", "authors": ["907"]}
{"title": "The dynamics of the performance–risk relationship within a performance period: The moderating role of deadline proximity\n", "abstract": " Risky organizational decisions are frequently made within the confines of performance periods with predefined durations and deadlines for achieving desired levels of performance. The relationship between performance and risk taking has been studied mostly across such periods but rarely within them. Building on the shifting-focus-of-attention model of organizational risk taking, we argue that the temporal proximity of deadlines regulates the focus of organizational attention within a performance period. Decision makers will focus their attention on attaining and maintaining aspirations early in a period; however, as deadlines approach, decision makers in underperforming firms will increasingly be likely to focus on ensuring survival, whereas decision makers in outperforming firms will increasingly be likely to focus on experimenting with slack resources. We propose that the relationship between performance and …", "num_citations": "57\n", "authors": ["907"]}
{"title": "The dynamics of mass online marketplaces: A case study of an online auction\n", "abstract": " The Internet has dramatically changed how people sell and buy goods. In recent years we have seen the emergence of electronic marketplaces that leverage information technology to create more efficient markets such as online auctions to bring together buyers and sellers with greater effectiveness at a massive scale. Despite the growing interest and importance of such marketplaces, our understanding of how the design of the marketplace affects buyer and seller behavior at the individual level and the market effectiveness at the aggregate level is still quite limited. This paper presents a detailed case study of a currently operational massive scale online auction marketplace. The main focus is to gain initial insights into the effects of the design of the marketplace. The results of the study point to several important considerations and implications not only for the design of online marketplaces but also for the design of …", "num_citations": "49\n", "authors": ["907"]}
{"title": "Learning and forgetting curves in software development: Does type of knowledge matter?\n", "abstract": " What type of knowledge, among domain, technology, and methodology knowledge, is most influential to the performance of software development? We answer to this question by empirically investigating the learning and forgetting curves in software development using an extensive archival data set of software development projects in an IT service company. We find that prior experiences with the same methodology or technology have a stronger impact on software project performance than those in the same application domain. Furthermore, our results show that methodology knowledge is more easily forgotten than domain or technology knowledge. Our findings provide managerial implications not only to the development of knowledge and skills, but also to other organizational issues in software development such as project team staffing and career development.", "num_citations": "36\n", "authors": ["907"]}
{"title": "Learning from prior experience: an empirical study of serial entrepreneurs in IT-enabled crowdfunding\n", "abstract": " Crowdfunding has gained momentum in recent years. Even though an increasing amount of research has been devoted to this domain, the dynamics of this phenomenon has yet to be fully studied. The current study strives to bridge this gap by examining the impacts of prior experiences from serial entrepreneurs’ perspective. Drawing on organizational learning theory, we theorize about the differential effects from several experience dimensions: direct vs. indirect experiences, successful vs. failed experiences, experience richness and diversity of prior experiences. Employing a panel-level analysis approach, we document positive effects of both direct and indirect learning. However, the successful, rich and diverse experience do not always seem to facilitate learning and consequently lead to enhanced performance. Our study applies the organizational learning theory to the crowdfunding context to extend the existing crowdfunding literature in information systems by investigating the dynamics across campaigns. We also provide practical implications for entrepreneurs and platform operators.", "num_citations": "33\n", "authors": ["907"]}
{"title": "Impact of social ties on open source project team formation\n", "abstract": " In this paper, we empirically examined the role of social ties in OSSD team formation and developer joining behavior. We find that the existence and the amount of prior social relations in the network do increase the probability of an OSS project to attract more developers. Interestingly, for projects without preexisting social ties, developers tend to join the project initiated by people with less OSSD experience. This research fills a gap in the open source literature by conducting an empirical investigation of the role of social relations on project team formation behavior. Furthermore, the adoption of social network analysis, which has received little attention in the OSS literature, can yield some interesting results on the interactions among OSS developers.", "num_citations": "27\n", "authors": ["907"]}
{"title": "Evaluating Website Performance in Internetbased Selling from a Business Value Perspective\n", "abstract": " Current evaluative approaches for the performance of e-commerce Web sites fail to adequately address senior manager concerns about the returns on investment (ROI) of corporate efforts to develop and deploy software applications that support Internet-based selling. In this article, we explore the basis for developing a new approach to the evaluation and the prioritization of software development activities that modify the capabilities of Web sites in terms of the quality of services that they can deliver to a firm’s customer-users. Our key insight is that the design of Web-based software applications must be business value-driven. We also argue that decisions about the kinds of changes and adjustments that are appropriate should be based upon measurement approaches that emphasize the managerial actions that are possible as a result of new ways of thinking about Web-based performance assessment and the application of Web-based data mining techniques. To illustrate this perspective, we examine the qualities of currently available evaluative approaches in the context of the Internet-based sales activities of OnlineGrocery. com, and propose a new framework to guide research that aims to formulate a new valuedriven metrics suite for e-commerce Web site performance that emphasizes the ROI outcomes. At ICEC2001, we will present the background of this work, and additional theoretical and empirical extensions that will show the efficacy of our approach for guiding Web design adjustments to support Internet-based selling.", "num_citations": "27\n", "authors": ["907"]}
{"title": "Designing for ROI: toward a value-driven discipline for e-commerce systems design\n", "abstract": " E-business management is an on-going process of understanding consumer needs and developing online solutions to meet those needs. To be effective in today's competitive environment of e-commerce, e-businesses cannot afford to neglect justifying the return on investment (ROI) of their online operations. Ideally, companies would like to understand how users are using their Web site and how this translates into value creation (or value leakage) so that online solutions can be implemented to increase business performance. However, the current situation is that such value-driven management is not possible due to the lack of tools and methods that can provide a clear link between systems design and business performance. This paper presents a value-driven systems design methodology for e-commerce Web sites. The focus of our methodology is on identifying value-creating opportunities and value …", "num_citations": "25\n", "authors": ["907"]}
{"title": "Winner takes all? The “blockbuster effect” in crowdfunding platforms\n", "abstract": " Crowdfunding has gained momentum in recent years. Even though an increasing amount of research has been devoted to the economic value of crowdfunding marketplaces, the interactions and effects among crowdfunding projects have yet to be fully studied. The current study strives to bridge this gap by examining the impacts of\" blockbuster projects\"—ie, overwhelmingly successful projects–on the crowdfunding platform. Hypotheses are formulated based on the theory of network effects. Our preliminary results suggest the blockbuster projects exhibit positive spill-over effects within project category but cannibalization effects across categories. We also find evidence of lasting positive/negative network externality within/across category/categories. Further analysis suggests that fresh backers who are attracted to the platform by the blockbuster projects tend to be more engaged and more active. Our research aims to extend the emergent crowdfunding literature by examining network externalities among projects. We also provide practical implications for project creators and platform administrators.", "num_citations": "22\n", "authors": ["907"]}
{"title": "An exploratory study of open source projects from a project management perspective\n", "abstract": " As open source software (OSS) development is gaining tremendous popularity, effective OSS project management is becoming increasingly crucial to the success of OSS projects. However, few studies have examined open source from project management perspective. Furthermore, the congruence between project characteristics and project management has not been recognized in the existing OSS literature despite the vast variety of open source projects in existence. In this paper we identify two fundamental types of OSS projects based on the intended audience of projects, namely user-targeted projects and developer-targeted projects. Then we try to identify the aspects of project management that have an impact on OSS project performance for different types of projects. Our empirical analysis of a large sample of open source projects indicates that human resource staffing and release management are crucial to both types of projects. In addition, compensation management is particularly important to usertargeted projects whereas communication and coordination is particularly essential to developertargeted projects.", "num_citations": "21\n", "authors": ["907"]}
{"title": "Why are some representations (sometimes) more effective?\n", "abstract": " Graphical representations are used heavily in systems analysis and design without proper verification of their usability. However, different representations have varying impacts on the effectiveness of systems analysts. The objective of this study was to explore the effects of diagrammatic representations on task behavior and performance. A cognitive model of an analysis and design task using diagrams was proposed, from which hypotheses about the effects of diagrammatic representation on task behavior and performance were derived. A laboratory experiment was conducted to test the hypotheses. Results of the experiment show that the representational features of the diagrams induced subjects to adopt different problem solving strategies, which resulted in different task performances.", "num_citations": "19\n", "authors": ["907"]}
{"title": "Information foraging in internet-based selling: a system design value assessment framework\n", "abstract": " Information foraging theory provides a theoretical perspective for the study of different online consumer purchase behaviors that need to be understood to support a sound basis for the measurement of business value of the design of Web-based applications. In this chapter, we examine the extent to which online consumer purchases are effectively supported through systems design choices in Web-based applications through a series of five classical stages in consumer purchase decision-making. They include need arousal, information search, product evaluation, purchase decision, and post-purchase evaluation. We distinguish between different purchase behavior settings through a framework that identifies purchase decision-making contingencies in the context of three different consumer purchase scenarios: convenience goods, researched goods, and replenishment goods. The different types of …", "num_citations": "17\n", "authors": ["907"]}
{"title": "Learning effects of domain, technology, and customer knowledge in information systems development: An empirical study\n", "abstract": " This study examines learning effects (i.e., the effects of prior experience) in information systems development (ISD). ISD is characterized by disparate tasks, teams, and levels of project complexity across projects. These features challenge our understanding of how learning effects occur in the ISD context. Drawing on the theory of transfer of learning, this study examines how ISD project teams learn and under what conditions the learning effects are stronger or weaker. We find that ISD project teams’ experience in prior projects translates into performance gains for the current ISD project when the prior and current projects share the same domain, technology, or customer knowledge elements—domain, technology, and customer being the most essential knowledge types for ISD. Moreover, we find that the learning effects of domain, technology, and customer knowledge are substitutive for one another and that these …", "num_citations": "14\n", "authors": ["907"]}
{"title": "A methodology for business value-driven website evaluation: a data envelopment analysis approach\n", "abstract": " Managers at e-commerce firms are in need of proven methods for ongoing website evaluation. However, current approaches to website evaluation are not perfectly suited to the task at hand. This paper proposes a new business value-driven approach to website evaluation, which is theoretically grounded in the economic theory of production. We view online shopping as an economic production process in which customers are using various functionalities of an e-commerce website in order to complete a purchase transaction. This view enables us to formulate a novel perspective on website performance—the ability to transform inputs (ie, use of website functionalities) into outputs (ie, completed purchase transactions). We propose two DEA-based metrics, InefficiencyBreadth and UnitInefficiency that help identify website functionalities that are potentially ineffective.", "num_citations": "14\n", "authors": ["907"]}
{"title": "Measuring and Comparing the Effectiveness of e-commerce Website Designs\n", "abstract": " The assessment of the effectiveness of e-commerce websites is of critical importance to online retailers. However, the current techniques for evaluating effectiveness are limited in that they do not allow for formal empirical measurement of the productivity and performance of the website. In this paper, we use the theoretical perspective of production economics to measure the performance of Internet-based selling websites. We model the website as a production system where customers consume inputs (ie, use various functionalities of the website) to produce an output (ie, a basket full of items at checkout). With this basic perspective, we propose an analysis methodology for measuring and comparing website efficiency and attributing observed inefficiency to customer inefficiency or website design inefficiency. The application of the proposed evaluation methodology to a currently operational e-commerce website demonstrates the value of our technique.", "num_citations": "14\n", "authors": ["907"]}
{"title": "Crowd experience and performance: An empirical analysis of crowdsourced new product development\n", "abstract": " Crowdsourcing has widely been used as a strategy for sourcing ideas and efforts to facilitate innovation and new product development. However, research into to the value creation of crowdsourcing and the efficacy of the crowd is still limited. In this study, we investigate a crowdsourced new product development context and apply the framework of collective intelligence to understand the crowd co-creation process. Based on the theory of diversity about generalists vs. specialists, we examine the role of prior experience in affecting crowd performance. Our empirical analysis shows that participants with both diverse and specialized experience are helpful in enhancing crowd performance in terms of efficient product development. We also find participants with T-shaped experience in non-focal tasks are beneficial. Contrary to other group contexts, generalists do not seem to be a valuable type in our study context. The findings provide insights for understanding collaboration and value co-creation in crowdsourcing communities.", "num_citations": "12\n", "authors": ["907"]}
{"title": "Impact of online word-of-mouth on the market for consumer goods–the interplay between adoption rate, product market life and market size\n", "abstract": " Information and communication technologies have given rise to large-scale online word-of-mouth (WOM) referral networks which allow consumers to share information about products. With a larger online referral network, consumers are exposed to higher volume of WOM. Given the increased amount of WOM, consumers could face more intensified social pressures which would alter their adoption behaviors. While prior studies have mainly focused on the volume of WOM on product sales, the second-order effects of those enlarged online networks on consumers’ adoption behaviors and the market-level consequences such as product market life and size have not yet been explored. This paper studies (1) the impact of larger WOM networks on consumers’ adoption rates,(2) the consequent changes of product market lives and sizes, and (3) how these patterns differentiate across product types. Using 15 years movie data, we first empirically verify that adoption speed could have accelerated around 1998-1999. We attribute this structural shift to the early stages in the acceptance of popular online movie rating websites such as IMDB. Next, we theorize the dynamic impacts of a broader reach of WOM on market structures in terms of market life duration and size via an agent-based simulation model. We further propose four product categories based on different adoption attributes and show that adoption rate, market life and market size evolve differently under different product categories. We conclude with managerial implications of the findings.", "num_citations": "10\n", "authors": ["907"]}
{"title": "Toward a strategic perspective of information technology\n", "abstract": " This chapter explores theoretical conceptualizations of IT beyond current common resource-based perspectives, in the hopes that MIS research may benefit from an improved understanding of the role, use, application and alignment of IT with the full spectrum of strategic management’s core theoretical perspectives. We argue that research in both fields needs to look at the fundamental value (profit) assumptions, as grounded in strategic management theory, to provide insights into the true role of IT in a firm and its performance. This chapter offers an integrative solution framework to attempt to position IT in the context of some common strategic management theoretical perspectives, which may serve as a basis to assess the validity of future MIS research.", "num_citations": "10\n", "authors": ["907"]}
{"title": "A cognitive engineering study on the development of an object oriented process modeling formalism\n", "abstract": " The task of business engineering (BE) would be effective if provided with tools that support the analysis and understanding of a business system. The study aims at: 1) empirically investigating the cognitive processes of analyzing multiple models of the object oriented methodology; 2) identifying the problem solving strategy for understanding a business system; and 3) proposing a modeling formalism that fits the problem solving strategy. The results of this study show that existing object oriented methodologies need to be revised for providing integrated and multi dimensional views of the core business process. We suggest low level use case diagrams and time, cost and quality dimensional message trace diagrams to provide a comprehensive modeling formalism of object oriented business engineering.", "num_citations": "10\n", "authors": ["907"]}
{"title": "Reasoning with multiple diagrams: focusing on the cognitive integration process\n", "abstract": " In order to understand diagrammatic reasoning where multiple diagrams are involved, this study proposes a theoretical framework that focuses on the cognitive process of perceptual and conceptual integration. The perceptual integration process involves establishing interdependencies between the relevant data that have been dispersed across multiple diagrams, while the conceptual integration process involves generating and refining hypotheses by combining the individual data inferred from the diagrams. An experiment within the domain of business systems engineering was conducted where verbal protocols were collected. The results of the experimental study reveal that understanding a system represented by multiple diagrams involves a tedious process of visually searching for related information and of conceptually developing hypotheses about the target system. The results also showed that these perceptual and conceptual processes could be facilitated by providing visual cues that indicate where elements in one diagram are related to elements in other diagrams, and contextual information that indicates how the individual datum in one diagram is related to the overall hypothesis about the entire system. lem, a set of multiple diagrams is designed to support a wide range of problem solving activities. However, only a few studies have dealt with the cognitive processes involved in using multiple diagrams (Cheng, 1996). Even though multiple diagrams are extensively used in common practice, previous research on diagrammatic reasoning have focused on diagrammatic representation within a single diagram. Hence issues concerning …", "num_citations": "10\n", "authors": ["907"]}
{"title": "How rewarding are your rewards? A value-based view of crowdfunding rewards and crowdfunding performance\n", "abstract": " In this study, we integrate the insights of consumption value theory and the crowdfunding literature to develop a value-based view of crowdfunding rewards to systematically theorize and synthesize the underlying mechanisms through which the various rewards offered by crowdfunding projects can incentivize crowdfunders’ backing decisions. Identifying three basic value dimensions carried by different crowdfunding rewards, utilitarian value, socioemotional value, and participatory value, our value-based view posits that these three values satisfy crowdfunders’ different needs and thus motivate them to back a project on distinct grounds and considerations. Through this view, the performance of a crowdfunding project can thus be shaped by the joint effects of the three values delivered by all of its offered rewards. Given their distinct incentivizing mechanisms, we further posit that socioemotional value and …", "num_citations": "9\n", "authors": ["907"]}
{"title": "Scarcity strategy in crowdfunding: An empirical exploration of reward limits\n", "abstract": " Scarcity-based marketing strategies have been widely embraced to communicate the potential unavailability of an item to increase sales. Recently, a similar practice has been prevalently implemented in reward-based crowdfunding in the form of reward limits, whereby campaign creators restrict the number of backers for each reward tier. Whereas most current research has focused on the design strategies of crowdfunding campaigns, less attention has been paid to how campaign design implicates backer-as-consumer needs in reward-based crowdfunding. Drawing on the marketing literature regarding product scarcity and consumer psychology, the current study strives to fill this void by uncovering the effect of reward limits on eventual and concurrent funding performance. Specifically, we performed campaign-level and campaign day–level analyses on a unique data set from a dominant crowdfunding platform. At …", "num_citations": "9\n", "authors": ["907"]}
{"title": "Strategies of effective reward scheme design on crowdfunding platforms\n", "abstract": " Crowdfunding has been recognized as a new mechanism for fundraising and has recently garnered much attention in IS research. However, the qualitative aspects of project design are not well understood both theoretically and empirically. In this study, we focus on the role of reward scheme design in crowdfunding project success. Through the analysis of the qualitative aspects of reward schemes, we identify six types of rewards and investigate their impacts on project success based on the theory of consumption values. Our preliminary analysis shows that including a greater number of reward types does not lead to higher likelihood of project success. In addition, not all of the reward types offering multiple consumption values are beneficial for project success. Our subsample analysis based on project categories reveal that the various contexts in crowdfunding platforms shape the effectiveness of different reward …", "num_citations": "9\n", "authors": ["907"]}
{"title": "Examining the effectiveness of electronic group communication technologies: The Role of the conversation interface\n", "abstract": " Recently, a growing body of empirical research has begun to examine the practice of electronic group communication. Electronic group communication is a key process through which people can maintain communities of practice and leverage the strength of weak ties. Even though prior empirical investigations of electronic group communication have been successful at providing evidence for its effectiveness, these prior studies have not adequately dealt with the differences in the types of technology implementations of electronic group communication. We argue that different social and technical designs of electronic group communication technologies will influence various aspects of electronic group communication, such as level of participation, patterns of interaction and genres of communicative purposes. We propose and define the notion of conversation interface to be an important factor in electronic group communications. This paper illustrates the characteristics of the conversation interface and derives propositions concerning the impacts of conversation interface on electronic group communication based on prior theory. We also conduct an exploratory investigation of actual electronic group communication technologies to highlight the importance of the conversation interface factor. The paper concludes with discussions and directions for future research on electronic group communications.", "num_citations": "8\n", "authors": ["907"]}
{"title": "The role of online peer-to-peer lending in crisis response: evidence from Kiva\n", "abstract": " Online peer-to-peer (P2P) lending, a new form of microfinance, has been touted as to its prominent potential for reducing world poverty. Although a growing body of IS research has been devoted to examining online P2P lending, how such platforms actually make a difference in curbing poverty has yet to be fully explored. The Ebola outbreak of 2014 provides us a unique empirical opportunity to explore such broader impacts of online P2P lending. Leveraging this event as a natural experiment, we investigate how the demand and supply sides of P2P lending platforms react to an unpredictable crisis. Employing a difference-in-difference identification strategy with data from Kiva. org, we conduct country-and loan-level estimations. Preliminary results show upward trends on both demand and supply sides of P2P lending; borrowers request more financial capital and lenders are more active in their lending behaviors in the post-crisis period. We extend online P2P lending literature by investigating the influences of “off-platform” shocks on within-platform behaviors.", "num_citations": "7\n", "authors": ["907"]}
{"title": "Scarcity strategy in crowdfunding: An empirical exploration\n", "abstract": " Scarcity-based marketing strategy has been increasingly adopted in reward-based crowdfunding in the form of reward limits, whereby project creators are able to restrict the quantity of contributors in each reward tier. This study uncovers the effect of reward limits in eventual and concurrent funding performance. Specifically, we performed campaign and campaign-day level analysis. At the campaign level, we find that setting reward limit at the beginning of a campaign is beneficial for final funding outcomes across four different performance measures. The number of limited reward tiers is shown to have an inverted U-shaped relationship with fundraising performance. Potential endogeneity issues are addressed with propensity score matching and the Heckman selection model. At the campaign-day level, we find incorporating new limited reward tiers is helpful for attracting new backers, but having reward tiers being “sold out” will demotivate subsequent backers to contribute thus lead to lower funding speed in subsequent days.", "num_citations": "6\n", "authors": ["907"]}
{"title": "Knowledge Overlap, Task Interdependence, and Trust in IS Development\n", "abstract": " Information systems development (ISD) is fundamentally a search process by which the team seeks to find an optimal system configuration that produces the highest performance. As information systems are embodiments of business-domain knowledge and technical knowledge, ISD requires both. The business unit is ultimately responsible for making business design choices whereas the IS unit is largely responsible for making technical design choices. Complexity in ISD arises when these design choices are interdependent. We argue that knowledge overlaps between business and IS play an important role in the ISD process. Using an NK fitness landscapes model of ISD, this research investigates how knowledge overlaps influence ISD performance (1) when the level of interdependencies among design choices varies,(2) for different distributions of within-unit and between-unit interdependencies,(3) when between-unit interdependencies are balanced or skewed, and (4) when inter-unit trust exists or doesn’t. We report the results of a simulation study and discuss their implications and insights.", "num_citations": "6\n", "authors": ["907"]}
{"title": "The effect of crowdfunding success on subsequent financing outcomes of start-ups\n", "abstract": " From the perspective of signaling theory, this study examines how the receipt of crowdfunding (compared with angel investing) is associated with start-ups’ subsequent financing outcomes. We collected data on crowdfunded start-ups as well as angel-funded start-ups and their subsequent financing from venture capitalists. Our results, after addressing the potential endogeneity using a bivariate probit model and propensity score matching, show that crowdfunded start-ups and angel investing start-ups have no statistically significant difference in receiving subsequent venture capital (VC) investments. Interestingly, however, the effect of obtaining crowdfunding on the receipt of subsequent investments from VCs differs across different characteristics of startup-ups. Moreover, when we compare corporate venture capitalists (CVCs) with independent venture capitalists (IVCs), obtaining crowdfunding is positively …", "num_citations": "5\n", "authors": ["907"]}
{"title": "The role of project modularity in information systems development\n", "abstract": " Recent surveys have shown that ISD project success rates are particularly low. Organizations are applying a wide array of information systems development methodologies (ISDMs)–both plan-based and agile, such as waterfall, scrum and XP–to improve information systems development (ISD) performance. However, as ISD projects often have different characteristics such as size, scope and complexity, prior studies have been focused on helping organizations better choose an ISDM for projects. Nevertheless, prior research has not taken into consideration the notion of problem modularity of ISD projects. In this study, we utilize the NK fitness landscapes model to computationally examine via computer simulations the effects of problem modularity alongside various project environmental factors, and aim to answer the question: under various environmental factors, which ISDM should an ISD team adopt under various degree of problem modularity?", "num_citations": "5\n", "authors": ["907"]}
{"title": "Measuring the effectiveness of e-commerce website design and its impact on business value\n", "abstract": " This dissertation consists of three essays that offer an in depth analysis of the impact of e-commerce website design. The first essay presents a conceptual framework for understanding the efficacy of systems design for Internet-based selling. Using the conceptualization of online shopping as information processing (ie, purchase decision making), I characterize the online purchasing process as information foraging, which makes it possible to conceptualize the effectiveness of website design in terms of how well the website enables the consumer to achieve high levels of return on information foraging. I present a framework that identifies purchase decision-making contingencies in the context of three different consumer purchase scenarios. The framework is illustrated and evaluated with reference to mini-cases for each of the purchase scenarios. The results of the mini-case analyses suggest a number of design …", "num_citations": "4\n", "authors": ["907"]}
{"title": "Popularity and Competition in a Digital Platform Ecosystem: A Network Perspective\n", "abstract": " Competition in popular digital platform ecosystems is fierce. How to get recognized in a platform system is an important theoretical and practical question. Past research looked at the issue from either demand-side or supply-side network externality. Drawing on the insight that digital innovation is (re) combinatorial, we offer a complementary approach based on a network perspective. Specifically, we argue that that the essential value of a digital ecosystem is determined by the recursive feedback of the functional fit of digital products that eventually allows the structure of a digital ecosystem to evolve and change over time. We adopt a network perspective to propose the underlying mechanism of the multi-layered dynamics between digital products and the uncoordinated design actions of third-party developers. We analyze the source code data of all available packages from the R platform system from the beginning of 1991 to September 2016. We statistically capture the value of the generative role of digital products developed by others on increasing the popularity of new digital products and the change driven by the (re) combinatorial design pattern of third-party developers.", "num_citations": "3\n", "authors": ["907"]}
{"title": "Tapping the Crowd for Feedback: The Dynamics of Strategic Behaviors in Crowdfunding\n", "abstract": " Crowdfunding is a novel mechanism for sourcing financial capital for entrepreneurial ventures. The IT-enabled nature of crowdfunding platforms facilitates entrepreneurs to interact directly with current and prospective backers and to obtain timely and immediate feedback from the market during the fundraising process. Despite the dynamic nature of this process, there is a notable dearth of attention to it. The present study strives to fill this gap by examining the influences of fundraising patterns on entrepreneurs’ strategic behaviors for managing the project during the course of fundraising. Drawing upon the performance feedback model from the behavioral theory of the firm, we propose hypotheses related to the influences of concurrent funding performance on entrepreneurs’ exploitative and explorative actions, and the role of deadline proximity in these relationships. The proposed hypotheses will be empirically tested using a unique dataset that contains daily snapshots of crowdfunding projects. Expected theoretical and practical contributions are discussed.", "num_citations": "3\n", "authors": ["907"]}
{"title": "Impact of Knowledge Management Strategy on Organizational Learning: A Simulation Study\n", "abstract": " This study examines the relationship between an organization’s knowledge management strategy and its learning culture and environment. Knowledge management strategies are often perceived as technological solutions; however their effectiveness is the outcome of how effectively the behavioral changes that these strategies pertain are brought about. The first part of this study aims at identifying the learning cultures that are most conducive to the acquisition and sharing of both tacit and explicit knowledge. The second part of this study focuses on implementing incentive mechanisms within the organization that induce the optimal learning behaviors identified in the first part of the study. March’s (1991) model for organizational learning is employed in the context of knowledge management systems (KMS) to analyze the effectiveness of the various knowledge management strategies in different organizational …", "num_citations": "3\n", "authors": ["907"]}
{"title": "E-Commerce Site Design, Online Consumer Behavior and Business Value\n", "abstract": " This research consists of three studies that offer an in depth analysis of the impact of e-commerce web site design. The first study examines online consumer behavior–does online consumer behavior follow the process model of purchasing?, can we observe the various motivations for online shopping (eg, directed buying, hedonic browsing, search and deliberation vs. knowledge building)?, how are these online behaviors instantiated?, does online consumer behavior change over time? If so, how? We develop a theoretical typology of online consumer behavior and test it by uncovering taxonomies of online consumer behavior from clickstream data. The second examines the measurement of the effectiveness e-commerce web site design–how can we conceptualize and measure the effectiveness of an e-commerce web site?, can we identify web site design inefficiencies? For this, we define the concept of web site design efficiency as the degree to which the intended usage of a web site matches a customer’s actual usage given her current shopping goal. We empirically evaluate the effectiveness of an ecommerce web site using data envelopment analysis (DEA) on clickstream data. Finally, the third study investigates the business value of e-commerce site design–does web site design efficiency translate into business value?, what are the sources of business value created? We empirically assess the business value of web site design efficiency on process level measures as well as on customer value using clickstream data.", "num_citations": "3\n", "authors": ["907"]}
{"title": "How is the designer different from the user?—Focusing on a software development methodology\n", "abstract": " Graduate School of Industrial Administration Carnegie Mellon University Pittsburgh, Pennsylvania 15213 lerch@ andrew. cmu. edu", "num_citations": "3\n", "authors": ["907"]}
{"title": "Handling Missing Values in Information Systems Research: A Review of Methods and Assumptions\n", "abstract": " In today’s big data environment, missing values continues to be a problem that harms the data quality. The bias caused by missing values raises the highest concern as it cannot be eliminated simply by increasing the sample size. Although the statistics literature has developed approaches to handling missing values and formulated assumptions regarding when these approaches generate valid statistical inferences, these prescriptions have yet to be broadly accepted by many social science disciplines including the Information Systems (IS) discipline. By reviewing recently published empirical research in information systems, we find that missing values is indeed an important and pervasive problem. We believe that a review of missing value theory is necessary for the IS community to understand the nature of missing values and to promote more rigorous research practice when missing values is often unavoidable. In addition, the not missing at random (NMAR) mechanism brings in challenges in parameter estimation. We contribute to research practice by proposing and demonstrating the superior performance of a Monte Carlo likelihood approach in correcting bias in parameter estimation. We conclude by suggesting that research validity can be enhanced through reasoned adoption of missing value handling method and missing value reporting practice.", "num_citations": "2\n", "authors": ["907"]}
{"title": "The effects of programming style on open source collaboration\n", "abstract": " Open source software (OSS) development has recently garnered much attention from both industry practitioners and academic researchers. However, existing research on OSS usually focus on the role of behavioral factors in affecting collaboration outcomes but has neglected to critically consider the nature of software itself. In this study, we seek to integrate collaboration factors and software factors in OSS collaboration. Specifically, we investigate the role of programming style in open source collaboration, where strict guidelines for coding are usually not enforced. We develop three implications of programming style on contributor, development and diffusion from a diversity perspective. Additionally, two team level factors that moderate the negative effects of programming style are discussed. A comprehensive measure for quantifying programming style is proposed and verified in our preliminary investigation. Our study is expected to contribute to the literature on OSS development, software engineering and diversity in distributed work groups.", "num_citations": "2\n", "authors": ["907"]}
{"title": "The role of prior experience in entrepreneurial learning\n", "abstract": " Crowdfunding, an emergent form of entrepreneurship, has garnered much attention from both researchers and practitioners. Even though an increasing amount of research has been devoted to this domain, the dynamics of this phenomenon has yet to be fully studied. The current study strives to bridge this gap by examining the impacts of prior experiences from serial entrepreneurs’ perspective. Drawing on organizational learning theory, we theorize about the differential effects from several experience dimensions: direct vs. indirect experiences, successful vs. failed experiences, the relatedness, richness and diversity of prior experiences. Employing a panel-level analysis approach, we document positive effects of both direct and indirect learning. However, the successful, related, rich and diverse experience do not always seem to facilitate learning and consequently lead to enhanced performance. Our study applies …", "num_citations": "2\n", "authors": ["907"]}
{"title": "THE EFFECTS OF SPATIAL AND TEMPORAL DISPERSION ON VIRTUAL TEAMS’PERFORMANCE\n", "abstract": " It is been more than 20 years since organizations started relying on virtual teams which are geograph-ically separated. Previous research has outlined several dimensions of the separation; however the consequences of different dimensions of separation and their impact was still unclear due to the chal-lenges of conducting empirical research. In this study, we employ simulation approach and systemati-cally assess the performance of virtual information systems development (ISD) teams under different spatial and temporal settings. Our framework gives us the way to analyze the impact of spatial and temporal dispersion and their components. Our results provide the theoretical and practical insights into management of virtual ISD teams.", "num_citations": "2\n", "authors": ["907"]}
{"title": "Organizational knowledge sharing culture and KMS effectiveness\n", "abstract": " Organizations are increasingly adopting Knowledge Management Systems (KMS) to realize firm and operational level benefits. Many KMS fail to yield desired outcomes due to the lack of understanding of the antecedents of successful KMS. Prior studies have established organizational culture as a key antecedent of successful KM. This study investigates the relationship between KMS effectiveness, in terms of its impact on performance, and organizations’ knowledge culture. We develop a model of organizational knowledge processes and employ simulations to examine how the cultural values that govern the employees’ knowledge seeking and sharing propensities influence the impact of KMS on decision making performance. We find that knowledge seeking propensities have a greater influence on KMS effectiveness than knowledge sharing propensities. We also find organizational cultures that foster such …", "num_citations": "2\n", "authors": ["907"]}
{"title": "The Complex Effects of Cross-Domain Knowledge on IS Development: A Simulation-Based Theory Development\n", "abstract": " Information systems development (ISD) requires both business domain and technology domain knowledge. How cross-domain knowledge affects ISD outcomes is one of the most fundamental and persistent problems in the IS field. We argue that the effect of cross-domain knowledge depends on its distribution across business and IT units and ISD complexity in terms of level and pattern of design element interdependencies. We systematically investigate the complex effects of cross-domain knowledge on ISD performance by using simulations based on the NK fitness landscapes model. We find that cross-domain knowledge not only increases ISD performance but also reduces its variability. These effects are greater when ISD complexity is greater. Cross-domain knowledge is found to increase the robustness of ISD performance across different patterns of design element interdependencies. Interestingly, ISD performance is higher when cross-domain knowledge is unevenly distributed across business and IS units and when its distribution pattern matches the pattern of the design element interdependencies. We develop a theoretical framework and propositions based on our findings.", "num_citations": "1\n", "authors": ["907"]}
{"title": "Transfer Learning in Dynamic Data Environments: Trade-offs in Response to Changes\n", "abstract": " In dynamic data environments, we often lack sufficient information to adjust prediction models in a timely manner. In this study, we investigate whether and how we can use transfer learning (ie, training a model using large but potentially less relevant data sets consisting of both historical and recent source data) when there is only a small amount of source data that exhibits the target data pattern. We provide theoretical insights on when and to what extent transfer learning works by using a sample selection perspective to represent changes. We conduct simulation analyses to examine two practical tradeoffs data analysts face with data changes–1) whether or not they should use transfer learning to retrain the prediction model, and 2) whether they should adjust the prediction model immediately or later when more timely-relevant source data becomes available. Our study offers theoretical and practical guidelines for data analytics in dynamic data environments.", "num_citations": "1\n", "authors": ["907"]}
{"title": "Feature vs. Component Teams for New Software Development: The Mirroring Hypothesis.\n", "abstract": " Despite numerous studies on how to effectively manage the development of new software products, it still remains unclear what is the better organizational structure which can help to deliver valuable products to market faster. In this study, we examine two approaches to form development teams (ie, feature teams that are more customer centric and component teams that are more focused on the systems architecture) and test which type suits better for building new software products with various structures and complexity. The analysis is done via computer simulation which is based on the NK fitness landscapes model. The results show the importance of building teams around customer needs during the initial stages of new software development and the increasing value of cross-team communications as the requirements environment becomes more complex.", "num_citations": "1\n", "authors": ["907"]}
{"title": "Learning from Heterogeneous Experiences: A Fine-grained Understanding of Entrepreneurial Learning in Crowdfunding\n", "abstract": " Crowdfunding has gained momentum in recent years. Even though an increasing amount of research has been devoted to this domain, the dynamics of this phenomenon has yet to be fully studied. The current study strives to bridge this gap by examining the impacts of prior experiences from serial entrepreneurs’ perspective. Drawing on organizational learning theory, we theorize about the differential effects from several experience dimensions: direct vs. indirect experiences, successful vs. failed experiences, experience richness and diversity of prior experiences. Employing a panel-level analysis approach, we document positive effects of both direct and indirect learning. However, the successful, rich and diverse experience do not always seem to facilitate learning and consequently lead to enhanced performance. Our study applies the organizational learning theory to the crowdfunding context to extend the existing crowdfunding literature in information systems by investigating the dynamics across campaigns. We also provide practical implications for entrepreneurs and platform operators.", "num_citations": "1\n", "authors": ["907"]}
{"title": "Winner Takes All? The'Blockbuster Effect'in Crowdfunding Platforms\n", "abstract": " Crowdfunding has gained momentum in recent years. Even though an increasing amount of research has been devoted to the economic value of crowdfunding marketplaces, the interactions and effects among crowdfunding projects have yet to be fully studied. The current study strives to bridge this gap by examining the impacts of\" blockbuster projects\"–ie, overwhelmingly successful projects–on the crowdfunding platform. Hypotheses are formulated based on the theory of network effects. Our preliminary results suggest the blockbuster projects exhibit positive spill-over effects within project category but cannibalization effects across categories. We also find evidence of lasting positive/negative network externality within/across category/categories. Further analysis suggests that fresh backers who are attracted to the platform by the blockbuster projects tend to be more engaged and more active. Our research aims to extend the emergent crowdfunding literature by examining network externalities among projects. We also provide practical implications for project creators and platform administrators.", "num_citations": "1\n", "authors": ["907"]}
{"title": "Is “Open” Always Better? An Exploration of Open Innovation Projects\n", "abstract": " Advances in information technologies (IT) have made organizational boundaries so porous   that knowledge can be easily transferred between firms. There is an increasing trend towards   leveraging on external knowledge for innovation, which is termed open innovation. Open   innovation benefits firms from the recombination of distant knowledge by stimulating   innovative behavior and breakthrough inventions. However, many adopting firms have   experienced significant obstacles in collaborating with external partners from different   technological domains and with distinct organizational backgrounds. In this study, we aim to   disentangle both the value-enhancing and value-diminishing effects of search openness on   open innovation project performance by drawing on the notion of organizational absorptive   capacity, the literatures on IT business value, and extant open innovation literature.  Our   model also …", "num_citations": "1\n", "authors": ["907"]}
{"title": "The Impact of Depth and/or Breadth of Experiences in Software Development Productivity\n", "abstract": " This study empirically examines a question often debated in practice: which professional type - specialists, those with deep and focused experience of a particular knowledge, and generalists, who have experience with a broad range of knowledge - contributes more to software development productivity? In order to find an answer to this question, this study investigates the impacts of specialized experience (i.e., prior experience with the focal knowledge), diverse experience (i.e., prior experience with other non-focal knowledge), and the balance of these two types of experiences on software project productivity. Using an extensive archival data set of software development projects from a prominent IT services company, the study finds that a specialist in the required focal application domain is the most appropriate professional type to serve as project managers, while a specialist in any application domain is …", "num_citations": "1\n", "authors": ["907"]}
{"title": "Developing and validating a methodology for discount usability evaluation of collaboration technologies\n", "abstract": " Usability evaluation of collaboration technologies (CT) needs to address usability specific issues related to human–human interaction between groups of users in addition to those related to human–computer interaction of single user applications. The objective of this study is to develop and validate the collaboration technology usability instrument (CTUI)–a questionnaire-based instrument designed as a discount method for assessing CT usability. The CTUI conceptualises collaboration usability as the fit between the requirements of a collaborative task and the support provided by a collaboration technology in terms of three underlying components of collaboration. The instrument was developed and refined via an online survey and its predictive validity was further assessed via a laboratory experiment that compared the usability of eight different CT used for completing four different collaborative tasks. Results …", "num_citations": "1\n", "authors": ["907"]}
{"title": "The impact of technology on the quality of information\n", "abstract": " When new technologies for production and dissemination of information emerge and are adopted, we see a dramatic increase in the quantity of information that is made available for consumption. However, the impact of these technologies on the quality of information is unclear. In this paper we develop a framework for the process of information production and use it as the basis for an economic model that captures a publisher's decision to produce information. This economic model is used to study the impact of a new technology on the supply of information that is produced in terms of both its quality and quantity. Our results show that reduction in costs and relaxation of capacity constraints lead to an increase and decrease, respectively, in the quality of articles produced by a publisher. We also find that the relaxation of the capacity constraints has a more profound impact on the supply of articles to the publishers …", "num_citations": "1\n", "authors": ["907"]}
{"title": "Identifying e-commerce website design inefficiencies: A business value-driven approach using dea\n", "abstract": " Managers at e-commerce firms are in need of proven methods for website evaluation. So, one of the most pressing issues is whether the design of their online storefronts is effective, and if not, which areas require attention and improvements. However, current approaches (eg, user testing, inspection, inquiry) are not well suited to the task at hand. This paper proposes a new business value-driven approach to website evaluation, which is grounded in the economic theory of production. We conceptualize online shopping as an economic production process in which customers are making use of various functionalities provided by the e-commerce website in order to complete a purchase transaction. This view enables us to formulate a novel perspective on website performance—the ability to transform inputs (ie, use of website functionalities) into outputs (ie, completed purchase transactions). We use data envelopment analysis (DEA) as the methodological vehicle for assessing e-commerce website effectiveness and propose two new metrics, Inefficiency Breadth and Unit Inefficiency to help identify website functionalities that are potentially ineffective. The value of the proposed method is illustrated by applying it to the evaluation of a real-world e-commerce website.", "num_citations": "1\n", "authors": ["907"]}
{"title": "AUTOMATICALLY IDENTIFYING USABILITY PROBLEMS IN WEB SITES THAT SUPPORT INTERNET-BASED SELLING\n", "abstract": " Managers at e-commerce firms are in need of proven methods for evaluating the usability of their Web sites. So, one of the most pressing issues is whether the design of their online storefronts is effective, and if not, which areas require attention and improvements. However, current usability evaluation methods (eg, user testing, inspection and inquiry) are not well suited to the task at hand. This paper proposes a new Web site evaluation approach, which is grounded in the economic theory of production. We conceptualize human-computer interaction during online shopping as an economic production process in which customers are making use of various functionalities provided by the e-commerce Web site in order to complete a purchase transaction. This view enables us to formulate a novel perspective on Web site usability—the ability to transform inputs (ie, use of Web site functionalities) into outputs (ie, completed purchase transactions). We use data envelopment analysis (DEA) as the methodological vehicle for evaluating e-commerce Web sites, and propose two new metrics, Inefficiency Breadth and Unit Inefficiency, to help automatically identify potentially problematic Web site functionalities. The value of the proposed method is illustrated by applying it to the evaluation of a real-world ecommerce Web site.", "num_citations": "1\n", "authors": ["907"]}