{"title": "A unified approach to streamline selection and viewpoint selection for 3D flow visualization\n", "abstract": " We treat streamline selection and viewpoint selection as symmetric problems which are formulated into a unified information-theoretic framework. This is achieved by building two interrelated information channels between a pool of candidate streamlines and a set of sample viewpoints. We define the streamline information to select best streamlines and in a similar manner, define the viewpoint information to select best viewpoints. Furthermore, we propose solutions to streamline clustering and viewpoint partitioning based on the representativeness of streamlines and viewpoints, respectively. Finally, we define a camera path that passes through all selected viewpoints for automatic flow field exploration. We demonstrate the robustness of our approach by showing experimental results with different flow data sets, and conducting rigorous comparisons between our algorithm and other seed placement or streamline …", "num_citations": "76\n", "authors": ["939"]}
{"title": "FlowNet: A Deep Learning Framework for Clustering and Selection of Streamlines and Stream Surfaces\n", "abstract": " For effective flow visualization, identifying representative flow lines or surfaces is an important problem which has been studied. However, no work can solve the problem for both lines and surfaces. In this paper, we present FlowNet, a single deep learning framework for clustering and selection of streamlines and stream surfaces. Given a collection of streamlines or stream surfaces generated from a flow field data set, our approach converts them into binary volumes and then employs an autoencoder to learn their respective latent feature descriptors. These descriptors are used to reconstruct binary volumes for error estimation and network training. Once converged, the feature descriptors can well represent flow lines or surfaces in the latent space. We perform dimensionality reduction of these feature descriptors and cluster the projection results accordingly. This leads to a visual interface for exploring the collection of …", "num_citations": "45\n", "authors": ["939"]}
{"title": "Graphs in scientific visualization: A survey\n", "abstract": " Graphs represent general node‐link diagrams and have long been utilized in scientific visualization for data organization and management. However, using graphs as a visual representation and interface for navigating and exploring scientific data sets has a much shorter history, yet the amount of work along this direction is clearly on the rise in recent years. In this paper, we take a holistic perspective and survey graph‐based representations and techniques for scientific visualization. Specifically, we classify these representations and techniques into four categories, namely partition‐wise, relationship‐wise, structure‐wise and provenance‐wise. We survey related publications in each category, explaining the roles of graphs in related work and highlighting their similarities and differences. At the end, we reexamine these related publications following the graph‐based visualization pipeline. We also point out …", "num_citations": "33\n", "authors": ["939"]}
{"title": "DESvisual: A visualization tool for the des cipher\n", "abstract": " This paper describes a visualization tool DESvisual that helps students understand and instructors teach the building blocks of symmetric encryption. In particular, the tool depicts the primitive operations required to perform the initial permutation and one Feistel round of DES using either an eight or 16 bit input. A student can trace through an encryption performed by the tool, or can be guided through an encryption or decryption, computing the output of each operation herself. This helps students to understand the primitive operations, how these operations are composed into the DES algorithm, and how functions and their composition are depicted and documented. Furthermore, the opportunity for self-study provides an instructor greater flexibility in selecting a lecture pace over this detail-filled material. Security concerns impact an ever increasing number of the applications that computer scientists design and develop. Many security problems are solved through use of cryptography. Unfortunately, computer science students commonly have difficulty with the sophisticated mathematics used in cryptographic algorithms. This problem is exacerbated by the fact that cryptography commonly competes for attention with many other important topics in an undergraduate curriculum.", "num_citations": "31\n", "authors": ["939"]}
{"title": "Similarity-based visualization of large image collections\n", "abstract": " Effective techniques for organizing and visualizing large image collections are in growing demand as visual search gets increasingly popular. Targeting an online astronomy archive with thousands of images, we present our solution for image search and clustering based on the evaluation of image similarity using both visual and textual information. Time-consuming image similarity computation is accelerated using graphics processing unit. To lay out images, we introduce iMap, a treemap-based representation for visualizing and navigating image search and clustering results. iMap not only makes effective use of available display area to arrange images but also maintains stable update when images are inserted or removed during the query. We also develop an embedded visualization that integrates image tags for in-place search refinement. To show the effectiveness of our approach, we demonstrate …", "num_citations": "23\n", "authors": ["939"]}
{"title": "A deformation framework for focus+ context flow visualization\n", "abstract": " Striking a careful balance among coverage, occlusion, and complexity is a resounding theme in the visual understanding of large and complex three-dimensional flow fields. In this paper, we present a novel deformation framework for focus+context streamline visualization that reduces occlusion and clutter around the focal regions while compacting the context region in a full view. Unlike existing techniques that vary streamline densities, we advocate a different approach that manipulates streamline positions. This is achieved by partitioning the flow field's volume space into blocks and deforming the blocks to guide streamline repositioning. We formulate block expansion and block smoothing into energy terms and solve for a deformed grid that minimizes the objective function under the volume boundary and edge flipping constraints. Leveraging a GPU linear system solver, we demonstrate interactive focus+context …", "num_citations": "23\n", "authors": ["939"]}
{"title": "RSAvisual: a visualization tool for the RSA cipher\n", "abstract": " This paper describes a visualization tool RSAvisual that helps students learn and instructors teach the RSA cipher. This tool permits the user to visualize the steps of the RSA cipher, do encryption and decryption, learn simple factorization algorithms, and perform some elementary attacks. The demo mode of RSAvisual can be used for classroom presentation and self-study. With the practice mode, the user may go through steps in encryption, decryption, the Extended Euclidean algorithm, two simple factorization algorithms and three elementary attacks. The user may compute the output of each operation and check for correctness. This helps students learn the primitive operations and how they are used in the RSA cipher. The opportunity for self-study provides an instructor with greater flexibility in selecting a lecture pace for the detailed materials. Classroom evaluation was positive and very encouraging.", "num_citations": "20\n", "authors": ["939"]}
{"title": "FlowString: Partial Streamline Matching Using Shape Invariant Similarity Measure for Exploratory Flow Visualization\n", "abstract": " Measuring the similarity of integral curves is fundamental to many important flow data analysis and visualization tasks such as feature detection, pattern querying, streamline clustering and hierarchical exploration. In this paper, we introduce FlowString, a novel approach that extracts shape invariant features from streamlines and utilizes a string-based method for exploratory streamline analysis and visualization. Our solution first resamples streamlines by considering their local feature scales. We then classify resampled points along streamlines based on the shape similarity around their local neighborhoods. We encode each streamline into a string of well-selected shape characters, from which we construct meaningful words for querying and retrieval. A unique feature of our approach is that it captures intrinsic streamline similarity that is invariant under translation, rotation and scaling. Leveraging the suffix tree, we …", "num_citations": "20\n", "authors": ["939"]}
{"title": "iMap: a stable layout for navigating large image collections with embedded search.\n", "abstract": " Effective techniques for organizing and visualizing large image collections are in growing demand as visual search gets increasingly popular. Targeting an online astronomy archive with thousands of images, we present our solution for image search and clustering based on the evaluation image similarity using both visual and textual information. To lay out images, we introduce iMap, a treemap-based representation for visualizing and navigating image search and clustering results. iMap not only makes effective use of available display area to arrange images but also maintains stable update when images are inserted or removed during the query. We also develop an embedded visualization that integrates image tags for in-place search refinement. We show the effectiveness of our approach by demonstrating experimental results and conducting a comparative user study.", "num_citations": "20\n", "authors": ["939"]}
{"title": "ECvisual: a visualization tool for elliptic curve based ciphers\n", "abstract": " This paper describes a visualization tool ECvisual that helps students understand and instructors teach elliptic curve based ciphers. This tool permits the user to visualize elliptic curves over the real field and over a finite field of prime order, perform arithmetic operations, do encryption and decryption, and convert plaintext to a point on an elliptic curve. The demo mode of ECvisual can be used for classroom presentation and self-study. With the practice mode, the user may go through steps in finite field computations, encryption, decryption and plaintext conversion. The user may compute the output for each operation check each answer for correctness. This helps students understand the primitive operations and how they are used in an elliptic curve cipher. The opportunity for self-study provides an instructor greater flexibility in selecting a lecture pace for this detail-filled material. Classroom evaluation was positive …", "num_citations": "20\n", "authors": ["939"]}
{"title": "HoNVis: Visualizing and exploring higher-order networks\n", "abstract": " Unlike the conventional first-order network (FoN), the higher-order network (HoN) provides a more accurate description of transitions by creating additional nodes to encode higher-order dependencies. However, there exists no visualization and exploration tool for the HoN. For applications such as the development of strategies to control species invasion through global shipping which is known to exhibit higher-order dependencies, the existing FoN visualization tools are limited. In this paper, we present HoNVis, a novel visual analytics framework for exploring higher-order dependencies of the global ocean shipping network. Our framework leverages coordinated multiple views to reveal the network structure at three levels of detail (i.e., the global, local, and individual port levels). Users can quickly identify ports of interest at the global level and specify a port to investigate its higher-order nodes at the individual port …", "num_citations": "17\n", "authors": ["939"]}
{"title": "Reliable fake review detection via modeling temporal and behavioral patterns\n", "abstract": " Fake reviews have become a pervasive problem in online review systems, wherein fraudulent users manipulate the perception of an object (e.g., a restaurant) by fabricating fake reviews. Extensive work has been devoted to identifying fake reviews via modeling different factors separately, such as user features, object characteristics, and user-object bipartite relations. However, this problem remains challenging due to the fact that more advanced camouflage strategies are utilized by malicious users. In real-world scenarios, spammers may pretend to be normal users by giving fake reviews with the similar score distribution as normal users. To address these issues, we propose to explore the temporal patterns of users' review behavior, because spammers prefer to promote or demote the target businesses in a short period of time. In this work, we present a unified framework Reliable Fake Review Detection (RFRD …", "num_citations": "16\n", "authors": ["939"]}
{"title": "A vocabulary approach to partial streamline matching and exploratory flow visualization\n", "abstract": " Measuring the similarity of integral curves is fundamental to many important flow data analysis and visualization tasks such as feature detection, pattern querying, streamline clustering, and hierarchical exploration. In this paper, we introduce FlowString, a novel vocabulary approach that extracts shape invariant features from streamlines and utilizes a string-based method for exploratory streamline analysis and visualization. Our solution first resamples streamlines by considering their local feature scales. We then classify resampled points along streamlines based on the shape similarity around their local neighborhoods. We encode each streamline into a string of well-selected shape characters, from which we construct meaningful words for querying and retrieval. A unique feature of our approach is that it captures intrinsic streamline similarity that is invariant under translation, rotation and scaling. We design an …", "num_citations": "14\n", "authors": ["939"]}
{"title": "VesselMap: A web interface to explore multivariate vascular data\n", "abstract": " Hemodynamics plays a key role in the pathological evolution of vascular diseases such as vascular stenosis, plaques and aneurysms. Augmented visualization of relevant hemodynamic and geometric data accelerates engineering designs of diagnostic and therapeutic methods for those vascular diseases. However, four dimensional (4D) hemodynamic data are intrinsically complex. Consequently, exploration of this information has not been streamlined, despite its importance. In this paper, we propose a web interface to explore multivariate hemodynamic data, thereby facilitating the visualization of spatial and temporal relationships among those hemodynamic parameters of interest. The main thrust of this web system is the proposed VesselMap methodology, a 2D representation of vessel structures that provides an overview of all query results without any visual occlusions. Furthermore, in this framework, quantile …", "num_citations": "11\n", "authors": ["939"]}
{"title": "Spectrum-preserving sparsification for visualization of big graphs\n", "abstract": " We present a novel spectrum-preserving sparsification algorithm for visualizing big graph data. Although spectral methods have many advantages, the high memory and computation costs due to the involved Laplacian eigenvalue problems could immediately hinder their applications in big graph analytics. In this paper, we introduce a practically efficient, nearly-linear time spectral sparsification algorithm for tackling real-world big graph data. Besides spectral sparsification, we further propose a node reduction scheme based on intrinsic spectral graph properties to allow more aggressive, level-of-detail simplification. To enable effective visual exploration of the resulting spectrally sparsified graphs, we implement spectral clustering and edge bundling. Our framework does not depend on a particular graph layout and can be integrated into different graph drawing algorithms. We experiment with publicly available graph …", "num_citations": "10\n", "authors": ["939"]}
{"title": "Exploring Time-Varying Multivariate Volume Data Using Matrix of Isosurface Similarity Maps\n", "abstract": " We present a novel visual representation and interface named the matrix of isosurface similarity maps (MISM) for effective exploration of large time-varying multivariate volumetric data sets. MISM synthesizes three types of similarity maps (i.e., self, temporal, and variable similarity maps) to capture the essential relationships among isosurfaces of different variables and time steps. Additionally, it serves as the main visual mapping and navigation tool for examining the vast number of isosurfaces and exploring the underlying time-varying multivariate data set. We present temporal clustering, variable grouping, and interactive filtering to reduce the huge exploration space of MISM. In conjunction with the isovalue and isosurface views, MISM allows users to identify important isosurfaces or isosurface pairs and compare them over space, time, and value range. More importantly, we introduce path recommendation that …", "num_citations": "10\n", "authors": ["939"]}
{"title": "SHAvisual: a secure hash algorithm visualization tool\n", "abstract": " This poster presents a visualization tool SHAvisual for instructors to teach and students to learn the SHA-512 algorithm visually with demo and practice modes. This poster will also discuss some findings of classroom use and student reactions, which are very positive and encouraging.", "num_citations": "10\n", "authors": ["939"]}
{"title": "CCVis: Visual Analytics of Student Online Learning Behaviors Using Course Clickstream Data\n", "abstract": " As more and more college classrooms utilize online platforms to facilitate teaching and learning activities, analyzing student online behaviors becomes increasingly important for instructors to effectively monitor and manage student progress and performance. In this paper, we present CCVis, a visual analytics tool for analyzing the course clickstream data and exploring student online learning behaviors. Targeting a large college introductory course with over two thousand student enrollments, our goal is to investigate student behavior patterns and discover the possible relationships between student clickstream behaviors and their course performance. We employ higher-order network and structural identity classification to enable visual analytics of behavior patterns from the massive clickstream data. CCVis includes four coordinated views (the behavior pattern, behavior breakdown, clickstream comparative, and …", "num_citations": "9\n", "authors": ["939"]}
{"title": "FlowVisual: Design and evaluation of a visualization tool for teaching 2D flow field concepts\n", "abstract": " Design and Evaluation of a Visualization Tool for Teaching 2D FlowField ConceptsVisual understanding of fluid flows is critically important in many scientific andengineering disciplines. Most fluids (air, water, etc.) are transparent, thus their flowpatterns are invisible to us. Flow visualization is used to make the flow patterns visible sothat we can visually acquire qualitative and quantitative flow information. In this paper, we propose to design a visualization tool to illustrate basic flow field concepts in 2D. Thegoal is to facilitate engineering students in their learning of these essential conceptsthrough exploration and interaction with the tool. Given a 2D flow field, we first compute and display its line integral convolution textureso that the users can intuitively grasp an overview of the underlying flow field data. Wedetect and analyze critical points of various kinds and highlight them in the visualizationto support effective feature-guided seeding. The users can drop seeds in the field and wedepict the “paths” that the seeds will follow at any point in time in an animated fashion sothat the users can observe the integral lines. Besides point seeding for single lines, wealso enable rake seeding so that a group of lines can be traced simultaneously forefficiency. Our tool includes both streamline visualization for steady flow fields andpathline, timeline and streakline visualization for unsteady flow fields. Visuallycomparing streamlines and streaklines, pathlines and timelines, and pathlines andstreaklines allows students to easily understand the similarities and differences amongthese integral lines, which may be difficult to comprehend without visual explanation …", "num_citations": "9\n", "authors": ["939"]}
{"title": "AESvisual: A Visualization Tool for the AES Cipher\n", "abstract": " This paper describes a visualization tool AESvisual that helps students learn and instructors teach the AES cipher. The software allows the user to visualize all the major steps of AES encryption and decryption. The demo mode is useful and efficient for classroom presentation and the practice mode provides the user with an environment to practice AES encryption with error checking. AESvisual is quite versatile, providing support for both beginners learning how to encrypt and decrypt, and also for the more advanced users wishing to see all the details, including the GF (2 8) addition and multiplication operations. Classroom evaluation of the tool was positive.", "num_citations": "8\n", "authors": ["939"]}
{"title": "Semantic flow graph: A framework for discovering object relationships in flow fields\n", "abstract": " Visual exploration of flow fields is important for studying dynamic systems. We introduce semantic flow graph (SFG), a novel graph representation and interaction framework that enables users to explore the relationships among key objects (i.e., field lines, features, and spatiotemporal regions) of both steady and unsteady flow fields. The objects and their relationships are organized as a heterogeneous graph. We assign each object a set of attributes, based on which a semantic abstraction of the heterogeneous graph is generated. This semantic abstraction is SFG. We design a suite of operations to explore the underlying flow fields based on this graph representation and abstraction mechanism. Users can flexibly reconfigure SFG to examine the relationships among groups of objects at different abstraction levels. Three linked views are developed to display SFG, its node split criteria and history, and the objects in …", "num_citations": "7\n", "authors": ["939"]}
{"title": "Semi-Automatic Generation of Stream Surfaces via Sketching\n", "abstract": " We present a semi-automatic approach for stream surface generation. Our approach is based on the conjecture that good seeding curves can be inferred from a set of streamlines. Given a set of densely traced streamlines over the flow field, we design a sketch-based interface that allows users to describe their perceived flow patterns through drawing simple strokes directly on top of the streamline visualization results. Based on the 2D stroke, we identify a 3D seeding curve and generate a stream surface that captures the flow pattern of streamlines at the outermost layer. Then, we remove the streamlines whose patterns are covered by the stream surface. Repeating this process, users can peel the flow by replacing the streamlines with customized surfaces layer by layer. Furthermore, we propose an optimization scheme to identify the optimal seeding curve in the neighborhood of an original seeding curve based on …", "num_citations": "7\n", "authors": ["939"]}
{"title": "An Unsupervised Approach to Inferring the Localness of People Using Incomplete Geotemporal Online Check-In Data\n", "abstract": " Inferring the localness of people is to classify people who are local residents in a city from people who visit the city by analyzing online check-in points that are contributed by online users. This information is critical for the urban planning, user profiling, and localized recommendation systems. Supervised learning approaches have been developed to infer the location of people in a city by assuming the availability of high-quality training datasets with complete geotemporal information. In this article, we develop an unsupervised model to accurately identify local people in a city by using the incomplete online check-in data that are publicly available. In particular, we develop an incomplete geotemporal expectation maximization (IGT-EM) scheme, which incorporates a set of hidden variables to represent the localness of people and a set of estimation parameters to represent the likelihood of venues to attract local and …", "num_citations": "7\n", "authors": ["939"]}
{"title": "Identifying nearly equally spaced isosurfaces for volumetric data sets\n", "abstract": " Isosurfaces are an important visual representation of volumetric data sets and isosurface extraction and rendering remains one of the most popular methods for volume visualization. Previous works identify a small set of representative isosurfaces from a set of sample ones, providing a concise description of the underlying volume. However, these methods do not lend themselves to equally spaced isosurfaces, i.e., keeping the same distance between neighboring isosurfaces, which can be advantageous from the user’s perspective in terms of visual summarization and interactive exploration. In this paper, we present a new solution that efficiently identifies a set of nearly equally spaced isosurfaces for a given volume data set. Our approach includes an estimation stage of linear interpolation and a refinement stage of binary search in order to balance the tradeoff between quality and performance. The refinement stage …", "num_citations": "6\n", "authors": ["939"]}
{"title": "Visual Analysis of Collective Anomalies Through High-Order Correlation Graph\n", "abstract": " Detecting, analyzing and reasoning collective anomalies is important for many real-life application domains such as facility monitoring, software analysis and security. The main challenges include the overwhelming number of low-risk events and their multifaceted relationships which form the collective anomaly, the diversity in various data and anomaly types, and the difficulty to incorporate domain knowledge in the anomaly analysis process. In this paper, we propose a novel concept of high-order correlation graph (HOCG). Compared with the previous correlation graph definition, HOCG achieves better user interactivity, computational scalability, and domain generality through synthesizing heterogeneous types of nodes, attributes, and multifaceted relationships in a single graph. We design elaborate visual metaphors, interaction models, and the coordinated multiple view based interface to allow users to fully …", "num_citations": "6\n", "authors": ["939"]}
{"title": "FlowVisual: A Visualization App for Teaching and Understanding 3D Flow Field Concepts\n", "abstract": " The study of fluid behaviors has been a challenging topic. Flow visualization enables us to visually acquire qualitative and quantitative flow information. There exist various software tools performing different flow visualization tasks. However, we lack tools that help students learn important flow field concepts. In this paper, we present a visualization app, named FlowVisual which runs on iOS devices, to illustrate basic flow field concepts in 3D. In order to meet a comprehensive learning goal for students, we integrate a number of techniques into FlowVisual design, including field-line tracing, field-line comparison, critical point detection and classification, template-based seeding, and surface visualization. We evaluate and demonstrate the effectiveness of FlowVisual by conducting a formal user study including an introduction and training session, an auto-grading test, and a post-questionnaire survey.", "num_citations": "5\n", "authors": ["939"]}
{"title": "Efficient GPU-accelerated computation of isosurface similarity maps\n", "abstract": " We present an efficient GPU-based solution to compute isosurface similarity maps for scientific volume data sets. Our approach first replaces exact isosurface extraction with a binary volume indicating whether each voxel intersects the surface or not. We then employ bounding volume hierarchy (BVH)-trees to speed up the distance field computation. Finally, a self-similarity map is generated from which we identify representative isosurfaces. We apply our approach to compute isosurface similarity maps from different volume data sets of varying sizes and characteristics. The results demonstrate significant speed gain with acceptable loss of accuracy, showing the potential of our solution for handling large-scale time-varying multivariate data sets.", "num_citations": "4\n", "authors": ["939"]}
{"title": "Moving with the flow: an automatic tour of unsteady flow fields\n", "abstract": " Abstract                 We present a novel framework that creates an automatic tour of unsteady flow fields for exploring internal flow features. Our solution first identifies critical flow regions for time steps and computes their temporal correspondence.  We then extract skeletons from critical regions for feature orientation and pathline placement. The key part of our algorithm determines which critical region to focus on at each time step and derives the region traversal order over time using a combination of energy minimization and dynamic programming strategies.  After that, we create candidate viewpoints based on the construction of a simplified mesh enclosing each focal region and select the best viewpoints using a viewpoint quality measure. Finally, we design a spatiotemporal tour that efficiently traverses focal regions over time.  We demonstrate our algorithm with several unsteady flow data sets and perform …", "num_citations": "3\n", "authors": ["939"]}
{"title": "Visual Analysis of Collective Anomalies Using Faceted High-Order Correlation Graphs\n", "abstract": " Successfully detecting, analyzing, and reasoning about collective anomalies is important for many real-life application domains (e.g., intrusion detection, fraud analysis, software security). The primary challenges to achieving this goal include the overwhelming number of low-risk events and their multimodal relationships, the diversity of collective anomalies by various data and anomaly types, and the difficulty in incorporating the domain knowledge of experts. In this paper, we propose the novel concept of the faceted High-Order Correlation Graph (HOCG). Compared with previous, low-order correlation graphs, HOCG achieves better user interactivity, computational scalability, and domain generality through synthesizing heterogeneous types of objects, their anomalies, and the multimodal relationships, all in a single graph. We design elaborate visual metaphors, interaction models, and the coordinated multiple view …", "num_citations": "3\n", "authors": ["939"]}
{"title": "VIGvisual: A Visualization Tool for the Vigenère Cipher\n", "abstract": " This paper describes a visualization tool VIGvisual that helps students learn and instructors teach the Vigenère cipher. The software allows the user to visualize both encryption and decryption through a variety of cipher tools. The demo mode is useful and efficient for classroom presentation. The practice mode allows the user to practice encryption and decryption. VIGvisual is quite versatile, providing support for both beginners learning how to encrypt and decrypt, and also for the more advanced users wishing to practice cryptanalysis in the attack mode. Classroom evaluation of the tool was positive.", "num_citations": "3\n", "authors": ["939"]}
{"title": "On Physical-Social-Aware Localness Inference By Exploring Big Data from Location-Based Services\n", "abstract": " A user’s localness (i.e., whether a user is a local resident in a city or not) and a venue’s local attractiveness (i.e., the likelihood of a venue to attract local people) are important information for many location-based applications related with Cyber-Physical Systems (CPS), such as participatory sensing, urban planning, traffic control and localized travel recommendations. Previous effort has been devoted to geo-locating users in a city using supervised learning approaches, which depend on the availability of high quality training datasets. However, it is difficult to obtain such training datasets in the real-world CPS applications due to the issue of privacy. In this work, we develop an unsupervised approach, called a Physical-Social-Aware Inference (PSAI) scheme, to jointly infer a user’s localness and a venue’s local attractiveness by exploring both the physical and social information embedded in the location-based social …", "num_citations": "2\n", "authors": ["939"]}
{"title": "A study of animated transition in similarity-based tiled image layout\n", "abstract": " For many information visualization applications, showing the transition when interacting with the data is critically important as it can help users better perceive the changes and understand the underlying data. In this paper, we investigate the effectiveness of animated transition in a tiled image layout where the spiral arrangement of the images is based on their similarity. Three aspects of animated transition are considered, including animation steps, animation actions, and flying paths. Exploring and weighting the advantages and disadvantages of different methods for each aspect and in conjunction with the characteristics of the spiral image layout, we present an integrated solution, called AniMap, for animating the transition from an old layout to a new layout when a different image is selected as the query image. We show the effectiveness of our animated transition solution by demonstrating experimental results …", "num_citations": "2\n", "authors": ["939"]}