{"title": "Dakota, A Multilevel Parallel Object-Oriented Framework for Design Optimization, Parameter Estimation, Uncertainty Quantification, and Sensitivity Analysis: Version 6.13 User's …\n", "abstract": " The Dakota toolkit provides a ?exible and extensible interface between simulation codes and iterative analysis methods. Dakota contains algorithms for optimization with gradient and nongradient-based methods; uncertainty quanti?cation with sampling, reliability, and stochastic expansion methods; parameter estimation with nonlinear least squares methods; and sensitivity/variance analysis with design of experiments and parameter study methods. These capabilities may be used on their own or as components within advanced strategies such as surrogate-based optimization, mixed integer nonlinear programming, or optimization under uncertainty. By employing object-oriented design to implement abstractions of the key components required for iterative systems analyses, the Dakota toolkit provides a ?exible and extensible problem-solving environment for design and performance analysis of computational models on high performance computers. This report serves as a user?s manual for the Dakota software and provides capability overviews and procedures for software execution, as well as a variety of example studies.", "num_citations": "1160\n", "authors": ["1419"]}
{"title": "Global sensitivity analysis in an ocean general circulation model: a sparse spectral projection approach\n", "abstract": " Polynomial chaos (PC) expansions are used to propagate parametric uncertainties in ocean global circulation model. The computations focus on short-time, high-resolution simulations of the Gulf of Mexico, using the hybrid coordinate ocean model, with wind stresses corresponding to hurricane Ivan. A sparse quadrature approach is used to determine the PC coefficients which provides a detailed representation of the stochastic model response. The quality of the PC representation is first examined through a systematic refinement of the number of resolution levels. The PC representation of the stochastic model response is then utilized to compute distributions of quantities of interest (QoIs) and to analyze the local and global sensitivity of these QoIs to uncertain parameters. Conclusions are finally drawn regarding limitations of local perturbations and variance-based assessment and concerning potential …", "num_citations": "70\n", "authors": ["1419"]}
{"title": "A priori testing of sparse adaptive polynomial chaos expansions using an ocean general circulation model database\n", "abstract": " This work explores the implementation of an adaptive strategy to design sparse ensembles of oceanic simulations suitable for constructing polynomial chaos surrogates. We use a recently developed pseudo-spectral algorithm that is based on a direct application of the Smolyak sparse grid formula and that allows the use of arbitrary admissible sparse grids. The adaptive algorithm is tested using an existing simulation database of the oceanic response to Hurricane Ivan in the Gulf of Mexico. The a priori tests demonstrate that sparse and adaptive pseudo-spectral constructions lead to substantial savings over isotropic sparse sampling in the present setting.", "num_citations": "39\n", "authors": ["1419"]}
{"title": "Sparse pseudo spectral projection methods with directional adaptation for uncertainty quantification\n", "abstract": " We investigate two methods to build a polynomial approximation of a model output depending on some parameters. The two approaches are based on pseudo-spectral projection (PSP) methods on adaptively constructed sparse grids, and aim at providing a finer control of the resolution along two distinct subsets of model parameters. The control of the error along different subsets of parameters may be needed for instance in the case of a model depending on uncertain parameters and deterministic design variables. We first consider a nested approach where an independent adaptive sparse grid PSP is performed along the first set of directions only, and at each point a sparse grid is constructed adaptively in the second set of directions. We then consider the application of aPSP in the space of all parameters, and introduce directional refinement criteria to provide a tighter control of the projection error along …", "num_citations": "34\n", "authors": ["1419"]}
{"title": "Bayesian inference of drag parameters using AXBT data from Typhoon Fanapi\n", "abstract": " Alexanderian, A.,, J. Winokur,, I. Sraj,, A. Srinivasan,, M. Iskandarani,, W. Thacker,, and O. Knio, 2012: Global sensitivity analysis in an ocean general circulation model: A sparse spectral projection approach. Comput. Geosci., 16, 757–778.", "num_citations": "32\n", "authors": ["1419"]}
{"title": "Quantifying initial and wind forcing uncertainties in the Gulf of Mexico\n", "abstract": " This study aims at analyzing the combined impact of uncertainties in initial conditions and wind forcing fields in ocean general circulation models (OGCM) using polynomial chaos (PC) expansions. Empirical orthogonal functions (EOF) are used to formulate both spatial perturbations to initial conditions and space-time wind forcing perturbations, namely in the form of a superposition of modal components with uniformly distributed random amplitudes. The forward deterministic HYbrid Coordinate Ocean Model (HYCOM) is used to propagate input uncertainties in the Gulf of Mexico (GoM) in spring 2010, during the Deepwater Horizon oil spill, and to generate the ensemble of model realizations based on which PC surrogate models are constructed for both localized and field quantities of interest (QoIs), focusing specifically on sea surface height (SSH) and mixed layer depth (MLD). These PC surrogate models …", "num_citations": "29\n", "authors": ["1419"]}
{"title": "An overview of uncertainty quantification techniques with application to oceanic and oil‐spill simulations\n", "abstract": " We give an overview of four different ensemble‐based techniques for uncertainty quantification and illustrate their application in the context of oil plume simulations. These techniques share the common paradigm of constructing a model proxy that efficiently captures the functional dependence of the model output on uncertain model inputs. This proxy is then used to explore the space of uncertain inputs using a large number of samples, so that reliable estimates of the model's output statistics can be calculated. Three of these techniques use polynomial chaos (PC) expansions to construct the model proxy, but they differ in their approach to determining the expansions' coefficients; the fourth technique uses Gaussian Process Regression (GPR). An integral plume model for simulating the Deepwater Horizon oil‐gas blowout provides examples for illustrating the different techniques. A Monte Carlo ensemble of 50,000 …", "num_citations": "25\n", "authors": ["1419"]}
{"title": "Development of a reduced model of formation reactions in Zr-Al nanolaminates\n", "abstract": " A computational model of anaerobic reactions in metallic multilayered systems with an equimolar composition of zirconium and aluminum is developed. The reduced reaction formalism of M. Salloum and O. M. Knio, Combust. Flame 157(2): 288–295 (2010) is adopted. Attention is focused on quantifying intermixing rates based on experimental measurements of uniform ignition as well as measurements of self-propagating front velocities. Estimates of atomic diffusivity are first obtained based on a regression analysis. A more elaborate Bayesian inference formalism is then applied in order to assess the impact of uncertainties in the measurements, potential discrepancies between predictions and observations, as well as the sensitivity of predictions to inferred parameters. Intermixing rates are correlated in terms of a composite Arrhenius law, which exhibits a discontinuity around the Al melting temperature. Analysis of …", "num_citations": "19\n", "authors": ["1419"]}
{"title": "Adaptive sparse grid approaches to polynomial chaos expansions for uncertainty quantification\n", "abstract": " Polynomial chaos expansions provide an efficient and robust framework to analyze and quantify uncertainty in computational models. This dissertation explores the use of adaptive sparse grids to reduce the computational cost of determining a polynomial model surrogate while examining and implementing new adaptive techniques.", "num_citations": "13\n", "authors": ["1419"]}
{"title": "Simple effective conservative treatment of uncertainty from sparse samples of random variables and functions\n", "abstract": " This paper examines the variability of predicted responses when multiple stress–strain curves (reflecting variability from replicate material tests) are propagated through a finite element model of a ductile steel can being slowly crushed. Over 140 response quantities of interest (QOIs) (including displacements, stresses, strains, and calculated measures of material damage) are tracked in the simulations. Each response quantity's behavior varies according to the particular stress–strain curves used for the materials in the model. We desire to estimate or bound response variation when only a few stress–strain curve samples are available from material testing. Propagation of just a few samples will usually result in significantly underestimated response uncertainty relative to propagation of a much larger population that adequately samples the presiding random-function source. A simple classical statistical method …", "num_citations": "10\n", "authors": ["1419"]}
{"title": "Evaluation of a simple UQ approach to compensate for sparse stress-strain curve data in solid mechanics applications\n", "abstract": " This paper examines the variability of predicted responses when multiple stress-strain curves (reflecting variability from replicate material tests) are propagated through a transient dynamics finite element model of a ductile steel can being slowly crushed. An elastic-plastic constitutive model is employed in the large-deformation simulations. Over 70 response quantities of interest (including displacements, stresses, strains, and calculated measures of material damage) are tracked in the simulations. Each response quantity’s behavior varies according to the particular stress-strain curves used for the materials in the model. The present work assigns the same material to all the can parts: lids, walls, and weld. We desire to estimate response variability due to variability of the input material curves. When only a few stress-strain curve samples are available from material testing, response variance will usually be …", "num_citations": "7\n", "authors": ["1419"]}
{"title": "Propagation of uncertainty and sensitivity analysis in an integral oil‐gas plume model\n", "abstract": " Polynomial Chaos expansions are used to analyze uncertainties in an integral oil‐gas plume model simulating the Deepwater Horizon oil spill. The study focuses on six uncertain input parameters—two entrainment parameters, the gas to oil ratio, two parameters associated with the droplet‐size distribution, and the flow rate—that impact the model's estimates of the plume's trap and peel heights, and of its various gas fluxes. The ranges of the uncertain inputs were determined by experimental data. Ensemble calculations were performed to construct polynomial chaos‐based surrogates that describe the variations in the outputs due to variations in the uncertain inputs. The surrogates were then used to estimate reliably the statistics of the model outputs, and to perform an analysis of variance. Two experiments were performed to study the impacts of high and low flow rate uncertainties. The analysis shows that in the …", "num_citations": "6\n", "authors": ["1419"]}
{"title": "Summary of the 2014 Sandia Verification and Validation Challenge Workshop\n", "abstract": " A discussion of the five responses to the 2014 Sandia Verification and Validation (V&V) Challenge Problem, presented within this special issue, is provided hereafter. Overviews of the challenge problem workshop, workshop participants, and the problem statement are also included. Brief summations of teams' responses to the challenge problem are provided. Issues that arose throughout the responses that are deemed applicable to the general verification, validation, and uncertainty quantification (VVUQ) community are the main focal point of this paper. The discussion is oriented and organized into big picture comparison of data and model usage, VVUQ activities, and differentiating conceptual themes behind the teams' VVUQ strategies. Significant differences are noted in the teams' approaches toward all VVUQ activities, and those deemed most relevant are discussed. Beyond the specific details of VVUQ …", "num_citations": "4\n", "authors": ["1419"]}
{"title": "Can-Crush Model and Simulations for Verifying Uncertainty Quantification Method for Sparse Stress-Strain Curve Data\n", "abstract": " This work examines the variability of predicted responses when multiple stress-strain curves (reflecting variability from replicate material tests) are propagated through a transient dynamics finite element model of a ductile steel can being slowly crushed. An elastic-plastic constitutive model is employed in the large-deformation simulations. The present work assigns the same material to all the can parts: lids, walls, and weld. Time histories of 18 response quantities of interest (including displacements, stresses, strains, and calculated measures of material damage) at several locations on the can and various points in time are monitored in the simulations. Each response quantity’s behavior varies according to the particular stress-strain curves used for the materials in the model. We estimate response variability due to variability of the input material curves. When only a few stress-strain curves are available from material …", "num_citations": "3\n", "authors": ["1419"]}
{"title": "Chaotic mixing and superdiffusion in a two-dimensional array of vortices\n", "abstract": " We present experimental and numerical studies of mixing and long-range transport in an array of vortices forced by a magnetohydrodynamic technique. A current passing horizontally through a thin electrolytic solution interacts with a magnetic field produced by an array of magnets below the fluid. If the current is parallel to one of the primary directions of the magnet array, a square array of vortices is produced. If the current is tilted with respect to the magnet array, however, wavy channels form diagonally through the vortex pattern, allowing tracers in the flow to travel long distances in a short period of time. The addition of a time-dependent current results in a combination of chaotic and ordered vortex/jet regions that produces Levy flights and superdiffusive transport. If an AC current is applied in both cardinal directions, the resulting chaotic mixing is typically barrier-free.", "num_citations": "2\n", "authors": ["1419"]}
{"title": "Cantilever Beam End-to-End UQ Test Problem and Evaluation Criteria for UQ Methods Performance Assessment.\n", "abstract": " • This talk outlines an End-to-End UQ model problem–a “test” problem--physics and uncertainty Truth Models will be released in a year or two for self-checks, workshops?–has many features of real problems that make it useful for significant assessment of UQ and Credibility approaches and their potential practicality and effectiveness on real problems", "num_citations": "1\n", "authors": ["1419"]}
{"title": "Combining HYCOM, AXBTs and Polynomial Chaos Methods to Estimate Wind Drag Parameters during Typhoon Fanapi\n", "abstract": " • Build full posterior with Markov Chain Monte Carlo (MCMC) MCMC requires O (105) estimates of Mi: prohibitive• Solve for center and spread of posterior minimization problem requiring access to cost function gradient and Hessian: Needs an adjoint model• Rely on Polynomial Chaos expansions to replace HYCOM by a polynomial series that could be either summed for MCMC or differentiated for the gradients.", "num_citations": "1\n", "authors": ["1419"]}