{"title": "Rumors, false flags, and digital vigilantes: Misinformation on twitter after the 2013 boston marathon bombing\n", "abstract": " The Boston Marathon bombing story unfolded on every possible carrier of information available in the spring of 2013, including Twitter. As information spread, it was filled with rumors (unsubstantiated information), and many of these rumors contained misinformation. Earlier studies have suggested that crowdsourced information flows can correct misinformation, and our research investigates this proposition. This exploratory research examines three rumors, later demonstrated to be false, that circulated on Twitter in the aftermath of the bombings. Our findings suggest that corrections to the misinformation emerge but are muted compared with the propagation of the misinformation. The similarities and differences we observe in the patterns of the misinformation and corrections contained within the stream over the days that followed the attacks suggest directions for possible research strategies to automatically detect misinformation.", "num_citations": "357\n", "authors": ["2099"]}
{"title": "Examining the alternative media ecosystem through the production of alternative narratives of mass shooting events on Twitter\n", "abstract": " This research explores the alternative media ecosystem through a Twitter lens. Over a ten-month period, we collected tweets related to alternative narratives—for example, conspiracy theories—of mass shooting events. We utilized tweeted URLs to generate a domain network, connecting domains shared by the same user, then conducted qualitative analysis to understand the nature of different domains and how they connect to each other. Our findings demonstrate how alternative news sites propagate and shape alternative narratives, while mainstream media deny them. We explain how political leanings of alternative news sites do not align well with a US left-right spectrum, but instead feature an anti-globalist (versus globalist) orientation where US Alt-Right sites look similar to US Alt-Left sites. Our findings describe a subsection of the emerging alternative media ecosystem and provide insight in how websites that promote conspiracy theories and pseudo-science may function to conduct underlying political agendas.", "num_citations": "226\n", "authors": ["2099"]}
{"title": "Tweak the tweet: Leveraging microblogging proliferation with a prescriptive syntax to support citizen reporting.\n", "abstract": " In this paper, we propose a low-tech solution for use by microbloggers that could enhance their ability to rapidly produce parsable, crisis-relevant information in mass emergencies. We build upon existing research on the use of social media during mass emergencies and disasters. Our proposed intervention aims to leverage the affordances of mobile microblogging and the drive to support citizen reporting within current behavioral Twitter-based microblogging practice. We introduce a prescriptive, tweet-based syntax that could increase the utility of information generated during emergencies by gently reshaping current behavioral practice. This offering is grounded in an understanding of current trends in norm evolution of Twitter use, an evolution that has progressed quickly but appears to be stabilizing around specific textual conventions.", "num_citations": "202\n", "authors": ["2099"]}
{"title": "Connected through crisis: Emotional proximity and the spread of misinformation online\n", "abstract": " During crises, the ability to access relevant information is extremely important for those affected. Previous research shows that social media have become popular for rapid information exchange between members of the online community after crisis events. This study focuses on the effects of proximity to a crisis on information sharing behaviors. Using constructivist grounded theory to guide our inquiry, we conducted interviews with eleven people who used social media in the aftermath of the 2013 Boston Marathon Bombings. Salient themes emerging from this study suggest that both physical and emotional proximity to a crisis influence online information seeking and sharing behaviors. Additionally, speed of information sharing and information access renders social media especially useful during crisis and particularly susceptible to the spread of misinformation. We view the latter as a consequence of the inevitable …", "num_citations": "134\n", "authors": ["2099"]}
{"title": "Examining trolls and polarization with a retweet network\n", "abstract": " This research examines the relationship between political homophily and organized trolling efforts. This is accomplished by analyzing how Russian troll accounts were retweeted on Twitter in the context of the# BlackLivesMatter movement. This analysis shows that these conversations were divided along political lines, and that the examined trolling accounts systematically took advantage of these divisions. The findings of this research can help us better understand how to combat systematic trolling.", "num_citations": "133\n", "authors": ["2099"]}
{"title": "Disinformation as collaborative work: Surfacing the participatory nature of strategic information operations\n", "abstract": " In this paper, we argue that strategic information operations (e.g. disinformation, political propaganda, and other forms of online manipulation) are a critical concern for CSCW researchers, and that the CSCW community can provide vital insight into understanding how these operations function-by examining them as collaborative \"work\" within online crowds. First, we provide needed definitions and a framework for conceptualizing strategic information operations, highlighting related literatures and noting historical context. Next, we examine three case studies of online information operations using a sociotechnical lens that draws on CSCW theories and methods to account for the mutual shaping of technology, social structure, and human action. Through this lens, we contribute a more nuanced understanding of these operations (beyond \"bots\" and \"trolls\") and highlight a persistent challenge for researchers, platform …", "num_citations": "120\n", "authors": ["2099"]}
{"title": "Characterizing online rumoring behavior using multi-dimensional signatures\n", "abstract": " This study offers an in-depth analysis of four rumors that spread through Twitter after the 2013 Boston Marathon Bombings. Through qualitative and visual analysis, we describe each rumor's origins, changes over time, and relationships between different types of rumoring behavior. We identify several quantitative measures-including temporal progression, domain diversity, lexical diversity and geolocation features-that constitute a multi-dimensional signature for each rumor, and provide evidence supporting the existence of different rumor types. Ultimately these signatures enhance our understanding of how different kinds of rumors propagate online during crisis events. In constructing these signatures, this research demonstrates and documents an emerging method for deeply and recursively integrating qualitative and quantitative methods for analysis of social media trace data.", "num_citations": "119\n", "authors": ["2099"]}
{"title": "Designing for the deluge: understanding & supporting the distributed, collaborative work of crisis volunteers\n", "abstract": " Social media are a potentially valuable source of situational awareness information during crisis events. Consistently,\" digital volunteers\" and others are coming together to filter and process this data into usable resources, often coordinating their work within distributed online groups. However, current tools and practices are frequently unable to keep up with the speed and volume of incoming data during large events. Through contextual interviews with emergency response professionals and digital volunteers, this research examines the ad hoc, collaborative practices that have emerged to help process this data and outlines strategies for supporting and leveraging these efforts in future designs. We argue for solutions that align with current group values, work practices, volunteer motivations, and organizational structures, but also allow these groups to increase the scale and efficiency of their operations.", "num_citations": "108\n", "authors": ["2099"]}
{"title": "Digital volunteerism during disaster: Crowdsourcing information processing\n", "abstract": " This paper describes some of the recent efforts to use crowdsourcing for various information processing tasks during disasters and mass emergencies. It highlights several projects that were deployed during the early aftermath of the Haiti earthquake, including one that my colleagues and I helped to launch, Tweak the Tweet. I relate how our deployment efforts and subsequent research on Tweak the Tweet revealed the presence of digital volunteers acting as a layer of human computation in an ad-hoc response community. I discuss the motivations of digital volunteers during disaster, which mirror long-recognized phenomena in human social behavior, and may differ from crowdsourcing efforts in other domains.", "num_citations": "108\n", "authors": ["2099"]}
{"title": "Acting the part: Examining information operations within# BlackLivesMatter discourse\n", "abstract": " This research examines how Russian disinformation actors participated in a highly charged online conversation about the #BlackLivesMatter movement and police-related shootings in the USA during 2016. We first present high-level dynamics of this conversation on Twitter using a network graph based on retweet flows that reveals two structurally distinct communities. Next, we identify accounts in this graph that were suspended by Twitter for being affiliated with the Internet Research Agency, an entity accused of conducting information operations in support of Russian political interests. Finally, we conduct an interpretive analysis that consolidates observations about the activities of these accounts. Our findings have implications for platforms seeking to develop mechanisms for determining authenticity---by illuminating how disinformation actors enact authentic personas and caricatures to target different audiences …", "num_citations": "97\n", "authors": ["2099"]}
{"title": "Disinformation's spread: bots, trolls and all of us\n", "abstract": " Earlier this month, the White House hosted a'Social Media Summit'that served to reframe and distract from serious, hostile manipulation of online discourse. Much ink has already been spilt on the algorithms, business models and human impulses that make the social-media ecosystem vulnerable to disinformation, the purposeful spreading of misleading content. Although the major tech companies are often insufficiently open about, or motivated to fix, the problem, they have begun to take action against what Facebook calls\" coordinated inauthentic behavior\".But disinformation is not as cut-and-dried as most people assume: those behind disinformation campaigns purposely entangle orchestrated action with organic activity. Audiences become willing but unwitting collaborators, helping to achieve campaigners' goals. This complicates efforts to defend online spaces.", "num_citations": "92\n", "authors": ["2099"]}
{"title": "Keeping up with the tweet-dashians: The impact of'official'accounts on online rumoring\n", "abstract": " This paper examines how'official'accounts participate in the propagation and correction of online rumors in the context of crisis events. Using an emerging method for interpretive analysis of'big'social data, we investigate the spread of online rumors through digital traces-in this case, tweets. Our study suggests that official accounts can help to slow the spread of a rumor by posting a denial, and-supported by reflections from an organization that recently dealt with a rumor-crisis-offers best practices for organizations around social media strategies and protocols. Based on tweet data and connections to existing literature, we also demonstrate and discuss how mainstream media participate in rumoring, and note the role of a new breed of online media,'breaking news' accounts. This analysis offers a complementary perspective to existing studies that use surveys and interviews to characterize the role official accounts play …", "num_citations": "87\n", "authors": ["2099"]}
{"title": "How information snowballs: Exploring the role of exposure in online rumor propagation\n", "abstract": " In this paper we highlight three distinct approaches to studying rumor dynamics-volume, exposure, and content production. Expanding upon prior work, which has focused on rumor volume, we argue that considering the size of the exposed population is a vital component of understanding rumoring. Additionally, by combining all three approaches we discover subtle features of rumoring behavior that would have been missed by applying each approach in isolation. Using a case study of rumoring on Twitter during a hostage crisis in Sydney, Australia, we apply a mixed-methods framework to explore rumoring and its consequences through these three lenses, focusing on the added dimension of exposure in particular. Our approach demonstrates the importance of considering both rumor content and the people engaging with rumor content to arrive at a more holistic understanding of communication dynamics. These …", "num_citations": "84\n", "authors": ["2099"]}
{"title": "Social media, public participation, and the 2010 BP Deepwater Horizon oil spill\n", "abstract": " This research examines how information about an oil spill, its impacts, and the use of dispersants to treat the oil, moved through social media and the surrounding Internet during the 2010 BP Deepwater Horizon oil spill. Using a collection of tweets captured during the spill, we employ a mixed-method approach including an in-depth qualitative analysis to examine the content of Twitter posts, the connections that Twitter users made with each other, and the links between Twitter content and the surrounding Internet. This article offers a range of findings to help practitioners and others understand how social media is used by a variety of different actors during a slow-moving, long-term, environmental disaster. We enumerate some of the most salient themes in the Twitter data, noting that concerns about health impacts were more likely to be communicated in tweets about dispersant use, than in the larger conversation …", "num_citations": "80\n", "authors": ["2099"]}
{"title": "# unconfirmed: Classifying rumor stance in crisis-related social media messages\n", "abstract": " It is well-established that within crisis-related communications, rumors are likely to emerge. False rumors, ie misinformation, can be detrimental to crisis communication and response; it is therefore important not only to be able to identify messages that propagate rumors, but also corrections or denials of rumor content. In this work, we explore the task of automatically classifying rumor stances expressed in crisisrelated content posted on social media. Utilizing a dataset of over 4,300 manually coded tweets, we build a supervised machine learning model for this task, achieving an accuracy over 88% across a diverse set of rumors of different types.", "num_citations": "71\n", "authors": ["2099"]}
{"title": "A closer look at the self-correcting crowd: Examining corrections in online rumors\n", "abstract": " This paper examines how users of social media correct online rumors during crisis events. Focusing on Twitter, we identify different patterns of information correcting behaviors and describe the actions, motivations, rationalizations and experiences of people who exhibited them. To do this, we analyze digital traces across two separate crisis events and interviews of fifteen individuals who generated some of those traces. Salient themes ensuing from this work help us describe: 1) different mechanisms of corrective action with respect to who gets corrected and how; 2) how responsibility is positioned for verifying and correcting information; and 3) how users' imagined audience influences their corrective strategy. We synthesize these three components into a preliminary model and explore the role of imagined audiences-both who those audiences are and how they react to and interact with shared information-in …", "num_citations": "67\n", "authors": ["2099"]}
{"title": "Journalists as crowdsourcerers: Responding to crisis by reporting with a crowd\n", "abstract": " Widespread adoption of new information communication technologies (ICTs) is disrupting traditional models of news production and distribution. In this rapidly changing media landscape, the role of the journalist is evolving. Our research examines how professional journalists within a rural community impacted by Hurricane Irene successfully negotiated a new role for themselves, transforming their journalistic practice to serve in a new capacity as leaders of an online volunteer community. We describe an emergent organization of media professionals, citizen journalists, online volunteers, and collaborating journalistic institutions that provided real-time event coverage. In this rural context, where communications infrastructure is relatively uneven, this ad hoc effort bridged gaps in ICT infrastructure to unite its audience. In this paper, we introduce a new perspective for characterizing these information-sharing …", "num_citations": "67\n", "authors": ["2099"]}
{"title": "Could this be true? I think so! Expressed uncertainty in online rumoring\n", "abstract": " Rumors are regular features of crisis events due to the extreme uncertainty and lack of information that often characterizes these settings. Despite recent research that explores rumoring during crisis events on social media platforms, limited work has focused explicitly on how individuals and groups express uncertainty. Here we develop and apply a flexible typology for types of expressed uncertainty. By applying our framework across six rumors from two crisis events we demonstrate the role of uncertainty in the collective sensemaking process that occurs during crisis events.", "num_citations": "66\n", "authors": ["2099"]}
{"title": "Delivering patients to sacré coeur: collective intelligence in digital volunteer communities\n", "abstract": " This study examines the information-processing activities of digital volunteers and other connected ICT users in the wake of crisis events. Synthesizing findings from several previous research studies of digital volunteerism, this paper offers a new approach for conceptualizing the activities of digital volunteers, shifting from a focus on organizing to a focus on information movement. Using the lens of distributed cognition, this research describes collective intelligence as transformations of information within a system where cognition is distributed socially across individuals as well as through their tools and resources. This paper demonstrates how digital volunteers, through activities such as relaying, amplifying, verifying, and structuring information, function as a collectively intelligent cognitive system in the wake of disaster events.", "num_citations": "64\n", "authors": ["2099"]}
{"title": "Drawing the lines of contention: Networked frame contests within# BlackLivesMatter discourse\n", "abstract": " This research examines Twitter discourse related to #BlackLivesMatter and police-related shooting events in 2016 through a mixed-method, interpretative approach. We construct a \"shared audience graph\", revealing structural and ideological disparities between two groups of participants (one on the political left, the other on the political right). We utilize an integrated networked gatekeeping and framing lens to examine how #BlackLivesMatter frames were produced--and how they were contested--by separate communities of supporters and critics. Among other empirical findings, this work demonstrates hashtags being used in diverse ways--e.g. to mark participation, assert individual identity, promote group identity, and support or challenge a frame. Considered from a networked gatekeeping perspective, we illustrate how hashtags can serve as channeling mechanisms, shaping trajectories of information flow. This …", "num_citations": "63\n", "authors": ["2099"]}
{"title": "From situational awareness to actionability: Towards improving the utility of social media data for crisis response\n", "abstract": " People are increasingly sharing information on social media during disaster events. This information could be valuable to emergency responders, but there remain challenges for using it to inform response efforts---including filtering relevant information from the large volumes of noise. Previous research has largely focused on identifying information that can contribute to a generalized concept of situational awareness. Our work explores the value of approaching this problem from a different perspective---one of actionablity---with the idea that information relevance may vary across responder role, domain, and other factors. This approach asks how we can get the right information to the right person at the right time? We interviewed and surveyed diverse responders to understand what \"actionable\" information is, allowing that actionability might differ from one responder to another. Through the findings, we (a) offer a …", "num_citations": "60\n", "authors": ["2099"]}
{"title": "Ecosystem or echo-system? exploring content sharing across alternative media domains\n", "abstract": " This research examines the competing narratives about the role and function of Syria Civil Defence, a volunteer humanitarian organization popularly known as the White Helmets, working in war-torn Syria. Using a mixed-method approach based on seed data collected from Twitter, and then extending out to the websites cited in that data, we examine content sharing practices across distinct media domains that functioned to construct, shape, and propagate these narratives. We articulate a predominantly alternative media “echo-system” of websites that repeatedly share content about the White Helmets. Among other findings, our work reveals a small set of websites and authors generating content that is spread across diverse sites, drawing audiences from distinct communities into a shared narrative. This analysis also reveals the integration of government-funded media and geopolitical think tanks as source content for anti-White Helmets narratives. More broadly, the analysis demonstrates the role of alternative newswire-like services in providing content for alternative media websites. Though additional work is needed to understand these patterns over time and across topics, this paper provides insight into the dynamics of this multi-layered media ecosystem.", "num_citations": "59\n", "authors": ["2099"]}
{"title": "Rumors at the speed of light? Modeling the rate of rumor transmission during crisis\n", "abstract": " Social media have become an established feature of the dynamic information space that emerges during crisis events. Both emergency responders and the public use these platforms to search for, disseminate, challenge, and make sense of information during crises. In these situations rumors also proliferate, but just how fast such information can spread is an open question. We address this gap, modeling the speed of information transmission to compare retransmission times across content and context features. We specifically contrast rumor-affirming messages with rumor-correcting messages on Twitter during a notable hostage crisis to reveal differences in transmission speed. Our work has important implications for the growing field of crisis informatics.", "num_citations": "53\n", "authors": ["2099"]}
{"title": "Engage early, correct more: How journalists participate in false rumors online during crisis events\n", "abstract": " Journalists are struggling to adapt to new conditions of news production and simultaneously encountering criticism for their role in spreading misinformation. Against the backdrop of this\" crisis in journalism\", this research seeks to understand how journalists are actually participating in the spread and correction of online rumors. We compare the engagement behaviors of journalists to non-journalists-and specifically other high visibility users-within five false rumors that spread on Twitter during three crisis events. Our findings show journalists engaging earlier than non-journalists in the spread and the correction of false rumors. However, compared to other users, journalists are (proportionally) more likely to deny false rumors. Journalists are also more likely to author original tweets and to be retweeted-underscoring their continued role in shaping the news. Interestingly, journalists scored high on\" power user\" …", "num_citations": "43\n", "authors": ["2099"]}
{"title": "Communication practices for oil spills: Stakeholder engagement during preparedness and response\n", "abstract": " The Deepwater Horizon (DWH) oil spill was a pivotal moment in the expression of and reporting on stakeholder risk perceptions about oil spills, response options, and safety. Public engagement through both traditional and social media was arguably much higher than in prior spills. The DWH response organization undertook a wide variety of activities to manage risks and communicate with both the general public and those directly affected, such as commercial fishers. However, these did not fully address widespread concerns about ecological and human health risks associated with dispersant use. Consequentially the DWH spill heightened awareness of persistent risk communication problems around oil spill response, and especially dispersant use. Oil spill risk research and experience suggests that institutional and operational factors inhibit engaging communities and stakeholders during oil spill preparedness …", "num_citations": "36\n", "authors": ["2099"]}
{"title": "Social media seamsters: Stitching platforms & audiences into local crisis infrastructure\n", "abstract": " This paper examines social media use after a tragic disaster in a rural community in the USA--the 2014 Oso Landslide. Drawing upon interviews with community members and digital traces from multiple platforms, we explore how affected locals, government responders and journalists utilized a broad range of social media in their work-assembling different platforms to meet the information needs of their audiences. We borrow the analytical lens of stitching suggested by Vertesi, which allows us to see where these infrastructural alignments are seamless vs. seamful-highlighting some of the emergent and persistent challenges for those responding to disasters with and through social media. We demonstrate how this work is extremely dynamic, as the technical affordances of these platforms and the evolving practices of users shape how crisis communication occurs. Simultaneously, the pervasive and in some places …", "num_citations": "35\n", "authors": ["2099"]}
{"title": "Eyes on the Ground: Emerging Practices in Periscope Use during Crisis Events.\n", "abstract": " This empirical analysis examines the use of the live-streaming application Periscope in three crises that occurred in 2015. Qualitative and quantitative analyses of tweets relating to the Amtrak derailment in Philadelphia, Baltimore protests after Freddie Grey’s death, and Hurricane Joaquin flooding in South Carolina reveal that this recently deployed application is being used by both citizens and journalists for information sharing, crisis coverage and commentary. The accessibility and immediacy of live video directly from crisis situations, and the embedded chats which overlay on top of a video feed, extend the possibilities of real-time interaction between remote crowds and those on the ground in a crisis. These empirical findings suggest several potential challenges and opportunities for responders.", "num_citations": "32\n", "authors": ["2099"]}
{"title": "Analysis and visualization of sentiment and emotion on crisis tweets\n", "abstract": " Understanding how people communicate during disasters is important for creating systems to support this communication. Twitter is commonly used to broadcast information and to organize support during times of need. During the 2010 Gulf Oil Spill, Twitter was utilized for spreading information, sharing firsthand observations, and to voice concern about the situation. Through building a series of classifiers to detect emotion and sentiment, the distribution of emotion during the Gulf Oil Spill can be analyzed and its propagation compared against released information and corresponding events. We contribute a series of emotion classifiers and a prototype collaborative visualization of the results and discuss their implications.", "num_citations": "31\n", "authors": ["2099"]}
{"title": "Cross-platform disinformation campaigns: lessons learned and next steps\n", "abstract": " We conducted a mixed-method, interpretative analysis of an online, cross-platform disinformation campaign targeting the White Helmets, a rescue group operating in rebel-held areas of Syria that has become the subject of a persistent effort of delegitimization. This research helps to conceptualize what a disinformation campaign is and how it works. Based on what we learned from this case study, we conclude that a comprehensive understanding of disinformation requires accounting for the spread of content across platforms and that social media platforms should increase collaboration to detect and characterize disinformation campaigns.", "num_citations": "30\n", "authors": ["2099"]}
{"title": "What\" crowdsourcing\" obscures: Exposing the dynamics of connected crowd work during disaster\n", "abstract": " The aim of this paper is to demonstrate that the current understanding of crowdsourcing may not be broad enough to capture the diversity of crowd work during disasters, or specific enough to highlight the unique dynamics of information organizing by the crowd in that context. In making this argument, this paper first unpacks the crowdsourcing term, examining its roots in open source development and outsourcing business models, and tying it to related concepts of human computation and collective intelligence. The paper then attempts to characterize several examples of crowd work during disasters using current definitions of crowdsourcing and existing models for human computation and collective intelligence, exposing a need for future research towards a framework for understanding crowd work.", "num_citations": "30\n", "authors": ["2099"]}
{"title": "Oil spill response risk judgments, decisions, and mental models: findings from surveying US stakeholders and coastal residents\n", "abstract": " This study applies a mental models survey approach to assess public thinking about oil spills and oil spill response. Based on prior interdisciplinary oil spill response research, the study first applies qualitative interview results and a response risk decision model to the design of a survey instrument. The decision model considers controlled burning, public health, and seafood safety. Surveying U.S. coastal residents (36,978 pairs of responses) through Google Insights identifies beliefs and gaps in understanding as well as related values and preferences about oil spills, and oil spill responses. A majority of respondents are concerned about economic impacts of major oil spills, and tend to see ocean ecosystems as fragile. They tend to see information about chemical dispersants as more important than ecological baseline information, and dispersants as toxic, persistent, and less effective than other response options …", "num_citations": "29\n", "authors": ["2099"]}
{"title": "Assembling strategic narratives: Information operations as collaborative work within an online community\n", "abstract": " Social media are becoming sites of information operations-activities that seek to undermine information systems and manipulate civic discourse [26,36,44,47]. Through a mixed methods approach, our research extends investigations of online activism to examine the \"work\" of online information operations conducted on Twitter. In particular, we analyze the English-language conversation surrounding the reemergence of Omran Daqneesh (the \"Aleppo Boy\") on Syrian state television, almost a year after his family's home was bombed in an airstrike conducted by the Syrian government. We uncover: a network of clustered users that contributes to a contested and politicized information space surrounding Omran's story; the presence of undermining narratives that serve to disrupt the mainstream media's narrative and confuse the audience; and the techniques used when promoting, defending, or undermining narratives …", "num_citations": "24\n", "authors": ["2099"]}
{"title": "Alternative narratives of crisis events: Communities and social botnets engaged on social media\n", "abstract": " This paper presents an early stage exploratory analysis of communities engaging in alternative narratives about crisis events on social media. Over 11,000 user accounts on Twitter engaged in conversations questioning the mainstream narrative of the Paris Attacks and Umpqua Community College Shootings in Autumn 2015. We analyze the social network of communication, examining the composition of clusters of accounts with shared audiences. We describe some of the common traits within communities and note the prevalence of automated accounts. Our results shed light on the nature of the communities espousing alternative narratives and factors in the spread of the content.", "num_citations": "23\n", "authors": ["2099"]}
{"title": "Methods for communicating the complexity and uncertainty of oil spill response actions and tradeoffs\n", "abstract": " Complexity and uncertainty influence opinions, beliefs, and decisions about health, safety, and other kinds of risk, as demonstrated in research on health, climate change, storm forecasts, pandemic disease, and in other domains. Drawing from this research, this article summarizes insights into how people understand and process uncertain or complex information and explores key oil spill and oil spill response-relevant issues regarding the communication of complexity and uncertainty—from the presentation of uncertainties around forecast parameters to the deployment of online oil spill response simulation tools. Recommended practices from this article include (a) to continue to develop and evaluate interactive Web-based oil spill response simulations to help users explore tradeoffs in response decisions, (b) to take how people simplify information into account in designing communications processes and products …", "num_citations": "23\n", "authors": ["2099"]}
{"title": "Visible skepticism: Community vetting after Hurricane Irene.\n", "abstract": " Social media enable rapid, peer-to-peer information flow during crisis events, affordances that have both positive and negative consequences. The potential for spreading misinformation is a significant concern. Drawing on an empirical study of information-sharing practices in a crisis-affected community in the Catskill Mountains after Hurricane Irene, this paper describes how an ad hoc group of community members, led by a handful of journalists, employed specific work practices to mitigate misinformation. We illustrate how the group appropriated specific tools and performed visible skepticism, among other techniques, to help control the spread of false rumors. These findings suggest implications for the design of tools and the development of best practices for supporting community-led, crowd-powered response efforts during disasters.", "num_citations": "22\n", "authors": ["2099"]}
{"title": "Crowdwork, crisis and convergence: How the connected crowd organizes information during mass disruption events\n", "abstract": " Social media have experienced widespread adoption in recent years. Though designed and appropriated for a range of purposes, users are consistently turning to these platforms during times of crisis and mass disruption—a term used here to characterize events, including mass emergencies, natural disasters and political protests, that cause significant disruption to normal routines. Social media are playing host to new, digital forms of the social convergence behavior long known to occur in the wake of crisis events. This activity, which includes participation from local citizens, emergency responders, and global onlookers alike, produces huge volumes of data, some with potential value to affected people and responders. It also creates new challenges. Noise, misinformation, lost context and the unstructured nature of social media updates all contribute to an emerging information processing problem, with …", "num_citations": "19\n", "authors": ["2099"]}
{"title": "Centralized, parallel, and distributed information processing during collective sensemaking\n", "abstract": " Widespread rumoring can hinder attempts to make sense of what is going on during disaster scenarios. Understanding how and why rumors spread in these contexts could assist in the design of systems that facilitate timely and accurate sensemaking. We address a basic question in this line: To what extent does rumor evolution occur (1) through reliance on a centralized information source,(2) in parallel information silos, or (3) through a web of complex informational interactions? We develop a conceptual model and associated analysis algorithms that allow us to distinguish between these possibilities. We analyze a case of rumoring on Twitter during the Boston Marathon Bombing. We find that rumor spreading was predominantly a parallel process in this case, which is consistent with a hypothesis that information silos may underlie the persistence of false rumors. Special attention towards detecting and resolving …", "num_citations": "18\n", "authors": ["2099"]}
{"title": "What-if scenario modeling to support oil spill preparedness and response decision-making\n", "abstract": " Scenario analysis (SA) is the process of developing plausible futures around the forces affecting an organization in the face of uncertainties over which it has little control. SA is widely used in the private sector and increasingly a tool of environmental planners grappling with problems of great complexity and uncertainty. SA ideally marries expert judgment with the broader perspectives engaged stakeholders bring. While the 1990 Oil Pollution Act (OPA) brought substantive improvement to oil spill contingency planning, many issues remain. Reguatorily prescribed definitions of ‘worst case’ lead to SA practice that seldom achieves the full promise of the SA approach. Contingency planning overly focused on tactical and operational considerations can leave response managers little prepared to deal with public concerns that emerge in the event of a major spill, concerns increasingly magnified through social media …", "num_citations": "16\n", "authors": ["2099"]}
{"title": "\" It's Raining Dispersants\" Collective Sensemaking of Complex Information in Crisis Contexts\n", "abstract": " Addressing crises sometimes requires grappling with sophisticated technical or scientific content. To make sense of the BP DeepWater Horizon Oil Spill people had to grapple with uncertain and sometimes contentious, complex information. This empirical study shows that an emergent, connected crowd interacted to surface, share, question and discuss these complexities. While studies have observed collective sensemaking taking place via social media in other kinds of crises, this study extends our understanding of emergent crowd work as collective sensemaking where members of the public assemble and interpret evidence on complex topics in a crisis context, perhaps performing a kind emergent citizen science.", "num_citations": "16\n", "authors": ["2099"]}
{"title": "Digital volunteerism: Examining connected crowd work during mass disruption events\n", "abstract": " My research examines the use of social media during mass disruption events, focusing on the work of digital volunteers. Specifically, I explore ways in which the connected crowd works to process a flood of data moving through social media platforms into useful information resources. I seek to unpack the popular crowdsourcing term to reveal the diverse information organizing and self-organizing behaviors obscured beneath it. By describing how the connected crowd currently helps to organize information, l hope both to help emergency and humanitarian responders better leverage this potential new workforce and to enrich our overall understanding of", "num_citations": "12\n", "authors": ["2099"]}
{"title": "Examining the Role of Human and Technical Infrastructure during Emergency Response.\n", "abstract": " Infrastructures—both technical and human—are critical components of emergency response, helping to facilitate and shape both formal work practices and the improvisational work that individuals and organizations take part in as they address emergent challenges during unpredictable events. This research explores the relationships between infrastructure and collaborative work in this context, at a time when the infrastructures themselves are rapidly changing and/or under pressure to change due to the introduction of new technology. We interviewed 17 emergency workers from region that had recently experienced a major emergency response. These interviews illuminate weaknesses in some of the systems designed to support the information and communication needs of emergency workers, and demonstrate emergency workers assembling their own ICT infrastructures using familiar off-the-shelf tools like social media platforms and shared Google documents. These findings also highlight the importance of human infrastructure in supporting improvisation and collaboration among emergency workers.", "num_citations": "10\n", "authors": ["2099"]}
{"title": "Information movement across social media platforms during crisis events\n", "abstract": " We outline a novel research agenda for examining how and why people communicate across multiple social media platforms during crisis events.", "num_citations": "9\n", "authors": ["2099"]}
{"title": "Sharing food, gathering information: the context and visibility of community information work in a crisis event\n", "abstract": " This paper describes ICT use after a disaster, connecting the stories of various community responders and tracing their activities across sociotechnical networks. Drawing on contextual interviews and the digital record, we reveal how information work, food work, and emotional labor intersected. At the most superficial level, we find that many community responders continue to rely upon face-to-face communication and “real simple” technologies to coordinate their activities. This research also speaks to the visibility of community response work—offering a method for surfacing less visible work given the social complexities of a disaster. This approach provides a complementary perspective to research that relies solely on digital traces.", "num_citations": "8\n", "authors": ["2099"]}
{"title": "Addressing the information needs of crisis-affected communities: The interplay of legacy media and social media in a rural disaster\n", "abstract": " As networked information and communication technologies (ICTs) take an increasingly prominent role in crisis communication in disaster-affected communities, their position in the broad socio-technical infrastructure deserves closer inspection. The authors examine the interplay between traditional legacy media and ICTs, such as social media, to explore how they together, and separately, meet the information needs of disaster-affected communities. They specifically look at examples during Hurricane Irene in upstate New York.", "num_citations": "8\n", "authors": ["2099"]}
{"title": "Language Limitations in Rumor Research? Comparing French and English Tweets Sent During the 2015 Paris Attacks.\n", "abstract": " The ubiquity of social media facilitates widespread participation in crises. As individuals converge online to understand a developing situation, rumors can emerge. Little is currently known about how online rumoring behavior varies by language. Exploring a rumor from the 2015 Paris Attacks, we investigate Twitter rumoring behaviors across two languages: French, the primary language of the affected population; and English, the dominant language of Internet communication. We utilize mixed methods to qualitatively code and quantitatively analyze rumoring behaviors across French and English language tweets. Most interestingly, temporal engagement in the rumor varies across languages, but proportions of tweets affirming and denying a rumor are very similar. Analyzing tweet deletions and retweet counts, we find slight (but not significant) differences between languages. This work offers insight into potential limitations of previous research of online rumoring, which often focused exclusively on English language content, and demonstrates the importance of considering language in future work.", "num_citations": "7\n", "authors": ["2099"]}
{"title": "Crowd computation: organizing information during mass disruption events\n", "abstract": " This research examines large-scale human interaction occurring through social media during times of mass disruption, seeking to understand how the connected crowd acts to organize a flood of data moving through those platforms into useful information resources. The work combines empirical analysis of social media communication, interviews, and participant observation to explore how people work to organize information and how they use social media platforms to organize themselves to do this work. Synthesizing findings from four distinct, yet interrelated studies, this research progresses towards a new conceptualization of the distributed, connected work of organizing information during mass disruption events.", "num_citations": "7\n", "authors": ["2099"]}
{"title": "On the Misinformation Beat: Understanding the Work of Investigative Journalists Reporting on Problematic Information Online\n", "abstract": " Journalists are increasingly investigating and reporting on problematic online content such as misinformation, disinformation, and conspiracy theories, leading to the creation of a new misinformation beat. The process of collecting, analyzing, and reporting on this kind of data is complex and nuanced. It is especially challenging as online actors attempt to undermine their work. Through in-depth interviews with twelve journalists, we explore how they investigate and report on online misinformation and disinformation. Our findings reveal some of the unique challenges of reporting on this beat, as well as the ways in which reporters overcome those challenges. We highlight and discuss how journalistic values could be better embedded into the design of tools to support their work, the power dynamics between social media companies and journalists, and the promise of collaborations as a way to support and educate …", "num_citations": "6\n", "authors": ["2099"]}
{"title": "Expressed Uncertainty and Denials as Signals of Online Rumoring\n", "abstract": " Social media platforms are important venues for communication during crisis events; both the public and emergency responders use online platforms to discover and curate event-related information. While many recognize the value of social media as an information source during crisis settings, there is also concern about misinformation [Sutton et al. 2008, Hughes and Palen 2012]. To ground our exploration of misinformation within online spaces, we leverage theories of rumoring behavior—a topic of longstanding interest in the social sciences [Caplow 1947, Allport and Postman 1947, Spiro et al. 2012]. Prior studies of rumoring, both during disasters and under more general circumstances, frame the “collective sensemaking” process that often occurs as a response to uncertainty within the information space. Such rumoring behavior often occurs during periods of collective stress, such as disasters, and in cases where official sources of news are unavailable (or insufficiently timely)[Shibutani 1966]. We hope that understanding the collective sensemaking process will inform automated methods of detecting rumors on social media platforms during crisis events.1.1 Project Goals: Using Crowd Activity to Detect Misinformation Our research aims to leverage the “collective intelligence” of the online crowd to identify rumors. Vieweg et al.[2008] and Starbird [2013] used the term “collective intelligence” to characterize the online crowd’s work to identify, verify and amplify actionable information during crises. Starbird [2013] demonstrated how a network of social media users performed as a collective sensor for “good” information after a major earthquake …", "num_citations": "6\n", "authors": ["2099"]}
{"title": "Microblogging in Mass Emergency\n", "abstract": " CiteSeerX — Microblogging in Mass Emergency Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced Search Include Citations Tables: DMCA Microblogging in Mass Emergency Cached Download as a PDF Download Links [www.cs.unc.edu] [www.cs.unc.edu] [cs.unc.edu] Save to List Add to Collection Correct Errors Monitor Changes by Sarah Vieweg , Kate Starbird Summary Citations Active Bibliography Co-citation Clustered Documents Version History Share Facebook Twitter Reddit Bibsonomy OpenURL Abstract Copyright is held by the author/owner(s). Keyphrases mass emergency author owner Powered by: Apache Solr About CiteSeerX Submit and Index Documents Privacy Policy Help Data Source Contact Us Developed at and hosted by The College of Information Sciences and Technology © 2007-2019 The …", "num_citations": "6\n", "authors": ["2099"]}
{"title": "An agenda for disinformation research\n", "abstract": " In the 21st Century information environment, adversarial actors use disinformation to manipulate public opinion. The distribution of false, misleading, or inaccurate information with the intent to deceive is an existential threat to the United States--distortion of information erodes trust in the socio-political institutions that are the fundamental fabric of democracy: legitimate news sources, scientists, experts, and even fellow citizens. As a result, it becomes difficult for society to come together within a shared reality; the common ground needed to function effectively as an economy and a nation. Computing and communication technologies have facilitated the exchange of information at unprecedented speeds and scales. This has had countless benefits to society and the economy, but it has also played a fundamental role in the rising volume, variety, and velocity of disinformation. Technological advances have created new opportunities for manipulation, influence, and deceit. They have effectively lowered the barriers to reaching large audiences, diminishing the role of traditional mass media along with the editorial oversight they provided. The digitization of information exchange, however, also makes the practices of disinformation detectable, the networks of influence discernable, and suspicious content characterizable. New tools and approaches must be developed to leverage these affordances to understand and address this growing challenge.", "num_citations": "5\n", "authors": ["2099"]}
{"title": "Detecting Journalism in the Age of Social Media: Three Experiments in Classifying Journalists on Twitter\n", "abstract": " The widespread adoption of networked information and communications technologies (ie ICTs) blurs traditional boundaries between journalist and citizen. The role of the journalist is adapting to structural changes in the news industry and dynamic audience expectations. For researchers who seek to understand what, if any, distinct role journalists play in the production and propagation of breaking news, it is vital to be able to identify journalists in social media spaces. In many cases, this can be challenging due to the limited information and metadata about social media users. In this work, we use a supervised machine learning model to automatically distinguish journalists from non-journalists in social media spaces. Leveraging Twitter data collected from three crisis events of different types, we examine how profile information, social network structure, posting behavior and language distinguish journalists from others. Additionally, we evaluate how the performance of the journalist classification model varies by context (ie types of crisis events) and by journalism outlets (ie print versus broadcast journalism), and discuss challenges in automatic journalist detection. Implications of this work are discussed; in particular we argue for the value of such methods for scaling analysis in journalism studies beyond the capacity of human coders. Employing classification methods in this context allows for systematic, large-scale studies of the role of journalists online.", "num_citations": "4\n", "authors": ["2099"]}
{"title": "Empty choice: Can girls “want” engineering if they don’t know what it is\n", "abstract": " In mid-2008 a flurry of reports in the mainstream media suggested that girls and women in the US today are purposefully choosing not to pursue STEM fields (McArdle, 2008; Sax, 2008; Sommers, 2008; Tierney, 2008). The argument made in these reports was: Today, girls and women know about STEM fields, and they know what to expect of STEM careers; on the basis of this knowledge they decide they are not interested, and they choose other fields. McArdle, writing in the Boston Globe:―When it comes to math-and science-related jobs, substantial numbers of women—highly qualified for the work—stay out… because they would simply rather do something else.‖ She goes on to call this―a natural artifact of a free society.‖ Sax in Education Week,―The real gender gap is not in… what girls and boys can do, but in what girls and boys want to do….‖ And Sommers in Teachers College Record:―… men and women differ systematically in their interests and… these differences can account for a large share of the gender gap in information technology occupations.‖ Commenting on the same study as Sommers, Tierney in the New York Times:―… the researchers found that information technology workers especially enjoyed manipulating objects and machines, whereas workers in other occupations preferred dealing with people… There just happened to be more women than men with those preferences.‖The idea that informed women are choosing against STEM fields, coupled with the fact that the percentages of women in fields like engineering have not changed very much despite years of support programs, have led some to assert that …", "num_citations": "4\n", "authors": ["2099"]}
{"title": "Combining interventions to reduce the spread of viral misinformation\n", "abstract": " Misinformation online poses a range of threats, from subverting democratic processes to undermining public health measures. Proposed solutions range from encouraging more selective sharing by individuals, to platform removal of false content and accounts that create or promote it. How, whether, and which strategies to implement depends on their relative and combined ability to reduce viral misinformation spread at practical levels of enforcement. Here we provide a framework to evaluate interventions aimed at reducing viral misinformation online both in isolation and when used in combination. We begin by deriving a generative model of viral misinformation spread, inspired by research on infectious disease. Applying this model to a large corpus of misinformation events that occurred during the 2020 US election, we reveal that commonly proposed interventions--including removal of content, virality circuit breakers, nudges, and account banning---are unlikely to be effective in isolation without extreme censorship. However, our framework demonstrates that a combined approach can achieve a substantial,~ 50%, reduction in the prevalence of misinformation. Our results challenge claims that combating misinformation will require new ideas or high costs to user expression. Instead, we highlight a practical path forward as misinformation online continues to threaten vaccination efforts, equity, and democratic processes around the globe.", "num_citations": "2\n", "authors": ["2099"]}
{"title": "This covid-19 misinformation went viral. Here’s what we learned\n", "abstract": " By Kate Starbird, Emma Spiro and Jevin West May 8, 2020 at 4: 45 am PDT In a crisis, people struggle collectively to make sense of a complex and frightening situation—and as a result, misinformation spreads. For several reasons, that’s been especially true during the novel coronavirus pandemic. Scientists are still trying to understand everything about the virus’s disease, covid-19, including how it spreads and which treatments work. Armchair epidemiologists are filling the Internet with their own interpretations of the emerging science.", "num_citations": "2\n", "authors": ["2099"]}
{"title": "Information operations and online activism within “NATO” discourse\n", "abstract": " MethodsOnline political organizing, information operations, and disinformation are typically multiplatform endeavors that integrate different social media platforms, online websites, private messaging channels, and other resources. In part due to the public availability of tweets, this study focuses specifically on Twitter activity—and then uses that activity to get some sense of the surrounding information space (using links within tweets). We recognize that this provides a limited view of the broader conversation, but it does provide some insight into the structure and dynamics of online political discourse. For ongoing research, we have been collecting data in real time, using the Twitter streaming API to track specific keyword terms related to breaking news events. The study presented here focuses on tweets that included the term NATO in the text and were sent between February 25, 2018, and June 17, 2018 (a few days after the close of the 2018 NATO summit). We then filtered this dataset to include only English-language tweets, limiting the scope of the investigation to messages written by or for English-speaking audiences. This Spring 2018 NATO Dataset includes 1,353,620 tweets posted from 513,285 distinct accounts.To understand these data, we used a grounded, interpretative, mixed-method approach, integrating qualitative, quantitative, and visual analyses to examine the data from multiple levels—from “10,000 feet” views to tweet-by-tweet analysis. These analyses include descriptive statistics, network graphs, algorithmic clustering, temporal graphs (appendix A), and content analysis of highly retweeted tweets. We also identified the most …", "num_citations": "2\n", "authors": ["2099"]}
{"title": "Beyond Official: Government Information Work through Personal Accounts\n", "abstract": " This research demonstrates how government information workers employed different communication strategies through social media after a mass-causality event. Effectively using social media for some government functions may blur the lines between official work and the personal boundaries of government workers, thus raising privacy concerns for government employees.", "num_citations": "2\n", "authors": ["2099"]}
{"title": "Supporting the geolocating work of crisis mappers\n", "abstract": " This paper discusses challenges of geolocating social media updates during crises, looking to the work of crisis mapping volunteers both to inform future computational solutions and as a design opportunity for GeoHCI researchers.", "num_citations": "2\n", "authors": ["2099"]}
{"title": "Cross-platform Information Operations: Mobilizing Narratives & Building Resilience through both'Big'&'Alt'Tech\n", "abstract": " Despite increasing awareness and research about online strategic information operations, there remain gaps in our understanding, including how information operations leverage the wider information ecosystem and take shape on and across multiple social media platforms. In this paper we use mixed methods, including digital trace ethnography, to look beyond a single social media platform to the broader information ecosystem. We aim to understand how multiple social media platforms are used, in parallel and complementary ways, to achieve the strategic goals of online information operations. We focus on a specific case study: the contested online conversation surrounding Syria Civil Defense (the White Helmets), a group of first responders that assists civilians affected by the civil war within the country. Our findings reveal a network of social media platforms from which content is produced, stored, and …", "num_citations": "1\n", "authors": ["2099"]}
{"title": "Analyzing Social Media Data to Understand How Disaster-Affected Individuals Adapt to Disaster-Related Telecommunications Disruptions\n", "abstract": " Information is a critical need during disasters such as hurricanes. Increasingly, people are relying upon cellular and internet-based technology to communicate that information—modalities that are acutely vulnerable to the disruptions to telecommunication infrastructure that are common during disasters. Focusing on Hurricane Maria (2017) and its long-term impacts on Puerto Rico, this research examines how people affected by severe and sustained disruptions to telecommunications services adapt to those disruptions. Leveraging social media trace data as a window into the real-time activities of people who were actively adapting, we use a primarily qualitative approach to identify and characterize how people changed their telecommunications practices and routines—and especially how they changed their locations—to access Wi-Fi and cellular service in the weeks and months after the hurricane. These findings have implications for researchers seeking to better understand human responses to disasters and responders seeking to identify strategies to support affected populations.", "num_citations": "1\n", "authors": ["2099"]}
{"title": "Personal Data and Power Asymmetries in US Collegiate Sports Teams\n", "abstract": " Collaborations increasingly draw on personal data. We examine personal-data-supported collaborations in a high stakes, high-performance environment: collegiate sports. We conducted 22 interviews with people from four common roles within collegiate sports teams: athletes, sport coaches, athletic trainers, and strength and conditioning coaches. Using boundary negotiating artifacts as a lens for analysis, we describe an ecology of personal data in collaborations among these four roles. We use this ecology to highlight tensions and foreground issues of power asymmetry in these collaborations. To characterize these power asymmetries in the collaborative use of personal data, we propose an extension of boundary negotiating artifacts: extraction artifacts.", "num_citations": "1\n", "authors": ["2099"]}
{"title": "Examining the digital toolsets of journalists reporting on disinformation\n", "abstract": " The rise of the socially-connected web has created new reporting challenges for journalists—especially around the spread of mis-and disinformation—and required them to adopt new reporting methods. Increasingly, they have turned to digital tools to verify information, collect leads and story updates, and draw connections between content online. To better understand the range of such tools in current practice, and the processes that journalists use these tools for, we interview 12 national and international journalists who specifically report on mis-or disinformation. We ask them questions about the tools they use in their reporting, and ask them to recount narratives of reporting individual stories. From their responses, we have extracted the range of online tools they use in their journalistic practice, and categorized them according to how they are used in the process of reporting a story. We discuss the implications of our review for both for journalists and for prospective developers of digital tools for journalists.", "num_citations": "1\n", "authors": ["2099"]}
{"title": "It is Not All Fun and Games: Breaking News Consumption on Snapchat\n", "abstract": " Snapchat is a camera and ephemeral messaging application popular among young adults. Due to its self-destructing content and playful features, Snapchat is often associated with more trivial uses. However, the platform has added functionality to support consumption of news. To understand how users perceive and interact with news content on Snapchat, we conducted semi-structured interviews with 19 users of the platform, focusing on their use of Snapchat during breaking news events, including the 2016/2017 US presidential election and inauguration. Through the lens of Network Gatekeeping, our research explains how users consume breaking news content on Snapchat. We unpack users’ ambiguous perceptions of news reliability on Snapchat, and demonstrate how this contrasts with traditional news consumption. Our research also describes how users’ mental models of how Snapchat works—specifically their theories about how the platform curates news content—shape their judgments of reliability, media bias and authenticity.", "num_citations": "1\n", "authors": ["2099"]}
{"title": "When Bad Actors Adhere to Group Norms\n", "abstract": " The term,\" bad actor\" can suggest an individual that is easily identifiable by their offensive or antisocial behavior—perhaps as suggested by the growing focus on online harassment. In this paper, we examine a set of accounts that do not fit this image. These accounts do not necessarily engage in vulgarity or abuse, but rather purposeful, targeted, and systematic manipulation. Consequently, we take the position that a useful definition of bad actors has to consider not just behaviors, but intent. We also argue that social media companies need to move beyond sanctioning\" bad actors\" to helping users understand our vulnerabilities within these information ecosystems.", "num_citations": "1\n", "authors": ["2099"]}