{"title": "Adopting Agile software development: the project manager experience\n", "abstract": " PurposeEarly research into Agile approaches explored particular practices or quantified improvements in code production. Less well researched is how Agile teams are managed. The project manager (PM) role is traditionally one of “command and control” but Agile methods require a more facilitative approach. How this changing role plays out in practice is not yet clearly understood. The purpose of this paper is to provide insight into how adopting Agile techniques shape the working practices of PMs and critically reflect on some of the tensions that arise.Design/methodology/approachAn ethnographic approach was used to surface a richer understanding of the issues and tensions faced by PMs as Agile methods are introduced. Ethnographic fiction conveys the story to a wider audience.FindingsAgile approaches shift responsibility and spread expert knowledge seeming to undermine the traditional PM function …", "num_citations": "39\n", "authors": ["2251"]}
{"title": "Trends and emerging areas of agile research: the report on xp2014 phd symposium\n", "abstract": " The PhD symposium of XP2014, the 15th International Conference on Agile Software Development, was organized as a half-day event prior to the main conference program. Seven PhD candidates came from different research institutes across the globe to present their own research proposals at the symposium. The symposium was run in a lively and interactive manner. The candidates received constructive feedback on their proposals from all the symposium participants. In this report we describe the presented proposals, focusing on the content and feedback. Through them we can take a peek at the trends and emerging areas of agile research in the coming years.", "num_citations": "2\n", "authors": ["2251"]}
{"title": "Development of a multimedia cognitive behaviour programme for young offenders\n", "abstract": " Within the UK youth justice system young people can be required to complete a paper based cognitive behaviour programme in an attempt to reduce their offending behaviour. This paper reports on a project to convert the paper based programme into a multimedia application. A high fidelity prototype was developed and evaluated using interviews. The evaluation revealed a positive response to the prototype from the young people, who tended to write more in the multimedia application than the paper based version and an agile methodology was adopted to develop the full system. This enabled active user involvement in the redesign of the application and this process is analysed and discussed.", "num_citations": "2\n", "authors": ["2251"]}