{"title": "How human aspects impress Agile software development transition and adoption\n", "abstract": " Many software companies are interested in using Agile methods in their software projects. Contrary to traditional software development methods, Agile methods are people oriented. This fact shows the significant role of individuals in these methods. Increasing prevalence of Agile methods forces software companies to consider people related factors as critical issues in adoption and transition to Agile methods and practices. This article focused on human aspects of Agile transformation process by conducting a Grounded Theory study involving 32 Agile experts. The main contribution of this article is identification and classification of diverse human aspects of Agile transformation process. Analyzing collected data showed that human aspects of Agile transformation process can be classified in several categories. While some of them are impediments to change, some others act as change accelerators. At the same time people’s perceptions about change process and incentive factors can shape and form human aspects during the Agile transformation process. Each of these categories encompasses its own factors which have negative or positive effect on change process.", "num_citations": "73\n", "authors": ["2163"]}
{"title": "Development of an embedded smart home management scheme\n", "abstract": " This paper describes the development of an embedded smart home management scheme over the Ethernet network. The platform of the smart home management system is built using bespoke embedded system design. An embedded control module developed by exploiting the Web Services mechanism, consist of 15 monitoring channels based on XML SOAP standards. Each channel is integrated to dedicated smart home management scheme and performs bidirectional real-time control. In the event of server unavailability, a mobile based communication module using GSM has been deployed as an alternate management mechanism. The proposed embedded-enabled solution offers bi-directional real-time management as well as optimized performance for smart home environment.", "num_citations": "45\n", "authors": ["2163"]}
{"title": "Exploring facilitators of transition and adoption to agile methods: a grounded theory study\n", "abstract": " Nowadays, changing development approach from traditional to Agile methods has been considered as a strategic decision for achieving Agile values by most software companies and organizations. Due to its nature, moving to Agile software development and adapting to Agile methods need a long time and enough effort. Thus, organizations are faced with a lot of challenges during the transition and adoption process. Providing facilitators can make transition process easier and faster. Conducting a Grounded Theory study on Agile transformation process, involving 33 Agile experts across 13 different countries showed that Agile transition and adoption needs to be supported by several facilitators. Thus, the main contribution of this article is providing eight major facilitators that should be used by Agile teams to support Agile transition and adoption. Some of these facilitators support team members in doing their jobs and empower them against challenges. Some others help them in dealing with challenges or prevent potential problems before occurrence in Agile transition process. Furthermore, some of these facilitators have positive effects on people and motivate them to adapt with their new behaviors. Agile transition and Adoption will be faster and easier if the more facilitators get involve.", "num_citations": "25\n", "authors": ["2163"]}
{"title": "Assessing the use of magnetic resonance imaging virtopsy as an alternative to autopsy: a systematic review and meta-analysis\n", "abstract": " Background The post mortem examination or autopsy is a trusted method of identifying the cause of death. Patients and their families may oppose an autopsy for a variety of reasons, including fear of mutilation or owing to religious and personal beliefs. Imaging alternatives to autopsy have been explored, which may provide a viable alternative.Objective To explore the possibility of using MRI virtopsy to establish the cause of death as an alternative to the traditional post mortem examination or autopsy.Methods Systematic review was carried out of all studies, without language restriction, identified from Medline, Cochrane (1960–2016) and Embase (1991–2016) up to December 2016. Further searches were performed using the bibliographies of articles and abstracts. All studies reporting the diagnosis of the cause of death by both MRI virtopsy and traditional autopsy were included.Results Five studies with 107 …", "num_citations": "24\n", "authors": ["2163"]}
{"title": "Exploring key factors of pilot projects in agile transformation process using a grounded theory study\n", "abstract": " Changing development approach from disciplined to agile methods is an organizational mutation that requires many issues to be considered to increase its chance of success. Selecting an appropriate pilot project as initial project that is going to be done through an Agile method is a critical task. Due to the impact of such a pilot project on successful Agile transformation, understanding its critical factors helps organizations choose the most suitable project to start Agile transition. Conducting a Grounded Theory, showed that organization should considered some key factors of a pilot: Criticality, Duration, Size and Required resources. Besides these factors, the results showed that organization should be aware of the risk of successful pilot project in their next Agile projects. The study also showed that pilot selection mostly is done by Agile coaches or is forced by customer.", "num_citations": "19\n", "authors": ["2163"]}
{"title": "An exploratory study on managing agile transition and adoption\n", "abstract": " Software companies are replacing traditional software development methods with Agile methods due to coping with inherent problems of traditional methods. Due to the different nature of traditional and Agile methods, adaptation to Agile methods is not a simple process and needs to be managed in a sustainable way. In recent years, several studies have conducted on investigation of Agile migration journey, but less effort on identifying the serious managerial attentions in Agile transition process. Conducting a Grounded Theory in context of Agile software development, showed various aspects of the transition to be considered in order to having a successful change management process. This paper shows the important role of the emergent managerial attentions on success of Agile transition and adoption process.", "num_citations": "17\n", "authors": ["2163"]}
{"title": "Towards a unified criteria model for usability evaluation in the context of open source software based on a fuzzy Delphi method\n", "abstract": " ContextA plethora of models are available for open-source software (OSS) usability evaluation. However, these models lack consensus between scholars as well as standard bodies on a specific set of usability evaluation criteria. Retaining irrelevant criteria and omitting essential ones will mislead the direction of the usability evaluation.ObjectiveThis study introduces a three-step method to develop a usability evaluation model in the context of OSS.MethodThe fuzzy Delphi method has been employed to unify the usability evaluation criteria in the context of OSS. The first step in the method is the usability criteria analysis, which involves redefining and restructuring all collected usability criteria reported in the literature. The second step is fuzzy Delphi analysis, which includes the design and validates the fuzzy Delphi instrument and the utilisation of the fuzzy Delphi method to analyse the fuzziness consensus of experts …", "num_citations": "16\n", "authors": ["2163"]}
{"title": "Improved extreme programming methodology with inbuilt security\n", "abstract": " Security in e-commerce is becoming an important issue to deal with as several cases of attacks to users' data are increasing exponentially. Therefore, there is absolute need for proper checks and balances to mitigate the lapses using the appropriate development framework. This paper provides as a candidate, Improve Extreme Programming Methodology by tightening security controls across the development stages without necessarily extending the process.", "num_citations": "16\n", "authors": ["2163"]}
{"title": "Observation of Open Source programmers' information seeking\n", "abstract": " Several authors have proposed information seeking as an appropriate perspective for studying software evolution, and have characterized information seeking empirically in commercial software evolution settings. However, there is little research in the literature describing the information seeking behavior of open source programmers. This work describes a holistic schema for open-source (OS) programmers' information seeking, generated through open-coding of questions in OS developer mailing lists. It then reports on a study of the JDT mailing list, showing the types of information sought within this group and, for a subset of the data, it characterizes the responses obtained.", "num_citations": "13\n", "authors": ["2163"]}
{"title": "HOW GROUNDED CAN FACILITATE RESEARCH STUDIES IN CONTEXT OF AGILE SOFTWARE DEVELOPMENT\n", "abstract": " Agile methods are increasingly used in software development. These methods are people oriented and almost all issues and challenges in using them are associated to people and their behaviours. While many challenges should be studied in Agile environments, using appropriate research methodology is so critical and affects such studies strongly. This article shows that Grounded Theory as a qualitative research methodology can be used in conducting studies in Agile context. This article presents applicability of Grounded Theory for developing i nductive substantive theories in Agile environments based on the real data. There are several reasons for using Grounded Theory in Agile context which all of them go back to the nature of Agile approach and Grounded Theory characteristics.", "num_citations": "11\n", "authors": ["2163"]}
{"title": "Mapping and Analysis of Open Source Software (OSS) usability for sustainable OSS product\n", "abstract": " The increase in the number of open source software (OSS) users have drawn attention to improving usability. Usability is a clear concept that encompassing both task and user characteristics as well as functionality. Usability is an essential factor that affects user acceptance and OSS sustainability, which is considered as the key to the success of the OSS. To some extent, usability is one concern of the larger issue of system acceptability and sustainability. Therefore, usability is an important factor that needs to be considered since the software that is not usable is not going to be sustainable. The objective of this paper is to review researchers' efforts to improve, investigate, and evaluate the usability factor that may affect the OSS acceptability and sustainability and map the research scenery from the articles into a comprehensible structured taxonomy, which would help the researchers to identify different research gaps …", "num_citations": "10\n", "authors": ["2163"]}
{"title": "Developing schema for open source programmers’ information-seeking\n", "abstract": " Information-seeking has been recognized as a core subtask in software maintenance. While much of the research in this area attempts to identify the information sought by programmers, the work to date has been typically based on pre-defined information types limiting the potential for new information types to arise. Hence, this paper presents a small empirical study on open-source programmer mailing lists, to iteratively refine a schema of the information that programmers seek based exclusively on an analysis of these programmers’ naturalistic communication. Subsequently it places this schema in the context of the existing literature in the area. The analysis was undertaken on information requests in 288 emails, taken from 2 open source project mailing lists; The Java Bean Scripting Framework (BSF)[1] and the Java Development Tool (JDT)[2]. This work produced a preliminary schema of 3 main categories …", "num_citations": "9\n", "authors": ["2163"]}
{"title": "Observing Open Source Programmers' Information Seeking.\n", "abstract": " Several authors have proposed information seeking as an appropriate perspective for studying software maintenance, and have characterized information seeking empirically in commercial software evolution settings. This paper addresses the parallel issue of information seeking in Open Source software evolution. Open Source software evolution exacerbates information-seeking problems, as team members are typically delocalized from the other members of their team.This paper employs an analysis schema from our previous study (Sharif et. al 2008), generated through open-coding, to characterize information seeking in Open-Source, programmers’ mailing-lists, the medium they predominantly use for communication. A preliminary study using this schema had several interesting conclusions. Specifically, the analysis has shown that Open Source programmers rely somewhat on documentation, that many of their information seeking activities are process orientated and that their information seeking goals change over time.", "num_citations": "8\n", "authors": ["2163"]}
{"title": "Novel multi-perspective usability evaluation framework for selection of open source software based on BWM and group VIKOR techniques\n", "abstract": " Increasing demand for open-source software (OSS) has raised the value of efficient selection in terms of quality; usability is an essential quality factor that significantly affects system acceptability and sustainability. Most large and complex software packages partitioned across multiple portals and involve many users — each with their role in the software package; those users have different perspectives on the software package, defined by their knowledge, responsibilities, and commitments. Thus, a multi-perspective approach has been used in usability evaluation to overcome the challenge of inconsistency between users’ perspectives; the inconsistency challenge would lead to an ill-advised decision on the selection of a suitable OSS. This study aimed to assist the public and private organizations in evaluating and selecting the most suitable OSS. The evaluation of the OSS software packages to choose the best one …", "num_citations": "6\n", "authors": ["2163"]}
{"title": "Open source programmers’ information seeking\n", "abstract": " Several authors have proposed information seeking as an important perspective for the study of software maintenance and evolution, and have characterized information seeking empirically in commercial software evolution settings. However, there is little research reported in the literature that describes the information seeking behavior of open source (OS) programmers, even though OS contexts would seem to exacerbate information seeking problems for maintenance programmers. In the OS setting, team members are typically delocalized from each other and are more likely to use asynchronous communication. In addition, the information seeking behavior of OS system maintainers is an increasingly important research topic, due to the increasing body of OS software needing to be maintained and users’ increasing reliance on OS software systems. Such an increased reliance and prevalence means that there is increased demand for software maintenance of OS systems and it is this area that this thesis will strive to address. This thesis reports on a series of empirical studies that classify OS programmers’ information needs during maintenance. In these studies, types of information needs are identified through a Grounded Theory based analysis of the questions that appear in their developer mailing lists. Then the prevalence of these information needs, on different mailing lists, are quantified and the responses obtained are characterized. In doing so, several interesting observations are made about the types of information these programmers seek, the likelihood that they will receive responses and the number of responses they are likely to get …", "num_citations": "4\n", "authors": ["2163"]}
{"title": "Open source programmers’ information seeking during software maintenance\n", "abstract": " Problem statement: Several authors have proposed information seeking as an appropriate case study for studying software maintenance and evolution that have provided empirical classifications of information seeking in commercial software evolution settings. Approach: However, there is minimal research in the literature describing the information seeking behavior of Open Source programmers, even though Open Source contexts would seem to exacerbate the information seeking problems to a certain extend; where team members are typically delocalized from each other and they are often forced into asynchronous communication. Results: This study reports on an empirical study that classifies Open-Source programmers’ information needs generated through open-coding of questions that appear on developers’ mailing lists. Based on the generated Information Seeking Schema (ISS), details of the information sought by programmers on 6 different mailing lists over several years are analyzed and discussed. Conclusion/Recommendations: The result shows several interesting findings that describe the programmers’ information needs across the mailing lists. Firstly, there are a similar pattern of information artifact and attribute across all projects. Secondly, majority of the programmers’ information seeking concentrated on the systems’ implementations. Thirdly, the OS programmers have also shown to be team-oriented and they tended to rely on documentation more than what have previously reported. These results suggest the applicability of the ISS in evaluating OS programmers information seeking.", "num_citations": "4\n", "authors": ["2163"]}
{"title": "Further observation of open source programmers information seeking\n", "abstract": " Several authors have proposed information seeking as an appropriate perspective for studying software maintenance and evolution, and have characterized information seeking empirically in commercial software evolution settings. However, there is little research in the literature describing the information seeking behaviour of open source programmers, even though open source contexts would seem to exacerbate information seeking problems. That is, team members are typically delocalized from each other and they are often forced into asynchronous communication. This work reports on an empirical study that classifies Open-Source programmers’ information needs, as generated through open-coding of the questions that appear on their developer mailing lists. The study details the information sought by open source programmers on 3 different mailing lists over several years and characterizes the responses they obtained. In doing so, several interesting observations are made about the information these programmers seek, the likelihood that they will receive responses and the number of responses they are likely to get.", "num_citations": "4\n", "authors": ["2163"]}
{"title": "Online news veracity assessment using emotional weight\n", "abstract": " Trillions of data are being created every day on the Internet due to the growing number of social platforms on the World Wide Web (WWW). Processed data when given in context makes information of any knowledge. However, irresponsible use of the data or misinterpretation of data could be the reasons for false information dissemination. Many researchers from various fields, such as computer science and social science, draw their focus on assessing the veracity of information. There are many techniques to perceive this topic, for instance, social network behaviour, and semantic analysis. The common practice is using semantic analysis approach, where the syntactic structure is analysed and polarity of the texts is determined. In this paper, we approach the veracity assessment by using emotion analysis. We identified emotional states conveyed in news content and calculated the weight of each state in each news …", "num_citations": "3\n", "authors": ["2163"]}
{"title": "E-LEARNING READINESS AMONG MEDICAL EDUCATORS IN UNIVERSITI SAINS ISLAM MALAYSIA\n", "abstract": " Recent advances in information technology has made e-learning feasible in many fields of education. Medical education is not any different. This survey is conducted among all the medical educators in Universiti Sains Islam Malaysia (USIM) assessing their readiness and attitudes towards e-learning. A cross-sectional questionnaires assessing the IT skills, Internet usage, attitude, perceived benefits and usage of e-learning among USIM medical lecturers were used. Data gained were then analyzed. The response rate was 92%. Female (56) made majority of the respondents. 44 of the educators aged 25-34 with 56% had teaching experience of< 5 years. Majority of the respondents rate their skills as intermediate in using the software. 56% uses the Internet for more than 3 h per day. Majority agreed that e-learning benefits the students in many ways. Majority also willing to learn and integrate e-learning in their teaching modalities. Despite this, many have not used e-learning in delivering lectures and accepting assignments at time of the survey. Nevertheless, while majority of medical educators are willing to incorporate e-learning in their teaching, many still have not used it. Improvement of infrastructure, training and support to all medical educators are required for successful implementation of e-learning.", "num_citations": "2\n", "authors": ["2163"]}
{"title": "N/A and Signature Analysis for Malwares Detection and Removal\n", "abstract": " 1Universiti Putra Malaysia, Faculty of Computer Science and Information Technology. Jalan UPM, 43400 Serdang, Selangor, Malaysia; ahmad. rida10000@ gmail. com, khaironi@ upm. edu. my 2Department of Computer Science, College of Education, University of Kufa, Kufa City, Najaf, Iraq; ammar. khaleel@ uokufa. edu. iq.", "num_citations": "1\n", "authors": ["2163"]}
{"title": "Stable vibration-based communication scheme using multi-step ASK and PPM techniques\n", "abstract": " In the information-oriented society, there are increasing needs to conduct data communication with nearby devices/people. In this light, vibration-based communication method was proposed as one of possible communication means between adjacent devices. This method has been expected to provide an intuitive and safe communication by propagating vibration to a receiver device. This study proposes two types of techniques, which are multi-step ASK (Amplitude Shift Keying) with pseudo clock and PPM (Pulse Position Modulation), to achieve a stable vibration-based communication simply using smart device functions. These proposed techniques are then evaluated through some experiments using several types of smart devices. In addition, the effectiveness of the proposed methods is discussed based on the experimental results.", "num_citations": "1\n", "authors": ["2163"]}
{"title": "Evaluation of software quality attributes for Vessel Tracking Management System (VTMS)\n", "abstract": " Software quality and assurance becomes inevitable as the non-functional requirements continue to gain more popularity than functional requirements. Even some system could resolve some problem, but if nonfunctional requirements been neglected, at that point the solution may be impractical.The system with least features and quality characteristics will lead to low demand and failed-to-market.The aim of this study was to evaluate the quality in use attributes for Vessel Tracking and Management System (VTMS) adopted from the latest ISO/IEC 25010 quality model in the perspective of users’ satisfaction.Five properties of quality in use are explicitly evaluated which are effectiveness, efficiency, satisfaction, freedom from risk and context coverage.A study was conducted through observation and survey to evaluate all five quality in use attributes of VTMS and to explore the relationship between each quality in use attribute to determine the overall users’ satisfaction.Generally, this study provides an early empirical evaluation of the practical value of case study method. Firstly, from the VTMS perspective, the system provide a great 100% in functions coverage (completeness) although there are two (2) functions need to take immediate action in terms of accuracy so make up total 98.4% for effectiveness.On the other hand, the efficiency which measure the response time for each VTMS main tasks was 92.83%.It is concluded that all five (5) quality in use attributes scores more than 75% which are above the MMEA’s minimum requirement on overall users’ satisfaction.", "num_citations": "1\n", "authors": ["2163"]}