{"title": "An Introduction to Reservoir Simulation Using MATLAB/GNU Octave: User Guide for the MATLAB Reservoir Simulation Toolbox (MRST)\n", "abstract": " This book provides a self-contained introduction to the simulation of flow and transport in porous media, written by a developer of numerical methods. The reader will learn how to implement reservoir simulation models and computational algorithms in a robust and efficient manner. The book contains a large number of numerical examples, all fully equipped with online code and data, allowing the reader to reproduce results, and use them as a starting point for their own work. All of the examples in the book are based on the MATLAB Reservoir Simulation Toolbox (MRST), an open-source toolbox popular popularity in both academic institutions and the petroleum industry. The book can also be seen as a user guide to the MRST software. It will prove invaluable for researchers, professionals and advanced students using reservoir simulation methods. This title is also available as Open Access on Cambridge Core.", "num_citations": "465\n", "authors": ["891"]}
{"title": "Open-source MATLAB implementation of consistent discretisations on complex grids\n", "abstract": " Accurate geological modelling of features such as faults, fractures or erosion requires grids that are flexible with respect to geometry. Such grids generally contain polyhedral cells and complex grid-cell connectivities. The grid representation for polyhedral grids in turn affects the efficient implementation of numerical methods for subsurface flow simulations. It is well known that conventional two-point flux-approximation methods are only consistent for K-orthogonal grids and will, therefore, not converge in the general case. In recent years, there has been significant research into consistent and convergent methods, including mixed, multipoint and mimetic discretisation methods. Likewise, the so-called multiscale methods based upon hierarchically coarsened grids have received a lot of attention. The paper does not propose novel mathematical methods but instead presents an open-source Matlab® toolkit that …", "num_citations": "460\n", "authors": ["891"]}
{"title": "Splitting methods for partial differential equations with rough solutions: Analysis and MATLAB programs\n", "abstract": " Operator splitting (or the fractional steps method) is a very common tool to analyze nonlinear partial differential equations both numerically and analytically. By applying operator splitting to a complicated model one can often split it into simpler problems that can be analyzed separately. In this book one studies operator splitting for a family of nonlinear evolution equations, including hyperbolic conservation laws and degenerate convection-diffusion equations. Common for these equations is the prevalence of rough, or non-smooth, solutions, eg, shocks. Rigorous analysis is presented, showing that both semi-discrete and fully discrete splitting methods converge. For conservation laws, sharp error estimates are provided and for convection-diffusion equations one discusses a priori and a posteriori correction of entropy errors introduced by the splitting. Numerical methods include finite difference and finite volume methods as well as front tacking. The theory is illustrated by numerous examples. There is a dedicated web page that provides MATLAB codes for many of the examples. The book is suitable for graduate students and researchers in pure and applied mathematics, physics, and engineering.", "num_citations": "220\n", "authors": ["891"]}
{"title": "A hierarchical multiscale method for two-phase flow based upon mixed finite elements and nonuniform coarse grids\n", "abstract": " We analyze and further develop a hierarchical multiscale method for the numerical simulation of two-phase flow in highly heterogeneous porous media. The method is based upon a mixed finite-element formulation, where fine-scale features are incorporated into a set of coarse-grid basis functions for the flow velocities. By using the multiscale basis functions, we can retain the efficiency of an upscaling method by solving the pressure equation on a (moderate-sized) coarse grid, while at the same time produce a detailed and conservative velocity field on the underlying fine grid.Earlier work has shown that the multiscale method performs excellently on highly heterogeneous cases using uniform coarse grids. In this paper, we extend the methodology to nonuniform and unstructured coarse grids and discuss various formulations for generating the coarse-grid basis functions. Moreover, we focus on the impact of large …", "num_citations": "219\n", "authors": ["891"]}
{"title": "An introduction to the numerics of flow in porous media using Matlab\n", "abstract": " Even though the art of reservoir simulation has evolved through more than four decades, there is still a substantial research activity that aims toward faster, more robust, and more accurate reservoir simulators. Here we attempt to give the reader an introduction to the mathematics and the numerics behind reservoir simulation. We assume that the reader has a basic mathematical background at the undergraduate level and is acquainted with numerical methods, but no prior knowledge of the mathematics or physics that govern the reservoir flow process is needed. To give the reader an intuitive understanding of the equations that model filtration through porous media, we start with incompressible single-phase flow and move step-by-step to the black-oil model and compressible two-phase flow. For each case, we present a basic numerical scheme in detail, before we discuss a few alternative schemes that …", "num_citations": "205\n", "authors": ["891"]}
{"title": "A comparison of multiscale methods for elliptic problems in porous media flow\n", "abstract": " We review and perform comparison studies for three recent multiscale methods for solving elliptic problems in porous media flow; the multiscale mixed finite-element method, the numerical subgrid upscaling method, and the multiscale finite-volume method. These methods are based on a hierarchical strategy, where the global flow equations are solved on a coarsened mesh only. However, for each method, the discrete formulation of the partial differential equations on the coarse mesh is designed in a particular fashion to account for the impact of heterogeneous subgrid structures of the porous medium. The three multiscale methods produce solutions that are mass conservative on the underlying fine mesh. The methods may therefore be viewed as efficient, approximate fine-scale solvers, i.e., as an inexpensive alternative to solving the elliptic problem on the fine mesh. In addition, the methods may be …", "num_citations": "197\n", "authors": ["891"]}
{"title": "Multiscale mixed/mimetic methods on corner-point grids\n", "abstract": " Multiscale simulation is a promising approach to facilitate direct simulation of large and complex grid models for highly heterogeneous petroleum reservoirs. Unlike traditional simulation, approaches based on upscaling/downscaling, multiscale methods seek to solve the full flow problem by incorporating subscale heterogeneities into local discrete approximation spaces. We consider a multiscale formulation based on a hierarchical grid approach, where basis functions with subgrid resolution are computed numerically to correctly and accurately account for subscale variations from an underlying (fine-scale) geomodel when solving the global flow equations on a coarse grid. By using multiscale basis functions to discretise the global flow equations on a (moderately sized) coarse grid, one can retain the efficiency of an upscaling method and, at the same time, produce detailed and conservative velocity fields …", "num_citations": "191\n", "authors": ["891"]}
{"title": "Mixed multiscale finite elements and streamline methods for reservoir simulation of large geomodels\n", "abstract": " We present a new approach to reservoir simulation that gives accurate resolution of both large-scale and fine-scale flow patterns. The method uses a mixed multiscale finite-element method (MMsFEM) to solve the pressure equation on a coarse grid and a streamline-based technique to solve the fluid transport on a fine-scale subgrid. The MMsFEM is based on the construction of special approximation velocity spaces that are adaptive to the local properties of the differential operator. As such, MMsFEM produces a detailed subgrid velocity field that reflects the impact of the fine-scale heterogeneous structures. By combining MMsFEM with rapid streamline simulation of the fluid transport, we aim towards a numerical scheme that facilitates routine reservoir simulation of large heterogeneous geomodels without upscaling. The new method is applied to two different test cases. The first test case consists of two (strongly …", "num_citations": "191\n", "authors": ["891"]}
{"title": "Solving the Euler equations on graphics processing units\n", "abstract": " The paper describes how one can use commodity graphics cards (GPUs) as a high-performance parallel computer to simulate the dynamics of ideal gases in two and three spatial dimensions. The dynamics is described by the Euler equations, and numerical approximations are computed using state-of-the-art high-resolution finite-volume schemes. These schemes are based upon an explicit time discretisation and are therefore ideal candidates for parallel implementation.", "num_citations": "162\n", "authors": ["891"]}
{"title": "MRST-AD - an open-source framework for rapid prototyping and evaluation of reservoir simulation problems\n", "abstract": " We present MRST–AD, a free, open-source framework written as part of the Matlab Reservoir Simulation Toolbox and designed to provide researchers with the means for rapid prototyping and experimentation for problems in reservoir simulation. The article outlines the design principles and programming techniques used and explains in detail the implementation of a full-featured, industry-standard black-oil model on unstructured grids. The resulting simulator has been thoroughly validated against a leading commercial simulator on benchmarks from the SPE Comparative Solution Projects, as well as on a real-field model (Voador, Brazil). We also show in detail how practitioners can easily extend the black-oil model with new constitutive relationships, or additional features such as polymer flooding, thermal and reactive effects, and immediately benefit from existing functionality such as constrained-pressure-residual …", "num_citations": "144\n", "authors": ["891"]}
{"title": "On the artificial compression method for second-order nonoscillatory central difference schemes for systems of conservation laws\n", "abstract": " The recently proposed high-order central difference schemes for conservation laws have a tendency of smearing linear discontinuities. In principle, Harten's artificial compression method (ACM) could be used to improve resolution. We analyze why this approach has not yet been used successfully and derive a more powerfulversion of the ACM based on a rigorous estimate of the total variation. We discuss the potential danger of overcompression and point out directions of future algorithmic development.", "num_citations": "129\n", "authors": ["891"]}
{"title": "Fast computation of multiphase flow in porous media by implicit discontinuous Galerkin schemes with optimal ordering of elements\n", "abstract": " We present a family of implicit discontinuous Galerkin schemes for purely advective multiphase flow in porous media in the absence of gravity and capillary forces. To advance the solution one time step, one must solve a discrete system of nonlinear equations. By reordering the grid cells, the nonlinear system can be shown to have a lower triangular block structure, where each block corresponds to the degrees-of-freedom in a single or a small number of cells. To reorder the system, we view the grid cells and the fluxes over cell interfaces as vertices and edges in a directed graph and use a standard topological sorting algorithm. Then the global system can be computed by processing the blocks sequentially using a standard Newton–Raphson algorithm for the degrees-of-freedom in each block. Decoupling the system offers greater control over the nonlinear solution procedure and reduces the computational costs …", "num_citations": "120\n", "authors": ["891"]}
{"title": "The application of flow diagnostics for reservoir management\n", "abstract": " Flow diagnostics, as referred to herein, are computational tools derived from controlled numerical flow experiments that yield quantitative information regarding the flow behavior of a reservoir model in settings much simpler than would be encountered in the actual field. In contrast to output from traditional reservoir simulators, flow-diagnostic measures can be obtained within seconds. The methodology can be used to evaluate, rank, and/or compare realizations or strategies, and the computational speed makes it ideal for interactive visualization output. We also consider application of flow diagnostics as proxies in optimization of reservoir-management work flows. In particular, by use of finite-volume discretizations for pressure, time of flight (TOF), and stationary tracers, we efficiently compute general Lorenz coefficients (and variants) that are shown to correlate well with simulated recovery. For efficient optimization …", "num_citations": "110\n", "authors": ["891"]}
{"title": "Numerical methods for the simulation of the settling of flocculated suspensions\n", "abstract": " For one space dimension, the phenomenological theory of sedimentation of flocculated suspensions yields a model that consists of an initial-boundary value problem for a second order partial differential equation of mixed hyperbolic–parabolic type. Due to the mixed hyperbolic-parabolic nature of the model, its solutions may be discontinuous and difficulties arise if one tries to construct these solutions by classical numerical methods. In this paper we present and elaborate on numerical methods that can be used to correctly simulate this model, i.e. conservative methods satisfying a discrete entropy principle. Included in our discussion are finite difference methods and methods based on operator splitting. In particular, the operator splitting methods are used to simulate the settling of flocculated suspensions.", "num_citations": "110\n", "authors": ["891"]}
{"title": "A multiscale restriction-smoothed basis method for high contrast porous media represented on unstructured grids\n", "abstract": " A wide variety of multiscale methods have been proposed in the literature to reduce runtime and provide better scaling for the solution of Poisson-type equations modeling flow in porous media. We present a new multiscale restricted-smoothed basis (MsRSB) method that is designed to be applicable to both rectilinear grids and unstructured grids. Like many other multiscale methods, MsRSB relies on a coarse partition of the underlying fine grid and a set of local prolongation operators (multiscale basis functions) that map unknowns associated with the fine grid cells to unknowns associated with blocks in the coarse partition. These mappings are constructed by restricted smoothing: Starting from a constant, a localized iterative scheme is applied directly to the fine-scale discretization to compute prolongation operators that are consistent with the local properties of the differential operators.The resulting method has …", "num_citations": "104\n", "authors": ["891"]}
{"title": "Operator splitting methods for systems of convection–diffusion equations: nonlinear error mechanisms and correction strategies\n", "abstract": " Many numerical methods for systems of convection–diffusion equations are based on an operator splitting formulation, where convective and diffusive forces are accounted for in separate substeps. We describe the nonlinear mechanism of the splitting error in such numerical methods in the one-dimensional case, a mechanism that is intimately linked to the local linearizations introduced implicitly in the (hyperbolic) convection steps by the use of an entropy condition. For convection-dominated flows, we demonstrate that operator splitting methods typically generate a numerical widening of viscous fronts, unless the splitting step is of the same magnitude as the diffusion scale. To compensate for the potentially damaging splitting error, we propose a corrected operator splitting (COS) method for general systems of convection–diffusion equations with the ability of correctly resolving the nonlinear balance between the …", "num_citations": "104\n", "authors": ["891"]}
{"title": "Visual simulation of shallow-water waves\n", "abstract": " A commodity-type graphics card (GPU) is used to simulate nonlinear water waves described by a system of balance laws called the shallow-water system. To solve this hyperbolic system we use explicit high-resolution central-upwind schemes, which are particularly well suited for exploiting the parallel processing power of the GPU. In fact, simulations on the GPU are found to run 15–30 times faster than on a CPU. The simulated cases involve dry-bed zones and nontrivial bottom topographies, which are real challenges to the robustness and accuracy of the discretization.", "num_citations": "103\n", "authors": ["891"]}
{"title": "A multiscale mixed finite element method for vuggy and naturally-fractured reservoirs\n", "abstract": " Vugs, caves, and fractures can alter the effective permeability of carbonate reservoirs significantly and should be accounted for accurately in a geomodel. Accurate modeling of the interaction between free-flow and porous regions is essential for flow simulations and detailed production-engineering calculations. However, flow simulation of such reservoirs is very challenging because of the coexistence of porous and free-flow regions on multiple scales that need to be coupled.", "num_citations": "98\n", "authors": ["891"]}
{"title": "Geometric modelling, numerical simulation, and optimization\n", "abstract": " This book presents current activities of the Department of Applied Mathematics at SINTEF, the largest independent research organisation in Scandinavia. The book contains fifteen papers contributed by employees and fellow partners from collaborating institutions.", "num_citations": "95\n", "authors": ["891"]}
{"title": "Field-case simulation of CO2-plume migration using vertical-equilibrium models\n", "abstract": " When injected in deep saline aquifers, CO2 moves radially away from the injection well and progressively higher in the formation because of buoyancy forces. Analyzes have shown that after the injection period, CO2 will potentially migrate over several kilometers in the horizontal direction but only tens of meters in the vertical direction, limited by the aquifer caprock. Because of the large horizontal plume dimensions, three-dimensional numerical simulations of the plume migration over long periods of time are computationally intensive. Thus, to get results within a reasonable time frame, one is typically forced to use coarse meshes and long time steps which result in inaccurate results because of numerical errors in resolving the plume tip.Given the large aspect ratio between the vertical and horizontal plume dimensions, it is reasonable to approximate the CO2 migration using vertically averaged models. Such …", "num_citations": "81\n", "authors": ["891"]}
{"title": "Modelling of multiscale structures in flow simulations for petroleum reservoirs\n", "abstract": " Flow in petroleum reservoirs occurs on a wide variety of physical scales. This poses a continuing challenge to modelling and simulation of reservoirs since fine-scale effects often have a profound impact on flow patterns on larger scales. Resolving all pertinent scales and their interaction is therefore imperative to give reliable qualitative and quantitative simulation results. To overcome the problem of multiple scales it is customary to use some kind of upscaling or homogenisation procedure, in which the reservoir properties are represented by some kind of averaged properties and the flow is solved on a coarse grid. Unfortunately, most upscaling techniques give reliable results only for a limited range of flow scenarios. Increased demands for reservoir simulation studies have therefore led researchers to develop more rigorous multiscale methods that incorporate subscale effects more directly.             In the first …", "num_citations": "80\n", "authors": ["891"]}
{"title": "The multiscale restriction smoothed basis method for fractured porous media (F-MsRSB)\n", "abstract": " A novel multiscale method for multiphase flow in heterogeneous fractured porous media is devised. The discrete fine-scale system is described using an embedded fracture modeling approach, in which the heterogeneous rock (matrix) and highly-conductive fractures are represented on independent grids. Given this fine-scale discrete system, the method first partitions the fine-scale volumetric grid representing the matrix and the lower-dimensional grids representing fractures into independent coarse grids. Then, basis functions for matrix and fractures are constructed by restricted smoothing, which gives a flexible and robust treatment of complex geometrical features and heterogeneous coefficients. From the basis functions one constructs a prolongation operator that maps between the coarse- and fine-scale systems. The resulting method allows for general coupling of matrix and fracture basis functions, giving …", "num_citations": "76\n", "authors": ["891"]}
{"title": "Improved streamlines and time-of-flight for streamline simulation on irregular grids\n", "abstract": " Streamline methods have shown to be effective for reservoir simulation. For a regular grid, it is common to use the semi-analytical Pollock’s method to obtain streamlines and time-of-flight coordinates (TOF). The usual way of handling irregular grids is by trilinear transformation of each grid cell to a unit cube together with a linear flux interpolation scaled by the Jacobian. The flux interpolation allows for fast integration of streamlines, but is inaccurate even for uniform flow. To improve the tracing accuracy, we introduce a new interpolation method, which we call corner-velocity interpolation. Instead of interpolating the velocity field based on discrete fluxes at cell edges, the new method interpolates directly from reconstructed point velocities given at the corner points in the grid. This allows for reproduction of uniform flow, and eliminates the influence of cell geometries on the velocity field. Using several numerical …", "num_citations": "72\n", "authors": ["891"]}
{"title": "On the importance of the stokes-brinkman equations for computing effective permeability in karst reservoirs\n", "abstract": " Cavities and fractures significantly affect the flow paths in carbonate reservoirs and should be accurately accounted for in numerical models. Herein, we consider the problem of computing the effective permeability of rock samples based on high-resolution 3D CT scans containing millions of voxels. We use the Stokes-Brinkman equations in the entire domain, covering regions of free flow governed by the Stokes equations, porous Darcy flow, and transitions between them. The presence of different length scales and large (ten orders of magnitude) contrasts in permeability leads to highly ill-conditioned linear systems of equations, which are difficult to solve. To obtain a problem that is computationally tractable, we first analyze the relative importance of the Stokes and Darcy terms for a set of idealized 2D models. We find that, in terms of effective permeability, the Stokes-Brinkman equations are only applicable for a …", "num_citations": "65\n", "authors": ["891"]}
{"title": "Fully implicit simulation of polymer flooding with MRST\n", "abstract": " The present work describes a fully implicit simulator for polymer injection implemented in the free, open-source MATLAB Reservoir Simulation Toolbox (MRST). Polymer injection is one of the widely used enhanced oil recovery (EOR) techniques, and complicated physical process is involved, which makes accurate simulation very challenging. The proposed work is intended for providing a powerful and flexible tool to investigate the polymer injection process in realistic reservoir scenarios. Within the model, the polymer component is assumed to be only transported in the water phase and adsorbed in the rock. The hydrocarbon phases are not influenced by the polymer, and they are described with the standard, three-phase, black-oil equations. The effects of the polymer are simulated based on the Todd–Longstaff mixing model, accounting for adsorption, inaccessible pore space, and permeability reduction …", "num_citations": "62\n", "authors": ["891"]}
{"title": "An unconditionally stable splitting scheme for a class of nonlinear parabolic equations\n", "abstract": " We propose and analyse a numerical scheme for a class of advection-dominated advection-diffusion-reaction equations. The scheme is essentially based on operator splitting combined with a front tracking method for conservation laws, which tracks an evolving piecewise constant solution with discontinuity paths defined by a varying velocity field. The splitting separates out the advection, which is modelled by a nonlinear conservation law, and the diffusion/reaction. Since the front tracking scheme (unlike conventional methods) has no associated time step, our numerical scheme can be made unconditionally stable by choosing appropriate methods for the diffusion and reaction steps. Nevertheless, it is observed that when the time step is notably larger than the diffusion scale, the scheme can become too diffusive. This can be inferred by the fact that the entropy condition forces the hyperbolic solver to throw away …", "num_citations": "62\n", "authors": ["891"]}
{"title": "An efficient discontinuous Galerkin method for advective transport in porous media\n", "abstract": " We consider a discontinuous Galerkin scheme for computing transport in heterogeneous media. An efficient solution of the resulting linear system of equations is possible by taking advantage of a priori knowledge of the direction of flow. By arranging the elements in a suitable sequence, one does not need to assemble the full system and may compute the solution in an element-by-element fashion. We demonstrate this procedure on boundary-value problems for tracer transport and time-of-flight.", "num_citations": "61\n", "authors": ["891"]}
{"title": "A fast marching method for reservoir simulation\n", "abstract": " We present a fast marching level set method for reservoir simulation based on a fractional flow formulation of two-phase, incompressible, immiscible flow in two or three space dimensions. The method uses a fast marching approach and is therefore considerably faster than conventional finite difference methods. The fast marching approach compares favorably with a front tracking method as regards both efficiency and accuracy. In addition, it maintains the advantage of being able to handle changing topologies of the front structure.", "num_citations": "61\n", "authors": ["891"]}
{"title": "Multiscale mimetic solvers for efficient streamline simulation of fractured reservoirs\n", "abstract": " Advances in reservoir characterization and modeling have given the industry improved ability to build detailed geological models of petroleum reservoirs. These models are characterized by complex shapes and structures with discontinuous material properties that span many orders of magnitude. Models that represent fractures explicitly as volumetric objects pose a particular challenge to standard simulation technology with regard to accuracy and computational efficiency.", "num_citations": "60\n", "authors": ["891"]}
{"title": "How to solve systems of conservation laws numerically using the graphics processor as a high-performance computational engine\n", "abstract": " The paper has two main themes: The first theme is to give the reader an introduction to modern methods for systems of conservation laws. To this end, we start by introducing two classical schemes, the Lax-Friedrichs scheme and the Lax-Wendroff scheme. Using a simple example, we show how these two schemes fail to give accurate approximations to solutions containing discontinuities. We then introduce a general class of semi-discrete finite-volume schemes that are designed to produce accurate resolution of both smooth and nonsmooth parts of the solution. Using this special class we wish to introduce the reader to the basic principles used to design modern high-resolution schemes. As examples of systems of conservation laws, we consider the shallow-water equations for water waves and the Euler equations for the dynamics of an ideal gas.             The second theme in the paper is how …", "num_citations": "55\n", "authors": ["891"]}
{"title": "Operator splitting methods for degenerate convection–diffusion equations II: numerical examples with emphasis on reservoir simulation and sedimentation\n", "abstract": " We present an accurate numerical method for a large class of scalar, strongly degenerate convection–diffusion equations. Important subclasses are hyperbolic conservation laws, porous medium type equations, two-phase reservoir flow equations, and strongly degenerate equations coming from the recent theory of sedimentation–consolidation processes. The method is based on splitting the convective and the diffusive terms. The nonlinear, convective part is solved using front tracking and dimensional splitting, while the nonlinear diffusion part is solved by an implicit–explicit finite difference scheme. In addition, one version of the implemented operator splitting method has a mechanism built in for detecting and correcting unphysical entropy loss, which may occur when the time step is large. This mechanism helps us gain a large time step ability for practical computations. A detailed convergence analysis of …", "num_citations": "54\n", "authors": ["891"]}
{"title": "Successful application of multiscale methods in a real reservoir simulator environment\n", "abstract": " For the past 10 years or so, a number of so-called multiscale methods have been developed as an alternative approach to upscaling and to accelerate reservoir simulation. The key idea of all these methods is to construct a set of prolongation operators that map between unknowns associated with cells in a fine grid holding the petrophysical properties of the geological reservoir model and unknowns on a coarser grid used for dynamic simulation. The prolongation operators are computed numerically by solving localized flow problems, much in the same way as for flow-based upscaling methods, and can be used to construct a reduced coarse-scale system of flow equations that describe the macro-scale displacement driven by global forces. Unlike effective parameters, the multiscale basis functions have subscale resolution, which ensures that fine-scale heterogeneity is correctly accounted for in a systematic …", "num_citations": "53\n", "authors": ["891"]}
{"title": "A multiscale restriction-smoothed basis method for compressible black-oil models\n", "abstract": " Simulation problems encountered in reservoir management are often computationally expensive because of the complex fluid physics for multiphase flow and the large number of grid cells required to honor geological heterogeneity. Multiscale methods have been proposed as a computationally inexpensive alternative to traditional fine-scale solvers for computing conservative approximations of the pressure and velocity fields on high-resolution geocellular models. Although a wide variety of such multiscale methods have been discussed in the literature, these methods have not yet seen widespread use in industry. One reason may be that no method has been presented so far that handles the combination of realistic flow physics and industry-standard grid formats in their full complexity. Herein, we present a multiscale method that handles both the most widespread type of flow physics (black-oil-type models) and …", "num_citations": "50\n", "authors": ["891"]}
{"title": "The Multiscale Finite-Volume Method on Stratigraphic Grids\n", "abstract": " Finding a pressure solution for large and highly detailed reservoir models with fine-scale heterogeneities modeled on a meter scale is computationally demanding. One way of making such simulations less compute-intensive is to use multiscale methods that solve coarsened flow problems by use of a set of reusable basis functions to capture flow effects induced by local geological variations. One such method, the multiscale finite-volume (MsFV) method, is well-studied for 2D Cartesian grids but has not been implemented for stratigraphic and unstructured grids with faults in three dimensions. We present an open-source implementation of the MsFV method in three dimensions along with a coarse partitioning algorithm that can handle stratigraphic grids with faults and wells. The resulting solver is an alternative to traditional upscaling methods, but can also be used for accelerating fine-scale simulations. To achieve …", "num_citations": "50\n", "authors": ["891"]}
{"title": "A multiscale adaptive local-global method for modeling flow in stratigraphically complex reservoirs\n", "abstract": " A robust and efficient simulation technique is developed on the basis of the extension of the mimetic finite-difference method (MFDM) to multiscale hierarchical-hexahedral (corner-point) grids by use of the multiscale mixed finite-element method (MsMFEM). The implementation of the mimetic subgrid-discretization method is compact and generic for a large class of grids and, thereby, is suitable for discretizations of reservoir models with complex geologic architecture. Flow equations are solved on a coarse grid where basis functions with subgrid resolution account accurately for subscale variations from an underlying fine-scale geomodel. The method relies on the construction of approximate velocity spaces that are adaptive to the local properties of the differential operator. A variant of the method for computing velocity basis functions is developed that uses an adaptive local-global (ALG) algorithm to compute …", "num_citations": "49\n", "authors": ["891"]}
{"title": "Simulation and visualization of the Saint-Venant system using GPUs\n", "abstract": " We consider three high-resolution schemes for computing shallow-water waves as described by the Saint-Venant system and discuss how to develop highly efficient implementations using graphical processing units (GPUs). The schemes are well-balanced for lake-at-rest problems, handle dry states, and support linear friction models. The first two schemes handle dry states by switching variables in the reconstruction step, so that bilinear reconstructions are computed using physical variables for small water depths and conserved variables elsewhere. In the third scheme, reconstructed slopes are modified in cells containing dry zones to ensure non-negative values at integration points. We discuss how single and double-precision arithmetics affect accuracy and efficiency, scalability and resource utilization for our implementations, and demonstrate that all three schemes map very well to current GPU …", "num_citations": "48\n", "authors": ["891"]}
{"title": "A front-tracking method for the simulation of three-phase flow in porous media\n", "abstract": " Under certain physically reasonable assumptions, three-phase flow of immiscible, incompressible fluids can be described by a 2×2 nongenuinely nonlinear, hyperbolic system. We combine analytical solutions to the corresponding Riemann problem with an efficient front-tracking method to study Cauchy and initial-boundary value problems. Unlike finite difference methods, the front-tracking method treats all waves as discontinuities by evolving shocks exactly and approximating rarefactions by small entropy-violating discontinuities. This way, the method can track individual waves and give very accurate (or even exact) resolution of discontinuities. We demonstrate the applicability of the method through several numerical examples, including a streamline simulation of a water-alternating-gas (WAG) injection process in a three-dimensional, heterogeneous, shallow-marine formation.", "num_citations": "48\n", "authors": ["891"]}
{"title": "Image Processing Based on Partial Differential Equations: Proceedings of the International Conference on PDE-Based Image Processing and Related Inverse Problems, CMA, Oslo …\n", "abstract": " The book contains twenty-two original scienti? c research articles that address the state-of-the-art in using partial di? erential equations for image and signal processing. The articles arose from presentations given at the inter-tional conference on PDE-Based Image Processing and Related Inverse Pr-lems, held at the Centre of Mathematics for Applications, University of Oslo, Norway, August 8-12, 2005. The purpose of the conference was to bring together international-searchers to present various aspects of new developments in using numerical techniques for partial di? erential equations to analyse and process digital-ages. Various aspects of new trends and techniques in this? eld were discussed in the conference, covering the following topics:• Level set methods and applications• Total variation regularization and other nonlinear? lters• Noise analysis and removal• Image inpainting• Image dejittering• Optical? ow estimation• Image segmentation• Image registration• Analysis and processing of MR images and brain mapping• Image construction techniques• Level set methods for inverse problems Inverse problems for partial di? erential equations have large areas of app-cations. Although image analysis and PDE inverse problems seem to be-related at a? rst glance, there are many techniques used in one of these two areas that are useful for the other. One goal of the conference was to highlight some of the recent e? orts in merging some of the techniques for these two research areas.", "num_citations": "47\n", "authors": ["891"]}
{"title": "The corrected operator splitting approach applied to a nonlinear advection-diffusion problem\n", "abstract": " So-called corrected operator splitting methods are applied to a 1-D scalar advection-diffusion equation of Buckley-Leverett type with general initial data. Front tracking and a 2nd order Godunov method are used to advance the solution in time. Diffusion is modelled by piece wise linear finite elements at each new time level. To obtain correct structure of shock fronts independently of the size of the time step, a dynamically defined residual flux term is grouped with diffusion. Different test problems are considered, and the methods are compared with respect to accuracy and runtime. Finally, we extend the corrected operator splitting to 2-D equations by means of dimensional splitting, and we apply it to a Buckley-Leverett type problem including gravitational effects.", "num_citations": "45\n", "authors": ["891"]}
{"title": "A multiscale two-point flux-approximation method\n", "abstract": " A large number of multiscale finite-volume methods have been developed over the past decade to compute conservative approximations to multiphase flow problems in heterogeneous porous media. In particular, several iterative and algebraic multiscale frameworks that seek to reduce the fine-scale residual towards machine precision have been presented. Common for all such methods is that they rely on a compatible primal–dual coarse partition, which makes it challenging to extend them to stratigraphic and unstructured grids. Herein, we propose a general idea for how one can formulate multiscale finite-volume methods using only a primal coarse partition. To this end, we use two key ingredients that are computed numerically: (i) elementary functions that correspond to flow solutions used in transmissibility upscaling, and (ii) partition-of-unity functions used to combine elementary functions into basis functions …", "num_citations": "44\n", "authors": ["891"]}
{"title": "Adaptive multiscale streamline simulation and inversion for high-resolution geomodels\n", "abstract": " A particularly efficient flow solver can be obtained by combining a recent mixed multiscale finite-element method for computing pressure and velocity fields with a streamline method for computing fluid transport. This multiscale-streamline method has shown to be a promising approach for fast flow simulations on high-resolution geologic models with multimillion grid cells. The multiscale method solves the pressure equation on a coarse grid while preserving important fine-scale details. Fine-scale heterogeneity is accounted for through a set of generalized, heterogeneous basis functions that are computed numerically by solving local flow problems. When included in the coarse-grid equations, the basis functions ensure that the global equations are consistent with the local properties of the underlying differential operators. The multiscale method offers a substantial gain in computation speed, without significant loss of …", "num_citations": "44\n", "authors": ["891"]}
{"title": "The open porous media flow reservoir simulator\n", "abstract": " The Open Porous Media (OPM) initiative is a community effort that encourages open innovation and reproducible research for simulation of porous media processes. OPM coordinates collaborative software development, maintains and distributes open-source software and open data sets, and seeks to ensure that these are available under a free license in a long-term perspective.In this paper, we present OPM Flow, which is a reservoir simulator developed for industrial use, as well as some of the individual components used to make OPM Flow. The descriptions apply to the 2019.10 release of OPM.", "num_citations": "43\n", "authors": ["891"]}
{"title": "An improved quadrature rule for the flux-computation in staggered central difference schemes in multidimensions\n", "abstract": " We present a new second-order, nonoscillatory, central difference scheme on two-dimensional, staggered, Cartesian grids for systems of conservation laws. The scheme uses a new, carefully designed integration rule for the flux computations and thereby takes more propagation directions into account. This effectively reduces grid orientation effects produced for two-dimensional radially symmetric gas flows and improves the accuracy for smooth solutions.", "num_citations": "43\n", "authors": ["891"]}
{"title": "Flow-based coarsening for multiscale simulation of transport in porous media\n", "abstract": " Geological models are becoming increasingly large and detailed to account for heterogeneous structures on different spatial scales. To obtain simulation models that are computationally tractable, it is common to remove spatial detail from the geological description by upscaling. Pressure and transport equations are different in nature and generally require different strategies for optimal upgridding. To optimize the accuracy of a transport calculation, the coarsened grid should generally be constructed based on a posteriori error estimates and adapt to the flow patterns predicted by the pressure equation. However, sharp and rigorous estimates are generally hard to obtain, and herein we therefore consider various ad hoc methods for generating flow-adapted grids. Common for all is that they start by solving a single-phase flow problem once and then continue to form a coarsened grid by amalgamating cells …", "num_citations": "41\n", "authors": ["891"]}
{"title": "Impact of top-surface morphology on CO2 storage capacity\n", "abstract": " Long-term forecasting of the behaviour of CO2 injected in industrial quantities into sub-surface reservoirs is generally performed using models including very limited geological detail. This practise, although dictated by restrictions with respect to model resolution and CPU cost, partly rests on an unverified but widely held assumption that geological detail will not influence simulation outcomes on the spatial and temporal scales relevant for geological sequestration. The present study aims to partly assess the validity of this assumption by selecting a series of realistic geological features and investigate their impact when modelling CO2 sequestration.Injected CO2 is primarily retained in structural and stratigraphic traps at the top of the reservoir interval. We will therefore investigate how different top-surface morphologies will influence the CO2 storage capacity. To this end, a series of different top surfaces are created by …", "num_citations": "38\n", "authors": ["891"]}
{"title": "Fully implicit simulation of vertical-equilibrium models with hysteresis and capillary fringe\n", "abstract": " Geological carbon storage represents a new and substantial challenge for the subsurface geosciences. To increase understanding and make good engineering decisions, containment processes and large-scale storage operations must be simulated in a thousand year perspective. A hierarchy of models of increasing computational complexity for analysis and simulation of large-scale CO2 storage has been implemented as a separate module of the open-source Matlab Reservoir Simulation Toolbox (MRST). This paper describes a general family of two-scale models available in this module. The models consist of two-dimensional flow equations formulated in terms of effective quantities obtained from hydrostatic reconstructions of vertical pressure and saturation distributions. The corresponding formulation is fully implicit and is the first to give a mass-conservative treatment and include general (non …", "num_citations": "37\n", "authors": ["891"]}
{"title": "Fast simulation of polymer injection in heavy-oil reservoirs on the basis of topological sorting and sequential splitting\n", "abstract": " We present a set of algorithms for sequential solution of flow and transport that can be used for efficient simulation of polymer injection modeled as a compressible two-phase system. Our formulation gives a set of nonlinear transport equations that can be discretized with standard implicit upwind methods to conserve mass and volume independent of the timestep. In the absence of gravity and capillary forces, the resulting nonlinear system of discrete transport equations can be permuted to lower triangular form with a simple topological-sorting method from graph theory. This gives an optimal nonlinear solver that computes the solution cell by cell with local iteration control. The single-cell systems can be reduced to a nested set of nonlinear scalar equations that can be bracketed and solved with standard gradient or root-bracketing methods. The resulting method gives orders-of-magnitude reduction in run times and …", "num_citations": "37\n", "authors": ["891"]}
{"title": "A Multiscale Mixed Finite Element Solver for Three Phase Black Oil Flow\n", "abstract": " Previous research has shown that multiscale methods are robust and capable of providing more accurate solutions than traditional upscaling methods. Multiscale methods solve the pressure equation on a coarse grid, but capture the effects from fine-scale heterogeneities through basis functions computed numerically from local single-phase problems on the underlying geocellular grid. Published results have so far been limited to simple Cartesian grids and/or incompressible flow. Here, we present a multiscale mixed finite-element method for three-phase below-oil flow on geomodels with industry-standard complexity. In particular, we discuss which effects can be incorporated in the multiscale basis functions and which effects should be modeled only on the coarsened simulation grid. Moreover, we describe how to handle degenerate heahedral cells and non-matching interfaces that occur across faults. Finally, we …", "num_citations": "37\n", "authors": ["891"]}
{"title": "An unconditionally stable method for the Euler equations\n", "abstract": " We discuss how to combine a front tracking method with dimensional splitting to solve systems of conservation laws numerically in two space dimensions. In addition we present an adaptive grid refinement strategy. The method is unconditionally stable and allows for moderately high cfl numbers (typically 1–4), and thus it is highly efficient. The method is applied to the Euler equations of gas dynamics. In particular, it is tested on an expanding circular gas front, a wind tunnel with a step, a double Mach reflection, and a shock–bubble interaction. The method shows very sharp resolution of shocks.", "num_citations": "37\n", "authors": ["891"]}
{"title": "Discontinuous Galerkin methods for advective transport in single-continuum models of fractured media\n", "abstract": " Accurate simulation of flow and transport processes in fractured rocks requires that flow in fractures and shear zones to be coupled with flow in the porous rock matrix. To this end, we will herein consider a single-continuum approach in which both fractures and the porous rock are represented as volumetric objects, i.e., as cells in an unstructured triangular grid with a permeability and a porosity value associated with each cell. Hence, from a numerical point of view, there is no distinction between flow in the fractures and the rock matrix. This enables modelling of realistic cases with very complex structures. To compute single-phase advective transport in such a model, we propose to use a family of higher-order discontinuous Galerkin methods. Single-phase transport equations are hyperbolic and have an inherent causality in the sense that information propagates along streamlines. This causality is preserved in our …", "num_citations": "36\n", "authors": ["891"]}
{"title": "GEOLOGICAL RESPONSE DATA IMAGING WITH STREAM PROCESSORS\n", "abstract": " The invention describes a method to convert geological response data to graphical raw data by using at least one stream processor for this purpose. The geological response data is pre-processed by a CPU and the preprocessed geological response data is fed into one or more stream processors. The stream processor then does the calculation intensive work on the preprocessed geological response data and returns the processing results back to the CPU which does some post-processing on the results coming from the stream processor Stream processors comprise single or multiple programmable GPUs, clusters/networks of nodes with one or several GPU's; cell processors (or processors derived from it) or a cluster of cell processor nodes, game computers (in the spirit of Sony's PlayStation, Nintendo's GameCube, etc.) or clusters of game computers.", "num_citations": "36\n", "authors": ["891"]}
{"title": "Unconditionally stable splitting methods for the shallow water equations\n", "abstract": " The front-tracking method for hyperbolic conservation laws is combined with operator splitting to study the shallow water equations. Furthermore, the method includes adaptive grid refinement in multidimensions and shock tracking in one dimension. The front-tracking method is unconditionally stable, but for practical computations feasible CFL numbers are moderately above unity (typically between 1 and 5). The method resolves shocks sharply and is highly efficient. The numerical technique is applied to four test cases, the first being an expanding bore with rotational symmetry. The second problem addresses the question of describing the time development of two constant water levels separated by a dam that breaks instantaneously. The third problem compares the front-tracking method with an explicit analytic solution of water waves rotating over a parabolic bottom profile. Finally, we study flow over an …", "num_citations": "36\n", "authors": ["891"]}
{"title": "Robust Simulation of Sharp-Interface Models for Fast Estimation of CO2 Trapping Capacity in Large-Scale Aquifer Systems\n", "abstract": " Modeling geological carbon storage represents a new and substantial challenge for the subsurface geosciences. To increase understanding and make good engineering decisions, containment processes and large-scale storage operations must be simulated in a thousand-year perspective. Large differences in spatial and temporal scales make it prohibitively expensive to compute the fate of injected CO2 using traditional 3D simulators. Instead, accurate forecast can be computed using simplified models that are adapted to the specific setting of the bouyancy-driven migration of the light fluid phase. This paper presents a family of vertically integrated models for studying the combined large-scale and long-term effects of structural, residual, and solubility trapping of CO2. The models are based on an assumption of a sharp interface separating CO2 and brine and can provide a detailed inventory of the …", "num_citations": "35\n", "authors": ["891"]}
{"title": "Dimensional splitting with front tracking and adaptive grid refinement\n", "abstract": " Front tracking in combination with dimensional splitting is analyzed as a numerical method for scalar conservation laws in two space dimensions. An analytic error bound is derived, and convergence rates based on numerical experiments are presented. Numerical experiments indicate that large CFL numbers can be used without loss of accuracy for a wide range of problems. A new method for grid refinement is introduced. The method easily allows for dynamical changes in the grid, using, for instance, the total variation in each grid cell as a criterion for introducing new or removing existing refinements. Several numerical examples are included, highlighting the features of the numerical method. A comparison with a high‐resolution method confirms that dimensional splitting with front tracking is a highly viable numerical method for practical computations. © 1998 John Wiley & Sons, Inc. Numer Methods Partial …", "num_citations": "34\n", "authors": ["891"]}
{"title": "Efficient GPU-Implementation of Adaptive Mesh Refinement for the Shallow-Water Equations\n", "abstract": " The shallow-water equations model hydrostatic flow below a free surface for cases in which the ratio between the vertical and horizontal length scales is small and are used to describe waves in lakes, rivers, oceans, and the atmosphere. The equations admit discontinuous solutions, and numerical solutions are typically computed using high-resolution schemes. For many practical problems, there is a need to increase the grid resolution locally to capture complicated structures or steep gradients in the solution. An efficient method to this end is adaptive mesh refinement (AMR), which recursively refines the grid in parts of the domain and adaptively updates the refinement as the simulation progresses. Several authors have demonstrated that the explicit stencil computations of high-resolution schemes map particularly well to many-core architectures seen in hardware accelerators such as graphics processing …", "num_citations": "33\n", "authors": ["891"]}
{"title": "Accurate modelling of faults by multipoint, mimetic, and mixed methods\n", "abstract": " The predominant way of modeling faults in industry-standard flow simulators is to introduce so-called transmissibility multipliers in the underlying two-point discretization. Although this approach provides adequate accuracy in many practical cases, two-point discretizations are only consistent for K-orthogonal grids and may introduce significant discretization errors for grids that severely depart from being K-orthogonal. Such grid-distortion errors can be avoided by lateral or vertical stair-stepping of deviated faults at the expense of errors in the geometrical fault description. In other words, modelers have the choice of either making (geometrical) errors by adapting faults to a grid that is almost K-orthogonal, or introducing discretization errors because of the lack of K-orthogonality if the grid is adapted to deviated faults.", "num_citations": "32\n", "authors": ["891"]}
{"title": "Operator splitting methods for degenerate convection-diffusion equations. I. Convergence and entropy estimates\n", "abstract": " We present and analyze a numerical method for the solution of a class of scalar, multi-dimensional, nonlinear degenerate convection-diffusion equations. The method is based on operator splitting to separate the convective and the diffusive terms in the governing equation. The nonlinear convective part is solved using front tracking and dimensional splitting, while the nonlinear diffusion equation is solved by a suitable difference scheme. We verify Ll compactness of the corresponding set of approximate solutions and derive precise entropy estimates. In particular, these results allow us to pass to the limit in our approximations and recover an entropy solution of the problem in question. The theory presented covers a large class of equations. Important subclasses are hyperbolic conservation laws, porous medium type equations, two-phase reservoir flow equations, and strongly degenerate equations coming from the recent theory of sedimentation-consolidation processes. A thorough numerical investigation of the method analyzed in this paper (and similar methods) is presented in a companion paper.", "num_citations": "32\n", "authors": ["891"]}
{"title": "A front tracking approach to a two-phase fluid flow model with capillary forces\n", "abstract": " Wc consider a prototype two-phase fluid flow model with capillary forces. The pressure equation is solved using standard finite elements and multigrid techniques. The parabolic saturation equation is addressed via a novel corrected operator splitting approach. In typical applications, the importance of advection versus diffusion (capillary forces) may change rapidly during a simulation. The corrected splitting is designed so that any combination of advection and diffusion is resolved accurately. It gives a hyperbolic conservation law for modelling advection and a parabolic equation for modelling diffusion. The conservation law is solved by front tracking, which naturally leads to a dynamically defined residual flux term that can be included in the diffusion equation. The residual term ensures that self-sharpening fronts are given the correct structure. A Petrov-Galerkin finite element method is used to solve the diffusion equation. Wc present several examples that demonstrate potential shortcomings of standard viscous operator sphtting and highlights the corrected splitting strategy. This is the first time a front tracking simulator is applied to a flow model including capillary forces.", "num_citations": "31\n", "authors": ["891"]}
{"title": "On the Stokes-Brinkman equations for modeling flow in carbonate reservoirs\n", "abstract": " Cavities and fractures can significantly affect the flow paths of carbonate reservoirs and should be accurately accounted for during flow simulation. Herein, our goal is to compute the effective permeability of rock samples based on high-resolution 3D CT-scans containing millions of voxels. Hence, we need a flow model that properly accounts for the effects of Darcy flow in the porous material and Stokes flow in the void volumes on relevant scales. The presence of different length scales and large contrasts in the petrophysical parameters lead to highly ill-conditioned linear systems that make such a flow model very difficult to solve, even on large-scale parallel computers. To identify simplifications that render the problem computationally tractable, we analyze the relative importance of the Stokes and Darcy terms for a wide variety of parameter ranges on an idealized 2D model. We find that a system with a through …", "num_citations": "30\n", "authors": ["891"]}
{"title": "Toward reservoir simulation on geological grid models\n", "abstract": " B021 TOWARD RESERVOIR SIMULATION ON GEOLOGICAL GRID MODELS Abstract 1 We present a reservoir simulation scheme that gives accurate resolution of both large-scale and fine-scale flow patterns. The method uses a mixed multiscale finite-element method (MMsFEM) to solve the pressure equation on a coarse grid and a streamline-based technique to solve the fluid transport on a fine-scale subgrid. Through this combination we aim towards a numerical scheme that facilitates reservoir simulation of large heterogeneous geomodels without upscaling. We validate the method by applying it to a 3D upscaling benchmark case taken from the 10th SPE Comparative Solution Project. The numerical", "num_citations": "30\n", "authors": ["891"]}
{"title": "Analysis of CO2 trapping capacities and long-term migration for geological formations in the Norwegian North Sea using MRST-co2lab\n", "abstract": " MRST-co2lab is a collection of open-source computational tools for modeling large-scale and long-time migration of CO2 in conductive aquifers, combining ideas from basin modeling, computational geometry, hydrology, and reservoir simulation. Herein, we employ the methods of MRST-co2lab to study long-term CO2 storage on the scale of hundreds of megatonnes. We consider public data sets of two aquifers from the Norwegian North Sea and use geometrical methods for identifying structural traps, percolation-type methods for identifying potential spill paths, and vertical-equilibrium methods for efficient simulation of structural, residual, and solubility trapping in a thousand-year perspective. In particular, we investigate how data resolution affects estimates of storage capacity and discuss workflows for identifying good injection sites and optimizing injection strategies.", "num_citations": "29\n", "authors": ["891"]}
{"title": "Numerical modeling of multiphase first-contact miscible flows. Part 2. Front-tracking/streamline simulation\n", "abstract": " In this paper we complete the description and application of a computational framework for the numerical simulation of first-contact miscible gas injection processes. The method is based on the front-tracking algorithm, in which numerical solutions to one- dimensional problems are constructed in the form of traveling discontinuities. The efficiency of the front-tracking method relies on the availability of the analytical Riemann solver described in Part 1 and a strategy for simplifying the wave structure for Riemann problems of small amplitude. Several representative examples are used to illustrate the excellent behavior of the front-tracking method. The front-tracking method is extended to simulate higher-dimensional processes through the use of streamlines. The paper presents a validation exercise for a quarter five-spot homogeneous problem, and an application of this computational framework for the …", "num_citations": "25\n", "authors": ["891"]}
{"title": "Multiscale simulation of polymer flooding with shear effects\n", "abstract": " Multiscale methods have been developed as an alternative approach to upscaling and to accelerate reservoir simulation. The key idea of all these methods is to construct a set of prolongation operators that map between unknowns associated with cells in a fine grid holding petrophysical properties and unknowns on a coarser grid used for dynamic simulation. Herein, we extend one such method—the multiscale restricted-smoothed basis (MsRSB) method—to polymer flooding including shear-thinning (and thickening) effects, which gives highly nonlinear fluid models that are challenging to simulate. To this end, we first formulate a sequentially implicit solution procedure for polymer models with non-Newtonian rheology. By treating the implicit velocity dependence of the viscosities in an inner iteration loop, we obtain a formulation that appears to be more robust and stable than the standard fully-implicit …", "num_citations": "24\n", "authors": ["891"]}
{"title": "A Method to Improve the Mass Balance in Streamline Methods\n", "abstract": " During the last decades, streamline methods have emerged as highly efficient simulation tools that are well-suited for eg, history matching and simulation of large and complex reservoir models. Streamline methods are based on a sequential solution procedure in which pressure and fluid velocities are computed by solving a pressure equation on a grid in physical space and the fluid transport is computed by solving 1-D transport problems along streamlines. The sequential Eulerian-Lagrangian procedure is the key to the high computational efficiency of streamline methods. On the other hand, it necessitates mapping of saturations (or fluid compositions) back and forth between the Eulerian pressure grid and the Lagrangian streamlines. Unfortunately, this introduces mass-balance errors that may accumulate in time and in turn yield significant errors in production curves.", "num_citations": "23\n", "authors": ["891"]}
{"title": "Numerical solution of the polymer system by front tracking\n", "abstract": " The paper describes the application of front tracking to the polymer system, an example of a nonstrictly hyperbolic system. Front tracking computes piecewise constant approximations based on approximate Riemann solutions and exact tracking of waves. It is well known that the front tracking method may introduce a blowup of the initial total variation for initial data along the curve where the two eigenvalues of the hyperbolic system are identical. It is demonstrated by numerical examples that the method converges to the correct solution after a finite time, and that this time decreases with the discretization parameter.               For multidimensional problems, front tracking is combined with dimensional splitting, and numerical experiments indicate that large splitting steps can be used without loss of accuracy. Typical CFL numbers are in the range 10–20, and comparisons with Riemann free, high-resolution …", "num_citations": "23\n", "authors": ["891"]}
{"title": "Fast computation of arrival times in heterogeneous media\n", "abstract": " We continue the work that was initiated in (K. H. Karlsen, K.-A. Lie, and N. H. Risebro. A fast marching method for reservoir simulation. Comp. Geo., 4(2) (2000)185–206) on a marching method for simulating two-phase incompressible immiscible flow of water and oil in a porous medium. We first present an alternative derivation of the marching method that reveals a strong connection to modern streamline methods. Then, through the study of three numerical test cases we present two deficiencies: (i) the original marching algorithm does not always compute the correct solution of the underlying difference equations, and (ii) the method gives largely inaccurate arrival times in the presence of large jumps within the upwind difference stencil. As a remedy of the first problem, we present a new advancing-front method, which is faster than the original marching method and guarantees a correct solution of the …", "num_citations": "22\n", "authors": ["891"]}
{"title": "Using sensitivities and vertical-equilibrium models for parameter estimation of CO2 injection models with application to Sleipner data\n", "abstract": " A key part of planning CO2 storage sites is to devise a monitoring strategy with proper modelling support. Herein, we show how a simulation framework that incorporates adjoint-based sensitivities can be combined with time-lapse seismics to update forecast models of the migrating plume, investigate the measurability of model parameters, and assess the effect of acquiring new measurements (value of information). In particular, we show how the sensitivities in measured quantities with respect to parameters can guide the choice of whether additional data should be obtained or not. To this end, we us singular value decomposition to find determine the model parameters that are best constrained with respect to the measured data, or, viewed alternatively, the parameters that has the largest influence on the mismatch between measured and simulated quantities. Other measurements like uplift data and gravitational …", "num_citations": "21\n", "authors": ["891"]}
{"title": "Fully implicit higher-order schemes applied to polymer flooding\n", "abstract": " In water-based EOR methods, active chemical or biological substances are added to modify the physical properties of the fluids or/and the porous media at the interface between oil and water. The resulting displacement processes are governed by complex interplays between the transport of chemical substances, which is largely linear and highly affected by numerical diffusion, and how these substances affect the flow by changing the properties of the fluids and the surrounding rock. These effects are highly nonlinear and highly sensitive to threshold parameters that determine sharp transitions between regions of very different behavior. Unresolved simulation can therefore lead to misleading predictions of injectivity and recovery profiles. Use of higher-order spatial discretization schemes have been proposed by many authors as a means to reduce numerical diffusion and grid-orientation effects. Most higher-order …", "num_citations": "21\n", "authors": ["891"]}
{"title": "A simulation workflow for large-scale CO2 storage in the Norwegian North Sea\n", "abstract": " Large-scale CO2 injection problems have revived the interest in simple models, like percolation and vertically-averaged models, for simulating fluid flow in reservoirs and aquifers. A series of such models have been collected and implemented together with standard reservoir simulation capabilities in a high-level scripting language as part of the open-source MATLAB Reservoir Simulation Toolbox (MRST) to give a set of simulation methods of increasing computational complexity. Herein, we outline the methods and discuss how they can be combined to create a flexible tool-chain for investigating CO2 storage on a scale that would have significant impact on European CO2 emissions. In particular, we discuss geometrical methods for identifying structural traps, percolation-type methods for identifying potential spill paths, and vertical-equilibrium methods that can efficiently simulate structural, residual, and …", "num_citations": "21\n", "authors": ["891"]}
{"title": "The Multiscale Finite Volume Method on Unstructured Grids\n", "abstract": " Finding a pressure solution for large-scale reservoirs that takes into account fine-scale heterogeneities can be very computationally intensive. One way of reducing the workload is to employ multiscale methods that capture local geological variations using a set of reusable basis functions. One of these methods, the multiscale finite-volume (MsFV) method is well studied for 2D Cartesian grids, but has not been implemented for stratigraphic and unstructured grids with faults in 3D. With reservoirs and other geological structures spanning several kilometers, running simulations on the meter scale can be prohibitively expensive in terms of time and hardware requirements. Multiscale methods are a possible solution to this problem, and extending the MsFV method to realistic grids is a step on the way towards fast and accurate solutions for large-scale reservoirs.", "num_citations": "21\n", "authors": ["891"]}
{"title": "A Front-Tracking Method for Efficient Simulation of Miscible Gas Injection Processes\n", "abstract": " This paper presents a front-tracking method for the numerical simulation of first-contact miscible gas injection processes. The method is developed for constructing very accurate (or even exact) solutions to one-dimensional initial-boundary-value problems in the form of a set of evolving discontinuities. The evolution of the discontinuities is given by analytical solutions to Riemann problems. A complete analytical Riemann solver is presented along with methods for simplifying the wave structure for Riemann problems of small amplitude. Several representative examples are used to illustrate the excellent behavior of the front-tracking method.", "num_citations": "20\n", "authors": ["891"]}
{"title": "A dimensional splitting method for quasilinear hyperbolic equations with variable coefficients\n", "abstract": " A numerical method is presented for the variable coefficient, nonlinear hyperbolic equation u                    t                  + ∑ i=1                    d                  V i(x, t)f i(u)                   x                  i = 0 in arbitrary space dimension for bounded velocities that are Lipschitz continuous in the x variable. The method is based on dimensional splitting and uses a recent front tracking method to solve the resulting one-dimensional non-conservative equations. The method is unconditionally stable, and it produces a subsequence that converges to the entropy solution as the discretization of time and space tends to zero. Four numerical examples are presented; numerical error mechanisms are illustrated for two linear equations, the efficiency of the method compared with a high-resolution TVD method is discussed for a nonlinear problem, and finally, applications to reservoir simulation are presented.", "num_citations": "20\n", "authors": ["891"]}
{"title": "Spill-point analysis and structural trapping capacity in saline aquifers using MRST-co2lab\n", "abstract": " Geological carbon storage represents a substantial challenge for the subsurface geosciences. Knowledge of the subsurface can be captured in a quantitative form using computational methods developed within petroleum production. However, to provide good estimates of the likely outcomes over thousands of years, traditional 3D simulation methods should be combined with other techniques developed specifically to study large-scale, long-term migration problems, e.g., in basin modeling. A number of such methods have been developed as a separate module in the open-source Matlab Reservoir Simulation Toolbox (MRST).In this paper, we present a set of tools provided by this module, consisting of geometrical and percolation type methods for computing structural traps and spill paths below a sealing caprock. Using concepts from water management, these tools can be applied on large-scale aquifer models to …", "num_citations": "19\n", "authors": ["891"]}
{"title": "Reexamining CO2 storage capacity and utilization of the Utsira Formation\n", "abstract": " In this work we provide estimates of CO2 storage capacity of the Utsira Formation using the recently provided datasets from the Norwegian Petroleum Directorate, taking CO2 density variation into account. We also investigate strategies on how to realize as much as possible of this potential in large-scale injection scenarios. We base our study on the assumption that the limiting factor for CO2 storage at Utsira is the efficient use of available trapping mechanisms, with pressure buildup being of secondary concern. We consider the trapping mechanisms considered most important for the medium-to-long term (structural, residual and dissolution trapping), using a combination of modeling tools based on the Matlab Reservoir Simulation Toolbox (MRST).", "num_citations": "19\n", "authors": ["891"]}
{"title": "Discretisation on Complex and Polyhedral Grids–Open Source MATLAB Implementation\n", "abstract": " Accurate geological modelling of features such as faults, fractures or erosion requires grids that are flexible with respect to geometry. Such grids generally contain polyhedral cells and complex grid cell connectivities. The grid representation for polyhedral grids in turn affects the efficient implementation of numerical methods for sub-surface flow simulations. Methods based on two-point flux approximations are known not to converge on grids which are not  orthogonal. In recent years, there has been significant research into mixed, multipoint, and mimetic discretisation methods that are all consistent and convergent. Furthermore, so-called multiscale methods have lately received a lot of attention. In this paper we consider a MATLAB implementation of consistent and convergent methods on unstructured, polyhedral grids. The main emphasis is put on flexibility and efficiency with respect to different grid formats, and …", "num_citations": "19\n", "authors": ["891"]}
{"title": "Front tracking and operator splitting for nonlinear degenerate convection-diffusion equations\n", "abstract": " We describe two variants of an operator splitting strategy for nonlinear, possibly strongly degenerate convection—diffusion equations. The strategy is based on splitting the equations into a hyperbolic conservation law for convection and a possibly degenerate parabolic equation for diffusion. The conservation law is solved by a front tracking method, while the diffusion equation is here solved by a finite difference scheme. The numerical methods are unconditionally stable in the sense that the (splitting) time step is not restricted by the spatial discretization parameter. The strategy is designed to handle all combinations of convection and diffusion (including the purely hyperbolic case). Two numerical examples are presented to highlight the features of the methods, and the potential for parallel implementation is discussed.", "num_citations": "19\n", "authors": ["891"]}
{"title": "A multiscale method based on restriction-smoothed basis functions suitable for general grids in high contrast media\n", "abstract": " A wide variety of multiscale methods have been proposed in the literature to improve simulation runtimes and provide better scaling to large models. With a few notable exceptions, the methods proposed so far are mostly limited to structured grids. We present a new multiscale restricted-smoothed basis (MsRSB) method that is designed to be applicable to stratigraphic and fully unstructured grids. Like many other multiscale methods, it is based on a coarse partition of an underlying fine grid with a set of prolongation operators (also called multiscale basis functions) that map from unknowns associated with the fine grid cells to unknowns associated with the coarse grid blocks. These mappings are constructed by restricted smoothing: starting from a constant, a localized iterative scheme is applied directly to the fine-scale discretization to give prolongation operators that are consistent with the local properties of the …", "num_citations": "18\n", "authors": ["891"]}
{"title": "Mathematical models for oil reservoir simulation\n", "abstract": " Petroleum resources are found within sedimentary rocks that have a sufficient interconnected void space to store and transmit fluids. The actual flow of liquid and gas phases occurs on a micrometer scale in the void space between rock grains. On the other hand, the hydrocarbon is typically carried in rock zones that are a few tens of meters thick but extend several kilometers in the lateral directions. The rock formations are typically heterogeneous at all length scales in between and phenomena at all length scales can have a profound impact on flow, making flow in subsurface reservoirs a true multiscale problem. Observing dynamic fluid behavior and measuring the pertinent parameters of a subsurface reservoir is difficult. Predicting reservoir performance therefore has a large degree of uncertainty attached. Simulation studies are usually performed to quantify this uncertainty. Reservoir simulation is the means by which one uses a numerical model of the geological and petrophysical characteristics of a hydrocarbon reservoir to analyze and predict fluid behavior in the reservoir over time. In its basic form, a reservoir simulation model consists of three parts:(i) a geological model in the form of a volumetric grid with cell/face properties that describes the given porous rock formation;(ii) a flow model that describes how fluids flow in a porous medium, typically given as a set of partial differential equations expressing conservation of mass or volumes together with appropriate closure relations; and (iii) a well model that describes the flow in and out of the reservoir, including a model for flow within the well bore and any coupling to flow control devices or …", "num_citations": "18\n", "authors": ["891"]}
{"title": "Unstructured gridding and consistent discretizations for reservoirs with faults and complex wells\n", "abstract": " This work consists of two parts. In the first part, we present new methods for generating unstructured polyhedral grids that align to prescribed geometric objects. Control-point alignment of cell centroids is introduced to accurately represent horizontal and multilateral wells, but can also be used to create volumetric representations of fracture networks. Boundary alignment of cell faces is introduced to accurately preserve geological features such as layers, fractures, faults, and/or pinchouts. Prescribed geometric objects will often intersect each other. To handle such cases, we propose a conflict-point handling scheme that creates conforming cells even at intersections. We also discuss how to generalize this method to 3D. Here, our method honors control-point alignment of cell centroids and boundary alignment of cell faces away from object intersections.", "num_citations": "17\n", "authors": ["891"]}
{"title": "Mixed multiscale methods for compressible flow\n", "abstract": " Multiscale methods are a robust and accurate alternative to traditional upscaling methods. Multiscale methods solve local problems to numerically construct a set of basis functions that later can be used to compute global solutions that describe the flow on both the coarse computational scale and the underlying fine parameter scale. This way, one is able to account for both effective coarse-scale properties and sub-scale variations. The methods are particularly efficient when the flow field must be updated repeatedly. Because temporal changes in the flow equations are moderate compared to the spatial variability, it is seldom necessary to recompute basis functions each time the global flow field is recomputed. Herein, we discuss and compare two ways of extending a multiscale mixed method that was originally developed for incompressible flow to compressible flow. The first approach is based upon a mixed …", "num_citations": "17\n", "authors": ["891"]}
{"title": "Discussion of dynamics and operator splitting techniques for two-phase flow with gravity\n", "abstract": " We study the dynamics of two-phase flow with gravity and point out three different transport mechanisms: non-cyclic advection, solenoidal advection, and gravity segregation. Each term has specific mathematical properties that can be exploited by specialized numerical methods. We argue that to develop effective operator splitting methods, one needs to understand the interplay between these three mechanisms for the problem at hand.", "num_citations": "17\n", "authors": ["891"]}
{"title": "On efficient implicit upwind schemes\n", "abstract": " Although many advanced methods have been devised for the hyperbolic transport problems that arise in reservoir simulation, the most widely used method in commercial simulators is still the implicit upwind scheme. The robustness, simplicity and stability of this scheme makes it preferable to more sophisticated schemes for real reservoir models with large variations in flow speed and porosity.However, the efficiency of the implicit upwind scheme depends on the ability to solve large systems of nonlinear equations effectively. To advance the solution one time-step, a large nonlinear system needs to be solved. This is a highly non-trivial matter and convergence is not guaranteed for any starting guess. This effectively imposes limitations on the practical magnitude of time-steps as well as on the number of grid blocks that can be handled.", "num_citations": "17\n", "authors": ["891"]}
{"title": "Automatic segmentation of overlapping fish using shape priors\n", "abstract": " We present results from a study where we segment fish in images captured within fish cages. The ultimate goal is to use this information to extract the weight distribution of the fish within the cages. Statistical shape knowledge is added to a Mumford-Shah functional defining the image energy. The fish shape is represented explicitly by a polygonal curve, and the energy minimization is done by gradient descent. The images represent many challenges with a highly cluttered background, inhomogeneous lighting and several overlapping objects. We obtain good segmentation results for silhouette-like images containing relatively few fish. In this case, the fish appear dark on a light background and the image energy is well behaved. In cases with more difficult lighting conditions the contours evolve slowly and often get trapped in local minima", "num_citations": "17\n", "authors": ["891"]}
{"title": "Fast solvers for flow in porous media based on discontinuous Galerkin methods and optimal reordering\n", "abstract": " We present a family of efficient solvers for hyperbolic transport equations modelling flow in porous media. The solvers are based on discontinuous Galerkin spatial discretisations and implicit temporal discretisation. By applying an optimal reordering algorithm, the corresponding discrete system of (non) linear equations can be solved in one grid-block at a time. This way, we avoid assembly of a full (non) linear system. Our approach allows us to handle large numbers of grid blocks with modest requirements on memory.", "num_citations": "17\n", "authors": ["891"]}
{"title": "Using simplified methods to explore the impact of parameter uncertainty on CO2 storage estimates with application to the Norwegian Continental Shelf\n", "abstract": " We use simplified methods to investigate how uncertainty in geological models affects practical CO2 storage capacities in large-scale saline aquifers. Our focus is on uncertainties in top-surface elevation, rock properties (porosity, permeability), fault transmissibility, and aquifer conditions (pressure and temperature). To quantify the statistical characteristics of static trapping capacity and dynamic estimates of plume migration, we create hundreds of possible realizations of the geomodel by applying Gaussian-type perturbations to the spatially correlated properties. Two different simplified methods are introduced to reduce the computational cost of simulating migration over thousands of years in all the model realizations, which each spans hundreds of kilometers. First, we use vertical-equilibrium (VE) modelling, which is orders of magnitude faster than solving the 3D flow equations. Second, we introduce a fast look …", "num_citations": "16\n", "authors": ["891"]}
{"title": "Discretization of flow diagnostics on stratigraphic and unstructured grids\n", "abstract": " Flow diagnostics tools yield quantitative information about the flow behaviour of a model, based on controlled numerical flow experiments. We consider a family of flow diagnostic measures that are constructed based on a single pressure solution and can be used to quickly establish flow patterns and well-allocation factors. This offers a means to rank, compare, and validate reservoir models, upscaling procedures, and production scenarios that is significantly less computationally expensive than full-featured multiphase flow simulations. All flow diagnostic measures considered herein are defined from time-of-flight and tracer partitions. From these basic quantities, one can compute many interesting diagnostics such as: tracer partitions, drainage and swept regions, well-pair connections, well allocation factors, flow-and-storage-capacity (F-Phi) diagrams, sweep efficiency, and Lorenz heterogeneity coefficients. Time-of …", "num_citations": "16\n", "authors": ["891"]}
{"title": "Multiscale methods for subsurface flow\n", "abstract": " Modelling of flow processes in the subsurface is important for many applications. In fact, subsurface flow phenomena cover some of the most important technological challenges of our time. To illustrate, we quote the UN's Human Development Report 2006:                    “There is a growing recognition that the world faces a water crisis that, left unchecked, will derail the progress towards the Millennium Development Goals and hold back human development. Some 1.4 billion people live in river basins in which water use exceeds recharge rates. The symptoms of overuse are disturbingly clear: rivers are drying up, groundwater tables are falling and water-based ecosystems are being rapidly degraded. Put bluntly, the world is running down one of its most precious natural resources and running up an unsustainable ecological debt that will be inherited by future generations.”                                               The road toward …", "num_citations": "16\n", "authors": ["891"]}
{"title": "Front tracking for one-dimensional quasilinear hyperbolic equations with variable coefficients\n", "abstract": " A new front tracking method is developed for the variable coefficient equation   . The method is a generalization of Dafermos' method for the constant coefficient case and is well-defined also for certain discontinuous velocity fields V. We give an explicit inequality stating the stability with respect to flux function, velocity field, and initial data. The numerical method is unconditionally stable and has linear convergence. It is well suited for numerical calculations, as is demonstrated in four examples.", "num_citations": "16\n", "authors": ["891"]}
{"title": "Validation of the multiscale mixed finite‐element method\n", "abstract": " Subsurface reservoirs generally have a complex description in terms of both geometry and geology. This poses a continuing challenge in modeling and simulation of petroleum reservoirs owing to variations of static and dynamic properties at different length scales. Multiscale methods constitute a promising approach that enables efficient simulation of geological models while retaining a level of detail in heterogeneity that would not be possible via conventional upscaling methods. Multiscale methods developed to solve coupled flow equations for reservoir simulation are based on a hierarchical strategy in which the pressure equation is solved on a coarsened grid and the transport equation is solved on the fine grid, and the two equations are treated as a decoupled system. In particular, the multiscale mixed finite‐element (MsMFE) method attempts to capture subgrid geological heterogeneity directly into the coarse …", "num_citations": "15\n", "authors": ["891"]}
{"title": "Grid adaptation for the Dirichlet–Neumann representation method and the multiscale mixed finite-element method\n", "abstract": " A Dirichlet–Neumann representation method was recently proposed for upscaling and simulating flow in reservoirs. The DNR method expresses coarse fluxes as linear functions of multiple pressure values along the boundary and at the center of each coarse block. The number of flux and pressure values at the boundary can be adjusted to improve the accuracy of simulation results and, in particular, to resolve important fine-scale details. Improvement over existing approaches is substantial especially for reservoirs that contain high-permeability streaks or channels. As an alternative, the multiscale mixed finite-element (MsMFE) method was designed to obtain fine-scale fluxes at the cost of solving a coarsened problem, but can also be used as upscaling methods that are flexible with respect to geometry and topology of the coarsened grid. Both methods can be expressed in mixed-hybrid form, with local …", "num_citations": "15\n", "authors": ["891"]}
{"title": "Numerical modeling of multiphase first-contact miscible flows. Part 1. Analytical Riemann solver\n", "abstract": " In this series of two papers, we present a front-tracking method for the numerical simulation of first-contact miscible gas injection processes. The method is developed for constructing very accurate (or even exact) solutions to one-dimensional initial-boundary-value problems in the form of a set of evolving discontinuities. The evolution of the discontinuities is given by analytical solutions to Riemann problems. In this paper, we present the mathematical model of the problem and the complete Riemann solver, that is, the analytical solution to the one-dimensional problem with piecewise constant initial data separated by a single discontinuity, for any left and right states. The Riemann solver presented here is the building block for the front-tracking/streamline method described and applied in the second paper.", "num_citations": "15\n", "authors": ["891"]}
{"title": "A front tracking method for conservation laws with boundary conditions\n", "abstract": " A front tracking method is used to construct weak solutions to scalar conservation laws with two kinds of boundary conditions — Dirichlet conditions and a novel zero flux (or no-flow) condition. The construction leads to an efficient numerical method. The main feature of the scheme is that there is no stability condition correlating the spatial and temporal discretization parameters. The analysis uses the traditional method of proving compactness via Helly’s theorem as well as the more modern concept of measure valued solutions. Three numerical examples are presented.", "num_citations": "15\n", "authors": ["891"]}
{"title": "A general non-uniform coarsening and upscaling framework for reduced-order modeling\n", "abstract": " This paper presents a general framework for constructing effective reduced-order models from an existing high-fidelity reservoir model, irrespective of grid topology. We employ a flexible hierarchical grid coarsening strategy that is designed to preserve geologic features and structures in the underlying model such as environments of deposition and faults. The strategy supports selecting and combining coarsening methods that are targeted to the flow patterns in different parts of the reservoir. This includes, but is not limited to, explicit user-imposed boundaries, using efficient field-wide flow indicators, topological and geometric partitioning and methods for amalgamating and splitting clusters of cells.", "num_citations": "14\n", "authors": ["891"]}
{"title": "The localized reduced basis multiscale method for two‐phase flows in porous media\n", "abstract": " In this work, we propose a novel model order reduction approach for two‐phase flow in porous media by introducing a global pressure formulation in which the total mobility, which realizes the coupling between saturation and pressure, is regarded as a parameter to the pressure equation. In our approach, the mobility itself is an optimal fit of mobility profiles that are precomputed using the time‐of‐flight for the initial saturation. Using this formulation and the localized reduced basis multiscale method, we obtain a low‐dimensional surrogate of the high‐dimensional pressure equation. By applying ideas from model order reduction for parametrized partial differential equations, we are able to split the computational effort for solving the pressure equation into a costly offline step that is performed only once and an inexpensive online step that is carried out in every time step of the two‐phase flow simulation, which is …", "num_citations": "14\n", "authors": ["891"]}
{"title": "Generalized travel-time inversion on unstructured grids\n", "abstract": " We propose an extension to unstructured grids for the so-called generalized travel-time inversion method for inversion of production data. The framework of the inversion method applies directly to fully unstructured grids, but there are aspects regarding sensitivities and regularization that have to be addressed. First, we propose a generalized smoothing operator for the regularization to impose smooth modification on reservoir parameters. Second, to handle reservoir models with great heterogeneity in cell sizes, we investigate the use of rescaled sensitivities (average cell volume multiplied by local sensitivity density) in the inversion.We demonstrate the utility of our extensions on three synthetic cases in 2-D. First, we validate the inversion method by applying it to a reservoir model represented both on a Cartesian and on a refined triangular grid. Second, we apply the method for a highly unstructured grid with large …", "num_citations": "14\n", "authors": ["891"]}
{"title": "Application of Flow Diagnostics and Multiscale Methods for Reservoir Management\n", "abstract": " Reservoir simulation workflows contain significant elements of uncertainty, particularly in the geological description of reservoir geometry and petrophysical parameters such as permeability and porosity. To accurately account for uncertainty and span the range of likely outcomes, different equiprobable realizations should be kept as long as possible throughout a modelling workflow. However, working with multiple realizations of the same reservoir for optimization purposes may quickly become prohibitively expensive, particularly since using a full forward simulation can be quite demanding even for a single model realization. Herein, we propose to combine two recent and quite different technologies to enable optimization of multiple realizations. The first is the use of multiscale technology, wherein approximate, but well-behaved pressure solutions can be efficiently computed using precomputed basis functions that …", "num_citations": "13\n", "authors": ["891"]}
{"title": "Front Tracking Methods for Use in Streamline Simulation of Compressible Flow\n", "abstract": " Streamline methods are gaining popularity in the industry by providing fast desktop simulation of large reservoir models or multiple realizations. Traditionally, streamline simulation has been associated with simplified physics. but recent advances have demonstrated its potential also for compressible three-phase or component flaws. However, streamline simulation is still most efficient for two-phase incompressible flow, for which one can utilize a particularly efficient front-tracking method to solve 1-D transport equations along streamlines that is unconditionally stable and independent of the strongly irregular time-of-flight grid. In a recent paper (Nilson and Lie 2008), we presented, for the first time, front-tracking methods for simulating 1-D compressible two-phase flow. We also developed two methods that were particularly efficient for solving compressible flow in which one phase is incompressible, motivated by the …", "num_citations": "13\n", "authors": ["891"]}
{"title": "Efficient flow diagnostics proxies for polymer flooding\n", "abstract": " Flow diagnostics refers to a family of numerical methods that within a few seconds can compute visually intuitive quantities illuminating flow patterns and well connections for full 3D reservoir models. The starting point is a flow field, extracted from a previous multiphase simulation or computed by solving a simplified pressure equation with fixed mobilities. Time-of-flight (TOF) and stationary tracer equations are then solved to determine approximate time lines and influence regions. From these, one can derive sweep or drainage regions, injector–producer regions, and well allocation factors, as well as dynamic heterogeneity measures that characterize sweep and displacement efficiency and correlate (surprisingly) well with oil recovery from waterflooding processes. This work extends flow diagnostics to polymer flooding. Our aim is to develop inexpensive flow proxies that can be used to optimize well …", "num_citations": "12\n", "authors": ["891"]}
{"title": "Use of Multiple Multiscale Operators To Accelerate Simulation of Complex Geomodels\n", "abstract": " Multiscale methods have been developed as a robust alternative to upscaling and to accelerate reservoir simulation. In their basic setup, multiscale methods use both a restriction operator to construct a reduced system of flow equations that can be solved on a coarser grid and a prolongation operator to map pressure unknowns from the coarse grid back to the original simulation grid. When combined with a local smoother, this gives an iterative solver that can efficiently compute approximate pressures to within a prescribed accuracy and still provide mass-conservative fluxes. We present an adaptive and flexible framework for combining multiple sets of such multiscale approximations. Each multiscale approximation can target a certain scale; geological features such as faults, fractures, facies, or other geobodies; or a particular computational challenge such as propagating displacement and chemical fronts, wells …", "num_citations": "12\n", "authors": ["891"]}
{"title": "Flow-based grid coarsening for transport simulations\n", "abstract": " Geological models are becoming increasingly large and detailed to account for heterogeneous structures on different spatial scales. To obtain computationally tractable simulation models, it is common to remove spatial detail by upscaling. Pressure and transport equations are different in nature and generally require different strategies for optimal upgridding. To optimize accuracy of a transport calculation, the coarsened grid should be constructed based on a posteriori error estimates and adapt to the flow patterns predicted by the pressure equation. Sharp and rigorous estimates are generally hard to obtain; herein we consider various adhoc methods for generating flow-adapted grids. Common for all, is that they start by solving a single-phase flow problem once and continue by agglomerating cells from an underlying fine-scale grid. We present several variations of the original method. First, we discuss how to …", "num_citations": "12\n", "authors": ["891"]}
{"title": "Robust Nonlinear Newton Solver With Adaptive Interface-Localized Trust Regions\n", "abstract": " The interplay of multiphase-flow effects and pressure/volume/temperature behavior encountered in reservoir simulations often provides strongly coupled nonlinear systems that are challenging to solve numerically. In a sequentially implicit method, many of the essential nonlinearities are associated with the transport equation, and convergence failure for the Newton solver is often caused by steps that pass inflection points and discontinuities in the fractional-flow functions. The industry-standard approach is to heuristically chop timesteps and/or dampen updates suggested by the Newton solver if these exceed a predefined limit. Alternatively, one can use trust regions (TRs) to determine safe updates that stay within regions that have the same curvature for numerical flux. This approach has previously been shown to give unconditional convergence for polymer-and waterflooding problems, also when property curves …", "num_citations": "11\n", "authors": ["891"]}
{"title": "Unstructured Voronoi grids conforming to lower dimensional objects\n", "abstract": " We present a novel mixed-dimensional method for generating unstructured polyhedral grids that conform to prescribed geometric objects in arbitrary dimensions. Two types of conformity are introduced: (i) control-point alignment of cell centroids to accurately represent horizontal and multilateral wells or create volumetric representations of fracture networks, and ii) boundary alignment of cell faces to accurately preserve lower dimensional geological objects such as layers, fractures, faults, and/or pinchouts. The prescribed objects are in this case assumed to be lower dimensional, and we create a grid hierarchy in which each lower dimensional object is associated with a lower dimensional grid. Further, the intersection of two objects is associated with a grid one dimension lower than the objects. Each grid is generated as a clipped Voronoi diagram, also called a perpendicular bisector (PEBI) grid, for a …", "num_citations": "11\n", "authors": ["891"]}
{"title": "Impact of geological heterogeneity on early-stage CO2 plume migration: sensitivity study\n", "abstract": " Academic studies of CO2 injection frequently employ simplified or conceptualized reservoir descriptions in which the medium is considered nearly homogeneous. However, geological knowledge and experience from petroleum production show that the petrophysical characteristics of potential CO2 sequestration sites can be expected to be heterogeneous on the relevant physical scales, regardless of whether the target formation is an abandoned petroleum reservoir or a pristine aquifer. Geological uncertainty introduces tortuous subsurface flow paths, which in turn influence reservoir behaviour during injection. It is paramount that the effect of the geological heterogeneity is quantified by the research community. This will facilitate both improved understanding of subsurface flow at operational CO2 injection sites, and allow comparison with simulated flow in ideal homogeneous models and upscaled versions of these.Within oil recovery, the impact of geological uncertainty on production forecast has been thoroughly investigated in the SAIGUP project [3, 4, 5] focusing on shallow-marine reservoirs. To study different factors, synthetic realistic models were made and several thousand cases were run for different production scenarios. The results showed that realistic heterogeneity in the structural and sedimentological description had a strong influence on the production responses.", "num_citations": "11\n", "authors": ["891"]}
{"title": "Multiscale finite-element methods for elliptic problems in porous media flow\n", "abstract": " We review two multiscale finite-element methods, the mixed multiscale finite-element method [Chen and Hou, 2002; Aarnes, 2004] and the numerical subgrid upscaling method [Arbogast et al., 1998; Arbogast, 2000, 2002], and demonstrate some of their shortcomings. We then show that combining ideas from both methods yields a new approach that is less likely to suffer from the shortcomings of the original methods. The performance of the new approach is demonstrated by a few numerical experiments.", "num_citations": "10\n", "authors": ["891"]}
{"title": "Dynamic coarsening and local reordered nonlinear solvers for simulating transport in porous media\n", "abstract": " We present a robust and flexible sequential solution approach in which the flow equation is solved on the original grid, whereas the transport equations are solved with a new dynamic coarsening method that adapts the grid resolution locally to reduce the number of cells as much as possible. The resulting grid is formed by combining precomputed coarse partitions of an underlying fine model. Our approach is flexible and makes very few assumptions on cell geometries and the topology of the grid. To further accelerate the transport step, we combine dynamic coarsening with a local nonlinear solver that permutes the discrete transport equations into an optimal block‐triangular form so that these can be solved very efficiently using a nonlinear back‐substitution method. Efficiency and utility of the overall approach are assessed through a number of conceptual test cases, including the Olympus field model.", "num_citations": "9\n", "authors": ["891"]}
{"title": "A fully implicit WENO scheme on stratigraphic and unstructured polyhedral grids\n", "abstract": " Many authors have used higher-order spatial discretizations to reduce numerical diffusion, which can be particularly pronounced when simulating EOR processes involving active chemical substances that are transported by linear or weakly nonlinear waves. Most high-resolution methods reported in the literature are based on explicit temporal discretizations. This imposes severe time-step restrictions when applied to the type of grids seen in industry-standard simulation models of real assets, which usually have orders-of-magnitude variations in porosities and Darcy velocities that necessitate the use of implicit discretization. Herein, we propose a second-order WENO discretization suitable for complex grids with polyhedral cell geometries, unstructured topologies, large aspect ratios, and large variations in interface areas. The WENO scheme is developed as part of a standard, fully implicit formulation that …", "num_citations": "9\n", "authors": ["891"]}
{"title": "Accelerating multiscale simulation of complex geomodels by use of dynamically adapted basis functions\n", "abstract": " A number of different multiscale methods have been developed as a robust alternative to upscaling and as a means for accelerated reservoir simulation of high-resolution geomodels. In their basic setup, multiscale methods use a restriction operator to construct a reduced system of flow equations on a coarser grid, and a prolongation operator to map pressure unknowns from the coarse grid back to the original simulation grid. The prolongation operator consists of basis functions computed numerically by solving localized flow problems. One can use the resulting multiscale solver both as a CPR preconditioner in fully implicit simulators or as an efficient approximate iterative linear solver in a sequential setting. The latter approach has been successfully implemented in a commercial simulator. Recently, we have shown that you can obtain significantly faster convergence if you instead of using a single pair of …", "num_citations": "9\n", "authors": ["891"]}
{"title": "A feature-enriched multiscale method for simulating complex geomodels\n", "abstract": " Multiscale methods have been shown to offer an order-of-magnitude increase in the speed of reservoir simulators. This may enable users to model complex fluid flow and geology with greater speed and flexibility than is available with the current computational technologies. Contemporary multiscale methods typically use a restriction operator to construct a reduced system of flow equations and a prolongation operator to map pressure unknowns from the reduced flow equations back to the original simulation grid. When combined with a local smoother, this gives an iterative solver that can efficiently compute approximate pressures to within a prescribed accuracy and still provide mass-conservative fluxes. We present an adaptive and flexible framework for combining multiple sets of such multiscale approximations. Each multiscale approximation can target a certain scale; geological features like faults, fractures …", "num_citations": "9\n", "authors": ["891"]}
{"title": "On obtaining optimal well rates and placement for CO2 storage\n", "abstract": " Large-scale storage of CO2 in saline aquifers is considered an essential technology to mitigate CO2 emissions. Storage potential has mainly been estimated based on volumetrics or detailed simulations for specific injection scenarios. In practice, achievable storage capacity will depend on engineering, economical, and political restrictions and be limited by the length of the injection period, costs associated with potential CO2 leakage, pressure management, etc. We show how achievable storage volumes can be estimated and maximized using adjoint-based optimization and a hierarchy of simulation methods. In particular, vertical equilibrium models provide the simplest possible description of the flow dynamics during the injection and early post-injection period, while percolation type methods provide effective means for forecasting the long-term fate of CO2 during the later migration stages. We investigate the …", "num_citations": "9\n", "authors": ["891"]}
{"title": "Grid Adaption for Upscaling and Multiscale Methods\n", "abstract": " A Dirichlet–Neumann representation method (DNR) was recently proposed for upscaling and simulating flow in reservoirs. The DNR method expresses coarse fluxes as linear functions of multiple discrete pressure values along the boundary and at the center of each coarse block. The number of coarse fluxes and pressure values at the boundary can be adjusted to improve the accuracy of simulation results, and in particular to resolve important fine-scale details. Improvement over existing approaches is substantial especially for reservoirs that contain high permeability streaks or channels. Recent multiscale methods provide an efficient means to obtain fine-scale fluxes or pressures at the cost of solving a coarsened problem. However, these methods can also be utilized as upscaling methods that are flexible with respect to geometry and topology of the coarsened grid. In this work, we compare the multiscale mixed finite element (MsMFE) method and the DNR approach for accurate upscaling. Both methods can be expressed in mixed form, with local stiffness matrices obtained as inner products of numerically computed basis functions with fine-scale sub-resolution. These basis functions are determined by solving local flow problems with piecewise linear Dirichlet boundary conditions for the DNR method and piecewise constant Neumann conditions for MsMFE. Adding discrete pressure points in the DNR method corresponds to subdividing coarse faces and hence increasing the number of basis functions in the MsMFE method. The methods show similar accuracy for 2D Cartesian cases, but the MsMFE method is more straightforward to formulate …", "num_citations": "9\n", "authors": ["891"]}
{"title": "A discontinuous Galerkin method for computing time-of-flight in discrete-fracture models\n", "abstract": " Discrete fracture models, in which fractures are represented individually as lowerdimensional objects, are beginning to appear in simulators for porous media flow. Here we present a discontinuous Galerkin method for computing time-of-flight in discrete-fracture models of fracture-fault systems. Isocontours of time-of-flight are time-lines of porousmedia flow and give information about flow patterns, in particular for single-phase flow. Recent numerical results show that the discontinuous Galerkin (dG) method is efficient and accurate for solving the time-of-flight equation. In this paper, we use two simplified grid models to examine various approaches for the dG discretisation in fractured regions of the porous medium. Comparing the numerical results of the dG approximation with those from a streamline simulator, we demonstrate the importance of a sufficient grid resolution across the fractures, even though the widths of the fractures are very small compared to typical length scales of the unfractured parts of the reservoir.", "num_citations": "9\n", "authors": ["891"]}
{"title": "Multiscale Method for Simulating Two-and Three-Phase Flow in Porous Media\n", "abstract": " Multiscale methods developed to solve coupled flow equations for reservoir simulation are based on a hierarchical strategy in which the pressure equation is solved on a coarsened grid and transport equation is solved on the fine grid as a decoupled system. The multiscale mixed finite-element (MsMFE) method attempts to capture sub-grid geological heterogeneity directly into the coarse-scale via mathematical basis functions. These basis functions are able to capture important multiscale information and are coupled through a global formulation to provide good approximation of the subsurface flow solution.", "num_citations": "8\n", "authors": ["891"]}
{"title": "Multiscale methods for two and three-phase flow simulation in subsurface petroleum reservoirs\n", "abstract": " Multiscale simulation is a new and promising approach that enables simulation of detailed geological model and the retention of level of detail and heterogeneity that would not be possible via conventional upscaling methods. Most multiscale methods are developed from a sequential formulation, in which flow (pressure-flux) and transport (saturation) equations are solved in separate steps. The flow equation is solved using a set of special multiscale basis functions that attempt to incorporate the effects of sub-grid geological heterogeneity into a global flow equation formulated on a coarsened grid. The multiscale basis functions are computed numerically by solving local flow problems, and can be used to construct conservative fluxes on the coarsened as well as the original fine grid. Herein, we consider one particular multiscale method, the multiscale mixed finite-element method, and discuss how it can be …", "num_citations": "8\n", "authors": ["891"]}
{"title": "Impact of geological heterogeneity on early-stage CO2 plume migration\n", "abstract": " Injection of CO2 into saline aquifers can be divided in two phases: injection and plume migration over long time scales. Large-scale injection operations should be preceded by simulation studies to determine how to maximize the injection volume/rate and minimize the leakage risk. Simulation of CO2 storage differs from oil recovery prediction not only in the objectives of study, but also in the characteristic length and time scales of the process. Working with long temporal and spatial scales and large uncertainties poses the question of how detailed the geological description should be. The impact of geological uncertainty on the oil production forecast has been thoroughly investigated in the SAIGUP study, where an extensive set of synthetic but realistic models of shallow-marine reservoirs were made. Tens of thousands of simulations were run for different production scenarios, demonstrating that variations in the …", "num_citations": "8\n", "authors": ["891"]}
{"title": "A front-tracking method for hyperbolic three-phase models\n", "abstract": " We develop and apply a front-tracking method for the numerical simulation of three-phase flow in porous media. The proposed framework combines analytical solutions to the corresponding Riemann problem with an efficient front-tracking method to study Cauchy and initial-boundary value problems. The method has the ability to track individual waves and give very accurate (or even exact) resolution of discontinuities. This numerical procedure is then used in combination with a streamline method, for the simulation of three-dimensional, three-phase flow problems. We demonstrate the applicability of the method through several numerical examples, including a streamline simulation of a water-alternating-gas (WAG) injection process in a three-dimensional, heterogeneous, shallow-marine formation.", "num_citations": "8\n", "authors": ["891"]}
{"title": "Efficient reordered nonlinear Gauss–Seidel solvers with higher order for black-oil models\n", "abstract": " The fully implicit method is the most commonly used approach to solve black-oil problems in reservoir simulation. The method requires repeated linearization of large nonlinear systems and produces ill-conditioned linear systems. We present a strategy to reduce computational time that relies on two key ideas: (i) a sequential formulation that decouples flow and transport into separate subproblems, and (ii) a highly efficient Gauss–Seidel solver for the transport problems. This solver uses intercell fluxes to reorder the grid cells according to their upstream neighbors, and groups cells that are mutually dependent because of counter-current flow into local clusters. The cells and local clusters can then be solved in sequence, starting from the inflow and moving gradually downstream, since each new cell or local cluster will only depend on upstream neighbors that have already been computed. Altogether, this gives …", "num_citations": "7\n", "authors": ["891"]}
{"title": "An implicit local time-stepping method based on cell reordering for multiphase flow in porous media\n", "abstract": " We discuss how to introduce local time-step refinements in a sequential implicit method for multiphase flow in porous media. Our approach relies heavily on causality-based optimal ordering, which implies that cells can be ordered according to total fluxes after the pressure field has been computed, leaving the transport problem as a sequence of ordinary differential equations, which can be solved cell-by-cell or block-by-block. The method is suitable for arbitrary local time steps and grids, is mass-conservative, and reduces to the standard implicit upwind finite-volume method in the case of equal time steps in adjacent cells. The method is validated by a series of numerical simulations. We discuss various strategies for selecting local time steps and demonstrate the efficiency of the method and several of these strategies by through a series of numerical examples.", "num_citations": "7\n", "authors": ["891"]}
{"title": "Validation of a non-uniform coarsening and upscaling framework\n", "abstract": " We present a novel framework for generating reduced-order models that combines agglomeration of cells from existing high-fidelity reservoir models and flow-based upscaling. The framework employs a hierarchical grid-coarsening strategy that enables accurate preservation of geological structures from the underlying model. One can also use flow information to distinguish regions of high or low flow, and use this division, or other geological or user-defined quantities, to select and adapt the model resolution differently throughout the reservoir. Altogether, the framework provides a wide variety of coarsening strategies that allow the user to adapt the reduced model to important geology and explore and identify the features that most impact flow patterns and well communication. By preserving these features, while aggressively coarsening others, the user can develop reduced models that closely match an underlying …", "num_citations": "7\n", "authors": ["891"]}
{"title": "Fast sequential implicit porous media flow simulations using multiscale finite elements and reordering of cells for solution of nonlinear transport equation\n", "abstract": " It is demonstrated previously in the literature that multiscale methods can used to provide accurate highresolution velocity fields at a low computational cost. However, to achieve enhanced accuracy in flow simulations compared with a standard approach, the multiscale method must be accompanied by a transport solver that can account for the fine-scale structures of the velocity fields. In this paper, we use the standard implicit single-point upwind (SPU) finite-volume method for computing transport. This method requires that a nonlinear system is solved at each time-step. However, if we assume (as in streamline methods) that capillary forces can be disregarded and that gravity can be treated by operator splitting, and reordering the cells in an optimal way, the nonlinear systems in each implicit advective step can be solved on a cell-by-cell (or block-by-block) basis. This approach makes the standard SPU method at …", "num_citations": "7\n", "authors": ["891"]}
{"title": "Additive Schwarz Preconditioned Exact Newton Method as a Nonlinear Preconditioner for Multiphase Porous Media Flow\n", "abstract": " Domain decomposition methods as preconditioners for Krylov methods are widely used for linear problems. There have been recently a growing interest into nonlinear preconditioning methods for Newton’s method applied to porous media flow. In this work, we study a spatial Additive Schwarz Preconditioned Exact Newton (ASPEN) method as a nonlinear preconditioner to the Newton’s method with fully implicit scheme in the context of immiscible and compositional multiphase flow. We first describe the method and how it can be implemented in a reservoir simulation package. We then study the nonlinearities addressed by the different components of the method. We observe that the local fully implicit updates are tackling well all the local nonlinearities and that the global ASPEN updates are tackling well the long range interactions. The combination of the two updates leads to a very competitive algorithm. We …", "num_citations": "6\n", "authors": ["891"]}
{"title": "Data-Driven Models Based on Flow Diagnostics\n", "abstract": " Data-driven models are an attractive alternative to reservoir simulation in workflows where full field-scale simulations may be computationally prohibitive [3,4]. One example is the forecasting and schedule optimization of waterflooding scenarios, where numerous function evaluations that correspond to a time consuming simulation may be required. Data-driven models must be calibrated to produce a satisfactory forecast, similar to the history matching of conventional simulation models. However, a lot of data is needed to produce a model capable of giving accurate forecasts for the flow distribution between the injectors and producers. Mature fields may have sufficient data to calibrate a purely data-driven model, but fields with limited historical data available require a different approach that can compensate for the lack of data. Herein, under the assumption that a detailed reservoir simulation model exists, we use flow …", "num_citations": "6\n", "authors": ["891"]}
{"title": "Flow diagnostics for optimal polymer injection strategies\n", "abstract": " This work extends the applicability of a class of flow-diagnostic computational tools for interactive visualization and fast simulation approximations to also account for polymer mobility effects. Flow diagnostics, as used here, employ simplifications to the reservoir flow equations to enable computation of quantitative (and detailed) information about the flow behavior of full 3D reservoir models within a few seconds. Previously, we have utilized a linearized pressure equation and a corresponding set of time-of-flight (TOF) and stationary tracer equations to compute dynamic heterogeneity measures that correlate well with oil recovery for waterflooding scenarios. To also approximate the macroscopic effect of EOR injection strategies, we suggest an implicit approach for flow diagnostics in which polymer mobility effects are included approximately in the flow equation by linearizing the flux functions. Although this …", "num_citations": "6\n", "authors": ["891"]}
{"title": "An open-source toolchain for simulation and optimization of aquifer-wide CO2 storage\n", "abstract": " Planning and execution of large-scale, aquifer-wide CO2 storage operations will require extensive use of computer modelling and simulations. The required computational tools will vary depending on the physical characteristics of the targeted aquifer, the stage of the project, and the questions asked, which may not always be anticipated in advance. In this paper, we argue that a one-size-fits-all simulation tool for the modelling CO2 storage does not exist. Instead, we propose an integrated toolchain of computational methods that can be used in a flexible way to set up adaptive workflows. Although a complete toolchain will require computational methods at all levels of complexity, we further argue that lightweight methods play a particularly important role in addressing many of the relevant questions. We have implemented a number of such simplified methods in MRST-co2lab, a separate module to the open-source …", "num_citations": "6\n", "authors": ["891"]}
{"title": "Steady state upscaling of polymer flooding\n", "abstract": " Upscaling of parameters involved in single and two-phase flow has been researched quite extensively, and several methods for performing upscaling are known and understood. Less work has been done related to upscaling of enhanced oil recovery simulations. This is what we investigate, and in particular, we consider upscaling of parameters related to polymer flooding, which is the process in which large polymer molecules are added to the injected water to enhance its ability to push hydrocarbons through the reservoir. Herein, the polymer flooding process is described as a two-phase, immiscible system that in addition to a Todd-Longstaff mixing model includes permeability reduction, polymer adsorption, and dead pore space. Effective parameters are computed by running simulations until a steady-state is reached and then performing upscaling based on the fluxes. This method is used by a major oil company …", "num_citations": "6\n", "authors": ["891"]}
{"title": "Streamline-based History Matching: A Review\n", "abstract": " In recent years, several methods for streamline-based history matching have been developed. These methods have proved to be efficient for three reasons: First, streamlines delineate flow patterns and can therefore be used to define reduced inverse models. Second, streamline methods provide fast forward simulation. Third, streamline-based sensitivities can be evaluated directly based on one flow simulation for different reservoir responses.  We here give a literature review of streamline-based sensitivities and streamline methods used for history matching. Oppdragsgiver: SINTEF", "num_citations": "6\n", "authors": ["891"]}
{"title": "A multiscale streamline method for inversion of production data\n", "abstract": " We propose two improvements to a recent streamline method by Wang and Kovscek for inversion of production data. The key idea of the Wang–Kovseck method is to associate increments in fractional flow curves (water-cut) with breakthrough of individual streamlines and match breakthrough times of each streamline by adjusting the effective streamline permeabilities. The perturbations in effective streamline permeabilities are given by a linear system, which can be solved in a decoupled fashion under additional simplifying assumptions. Finally, the permeability perturbations defined along streamlines are mapped onto the underlying simulation grid, typically using a geostatistical algorithm to constrain the corresponding corrections to the geological model to prior geological data.Our first improvement is to model the flow in each streamline independently using real time, instead of using Dykstra–Parsons' algorithm …", "num_citations": "6\n", "authors": ["891"]}
{"title": "High resolution nonoscillatory central difference schemes for the 2D Euler equations via artificial compression\n", "abstract": " We suggest to augment second-order, nonoscillatory, central difference schemes with Harten’s artificial compression method (ACM) to sharpen the resolution of linear fields. ACM employs a partial characteristic decomposition to single out the linear fields, for which a steeper reconstruction is applied. The remarkable power of this technique is demonstrated for three test problems for the Euler equations from gas dynamics, and its dangers are pointed out.", "num_citations": "6\n", "authors": ["891"]}
{"title": "Front tracking and operator splitting for convection dominated problems\n", "abstract": " This is my thesis for the degree of Doktor Ingeni r (dr. ing.) at the Department of Mathematical Sciences, Norwegian University of Science and Technology, Trondheim, Norway. The research was funded through a scholarship from the Research Council of Norway (grant no. 100555/410).First of all, I want to thank my supervisor Helge Holden at the Department of Mathematical Sciences for his guidance and excellent support. Second, I am deeply indebted to my collaborators Steinar Evje, Vidar Haugse, Kenneth Hvistendahl Karlsen, and Nils Henrik Risebro and to Jan Olav Langseth for many enlightening discussions. In particular, Kenneth and I have cooperated closely, with almost daily telephone conversations and frequent visits. I hope that our friendship and fruitful collaboration also will continue in the future.", "num_citations": "6\n", "authors": ["891"]}
{"title": "Comparison between algebraic multigrid and multilevel multiscale methods for reservoir simulation\n", "abstract": " Multiscale methods for solving strongly heterogenous systems in reservoirs have a long history from the early ideas used on incompressible flow to the newly released version in commercial simulation. Much effort has been put into making the MsFV method work for fully unstructured multiphase problems. The MsRSB version is a newly developed version, which tackles most of the \"real\" world problems. It is to our knowledge, the only multiscale method that has been released in a commercial simulator. You can alternatively see the method as a variant of smoothed aggregation or as an iterative approach to AMG with energy minimizing basis functions. This will be discussed in detail. So far, most work on comparing MsRSB with AMG methods has been on qualitative performance measures like iteration number rather than on pure runtime on fair code implementation. We discuss the theoretical performance and …", "num_citations": "5\n", "authors": ["891"]}
{"title": "A Study on How Top-Surface Morphology Influences the Storage Capacity of CO 2 in Saline Aquifers\n", "abstract": " The primary trapping mechanism in CO2 storage is structural trapping, which means accumulation of a CO2 column under a deformation in the caprock. We present a study on how different top-seal morphologies will influence the CO2 storage capacity and migration patterns. Alternative top-surface morphologies are created stochastically by combining different stratigraphic scenarios with different structural scenarios. Stratigraphic surfaces are generated by Gaussian random fields, while faults are generated by marked point processes. The storage capacity is calculated by a simple and fast spill-point analysis, and by a more extensive method including fluid flow simulation in which parameters such as pressure and injection rate are taken into account. Results from the two approaches are compared. Moreover, by generating multiple realizations, we quantify how uncertainty in the top-surface morphology …", "num_citations": "5\n", "authors": ["891"]}
{"title": "Flow diagnostics for model ensembles\n", "abstract": " Ensembles of geomodels provide an opportunity to investigate the range of parameters and possible operational outcomes for a reservoir of interest. Full-featured dynamic modelling of all ensemble members is often computationally unfeasible, however some form of dynamic modelling, allowing us to discriminate between ensemble members based on their flow characteristics, is required. Flow diagnostics involve simplified analysis of steady flow scenarios, single-phase or multiphase, and can be run in a much shorter time than a full dynamic multiphase simulation. Fundamental quantities calculated for flow diagnostics include travel times, volumetric partitions, inter-well communications, and measures of dynamic heterogeneity. Heterogeneity measures like the dynamic Lorenz coefficient and sweep efficiency can be used as proxies for oil recovery in order to rank models. More advanced flow diagnostic …", "num_citations": "4\n", "authors": ["891"]}
{"title": "A comparison of consistent discretizations for elliptic problems on polyhedral grids\n", "abstract": " In this work, we review a set of consistent discretizations for second-order elliptic equations, and compare and contrast them with respect to accuracy, monotonicity, and factors affecting their computational cost (degrees of freedom, sparsity, and condition numbers). Our comparisons include the linear and nonlinear TPFA method, multipoint flux-approximation (MPFA-O), mimetic methods, and virtual element methods. We focus on incompressible flow and study the effects of deformed cell geometries and anisotropic permeability.", "num_citations": "4\n", "authors": ["891"]}
{"title": "Adaptive multiscale multi-fidelity reservoir simulation\n", "abstract": " Computer-implemented systems and methods for modeling behavior of at least one fluid in a reservoir are disclosed. The techniques can include obtaining measurements of physical parameters, including pressure, at locations within the reservoir, and discretizing, based on a three-dimensional fine grid, a system of partial differential mass balance equations that model, based on the measurements, at least the physical parameters at the locations within the reservoir, such that a system of nonlinear equations is produced. The techniques can include iterating from a current time step to a next time step, such that a solution to the system of nonlinear equations for a time interval that includes the current time step and the next time step is produced. The iterating can include an adaptive multi-fidelity multiscale technique that employs multiple restriction operators, prolongation operators, and coarse grids, to model various …", "num_citations": "4\n", "authors": ["891"]}
{"title": "Implicit high-resolution compositional simulation with optimal ordering of unknowns and adaptive spatial refinement\n", "abstract": " High-resolution discretizations can be advantageous in compositional simulation to reduce excessive numerical diffusion that tends to mask shocks and fingering effects. In this work, we outline a fully implicit, dynamic, multilevel, high-resolution simulator for compositional problems on unstructured polyhedral grids. We rely on four ingredients:(i) sequential splitting of the full problem into a pressure and a transport problem,(ii) ordering of grid cells based on intercell fluxes to localize the nonlinear transport solves,(iii) higher-order discontinuous Galerkin (dG) spatial discretization with order adaptivity for the component transport, and (iv) a dynamic coarsening and refinement procedure. For purely cocurrent flow, and in the absence of capillary forces, the nonlinear transport system can be perturbed to a lower block-triangular form. With counter-current flow caused by gravity or capillary forces, the nonlinear system of …", "num_citations": "4\n", "authors": ["891"]}
{"title": "Full approximation scheme for reservoir simulation\n", "abstract": " Simulation of multiphase flow and transport in porous rock formations give rise to large systems of strongly coupled nonlinear equations. Solving these equations is computationally challenging because of orders of magnitude local variations in parameters, mixed hyperbolic-elliptic governing equations, grids with high aspect ratios and strong coupling between local and global flow effects.", "num_citations": "4\n", "authors": ["891"]}
{"title": "Categorization of Norwegian Continental Shelf formations in terms of geological CO2 storage potentials\n", "abstract": " In the present study, we use data published alongside the Norwegian Petroleum Directorate (NPD) storage atlases to further investigate the storage capacity of 23 formations found in the Norwegian Continental Shelf. Our goal is to categorize the formations according to the main limiting factors for long-term geologic storage of CO2. We conduct the study by defining reasonable injection scenarios and running simulations on grids constructed from the NPD data, which also include the associated averaged rock properties. The use of vertical-equilibrium models allows us to rapidly run a large number of long-term simulations of injection and migration scenarios. The ability to run rapid simulations allows us to optimize injection rates using an adjoint-based nonlinear optimization algorithm. For a given number of wells and set of boundary conditions, we aim to optimize the amount of CO2 injected, subject to limits on …", "num_citations": "4\n", "authors": ["891"]}
{"title": "An Unconditionally Stable Splitting Method Using Reordering for Simulating Polymer Injection\n", "abstract": " We present an unconditionally stable algorithm for sequential solution of flow and transport that can be used for efficient simulation of polymer injection modeled as a two-phase system with rock compressibility and equal fluid compressibilities. Our formulation gives a set of nonlinear transport equations that can be discretized with standard implicit upwind methods to conserve mass and volume independent of the time step. The resulting nonlinear system of discrete transport equations can, in the absence of gravity and capillary forces, be permute to lower triangular form by using a simple topological sorting method from graph theory. This gives a nonlinear Gauss–Seidel method that computes the solution cell by cell with local iteration control. The single-cell systems can be reduced to a nested set of scalar nonlinear equations that can easily be bracketed and solved with standard gradient or root-bracketing methods. The resulting method gives orders-of-magnitude reduction in runtimes and increases the feasible time-step sizes. Hence, sequential splitting combined with standard upwind discretizations can become a viable alternative to streamline methods for speeding up simulation of advection-dominated systems.", "num_citations": "4\n", "authors": ["891"]}
{"title": "Advanced modelling with the MATLAB reservoir simulation toolbox\n", "abstract": " Many leading experts contribute to this follow-up to An Introduction to Reservoir Simulation using MATLAB/GNU Octave: User Guide for the MATLAB Reservoir Simulation Toolbox (MRST). It introduces more advanced functionality that has been recently added to the open-source MRST software. It is however a self-contained introduction to a variety of modern numerical methods for simulating multiphase flow in porous media, with applications to geothermal energy, chemical enhanced oil recovery (EOR), flow in fractured and unconventional reservoirs, and in the unsaturated zone. The reader will learn how to implement new models and algorithms in a robust, efficient manner. A large number of numerical examples are included, all fully equipped with code and data so that the reader can reproduce the results and use them as a starting point for their own work. Like the original textbook, this book will prove invaluable for researchers, professionals and advanced students using reservoir simulation methods.", "num_citations": "3\n", "authors": ["891"]}
{"title": "Nonlinear gauss-seidel solvers with higher order for black-oil models\n", "abstract": " The fully implicit method is the most commonly used approach to solve black-oil problems in reservoir simulation. The method requires repeated linearization of large nonlinear systems and produces ill-conditioned linear systems. We present a strategy to reduce computational time that relies on two key ideas: i) a sequential formulation that decouples flow and transport into separate subproblems, and ii) a highly efficient Gauss-Seidel solver for the transport problems. This solver uses intercell fluxes to find all cells that only depend on their upstream neighbors and groups all remaining cells into local clusters of cells that are mutually dependent because of counter-current flow. The single cells and local clusters can then be sorted and solved in sequence, starting from the inflow and moving gradually downstream, since each new cell or local cluster will only depend on upstream neighbors that have already been …", "num_citations": "3\n", "authors": ["891"]}
{"title": "Ranking and categorizing large-scale saline aquifer formations based on optimized CO2 storage potentials and economic factors\n", "abstract": " The process of selecting a CO2 storage site involves evaluating many potentially suitable sites in terms of their storage potentials as well as their associated technical and economic limitations. As such, it is useful to apply a ranking scheme that makes use of several different criteria and weights each criterion based on its relative importance in the overall evaluation. In this study, we demonstrate one such possible ranking workflow using real formation datasets from CO2 Storage Atlas of the Norwegian Continental Shelf. The workflow involves computing practical storage potentials using a generic well placement scheme, mathematical optimization and vertical-equilibrium modeling, and is general in the sense that it can be applied to other formation datasets. Economic factors related to the transportation and injection of CO2 are represented by the number of injection wells required, depth of injection, and distance …", "num_citations": "3\n", "authors": ["891"]}
{"title": "The single-cell transport problem for two-phase flow with polymer\n", "abstract": " Polymer injection is a widespread strategy in enhanced oil recovery. Polymer increases the water viscosity and creates a more favorable mobility ratio between the injected water and the displaced oil. The computational cost of simulating polymer injection can be significantly reduced if one splits the governing system of two-phase equations into a pressure equation and a set of saturation/component equations and use a Gauss–Seidel algorithm with optimal cell ordering to solve the nonlinear systems arising from an implicit discretization of the saturation/component equations. This approach relies on a robust single-cell solver that computes the saturation and polymer concentration of a cell, given the total flux and the saturation and polymer concentration of the neighboring cells. In this paper, we consider a relatively comprehensive polymer model used in an industry-standard simulator, and show that, in …", "num_citations": "3\n", "authors": ["891"]}
{"title": "Opm: the open porous media initiative\n", "abstract": " The principal objective of the Open Porous Media (OPM) initiative is to develop a simulation suite that is capable of modeling industrially and scientifically relevant flow and transport processes in porous media and bridge the gap between the different application areas of porous media modeling, including reservoir mechanics, CO2 sequestration, biological systems, and product development of engineered media. The OPM initiative will provide a long-lasting, efficient, and well-maintained open-source software for flow and transport in porous media built on modern software principles. The suite is released under the GNU General Public License (GPL). Our motivation is to provide a means to unite industry and public research on simulation of flow and transport in porous media. For academic users, we seek to provide a software infrastructure that facilitates testing of new ideas on models with industry-standard …", "num_citations": "3\n", "authors": ["891"]}
{"title": "Multiscale methods and streamline simulation for rapid reservoir performance prediction\n", "abstract": " We introduce a novel multiscale approach for reservoir simulation as an alternative to industry-standard upscaling methods. In our approach, reservoir pressure and total velocity is computed separately from the fluid transport. Pressure is computed on a coarse grid using a multiscale mixed-finite element method that gives a mass-conserving velocities on a fine subgrid. The fluid transport is computed using streamlines on the underlying fine geogrid.", "num_citations": "3\n", "authors": ["891"]}
{"title": "Time-of-flight+ fast marching+ transport collapse: An alternative to streamlines for two-phase porous media flow with capillary forces\n", "abstract": " State-of-the-art technology in reservoir characterization allows for the generation of high-resolution reservoir models with multi-million cells. Moreover, increased demands for assessment of uncertainties and history matching require fast and accurate flow simulations on multiple plausible geological models on a routinely basis. Conventional reservoir simulators fail to fulfill this need. This has lead to a revival of streamline simulators based on time-of-flight coordinates.We suggest an alternative to streamline methods that avoids the geometrical complexity inherent in representing the individual streamlines. Our novel method has four essential building blocks:(i) a reformulation of the advection of characteristics into a steady timeof-flight equation;(ii) an efficient fast marching method for the time-of-flight equation;(iii) the transport-collapse operator for appropriate averaging of multivalued solutions; and (iv) an operator …", "num_citations": "3\n", "authors": ["891"]}
{"title": "Streamline simulation of a reactive advective flow with discontinuous flux function\n", "abstract": " Reactive transport in porous media with dissolution and precipitation has important applications in oil and gas industry and groundwater remediation. In this work, we present a simulation method for reactive flow in porous media of two salts that share an ion. The method consists of a front-tracking solver that uses the Riemann solutions of the underlying set of hyperbolic partial differential equations. In addition to the discontinuities stemming from the nonlinearities of the flux function, the flux function for the corresponding advection reaction equation also admits discontinuities for a heterogeneous medium. Here, we solve the Riemann problem for the governing nonlinear hyperbolic system with a discontinuous flux function. We use mass balance across the interface and the non-decreasing sequence of velocity of waves to seek the unique solution for this problem. Furthermore, a model is provided for mixing …", "num_citations": "2\n", "authors": ["891"]}
{"title": "Fully implicit WENO schemes on stratigraphic and fully unstructured grids\n", "abstract": " Higher-order spatial discretization has been used by many authors to reduce numerical diffusion and mitigate grid-orientation effects. EOR processes are particularly susceptible to numerical diffusion, since the active chemical substances are often transported by linear or weakly nonlinear waves. Most high-resolution methods reported in the literature are based on explicit temporal discretization, which imposes severe time-step restrictions. Herein, we investigate fully-implicit, second-order WENO schemes on unstructured grids. Accuracy and computational efficiency is compared to a standard first-order scheme for Voronoi and corner-point grids in 2D and 3D for black-oil type and compositional flow models.", "num_citations": "2\n", "authors": ["891"]}
{"title": "Hyperbolic Conservation Laws: Computation\n", "abstract": " A conservation law is a first-order system of PDEs in divergence form (1)∂ tU (x, t)+∂ xG (U (x, t))= 0, t≥ 0, x∈ R, describing the evolution of conserved quantities U∈ Rn according to flux function G: Rn→ R n.(Herein, we only consider the 1D case for brevity.) Solutions of (1) admit various kinds of nonlinear and discontinuous waves. Numerical methods developed to accurately compute such waves have significantly influenced developments in modern computational science. Methods come in two forms: shock-fitting methods in which discontinuities are introduced explicitly in the solution and shock-capturing methods in which numerical dissipation is used to capture discontinuities within a few grid cells.", "num_citations": "2\n", "authors": ["891"]}
{"title": "Operator Splitting of Advection and Diffusion on Non-Uniformly Coarsened Grids\n", "abstract": " High-resolution geological models of subsurface reservoirs typically contain much more details than can be used in conventional reservoir simulators. Geomodels are therefore upscaled before flow simulation is performed. Here, we present a non-uniform coarsening strategy to upscale geomodels, where the coarse grid is generated by grouping cells in the fine-scaled geomodel selectively into connected coarse blocks, with some minimum volume and with the total flow through each coarse block bounded above. Transport is then modeled on this simulation grid. For purely advective flow, the coarsening strategy has been shown to be robust, allowing for both accurate and fast transport simulations of highly heterogeneous and fractured reservoirs. Here, we consider advection-dominated two-phase flow, where the capillary diffusion is discretized separately from the advective and gravity terms using operator splitting. In particular, we investigate different damping strategies of the diffusive term to counteract overestimation of the diffusion operator on the coarse grid, this to ensure accurate diffusion modelling in the transport solver.", "num_citations": "2\n", "authors": ["891"]}
{"title": "Application of multiscale modelling concepts on the reservoir model for the Norne field\n", "abstract": " Multiscale modelling of flow and transport in porous media has become a hot research topic within the academic research community. Generally speaking, multiscale methods are numerical methods and strategies that aim to describe physical phenomena on coarse grids while accounting for the influence of fine-scale structures in the porous media. However, unlike traditional upscaling techniques, multiscale methods often provide a mechanism for also recovering an approximate finescale solution. In this report we make an effort to demonstrate some applications where multiscale flow solvers, used in combination with various methods for fast computation of fluid transport, may spur new ways of using flow information as part of reservoir planning and management. The multiscale flow solver considered herein is formulated using two grids. Reservoir properties are given on an underlying fine grid and the unknowns …", "num_citations": "2\n", "authors": ["891"]}
{"title": "Multiscale streamline simulation and dynamic data integration for high-resolution subsurface models\n", "abstract": " We discuss an efficient method for integrating dynamic data in high-resolution subsurface models. The method consists of two key technologies:(i) a very fast multiscalestreamline flow simulator, and (ii) a fast and robust’generalized travel-time inversion’method. The travel-time inversion is based on sensitivities computed analytically along streamlines using only one forward simulation. The sensitivities are also used to selectively reduce the updating of basis functions in the multiscale mixed finite-element pressure solver. Moreover, we propose a new streamline formulation that improves the accuracy of production curves and allows a drastic reduction in the number of streamlines required to calculate accurate dynamic data responses.The accuracy and robustness of our method is discussed using two 2-D test cases. Furthermore, We demonstrate the efficiency and utility of our approach using a highly detailed 3-D subsurface model consisting of more than one million cells and 69 producing wells, for which seven years of dynamic data are integrated in less than twenty minutes on a standard workstation PC.", "num_citations": "2\n", "authors": ["891"]}
{"title": "Multiscale mixed methods on corner-point grids: mimetic versus mixed subgrid solvers\n", "abstract": " Multiscale simulation is a promising approach to facilitate direct simulation of large and complex grid-models for highly heterogeneous petroleum reservoirs.  Unlike traditional simulation approaches based on upscaling/downscaling, multiscale methods seek to solve the full flow problem by incorporating sub-scale heterogeneities into local discrete approximation spaces. We consider a multiscale formulation based on a hierarchical grid approach, where basis functions with subgrid resolution are computed numerically to correctly and accurately account for subscale variations from an underlying (fine-scale) geomodel when solving the global flow equations on a coarse grid. By using multiscale basis functions to discretise the global flow equations on a (moderately-sized) coarse grid, one can retain the efficiency of an upscaling method, while at the same time produce detailed and conservative velocity fields on the underlying fine grid.For pressure equations, the multiscale mixed finite-element method (MsMFEM) has shown to be a particularly versatile approach. In this paper we extend the method to corner-point grids, which is the industry standard for modelling complex reservoir geology. We consider two different subsolvers: a mimetic finite difference method on the original corner-point grid and a mixed finite-element method on a tetrahedral subdivision. The versatility and accuracy of the multiscale mixed methodology is demonstrated on two corner-point models: a small Y-shaped sector model and a complex model of a layered sedimentary bed. In particular, we demonstrate how one can avoid the usual difficulties of resampling, when moving …", "num_citations": "2\n", "authors": ["891"]}
{"title": "Multiscale methods for flow in porous media\n", "abstract": " We present a hierarchical multiscale method for the numerical solution of two-phase flow in strongly heterogeneous porous media. The method is based upon a mixed finite-element formulation, where basis functions are computed numerically on a coarse grid to correctly and accurately account for subscale permeability variations from an underlying (fine-scale) geomodel.", "num_citations": "2\n", "authors": ["891"]}
{"title": "A front tracking method for conservation laws with boundary conditions\n", "abstract": " A front tracking method is used to construct weak solutions to scalar conservation laws with two kinds of boundary conditions--Dirichlet conditions and a novel zero flux (or no-flow) condition. The construction leads to an efficient numerical method. The main feature of the scheme is that there is no stability condition correlating the spatial and temporal discretization parameters. The analysis uses the traditional method of proving compactness via Helly's theorem as well as the more modern concept of measure valued solutions. Three numerical examples are presented.", "num_citations": "2\n", "authors": ["891"]}
{"title": "An Adaptive Sequential Fully Implicit Domain-Decomposition Solver\n", "abstract": " Modern reservoir simulation must handle complex compositional fluid behavior, orders-of-magnitude variations in rock properties, and large velocity contrasts. We investigate how one can use nonlinear domain-decomposition preconditioning to combine sequential and fully implicit (FI) solution strategies to devise robust and highly efficient nonlinear solvers. A full simulation model can be split into smaller subdomains that each can be solved independently, treating variables in all other subdomains as fixed. In subdomains with weaker coupling between flow and transport, we use a sequential fully implicit (SFI) solution strategy, whereas regions with stronger coupling are solved with an FI method. Convergence to the FI solution is ensured by a global update that efficiently resolves long-range interactions across subdomains. The result is a solution strategy that combines the efficiency of SFI and its ability to use …", "num_citations": "1\n", "authors": ["891"]}
{"title": "High-resolution compositional reservoir simulation with dynamic coarsening and local timestepping for unstructured grids\n", "abstract": " Numerical smearing is oftentimes a challenge in reservoir simulation, particularly for complex tertiary recovery strategies. We present a new high-resolution method that uses dynamic coarsening of a fine underlying grid in combination with local timestepping to provide resolution in time and space. The method can be applied to stratigraphic and general unstructured grids, is efficient, introduces minimal computational overhead, and is applicable to flow models seen in practical reservoir engineering. Technically, the method is based on three concepts:", "num_citations": "1\n", "authors": ["891"]}
{"title": "Toward Accurate Reservoir Simulations on Unstructured Grids: Design of Simple Error Estimators and Critical Benchmarking of Consistent Discretization Methods for Practical …\n", "abstract": " In this paper, we aim to identify discretization errors caused by non-K-orthogonal grids upfront through simple preprocessing tools and perform a comparative study of a set of representative, state-of-the-art, consistent discretizations [multipoint flux approximation (MPFA-O), mimetic finite difference (MFD), nonlinear two-pointflux approximation (NTPFA, TPFA), and average multipoint flux approximation (AvgMPFA)] to select the method most suited for inclusion in a commercial reservoir simulator. To predict the potential impact of discretization errors, we propose two types of error indicators. Static indicators measure the degree of nonconsistency of the two-point method at a cell level, and dynamic indicators measure how local discretization errors affect flow paths. The latter are computed using a series of idealized tracer simulations. By changing monitoring and injection points, one can mimic the reservoir …", "num_citations": "1\n", "authors": ["891"]}
{"title": "Use of dynamically adapted basis functions to accelerate multiscale simulation of complex geomodels\n", "abstract": " A number of different multiscale methods have been developed as a robust alternative to upscaling and as a means for accelerated reservoir simulation of high-resolution geomodels. In their basic setup, multiscale methods use a restriction operator to construct a reduced system of flow equations on a coarser grid, and a prolongation operator to map pressure unknowns from the coarse grid back to the original simulation grid. The prolongation operator consists of basis functions computed numerically by solving localized flow problems. The resulting multiscale solver can both be used as a CPR-preconditioner in fully implicit simulators or as an efficient approximate iterative linear solver in a sequential setting; successful implementation of the latter approach in a commercial simulator was reported at ECMOR XV. Recently, it has been shown that significantly faster convergence is observed if one instead of using a …", "num_citations": "1\n", "authors": ["891"]}
{"title": "On Holden’s seven guidelines for scientific computing and development of open-source community software\n", "abstract": " Two decades ago, Helge Holden proposed seven guidelines to improve the way new achievements and results in scientific computing were presented, evaluated, and compared in contemporary scientific literature. In this essay, written as a tribute to Helge on his 60th birthday, I revisit the guidelines and point out why they are still valid today seen from my perspective, working as a contract researcher at the interface between mathematics and applications in industry.Developing new computational methods usually involves a lot of experimental programming. Over the past decade, my research group has developed an open-source community code that today has hundreds of users worldwide. I discuss some considerations that have gone into this development and present a few lessons learned. Moreover, based on this experience, as well as from development of professional software for our clients, I present advice on how you can be more productive in your experimental programming and increase the impact of your scientific results.", "num_citations": "1\n", "authors": ["891"]}
{"title": "Non-linear Newton solver for a polymer two-phase system using interface-localized trust regions\n", "abstract": " Models of polymer flooding account for several processes such as concentration dependent viscosity, adsorption, incomplete mixing, inaccessible pore space, and reduced permeability effects, which altogether gives strongly coupled nonlinear systems that are challenging to solve numerically. Herein, we use a sequentially implicit solution strategy that splits the equation system into a pressure and a transport part. Our objective is to improve convergence rates for the transport subproblem, which contains many of the essential nonlinearities caused by the addition of polymer. Convergence failure for the Newton solver is usually caused by steps that pass inflection points and discontinuities in the fractional flow functions. The industry-standard approach is to heuristically chop time steps and/or dampen saturation updates suggested by the Newton solver if these exceed a predefined limit. An improved strategy is to use …", "num_citations": "1\n", "authors": ["891"]}
{"title": "A study on how top-surface morphology influences the CO2 storage capacity\n", "abstract": " The primary trapping mechanism in CO2 storage is structural trapping, which means accumulation of a CO2 column under a deformation in the caprock. We present a study on how different top-seal morphologies will influence the CO2 storage capacity and migration patterns. Alternative top-surface morphologies are created stochastically by combining different stratigraphic scenarios with different structural scenarios. Stratigraphic surfaces are generated by Gaussian random fields, while faults are generated by marked point processes. The storage capacity is calculated by a simple and fast spill-point analysis, and by a more extensive method including fluid flow simulation in which parameters such as pressure and injection rate are taken into account. Results from the two approaches are compared. Moreover, by generating multiple equiprobable realisations, we quantify how uncertainty in the top-surface morphology impacts the primary storage capacity. The study shows that the morphology of the top seal is of great importance both for the primary storage capacity and for migration patterns.", "num_citations": "1\n", "authors": ["891"]}
{"title": "Accurate Discretization of Vertically-Averaged Models of CO2 Plume Migration\n", "abstract": " When CO2 is injected into a deep formation, it will migrate as a plume that moves progressively higher in the formation, displacing the resident brine. The invasion front is driven by gravity, and the upward movement of the plume is limited by a low-permeable caprock. Several authors have recently proposed to make a sharp-interface assumption and only describe the plume migration in a vertically-averaged sense. For inhomogeneous permeability, the plume migration is then described by a system of conservation laws with spatially discontinuous flux. If one disregards dissolution and residual trapping, the system reduces to a scalar conservation law with a spatially dependent flux function, which may exhibit different solutions depending on the entropy condition that is enforced to pick a unique solution. We propose a certain set of assumptions that lead to the so-called minimum-jump condition and derive the …", "num_citations": "1\n", "authors": ["891"]}
{"title": "On Front Tracking for Compressible Flow\n", "abstract": " Streamline simulation is particularly efficient for incompressible two-phase flow, for which one can use front tracking to solve the 1-D transport problems along streamlines. Here we investigate the extension of this method to compressible (and immiscible) flow and discuss some of the difficulties involved, and in particular the choices one has in writing the 1-D transport equation (s). Our study is motivated by the simulation of CO2 injection, and we therefore also develop methods that are particularly suited for solving compressible flow where one phase is incompressible. Altogether, we present four front-tracking methods that are based on a combination of solving ordinary Riemann problems and Riemann problems with discontinuous flux.", "num_citations": "1\n", "authors": ["891"]}
{"title": "Operator Splitting for Convection-Dominated Nonlinear Partial Differential Equations\n", "abstract": " We describe an efficient solution strategy for nonlinear systems of partial differential equations of the form $$ {U_t} + \\sum\\limits_i {{F_i}} {(U)_{{x_i}}} = \\sum\\limits_{i,j} {{D_{ij}}} {(U)_{{x_i}{x_j}}} + G(U),{\\text{ U}}{{\\text{|}}_{t = 0}} = {U_0}. $$ We explicitly allow for degeneracy of the viscous term in the sense that we only require Σ               i,j                          D′               ij              (u) ξ                            i                          ξ                            j              ≥ 0. The solution strategy is based on operatoi splitting where an abstractly defined Cauchy problem U                            t              + A(U) = 0, is split into simpler problems V                                             t                                               l                             + A                            l             (V                            l             ) = 0, by writing A = A             1 +…+ A             ℓ. If the solution of subproblem I is written V                            l             (t) = S                                             t                                               l                                         V …", "num_citations": "1\n", "authors": ["891"]}
{"title": "A fast level set method for reservoir simulation\n", "abstract": " Wc present a level set method for reservoir simulation based on a fractional flow formulation of two-phase, incompressible, immiscible flow in two or three space dimensions. The method uses a fast marching level set approach and is therefore considerably faster than conventional finite difference methods. The level set approach compares favourably with a front tracking method what regards both emciency and accuracy, but maintains the advantage of being able to handle changing topologies of the front structure.", "num_citations": "1\n", "authors": ["891"]}