{"title": "Penerapan IT Balanced Scorecard dalam Perencanaan Strategis Sistem Informasi di STIKI Malang\n", "abstract": " Teknologi informasi dan sistem informasi (TI/SI) merupakan aset strategis untuk memenangi persaingan usaha. Perguruan tinggi sebagai institusi penyedia jasa pendidikan harus menciptakan keunggulan kompetitif untuk dapat bersaing dengan perguruan tinggi lainnya. Salah satu cara untuk menciptakan keunggulan kompetitif adalah melalui pemanfaatan TI/SI.Dengan semakin meningkatnya nilai investasi aset TI/SI, jajaran eksekutif perguruan tinggi harus memastikan bahwa manfaat yang dihasilkan oleh aset TI/SI sepadan dengan besaran nilai investasinya. Informasi yang dihasilkan dari penerapan SI yang tidak terencana tidak akan dapat digunakan untuk pengambilan keputusan di level eksekutif. Sehingga timbul pertanyaan apakah SI yang diimplementasikan telah mampu memberikan kontribusi yang riil terhadap organisasi.", "num_citations": "8\n", "authors": ["1544"]}
{"title": "Functional Model of RFID-Based Student Attendance Management System in Higher Education Institution\n", "abstract": " The need of developing student attendance management system is driven due to the fact that the students’ attendance records are one of the most important factors of their academic achievement. The conventional practice of managing the student attendance manually by pens and papers is considered as challenging tasks for most of the higher education institutions. This paper will propose a system functional model to manage the student attendance in a more efficient way by utilizing the RFID tags technology. The RFID technology is an automated identification and data collection technology. The ability of RFID tags to deliver accurate information in quicker way shall improve the efficiency to manage the students attendance data. The system model proposed in this paper will also consider the need of the academic administrative staff to have an integrated reporting function which are related to the student and the lecturer attendance records. The system functional models presented in this paper are developed in UML based on the approach of object-oriented system analysis and design.", "num_citations": "4\n", "authors": ["1544"]}
{"title": "Game ID Card Puzzle Berbasis Virtual Reality Untuk Mengenalkan Kebudayaan Tradisional Indonesia\n", "abstract": " Perkembangan industri Game pada saat ini sangat pesat dengan berbagai macam teknologi yang digunakan. Salah satu teknologi Game yang terkenal beberapa tahun belakangan ini adalah Virtual Reality. Virtual Reality sendiri adalah teknologi yang memungkinkan penggunanya merasakan secara lansung tampilan dunia maya (virtual) dengan memanfaat indra penglihatan. Game ID Card Puzzle memanfaatkan teknologi ini dalam implementasinya. ID Card Puzzle termasuk dalam kategori (genre) puzzle. Konten yang digunakan dalam Game ini merupakan konten lokal seperti rumah adat, pakaian tradisional, senjata tradisional, alat musik tradisional dan tarian tradisional. Sesuai dengan judul dari Game yang dibuat, tujuan dari pembuatan Game ini adalah untuk mengembangkan permainan berbasis virtual reality yang menarik, kreatif, dan inovatif sehingga bisa dinikmati serta mencoba untuk mengenalkan budaya Indonesia bagi pengguna didalam maupun luar Indonesia. Dalam proses pengembangan terdapat beberapa prosedur yang dilalui yaitu persiapan, analisa, desain, pembuatan dan uji coba. Metode pengumpulan data yang dilakukan meliputi studi literatur dan observasi. Pada tahap pengujian dilakukan proses uji coba pada 30 penguji yang terdiri dari usia 14–40 tahun. Setelah melalui tahap pengembangan dan pengujian, Game ID Card Puzzle dapat membuktikan bahwa dengan penerapan teknologi Virtual Reality dalam Game yang mengangkat konten lokal, pengguna dapat merasa pengalaman bermain yang jauh lebih interaktif dan memberikan pengetahuan baik tentang informasi kearifan lokal.", "num_citations": "3\n", "authors": ["1544"]}
{"title": "Peningkatan Keberhasilan Pengiriman Data pada Lingkungan VANET\n", "abstract": " VANET (Vehicular Adhoc Network) memungkinkan terjadinya pengiriman data antar kendaraan secara nirkabel. Dengan teknologi ini memungkinkan terjadinya komunikasi atau pertukaran data antar kendaraan. Data akan dikirimkan melalui jaringan nirkabel dari kendaran pengirim ke kendaraan di sekitar dan akan diteruskan hingga mencapai tujuan. Selain mampu mengirimkan data antar kendaraan, pada teknologi ini juga dimungkinkan terjadinya pengiriman data antara kendaran dengan infrastruktur yang ada di pinggir jalan atau biasa disebut dengan Road Side Unit (Nidhi et al, 2012). Secara umum, VANET memiliki 3 topologi dasar yaitu Pure Cellular, Pure Adhoc dan Hybrid.Menurut peneliti (Kumar, R. and Dave, M, 2011) Pure cellular adalah jaringan yang dibentuk oleh Wireless LAN dan jaringan 3G yang dapat digunakan untuk terhubung ke jaringan lain yang lebih besar atau bahkan ke internet. Karena membutuhkan sumber daya yang lebih besar maka biasanya jaringan ini dibentuk oleh beberapa Road Side Unit atau yang saat ini dikenal dengan Base Transmission Station pada penyedia layanan GSM sehingga dapat di pasang sumberdaya yang lebih besar.", "num_citations": "2\n", "authors": ["1544"]}
{"title": "ANALISIS KEBUTUHAN FUNGSIONAL SISTEM INFORMASI MANAJEMEN KINERJA INTERNAL PERGURUAN TINGGI DI STIKI MALANG\n", "abstract": " Institusi pendidikan tinggi sebagai salah satu organisasi yang bergerak di bidang jasa pendidikan tentunya tidak terlepas dari jangkauan perkembangan teknologi informasi. Penerapan teknologi informasi sudah menjadi bagian integral dari KBM (kegiatan belajarmengajar) dan kegiatan pendukung lainnya yang terdapat di institusi perguruan tinggi. Penerapan teknologi informasi tidak hanya berperan dalam kegiatan operasional, namun juga dalam kegiatan perencanaan dan pemberdayaan sumber daya lain yang dimiliki oleh perguruan tinggi. Hal ini disebabkan teknologi informasi terkait dengan penyediaan informasi, integrasi antar sistem, dan sistem pendukung manajemen yang baik.Hal tersebut dapat menimbulkan tantangan baru bagi perguruan tinggi untuk mengembangkan sebuah sistem yang mampu mengintegrasikan kebutuhan informasi, merencanakan penggunaan sumber daya yang optimal bagi institusi perguruan tinggi. Sekolah Tinggi Informatika & Komputer Indonesia (STIKI) Malang merupakan lembaga pendidikan tinggi yang memfokuskan diri pada bidang informatika. STIKI Malang memiliki struktur organisasi yang terdiri dari sekumpulan unit kerja yang harus dipantau pencapaian kinerjanya secara berkelanjutan dan menyeluruh.", "num_citations": "1\n", "authors": ["1544"]}
{"title": "Penetapan Kerangka Kerja Social CRM Berdasarkan Karakteristik Media Sosial\n", "abstract": " This research is conducted to analyze and construct a framework for customer relationship management (CRM) practices implementation based on various characteristics of online social media. The framework could be used to analyze the Social CRM domains of social customer insights, marketing, sales, service and support, innovations, collaborations, and customer experiences. It will then be implemented based on prioritization analysis of organization’s activities as well as the maturity of technologies that could support Social CRM implementation within the organization. The framework is expected to produce implementation roadmap for 5 categories of Social CRM practices as well as the relevant social media based on defined priorities of the organization.", "num_citations": "1\n", "authors": ["1544"]}