{"title": "Supporting collaborative development using process models: An integration-focused approach\n", "abstract": " Software engineering projects are highly collaborative. Existing tools designed to support collaboration usually provide some specific service, and integration with other tools using data and events. However, Process-Centered Software Engineering Environments have traditionally been designed with different assumptions. The process is usually considered as the central aspect of the software project, and used as a center of control. As a result, great emphasis has been placed on the ability of PSEEs to invoke other tools, or use data generated by other tools. However, the integration in the other direction, that is, the ability of other tools to query the data managed by PSEEs (the process model), and hook into their extensions points, has been largely ignored, as it is not compatible with the vision of the PSEE as the central orchestrator of project support tools. We argue that this view has hindered the widespread …", "num_citations": "12\n", "authors": ["406"]}
{"title": "Supporting collaborative development using process models: a tooled integration‐focused approach\n", "abstract": " Collaboration in software engineering projects is usually intensive and requires adequate support by well‐integrated tools. However, process‐centered software engineering environments (PSEE) have traditionally been designed to exploit integration facilities in other tools, while offering themselves little to no such facilities. This is in line with the vision of the PSEE as the central orchestrator of project support tools. We argue that this view has hindered the widespread adoption of process‐based collaboration support tools by incurring too much adoption and switching costs. We propose a new process‐based collaboration support architecture, backed by a process metamodel, that can easily be integrated with existing tools. The proposed architecture revolves around the central concepts of ‘deep links’ and ‘hooks’. Our approach is validated by analyzing a collection of open‐source projects, and integration utilities …", "num_citations": "9\n", "authors": ["406"]}
{"title": "Modeling ad-hoc collaboration for automated process support\n", "abstract": " Understanding and supporting collaboration is a major concern in any collective endeavor. In software engineering, planning collaboration is difficult and often occurs rather ad-hoc. However, many proposals for the description and support of collaboration assume necessary information is readily available and already integrated in process models. We believe practitioners should be given the ability to represent their evolving understanding about collaboration and should be supported by tools using such representation. We developed an extension to the Software & System Process Engineering Meta-Model (SPEM), which introduces concepts needed to represent precise and dynamic ad-hoc collaboration setups. We also describe tool support and present a proof-of-concept based on a fictitious but realistic application example.", "num_citations": "3\n", "authors": ["406"]}
{"title": "Towards a tool-supported approach for collaborative process modeling and enactment\n", "abstract": " In software engineering, as in any collective endeavor, understanding and supporting collaboration is a major concern. Unfortunately, the main concepts of popular process formalisms are not always adequate to describe collaboration. We extend the Software & System Process Engineering Meta-Model (SPEM) by introducing concepts needed to represent precise and dynamic collaboration setups that practitioners create to address ever-changing challenges. Our goal is to give practitioners the ability to express evolving understanding about collaboration in a formalism suited for easy representation and tool-provided assistance. Our work is based on a collaborative process metamodel we have developed. In this paper, we first present a meta-process for process modeling and enactment, which we apply to our collaborative process metamodel. Then we describe the implementation of a suitable process model …", "num_citations": "3\n", "authors": ["406"]}
{"title": "Modélisation et mise en œuvre de processus collaboratifs ad hoc\n", "abstract": " Le développement logiciel est une activité intensément collaborative. Les problématiques habituelles de collaboration (organisation des tâches, utilisation des ressources, communication, etc.) y sont exacerbées par le rythme rapide des changements, la complexité et la grande interdépendance des artéfacts, le volume toujours croissant d’informations de contexte à traiter, la distribution géographique des participants, etc. Par conséquent, la question du support outillé de la collaboration se pose plus fortement que jamais en ingénierie logicielle. Dans cette thèse, nous abordons la question de la collaboration sous l’angle de la modélisation et de l’exploitation des processus de développement. Ces derniers sont traditionnellement considérés comme une structure imposée sur le développement d’un produit logiciel. Cependant, une part importante de la collaboration en génie logiciel est de nature ad hoc, faite d’activités non planifiées. Afin de faire contribuer les processus logiciels au support de la collaboration, en particulier celle non planifiée, nous nous intéressons à leur fonction de banques d’information sur les éléments clés de cette collaboration et les interactions entre ces derniers. Notre contribution est, d’une part, un modèle conceptuel du support au développement collaboratif, capable de rendre compte de la structure d’outils classiques comme ceux de gestion de versions ou de gestion de défauts logiciels. Ce modèle conceptuel est ensuite appliqué aux modèles de processus logiciels. Nous définissons ainsi une approche globale d’exploitation des informations de processus pour le support de la collaboration, basée sur les notions …", "num_citations": "1\n", "authors": ["406"]}