{"title": "Improved adaptive splitting and selection: the hybrid training method of a classifier based on a feature space partitioning\n", "abstract": " Currently, methods of combined classification are the focus of intense research. A properly designed group of combined classifiers exploiting knowledge gathered in a pool of elementary classifiers can successfully outperform a single classifier. There are two essential issues to consider when creating combined classifiers: how to establish the most comprehensive pool and how to design a fusion model that allows for taking full advantage of the collected knowledge. In this work, we address the issues and propose an AdaSS+, training algorithm dedicated for the compound classifier system that effectively exploits local specialization of the elementary classifiers. An effective training procedure consists of two phases. The first phase detects the classifier competencies and adjusts the respective fusion parameters. The second phase boosts classification accuracy by elevating the degree of local specialization. The …", "num_citations": "52\n", "authors": ["1087"]}
{"title": "Some remarks on chosen methods of classifier fusion based on weighted voting\n", "abstract": " Multiple Classifier Systems are nowadays one of the most promising directions in pattern recognition. There are many methods of decision making by the ensemble of classifiers. The most popular are methods that have their origin in voting method, where the decision of the common classifier is a combination of individual classifiers’ outputs. This work presents comparative analysis of some classifier fusion methods based on weighted voting of classifiers’ responses and combination of classifiers’ discriminant functions. We discus which of presented methods could produce classifier better than Oracle one. Some results of computer experiments carried out on benchmark and computer generated data which confirmed our studies are presented also.", "num_citations": "47\n", "authors": ["1087"]}
{"title": "Algorithm of designing compound recognition system on the basis of combining classifiers with simultaneous splitting feature space into competence areas\n", "abstract": " The paper presents the novel adaptive splitting and selection algorithm (AdaSS) used for learning compound pattern recognition system. Splitting a feature space into its constituents and selection of the best area classifier from the pool of available recognizers for each region are key processes of the proposed model. Both take place simultaneously as part of a compound optimization process aimed at maximizing system performance. Evolutionary algorithms are used to find out the optimal solution. The results of experiments for algorithm evaluation purposes prove the quality of the proposed approach.", "num_citations": "46\n", "authors": ["1087"]}
{"title": "Fixed-size ensemble classifier system evolutionarily adapted to a recurring context with an unlimited pool of classifiers\n", "abstract": " This paper presents a novel ensemble classifier system designed to process data streams featuring occasional changes in their characteristics (concept drift). The ensemble is especially effective when the concepts reappear (recurring context). The system collects information on emerging contexts in a pool of elementary classifiers trained on subsequent data chunks. The pool is updated only when concept drift is detected. In contrast to other ensemble solutions, classifiers are not removed from the pool, and therefore, knowledge of past contexts is preserved for future use. To ensure high classification performance, the number of classifiers contributing to decision-making is fixed and limited. Only selected elements from the pool can join the decision-making ensemble. The process of selecting classifiers and adjusting their weights is realized by an evolutionary-based optimization algorithm that aims to …", "num_citations": "34\n", "authors": ["1087"]}
{"title": "Evolutionary algorithm for decision tree induction\n", "abstract": " Decision trees are among the most popular classification algorithms due to their knowledge representation in form of decision rules which are easy for interpretation and analysis. Nonetheless, a majority of decision trees training algorithms base on greedy top-down induction strategy which has the tendency to develop too complex tree structures. Therefore, they are not able to effectively generalise knowledge gathered in learning set. In this paper we propose EVO-Tree hybrid algorithm for decision tree induction. EVO-Tree utilizes evolutionary algorithm based training procedure which processes population of possible tree structures decoded in the form of tree-like chromosomes. Training process aims at minimizing objective functions with two components: misclassification rate and tree size. We test the predictive performance of EVO-Tree using several public UCI data sets, and we compare the results …", "num_citations": "27\n", "authors": ["1087"]}
{"title": "Method of classifier selection using the genetic approach\n", "abstract": " The paper presents a novel machine learning algorithm used for training a compound classifier system that consists of a set of area classifiers. Area classifiers recognize objects derived from the respective competence area. Splitting feature space into areas and selecting area classifiers are two key processes of the algorithm; both take place simultaneously in the course of an optimization process aimed at maximizing the system performance. An evolutionary algorithm is used to find the optimal solution. A number of experiments have been carried out to evaluate system performance. The results prove that the proposed method outperforms each elementary classifier as well as simple voting.", "num_citations": "26\n", "authors": ["1087"]}
{"title": "Learning decision trees from data streams with concept drift\n", "abstract": " This paper addresses a data mining task of classifying data stream with concept drift. The proposed algorithm, named Concept-adapting Evolutionary Algorithm For Decision Tree does not require any knowledge of the environment such as numbers and rates of drifts. The novelty of the approach is combining tree learner and evolutionary algorithm, where the decision tree is learned incrementally and all information is stored in an internal structure of the trees’ population. The proposed algorithm is experimentally compared with state-of-the-art stream methods on several real live and synthetic datasets. Results indicate its high performance in term of accuracy and processing time.", "num_citations": "24\n", "authors": ["1087"]}
{"title": "Cost-sensitive splitting and selection method for medical decision support system\n", "abstract": " The paper presents a cost-sensitive modification of the Adaptive Splitting and Selection (AdaSS) algorithm, which trains a combined classifier based on a feature space partitioning. In this study the algorithm considers constraints put on the cost of selected features, which are one of the key-problems in the clinical decision support systems. The modified version takes into consideration both the overall classification accuracy and the cost constraints, returning balanced solution for the problem at hand. Proposed method was evaluated on the basis of computer experiments run on cost-sensitive medical benchmark datasets.", "num_citations": "16\n", "authors": ["1087"]}
{"title": "Migraine diagnosis support system based on classifier ensemble\n", "abstract": " A valid diagnosis of migraine is a non-trivial decision problem. This is due to the fact that migraine can manifest wide range of varied symptoms. Thus, designing a computer aided diagnosis system for that problem remains still a very interesting topic. In this paper we present an ensemble classifier system designed for headache diagnosis. We assumed that the system should make fast initial diagnosis based on an analysis of data collected in the questionnaire only. Such an assumption eliminated possibility of application of most classical classification algorithms as they could not obtain decent level of accuracy. Therefore, we decided to apply an ensemble solution. Although it is clear that ensemble should consists of complementary classifiers, there is no guidance on how to choose ensemble size and ensure its diversity. Thus, we applied two stages strategy. Firstly, large pool of elementary classifiers were …", "num_citations": "12\n", "authors": ["1087"]}
{"title": "New diversity measure for data stream classification ensembles\n", "abstract": " The diversity of a voting committee is one of the key characteristics of ensemble systems. It determines the benefits that can be obtained through classifier fusion. There are many measures of diversity that can be used in classical decision-making systems which operate in stationary environments. A plethora of algorithms have also been proposed to ensure ensemble diversity. Bagging and boosting are a few of the most popular examples. Unfortunately, these measures and algorithms cannot be applied in systems that process streaming data. Not only must a different implementation be designed for processing fast moving samples in a stream, but the notion of diversity must also be redefined. In this paper it is proposed to assess diversity based on analysis of classifier reactions to changes in data streams. Therefore, two novel error trend diversity measures are introduced that compare the error trends of classifiers …", "num_citations": "11\n", "authors": ["1087"]}
{"title": "Dimensionality reduction, and function approximation of poly (lactic-co-glycolic acid) micro-and nanoparticle dissolution rate\n", "abstract": " Prediction of poly (lactic-co-glycolic acid)(PLGA) micro-and nanoparticles’ dissolution rates plays a significant role in pharmaceutical and medical industries. The prediction of PLGA dissolution rate is crucial for drug manufacturing. Therefore, a model that predicts the PLGA dissolution rate could be beneficial. PLGA dissolution is influenced by numerous factors (features), and counting the known features leads to a dataset with 300 features. This large number of features and high redundancy within the dataset makes the prediction task very difficult and inaccurate. In this study, dimensionality reduction techniques were applied in order to simplify the task and eliminate irrelevant and redundant features. A heterogeneous pool of several regression algorithms were independently tested and evaluated. In addition, several ensemble methods were tested in order to improve the accuracy of prediction. The empirical …", "num_citations": "11\n", "authors": ["1087"]}
{"title": "Electronic health record: A review\n", "abstract": " The Electronic Health Record (EHR) is becoming the central information object for various aspects of healthcare and medical related industries, from pharmaceuticals to bioengineering. This review provides a presentation of the state of affairs in several aspects of EHR, including security and privacy, data mining, design of decision support systems, acceptance by users and producers of health resources, and system implementation. In the last three years the number of publications has grown exponentially, therefore is rather difficult to be exhaustive, and the more technical aspects are expected to be quickly superseded by new advances.", "num_citations": "10\n", "authors": ["1087"]}
{"title": "A learning-based colour image segmentation with extended and compact structural tensor feature representation\n", "abstract": " In this paper a novel Tensor-Based Image Segmentation Algorithm (TBISA) is presented, which is dedicated for segmentation of colour images. A purpose of TBISA is to distinguish specific objects based on their characteristics, i.e. shape, colour, texture, or a mixture of these features. All of those information are available in colour channel data. Nonetheless, performing image analysis on the pixel level using RGB values, does not allow to access information on texture which is hidden in relation between neighbouring pixels. Therefore, to take full advantage of all available information, we propose to incorporate the Structural Tensors as a feature extraction method. It forms enriched feature set which, apart from colour and intensity, conveys also information of texture. This set is next processed by different classification algorithms for image segmentation. Quality of TBISA is evaluated in a series of experiments …", "num_citations": "6\n", "authors": ["1087"]}
{"title": "Ensemble classifier systems for headache diagnosis\n", "abstract": " Headache, medically known as cephalalgia, may have a wide range of symptoms and its types may be related and mixed. Its proper diagnosis is difficult and automatic diagnosis is usually rather imprecise, therefore, the problem is still the focus of intensive research. In the paper we propose headache diagnosis method which makes the decision on the basis of questionnaire only. It distinguished among 11 headache classes, which taxonomy is provided. The paper presents results of experiments which aim at selecting the best classification algorithm including several classical machine learning methods as well as ensemble approach. Results of experiments carried on dataset collected in University of Novi Sad confirm that the automatic classification system can gain high accuracy of classification for the problem under consideration.", "num_citations": "5\n", "authors": ["1087"]}
{"title": "Application of adaptive splitting and selection classifier to the spam filtering problem\n", "abstract": " E-Mail spam is one of the major problems plaguing the contemporary Internet, causing an inconvenience to an individual user and financial loss to a company. Spam filtering allows for early detection of unwanted messages and separates them from the incoming e-mail. Nonetheless, designing an effective spam detection system is not a trivial task, due to the problems connected with the analysis of the e-mail content and the occurrence of variation in spam characteristics. This article presents an application of a novel ensemble classifier system for spam detection. The system is an extension of the adaptive splitting and selection (AdaSS) framework. The idea of the ensemble is based on the assumption that high effectiveness of detection can be obtained by exploitation of the local competency of a set of diverse elementary classifiers. Therefore, the ensemble training algorithm divides the feature space into several …", "num_citations": "5\n", "authors": ["1087"]}
{"title": "Multiple classifier system with radial basis weight function\n", "abstract": " The paper presents novel algorithm of decision making in multiple classifier system (MCS), which response is based on weighted fusion of discriminating functions derived from a pool of elementary classifiers. Radial basis function model are used to establish the weights of the classifiers over a feature space. For best exploitation of knowledge collected by the classifiers parameters of the weight functions are set during learning process of the MCS that aims at minimizing misclassification rate of the MCS. Quality of the proposed radial basis function MCS (RB MCS) is verified in the set of experiments carried out on the set of benchmark datasets derived from UCI repository.", "num_citations": "5\n", "authors": ["1087"]}
{"title": "Fusers based on classifier response and discriminant function–comparative study\n", "abstract": " The Multiple Classifier Systems are nowadays one of the most promising directions in pattern recognition. There are many methods of decision making by the ensemble of classifiers. The most popular are methods that have their origin in voting method, where the decision of the common classifier is a combination of individual classifiers’ decisions. This work presents methods of classifier combination, where neural networks plays a role of fuser block. Fusion on level of recognizer responses or values of their discriminant functions is applied. The qualities of proposed methods are evaluated via computer experiments on generated data and two benchmark databases.", "num_citations": "5\n", "authors": ["1087"]}
{"title": "Application of adass ensemble approach for prediction of power plant generator tension\n", "abstract": " The paper presents the application of ensemble approach in the prediction of tension in a power plant generator. The proposed Adaptive Splitting and Selection (AdaSS) ensemble algorithm performs fusion of several elementary predictors and is based on the assumption that the fusion should take into account the competence of the elementary predictors. To take full advantage of complementarity of the predictors, the algorithm evaluates their local specialization, and creates a set of locally specialized predictors. System parameters are adjusted using evolutionary algorithms in the course of the learning process, which aims to minimize the mean squared error of prediction. Evaluation of the system is carried on an empirical data set and is compared to other classical ensemble methods. The results show that the proposed approach effectively returns a more consistent and accurate prediction of tension …", "num_citations": "4\n", "authors": ["1087"]}
{"title": "Adaptive splitting and selection method of classifier ensemble building\n", "abstract": " The paper presents a novel machine learning method which allows obtaining compound classifier. Its idea bases on splitting feature space into separate regions and choosing the best classifier from available set of recognizers for each region. Splitting and selection take place simultaneously as a part of an optimization process. Evolutionary algorithm is used to find out the optimal solution. The quality of the proposed method is evaluated via computer experiments.", "num_citations": "4\n", "authors": ["1087"]}
{"title": "Comparison of clustering methods in cotton textile industry\n", "abstract": " Clustering is the task of partitioning data objects into groups, so that the objects within a cluster are similar to one another and dissimilar to the objects in other clusters. The efficiency random algorithm for good k is used to estimate the optimal number of clusters. In this research two important clustering algorithms, namely centroid based k-means, and representative object based fuzzy c-means clustering algorithms are compared in the original real-world U.S. cotton textile and apparel imports data set. This data set is not analyzed very often, it is dictated by business, economics and politics environments and its behaviour is not well known. The analysis of several different real-world economies and industrial data sets of one country is possible to predict it’s economic development.", "num_citations": "3\n", "authors": ["1087"]}
{"title": "A novel hyperspectral segmentation algorithm—concept and evaluation\n", "abstract": " Nowadays, the hyperspectral imaging is the focus of intense research, because its applications can be very useful in the natural disaster monitoring and agricultural monitoring to enumerate only a few. The main problem of systems using hyperspectral imaging is the cost of labelling, because it requires the domain experts, who label the region or prepare the labelled learning set for machine learning methods. The article presents a novel Hyperspectral Segmentation Algorithm which is a part of a general framework used for image classification. The algorithm is based on an image decomposition into homogeneous regions using a novel similarity measure. Three different region representations are proposed using the matrix notation. An additional procedure merges similar regions into larger ones to reduce human expert engagement in region labelling. The algorithm has been evaluated on the number of …", "num_citations": "3\n", "authors": ["1087"]}
{"title": "Comparative analysis of classifier fusers\n", "abstract": " There are many methods of decision making by an ensemble of classifiers. The most popular are methods that have their origin in voting method, where the decision of the common classifier is a combination of individual classifiers’ outputs. This work presents comparative analysis of some classifier fusion methods based on weighted voting of classifiers’ responses and combination of classifiers’ discriminant functions. We discus different methods of producing combined classifiers based on weights. We show that it is not possible to obtain classifier better than an abstract model of committee known as an Oracle if it is based only on weighted voting but models based on discriminant function or classifier using feature values and class numbers could outperform the Oracle as well. Delivered conclusions are confirmed by the results of computer experiments carried out on benchmark and computer generated data.", "num_citations": "3\n", "authors": ["1087"]}
{"title": "Proceedings of the 9th International Conference on Computer Recognition Systems CORES 2015\n", "abstract": " The computer recognition systems are nowadays one of the most promising directions in artificial intelligence. This book is the most comprehensive study of this field. It contains a collection of 79 carefully selected articles contributed by experts of pattern recognition. It reports on current research with respect to both methodology and applications. In particular, it includes the following sections: Features, learning, and classifiers Biometrics Data Stream Classification and Big Data Analytics Image processing and computer vision Medical applications Applications RGB-D perception: recent developments and applications This book is a great reference tool for scientists who deal with the problems of designing computer pattern recognition systems. Its target readers can be the as well researchers as students of computer science, artificial intelligence or robotics.", "num_citations": "2\n", "authors": ["1087"]}
{"title": "Adaptive Splitting and Selection Algorithm for Regression\n", "abstract": " Developing system for regression tasks like predicting prices, temperature is not a trivial task. There are many of issues which must be addressed such as: selecting appropriate model, eliminating irrelevant inputs, removing noise, etc. Most of them can be solved by application of machine learning methods. Although most of them were developed for classification tasks, they can be successfully applied for regression too. Therefore, in this paper we present Adaptive Splitting and Selection for Regression algorithm, whose predecessor was successfully applied in many classification tasks. The algorithm uses ensemble techniques whose strength comes from exploring local competences of several predictors. This is achieved by decomposing input space into disjointed competence areas and establishing local ensembles for each area respectively. Learning procedure is implemented as a compound …", "num_citations": "2\n", "authors": ["1087"]}
{"title": "Dimensionality reduction and prediction of the protein macromolecule dissolution profile\n", "abstract": " A suitable regression model for predicting the dissolution profile of Poly (lactic-co-glycolic acid) (PLGA) micro- and nanoparticles can play a significant role in pharmaceutical/medical applications. The rate of dissolution of proteins is influenced by several factors and taking all such influencing factors into account, we have a dataset in hand with three hundred input features. Therefore, a primary approach before identifying a regression model is to reduce the dimensionality of the dataset at hand. On the one hand, we have adopted Backward Elimination Feature selection techniques for an exhaustive analysis of the predictability of each combination of features. On the other hand, several linear and non-linear feature extraction methods are used in order to extract a new set of features out of the available dataset. A comprehensive experimental analysis for the selection or extraction of features and identification …", "num_citations": "2\n", "authors": ["1087"]}
{"title": "Evolutionary adapted ensemble for reoccurring context\n", "abstract": " Reoccurring Context is a phenomenon being subject of interest in machine learning theory dealing with Concept Drift. Periodic reappearance of contexts naturally encourage designing classifier systems which utilizes their expertize on contexts collected in the past. The paper presents study on EAERC algorithm that gather its knowledge on appearing contexts in form of elementary classifiers which can potentially contribute in ensemble classifier system if necessary while keeping ensemble size strictly limited to ensure short response time. While unseen context appears EAERC automatically adds new classifier to the pool.", "num_citations": "2\n", "authors": ["1087"]}
{"title": "An Increment Decision Tree Algorithm for Streamed Data\n", "abstract": " Incremental (online) learning algorithms are methods for on-demand classification process from continuous streams of data. The main purpose is to deal with the classification task when original dataset is too large to process or when new instances of data arrive at any time. Moreover updating an existing model is (in many cases) much less expensive than to build a new one. This article presents a novel INEVOT algorithm for incremental decision tree induction from data streams. Because INEVOT is based on Evolutionary Algorithm it is possible to optimize different objectives at the same time. The experimental results indicate that proposed algorithm is powerful and promising. Provided solution can be easily adapted to nonstationary data streams.", "num_citations": "1\n", "authors": ["1087"]}
{"title": "Feature selection and ensemble of regression models for predicting the protein macromolecule dissolution profile\n", "abstract": " Predicting the dissolution rate of proteins plays a significant role in pharmaceutical/medical applications. The rate of dissolution of Poly Lactic-co-Glycolic Acid (PLGA) micro- and nanoparticles is influenced by several factors. Considering all factors leads to a dataset with three hundred features, making the prediction difficult and inaccurate. Our present study consists of three phases. Firstly, dimensionality reduction techniques are applied in order to simplify the task and eliminate irrelevant and redundant attributes. Subsequently, a heterogeneous pool of several classical regression algorithms is created and evaluated. Regression algorithms in the pool are independently trained to identify the problem at hand. Finally, we test several ensemble methods in order to elevate the accuracy of the prediction. The Evolutionary Weighted Ensemble method proposed in this paper offered the lowest RMSE and significantly …", "num_citations": "1\n", "authors": ["1087"]}
{"title": "Evolutionary weighted ensemble for eeg signal recognition\n", "abstract": " Recognition of an EEG signal is a very complex but very important problem. In this paper we focus on a simplified classification problem which consists of detection finger movement based on an analysis of seven EEG sensors. The signals gathered by each sensor are subsequently classified by the respective classification algorithm, which is based on data compression and so called LZ-Complexity. To improve overall accuracy of the system, the Evolutionary Weighted Ensemble (EWE) system is proposed. The parameters of the EWE are set in a learning procedure which uses an evolutionary algorithm tailored for that purpose. To take full advantage of information returned by sensor classifiers, setting negative weights are permitted, which significantly raises overall accuracy. Evaluation of EWE and its comparison against selected traditional ensemble algorithm is carried out using empirical data consisting …", "num_citations": "1\n", "authors": ["1087"]}