{"title": "Silver ion release from antimicrobial polyamide/silver composites\n", "abstract": " Silver ion (Ag+) the versatile antimicrobial species was released in a steady and prolonged manner from a silver-filled polyamide composite system. Metallic silver powder having varying specific surface area (SSA) has been used as a resource of biocide in polyamide. Strong evidences are found showing the release of the antimicrobial species from the resulting composite upon soaking it in water due to the interaction of the diffused water molecules with the dispersed silver powder within the matrix. The Ag+ release was observed as increasing with time and concentration of the silver powder and is found to be influenced by the SSA of the silver powder, changes in the physical state of the composite specimen as a result of the water diffusion and the composite morphology. It is observed that the Ag+ release increases initially which is followed by a marginal increase between day 4 and 6. Composites containing …", "num_citations": "835\n", "authors": ["1205"]}
{"title": "Survival outcomes for patients with metastatic triple-negative breast cancer: implications for clinical practice and trial design\n", "abstract": " BackgroundClinical experience suggests that many women with triple-negative metastatic breast cancer (MBC) relapse quickly. This has implications for clinical practice and trial design. We evaluated the duration of first-, second-, and third-line chemotherapy as a surrogate for duration of treatment response.Patients and MethodsWe performed a retrospective multicenter chart review of patients with triple-negative MBC receiving palliative chemotherapy. Primary outcome was duration of palliative chemotherapy, and secondary outcome was to identify prognostic variables.ResultsA total of 111 patients were analyzed. Median age at diagnosis was 51 years (range, 26–82 years). Fourteen percent of patients presented with MBC. Twenty-seven percent received neoadjuvant chemotherapy, and 48% received adjuvant chemotherapy. Median distant disease-free interval (DDFI) was 18 months (range, 0–172 months). At …", "num_citations": "432\n", "authors": ["1205"]}
{"title": "Multi-instance multi-label learning\n", "abstract": " In this paper, we propose the MIML (Multi-Instance Multi-Label learning) framework where an example is described by multiple instances and associated with multiple class labels. Compared to traditional learning frameworks, the MIML framework is more convenient and natural for representing complicated objects which have multiple semantic meanings. To learn from MIML examples, we propose the MimlBoost and MimlSvm algorithms based on a simple degeneration strategy, and experiments show that solving problems involving complicated objects with multiple semantic meanings in the MIML framework can lead to good performance. Considering that the degeneration process may lose information, we propose the D-MimlSvm algorithm which tackles MIML problems directly in a regularization framework. Moreover, we show that even when we do not have access to the real objects and thus cannot capture …", "num_citations": "428\n", "authors": ["1205"]}
{"title": "Extraction of ginger (Zingiber officinale Roscoe) oleoresin with CO2 and co-solvents: a study of the antioxidant action of the extracts\n", "abstract": " The effects of temperature, pressure and the addition of co-solvent (ethanol (EtOH) and isopropyl alcohol (IsoC3), both at 1.17% (mass)) on the kinetics of extraction of ginger oleoresin were studied. The design used was a 2×2×3 factorial (pressure 200 and 250 bar; temperature: 25 and 35 °C; solvent: CO2, CO2+EtOH, CO2+IsoC3). The experimental setup used was a fixed bed extractor with diameter of 2.76×10−2 m and length of 0.387 m. The assays were carried out at a mean solvent flow rate of 5.86×10−5 kg/s and with a bed apparent density of 350 kg/m3. The identification of the substances present in the oleoresin was performed by GC-MS; GC-FID was used to determine the ginger extract compositions. The antioxidant activity of the extract fractions was determined using the coupled oxidation of linolenic acid and β-carotene. The results show that the temperature and the interaction of the pressure and the …", "num_citations": "334\n", "authors": ["1205"]}
{"title": "A probabilistic seismic hazard map of India and adjoining regions\n", "abstract": " This paper presents the results of an exercise carried out under GSHAP, over India and adjoining regions bound by 0°N-40°N and 65°E-100°E. A working catalogue of main shocks was prepared by merging the local catalogues with the NOAA catalogue, and removing duplicates, aftershocks and earthquakes without any magnitude. Eighty six potential seismic source zones were delineated based on the major tectonic features and seismicity trends. Using the probabilistic hazard assessment approach of McGuire, adopted by GSHAP, the Peak Ground Accelerations (PGA) were computed for 10% probability of exceedance in 50 years, at locations defined by a grid of 0.5° x 0.5°. Since no reliable estimates of attenuation values are available for the Indian region, the attenuation relation of Joyner and Boore (1981) was used. The PGA values over the grid points were contoured to obtain a seismic hazard map. The hazard map depicts that a majority of the Northern Indian plate boundary region and the Tibetan plateau region have hazard level of the order of 0.25 g with prominent highs of the order of 0.35-0.4 g in the seismically more active zones like the Burmese arc, Northeastern India and Hindukush region. In the Indian shield, the regional seismic hazard, covering a major area, is of the order of 0.05-0.1 g whereas some areas like Koyna depict hazard to the level of 0.2 g. The present map can be converted into a conventional seismic zoning map having four zones with zone factors of 0.1 g, 0.2 g, 0.3 g and 0.4 g respectively.", "num_citations": "248\n", "authors": ["1205"]}
{"title": "Polyamide/silver antimicrobials: effect of filler types on the silver ion release\n", "abstract": " The efficiency of various silver‐based antimicrobial fillers (elementary silver and silver substituted materials) in polyamide (PA) toward their silver ion (Ag+) release characteristics in an aqueous medium was investigated and discussed. Anode stripping voltammetry (ASV) was used for the quantitative estimation of Ag+ release from these composites. The biocidal (Ag+) release from the composites was found to be dependent on the time of soaking in water and the nature of the filler. The long‐term Ag+ release capability of the elementary silver‐based PA/Ag composite is promising compared with the commercial counterparts. The silver ion release potential of polyamide composites where the silver filling was performed by using supercritical carbon dioxide (scCO2) is also discussed. The composites release Ag+ at a concentration level capable of rendering antimicrobial efficacy and proved to be active against the …", "num_citations": "207\n", "authors": ["1205"]}
{"title": "Electronic discovery systems and workflow management method\n", "abstract": " Various systems and methods for managing electronic discovery are provided. In one example, a method for facilitating a cross-team, role-based workflow for task management on a computing device comprises sending a project request to a business coordinator, the project request received from a legal/compliance team member, assigning work required by the project request to a discovery coordinator based on input received from the business coordinator, and performing the work required by the project request by assigning one or more projects to one or more collection/preservation teams based on input received from the discovery coordinator.", "num_citations": "171\n", "authors": ["1205"]}
{"title": "Perfluorocyclobutyl copolymers for microphotonics\n", "abstract": " The copolymerization of aryl bis‐ and tris‐trifluorovinyl ether monomers yields aromatic perfluorocyclobutyl (PFCB) polymers, via thermally initiated step‐growth cycloaddition chemistry. PFCB polymers and their copolymers enjoy a unique combination of attributes well suited for applications in photonic technologies, such as broad tailorability of refractive indices and thermo‐optic coefficients, low transmission losses at 1300 and 1550 nm, high thermal, mechanical, and optical stability, and excellent melt and solution processability. Planar PFCB structures can be processed by direct micro‐transfer molding, which is a first step towards rapid soft‐lithographic fabrication of polymer planar lightwave circuits. Copolymerization chemistry and processing parameters and characterization, including thermal (Tg = 120–350 °C) and optical properties (refractive indices from 1.443 to 1.508 at 1550 nm; thermo‐optic …", "num_citations": "169\n", "authors": ["1205"]}
{"title": "Ankle arthrodesis for failed total ankle replacement\n", "abstract": " Between 1999 and 2005, 23 failed total ankle replacements were converted to arthrodeses. Three surgical techniques were used: tibiotalar arthrodesis with screw fixation, tibiotalocalcaneal arthrodesis with screw fixation, and tibiotalocalcaneal arthrodesis with an intramedullary nail. As experience was gained, the benefits and problems became apparent. Successful bony union was seen in 17 of the 23 ankles. The complication rate was higher in ankles where the loosening had caused extensive destruction of the body of the talus, usually in rheumatoid arthritis. In this situation we recommend tibiotalocalcaneal arthrodesis with an intramedullary nail. This technique can also be used when there is severe arthritic change in the subtalar joint. Arthrodesis of the tibiotalar joint alone using compression screws was generally possible in osteoarthritis because the destruction of the body of the talus was less extensive …", "num_citations": "166\n", "authors": ["1205"]}
{"title": "Anti-nutritional factors in forage legumes.\n", "abstract": " We collect your name, email address, institutional affiliation and login credentials. We use this information to provide you with access to the My CABI service, to provide you with technical or product support, and to keep the service working securely.We may also use digital footprint connection information such as your IP address and other technical identifiers, to collect usage data, click stream data, and information about the pages you visited and searched, to analyse usage for the purpose of enhancing and improving our service.", "num_citations": "165\n", "authors": ["1205"]}
{"title": "Partitioning of dry matter during drought stress in rainfed lowland rice\n", "abstract": " Productivity of rice (Oryza sativa L.) in the rainfed lowlands depends not only on accumulation of dry matter, but also on its effective partitioning to grain. Partitioning of dry matter should be particularly important in such drought-prone environments, where dry matter production may be restricted. With late-season drought, an enhanced capacity to allocate dry matter to grain under water-deficit conditions should be advantageous. Field studies on dry matter partitioning under drought were conducted at eight locations in Chattisgarh, India, between 1995 and 1998, using five diverse rice cultivars. Dry matter accumulation at flowering and maturity was significantly reduced in drought-affected sites. Variation was observed among cultivars in dry matter partitioning to grain under both favorable and water-stressed conditions. Drought stress at the reproductive stage significantly increased the dry matter partitioning from …", "num_citations": "155\n", "authors": ["1205"]}
{"title": "A truncated mutant (residues 58-140) of the hepatitis B virus X protein retains transactivation function\n", "abstract": " The hepatitis B virus X protein (HBx) sequence (154 aa) has been divided into six regions (A-F) based on its sequence homology with X proteins of other mammalian hepadnaviruses. Regions A, C, and E are more conserved and include all the four conserved cysteines (C7, C61, C69, and C137). To localize the regions of HBx important for transactivation, a panel of 10 deletion mutants (X5-X14) and 4 single point mutants (X1-X4), each corresponding to a conserved cysteine residue, was constructed by site-directed mutagenesis. A HBx-specific monoclonal antibody was developed and used to confirm the expression of mutants by Western blot. Transactivation property of the HBx mutants was studied on Rous sarcoma virus-long terminal repeat (RSV-LTR) in transient transfection assays. We observed that deletion of the most conserved region A or substitution of the N-terminal cysteine (C7) had no effect on …", "num_citations": "151\n", "authors": ["1205"]}
{"title": "Review on TiC reinforced steel composites\n", "abstract": " Particulate reinforced ferrous-based metal matrix composites exhibit both excellent wear and cutting properties, and can give significant cost reductions over existing materials used in heavy wear applications. This paper reviews the current status of literature on titanium carbide–reinforced steel matrix composites and looks into the different types and methods of reinforcements being used, together with other alternative processing routes. Mechanical properties such as elastic modulus, low and high temperature strengths and wear properties are discussed as a function of the volume fraction of reinforcement. The review concludes by underlining the importance of further research in some critical areas to fully realize the industrial potential of these composites.", "num_citations": "145\n", "authors": ["1205"]}
{"title": "Air quality monitoring system based on IoT using Raspberry Pi\n", "abstract": " Air pollution is the largest environmental and public health challenge in the world today. Air pollution leads to adverse effects on Human health, climate and ecosystem. Air is getting polluted because of release of Toxic gases by industries, vehicular emissions and increased concentration of harmful gases and particulate matter in the atmosphere. Particulate matter is one of the most important parameter having the significant contribution to the increase in air pollution. This creates a need for measurement and analysis of real-time air quality monitoring so that appropriate decisions can be taken in a timely period. This paper presents a real-time standalone air quality monitoring system which includes various parameters: PM 2.5, carbon monoxide, carbon dioxide, temperature, humidity and air pressure. Internet of Things is nowadays finding profound use in each and every sector, plays a key role in our air quality …", "num_citations": "143\n", "authors": ["1205"]}
{"title": "Macrophage polarization and allergic asthma\n", "abstract": " Allergic asthma is associated with airway inflammation and airway hyperresponsiveness. Macrophage polarization has been shown to have a profound impact on asthma pathogenesis. On exposure to local microenvironments, recruited macrophages can be polarized into either classically activated (or M1) or alternatively activated (or M2) phenotypes. Macrophage polarization has been heavily associated with development of asthma. The process of regulation of macrophage polarization involves an intricate interplay between various cytokines, chemokines, transcriptional factors, and immune-regulatory cells. Different signals from the microenvironment are controlled by different receptors on the macrophages to initiate various macrophage polarization pathways. Most importantly, there is an increased attention on the epigenetic changes (eg, microRNAs, DNA methylation, and histone modification) that impact …", "num_citations": "142\n", "authors": ["1205"]}
{"title": "Data integrity proofs in cloud storage\n", "abstract": " Cloud computing has been envisioned as the de-facto solution to the rising storage costs of IT Enterprises. With the high costs of data storage devices as well as the rapid rate at which data is being generated it proves costly for enterprises or individual users to frequently update their hardware. Apart from reduction in storage costs data outsourcing to the cloud also helps in reducing the maintenance. Cloud storage moves the user's data to large data centers, which are remotely located, on which user does not have any control. However, this unique feature of the cloud poses many new security challenges which need to be clearly understood and resolved. One of the important concerns that need to be addressed is to assure the customer of the integrity i.e. correctness of his data in the cloud. As the data is physically not accessible to the user the cloud should provide a way for the user to check if the integrity of his …", "num_citations": "142\n", "authors": ["1205"]}
{"title": "Metabolites in plants and its classification.\n", "abstract": " see more details, development, stress adaptation, and defense. Besides the importance for the plant itself, such metabolites determine the nutritional quality of food, colour, taste, smell, antioxidative, anticarcinogenic, antihypertension, anti-inflammatory, antimicrobial, immunostimulating, and cholesterol-lowering properties. Secondary metabolites secondary metabolites Subject Category: Chemicals and Chemical Groupssee more details are organic molecules that are not involved in the normal growth and development of an organism. While primary metabolites have a key role in survive of the species, playing an active function in the photosynthesis photosynthesis Subject Category: Natural Processes", "num_citations": "125\n", "authors": ["1205"]}
{"title": "Blending roulette wheel selection & rank selection in genetic algorithms\n", "abstract": " Both exploration and exploitation are the techniques employed normally by all the optimization techniques. In genetic algorithms, the roulette wheel selection operator has essence of exploitation while rank selection is influenced by exploration. In this paper, a blend of these two selection operators is proposed that is a perfect mix of both ie exploration and exploitation. The blended selection operator is more exploratory in nature in initial iterations and with the passage of time, it gradually shifts towards exploitation. The proposed solution is implemented in MATLAB using travelling salesman problem and the results were compared with roulette wheel selection and rank selection with different problem sizes.", "num_citations": "125\n", "authors": ["1205"]}
{"title": "SEM observations of the effects of velocity and load on the sliding wear characteristics of glass fabric–epoxy composites with different fillers\n", "abstract": " The slide wear characteristics of a glass–epoxy (G–E) composite, filled with either rubber or oxide particles, were studied using a block-on-roller test configuration. Mass loss was determined as a function of sliding distance for sliding velocity between 0.5 and 1.5 m/s at three different loads of 42, 140 and 190 N. The worn surfaces were also examined by scanning electron microscopy (SEM). The study showed differing trends with load for the two types of fillers. At low loads, the oxide-filled had lower wear, while at high loads the rubber-filled composite had lower wear. The work also showed that higher loads and sliding velocities bring about changes in worn surface features such as interface separation, inclined fracture of fibres, loss of matrix as well as the appearance of debris with the two different fillers.", "num_citations": "125\n", "authors": ["1205"]}