{"title": "Method and apparatus for document verification and tracking\n", "abstract": " A document processing system in which a server subsystem stores information corresponding to a document containing human readable and machine readable information and a client subsystem receives the document and interprets the machine readable information. The client subsystem contacts the server to verify validity of information in the document using a communications network that allows information to be exchanged between the server and the client.", "num_citations": "426\n", "authors": ["896"]}
{"title": "System and method for providing vehicle context information\n", "abstract": " An infotainment system is provided which efficiently manages and provides for the availability of information onboard a vehicle. The infotainment system includes an infogas agent for acquiring information from an external source. The infotainment system further includes a context-based delivery system for delivering context-based information. The context-based information includes a vehicle context advisor for monitoring and storing information relative to vehicle devices and services available on the vehicle. The context advisor further includes a personalization context advisor for monitoring and storing personalization information made available to devices and services onboard the vehicle. The context advisor further includes an environmental context advisor for monitoring and storing environmental information made available to devices and services onboard the vehicle.", "num_citations": "377\n", "authors": ["896"]}
{"title": "Converting documents, with links to other electronic information, between hardcopy and electronic formats\n", "abstract": " A conversion method and apparatus that allows for converting a hardcopy document into a hyperdocument and vice versa. During hardcopy to hyperdocument conversion, hypertext information stored on the hardcopy document is used to set up links to other documents. During hyperdocument to hardcopy document conversion, hypertext link information is encoded and stored on the hardcopy document.", "num_citations": "214\n", "authors": ["896"]}
{"title": "System and method of providing personalized context information for vehicle\n", "abstract": " An infotainment system is provided which efficiently manages and provides for the availability of information onboard a vehicle. The infotainment system includes an infogas agent for acquiring information from an external source. The infotainment system further includes a context-based delivery system for delivering context-based information. The context-based information includes a vehicle context advisor for monitoring and storing information relative to vehicle devices and services available on the vehicle. The context advisor further includes a personalization context advisor for monitoring and storing personalization information made available to devices and services onboard the vehicle. The context advisor further includes an environmental context advisor for monitoring and storing environmental information made available to devices and services onboard the vehicle.", "num_citations": "211\n", "authors": ["896"]}
{"title": "Facial feature extraction method and apparatus for a neural network acoustic and visual speech recognition system\n", "abstract": " A facial feature extraction method and apparatus uses the variation in light intensity (gray-scale) of a frontal view of a speaker's face. The sequence of video images are sampled and quantized into a regular array of 150× 150 pixels that naturally form a coordinate system of scan lines and pixel position along a scan line. Left and right eye areas and a mouth are located by thresholding the pixel gray-scale and finding the centroids of the three areas. The line segment joining the eye area centroids is bisected at right angle to form an axis of symmetry. A straight line through the centroid of the mouth area that is at right angle to the axis of symmetry constitutes the mouth line. Pixels along the mouth line and the axis of symmetry in the vicinity of the mouth area form a horizontal and vertical gray-scale profile, respectively. The profiles could be used as feature vectors but it is more efficient to select peaks and valleys …", "num_citations": "201\n", "authors": ["896"]}
{"title": "Visionary speech: Looking ahead to practical speechreading systems\n", "abstract": " We present an overview of speechreading systems, paying particular attention to the various approaches to key design decisions and the benefits and drawbacks of each. Our own speechreading efforts have centered on the use of Hidden Markov Models, and, for feature extraction, de-formable templates. We have explored several sensory integration schemes — early, late, and a novel intermediate method made possible by a new learning method, called Boltzmann zippers. We describe several possible practical applications of speechreading systems, and conclude with a list of important outstanding problems.", "num_citations": "178\n", "authors": ["896"]}
{"title": "Low-power 4-2 and 5-2 compressors\n", "abstract": " This paper explores various low power higher order compressors such as 4-2 and 5-2 compressor units. These compressors are building blocks for binary multipliers. Various circuit architectures for 4-2 compressors are compared with respect to their delay and power consumption. The different circuits are simulated using HSPICE. A new circuit for a 5-2 compressor is then presented which is 12% faster and consumes 37% less power.", "num_citations": "158\n", "authors": ["896"]}
{"title": "Using deformable templates to infer visual speech dynamics\n", "abstract": " The visual image of a talker provides information complementary to the acoustic speech waveform, and enables improved recognition accuracy, especially in environments corrupted by high acoustic noise or multiple talkers. Because most of the phonologically relevant visual information is from the mouth and lips, it is important to infer accurately and robustly their dynamics; moreover it is desirable to extract this information without the use of invasive markers or patterned illumination. We describe the use of deformable templates for speechreading, in order to infer the dynamics of lip contours throughout an image sequence. Template computations can be done relatively quickly and the resulting small number of shape description parameters are quite robust to visual noise and variations in illumination. Such templates delineate the inside of the mouth, so that the teeth and the tongue can also be found.< >", "num_citations": "154\n", "authors": ["896"]}
{"title": "Telematics system and method for traction reporting and control in a vehicle\n", "abstract": " In one embodiment, a system and method are provided for detecting a slip condition between a vehicle tire and a road surface, processing contemporaneous vehicle data, such as torque or brake pressure applied, to determine a force of friction, and calculating a coefficient of friction. The coefficient of friction and location of the slip are broadcast to other vehicles driving in the proximity of the slip. The broadcasts may be utilized to notify drivers of slippery driving conditions at or ahead of the vehicle, and/or to limit torque and braking pressure applied to vehicle wheels to enhance traction and avoid slip.", "num_citations": "144\n", "authors": ["896"]}
{"title": "Method and system for maintaining personalization of user adjustable features\n", "abstract": " A system and method are provided for selectively setting one or more variable vehicle operating parameters or features by storing information representative of user/driver preferences on a portable information storage device, and later recalled to automatically adjust the same or other system or device to the same setting (s). Examples of such systems or devices includes seat position, mirrors, radio presets, climate control settings, Web sites, bookmarks, and mobile telephone presets. The personalized “settings” are thus available to be transported and transferred where desired by the possessor of the device.", "num_citations": "102\n", "authors": ["896"]}
{"title": "Context-based service delivery system and method\n", "abstract": " An infotainment system is provided which efficiently manages and provides for the availability of information onboard a vehicle. The infotainment system includes an infogas agent for acquiring information from an external source. The infotainment system further includes a context-based delivery system for delivering context-based information. The context-based information includes a vehicle context advisor for monitoring and storing information relative to vehicle devices and services available on the vehicle. The context advisor further includes a personalization context advisor for monitoring and storing personalization information made available to devices and services onboard the vehicle. The context advisor further includes an environmental context advisor for monitoring and storing environmental information made available to devices and services onboard the vehicle.", "num_citations": "84\n", "authors": ["896"]}
{"title": "Lipreading by neural networks: Visual preprocessing, learning, and sensory integration\n", "abstract": " We have developed visual preprocessing algorithms for extracting phonologically relevant features from the grayscale video image of a speaker, to provide speaker-independent inputs for an automatic lipreading (\" speechreading\") system. Visual features such as mouth open/closed, tongue visible/not-visible, teeth visible/notvisible, and several shape descriptors of the mouth and its motion are all rapidly computable in a manner quite insensitive to lighting conditions. We formed a hybrid speechreading system consisting of two time delay neural networks (video and acoustic) and integrated their responses by means of independent opinion pooling-the Bayesian optimal method given conditional independence, which seems to hold for our data. This hybrid system had an error rate 25% lower than that of the acoustic subsystem alone on a five-utterance speaker-independent task, indicating that video can be used to improve speech recognition.", "num_citations": "82\n", "authors": ["896"]}
{"title": "Method and apparatus for context adaptive multimedia management\n", "abstract": " In a first illustrative embodiment, a computer implemented method includes detecting a plurality of context providing devices accessible to a vehicle computing system. The illustrative method further includes evaluating context relevant information from each of the detected devices to compile a display. The illustrative method also includes outputting a compiled display to a vehicle display, including at least one portion of the display initially dedicated to vehicle-based service content and at least one portion of the display dedicated to content from a context providing device.", "num_citations": "76\n", "authors": ["896"]}
{"title": "Control, computing and communications: technologies for the twenty-first century model T\n", "abstract": " In the early twentieth century, the Model T Ford defined the desirable, affordable automobile, enabled by new technologies in mechanics, materials, and manufacturing. Control, computing, communications, and the underlying software are the technologies that will shape the personal mobility experience of the twenty-first century. While the Model T was self-contained, the external reach of wireless communication technologies will define the boundaries of the twenty-first century automobile, which will be only one component in a large intelligent transportation infrastructure. This paper reviews advances in control for safety, fuel economy and reduction of tailpipe emissions, and new directions in computing, communication and software, including the interaction of the automobile with consumer electronic devices and the intelligent transportation infrastructure", "num_citations": "76\n", "authors": ["896"]}
{"title": "Method and Apparatus for Mobile Mesh Network Vehicular Software Updating\n", "abstract": " A computer implemented method includes wirelessly receiving data from a proximate vehicle computing system, the data comprising at least a portion of a complete software process. The method also includes storing the received data and evaluating whether the stored data, in conjunction with any previously stored data, constitutes the entire complete software process. The method further includes executing the entire complete software process, conditional on the evaluating.", "num_citations": "73\n", "authors": ["896"]}
{"title": "Security issues and security algorithms in cloud computing\n", "abstract": " Cloud Computing is the use of activity of using Computer hardware and software. Cloud Computing is a set of IT Services that are provided to a customer over a network and these services are delivered by third party provider who owns the infrastructure. It is often provided\" as a service\" over the Internet, typically in the form of infrastructure as a service (IaaS), platform as a service (PaaS), or software as a service (SaaS). This paper describes about the different security algorithms, security issues and security attacks in cloud computing.", "num_citations": "73\n", "authors": ["896"]}
{"title": "System and method of providing environmental context information for vehicle\n", "abstract": " An infotainment system is provided which efficiently manages and provides for the availability of information onboard a vehicle. The infotainment system includes an infogas agent for acquiring information from an external source. The infotainment system further includes a context-based delivery system for delivering context-based information. The context-based information includes a vehicle context advisor for monitoring and storing information relative to vehicle devices and services available on the vehicle. The context advisor further includes a personalization context advisor for monitoring and storing personalization information made available to devices and services onboard the vehicle. The context advisor further includes an environmental context advisor for monitoring and storing environmental information made available to devices and services onboard the vehicle.", "num_citations": "56\n", "authors": ["896"]}
{"title": "System and method for a human machine interface\n", "abstract": " A vehicle computer system comprising a wireless transceiver configured to send a nomadic device human machine interface to a nomadic device in a web browser format. The vehicle computer system further comprises a vehicle server utilizing a contextual data aggregator that utilizes vehicle data and off-board data to generate a dynamic human machine interface, the server further configured to generate an in-vehicle human machine interface for output on a vehicle display and generate the nomadic device human machine interface for the nomadic device to display.", "num_citations": "55\n", "authors": ["896"]}
{"title": "Productivity, quality and business performance: an empirical study\n", "abstract": " PurposeThe purpose of this paper is to empirically investigate linkage among productivity, quality, and business performance in home-based brassware units in India.Design/methodology/approachThis study involved action research of home-based brassware units applying procedures for three-stage least-squares (3SLS) regression analysis, with data obtained through questionnaire survey based on convenience sampling.FindingsThis study has supported the established belief that quality leads to productivity, and subsequently productivity leads to better business performance for home-based brassware units in India. The consistent and logical result of this study using 3SLS regression analysis has provided empirical understanding of the appropriate linkage among productivity, quality, and business performance.Research limitations/implicationsThis study has limitations of findings, as it studied the home-based …", "num_citations": "52\n", "authors": ["896"]}
{"title": "Method and system for vehicle refueling\n", "abstract": " Methods and systems are provided for facilitating refueling operations in vehicles operating with multiple fuels. A vehicle operator may be assisted in refueling the multiple fuel tanks of the vehicle by being provided one or more refueling profiles that take into account the vehicle's future trip plans, the predicted environmental conditions along a planned route, and the operator's preferences.", "num_citations": "50\n", "authors": ["896"]}
{"title": "Scanning advances in aerospace & automobile software technology\n", "abstract": " Some of the distinct attributes of Aerospace and Automobile Software Technologies are briefly reviewed in this article as a way of placing in collective-context the detailed technical papers that form this exciting special issue. A historical context, a unifying architectural perspective and, the rapidly changing and defining role of software is presented, especially as we look ahead to this new decade in this still young century.", "num_citations": "48\n", "authors": ["896"]}
{"title": "Speaker recognition using spatiotemporal cues\n", "abstract": " A speaker recognition method uses visual image representations of mouth movements associated with the generation of an acoustic utterance by a speaker that is the person to be recognized. No acoustic data is used and normal ambient lighting conditions are used. The method generates a spatiotemporal gray-level function representative of the spatiotemporal inner month area confined between the lips during the utterance from which a cue-block is generated that isolates the essential information from which a feature vector for recognition is generated. The feature vector includes utterance duration, maximum lip-to-lip separation, and location in time, or speed of lip movement opening, speed of lip movement closure, and a spatiotemporal area measure representative of the area enclosed between the lips during the utterance and representative of the frontal area of the oral cavity during the utterance …", "num_citations": "43\n", "authors": ["896"]}
{"title": "System and method of providing location and time related information to a vehicle\n", "abstract": " An infotainment system is provided which efficiently manages and provides for the availability of information onboard a vehicle. The infotainment system includes an infogas agent for acquiring information from an external source. The infotainment system further includes a context-based delivery system for delivering context-based information. The context-based information includes a vehicle context advisor for monitoring and storing information relative to vehicle devices and services available on the vehicle. The context advisor further includes a personalization context advisor for monitoring and storing personalization information made available to devices and services onboard the vehicle. The context advisor further includes an environmental context advisor for monitoring and storing environmental information made available to devices and services onboard the vehicle.", "num_citations": "41\n", "authors": ["896"]}
{"title": "Multimodal conversational systems for automobiles\n", "abstract": " SpeechWorks2 and Ford designed and realized a prototype targeted at relaxing the limitations of the current systems by adopting a conversational speech interface coupled with a touchscreen display. The system, which controls vehicle functions such as climate, telephone, navigation, MP3 player, and personalization, was installed in the Ford Model U concept vehicle and first shown at the 2003 North American International Auto Show in Detroit. Figure 1 shows an image of the actual car interior where the touch-screen interface is visible on the dashboard. Figure 2 shows a depiction of the GUI in one of its various configurations.", "num_citations": "41\n", "authors": ["896"]}
{"title": "A multimodal conversational interface for a concept vehicle\n", "abstract": " This paper describes a prototype of a conversational system that was implemented on the Ford Model U Concept Vehicle and first shown at the 2003 North American International Auto Show in Detroit. The system, including a touch screen and a speech recognizer, is used for controlling several non-critical automobile operations, such as climate, entertainment, navigation, and telephone. The prototype implements a natural language spoken dialog interface integrated with an intuitive graphical user interface, as opposed to the traditional, speech only, command-and-control interfaces deployed in some of the vehicles currently on the market.", "num_citations": "34\n", "authors": ["896"]}
{"title": "Telematics computer system and method for mobile wireless retail order processing and fulfillment\n", "abstract": " A method for making a purchase using a vehicle computing system includes receiving input to the vehicle computing system instructing order initiation. The method also includes receiving a selection at the vehicle computing system of a merchant from which to order. The method further includes receiving an order at the vehicle computing system, determining an address of the merchant to which the order was placed and providing directions to the address. These can be provided as, for example, turn by turn directions spoken and/or displayed on a nav display. Finally, the exemplary method includes processing a payment for the order.", "num_citations": "33\n", "authors": ["896"]}
{"title": "Scanning advanced automobile technology\n", "abstract": " This introductory article overviews the progress of electrical, electronics, software, and other relevant technologies that shape the modern automobile. Some of these technologies are described in more detail in the articles that comprise this special issue", "num_citations": "32\n", "authors": ["896"]}
{"title": "Service-based software development for automotive applications\n", "abstract": " Software development for the automotive domain is currently subject to a silent revolution. On the one hand, software has become the enabling technology for almost all safety-critical and comfort functions offered to the customer: Cars have evolved into distributed computing platforms, which host dozens of networked and interacting processors, implementing hundreds of software-enabled features. On the other hand, the complexity induced by this large number of functions, their interactions, and their supporting infrastructure is becoming the limiting factor for automotive software development. Industry standards, including OSGi [1] and AMI-C [2], address these issues by introducing service-based software-architectures and corresponding middleware layers as modeling and deployment abstractions. This marks a significant shift from component-to service-oriented software development in the automotive domain. As …", "num_citations": "32\n", "authors": ["896"]}
{"title": "Preprocessing video images for neural learning of lipreading\n", "abstract": " We present new procedures for preprocessing video images for automatic lipreading applications. Prepro-cessing consists of first detecting the region of interest (ROl) using the eyes, nostrils and mouth followed by estimating salient features within the ROl. Our algorithms for ROT detection employ a low-pass Gaussian filter followed by a gray level thresholding and are talker invariant and quite robust to variations in overall head size, orientation and lighting conditions. Subsequent feature extraction is based on both spatial and temporal information associated with luminance histogram profiles within the ROT. For instance, the tongue tip (eg, in/la/) is detected by counting changes in the number of minima in the luminance profile of a vertical band passing over the mouth region. A neural system learns hidden unit representations which encode predictive groupings of these features. Even though our overall system …", "num_citations": "32\n", "authors": ["896"]}
{"title": "Method and Apparatus for Preferential Determination and Display of Points of Interest\n", "abstract": " A method and apparatus for preferential determination and display of points of interest are provided. The points of interest can be determined based on a variety of non-proximity based factors, including, but not limited to, time of day, temperature, etc. The automatically determined points of interest can then be displayed for a user on a display associated with a vehicle-based computing system. Advertisements may also be selected and displayed based on incoming signals, and points of interest associated with displayed advertisements may be displayed.", "num_citations": "30\n", "authors": ["896"]}
{"title": "Reverse engineering: point cloud generation with CMM for part modeling and error analysis\n", "abstract": " From many decades reverse engineering (RE) has been used to make duplicate parts and part drawing prints in military and defence sectors. Scientific literature presents many different approaches for implementation of reverse engineering. Most of the studies are based on the analysis of point clouds acquired through coordinate measuring devices, such as, Coordinate Measuring Machines (CMMs), Optical Scanners or Interferometric Systems [2]. In recent years, the development of computer technology resulted in the integration of design and manufacturing systems and automated inspection/gauging systems in manufacturing engineering applications. Geometrical information of a product is obtained directly from a physical shape by a digitizing device, from this complete 5-axis tool-path is obtained [1]. Duplicating the part is done with the help of CMM and CAD/CAM software like Mastercam, ProEngineer etc. CMM is used to digitize the mechanical object. Taking coordinates (scan data) of the various points on the surface of the object and converting it into IGES file and using the same in the CAD/CAM software with required interfacing creates a surface or solid model of the object. Finally this solid model is used to generate CNC part program to manufacture the part on CNC Machining center.", "num_citations": "30\n", "authors": ["896"]}
{"title": "Effect of bio-fertilizers on growth and productivity of wheat (Triticum aestivum)\n", "abstract": " Field experiment was conducted during the rabi season of 2003–04 and 2004–05 at the farmer fields in village Bhiuraha, district Jaunpur to study the efficacy of bio-ertilizers on growth and productivity of wheat (Triticum aestivum). Leaf and shoot dry weight increased up to 90 days after sowing (DAS) and then gradually declined. Shoot dry weight also gradually increased up to 120 DAS and then decreased. However, dry matter in panicle increased rapidly from 120 DAS till harvesting. At early stage (30–60 DAS), dry matter production was slow and the rate of dry matter accumulation increased from 60 DAS onwards. About 21.5 per cent of dry matter of whole plant was observed at 60 DAS, 61.2 per cent at 90 DAS and 94.4 per cent at 120 DAS. The result showed significant response of bio-fertilizers on growth and productivity of wheat. Combined application of biofertilizers caused considerable increase in plant …", "num_citations": "29\n", "authors": ["896"]}
{"title": "Method and system for controlling a motive power system of an automotive vehicle\n", "abstract": " Environment conditions expected to be encountered by a vehicle are used as inputs in determining operating modes of a motive power system of a plug-in hybrid electric vehicle. A vehicle operating in charge depleting mode may transition to operate in charge sustaining mode if the vehicle is expected to encounter circumstances where it is desirable to allow the vehicle to more quickly respond to sudden requests for torque.", "num_citations": "28\n", "authors": ["896"]}
{"title": "The last inch at 70 miles per hour\n", "abstract": " More recently, personal area network connectivity in vehicles has evolved, bringing with it a new set of challenges and associated opportunities. Principal among these challenges is the last-inch problem. The telecommunications industry uses the term \"last mile\" to refer to the challenge of bringing high-bandwidth connectivity to individual homes. We use the term \"last inch\" to characterize the challenges of delivering computing services through in-vehicle human-machine interfaces (HMIs) to users who are sometimes driving at speeds upwards of 70 miles per hour. We focus on the nonfunctional requirements of security, privacy, usability, and reliability (SPUR)). These attributes both encompass safety concerns and offer insight into the consumer experience. We took the SPUR requirements into account in designing our vehicle consumer services interface (VCSI), a service-oriented middleware architecture that we …", "num_citations": "28\n", "authors": ["896"]}
{"title": "Exploring How Engineering Internships and Undergraduate Research Experiences Inform and Influence College Students’ Career Decisions and Future Plans.\n", "abstract": " Does engagement in high impact practices such as technical internships and undergraduate research influence engineering students’ career decisions and future plans? And how is learning that comes from these high impact practices related to “school learning”? These high impact educational practices have been shown to increase the rates of student engagement and retention in higher education. While access to and participation in these activities is often unsystematic across various institutions, these practices have been shown to benefit college students with diverse backgrounds and learner qualities. This paper establishes a context for understanding the characteristics and attitudes of students who participate in internships and undergraduate research by drawing from analyses of the first administration of the Engineering Majors Survey (EMS), a longitudinal study designed to examine engineering students’ career objectives related to creativity and innovation, and the experiences and attitudes that might influence those goals. In addition, using interview data from product development interns at a single engineering firm, we add insights into the specific skills that interns identify as learning in their internship and suggest connections between school-and-work learning. The more general picture of the impact of internship and research experiences (from the EMS), complemented with a “deep dive” into the learning that happens in internship experiences (from the interviews) provides a solid starting point for future exploration of how high impact practices such as internships and research experiences might be better integrated into a student …", "num_citations": "27\n", "authors": ["896"]}
{"title": "System and method for wellness monitoring in a vehicle\n", "abstract": " A vehicle-based system interfaces with at least one wellness device to track and monitor various aspects of user wellness. The aspects include, but are not limited to, heart rate, glucose levels, distance traveled, pace, body temperature, etc. The vehicle-based system may be capable of reporting results to a remote server and to the user directly. The vehicle-based system may further be capable of recommending courses of action based on analysis of the results.", "num_citations": "26\n", "authors": ["896"]}
{"title": "An embedded architectural framework for interaction between automobiles and consumer devices\n", "abstract": " The last two and one half decades have seen rapid growth in the amount and importance of software in automobiles. This growth is bringing about a shift from treating software as a part of the hardware it controls to viewing it as an implementation of a set of services that mediate between the hardware and the functionality seen by the user. This paper describes an in-vehicle computing platform based on the software service platform to provide entertainment and information functions that has been implemented in two prototype vehicles at Ford Motor Company.", "num_citations": "26\n", "authors": ["896"]}
{"title": "Drought resistance and germplasm improvement: ongoing research of the upland rice consortium\n", "abstract": " La sécheresse est l'un des facteurs limitant le rendement du riz pluvial. La démarche du consortium est de saisir le problème au travers de l'amélioration du germplasm. La variabilité de la morphologie des racines des cultivars de riz pluvial a été étudiée sur trois sites. Les cultivars ont été classés selon un index des différents paramètres des racines. La variabilité entre et à l'intérieur d'un groupe variétal a été établi par l'étude des isozymes. Les variétés tropicales japonica et les variétés traditionnelles aus apparaissent comme de meilleures sources de germplasm. Le contrôle génétique de quelques paramètres a été réalisé en utilisant des marqueurs moléculaires sur les populations indica japonica. Les QTL identifiés pour l'enroulement des feuilles ont été comparés avec des données génétiques secondaires et avec les QTL contrôlant la morphologie des racines. D'aures orientations de recherche sont proposées par le consortium", "num_citations": "25\n", "authors": ["896"]}
{"title": "Compressed sensing for different sensors: A real scenario for WSN and IoT\n", "abstract": " Wireless Sensor Networks (WSN) are integrable basic elements of Internet of Things (IoT). WSN deployment is constrained with sensor node's energy, communication range, limited on-board resources etc. Optimization of the energy consumption over the network to improve network lifetime is a challenging problem. Compressed Sensing (CS) involvement in WSN brought a solution to energy efficient data aggregation. This article presents a method, which exploits compressed sensing and dictionary learning to achieve energy efficiency in the scenario of data aggregation in WSN, where sensor node measures different sensors data. We demonstrate performance analysis of multiple sensors method with metrics, probability of successful recovery and network transmission cost. Extensive simulations on practical data set shows that our data aggregation method for practical scenario can deliver data to sink with …", "num_citations": "24\n", "authors": ["896"]}
{"title": "Method and apparatus for encoding color information on a monochrome document\n", "abstract": " A method and apparatus for encoding color information in monochrome (black and white) documents. The present invention includes a method and apparatus to produce color documents that interprets color information stored on a document containing an image in monochrome and generates an image in color based on the color information.", "num_citations": "24\n", "authors": ["896"]}
{"title": "Three-dimensional image restoration using constrained optimization techniques\n", "abstract": " The restoration of the depth map of a three-dimensional object is formulated as an image-restoration problem. The object is modeled as an opaque discrete visible surface (DVS) in 3-D space. The projection of the radiance and depth information of the DVS onto a two-dimensional image yields an underdetermined system of equations. The 3-D imagerestoration problem seeks to recover the depth information of the DVS from the 2-D image. To uniquely specify a solution, constraints on the estimates of the DVS must be introduced. In this paper an in-focus image is used to provide radiance information. Further, the size of the problem is significantly reduced by limiting the range of possible depths to lie within a fixed interval of the depth values given by an independent coarse depth recovery method. It is shown that additional constraints on both the radiance and the geometry can easily be accommodated by the …", "num_citations": "22\n", "authors": ["896"]}
{"title": "Detection of cytochrome P450 polymorphisms in breast cancer patients may impact on tamoxifen therapy\n", "abstract": " Background:Breast cancer is the most common cancer among women worldwide. Tamoxifen (TAM), a selective estrogen receptor modulator, is widely used in its treatment. TAM is metabolized by cytochrome P450 (CYP450) enzymes, including CYP2D6, CYP3A5 and CYP2C19, whose genetic variations may have clinicopathological importance. However, reports on the association of various P450 polymorphisms with certain cancers are contradictory.Methods:We here investigated whether the prevalence of the four most common polymorphism in the CYP2D6* 4 (G1934A), CYP2D6* 10 (C188T), CYP3A5* 3 and CYP2C19* 2 alleles has any link with breast cancer using genomic DNA and polymerase chain reaction restriction fragment length polymorphism (PCR-RFLP) analysis.Results:Prevalences of CYP2D6* 4, CYP2D6* 10 and CYP2C19* 2 genotypes were differed significantly (P= 0.01 and P= 0.004 …", "num_citations": "21\n", "authors": ["896"]}
{"title": "Postharvest treatment of antioxidant reduces lenticel browning and improves cosmetic appeal of mango (Mangifera indica L.) fruits without impairing quality\n", "abstract": " The present study reports the usefulness of ascorbic acid for reducing lenticels browning (LB) in mango, which impairs the cosmetic appeal and thereby the export. Postharvest dip treatment of ascorbic acid at different concentrations (100, 150 and 200 ppm) was given to four varieties of mango (Indian—‘Dashehari’, ‘Langra’; Exotic—‘Sensation’, ‘Eldon’). After treatment, fruits were stored at ambient conditions (35 ± 4 °C and 65 ± 5 % RH) for 10 days. At the end of storage period, observations were recorded on several parameters. Our results revealed that fruits of ‘Langra’ mango exhibited 100 % LB, followed by ‘Dashehari’ (52.8 %), ‘Sensation’ (42.9 %) and ‘Eldon’ (38.3 %). All concentrations of ascorbic acid reduced the LB to greater extent and improved the cosmetic appeal of fruits of all the varieties significantly over untreated fruits but the best results were obtained with 200 ppm concentration for LB (4.8 …", "num_citations": "21\n", "authors": ["896"]}
{"title": "Automatic speech recognition system using acoustic and visual signals\n", "abstract": " Automatic speech-reading systems use both acoustic and visual signals to perform speech recognition. In previous work, we have shown how visual speech can improve recognition accuracy of automatic speech recognition and have described an algorithm based on deformable templates that accurately infers lip dynamics. In this paper we present a complete speech-reading system, which is able to record an utterance using a standard color video camera, preprocess both the audio and video signal, and perform speech recognition. This system is based on new algorithms for finding the talker's face and mouth and an improved template algorithm for tracking the lips. We will also compare the results from our new system with our previous work and discuss various strategies for integration of the two modalities.", "num_citations": "21\n", "authors": ["896"]}
{"title": "Quality, productivity and business performance in home based brassware manufacturing units\n", "abstract": " Purpose                – This paper examines the ways in which the concepts of “quality”, “productivity” and “business performance” are dealt in the literature to exhibit that terms used within these fields are vaguely defined and poorly understood. The purpose of this paper is to define quality, productivity and business performance along with their linkages for home-based brassware manufacturing units.                                        Design/methodology/approach                – This paper reviews related academic literature mostly since past ten years.                                        Findings                – This paper clarifies meaning and linkages of quality, productivity and business performance in home-based brassware manufacturing units.                                        Research limitations/implications                – The meaning and interpretations of quality, productivity and business performance may differ for other manufacturing units …", "num_citations": "20\n", "authors": ["896"]}
{"title": "Synthesis, structural, dielectric and magnetic properties of cobalt ferrite nanomaterial prepared by sol-gel autocombustion technique\n", "abstract": " Cubic spinel structured CoFe2O4 nanocrystalline material has been synthesized using the sol-gel auto combustion route. Structural parameters and phase formation were studied using room temperature powder X-ray diffraction (XRD). The result shows a pure cubic spinel structured sample formation with a lattice parameter of 8.4277 Å. Field emission scanning electron microscopy (FESEM) microstructural characterization revealed the nanocrystalline structure of the so synthesized sample with non-homogeneous grain sizes and grain shapes. Fourier transform infrared (FT-IR) characterization confirmed the spinel structure formation by exhibiting the cation stretching-vibrations at the tetrahedral and octahedral sites. The DC resistivity measurement has been carried out using a two-probe technique and confirmed the high resistive nature of the sample. The room temperature dielectric and AC properties were …", "num_citations": "19\n", "authors": ["896"]}
{"title": "Actions Speak Louder Than (Pass)words: Passive Authentication of Smartphone* Users via Deep Temporal Features\n", "abstract": " Prevailing user authentication schemes on smartphones rely on explicit user interaction, where a user types in a passcode or presents a biometric cue such as face, fingerprint, or iris. In addition to being cumbersome and obtrusive to the users, such authentication mechanisms pose security and privacy concerns. Passive authentication systems can tackle these challenges by unobtrusively monitoring the user's interaction with the device. We propose a Siamese Long Short-Term Memory (LSTM) network architecture for passive authentication, where users can be verified without requiring any explicit authentication step. On a dataset comprising of measurements from 30 smartphone sensor modalities for 37 users, we evaluate our approach on 8 dominant modalities, namely, keystroke dynamics, GPS location, accelerometer, gyroscope, magnetometer, linear accelerometer, gravity, and rotation sensors. Experimental …", "num_citations": "19\n", "authors": ["896"]}
{"title": "Surgical management of patients with post-cholecystectomy benign biliary stricture complicated by atrophy–hypertrophy complex of the liver\n", "abstract": " BackgroundAtrophy–hypertrophy complex (AHC) of the liver rarely complicates post-cholecystectomy benign biliary strictures (BBS). This study aimed to analyse the effect of AHC on the surgical management of patients with BBS.MethodsBetween 1989 and 2005, 362 patients underwent surgical repair for BBS at a tertiary referral centre in northern India. A total of 36 (10%) patients had AHC. Patients with AHC (n= 36) were compared with those without (n= 336) to define the factors associated with the development of AHC.ResultsOverall, 35 patients with AHC underwent Roux-en-Y hepaticojejunostomy; right hepatectomy was performed in one patient. The interval between bile duct injury and stricture repair did not influence the development of AHC (mean 24 months in AHC patients vs. 19 months in non-AHC patients; P= 0.522). Of the 36 patients with AHC, 26 (72%) had hilar strictures (Bismuth's types III, IV, V), as …", "num_citations": "19\n", "authors": ["896"]}
{"title": "Synthesis of ZnO nanoparticles from goat slaughter waste for environmental protection\n", "abstract": " In this study, a novel technique of utilizing effectively the goat slaughter waste is reported with a conviction that dead animals and their tissue and/or organ wastes too can participate in nanoparticle synthesis. This effort may help in controlling the environmental pollution and subsequently the different diseases. A simple environment friendly protocol, employing the broth of goat slaughter waste (principally intestine) yielded ZnO nanoparticles. X-ray and transmission electron microscopy analyses are performed to ascertain the formation of ZnO nanoparticles. Individual nanoparticles as well as a few aggregates having the size of 3-11 nm are found. Also, the reaction protocol was monitored using UV-visible spectroscopy. Accordingly, the entire span of experimentation (absorbance–time data) has been proposed in the form of a mathematical model. The surface plasmon resonance was observed at 359 nm. A possible involved mechanism for the biosynthesis of ZnO nanoparticles has also been proposed.", "num_citations": "15\n", "authors": ["896"]}
{"title": "The case for modeling security, privacy, usability and reliability (SPUR) in automotive software\n", "abstract": " During the past few years, there has been considerable growth in the practice of modeling automotive software requirements. Much of this growth has been centered on software requirements and its value in the context of specific functional areas of an automobile, such as powertrain, chassis, body, safety and infotainment systems. This paper makes a case for modeling four cross-functional attributes of software, namely security, privacy, usability, and reliability, or SPUR. These attributes are becoming increasingly important as automobiles become information conduits. We outline why these SPUR attributes are important in creating specifications for embedded in-vehicle automotive software.               Several real-world use-cases are reviewed to illustrate both consumer needs and system requirements — functional and non-functional system requirements. From these requirements the underlying …", "num_citations": "15\n", "authors": ["896"]}
{"title": "Fruit maturity, harvesting, and quality standards\n", "abstract": " It can easily be understood with the recent postharvest loss reports from national and international organizations that something is going wrong with our production system of horticultural commodities. Lack of knowledge about maturity, proper harvesting, and postharvest management is the factor responsible for such huge postharvest losses especially in developing countries. Horticulturists are now aware about retaining postharvest quality of horticultural produce. Thus proper postharvest management of horticultural produce starts right from harvesting until it reaches to the consumer. Judging maturity and harvesting horticultural commodity at the right stage is an art and differs crop to crop. It is an irreversible process affecting the internal and external quality directly. Knowledge of harvesting method, harvesting time, and the effect of these factors on the internal and physiological processes of commodity, gives …", "num_citations": "14\n", "authors": ["896"]}
{"title": "Peer to peer car sharing social-graph configurator\n", "abstract": " A server comprising a transceiver configured to communicate data with a remote vehicle computer system and a car-reservation system. The server further includes a processor configured to utilize the data to output a car-sharing social-graph, the car-sharing social-graph including a vehicle for sharing, a vehicle-location, a user-location, and a potential parking-spot for sharing the vehicle.", "num_citations": "14\n", "authors": ["896"]}
{"title": "Medical data acquisition and provision\n", "abstract": " A computer-implemented method includes determining a user account associated with a vehicle occupant. The method also includes detecting the presence of at least one active monitoring device. The method further includes determining an association between the active monitoring device and the user account and periodically downloading device information from the active monitoring device to a vehicle computing system. Finally, the method includes storing downloaded device information in association with the user account.", "num_citations": "14\n", "authors": ["896"]}
{"title": "System and method of conducting vehicle usage data analysis\n", "abstract": " A method of conducting vehicle usage data analysis is provided. The method includes providing usage data about at least one vehicle to a database. The usage data may be analyzed and compared to a member of a set of vehicle development models to determine whether to update a vehicle development model. The usage data may also be analyzed to determine whether to transmit a communication to a vehicle.", "num_citations": "14\n", "authors": ["896"]}
{"title": "Method and Apparatus for Health Monitoring\n", "abstract": " A computer implemented method includes communicating with one or more medical and/or wellness devices. The method further includes receiving one or more data related to a medical or wellness condition from at least one of the one or more medical and/or wellness devices. The method additionally includes reporting a measurement from the one or more medical devices based at least in part on the received data.", "num_citations": "14\n", "authors": ["896"]}
{"title": "Surfactant replacement therapy (SRT) in respiratory distress syndrome (RDS)\n", "abstract": " SRT (Surfactant Replacement Therapy) has changed the course of disease and outcome of RDS. We undertook this study to audit outcome of surfactant therapy for RDS in preterms and study complications contributing to morbidity and mortality. This is a prospective observational study of all cases of RDS receiving SRT from October 2009 to July 2011. Overall incidence of RDS was 21% among preterms, varyimg inversely with gestational maturity. Survival was 71.3% among those who received SRT. Sepsis was the most common co-morbidity (43.5%). Downe score≥ 6 at intubation (RR 7.25; 95% CI 2.43-22.42; P< 0.0001) and sepsis (RR 1.93; 95% CI 1.09-3.41; P= 0.022) were significant predictors of mortality. The survival of those given SRT improved with increasing gestational maturity and birth weight. Sepsis is an important complication and its presence, along with a high RDS score at intubation are significant predictors of mortality.", "num_citations": "14\n", "authors": ["896"]}
{"title": "System and method to determine, in a vehicle, locations of interest\n", "abstract": " An occupant of a vehicle requests locations of interest from a remote provider. Locations of interest are identified based on the current location of the vehicle and a social network of the occupant. The locations of interest are provided to the vehicle via a network.", "num_citations": "14\n", "authors": ["896"]}
{"title": "Seroprevalence of Babesia bigemina infection in cattle of India and Bangladesh\n", "abstract": " Seroprevalence of Babesia bigemina infection in cattle of India and Bangladesh FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 2013 Volume : 53 Issue : 4 Start Page : 431 End Page : 433 All titles : \" Seroprevalence of Babesia bigemina infection in cattle of India and Bangladesh \" Save as: AGRIS_AP RIS EndNote(XML) Seroprevalence of Babesia bigemina infection in cattle of India and Bangladesh Loading... Paper Written Paper Seroprevalence of Babesia bigemina infection in cattle of India and Bangladesh [1983] Banerjee, DP Prasad, KD Samad, MA Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Access the full text NOT AVAILABLE Lookup at Google Scholar google-…", "num_citations": "14\n", "authors": ["896"]}
{"title": "Methods and apparatus for adaptive vehicle response to air quality states\n", "abstract": " A computer-implemented method includes connecting to a remote system and requesting data relating to a quality of air level in the vicinity of a known vehicle location. The method further includes receiving data relating to the quality of air level and comparing the data to one or more predetermined threshold levels of tolerance. If the data exceeds at least one threshold level of tolerance an automatic vehicle computing system response is instructed. In this example, the method also includes activating one or more vehicle systems in response to the data exceeding the at least one threshold level of tolerance.", "num_citations": "13\n", "authors": ["896"]}
{"title": "Method and apparatus for vehicle process emulation and configuration on a mobile platform\n", "abstract": " A computer-implemented method includes providing an interface on a wireless device corresponding to an interface for vehicle infotainment system control. The method also includes providing simulated functionality of controls on the interface, such that activation of a control informs a user of what would occur if the control were activated on a vehicle interface. Further, the method includes saving at least one user setting input into the interface. The method additionally includes transferring the saved setting to a vehicle computing system (VCS) for use in infotainment system control when the wireless device is in communication with the VCS.", "num_citations": "13\n", "authors": ["896"]}
{"title": "Method and Apparatus for Incoming Call Filtration and Message Delivery\n", "abstract": " A computer-implemented method includes detecting an incoming call to a wireless device in communication with a vehicle computing system (VCS). The method further includes determining that a do not disturb (DND) feature is enabled on the VCS and comparing one or more aspects of the incoming call to one or more filters of the DND feature to determine user notification eligibility. The method also includes notifying the user, through the VCS, of the incoming call, conditional on the eligibility of the call.", "num_citations": "11\n", "authors": ["896"]}
{"title": "Candidemia in neonatal ICU-experience from a tertiary care hospital\n", "abstract": " We studied the clinical and microbiological parameters associated with candidal sepsis in neonates and identified possible predictors of poor outcome. Observational study of all cases admitted to NICU between October 2009 and July 2011, proven to have candidal growth in blood culture. Thirty six cases were identified during the study period. Odds of very low birth weight babies (3.1% vs 0.43%; OR 7.41; 95% CI 3.82, 14.39; p< 0.0001) and preterm neonates (1.4% vs 0.32%; OR 4.56, 95% CI 2.08, 10.03; p< 0.0001) admitted to NICU to acquire fungal sepsis were significantly more. Candida glabrata was the offending agent in 16 (44.4%) cases. Non albicans species was associated with higher mortality. Presence of candiduria was a significant risk factor for death (OR 5.14, 95% CI 1.17, 22.49 P= 0.04). Candida glabrata caused the most number of cases of fungal septicemia. Non albicans species and isolation of …", "num_citations": "11\n", "authors": ["896"]}
{"title": "Screening of mango (Mangifera indica) genotypes for the incidence of lenticel browning—a new postharvest problem\n", "abstract": " Several postharvest problems affect the sensory quality of mango (Mangifera indica L.) fruits which significantly deteriorates the market value of fruits. Among several such problems, lenticel browning (LB) has been reported recently, which affects face value of fruits. Hence, an attempt was made to screen 20 indigenous (Amrapali, Alphonso, Banglora, Bhaduran, Bombay Green, Dushehari, Gulabkhas Green, Langra, Mallika, Neelum, Pusa Arunima, Pusa Pitamber, Pusa Lalima, Pusa Pratibha, Pusa Shrestha, Rataul, Ratna, H-3-2, H-8-11, H-12-1) and 10 exotic (Edward, Eldon, Extrema, Sensation, Irwin, Iturba, Rosari, St. Alexendrina, Tommy Atkins and Zill) varieties/hybrids grown at IARI, New Delhi, to observe the severity of lenticel browning among various varieties/hybrids. Fruits were harvested at full maturity and stored at ambient conditions for 10 days. At the end of 10th day, healthy as well as brown lenticels were counted per square centimetre with the help of a magnifying lens. Our results revealed that among indigenous varieties, Langra had shown the maximum incidence of lenticels browning (100%), followed by Dushehari (52.8%), and among exotic varieties, Sensation had shown the highest (35.9%) incidence of lenticel browning followed by Eldon (28.3%). Interestingly, some hybrids developed by IARI, New Delhi such as H-3-2 (4.3%), H-8-11 (4.5%) Pusa Pratibha (4.8%), Pusa Lalima (5.2%), Pusa Arunima (5.7%), Pusa Shrestha (6.1%) and varieties such as Bhaduran (5.1%) and Alphonso (5.3%) were found to be less prone to LB as they exhibited< 10% incidence of LB. This study revealed that few varieties like Langra and …", "num_citations": "9\n", "authors": ["896"]}
{"title": "Wirelessly controlled heads-up display having solar charging and charge level indication\n", "abstract": " A heads up display apparatus for a vehicle, comprising a wireless transceiver configured to connect and communicate with a device providing information for display, an energy storage device configured to provide energy to the display apparatus, a processor configured receive information from the transceiver and configure the information for display, and a display configured to output the information.", "num_citations": "8\n", "authors": ["896"]}
{"title": "A clinico—epidemiological study of traumatic chest injuries in a rural tertiary care centre in India: our experience\n", "abstract": " Introduction: Traumatic chest injuries are on the rise mainly due to increased frequency of road traffic accidents (RTAs) and rise in community disharmony. Chest injuries are one of the common causes of major mortality and morbidity. The management of traumatic chest injuries depends on the severity of injury, patient accessibility to nearby hospital and availability of resources at tertiary care Centre. Materials and Methods: It is aretrospective study of total 52 patients presenting to the emergency department with chest injuries of varying severity at SDUMC, Kolar from Jan 2013 to Dec 2013. Data collected regardingcommon injury modes, age and gender distribution, pre-hospitalization practices, clinical presentations, associated injuries, severity of injuries and management options from the hospital record section and these data were analyzed with descriptive statistics. Results: Chest trauma is most common in males in their thirties with mean age of presentation 39 years. The most common mode of injury was RTAs (67.3%) followed by fall from height (15.3%). Most of the pats were brought by patient’s attenders (46.1%). Most common presentation was chest pain and clinical sign was positive chest compression. Soft tissue injury to chest in the form of abrasions was most common injury type. About 21.1% of patients were presented with some form of pleural space collection, most common being combined Haemo-pneumothorax. Most of the patients treated symptomatically and in 10 patients (19.2%) Intercostal drain was placed.Conclusions: Chest injury is seen commonly in RTA patients. Most of the patients of chest injury had soft tissue trauma …", "num_citations": "8\n", "authors": ["896"]}
{"title": "System and method for determining a vehicle traffic route\n", "abstract": " Coordinate based vehicle navigation services are provided using text based traffic route information and associated coordinate data received from an off-vehicle source. Traffic route information indicative of a traffic route from an initial location to a destination may be received. The traffic route information may lack geographic coordinate data defining the traffic route. A way-point along the traffic route may be determined based on the traffic route information. Way-point information defining the way-point along the traffic route may be sent to an off-vehicle information provider. The way-point information may lack geographic coordinate data defining the way-point. Way-point geographic coordinate information defining the way-point may be received and the traffic route information may be associated with the way-point geographic coordinate information.", "num_citations": "8\n", "authors": ["896"]}
{"title": "Probiotic Lactobacillus adds WO3 in its nanomenu!\n", "abstract": " Green, low-cost, and reproducible Lactobacillus-mediated biosynthesis of oxide nanoparticles is reported. Tungsten oxide (WO3) nanoparticles are synthesized using Lactobacillus sp. procured from probiotic tablets. The synthesis is performed akin to room temperature in the laboratory ambience. X-ray and transmission electron microscopy analyses are performed to ascertain the formation of WO3 nanoparticles. Individual nanoparticles having the dimensions of 10–70 nm are found. The UV-vis absorbance spectrum is used to estimate the optical band gap of WO3 nanoparticles. The mechanism involved for the synthesis of WO3 nanoparticles has also been discussed.", "num_citations": "8\n", "authors": ["896"]}
{"title": "Cultivation and post-harvest handling techniques of potential future crop ‘longan’(Dimocarpus longan Lour) in Asia pacific region-A review\n", "abstract": " Longan (Dimocarpus longan Lour) is well known for its immense valued fruits and derived products having pharmaceutical and nutritive properties. It is cultivated in various countries of the world from more than 2200 years. FAO report and horticulture database of Asia pacific countries up to the year 2015 show that China and Australia contribute to the major share of its production and trade. This crop when managed properly serves as a source of farmer income in these countries. Know-how of production management of this crop based on their locality and climatic conditions can really help farmers to carry out its commercial cultivation. Whereas, on the other hand, horticulture status of countries like India reflects the scope to establish and explore production management of this crop. The upsurge in its production in last few years in Asia pacific region by the contribution of China, Vietnam and Australia sat an …", "num_citations": "6\n", "authors": ["896"]}
{"title": "Method and system for selecting, in a vehicle, an active preference group\n", "abstract": " An occupant of a vehicle is presented with discussion groups of interest to the occupant. The discussion groups are selected based on the degree to which interests of friends of the occupant coincide with the interests of the occupant. Once a discussion group is chosen, a telematics gateway connects the occupant to the discussion group.", "num_citations": "6\n", "authors": ["896"]}
{"title": "Special issue on advanced automobile technologies\n", "abstract": " When we proposed this special issue on the automobile to the Proceedings editorial board, the feedback we received was indeed quite revealing what the automobile has to become today. It is indeed a system, complete in many respects with complex controls, communications and computing environment. On the other hand, the automobile today is but a component in an increasingly information rich roadway infrastructure. Any meaningful review of the growth of electronic driven intelligence in the automobile, therefore, had to be placed in the context of the growth in intelligence in the larger transportation system. The collection of papers that have been selected for this special issue, cover a range of topics that review advancements in automobiles both as Bmove alone [systems and as Bconnected [components in a broader intelligent transportation system (ITS). The papers span a number of interdependent themes that include: architecture; systems; controls & communications, computing and embedded computers, safety, and intelligent vehicles. Even with the breadth of papers in this issue, we realize that there are a number of topics that are not included. Therefore, to ensure general coverage and, as a prolog to this special issue, we have dedicated the first article under the auspices of BScanning the Technology.[This introductory article mainly overviews the progress of electrical, electronics, software, and other relevant technologies that shape the modern automobile. Some of these technologies are described in more detail in the articles that comprise this special issue. Following this introductory article by the guest editors, the first invited …", "num_citations": "6\n", "authors": ["896"]}
{"title": "Depth restoration from defocused images using simulated annealing\n", "abstract": " The recovery of depth from defocused images is formulated as a 3-D image restoration problem. A defocused image is modeled as the combinatorial outcome of the depths and intensities of the volume elements (voxels) of an opaque 3-D object. A large depth-of-field image is used to constrain the intensities of the voxels. The depths of voxels are estimated from a highly defocused image by using simulated annealing to solve a constrained optimization problem. It is concluded that the method provides a framework for high-resolution depth recovery from defocused images. The method is computationally-intensive; however, it is amenable to parallel processing and is well suited for small field-of-interest applications.< >", "num_citations": "6\n", "authors": ["896"]}
{"title": "A mixed methods approach to understanding how colleges, universities, and employers prepare and support undergraduates in engineering internships\n", "abstract": " This Research to Practice Work In Progress Paper describes an academic-industry research partnership aimed at understanding how undergraduate juniors and seniors navigate a summer internship at a large global engineering company in the automotive industry. The study explores the question: What are the relationships between internship experiences and engineering students' self-efficacy, creativity and innovation, and future academic and career choices and plans? Focusing on survey and interview data collected from product development interns at a single engineering firm, this research explores the highlights and challenges encountered in their internship as well as their perceptions regarding opportunities for creativity and innovation. An additional set of interview questions examined the organizational ecology within the company based on who interns interacted with and sought out for mentorship and …", "num_citations": "5\n", "authors": ["896"]}
{"title": "Salicylic acid influences lenticel discolouration and physiological and biochemical attributes of mango (Mangifera indica L.) fruits\n", "abstract": " Lenticel discolouration (LD) has now emerged as a leading postharvest threat in mango, which interferes with the face value of fruits, thereby affecting the trade and causing huge monetary losses to our country. For its management, we designed an experiment using salicylic acid at 200, 400 and 600 ppm concentration along with control fruits, as a dip treatment for 5 min. Our results revealed that salicylic acid at 200 ppm was not only effective in reducing LD significantly but also reduced the activities of polyphenol oxidase (PPO) (0.397 ∆A410 O.D min−1 g−1 FW), peroxidase (POD) (0.050 ∆ A470 O.D min−1 g−1 FW), and lipoxigenase (LOX) (3.227 µmol min−1 g−1 FW) enzymes and helped in increasing the total phenolics (15.46 mg gallic acid equivalent 100 g−1). This treatment also suppressed the rates of ethylene evolution (0.521 µL kg−1 h−1) and respiration (34.46 mL CO2 kg−1 h−1) over untreated …", "num_citations": "5\n", "authors": ["896"]}
{"title": "Effect of hot water treatment on the incidence of lenticel browning and quality of mango fruits\n", "abstract": " The present investigation was undertaken to evaluate the effect of hot water treatment on the incidence of lenticel browning (LB) in mango, which is becoming one of the main problems in handling and trade of fresh fruits. Fruits of four selected mango varieties (Indian – ‘Dashehari’, ‘Langra’; Exotic – ‘Sensation’, ‘Eldon’) which were found susceptible to LB, were subjected to hot water treatment (HWT) at different levels (45°, 50° and 55°C for 30 min.). After treatment, the fruits were stored at ambient conditions (35 ± 4ºC and 65 ± 5% RH) for 10 days. At the end of storage period, observations were recorded on various parameters. Our results revealed that fruits of ‘Langra’ exhibited 100% LB, followed by ‘Dashehari’ (52.8%), ‘Sensation’ (35.9%) and ‘Eldon’ (28.3%). All levels of hot water treatment reduced the LB to a greater extent as well as improved fruit quality attributes significantly over untreated fruits. The best …", "num_citations": "5\n", "authors": ["896"]}
{"title": "Influence of arbuscular mycorrhizal fungal biostimulants and conventional fertilizers on some solanaceous crops for growth, productivity and nutrient stoichiometry under field …\n", "abstract": " The main objective of the study was to evaluate the outcome of inoculation with biological consortium culture of arbuscular mycorrhizal fungal species (Aculospora logula, Glomus fasciculatum, Glomus intraradices, Gigaspora margarita, and Scutellospora heterogama) and chemical fertilizers on Solanaceous crops (Solanum tuberosum L. cultivars, Lycopersicum esculentum L. and Solanum melongena L.) under field conditions during Rabi cropping season. The experimental plot was a randomized block design with four replications. The result revealed that gross yield, plant height, number of branches/plant, leaf moisture, leaf area, root length, and dry biomass were positively affected by the inoculation of consortium culture of arbuscular mycorrhizal fungi with 75% recommended dose of fertilizers (RDF). Overall, our study shows that inoculation of consortium mycorrhizae with 75% RDF gave better growth, dry …", "num_citations": "4\n", "authors": ["896"]}
{"title": "A novel low-complexity compressed data aggregation method for energy-constrained IoT networks\n", "abstract": " Sensor nodes used in typical monitoring applications of the Internet of Things (IoT) are an on-board resource (energy, memory, computational capability) constrained devices. The existing data aggregation algorithms have proven that compressed sensing (CS) is promising for energy efficient data aggregation. However, these methods compromise on at least one of energy efficiency, on-node computational complexity and recovery fidelity. In this paper, we propose a novel CS-aided low-complexity compressed data aggregation (LCCDA) method that divides the network into constrained overlapped clusters thereby offering an optimal trade-off among energy consumption, on-node computational complexity and recovery error. We show that the measurement matrix constructed from constrained overlapped clustering satisfies the restricted isometry property (RIP) that guarantees the recovery of the aggregated data …", "num_citations": "4\n", "authors": ["896"]}
{"title": "Longan (Dimocarpus longan Lour) processing: A Review\n", "abstract": " Sapindaceae) is subtropical fruit crop of china and few other countries of Asia pacific regions (Huang, 1995). Because of its delicate flavour and sweet taste longan has is becoming trending in recent decade in the South-East Asian region and all over the world. It is consumed as fresh or in the processed forms such as dried flesh and the canned product. This fruit is similar to lychee and is being referred as ‘little brother of lychee’and also known as ‘Dragon’s eye’fruit by its regional title ‘pinyin’, which suggests ‘dragon eye’(Jiang et al., 2002). It has a very poor shelf life which challenging postharvest technologist. It is mainly grown in the region like China, Thailand, Vietnam, and Laos, also in the recent year, its demand has been increasing exponentially (Qiu 2013). Growers can get higher income from this crop by following proper harvesting methods and postharvest management which are a limiting", "num_citations": "4\n", "authors": ["896"]}
{"title": "Cotton production in the presence of Pectinophora gossypiella (Saunders) in central Greece.\n", "abstract": " The aim of the present research was to study fluctuations of populations of P. gossypiella in various areas in the Prefecture of Larissa. Data were analyzed to found the relation between population density population density Subject Category: Properties", "num_citations": "4\n", "authors": ["896"]}
{"title": "Parasitism and hyper parasitism on Pyrilla Perpusilla Walker in sugarcane ecosystem\n", "abstract": " The seasonal variation in parasitism on Pyrilla perpusilla Walker (Lophopidae: Homoptera) in situ by parasitoids were examined at fortnightly interval, from April to December 2004 (Plant crop) and 2005 (Ratoon crop) in sugarcane ecosystem. These fields were kept free from insecticidal applications. During, 2004 there was no parasitization in the month of April while 3.7± 0.2 per cent nymphs were parasitized in May first fortnight. With the increase in Pyrilla population, rise in parasitization by Epiricania melanoleuca (Epipyropidae: Lepidoptera) started and reached its peak 80.5± 4.9 per cent on nymphs in November second fortnight. Adult parasitization (6.2± 0.5%) was noticed in May first fortnight and touched its peak at 77.0± 5.1 per cent in November second fortnight. While during 2005 parasitization were observed at 82.3± 4.8 per cent on nymphs and 75.0± 3.9 per cent on adults in November second …", "num_citations": "4\n", "authors": ["896"]}
{"title": "A platform for groundnut improvement\n", "abstract": " The Deccan Plateau, a vast area of roughly 1000 by 300 km lies at about 600 m above sea level. It is a chronic drought prone and resource poor region, lying in the rain shadow of the Western Ghats, in the states of Andhra Pradesh, Karnataka, Maharashtra and Tamil Nadu. Annual rainfall ranges from 500 to 900 mm and can be very variable with substantial dry spells. Natural soil fertility is generally low. Total population in the region is about 100 million or about 20 million families some 10 million of which are farming families. Another 4 million are agricultural labourers. Eighty percent of the region is under rainfed farming and the rest is under irrigation.", "num_citations": "4\n", "authors": ["896"]}
{"title": "Genetic diversity among upland rice varieties from India and Bangladesh\n", "abstract": " Isozyme analysis is a simple and powerful tool to examine genetic diversity of rice varieties for neutral markers. Rice germplasm was classified into six groups based on allelic associations across 15 isozyme loci. Understanding the pattern of variation existing among varieties grown in a given ecosystem is important for breeders and could help to optimize the choice of parents for hybridization.", "num_citations": "4\n", "authors": ["896"]}
{"title": "NOTE ON GENETIC PARAMETERS FOR BIOMETRIC CHARACTERS IN SHORT-SATURED RICE VARIETIES.\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "4\n", "authors": ["896"]}
{"title": "Influence of harvesting method on postharvest loss, shelf-life and quality of mango (Mangifera indica) fruits\n", "abstract": " Postharvest losses in mango fruits affect its availability and per capita consumption to consumers. Among the factors causing postharvest losses, improper harvesting method is major one, which affects postharvest quality and shelf life of mango fruits. Hence, an attempt was made to observe the response of mango towards harvesting method. For this study, four commercial cultivars of mango (Amrapali, Chausa, Dushehariand, and Langra) grown at ICAR-IARI, New Delhi were selected. Fruits were harvested manually and mechanically at full maturity, desaped, pre-cooled and stored in corrugated fibre board boxes (CFB) at ambient conditions for 10 days. Observations on various postharvest loss parameters were recorded, right from harvesting, till the end of shelf-life. Results revealed that significant differences occurred among cultivars and storage days in both manual and mechanically harvested fruits. Further, mechanical harvesting was found efficient not only in controlling quantitative loss but also maintained postharvest quality and increased shelf-life significantly. Interestingly, cultivar Amrapali and Dushehari were recorded as more responsive towards mechanical harvesting as they exhibited for less postharvest losses and maintained better quality than Langra and Chausa. Thus, mechanical harvesting and knowledge of cultivar response towards mechanical harvesting will help growers in reducing postharvest losses and increasing shelf-life and quality of mango fruits.", "num_citations": "3\n", "authors": ["896"]}
{"title": "The Hardware–Software Tango [Point of View]\n", "abstract": " This paper highlights the dynamic software-hardware systems on recent development in aerospace, automotive, health care, communication, education, entertainment, finance, and many others. With the unceasing progress on the on how software sustains hardware-based function and vice versa, this proceedings will have a special issue on the topic of aerospace and automotive software later this year, and some invited papers will discuss: the progress of the past decades and present an expert's view into the future of aerospace and automotive software engineering, architecture, components, systems, and systems-of-systems; safety-driven software; software cost; software architectures; time-critical software; hardware-software codesign; software systems engineering; model-driven software engineering; model-integration methodologies; collaborative-model integration; toolset integration; aerospace software …", "num_citations": "3\n", "authors": ["896"]}
{"title": "The status of climate variation in Pakistan and its impacts\n", "abstract": " The status of climate variation in Pakistan and its impacts FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Type : Other In AGRIS since : 2015 Publisher : Dhaka (Bangladesh) SAARC/SMRC All titles : \" The status of climate variation in Pakistan and its impacts \" Save as: AGRIS_AP RIS EndNote(XML) The status of climate variation in Pakistan and its impacts Loading... Paper Written Paper The status of climate variation in Pakistan and its impacts [2002] Quadir, DA South Asian Association for Regional Cooperation, Dhaka (Bangladesh) eng Hussain, A. Hossain, A. et al. Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Summary (En) Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Loading... Bibliographic …", "num_citations": "3\n", "authors": ["896"]}
{"title": "The emerging fabric of seamless mobility\n", "abstract": " Consider this recent data about the “speed” of the information age: In a sixty month window beginning in the year 1995, the number of cellular phone subscribers increased from 90 million to 330 million, the number of people on the internet went from about 5 million to just under 200 million, and not surprisingly the number of websites grew from a few thousands to 50 million. Now further consider that almost every cellular phone subscriber is also an automobile user, be it as a driver or a passenger. A fabric of mobility soon emerges---one that is formed by the meshing of the strands of information mobility with those of personal mobility.In this paper we explore a “new frontier”---a “territory” on this multidimensional fabric that is defined by the demands of seamless mobility. The typical daily cycle of events in our lives involve many different modalities and time-phases of mobility. We examine the rapidly increasing …", "num_citations": "3\n", "authors": ["896"]}
{"title": "Old and new tools to analyze genotype x environment interactions: impact on upland rice breeding\n", "abstract": " Cette communication présente deux nouvelles méthodes d'analyse de l'interaction génotype environnement, utilisé dans l'exploitation des données d'un essai international (modèle AMMI et PA# pattern analysis#). Quatre pays et 11 sites ont été impliqués dans l'expérimentation. Les résultats montrent que l'interaction GxE représente la composante essentielle de la variabilité des rendements (50% de la somme des carrés), suivie par le facteur lié aux site 42%) puis par l'effet génotype (4%)", "num_citations": "3\n", "authors": ["896"]}
{"title": "Customizable reporting with a wearable device\n", "abstract": " A device that includes a processor and a memory, the memory storing instructions executable by the processor such that the device is programmed to identify a wearable device and a set of vehicle data from a vehicle. The user device sends a human machine interface (HMI) message to the wearable device. The HMI message is based at least in part on the set of vehicle data.", "num_citations": "2\n", "authors": ["896"]}
{"title": "Method and apparatus for animal presence alert through wireless signal detection\n", "abstract": " A system includes a processor configured to detect a wireless signature indicating an animal presence within a predefined proximity to a vehicle. The processor is also configured to issue an alert to vehicle occupants responsive to the wireless signature detection, the alert varying based on detected signal strength. The wireless signature may be transmitted from a BLE or RFID device provided to an animal affixed to a collar, for example, or from an RFID chip embedded in an animal.", "num_citations": "2\n", "authors": ["896"]}
{"title": "Impact of harvesting method on cosmetic appeal, physiological and biochemical attributes of mango fruits (Mangifera indica L.)\n", "abstract": " Postharvest quality of mango fruits comprises of external and internal quality and is representative of overall appeal and hidden valued biochemical of mango fruits respectively. Postharvest quality of mango fruits is an important factor for trade at the national and international level, and it not only determines the price of fruit, but also consumer preference to the purchase at marketing place. Mango fruits are very prone to postharvest quality loss, deterioration of which starts right from harvesting and increases tremendously during transport, retail and marketing. Hence, an attempt was made to observe the effect of harvesting technique on cosmetic appeal, physiological and biochemical attributes of mango fruits. The studies were attempted on four commercial cultivars of mango (‘Amrapali’,‘Chausa’,‘Dushehari’and ‘Langra’) grown at ICAR-IARI, New Delhi. Fruits were harvested mechanically (pole mount harvester) and manually under two different lots, which were then de-saped, precooled and stored separately in corrugated fibre board boxes (CFB) at ambient conditions for 10 days. Fruits were recorded for observations on attributes such as postharvest cosmetic appeal (glossiness, face value and lenticel browning), physiological (ethylene evolution and respiration rate), biochemical (total soluble solids, total carotenoids and antioxidant activity) and overall acceptability, till the end of shelf life to draw a conclusion. Our results revealed that significant differences occurred for cosmetic appeal, physiological, biochemical and overall acceptability, in both manual and mechanically harvested fruits. Further, mechanical harvesting was found better to …", "num_citations": "2\n", "authors": ["896"]}
{"title": "FPGA Implementation of AES Algorithm for Image, Audio, and Video Signal\n", "abstract": " The video, audio and image security, bandwidth, speed of transmitter, and reception of data are the main concepts of every communication system. The data that is being communicated can be safeguarded in many ways. The proposed technique creates an effective modified advance encryption standard (AES) algorithm for data security for encryption and decryption. In this Research work, proposes a method based on fuzzy logic principle to control the read and write operation of the overall S-box and also operations of memory related, that are used as inputs to AES and the lifting scheme wavelet is utilized to diminish the data transfer capacity. It is implemented using Vertex-2 Pro FPGA. The performance factors such as power, area, and speed are calculated and compared with existing techniques. In this work, we achieved 35% of power reduction and 46% increase in speed.", "num_citations": "2\n", "authors": ["896"]}
{"title": "Rootstock mediated effect on fruit ripening behaviour and phytochemical composition: an overview\n", "abstract": " Rootstock plays an important role in propagating fruit trees and is being used in fruit production for more than 200 years. Yield, market value and fruit quality depend on grower's decisions on cultivation and harvesting practices, one of such factor is selection of rootstock, which mediates not only ripening behaviour, but also phytochemical composition of fruit. Fruit ripening behaviour is the series of physiological and biochemical events, exhibited by the fruit during its ripening process. Earliness and delay in ripening, ripening rate, fruit colour, firmness, chemical constituents and postharvest shelf life are the result of ripening behaviour and in turn affect the phytochemical composition of fruit as well. Rootstock mediates its role through absorption of water, nutrient and mineral translocation, source-sink rate, hydraulic and stomatal conductivity, dwarfness, photosynthesis, regulation and signalling of plant growth hormones, mRNA, gene expression, and phloem proteins transport. This impact on fruit ripening and composition occurs in both positive and negative way. Any rootstock species found to be the best choice for a particular scion cultivar, however, showed worst choice for another cultivar. Rootstock selection affects fruit quality attributes and thereby consumer liking and acceptance. It also serve as a method of enhancing phytochemicals, nutritional security and enhanced quality of postharvest products. Knowledge of rootstock mediated effect on fruit ripening and phytochemical composition can play a major role to evolve rootstock-scion combinations for enhanced postharvest quality of fruits.", "num_citations": "2\n", "authors": ["896"]}
{"title": "Method and Apparatus for Crowd-Sourced Information Presentation\n", "abstract": " A system includes a processor configured to receive a request to provide email read-back. The processor is also configured to access contact information for at least one human email read-back party. Further, the processor is configured to determine the availability of the at least one party to read back one or more emails, using the contact information. Also, the processor is configured to deliver the one or more emails to the at least one party for read-back and receive audio data from the party corresponding to the delivered emails", "num_citations": "2\n", "authors": ["896"]}
{"title": "Altered taste perception among complete denture patients\n", "abstract": " Aims: The purpose of this study was to evaluate the effect of upper complete denture on gustatory sense in denture wearers. Materials and Methods: Gustatory senses in 60 subjects were evaluated with four different solutions containing sucrose, NaCl, acetic acid, and quinine dissolved in water. Means and standard deviations were calculated and then compared between the different time intervals. Results: The mean taste identification time was found to increase at compared intervals. Conclusion: Difference between mean identification times between four sessions was statistically not significant.", "num_citations": "2\n", "authors": ["896"]}
{"title": "ADVANCED AUTOMOBILE TECHNOLOGIES\n", "abstract": " CONTENTS Page 1 323 POINT OF VIEW Stem Cell Research— The Promise and Current Progress By D. Fenstermacher 325 SCANNING THE ISSUE Special Issue on Advanced Automobile Technologies By H. Gharavi, KV Prasad, and PA Ioannou 328 SCANNING THE TECHNOLOGY Scanning Advanced Automobile Technology By H. Gharavi, KV Prasad, and P. Ioannou 453 SCANNING OUR PAST Electrical Engineering Hall of Fame: Frank B. Jewett By JE Brittain 456 FUTURE SPECIAL ISSUES/SPECIAL SECTIONS FEBRUARY 2007 / VOL. 95 / NO. 2 Vol. 95, No. 2, February 2007 | Proceedings of the IEEE 321 CONTENTS DEPARTMENTS ADVANCED AUTOMOBILE TECHNOLOGIES Edited by H. Gharavi, KV Prasad, and PA Ioannou 334 Control, Computing and Communications: Technologies for the Twenty-First Century Model T By JA Cook, IV Kolmanovsky, D. McNamara, EC Nelson, and KV Prasad |…", "num_citations": "2\n", "authors": ["896"]}
{"title": "Monocular passive range sensing using defocus information\n", "abstract": " Defocused monocular views of three-dimensional objects can be used to provide useful range information. In the sensing method presented in this paper two monocular views  one highly defocused and the other well-focused  are recorded and processed to yield multi-resolution estimates of range information. This method exploits all available a priori information relating to the topological and photometric properties of the object. Results of simulations using synthetic opaque objects are presented.", "num_citations": "2\n", "authors": ["896"]}
{"title": "Natural language interface based on keyword extraction using AWK\n", "abstract": " The paper describes a method of implementing a natural language interface based on keyword extraction using the AWK programming language. This method is suitable for designing natural language interfaces on systems running under Unix or Unix-like operating systems, for applications such as computer-aided instruction and database retrieval. The knowledge base and software implementation of the natural language interface are described.", "num_citations": "2\n", "authors": ["896"]}
{"title": "A Transistorized Bridge for Measurement of LF Parameters of Transistors\n", "abstract": " Atransistor is a non-symmetrical, bilateral a~ tive four-pole net~ ork element, with a common termmal between the input and the output. The characteristic parameters of this four-pole element may be expressed in the form of an equivalent circuit. Typically, the Early's equivalent circuit for the common base connection and the Giacoletto-Johnson circuit for the common emitter connection may be conveniently used. The equivalent circuits contain reactances which contribute to the imaginary components of each of the quadripole parameters. These reactive components, however, may be neglected at very low measuring frequencies and only the resistive components be determined by the low frequency parameter measuring equipment, leaving the reactive components to be determined by suitable HF bridges. 1 The paper describes a fully transistorized low frequency parameter bridge together with t: ssential circuit …", "num_citations": "2\n", "authors": ["896"]}
{"title": "Distinctly Trained Multi-Source CNN for Multi-Camera Based Vehicle Tracking System\n", "abstract": " In the last few years the exponential rise in the demands or robust surveillance systems have revitalized academia-industries to achieve more efficient vision based computing systems. Vision based computing methods have been found potential for the different surveillance purposes such as Intelligent Transport System (ITS), civil surveillance, defense and other public-private establishment security. However, computational complexities turn-out to be more complicate for ITS under occlusion where multiple cameras could be synchronized together to track certain target vehicle. Classical texture, color based approaches are confined and often leads false positive outcome thus impacting decision making efficiency. Considering this as motivation, in this paper a highly robust and novel Distinctly Trained Multi-Source Convolutional Neural Network (DCNN) has been developed that exhibits pre-training of the real-time traffic videos from multiple cameras to track certain targeted vehicle. Our proposed DCNNvehicle tracking model encompasses multiple shared layers with multiple branchesof the source-specific layers. In other words, DCNN is implemented on each camera or source where it performs feature learning and enables a set of features shared by each camera, which is then learnt to identify Region of Interest (ROI) signifying the “targeted vehicle”. Our proposed DCNNmodel trains each source input iteratively to achieve ROI representations in the shared layers. To perform tracking in a new sequence, DCNNforms a new network by combining the shared layers in the pre-trained DCNN with a new binary classification layer, which is updated …", "num_citations": "2\n", "authors": ["896"]}
{"title": "Exploring the Relationships between Engineering Internships and Innovation and Engineering Task Self-Efficacy\n", "abstract": " This research to practice full paper presents the work of an academic-industry research partnership to explore the internship experiences of summer interns at a large global engineering company. Engineering internships give students the opportunity to apply the engineering skills they have been learning to real products and can have a high impact on innovation and engineering task self-efficacy. The relationship between internships and innovation and engineering task selfefficacy matters because self-efficacy is an important predictor of major and career choice. Innovation interests is another measure that measures the individual’s interest in innovative behaviors, unlike ISE which measures their confidence in practicing these behaviors. This paper focuses on understanding the relationship between internship work assignment and supervisor interaction and innovation interests. Furthermore, the relationship between the internship experience and the intern’s likelihood of accepting a job offer from the same company is explored. A survey administered to engineering interns (N= 115) at the end of their summer 2017 internship at a large global engineering company forms the main dataset for this work.", "num_citations": "1\n", "authors": ["896"]}
{"title": "Edible coatings and their effect on postharvest fruit quality\n", "abstract": " Edible coating is a healthy and environment friendly approach. It is directly consumable and does not leave any residues. This technology not only retains the quality of fresh fruits but also extends their overall shelf-life. Edible coating alters various physical, physiological and biochemical aspects of fruit growth, to carry out its effect. Alteration and control over respiration rate, moisture retention, retaining glossiness, firmness, are few to be listed from the long list of its functions. Intelligent selection and use of edible coating helps us to incorporate other natural preservatives in it, which in turn offers resistance to fruits against various quality-deteriorating factors. Although some lacunas still exists in the technology with respect to gas exchange, off flavor, functional barriers, etc. These lacunas can be rectified to a maximum extent by the knowledge of crop-based response of various edible coatings and is an important …", "num_citations": "1\n", "authors": ["896"]}
{"title": "Toyota's Ken Laberteaux Talks about the Road Ahead\n", "abstract": " In this interview, Ken Laberteaux, senior principal scientist for the Toyota Research Institute-North America, discusses topics ranging from his early work on wireless communications and Vanet, to finding the right balance between convenience and privacy, to addressing the challenges of automated driving. This department is part of a special issue on smart vehicle spaces.", "num_citations": "1\n", "authors": ["896"]}
{"title": "Method and apparatus for crowdsourced tour creation and provision\n", "abstract": " A system includes a processor, configured to communicate with a vehicle camera, a vehicle audio input and at least one vehicle input control. In this embodiment, the processor is configured to receive a request to being recording user audio from the audio input. The processor is also configured to record user audio and GPS coordinates to be associated with the audio and record one or more images or video files from the vehicle camera, to be associated with the audio or the GPS coordinates. Further, the processor is configured to compile and save the audio input, GPS coordinates and one or more images as a tour data file.", "num_citations": "1\n", "authors": ["896"]}
{"title": "Skin discoloration: A new sign of systemic candidiasis in neonates\n", "abstract": " With advances in neonatal care, there is increased survival of very low birth weight (VLBW) infants. The use of invasive procedures like endotracheal intubation, placement of central intravenous lines and invasive monitoring techniques, combined with risks of prolonged ICU stay and need for broad-spectrum antibiotics has led to the emergence of new and resistant pathogens including fungi. Fungal septicemia is the third most common cause of late onset sepsis. Its incidence varies with many factors, but generally it is inversely proportional to the gestational maturity and birth weight. An overall incidence of 1-4% and mortality as high as 25-50% has been reported.[1] Various muco-cutaneous manifestations of fungal septicemia have been described in literature.Cutaneous involvement occurs in 50-60% of VLBW neonates with systemic candidiasis. Congenital cutaneous candidiasis is a distinct entity first described by Benirschke and Raphael in 1958. The extensive rash, usually appears within 12 hours of birth.[2] It presents as an erythematous, maculopapular eruption of the trunk and extremities which rapidly becomes pustular, then improves with generalized desquamation. Most often, it resolves spontaneously in term infants, but may lead to invasive disease and result in mortality in VLBW babies. Colonization of skin and gastrointestinal tract (GIT) with Candida sp. forms an important and initial step in the pathogenesis of systemic infection.[3] Kaufman et al., reported that the skin and GIT are colonized before the respiratory tract. Involvement of the skin in acquired infection may present as erythematous, scaling dermatitis with satellite papules …", "num_citations": "1\n", "authors": ["896"]}
{"title": "Aerospace & Automotive Software\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "1\n", "authors": ["896"]}
{"title": "Shaping the Future of the Automotive User Experience: Design-for-Experience & the Last-Inch Problem\n", "abstract": " The communications and computing technologies underlying the future automotive user-experience are described in terms of what a typical consumer might see: built-in, beamed-in and brought-in services. A design-for-experience framework is proposed to translate desired experiences into underlying web-enabled services. To realize web-enabled services, the automobile needs to be defined as an information services platform, delivering communications and computing as services. Termed the last inch problem, the challenges associated with delivering this platform are outlined in the paper. Results from the development of engineering concepts and their application to demonstration vehicles are presented.", "num_citations": "1\n", "authors": ["896"]}
{"title": "A diagnostic study of some flood producing rainfall events in Bangladesh with a limited area analysis-forecast system\n", "abstract": " Lkkj & bl’kks/k&Ik= esa nf {k. kh if’peh ekulwu dh vof/k ds nkSjku caxykns’k esa Hkkjh o\" kkZ ds dkj. k vkus okyh ck<+ dk uSnkfud v/;; u fd; kx; k gSA bl v/;; u dk eq [; mn~ ns’; caxykns’k ds unh csfluksa ds m/oZ izokg okys Hkkxksa esa yxkrkj gksus okyh Hkkjh o\" kkZ dh flukWfIVd fLFkfr; ksa dk irk yxkuk gS A o\" kZ 1987 vkSj 1998 ds nkSjku gqbZ lcls vf/kd o\" kkZ vkSj lcls vf/kd ck<+ okys nks o\" kksZa dk Hkkjh o\" kkZ okys rwQku ds laca/k esa v/;; u fd; kx; k gSA bZ-lh-, e-MCY; w-, Q-bZ-vkj-,-&40 ls muds fQi lkbV ls MkmuyksM fd, x, uSnkfud fo’ys\" kk ds fy, ekSle laca/kh ekufp= rS; kj fd, x, gSaA y? kq vof/k esa o\" kkZ dk izfr: ik djus ds fy,¶ yksfjMk jkT; fo’ofo| ky; ds lhfer {ks= iwokZuqeku fun’kZ dk mi; ksx fd; kx; k gS A bl fun’kZ dks {kSfrt fxzM ij vk/kk fMxzh v {kka’k@ ns’ kkraj vkSj Å/okZ/kj esa 16 flxek Lrjksa ij O; kogkfjd cukus ds fy, iz; qDr fd; kx; k gSA v/;; u okys bu o\" kksZa esa ck<+ ykus okys o\" kkZ&rwQkuksa ds fy, mRrjnk; h lkekU; flukWfIVd fLFkfr] bu mRrjh caxykns’k esa mRrjkfHkeq [kh v {kka’k ij ekSleh ekulwu nzks. kh ds v {k dh vofLFkfr vkSj cM+ s iSekus ij ifjlapj. k dh folaxfr; ksa ds izHkkoLo: Ik mi; qZDr fLFkfr; ksa esa fLFkj ikbZ xbZ gSA lhfer {ks= fun’kZ ls o\" kkZ ds iwokZuqeku 24? kaVksa vkSj 48? kaVksa dh iwokZuqeku vof/k; ksa esa izkIr gq, gS tks izsf {kr o\" kkZ forj. k ds laca/k esa lqlaxr ik, x, gSaA", "num_citations": "1\n", "authors": ["896"]}
{"title": "Book Review: Techniques and Standards for Image, Video and Audio Coding. By KR Rao and JJ Hwang\n", "abstract": " Perhaps no group is more closely associated with the trials and tribulations of working with electronic images than our group—the readership of Electronic Imaging. For those of us who have experienced more trials than tribulations, Rao and Hwang’s book ‘‘Techniques and Standards for Image, Video and Audio Coding’’might provide some welcome relief. While this book is about redundancy reduction (coding) and about standards, it is also about the rapidly evolving state of technologies related to information communication modalities—be they in the form of still images, video clips, audio signals, or any combination of these. For over forty years consumers have noticed little change with regard to television broadcast standards. In the past few years, however, significant changes have been proposed and some have just recently been accepted, such as the High Definition TV (HDTV) Grand Alliance (GA) proposal …", "num_citations": "1\n", "authors": ["896"]}
{"title": "Automated inspection for remote telerobotic operations\n", "abstract": " Automated inspection techniques being developed for surface inspection of remote space platforms are reported. The unique problems of performing visual telerobotic inspection in space are identified. An image differencing method to detect changes to surfaces over a period of time is presented, together with a scale-space technique for flaw identification. Examples from images of laboratory mockups of space platform modules are presented to illustrate the results.< >", "num_citations": "1\n", "authors": ["896"]}
{"title": "Learning visual speech\n", "abstract": " The performance of Automatic Speech Recognition (ASR) systems can be greatly enhanced by incorporating phonologically relevant features contained in video sequences of speakers. Humans, particularly the hearing impaired, can utilize visual information {through lipreading {for improved accuracy. We present a system for doing ASR that relies on both classical and learning algorithms to identify and process relevant visual information. Classical image processing operations such as convolution and thresholding are used to reduce each frame to a small intermediate (vector) representation of the image content. Sequences of these vectors are used as inputs to a modi ed time delay neural network, which is trained to output the corresponding phoneme. The network learns to extract visual-temporal features which are useful in classi cation. Eventually, the learning procedure may be extented to directly utilize the\" raw\" pixels, however, in present practice, the classical operations act as a means of compressing the visual information down to manageable amounts. Our current visual speech recognizer, in combination with a similar acoustic recognizer reduces the error rate by 75% when compared with the acoustic subsystem alone.", "num_citations": "1\n", "authors": ["896"]}
{"title": "Depth restoration from defocused images: A surface evolution approach\n", "abstract": " Defocused images are a rich source of depth information. Several methods to extract depth from defocused images, generally known as\" depth-from-defocus\"(DFD) techniques, have been proposed recently. A new approach to DFD, that results in high-resolution depth-maps, is presented in this dissertation. In this method, a defocused image is viewed as the outcome of a combinatorial process, where a set of three-dimensional voxels, some in-focus and the others out-of-focus, are mapped via a two-dimensional projection to an image (pixel) plane. The restoration of depth information is realized by formulating the DFD process as a combinatorial optimization problem. A priori knowledge of the geometrical and optical properties of the object, such as finite size, smoothness, opacity, and coarse depth, is used to form constraints that reduce the ambiguity of the solution. Several constrained optimization techniques …", "num_citations": "1\n", "authors": ["896"]}
{"title": "Automatic language recognition based on phonetic structure of languages\n", "abstract": " The performance of an Automatic Speech Recognition (ASR) system can be improved by using knowledge about the phonetic structure of a language. This paper discusses an Automatic Language Recognition (ALR) algorithm which can recognize the language of the input speech so that the knowledge component specific to that language can be activated in an ASR designed for more than one language. Performance of the ALR algorithm developed for three languages—Hindi, English and Telugu, is also discussed.", "num_citations": "1\n", "authors": ["896"]}
{"title": "Trial of irradiated infected blood as vaccine against babesiosis in cattle\n", "abstract": " [en] Irradiated blood infected with B, bigemina strain of Indian cattle has been studied as an immunizing agent against babesiosis. The method of Bishop and Adams (1974) was used to prepare irradiated vaccine. The infected blood was processed separately for 50 Kr and 60 Kr irradiation. The clinical reactions for both vaccinated and unvaccinated control male calves were studied after challenging them with B. bigemina infected erythrocytes. Observations indicated that irradiated vaccine shows appreciable immunizing effect in the vaccinated animals.(MGB)", "num_citations": "1\n", "authors": ["896"]}
{"title": "Studies on Prevalence, Prophylaxis and Immunity of babesia Bigemina Infection in Cattle\n", "abstract": " Krishikosh: Studies on Prevalence, Prophylaxis and Immunity of babesia Bigemina Infection in Cattle Skip navigation Beta Version Krishikosh Share Facebook Twitter WhatsApp LinkedIn | Register | Login My Krishikosh Receive email updates Edit Profile Advanced Search Toggle navigation Home Browse Communities & Collections Browse Items by: Date Author Title Subjects Disclaimer 3.Chaudhary Charan Singh Haryana Agricultural University, Hisar 4.Theses 5.Item View Thesis Studies on Prevalence, Prophylaxis and Immunity of babesia Bigemina Infection in Cattle Author(s) Prasad, Kaipl Deo Language(s) English Subject(s) Veterinary Parasitology URI http://krishikosh.egranth.ac.in/handle/1/5810075221 Appears in Collections: Theses Views 2 Downloads 0 Your Rating N/A Avg. Rating 0/5 (0 Reviews) Rating Breakup 5 0 4 0 3 0 2 0 1 0 Rating Comments 0 Rate this Item Facebook Twitter WhatsApp LinkedIn …", "num_citations": "1\n", "authors": ["896"]}
{"title": "Computerised reminders for non-receipt of periodical\n", "abstract": " Non-receipt of issues of periodicals is a common problem with any library. It is mainly due to loss in transit. The other reasons are wrong delivery, despatch of wrong issue number(forming duplicate), mistakes in accounting by the publisher etc.A librarian may probably satisfy the audit by showing letters with'extension of subscription' or'refund of money'but not the user who suffers a gap in the communication chain created by the missing issues. Timely effort has to be made to obviate the break in the information flow. The system developed helps in simplifying the process of sending reminders promptlv to acquire complete sets.", "num_citations": "1\n", "authors": ["896"]}