{"title": "What is Twitter, a social network or a news media?\n", "abstract": " Twitter, a microblogging service less than three years old, commands more than 41 million users as of July 2009 and is growing fast. Twitter users tweet about any topic within the 140-character limit and follow others to receive their tweets. The goal of this paper is to study the topological characteristics of Twitter and its power as a new medium of information sharing.", "num_citations": "8823\n", "authors": ["1188"]}
{"title": "I tube, you tube, everybody tubes: analyzing the world's largest user generated content video system\n", "abstract": " User Generated Content (UGC) is re-shaping the way people watch video and TV, with millions of video producers and consumers. In particular, UGC sites are creating new viewing patterns and social interactions, empowering users to be more creative, and developing new business opportunities. To better understand the impact of UGC systems, we have analyzed YouTube, the world's largest UGC VoD system. Based on a large amount of data collected, we provide an in-depth study of YouTube and other similar UGC systems. In particular, we study the popularity life-cycle of videos, the intrinsic statistical properties of requests and their relationship with video age, and the level of content aliasing or of illegal content in the system. We also provide insights on the potential for more efficient UGC VoD systems (eg utilizing P2P techniques or making better use of caching). Finally, we discuss the opportunities to …", "num_citations": "2089\n", "authors": ["1188"]}
{"title": "Analysis of topological characteristics of huge online social networking services\n", "abstract": " Social networking services are a fast-growing business in the Internet. However, it is unknown if online relationships and their growth patterns are the same as in real-life social networks. In this paper, we compare the structures of three online social networking services: Cyworld, MySpace, and orkut, each with more than 10 million users, respectively. We have access to complete data of Cyworld's ilchon (friend) relationships and analyze its degree distribution, clustering property, degree correlation, and evolution over time. We also use Cyworld data to evaluate the validity of snowball sampling method, which we use to crawl and obtain partial network topologies of MySpace and orkut. Cyworld, the oldest of the three, demonstrates a changing scaling behavior over time in degree distribution. The latest Cyworld data's degree distribution exhibits a multi-scaling behavior, while those of MySpace and orkut have simple …", "num_citations": "1344\n", "authors": ["1188"]}
{"title": "Analyzing the video popularity characteristics of large-scale user generated content systems\n", "abstract": " User generated content (UGC), now with millions of video producers and consumers, is reshaping the way people watch video and TV. In particular, UGC sites are creating new viewing patterns and social interactions, empowering users to be more creative, and generating new business opportunities. Compared to traditional video-on-demand (VoD) systems, UGC services allow users to request videos from a potentially unlimited selection in an asynchronous fashion. To better understand the impact of UGC services, we have analyzed the world's largest UGC VoD system, YouTube, and a popular similar system in Korea, Daum Videos. In this paper, we first empirically show how UGC services are fundamentally different from traditional VoD services. We then analyze the intrinsic statistical properties of UGC popularity distributions and discuss opportunities to leverage the latent demand for niche videos (or the so …", "num_citations": "558\n", "authors": ["1188"]}
{"title": "Comparison of online social relations in volume vs interaction: a case study of cyworld\n", "abstract": " Online social networking services are among the most popular Internet services according to Alexa. com and have become a key feature in many Internet services. Users interact through various features of online social networking services: making friend relationships, sharing their photos, and writing comments. These friend relationships are expected to become a key to many other features in web services, such as recommendation engines, security measures, online search, and personalization issues. However, we have very limited knowledge on how much interaction actually takes place over friend relationships declared online. A friend relationship only marks the beginning of online interaction.", "num_citations": "267\n", "authors": ["1188"]}
{"title": "Finding influentials based on the temporal order of information adoption in twitter\n", "abstract": " Twitter offers an explicit mechanism to facilitate information diffusion and has emerged as a new medium for communication. Many approaches to find influentials have been proposed, but they do not consider the temporal order of information adoption. In this work, we propose a novel method to find influentials by considering both the link structure and the temporal order of information adoption in Twitter. Our method finds distinct influentials who are not discovered by other methods.", "num_citations": "205\n", "authors": ["1188"]}
{"title": "The wisdom of the few: a collaborative filtering approach based on expert opinions from the web\n", "abstract": " Nearest-neighbor collaborative filtering provides a successful means of generating recommendations for web users. However, this approach suffers from several shortcomings, including data sparsity and noise, the cold-start problem, and scalability. In this work, we present a novel method for recommending items to users based on expert opinions. Our method is a variation of traditional collaborative filtering: rather than applying a nearest neighbor algorithm to the user-rating data, predictions are computed using a set of expert neighbors from an independent dataset, whose opinions are weighted according to their similarity to the user. This method promises to address some of the weaknesses in traditional collaborative filtering, while maintaining comparable accuracy. We validate our approach by predicting a subset of the Netflix data set. We use ratings crawled from a web portal of expert reviews, measuring …", "num_citations": "205\n", "authors": ["1188"]}
{"title": "Exploring cyberbullying and other toxic behavior in team competition online games\n", "abstract": " In this work we explore cyberbullying and other toxic behavior in team competition online games. Using a dataset of over 10 million player reports on 1.46 million toxic players along with corresponding crowdsourced decisions, we test several hypotheses drawn from theories explaining toxic behavior. Besides providing large-scale, empirical based understanding of toxic behavior, our work can be used as a basis for building systems to detect, prevent, and counter-act toxic behavior.", "num_citations": "202\n", "authors": ["1188"]}
{"title": "Fragile online relationship: a first look at unfollow dynamics in twitter\n", "abstract": " We analyze the dynamics of the behavior known as' unfollow'in Twitter. We collected daily snapshots of the online relationships of 1.2 million Korean-speaking users for 51 days as well as all of their tweets. We found that Twitter users frequently unfollow. We then discover the major factors, including the reciprocity of the relationships, the duration of a relationship, the followees' informativeness, and the overlap of the relationships, which affect the decision to unfollow. We conduct interview with 22 Korean respondents to supplement the quantitative results.", "num_citations": "195\n", "authors": ["1188"]}
{"title": "Didn't you see my message?: predicting attentiveness to mobile instant messages\n", "abstract": " Mobile instant messaging (eg, via SMS or WhatsApp) often goes along with an expectation of high attentiveness, ie, that the receiver will notice and read the message within a few minutes. Hence, existing instant messaging services for mobile phones share indicators of availability, such as the last time the user has been online. However, in this paper we not only provide evidence that these cues create social pressure, but that they are also weak predictors of attentiveness. As remedy, we propose to share a machine-computed prediction of whether the user will view a message within the next few minutes or not. For two weeks, we collected behavioral data from 24 users of mobile instant messaging services. By the means of machine-learning techniques, we identified that simple features extracted from the phone, such as the user's interaction with the notification center, the screen activity, the proximity sensor, and …", "num_citations": "188\n", "authors": ["1188"]}
{"title": "What is gab: A bastion of free speech or an alt-right echo chamber\n", "abstract": " Over the past few years, a number of new\" fringe\" communities, like 4chan or certain subreddits, have gained traction on the Web at a rapid pace. However, more often than not, little is known about how they evolve or what kind of activities they attract, despite recent research has shown that they influence how false information reaches mainstream communities. This motivates the need to monitor these communities and analyze their impact on the Web's information ecosystem. In August 2016, a new social network called Gab was created as an alternative to Twitter. It positions itself as putting\" people and free speech first\", welcoming users banned or suspended from other social networks. In this paper, we provide, to the best of our knowledge, the first characterization of Gab. We collect and analyze 22M posts produced by 336K users between August 2016 and January 2018, finding that Gab is predominantly used …", "num_citations": "154\n", "authors": ["1188"]}
{"title": "Stfu noob!: predicting crowdsourced decisions on toxic behavior in online games\n", "abstract": " One problem facing players of competitive games is negative, or toxic, behavior. League of Legends, the largest eSport game, uses a crowdsourcing platform called the Tribunal to judge whether a reported toxic player should be punished or not. The Tribunal is a two stage system requiring reports from those players that directly observe toxic behavior, and human experts that review aggregated reports. While this system has successfully dealt with the vague nature of toxic behavior by majority rules based on many votes, it naturally requires tremendous cost, time, and human efforts. In this paper, we propose a supervised learning approach for predicting crowdsourced decisions on toxic behavior with large-scale labeled data collections; over 10 million user reports involved in 1.46 million toxic players and corresponding crowdsourced decisions. Our result shows good performance in detecting overwhelmingly …", "num_citations": "144\n", "authors": ["1188"]}
{"title": "Breaking the news: First impressions matter on online news\n", "abstract": " A growing number of people are changing the way they consume news, replacing the traditional physical newspapers and magazines by their virtual online versions or/and weblogs. The interactivity and immediacy present in online news are changing the way news are being produced and exposed by media corporations. News websites have to create effective strategies to catch people’s attention and attract their clicks. In this paper we investigate possible strategies used by online news corporations in the design of their news headlines. We analyze the content of 69,907 headlines produced by four major global media corporations during a minimum of eight consecutive months in 2014. In order to discover strategies that could be used to attract clicks, we extracted features from the text of the news headlines related to the sentiment polarity of the headline. We discovered that the sentiment of the headline is strongly related to the popularity of the news and also with the dynamics of the posted comments on that particular news.", "num_citations": "135\n", "authors": ["1188"]}
{"title": "Mining communities in networks: a solution for consistency and its evaluation\n", "abstract": " Online social networks pose significant challenges to computer scientists, physicists, and sociologists alike, for their massive size, fast evolution, and uncharted potential for social computing. One particular problem that has interested us is community identification. Many algorithms based on various metrics have been proposed for communities in networks [18, 24], but a few algorithms scale to very large networks. Three recent community identification algorithms, namely CNM [16], Wakita [59], and Louvain [10], stand out for their scalability to a few millions of nodes. All of them use modularity as the metric of optimization. However, all three algorithms produce inconsistent communities every time the ordering of nodes to the algorithms changes.", "num_citations": "86\n", "authors": ["1188"]}
{"title": "Searching for a unique style in soccer\n", "abstract": " Is it possible to have a unique, recognizable style in soccer nowadays? We address this question by proposing a method to quantify the motif characteristics of soccer teams based on their pass networks. We introduce the the concept of \"flow motifs\" to characterize the statistically significant pass sequence patterns. It extends the idea of the network motifs, highly significant subgraphs that usually consists of three or four nodes. The analysis of the motifs in the pass networks allows us to compare and differentiate the styles of different teams. Although most teams tend to apply homogenous style, surprisingly, a unique strategy of soccer exists. Specifically, FC Barcelona's famous tiki-taka does not consist of uncountable random passes but rather has a precise, finely constructed structure.", "num_citations": "84\n", "authors": ["1188"]}
{"title": "High correlation of Middle East respiratory syndrome spread with Google search and Twitter trends in Korea\n", "abstract": " The Middle East respiratory syndrome coronavirus (MERS-CoV) was exported to Korea in 2015, resulting in a threat to neighboring nations. We evaluated the possibility of using a digital surveillance system based on web searches and social media data to monitor this MERS outbreak. We collected the number of daily laboratory-confirmed MERS cases and quarantined cases from May 11, 2015 to June 26, 2015 using the Korean government MERS portal. The daily trends observed via Google search and Twitter during the same time period were also ascertained using Google Trends and Topsy. Correlations among the data were then examined using Spearman correlation analysis. We found high correlations (> 0.7) between Google search and Twitter results and the number of confirmed MERS cases for the previous three days using only four simple keywords:“MERS”,“”(“MERS (in Korean)”),“”(“MERS symptoms …", "num_citations": "81\n", "authors": ["1188"]}
{"title": "Persona generation from aggregated social media data\n", "abstract": " We develop a methodology for persona generation using real time social media data for the distribution of products via online platforms. From a large social media account containing more than 30 million interactions from users from 181 countries engaging with more than 4,200 digital products produced by a global media corporation, we demonstrate that our methodology can first identify both distinct and impactful user segments and then create persona descriptions by automatically adding pertinent features, such as names, photos, and personal attributes. We validate our approach by implementing the methodology into an actual working system that leverages large scale online user data for generation of persona descriptions. We present the overall methodological approach, data analysis process, and system development. Findings show this method can develop believable personas representing real groups …", "num_citations": "75\n", "authors": ["1188"]}
{"title": "Anatomy of online hate: developing a taxonomy and machine learning models for identifying and classifying hate in online news media\n", "abstract": " Online social media platforms generally attempt to mitigate hateful expressions, as these comments can be detrimental to the health of the community. However, automatically identifying hateful comments can be challenging. We manually label 5,143 hateful expressions posted to YouTube and Facebook videos among a dataset of 137,098 comments from an online news media. We then create a granular taxonomy of different types and targets of online hate and train machine learning models to automatically detect and classify the hateful comments in the full dataset. Our contribution is twofold: 1) creating a granular taxonomy for hateful online comments that includes both types and targets of hateful comments, and 2) experimenting with machine learning, including Logistic Regression, Decision Tree, Random Forest, Adaboost, and Linear SVM, to generate a multiclass, multilabel classification model that automatically detects and categorizes hateful comments in the context of online news media. We find that the best performing model is Linear SVM, with an average F1 score of 0.79 using TF-IDF features. We validate the model by testing its predictive ability, and, relatedly, provide insights on distinct types of hate speech taking place on social media.", "num_citations": "73\n", "authors": ["1188"]}
{"title": "Customer segmentation using online platforms: isolating behavioral and demographic segments for persona creation via aggregated user data\n", "abstract": " We propose a novel approach for isolating customer segments using online customer data for products that are distributed via online social media platforms. We use non-negative matrix factorization to first identify behavioral customer segments and then to identify demographic customer segments. We employ a methodology for linking the two segments to present integrated and holistic customer segments, also known as personas. Behavioral segments are generated from customer interactions with online content. Demographic segments are generated using the gender, age, and location of these customers. In addition to evaluating our approach, we demonstrate its practicality via a system leveraging these customer segments to automatically generate personas, which are fictional but accurate representations of each integrated behavioral and demographic segment. Results show that this approach can …", "num_citations": "71\n", "authors": ["1188"]}
{"title": "Imaginary people representing real numbers: Generating personas from online social media data\n", "abstract": " We develop a methodology to automate creating imaginary people, referred to as personas, by processing complex behavioral and demographic data of social media audiences. From a popular social media account containing more than 30 million interactions by viewers from 198 countries engaging with more than 4,200 online videos produced by a global media corporation, we demonstrate that our methodology has several novel accomplishments, including: (a) identifying distinct user behavioral segments based on the user content consumption patterns; (b) identifying impactful demographics groupings; and (c) creating rich persona descriptions by automatically adding pertinent attributes, such as names, photos, and personal characteristics. We validate our approach by implementing the methodology into an actual working system; we then evaluate it via quantitative methods by examining the accuracy of …", "num_citations": "66\n", "authors": ["1188"]}
{"title": "Linguistic analysis of toxic behavior in an online video game\n", "abstract": " In this paper we explore the linguistic components of toxic behavior by using crowdsourced data from over 590 thousand cases of accused toxic players in a popular match-based competition game, League of Legends. We perform a series of linguistic analyses to gain a deeper understanding of the role communication plays in the expression of toxic behavior. We characterize linguistic behavior of toxic players and compare it with that of typical players in an online competition game. We also find empirical support describing how a player transitions from typical to toxic behavior. Our findings can be helpful to automatically detect and warn players who may become toxic and thus insulate potential victims from toxic playing in advance.", "num_citations": "66\n", "authors": ["1188"]}
{"title": "From cells to streets: Estimating mobile paths with cellular-side data\n", "abstract": " Through their normal operation, cellular networks are a repository of continuous location information from their subscribed devices. Such information, however, comes at a coarse granularity both in terms of space, as well as time. For otherwise inactive devices, location information can be obtained at the granularity of the associated cellular sector, and at infrequent points in time, that are sensitive to the structure of the network itself, and the level of mobility of the device. In this paper, we are asking the question of whether such sparse information can help to identify the paths followed by mobile connected devices throughout the day. If such a task is possible, then we would not only enable continuous mobility path estimation for smartphones, but also for the millions of future connected\" things\".", "num_citations": "62\n", "authors": ["1188"]}
{"title": "Structures of broken ties: exploring unfollow behavior on twitter\n", "abstract": " This study investigates unfollow behavior in Twitter, ie people removing others from their Twitter following lists. Considering the interdependency and dynamics of unfollow decisions, we use actor-oriented modeling (SIENA) to examine the impacts of reciprocity, status, embeddedness, homophily, and informativeness on tie dissolution. Focusing on ordinary users in tightly-knitted user groups, the results show that relational properties play key roles in the emergence of unfollow behavior: mutual following relations and common followees reduce the likelihood of unfollowing. And unfollow tends to be reciprocal: when a user is unfollowed by someone, he or she will unfollow back. However, there is no evidence of the impacts of homophily based on common interests and informativeness of interactions. The findings suggest that Twitter has many heterogeneous user groups and relational and informational factors may …", "num_citations": "54\n", "authors": ["1188"]}
{"title": "More of a receiver than a giver: why do people unfollow in Twitter?\n", "abstract": " We propose a logistic regression model taking into account two analytically different sets of factors–structure and action. The factors include individual, dyadic, and triadic properties between ego and alter whose tie breakup is under consideration. From the fitted model using a large-scale data, we discover 5 structural and 7 actional variables to have significant explanatory power for unfollow. One unique finding from our quantitative analysis is that people appreciate receiving acknowledgements from others even in virtually unilateral communication relationships and are less likely to unfollow them: people are more of a receiver than a giver.", "num_citations": "53\n", "authors": ["1188"]}
{"title": "A first look at global news coverage of disasters by using the gdelt dataset\n", "abstract": " In this work, we reveal the structure of global news coverage of disasters and its determinants by using a large-scale news coverage dataset collected by the GDELT (Global Data on Events, Location, and Tone) project that monitors news media in over 100 languages from the whole world. Significant variables in our hierarchical (mixed-effect) regression model, such as population, political stability, damage, and more, are well aligned with a series of previous research. However, we find strong regionalism in news geography, highlighting the necessity of comprehensive datasets for the study of global news coverage.", "num_citations": "45\n", "authors": ["1188"]}
{"title": "“Is More Better?” Impact of Multiple Photos on Perception of Persona Profiles\n", "abstract": " In this research, we investigate if and how more photos than a single headshot can heighten the level of information provided by persona profiles. We conduct eye-tracking experiments and qualitative interviews with variations in the photos: a single headshot, a headshot and images of the persona in different contexts, and a headshot with pictures of different people representing key persona attributes. The results show that more contextual photos significantly improve the information end users derive from a persona profile; however, showing images of different people creates confusion and lowers the informativeness. Moreover, we discover that choice of pictures results in various interpretations of the persona that are biased by the end users' experiences and preconceptions. The results imply that persona creators should consider the design power of photos when creating persona profiles.", "num_citations": "41\n", "authors": ["1188"]}
{"title": "Are personas done? Evaluating their usefulness in the age of digital analytics\n", "abstract": " In this research, we conceptually examine the use of personas in an age of large-scale online analytics data. Based on the criticism and benefits outlined in prior work and by practitioners working with online data, we formulate the major arguments for and against the use of personas given real-time online analytics data about customers, analyze these arguments, and demonstrate areas for the productive employment of data-driven personas by leveraging online analytics data in their creation. Our key tenet is that data-driven personas are located between aggregated and individual customer statistics. At their best, digital data-driven personas capture the coverage of the customer base attributed to aggregated data representations while retaining the interpretability of individual-level analytics; they benefit from powerful computational techniques and novel data sources. We discuss how digital data-driven personas can draw from technological advancements to remedy the notable concerns voiced by scholars and practitioners, including persona validation, inconsistency problem, and long development times. Finally, we outline areas of future research of personas in the context of online analytics. We argue that to survive in the rapidly developing online customer analytics industry, personas must evolve by adopting new practices.", "num_citations": "40\n", "authors": ["1188"]}
{"title": "Political Discussions in Homogeneous and Cross-Cutting Communication Spaces\n", "abstract": " Online platforms, such as Facebook, Twitter, and Reddit, provide users with a rich set of features for sharing and consuming political information, expressing political opinions, and exchanging potentially contrary political views. In such activities, two types of communication spaces naturally emerge: those dominated by exchanges between politically homogeneous users and those that allow and encourage crosscutting exchanges in politically heterogeneous groups. While research on political talk in online environments abounds, we know surprisingly little about the potentially varying nature of discussions in politically homogeneous spaces as compared to cross-cutting communication spaces. To fill this gap, we use Reddit to explore the nature of political discussions in homogeneous and cross-cutting communication spaces. In particular, we develop an analytical template to study interaction and linguistic patterns within and between politically homogeneous and heterogeneous communication spaces. Our analyses reveal different behavioral patterns in homogeneous and cross-cutting communications spaces. We discuss theoretical and practical implications in the context of research on political talk online.", "num_citations": "33\n", "authors": ["1188"]}
{"title": "Are you Charlie or Ahmed? Cultural pluralism in Charlie Hebdo response on Twitter\n", "abstract": " We study the response to the Charlie Hebdo shootings of January 7, 2015 on Twitter across the globe. We ask whether the stances on the issue of freedom of speech can be modeled using established sociological theories, including Huntington's culturalist Clash of Civilizations, and those taking into consideration social context, including Density and Interdependence theories. We find support for Huntington's culturalist explanation, in that the established traditions and norms of one's\" civilization\" predetermine some of one's opinion. However, at an individual level, we also find social context to play a significant role, with non-Arabs living in Arab countries using# JeSuisAhmed (\" I am Ahmed\") five times more often when they are embedded in a mixed Arab/non-Arab (mention) network. Among Arabs living in the West, we find a great variety of responses, not altogether associated with the size of their expatriate community, suggesting other variables to be at play.", "num_citations": "33\n", "authors": ["1188"]}
{"title": "Personas for content creators via decomposed aggregate audience statistics\n", "abstract": " We propose a novel method for generating personas based on online user data for the increasingly common situation of content creators distributing products via online platforms. We use non-negative matrix factorization to identify user segments and develop personas by adding personality such as names and photos. Our approach can develop accurate personas representing real groups of people using online user data, versus relying on manually gathered data.", "num_citations": "32\n", "authors": ["1188"]}
{"title": "Assessing the accuracy of four popular face recognition tools for inferring gender, age, and race\n", "abstract": " In this research, we evaluate four widely used face detection tools, which are Face++, IBM Bluemix Visual Recognition, AWS Rekognition, and Microsoft Azure Face API, using multiple datasets to determine their accuracy in inferring user attributes, including gender, race, and age. Results show that the tools are generally proficient at determining gender, with accuracy rates greater than 90%, except for IBM Bluemix. Concerning race, only one of the four tools provides this capability, Face++, with an accuracy rate of greater than 90%, although the evaluation was performed on a high-quality dataset. Inferring age appears to be a challenging problem, as all four tools performed poorly. The findings of our quantitative evaluation are helpful for future computational social science research using these tools, as their accuracy needs to be taken into account when applied to classifying individuals on social media and other contexts. Triangulation and manual verification are suggested for researchers employing these tools.", "num_citations": "30\n", "authors": ["1188"]}
{"title": "From 2,772 segments to five personas: Summarizing a diverse online audience by generating culturally adapted personas\n", "abstract": " Understanding users in the era of social media is challenging, requiring organizations to adopt novel computation-aided approaches. To exemplify such an approach, we retrieved information on millions of interactions with YouTube video content from a major Middle Eastern media outlet, to automatically generate personas that capture how different audience segments interact with thousands of individual content pieces. Then, we used qualitative data to provide additional insights into the automatically generated persona profiles. Our findings provide insights into social media usage in the Middle East and demonstrate the application of a novel methodology that generates culturally adapted personas of social media audiences, summarizing complex social analytics data into human portrayals that are easy to understand by end users in real organizations.", "num_citations": "29\n", "authors": ["1188"]}
{"title": "Generating cultural personas from social data: a perspective of Middle Eastern users\n", "abstract": " We conduct a mixed-method study to better understand the content consumption patterns of Middle Eastern social media users and to explore new ways to present online data by using automatic persona generation. First, we analyze millions of content interactions on YouTube to dynamically generate personas describing behavioral patterns of different demographic groups. Second, we analyze interview data on social media users in the Middle Eastern region to generate additional insights into the dynamically generated personas. Our findings provide insights into social media users in the Middle East, as well as present a novel methodology of using computational analysis and qualitative data enrichment to generate descriptive and culturally receptive personas from social media audiences.", "num_citations": "29\n", "authors": ["1188"]}
{"title": "Towards automatic persona generation using social media\n", "abstract": " The use of personas is an interactive design technique with considerable potential for product and content development. However, personas have typically been viewed as fairly static. In this research, we implement an approach for creating personas in real time, based on automated analysis of actual social media data, integrating data from Facebook, Twitter, and YouTube channels for a large commercial organization. From Twitter, we gather user insights representing interests and viewpoints, leveraging approximately 195,000 follower profiles. From YouTube, we gather demographic data and topical interests, leveraging more than 188,000 subscriber profiles and millions of user interactions. From Facebook, we collect instances of hundreds of thousands of link sharing by more than 54,000 social media followers, specifically examining the domains these users share. We integrate the social media data from all …", "num_citations": "29\n", "authors": ["1188"]}
{"title": "SemAxis: A Lightweight Framework to Characterize Domain-Specific Word Semantics Beyond Sentiment\n", "abstract": " Because word semantics can substantially change across communities and contexts, capturing domain-specific word semantics is an important challenge. Here, we propose SEMAXIS, a simple yet powerful framework to characterize word semantics using many semantic axes in word- vector spaces beyond sentiment. We demonstrate that SEMAXIS can capture nuanced semantic representations in multiple online communities. We also show that, when the sentiment axis is examined, SEMAXIS outperforms the state-of-the-art approaches in building domain-specific sentiment lexicons.", "num_citations": "28\n", "authors": ["1188"]}
{"title": "Automatic generation of personas using youtube social media data\n", "abstract": " We develop and implement an approach for automating generating personas in real time using actual YouTube social media data from a global media corporation. From the organization's YouTube channel, we gather demographic data, customer interactions, and topical interests, leveraging more than 188,000 subscriber profiles and more than 30 million user interactions. We demonstrate that online user data can be used to develop personas in real time using social media analytics. To get diverse aspects of personas, we collect user data from other social media channels as well and match them with the corresponding user data to generate richer personas. Our results provide corporate insights into competitive marketing, topical interests, and preferred product features for the users of the online news medium. Research implications are that reasonably rich personas can be generated in real time, instead of being the result of a laborious and time-consuming manual development process.", "num_citations": "28\n", "authors": ["1188"]}
{"title": "Persona perception scale: Developing and validating an instrument for human-like representations of data\n", "abstract": " Personas are widely used in software development, system design, and HCI studies. Yet, their evaluation is difficult, and there are no recognized and validated measurement scales to date. To improve this condition, this research develops a persona perception scale based on reviewing relevant literature. We validate the scale through a pilot study with 19 participants, each evaluating three personas (57 evaluations in total). This is the first reported effort to systematically develop and validate an instrument for persona perception measurement. We find the constructs and items of the scale perform well, with factor loadings ranging between 0.60 and 0.95. Reliability, measured as Cronbach's Alpha, is also satisfactory, encouraging us to pursue the use of the scale with a larger sample in future work.", "num_citations": "27\n", "authors": ["1188"]}
{"title": "Method for predicting reactiveness of users of mobile devices for mobile messaging\n", "abstract": " A method for predicting reactiveness of MMI users com prises: reacting to a message with a mobile user device which is a receiver of the message, collecting ground-truth data (11) for a machine-learning classifier, extracting from the collected ground-truth data (11) a list of features (12) which determines a current or past context of the user, and each feature having a feature’s predic tion strength calculated as fraction of classes misclassi fied when removing the feature; selecting the list of features (12) based on each features prediction strength; defining a plurality of reactiveness classes (101); both the extracted list of features (12) and the reactiveness classes (101) being input to the machine-learning clas sifier; classifying (102) the user according to the defined reactive ness classes (101): predicting the user's reactiveness for the given current or past context of the user by determining the most likely reactiveness …", "num_citations": "27\n", "authors": ["1188"]}
{"title": "Confusion and information triggered by photos in persona profiles\n", "abstract": " We investigate whether additional photos beyond a single headshot makes a persona profile more informative without confusing the end user. We conduct an eye-tracking experiment and qualitative interviews with digital content creators after varying the persona in photos via a single headshot, a headshot and photo of the persona in different contexts, and a headshot with photos of different people with key persona attributes the gender and age. Findings show that contextual photos provide significantly more persona information to end users; however, showing photos of multiple people engenders confusion and lowers informativeness. Also, as anticipated, viewing additional photos requires more cognitive focus, which is measured by eye-tracking metrics; these metrics are correlated with levels of informativeness and confusion. Furthermore, various interpretations of the persona based on the choice of photos …", "num_citations": "24\n", "authors": ["1188"]}
{"title": "Two tales of the world: Comparison of widely used world news datasets GDELT and EventRegistry\n", "abstract": " In this work, we compare GDELT and Event Registry, which monitor news articles worldwide and provide big data to researchers regarding scale, news sources, and news geography. We found significant differences in scale and news sources, but surprisingly, we observed high similarity in news geography between the two datasets. In this work, we compare GDELT and Event Registry, which monitor news articles worldwide and provide big data to researchers regarding scale, news sources, and news geography. We found significant differences in scale and news sources, but surprisingly, we observed high similarity in news geography between the two datasets. In this work, we compare GDELT and Event Registry, which monitor news articles worldwide and provide big data to researchers regarding scale, news sources, and news geography. We found significant differences in scale and news sources, but surprisingly, we observed high similarity in news geography between the two datasets.", "num_citations": "22\n", "authors": ["1188"]}
{"title": "Understanding news geography and major determinants of global news coverage of disasters\n", "abstract": " In this work, we reveal the structure of global news coverage of disasters and its determinants by using a large-scale news coverage dataset collected by the GDELT (Global Data on Events, Location, and Tone) project that monitors news media in over 100 languages from the whole world. Significant variables in our hierarchical (mixed-effect) regression model, such as the number of population, the political stability, the damage, and more, are well aligned with a series of previous research. Yet, strong regionalism we found in news geography highlights the necessity of the comprehensive dataset for the study of global news coverage.", "num_citations": "22\n", "authors": ["1188"]}
{"title": "Automatic Persona Generation (APG) A Rationale and Demonstration\n", "abstract": " We present Automatic Persona Generation (APG), a methodology and system for quantitative persona generation using large amounts of online social media data. The system is operational, beta deployed with several client organizations in multiple industry verticals and ranging from small-to-medium sized enterprises to large multi-national corporations. Using a robust web framework and stable back-end database, APG is currently processing tens of millions of user interactions with thousands of online digital products on multiple social media platforms, such as Facebook and YouTube. APG identifies both distinct and impactful user segments and then creates persona descriptions by automatically adding pertinent features, such as names, photos, and personal attributes. We present the overall methodological approach, architecture development, and main system features. APG has a potential value for …", "num_citations": "21\n", "authors": ["1188"]}
{"title": "Tower of Babel: a crowdsourcing game building sentiment lexicons for resource-scarce languages\n", "abstract": " With the growing amount of textual data produced by online social media today, the demands for sentiment analysis are also rapidly increasing; and, this is true for worldwide. However, non-English languages often lack sentiment lexicons, a core resource in performing sentiment analysis. Our solution, Tower of Babel (ToB), is a language-independent sentiment-lexicon-generating crowdsourcing game. We conducted an experiment with 135 participants to explore the difference between our solution and a conventional manual annotation method. We evaluated ToB in terms of effectiveness, efficiency, and satisfactions. Based on the result of the evaluation, we conclude that sentiment classification via ToB is accurate, productive and enjoyable.", "num_citations": "21\n", "authors": ["1188"]}
{"title": "Impact of snowball sampling ratios on network characteristics estimation: A case study of cyworld\n", "abstract": " Today's social networking services have tens of millions of users, and are growing fast. Their sheer size poses a significant challenge in capturing and analyzing their topological characteristics. Snowball sampling is a popular method to crawl and sample network topologies, but requires a high sampling ratio for accurate estimation of certain metrics. In this work, we evaluate how close topological characteristics of snowball sampled networks are to the complete network. Instead of using a synthetically generated topology, we use the complete topology of Cyworld ilchon network. The goal of this work is to determine sampling ratios for accurate estimation of key topological characteristics, such as the degree distribution, the degree correlation, the assortativity, and the clustering coefficient.", "num_citations": "18\n", "authors": ["1188"]}
{"title": "Detecting Toxicity Triggers in Online Discussions\n", "abstract": " Despite the considerable interest in the detection of toxic comments, there has been little research investigating the causes--ie, triggers--of toxicity. In this work, we first propose a formal definition of triggers of toxicity in online communities. We proceed to build an LSTM neural network model using textual features of comments, and then, based on a comprehensive review of previous literature, we incorporate topical and sentiment shift in interactions as features. Our model achieves an average accuracy of 82.5% of detecting toxicity triggers from diverse Reddit communities.", "num_citations": "17\n", "authors": ["1188"]}
{"title": "Automatic persona generation for online content creators: Conceptual rationale and a research agenda\n", "abstract": " As the quantity of social and online analytics data has drastically increased, a wide variety of methods are deployed to make sense of this data, typically via computational and algorithmic approaches. However, in many cases, these approaches trade one form of complexity for another by ignoring the principles of human cognitive processing. In this perspective manuscript, we propose an approach of employing Personas as an alternative form of making large volumes of online user analytics information useful to end users of the user and customer analytics, with results applicable in software development, business sectors, communication industry, and other domains where understanding online user behavior is deemed important. Toward this end, we have developed a system that automatically generates data-driven Personas from social media and online analytics data, capable of handling hundreds of …", "num_citations": "17\n", "authors": ["1188"]}
{"title": "Who are your users? comparing media professionals' preconception of users to data-driven personas\n", "abstract": " 1 One of the reasons for using personas is to align user understandings across project teams and sites. As part of a larger persona study, at Al Jazeera English (AJE), we conducted 16 qualitative interviews with media producers, the end users of persona descriptions. We asked the participants about their understanding of a typical AJE media consumer, and the variety of answers shows that the understandings are not aligned and are built on a mix of own experiences, own self, assumptions, and data given by the company. The answers are sometimes aligned with the data-driven personas and sometimes not. The end users are divided in two groups: news producers who have little interest in having data-based insights of news consumers and producers for social media platforms who have more interest in this information.", "num_citations": "17\n", "authors": ["1188"]}
{"title": "What We Read, What We Search: Media Attention and Public Attention Among 193 Countries\n", "abstract": " We investigate the alignment of international attention of news media organizations within 193 countries with the expressed international interests of the public within those same countries from March 7, 2016 to April 14, 2017. We collect fourteen months of longitudinal data of online news from Unfiltered News and web search volume data from Google Trends and build a multiplex network of media attention and public attention in order to study its structural and dynamic properties. Structurally, the media attention and the public attention are both similar and different depending on the resolution of the analysis. For example, we find that 63.2% of the country-specific media and the public pay attention to different countries, but local attention flow patterns, which are measured by network motifs, are very similar. We also show that there are strong regional similarities with both media and public attention that is only …", "num_citations": "16\n", "authors": ["1188"]}
{"title": "Revealing the Hidden Patterns of News Photos: Analysis of Millions of News Photos Using GDELT and Deep Learning-based Vision APIs\n", "abstract": " In this work, we analyze more than two million news photos published in January 2016. We demonstrate i) which objects appear the most in news photos; ii) what the sentiments of news photos are; iii) whether the sentiment of news photos is aligned with the tone of the text; iv) how gender is treated; and v) how differently political candidates are portrayed. To our best knowledge, this is the first large-scale study of news photo contents using deep learning-based vision APIs.", "num_citations": "16\n", "authors": ["1188"]}
{"title": "Automatically conceptualizing social media analytics data via personas\n", "abstract": " Social media analytics is insightful but can also be difficult to use within organizations. To address this, we present Automatic Persona Generation (APG), a system and methodology for quantitatively generating personas using large amounts of online social media data. The APG system is operational, deployed in a pilot version with several organizations in multiple industry verticals. APG uses a robust web and stable back-end database framework to process tens of millions of user interactions with thousands of online digital products on multiple social media platforms, including Facebook and YouTube. APG identifies both distinct and impactful audience segments for an organization to create persona profiles by enhancing the social media analytics data with pertinent features, such as names, photos, interests, etc. We demonstrate the architecture development, and main system features. APG provides value for organizations distributing content via online platforms and is unique in its approach to leveraging social media data for audience understanding. APG is online at https://persona. qcri. org.", "num_citations": "15\n", "authors": ["1188"]}
{"title": "Consumers and suppliers: attention asymmetries. A case study of Al Jazeera’s news coverage and comments\n", "abstract": " In the last decades researchers have devoted a fair amount of effort to understand the news geography, ie a description of the general patterns for which countries are presented in which other countries’ news. These efforts presume that published opinion is a good enough proxy to infer such perception; indeed, that is the case when no other evidence is available. In this work we uncover a new point of view, that of consumers, relying on a rich data set related to the comments posted by users on the largest news media organization in the Middle East region, namely Aljazeera Network. Each comment comes with a body content, a unique identifier of the user, and her IP address, which makes it possible to infer the countries from which comments are posted. All in all, our analysis encompasses over 20,000 articles and more than 2 million comments posted by 90,000 unique readers. Such a rich data set allows us confronting for the first time–to the best of our knowledge–the producer-consumer standpoints.", "num_citations": "15\n", "authors": ["1188"]}
{"title": "FrameAxis: characterizing microframe bias and intensity with word embedding\n", "abstract": " Framing is a process of emphasizing a certain aspect of an issue over the others, nudging readers or listeners towards different positions on the issue even without making a biased argument. Here, we propose FrameAxis, a method for characterizing documents by identifying the most relevant semantic axes (“microframes”) that are overrepresented in the text using word embedding. Our unsupervised approach can be readily applied to large datasets because it does not require manual annotations. It can also provide nuanced insights by considering a rich set of semantic axes. FrameAxis is designed to quantitatively tease out two important dimensions of how microframes are used in the text. Microframe bias captures how biased the text is on a certain microframe, and microframe intensity shows how prominently a certain microframe is used. Together, they offer a detailed characterization of the text. We demonstrate that microframes with the highest bias and intensity align well with sentiment, topic, and partisan spectrum by applying FrameAxis to multiple datasets from restaurant reviews to political news. The existing domain knowledge can be incorporated into FrameAxis by using custom microframes and by using FrameAxis as an iterative exploratory analysis instrument. Additionally, we propose methods for explaining the results of FrameAxis at the level of individual words and documents. Our method may accelerate scalable and sophisticated computational analyses of framing across disciplines.", "num_citations": "14\n", "authors": ["1188"]}
{"title": "Findings of a user study of automatically generated personas\n", "abstract": " We report findings and implications from a semi-naturalistic user study of a system for Automatic Persona Generation (APG) using large-scale audience data of an organization's social media channels conducted at the workplace of a major international corporation. Thirteen participants from a range of positions within the company engaged with the system in a use case scenario. We employed a variety of data collection methods, including mouse tracking and survey data, analyzing the data with a mixed method approach. Results show that having an interactive system may aid in keeping personas at the forefront while making customer-centric decisions and indicate that data-driven personas fulfill information needs of decision makers by mixing personas and numerical data. The findings have implications for the design of persona systems and the use of online analytics data to better understand users and customers.", "num_citations": "13\n", "authors": ["1188"]}
{"title": "Influentials ranking in social networks\n", "abstract": " 각 노드는 가라데 클럽의 구성원을 나타내며, 운동또는 클럽 미팅 시 두 노드 사이에 지속적으로 상호작용이 존재할 경우 그 두 노드들은 엣지로 연결 된다. 이 가라데 클럽은 의견 대립으로 인해 두 개의 파벌로 나뉘어 있었다. 그렇다면 이런 가라데 클럽에서 가", "num_citations": "13\n", "authors": ["1188"]}
{"title": "Are These Comments Triggering? Predicting Triggers of Toxicity in Online Discussions\n", "abstract": " Understanding the causes or triggers of toxicity adds a new dimension to the prevention of toxic behavior in online discussions. In this research, we define toxicity triggers in online discussions as a non-toxic comment that lead to toxic replies. Then, we build a neural network-based prediction model for toxicity trigger. The prediction model incorporates text-based features and derived features from previous studies that pertain to shifts in sentiment, topic flow, and discussion context. Our findings show that triggers of toxicity contain identifiable features and that incorporating shift features with the discussion context can be detected with a ROC-AUC score of 0.87. We discuss implications for online communities and also possible further analysis of online toxicity and its root causes.", "num_citations": "12\n", "authors": ["1188"]}
{"title": "What Was Written vs. Who Read It: News Media Profiling Using Text Analysis and Social Media Context\n", "abstract": " Predicting the political bias and the factuality of reporting of entire news outlets are critical elements of media profiling, which is an understudied but an increasingly important research direction. The present level of proliferation of fake, biased, and propagandistic content online, has made it impossible to fact-check every single suspicious claim, either manually or automatically. Alternatively, we can profile entire news outlets and look for those that are likely to publish fake or biased content. This approach makes it possible to detect likely \"fake news\" the moment they are published, by simply checking the reliability of their source. From a practical perspective, political bias and factuality of reporting have a linguistic aspect but also a social context. Here, we study the impact of both, namely (i) what was written (i.e., what was published by the target medium, and how it describes itself on Twitter) vs. (ii) who read it (i.e., analyzing the readers of the target medium on Facebook, Twitter, and YouTube). We further study (iii) what was written about the target medium on Wikipedia. The evaluation results show that what was written matters most, and that putting all information sources together yields huge improvements over the current state-of-the-art.", "num_citations": "12\n", "authors": ["1188"]}
{"title": "Consistent community identification in complex networks\n", "abstract": " We have found that known community identification algorithms produce inconsistent communities when the node ordering changes at input. We propose two metrics to quantify the level of consistency across multiple runs of an algorithm: pairwise membership probability and consistency. Based on these two metrics, we address the consistency problem without compromising the modularity. Our solution uses pairwise membership probabilities as link weights and generates consistent communities within six or fewer cycles. It offers a new tool in the study of community structures and their evolutions.", "num_citations": "11\n", "authors": ["1188"]}
{"title": "Persona Perception Scale: Development and Exploratory Validation of an Instrument for Evaluating Individuals’ Perceptions of Personas\n", "abstract": " Although used in many domains, the evaluation of personas is difficult due to the lack of validated measurement instruments. To tackle this challenge, we propose the Persona Perception Scale (PPS), a survey instrument for evaluating how individuals perceive personas. We develop the scale by reviewing relevant literature from social psychology, persona studies, and Human-Computer Interaction to find relevant constructs and items for measuring persona perceptions. Following initial pilot testing, we conduct an exploratory validation of the scale with 412 respondents and find that the constructs and items of the scale perform satisfactorily for deployment. The research has implications for both academic researchers and persona developers. Using the PPS, researchers and designers can evaluate how different persona designs affect individual perceptions of personas, for example persona users’ (e.g., designers …", "num_citations": "10\n", "authors": ["1188"]}
{"title": "Fixation and Confusion: Investigating Eye-tracking Participants' Exposure to Information in Personas\n", "abstract": " To more effectively convey relevant information to end users of persona profiles, we conducted a user study consisting of 29 participants engaging with three persona layout treatments. We were interested in confusion engendered by the treatments on the participants, and conducted a within-subjects study in the actual work environment, using eye-tracking and talk-aloud data collection. We coded the verbal data into classes of informativeness and confusion and correlated it with fixations and durations on the Areas of Interests recorded by the eye-tracking device. We used various analysis techniques, including Mann-Whitney, regression, and Levenshtein distance, to investigate how confused users differed from non-confused users, what information of the personas caused confusion, and what were the predictors of confusion of end users of personas. We consolidate our various findings into a confusion ratio …", "num_citations": "10\n", "authors": ["1188"]}
{"title": "Inferring social media users’ demographics from profile pictures: A Face++ analysis on Twitter users\n", "abstract": " In this research, we evaluate the applicability of using facial recognition of social media account profile pictures to infer the demographic attributes of gender, race, and age of the account owners leveraging a commercial and well-known image service, specifically Face++. Our goal is to determine the feasibility of this approach for actual system implementation. Using a dataset of approximately 10,000 Twitter profile pictures, we use Face++ to classify this set of images for gender, race, and age. We determine that about 30% of these profile pictures contain identifiable images of people using the current state-of-the-art automated means. We then employ human evaluations to manually tag both the set of images that were determined to contain faces and the set that was determined not to contain faces, comparing the results to Face++. Of the thirty percent that Face++ identified as containing a face, about 80% are more likely than not the account holder based on our manual classification, with a variety of issues in the remaining 20%. Of the images that Face++ was unable to detect a face, we isolate a variety of likely issues preventing this detection, when a face actually appeared in the image. Overall, we find the applicability of automatic facial recognition to infer demographics for system development to be problematic, despite the reported high accuracy achieved for image test collections.", "num_citations": "10\n", "authors": ["1188"]}
{"title": "Connecting users with similar interests across multiple web services\n", "abstract": " Most online social networking services provide a feature for users to build groups. The web service has both user profiles describing user interests and behavior data such as browsing contents. It can assist users to join groups by recommending relevant groups. In this paper, we have proposed a novel method to connect users across multiple services based on user-labeled tags. Tags represent interests of a user and have advantages in terms of the privacy, up-to-dateness, and service coverage. We have collected tags from six popular web services. We have analyzed tag usage patterns and observed that the popularity of tags is highly skewed and dependent on the web services. We have also found that frequently used tags of a single user change over time. Through user study, we show that the vector space model combined with intra-personomy normalization is the promising to find other users with similar interests.", "num_citations": "10\n", "authors": ["1188"]}
{"title": "What gets media attention and how media attention evolves over time: large-scale empirical evidence from 196 countries\n", "abstract": " It is known that news topics, covered more frequently and over longer periods of time, are considered to be important to the public. Hence, what gets media attention and how media attention evolves over time has been studied for decades in communication study. However, previous studies are confined to a few countries or a few topics, mainly due to lack of longitudinal global data. In this work, we use a large-scale news data compiled from 196 countries to provide empirical analyses of media attention dynamics.", "num_citations": "8\n", "authors": ["1188"]}
{"title": "Understanding topological mesoscale features in community mining\n", "abstract": " Community detection has been one of the major topics in complex network research. Recently, several greedy algorithms for networks of millions of nodes have been proposed, but one of their limitations is inconsistency of outcomes. Kwak et al. propose an iterative reinforcing approach to eliminate inconsistency in detected communities. In this paper we delve into structural characteristics of communities identified by Kwak's method with 12 real networks. We find that about 40% of nodes are grouped into communities in an inconsistent way in Orkut and Cyworld. Interestingly, they are only two out of 12 networks whose community size distribution follow power-law. As a first step towards interpretation of communities, we use Guimera and Amaral's method to classify nodes into seven classes based on the z-score and the participation coefficient. Using the z-P analysis, we identify the roles of nodes in Karate and …", "num_citations": "8\n", "authors": ["1188"]}
{"title": "Confusion Prediction from Eye-Tracking Data: Experiments with Machine Learning\n", "abstract": " Predicting user confusion can help improve information presentation on websites, mobile apps, and virtual reality interfaces. One promising information source for such prediction is eye-tracking data about gaze movements on the screen. Coupled with think-aloud records, we explore if user's confusion is correlated with primarily fixation-level features. We find that random forest achieves an accuracy of more than 70% when prediction user confusion using only fixation features. In addition, adding user-level features (age and gender) improves the accuracy to more than 90%. We also find that balancing the classes before training improves performance. We test two balancing algorithms, Synthetic Minority Over Sampling Technique (SMOTE) and Adaptive Synthetic Sampling (ADASYN) finding that SMOTE provides a higher performance increase. Overall, this research contains implications for researchers interested …", "num_citations": "7\n", "authors": ["1188"]}
{"title": "Culturally-grounded analysis of everyday creativity in social media: A case study in Qatari context\n", "abstract": " In deploying social media and other information technologies often not designed with MENA (the Middle East and North Africa) cultures in mind, users generate creative approaches to self-representation using virtual identities while preserving their cultural values. To understand and further empower such approaches, we present a mixed-method of computational and qualitative study, focusing on Qatar as a case of such communities in the MENA region. We analyzed a dataset of over 42,000 publicly available social media profiles using computational approaches (archetypal analysis) and qualitatively analyzed a separate set of 255 profiles. We augmented our descriptions with semi-structured interviews. As a result, we delineate a set of five needs/values exhibited by Qatari users supporting their creativity in effectively using virtual identities: Khaleeji features, self-expression, social connections, social monitoring …", "num_citations": "7\n", "authors": ["1188"]}
{"title": "Data-driven approach to measuring the level of press freedom using media attention diversity from unfiltered news\n", "abstract": " Published by Reporters Without Borders every year, the Press Freedom Index (PFI) reflects the fear and tension in the newsroom pushed by the government and private sectors. While the PFI is invaluable in monitoring media environments worldwide, the current survey-based method has inherent limitations to updates in terms of cost and time. In this work, we introduce an alternative way to measure the level of press freedom using media attention diversity compiled from Unfiltered News.", "num_citations": "7\n", "authors": ["1188"]}
{"title": "A Systematic Media Frame Analysis of 1.5 Million New York Times Articles from 2000 to 2017\n", "abstract": " Framing is an indispensable narrative device for news media because even the same facts may lead to conflicting understandings if deliberate framing is employed. Therefore, identifying media framing is a crucial step to understanding how news media influence the public. Framing is, however, difficult to operationalize and detect, and thus traditional media framing studies had to rely on manual annotation, which is challenging to scale up to massive news datasets. Here, by developing a media frame classifier that achieves state-of-the-art performance, we systematically analyze the media frames of 1.5 million New York Times articles published from 2000 to 2017. By examining the ebb and flow of media frames over almost two decades, we show that short-term frame abundance fluctuation closely corresponds to major events, while there also exist several long-term trends, such as the gradually increasing …", "num_citations": "6\n", "authors": ["1188"]}
{"title": "I Would Not Plant Apple Trees If the World Will Be Wiped: Analyzing Hundreds of Millions of Behavioral Records of Players During an MMORPG Beta Test\n", "abstract": " In this work, we use player behavior during the closed beta test of the MMORPG ArcheAge as a proxy for an extreme situation: at the end of the closed beta test, all user data is deleted, and thus, the outcome (or penalty) of players' in-game behaviors in the last few days loses its meaning. We analyzed 270 million records of player behavior in the 4th closed beta test of ArcheAge. Our findings show that there are no apparent pandemic behavior changes, but some outlierswere more likely to exhibit anti-social behavior (eg, player killing). We also found that contrary to the reassuring adage that``Even if I knew the world would go to pieces tomorrow, I would still plant my apple tree,''players abandoned character progression, showing a drastic decrease in quest completion, leveling, and ability changes at the end of the beta test.", "num_citations": "6\n", "authors": ["1188"]}
{"title": "Has much potential but biased: exploring the scholarly landscape in twitter\n", "abstract": " We explore how research papers are shared in Twitter to understand its potential and limitation of the current practice that measures or predicts the scientific impact of research papers from the web. We track 54 second-level domains offering the top 100 journals listed in Google Scholar and collect 403,165 tweets sharing 75,677 unique research papers by 142,743 users over the course of 135 days. Our findings show the great potential of Twitter as a platform for paper sharing, but at the same time, indicate the limitations of measuring scientific impact through the lens of social media mainly due to the highly skewed and limited attention to few number of top journals.", "num_citations": "6\n", "authors": ["1188"]}
{"title": "Recommender system based on expert opinions\n", "abstract": " The invention refers to a method and system for recommending items of interest to a target and more particularly to a recommender system predicting user interest based on expert opinions.", "num_citations": "6\n", "authors": ["1188"]}
{"title": "Social media mining for journalism\n", "abstract": " The exponential growth of social media as a central communication practice, and its agility in capturing and announcing breaking news events more rapidly than traditional media, has changed the journalistic landscape: social media has been adopted as a significant source by professional journalists, and conversely, citizens are able to use social media as a form of direct reportage. This brings along new opportunities for newsrooms and journalists by providing new means for newsgathering through access to a wealth of citizen reportage and updates about current affairs, as well as an additional showcase for news dissemination.In addition to being a big opportunity and having changed the day-to-day practices in the newsrooms, social media has introduced a number of challenges when it comes to newsgathering, verification, production, reporting and dissemination. These include real-time monitoring of …", "num_citations": "5\n", "authors": ["1188"]}
{"title": "Novel aspects coming from the directionality of online relationships: a case study of Twitter by Haewoon Kwak, Changhyun Lee, Hosung Park, Hyunwoo Chun and Sue Moon with Ching …\n", "abstract": " The online relationship in Twitter, known as follow, is directed. People can follow any other person without an approval. In this article we show novel aspects of Twitter that come from the directionality in relationships: topological characteristics of the directed network, word-of-mouth information spreading via retweet, and online relationship dissolution. We wrap up the article with future directions in our information diffusion study.", "num_citations": "5\n", "authors": ["1188"]}
{"title": "Empirical Evaluation of Three Common Assumptions in Building Political Media Bias Datasets\n", "abstract": " In this work, we empirically validate three common assumptions in building political media bias datasets, which are (i) labelers' political leanings do not affect labeling tasks,(ii) news articles follow their source outlet's political leaning, and (iii) political leaning of a news outlet is stable across different topics. We build a ground-truth dataset of manually annotated article-level political leaning and validate the three assumptions. Our findings warn that the three assumptions could be invalid even for a small dataset. We hope that our work calls attention to the (in) validity of common assumptions in building political media bias datasets.", "num_citations": "4\n", "authors": ["1188"]}
{"title": "\" Trust me, I have a Ph. D.\": A Propensity Score Analysis on the Halo Effect of Disclosing One's Offline Social Status in Online Communities\n", "abstract": " Online communities adopt various reputation schemes to measure content quality. This study analyzes the effect of a new reputation scheme that exposes one's offline social status, such as an education degree, within an online community. We study two Reddit communities that adopted this scheme, whereby posts include tags identifying education status referred to as flairs, and we examine how the “transferred” social status affects the interactions among the users. We computed propensity scores to test whether flairs give ad-hoc authority to the adopters while minimizing the effects of confounding variables such as topics of content. The results show that exposing academic degrees is likely to lead to higher audience votes as well as larger discussion size, compared to the users without the disclosed identities, in a community that covers peer-reviewed scientific articles. In another community with a focus on casual science topics, exposing mere academic degrees did not obtain such benefits. Still, the users with the highest degree (eg, Ph. D. or MD) were likely to receive more feedback from the audience. These findings suggest that reputation schemes that link the offline and online worlds could induce halo effects on feedback behaviors differently depending upon the community culture. We discuss the implications of this research for the design of future reputation mechanisms.", "num_citations": "4\n", "authors": ["1188"]}
{"title": "Gender and Racial Diversity in Commercial Brands' Advertising Images on Social Media\n", "abstract": " Gender and racial diversity in the mediated images from the media shape our perception of different demographic groups. In this work, we investigate gender and racial diversity of 85,957 advertising images shared by the 73 top international brands on Instagram and Facebook. We hope that our analyses give guidelines on how to build a fully automated watchdog for gender and racial diversity in online advertisements.", "num_citations": "4\n", "authors": ["1188"]}
{"title": "Convergence of media attention across 129 countries\n", "abstract": " The objective of this study is to assess the longitudinal trends of media similarity and dissimilarity on the international scale. As news value has well-established political, cultural, and economic consequences, the degree to which media coverage and content is converging across countries has implications for international relations. To study this convergence, we use the daily data of the 100 topics that were over-reported in each country, compared to other countries, from March 7 to October 9, 2016. The results of this analysis indicate that two complementary patterns–globalization and domestication–explain the media attention across the countries. We conclude that this attention can be driven not only by geographical closeness but also by more complex dimensions, such as historical relationships. Also, although a group of countries often have common media attention, their similarity level depends on …", "num_citations": "4\n", "authors": ["1188"]}
{"title": "Efforts towards automatically generating personas in real-time using actual user data\n", "abstract": " The use of personas is an interactive design technique with considerable potential for product and content development. A persona is a representation of a group or segment of users, sharing common behavioral characteristics. Although representing a segment of users, a persona is generally developed in the form of a detailed narrative about an explicit but fictitious individual that represents the collection of users possessing similar behaviors or characteristics. In order to make the fictitious individual appear as real person to the product developers, the persona narrative usually contains a variety of both demographic and behavioral details about socio economic status, gender, hobbies, family members, friends, possessions, among many other data. Also, the narrative of a persona normally also addresses the goals, needs, wants, frustrations and other emotional aspects of the fictitious individual that are pertinent to …", "num_citations": "4\n", "authors": ["1188"]}
{"title": "Multidimensional Analysis of Gender and Age Differences in News Consumption\n", "abstract": " Using 103,133 news items collected from Daum News, the second most popular news portal in South Korea, we provide multidimensional analyses of gender and age differences in news consumption. We quantify such differences in four different dimensions: 1) by actual news items; 2) by topic 3) by issue; and 4) by angle. We found that angle preferences can better explain the difference of news consumptions, not topics nor issues.", "num_citations": "4\n", "authors": ["1188"]}
{"title": "Visualizing a personal timeline by adding multiple social contexts\n", "abstract": " We improve the readability of a personal timeline byweaving multiple social contexts of tweets into a visualization. Our social contexts consist of three dimensions: community membership, key persons, and interestingtweets within a personal timeline. A person is oftena member of several communities, such as a family, a class, or a team, simultaneously. We identify all communitiesthat a user participates in. Labeling a tweetwith a visual representation to indicate what communityit belongs to can help readers to understand why thetweet is written, since different communities are likelyto carry tweets in different contexts. We then discoverkey persons and interesting tweets within a personaltimeline. Our prototype design demonstrates how threesocial contexts work together for visualizing a personaltimeline.", "num_citations": "4\n", "authors": ["1188"]}
{"title": "Multiplex media attention and disregard network among 129 countries\n", "abstract": " We built a multiplex media attention and disregard network (MADN) among 129 countries over 212 days. By characterizing the MADN from multiple levels, we found that it is formed primarily by skewed, hierarchical, and asymmetric relationships. Also, we found strong evidence that our news world is becoming a\" global village.\" However, at the same time, unique attention blocks of the Middle East and North Africa (MENA) region, as well as Russia and its neighbors, still exist.", "num_citations": "3\n", "authors": ["1188"]}
{"title": "Method, system and computer-readable storage mediums for estimating a route\n", "abstract": " The method estimating said route between an origin location and a destination location of a cell phone user requesting said route by using a computer device receiving as inputs location data from a base station tower, said computer device: creating a plurality of perturbations of at least one of said computed origin or said destination location within said base station tower coverage; for each perturbation created querying a route calculation engine, based on geospatial data, to calculate a route between said perturbations or between said perturbations and said origin or destination and obtaining a list of routes, and choosing among said list of routes an optimal route by maximizing an utility function that assesses the efficacy of each route of said list of routes by using user's location data being performed within certain distance of said calculated routes.", "num_citations": "3\n", "authors": ["1188"]}
{"title": "Understanding toxic behavior in online games\n", "abstract": " With the remarkable advances from isolated console games to massively multi-player online role-playing games, the online gaming world provides yet another place where people interact with each other. Online games have attracted attention from researchers, because i) the purpose of actions is relatively clear, and ii) actions are quantifiable. A wide range of predefined actions for supporting social interaction (eg, friendship, communication, trade, enmity, aggression, and punishment) reflects either positive or negative connotations among game players, and is unobtrusively recorded by the game servers. These rich electronic footprints have become invaluable assets for the research of social dynamics.", "num_citations": "3\n", "authors": ["1188"]}
{"title": "System and method for extracting users of similar interests between various types of web servers\n", "abstract": " Disclosed herein is a system and method for extracting users of similar interests between various types of web servers. The system includes a user profile vector creation unit, a user similarity calculation unit, and a similar user extraction unit. The user profile vector creation unit collects tag data, performs standardization calculation on the degree of importance of each of one or more tags, and creates user profile vectors for respective users. The user similarity calculation unit calculates user similarity using the user profile vectors of the respective users created through the user profile vector creation unit. The similar user extraction unit extracts users of similar interests using the value of the user similarity calculated through the user similarity calculation unit.", "num_citations": "3\n", "authors": ["1188"]}
{"title": "How-to Present News on Social Media: A Causal Analysis of Editing News Headlines for Boosting User Engagement\n", "abstract": " To reach a broader audience and optimize traffic toward news articles, media outlets commonly run social media accounts and share their content with a short text summary. Despite its importance of writing a compelling message in sharing articles, the research community does not own a sufficient understanding of what kinds of editing strategies effectively promote audience engagement. In this study, we aim to fill the gap by analyzing media outlets’ current practices using a data-driven approach. We first build a parallel corpus of original news articles and their corresponding tweets that eight media outlets shared. Then, we explore how those media edited tweets against original headlines and the effects of such changes. To estimate the effects of editing news headlines for social media sharing in audience engagement, we present a systematic analysis that incorporates a causal inference technique with deep learning; using propensity score matching, it allows for estimating potential (dis-) advantages of an editing style compared to counterfactual cases where a similar news article is shared with a different style. According to the analyses of various editing styles, we report common and differing effects of the styles across the outlets. To understand the effects of various editing styles, media outlets could apply our easy-to-use tool by themselves.", "num_citations": "2\n", "authors": ["1188"]}
{"title": "Statistical Modeling of Harassment against Reddit Moderators\n", "abstract": " Despite the dedication that some volunteer moderators of online communities display when performing their moderation duties, they become targets of hate and harassment by other users. To understand what causes the change in moderator role from heroes to victims, we analyze the responses of 1,818 moderators on Reddit to an online survey about moderation practices and harassment. We built a statistical model and found 6 significant independent variables that affect harassment on moderators, such as the knowledge of community norms, which increases harassment on moderators the most. Our findings imply that vulnerable moderators in toxic communities need countermeasures against harassment.", "num_citations": "2\n", "authors": ["1188"]}
{"title": "Multidimensional analysis of the news consumption of different demographic groups on a nationwide scale\n", "abstract": " Examining 103,133 news articles that are the most popular for different demographic groups in Daum News (the second most popular news portal in South Korea) during the whole year of 2015, we provided multi-level analyses of gender and age differences in news consumption. We measured such differences in four different levels: (1) by actual news items, (2) by section, (3) by topic, and (4) by subtopic. We characterized the news items at the four levels by using the computational techniques, which are topic modeling and the vector representation of words and news items. We found that differences in news reading behavior across different demographic groups are the most noticeable in subtopic level but neither section nor topic levels.", "num_citations": "2\n", "authors": ["1188"]}
{"title": "CASFI data sharing platform\n", "abstract": " Effective data management has become a key in promoting data sharing within measurement-based research community. In this work we propose a framework that helps us to share not only the data, but also the data management platform in order to promote collaboration across multiple institutions. We have designed and built a platform that manages measurement data and its metadata, provides basic processing primitives, and exchanges metadata with other platforms for easy local browsing of remote data. As our platform not only manages local data, but also provides consistent interface to remote data, users could browse and locate data of relevance without visiting multiple sites through different web interfaces. Any site could download our platform software package, install it, and make their metadata available to other sites with our platform.", "num_citations": "2\n", "authors": ["1188"]}
{"title": "Predicting Anti-Asian Hateful Users on Twitter during COVID-19\n", "abstract": " We investigate predictors of anti-Asian hate among Twitter users throughout COVID-19. With the rise of xenophobia and polarization that has accompanied widespread social media usage in many nations, online hate has become a major social issue, attracting many researchers. Here, we apply natural language processing techniques to characterize social media users who began to post anti-Asian hate messages during COVID-19. We compare two user groups -- those who posted anti-Asian slurs and those who did not -- with respect to a rich set of features measured with data prior to COVID-19 and show that it is possible to predict who later publicly posted anti-Asian slurs. Our analysis of predictive features underlines the potential impact of news media and information sources that report on online hate and calls for further investigation into the role of polarized communication networks and news media.", "num_citations": "1\n", "authors": ["1188"]}
{"title": "A Survey on Predicting the Factuality and the Bias of News Media\n", "abstract": " The present level of proliferation of fake, biased, and propagandistic content online has made it impossible to fact-check every single suspicious claim or article, either manually or automatically. Thus, many researchers are shifting their attention to higher granularity, aiming to profile entire news outlets, which makes it possible to detect likely \"fake news\" the moment it is published, by simply checking the reliability of its source. Source factuality is also an important element of systems for automatic fact-checking and \"fake news\" detection, as they need to assess the reliability of the evidence they retrieve online. Political bias detection, which in the Western political landscape is about predicting left-center-right bias, is an equally important topic, which has experienced a similar shift towards profiling entire news outlets. Moreover, there is a clear connection between the two, as highly biased media are less likely to be factual; yet, the two problems have been addressed separately. In this survey, we review the state of the art on media profiling for factuality and bias, arguing for the need to model them jointly. We further discuss interesting recent advances in using different information sources and modalities, which go beyond the text of the articles the target news outlet has published. Finally, we discuss current challenges and outline future research directions.", "num_citations": "1\n", "authors": ["1188"]}
{"title": "Tanbih: Get To Know What You Are Reading\n", "abstract": " We introduce Tanbih, a news aggregator with intelligent analysis tools to help readers understanding what's behind a news story. Our system displays news grouped into events and generates media profiles that show the general factuality of reporting, the degree of propagandistic content, hyper-partisanship, leading political ideology, general frame of reporting, and stance with respect to various claims and topics of a news outlet. In addition, we automatically analyse each article to detect whether it is propagandistic and to determine its stance with respect to a number of controversial topics.", "num_citations": "1\n", "authors": ["1188"]}
{"title": "I Would Not Plant Apple Trees If the World Will Be Wiped: Analyzing Hundreds of Millions of Behavioral Records of Players During an MMORPG Beta Test\n", "abstract": " In this work, we use player behavior during the closed beta test of the MMORPG ArcheAge as a proxy for an extreme situation: at the end of the closed beta test, all user data is deleted, and thus, the outcome (or penalty) of players' in-game behaviors in the last few days loses its meaning. We analyzed 270 million records of player behavior in the 4th closed beta test of ArcheAge. Our findings show that there are no apparent pandemic behavior changes, but some outliers were more likely to exhibit anti-social behavior (eg, player killing). We also found that contrary to the reassuring adage that\" Even if I knew the world would go to pieces tomorrow, I would still plant my apple tree,\" players abandoned character progression, showing a drastic decrease in quest completion, leveling, and ability changes at the end of the beta test.", "num_citations": "1\n", "authors": ["1188"]}
{"title": "Exploring the Solution Space of Community Detection Methods\n", "abstract": " Discrete categorization of entities has been a fundamental means to understanding complex data. In network science, such endeavor has been largely realized by community detection method which extracts topologically cohesive subsets of a network by looking at its patterns of clustering. However existing community detection methods produce highly heterogeneous and inconsistent partitions for a single network [1, 2]. Although this problem has been repeatedly addressed in many studies and a huge number of studies in various disciplines have used different types of community detection methods, no study has yet provided systemic investigation of relationships between the solutions and their properties. Here, we provide meta-analysis of a solution space constructed using community partition vectors obtained from various community detection methods. Investigated methods include both modularity-based methods and modularity-free methods, and both deterministic and stochastic methods. Exhaustive computation with social, natural and artificial networks demonstrates that although solutions obtained from several finest community detection methods produce very similar modularity values, the resulting solutions are highly heterogeneous for most of the networks analyzed. The patterns of clustering in the solution space indicate fundamental bifurcation of the analyzed detection methods into different meta-classes depending on their optimization schemes.", "num_citations": "1\n", "authors": ["1188"]}