{"title": "Total coverage based regression test case prioritization using genetic algorithm\n", "abstract": " Regression Testing is a test to ensure that a program that was changed is still working. Changes introduced to a software product often come with defects. Additional test cases are, this could reduce the main challenges of regression testing is test case prioritization. Time, effort and budget needed to retest the software. Former studies in test case prioritization confirm the benefits of prioritization techniques. Most prioritization techniques concern with choosing test cases based on their ability to cover more faults. Other techniques aim to maximize code coverage. Thus, the test cases selected should secure the total coverage to assure the adequacy of software testing. In this paper, we present an algorithm to prioritize test cases based on total coverage using a modified genetic algorithm. Its performance on the average percentage of condition covered and execution time are compared with five other approaches.", "num_citations": "32\n", "authors": ["398"]}
{"title": "The Paradoxical Relationships of Risks and Benefits in Offshore Outsourcing of Software Projects\n", "abstract": " Offshore outsourcing of software projects is an important competitive strategy in modern software business. There has been a long discussion of risks and benefits of this approach. Interestingly, while some issues are perceived as a significant benefit by a group of researchers, they are conversely perceived as a critical risk by others. This paper discusses the two sides of these risk-benefit elements as well as their management strategies.", "num_citations": "16\n", "authors": ["398"]}
{"title": "A review of requirements engineering processes, problems and models\n", "abstract": " Precisely defined requirements are essential for a successful software development. Although dozens of requirements engineering methods and techniques are available for practitioners, some techniques are proven successful to certain systems but not for others. In fact, selection appropriate of requirements engineering methods and techniques can be difficult and, in worse case scenarios, may ultimately lead to a failure. Recent changes in business environments and emerging technologies also affect requirements processes. This makes selection of an appropriate requirements engineering model even more sophisticate. This article discusses requirements engineering processes and their problems, requirements engineering models, as well as essential characteristics of requirements engineering models.", "num_citations": "15\n", "authors": ["398"]}
{"title": "Using artificial bee colony for code coverage based test suite prioritization\n", "abstract": " The goal of test suite prioritization is maximizing fault detection and code coverage rate. Several nature inspired optimization algorithms such as Swarm Intelligence (SI) have been studied for the optimization of such problems. The studies revealed the benefits of Artificial Bee Colony (ABC) over other algorithms. ABC and its variations were implemented in software testing areas, test suite prioritization in particular. However, most SI based approaches focus on fault detection ability which is difficult to predict. In this paper, the standard ABC algorithm is used to prioritize test suites based on code coverage. The results reveal that ABC shows promising results and, hence, is a great candidate for prioritizing test suites. It also suggests that a modification to the standard ABC algorithm or combination of ABC and another SI algorithm should yield an even better result.", "num_citations": "9\n", "authors": ["398"]}
{"title": "Implementing a personal software process (PSPSM) course: a case study\n", "abstract": " In order to remain competitive in software industry, software engineers need to continuously improve their proficiency. Personal Software Process (PSPSM) provides a strong concept which helps software engineers inspecting and improving themselves. Yet, when being applied on an undergraduate computer engineering course, several complex mathematical calculations from PSP official exercises could encumber the performance of students who do not possess adequate mathematics background. This paper reports a result of implementing PSP course for undergraduate computer engineering students in Chiang Mai University, Thailand.", "num_citations": "9\n", "authors": ["398"]}
{"title": "Factors supporting user interface design of mobile government application\n", "abstract": " M-Government services are an extension of e-Government. M-Government services, are an extension to e-Government services, in which citizens receive information and services through their mobile devices anywhere and anytime. Although m-government applications share similar characteristics with other mobile applications, there are unique characteristics to be considered when designing the user interface. User interface design guidelines that are applicable to general mobile applications are not always suitable to be used with m-government applications. An appropriate usability engineering framework for m-government application is needed. It should cover the unique characteristics and, ultimately, lead to satisfaction of diverse citizens. Therefore, this paper focuses on developing a usability engineering guideline for designing user interface of m-government application. The pilot study was performed using …", "num_citations": "7\n", "authors": ["398"]}
{"title": "Plasticine scrum: an alternative solution for simulating scrum software development\n", "abstract": " Scrum is an efficient software development process. However, in order to master its concept, practitioners need to have a considerable level of software development skills and go through cycles of actual activities. This could be expensive and time consuming. “Scrum simulation with LEGO bricks” is a very popular solution to tackle such limitations. Unfortunately, due to its high costs, implementing this workshop in a large software engineering class could be financially challenging. This paper proposes an alternative low cost solution for simulating scrum software development by using low cost plasticine as main material. It also reports results of two pilot studies on this alternative simulation.", "num_citations": "7\n", "authors": ["398"]}
{"title": "ARMI: A risk management incorporation\n", "abstract": " Risk management is an essential process in software project management. Effective management of risk significantly helps increase rate of project success as well as reduce potential costs of failures. This paper proposes an innovative card-based game which simulates entire cycle of risk management. During the activity, the participants form an organization called “A Risk Management Incorporation (ARMI)”. They are then given chance to experience, analyze, plan, repeat and evolve their risk management processes. Based on the study result, ARMI helps not only simulate an insightful risk management cycle but also improve the participants' attitude towards this critical project element.", "num_citations": "6\n", "authors": ["398"]}
{"title": "A tale behind Mum Effect\n", "abstract": " Mum effect is a situation when one or more project stakeholders decide to withhold critical information for particular reasons. In software project where most of the production is intangible, the seriousness of this challenge increases exponentially. There have been reports indicating that mum effect can surface during any phase of development and ultimately lead to disaster in software projects. Mum effect can be influenced by several factors such as organizational and national cultures. This research investigates potential mum effect scenarios and reveals specific reasons which induce this challenge among information technology practitioners.", "num_citations": "6\n", "authors": ["398"]}
{"title": "Developing Software for the Deaf Community: Conquering an Extreme Case Scenario\n", "abstract": " Developing software is challenging. Scenarios with extraordinary settings makes the process more challenging. This includes the development of software for users with special needs. This research discusses a development of software for the deaf community. Unlike many other cases which the deaf are usually at the end of the process, this research investigates a project which closely involve deaf users in every development activities. Problems and solutions found during the project are thoroughly explained and examined.", "num_citations": "4\n", "authors": ["398"]}
{"title": "Ethics on social networking: A preliminary survey in Thailand\n", "abstract": " The rapid growth of social networks and their users has been phenomenon. This brings numerous changes in everyday life, both positively and negatively. Ethics have become a major growing challenge in this area. Sensitive issues such as privacy, impersonation and cyberbullying are increasingly causing more damage to the community. This research reviews ethical issues on social networks. It also reports results from a survey on the most anticipated ethical concerns from the viewpoints of undergraduate students from Chiang Mai University, Thailand. Lost of privacy, misinformation and impersonation are anticipated as the worst ethical misconducted.", "num_citations": "4\n", "authors": ["398"]}
{"title": "Culturally influenced risk exposure: a new approach to tackle risks in offshore outsourcing\n", "abstract": " Culture is arguably perceived as the most influential risk factor in offshore outsourcing of software projects. Yet, due to its intangible characteristics, quantifying and systematizing this factor seems to be impracticable. This paper proposes a new approach to enhance risk assessment process by involving culture in the calculation. The results from this new approach suggest a better evaluation of risk which leads to more appropriate planning and mitigation.", "num_citations": "4\n", "authors": ["398"]}
{"title": "Solo scrum in bureaucratic organization: A case study from thailand\n", "abstract": " Scrum becomes the most popular Agile methodology due to its simple principles and ability to adapt to various environment. It offers flexibility to software development and allows teams to have control over the course of development. Although there were several successful attempts of Scrum adoption throughout different parts of the world, there are still challenges in implementing Scrum in bureaucratic organizations. This paper presents findings from a pilot adoption of Solo Scrum, which a single developer employed and adapted Scrum practices in a software project in a Thai bureaucratic organization where several issues turn to be obstacles to the adoption including bureaucratic structure, layers of approvals, culture, etc. Organizational culture is found to be a major obstacle in this case study. Conflicts and solutions are discussed. The challenges and issues related to Mum effects are also addressed …", "num_citations": "3\n", "authors": ["398"]}
{"title": "A framework for building trust in B2C E-commerce based on consumer's viewpoint in Thailand\n", "abstract": " Trust is essential for the development of ECommerce web sites. Owners or developers of such web sites need to know the important characteristics of trust and how to display them on their web sites. In order to do so, the factors that influence user trust must be studied. Therefore, there is a clear need of a framework for building trust in E-Commerce web sites, especially Business-to-Consumer E-Commerce in Thailand where trust is the main challenge. This paper proposes a trust building framework for B2C E-Commerce web sites based on the questionnaire modified from E-S-QUAL and E-RecS-QUAL. The analysis of service quality and factors results in understanding and insights of customer perception and expectation toward the web site. The important factors are also identified.", "num_citations": "3\n", "authors": ["398"]}
{"title": "A framework for usability design to promote awareness of information disseminated via mobile government applications\n", "abstract": " Mobile application have become the first choice for disseminating information in several situations. Many government agencies developed m-government applications, mainly for information dissemination and electronic services delivery. Information has great effects to citizen's life in several ways. Warning messages are an obvious example. They are usually provided to people in affected or risk areas. Effective information dissemination of such information requires more than assembling them on the user interface. It requires a careful design. Designing how they are presented is not an easy task. Moreover, effective and efficient presentation can be difficult. Appropriate presentation aids in understanding of information and gives the correct clue on what to do next. This paper presents the analysis of usability factors to support design and development of m-government applications which main task is information …", "num_citations": "2\n", "authors": ["398"]}
{"title": "Automatically Identifying Themes and Trends in Software Engineering Research\n", "abstract": " Understanding the ways that research topics are evolving in a research domain is important when considering research proposals. Bibliometric analysis provides a variety of tools for exploring publication data, but often involves manual effort. This paper presents an automatic method for extracting and examining key research themes by using natural language processing to parse a large collection of papers. The method was applied to over 8,000 papers published in the software engineering field over the past 20 years. Key research themes were identified and visualized, so that trends could be highlighted. Some research fields that are in decline are identified, along with newly popular research topics such as fuzzy set membership, cloud computing, feature selection and agile development teams.", "num_citations": "2\n", "authors": ["398"]}
{"title": "ECSE: a pseudo-SDLC game for software engineering class\n", "abstract": " Software development is uniquely different especially when compared to other engineering processes. The abstractness of software products has a major influence on the entire software development life cycle, which results in a number of uniquely important challenges. This chapter describes and discusses Engineering Construction for Software Engineers (ECSE), an effective workshop that helps software engineering students to understand some of these critical issues within a short period of time. In this workshop, the students are required to develop a pseudo-software product from scratch. They could learn about unique characteristics and risks of software development life cycle as well as other distinctive phenomenon through the activities. The workshop can still be easily followed by students who are not familiar with certain software development processes such as coding or testing.", "num_citations": "2\n", "authors": ["398"]}
{"title": "Defect-driven development: A new software development model for beginners\n", "abstract": " Software development is challenging. It is normal for software developers to find some problems with their software design, especially during their beginner days. This usually involves simple and repetitious defects which subtly hamper their overall productivity. Defect-driven development (DDD) is a concept proposed to tackle such problems. DDD utilizes the benefits of software defect knowledge base by collecting defects data from experienced programmers and teach beginners to avoid these problems. In this way, the beginners can proactively prevent the defects and subsequently produce more high-quality software. DDD concept can be efficiently adapted to either traditional software development such as the Waterfall and Spiral model, or the more modern concepts such as Scrum or Test-driven Development. This research implemented the DDD concept on undergraduate students and compared their …", "num_citations": "1\n", "authors": ["398"]}
{"title": "Measuring Quality of C2C E-Commerce Websites in Lao PDR\n", "abstract": " E-commerce gives chances to businesses of all sizes to compete globally. It opens the doors to new product, services, and creates opportunities. Though e-commerce was made possible 25 years ago, it is relatively new in Lao PDR. Merely 12.8% of firms owns website. Lao government’s recent development in infrastructure and policy, in conjunction with cooperative agreement with developed countries, presents a promising future for e-commerce. One key success factor for e-commerce is service quality. A high-quality website draws customer and leads to purchase. This study proposes an improvement to ES-QUAL, a framework for electronic service quality, to address missing quality dimensions and adaption for quality measurement of C2C websites in Lao PDR.", "num_citations": "1\n", "authors": ["398"]}
{"title": "A comparative study on scrum simulations\n", "abstract": " Learning through simulation is an efficient method for illustrating the essentials of Scrum software development to those who are interested in further understanding modern software engineering techniques. Several models of simulations have been proposed in attempts to match needs and simulation environments. This paper compares the efficiency of two variations of Scrum simulation; the original “Scrum simulation with LEGO bricks” and the economic alternative “Plasticine Scrum”. Similarities, differences, advantages and disadvantages of both models are discussed in the findings.", "num_citations": "1\n", "authors": ["398"]}
{"title": "An evaluation of page segment recommendation system using user's notes and N-Gram models\n", "abstract": " Web content searching is a daily activity of almost everyone. Often, it occurs several times a day. A number of people need to make sense out of a huge amount of Web pages in order to complete their jobs. Many others also have to rely on it. A number of research works in sensemaking have demonstrated the needs for supporting tools in Web content searching. In this paper, NorCost, a system that recommends relevant page segments, is proposed. The system emphasizes helping people to complete their sensemaking tasks without having to go through every detail of the Web page themselves as such tasks could takes long time to finish. The evaluation of NorCost is carried out to assess its accuracy as well as time taken to process the recommendation.", "num_citations": "1\n", "authors": ["398"]}
{"title": "Implementing an information system development simulation in an industrial engineering class: a case study\n", "abstract": " Development of an information system is a challenging task due to many of its unique and sensitive nature. As stakeholders, it is important for both managerial and technical counterparts to understand the challenges in information system development. This paper explores the efficiency of implementing a simulation workshop on information system development in an industrial engineering class as well as report lesson leant from the industrial points of view.", "num_citations": "1\n", "authors": ["398"]}