{"title": "Meta-analysis: surgical treatment of obesity\n", "abstract": " Background:                Controversy exists regarding the effectiveness of surgery for weight loss and the resulting improvement in health-related outcomes.                                          Purpose:                To perform a meta-analysis of effectiveness and adverse events associated with surgical treatment of obesity.                                          Data Sources:                MEDLINE, EMBASE, Cochrane Controlled Trials Register, and systematic reviews.                                          Study Selection:                Randomized, controlled trials; observational studies; and case series reporting on surgical treatment of obesity.                                          Data Extraction:                Information about study design, procedure, population, comorbid conditions, and adverse events.                                          Data Synthesis:                The authors assessed 147 studies. Of these, 89 contributed to the weight loss analysis, 134 contributed to the mortality analysis …", "num_citations": "1994\n", "authors": ["2091"]}
{"title": "Meta-analysis: chronic disease self-management programs for older adults\n", "abstract": " Background:                Although enthusiasm is growing for self-management programs for chronic conditions, there are conflicting data regarding their effectiveness and no agreement on their essential components.                                          Purpose:                To assess the effectiveness and essential components of self-management programs for hypertension, osteoarthritis, and diabetes mellitus.                                          Data Sources:                The authors searched multiple sources dated through September 2004, including the Cochrane Library, MEDLINE, PsycINFO, and Nursing and Allied Health databases, and bibliographies of 87 previous reviews.                                          Study Selection:                Randomized trials that compared outcomes of self-management interventions with a control or with usual care for diabetes mellitus, osteoarthritis, or hypertension; outcomes included hemoglobin A1c level, fasting …", "num_citations": "1075\n", "authors": ["2091"]}
{"title": "Meta-analysis: pharmacologic treatment of obesity\n", "abstract": " Background:                In response to the increase in obesity, pharmacologic treatments for weight loss have become more numerous and more commonly used.                                          Purpose:                To assess the efficacy and safety of weight loss medications approved by the U.S. Food and Drug Administration and other medications that have been used for weight loss.                                          Data Sources:                Electronic databases, experts in the field, and unpublished information.                                          Study Selection:                Up-to-date meta-analyses of sibutramine, phentermine, and diethylpropion were identified. The authors assessed in detail 50 studies of orlistat, 13 studies of fluoxetine, 5 studies of bupropion, 9 studies of topiramate, and 1 study each of sertraline and zonisamide. Meta-analysis was performed for all medications except sertraline, zonisamide, and fluoxetine, which are …", "num_citations": "1075\n", "authors": ["2091"]}
{"title": "Evidence for improving palliative care at the end of life: a systematic review\n", "abstract": " Background:                Many persons and their families are burdened by serious chronic illness in late life. How to best support quality of life is an important consideration for care.                                          Purpose:                To assess evidence about interventions to improve palliative and end-of-life care.                                          Data Sources:                English-language citations (January 1990 to November 2005) from MEDLINE, the Database of Abstracts of Reviews of Effects, the National Consensus Project for Quality Palliative Care bibliography, and November 2005 to January 2007 updates from expert reviews and literature surveillance.                                          Study Selection:                Systematic reviews that addressed “end of life,” including terminal illness (for example, advanced cancer) and chronic, eventually fatal illness with ambiguous prognosis (for example, advanced dementia), and intervention …", "num_citations": "739\n", "authors": ["2091"]}
{"title": "Efficacy and safety of ephedra and ephedrine for weight loss and athletic performance: a meta-analysis\n", "abstract": " ContextEphedra and ephedrine sometimes are used for weight loss or enhanced athletic performance, but the efficacy and safety of these compounds are uncertain.ObjectiveTo assess the efficacy and safety of ephedra and ephedrine used for weight loss and enhanced athletic performance.Data SourcesWe searched 9 databases using the terms ephedra, ephedrine, adverse effect, side effect, efficacy, effective, and toxic. We included unpublished trials and non–English-language documents. Adverse events reported to the US Food and Drug Administration MedWatch program were assessed.Study SelectionEligible studies were controlled trials of ephedra or ephedrine used for weight loss or athletic performance and case reports of adverse events associated with such use. Eligible studies for weight loss were human studies with at least 8 weeks of follow-up; and for athletic performance, those having no minimum …", "num_citations": "729\n", "authors": ["2091"]}
{"title": "Effects of omega-3 fatty acids on cancer risk: a systematic review\n", "abstract": " ContextOmega-3 fatty acids are purported to reduce the risk of cancer. Studies have reported mixed results.ObjectiveTo synthesize published and unpublished evidence to determine estimates of the effect of omega-3 fatty acids on cancer risk in prospective cohort studies.Data SourcesArticles published from 1966 to October 2005 identified through MEDLINE, PREMEDLINE, EMBASE, Cochrane Central Register of Controlled Trials, and CAB Health; unpublished literature sought through letters to experts in the neutraceutical industry.Study SelectionA total of 38 articles with a description of effects of consumption of omega-3 fatty acids on tumor incidence, prospective cohort study design, human study population; and description of effect of omega-3 among groups with different levels of exposure in the cohort were included. Two reviewers independently reviewed articles using structured abstraction forms …", "num_citations": "662\n", "authors": ["2091"]}
{"title": "Mindfulness meditation for chronic pain: systematic review and meta-analysis\n", "abstract": " Background           Chronic pain patients increasingly seek treatment through mindfulness meditation.                             Purpose           This study aims to synthesize evidence on efficacy and safety of mindfulness meditation interventions for the treatment of chronic pain in adults.                             Method           We conducted a systematic review on randomized controlled trials (RCTs) with meta-analyses using the Hartung-Knapp-Sidik-Jonkman method for random-effects models. Quality of evidence was assessed using the GRADE approach. Outcomes included pain, depression, quality of life, and analgesic use.                             Results           Thirty-eight RCTs met inclusion criteria; seven reported on safety. We found low-quality evidence that mindfulness meditation is associated with a small decrease in pain compared with all types of controls in 30 RCTs. Statistically significant effects were also found for …", "num_citations": "573\n", "authors": ["2091"]}
{"title": "Pregnancy and fertility following bariatric surgery: a systematic review\n", "abstract": " ContextUse of bariatric surgery has increased dramatically during the past 10 years, particularly among women of reproductive age.ObjectivesTo estimate bariatric surgery rates among women aged 18 to 45 years and to assess the published literature on pregnancy outcomes and fertility after surgery.Evidence AcquisitionSearch of the Nationwide Inpatient Sample (1998-2005) and multiple electronic databases (Medline, EMBASE, Controlled Clinical Trials Register Database, and the Cochrane Database of Reviews of Effectiveness) to identify articles published between 1985 and February 2008 on bariatric surgery among women of reproductive age. Search terms included bariatric procedures, fertility, contraception, pregnancy, and nutritional deficiencies. Information was abstracted about study design, fertility, and nutritional, neonatal, and pregnancy outcomes after surgery.Evidence SynthesisOf 260 screened …", "num_citations": "553\n", "authors": ["2091"]}
{"title": "A systematic review of measures of end‐of‐life care and its outcomes\n", "abstract": " Objective.  To identify psychometrically sound measures of outcomes in end‐of‐life care and to characterize their use in intervention studies. Data Sources.  English language articles from 1990 to November 2005 describing measures with published psychometric data and intervention studies of end‐of‐life care. Study Design.  Systematic review of end‐of‐life care literature. Extraction Methods.  Two reviewers organized identified measures into 10 major domains. Eight reviewers extracted and characterized measures from intervention studies. Principal Findings.  Of 24,423 citations, we extracted 200 articles that described 261 measures, accepting 99 measures. In addition to 35 measures recommended in a prior systematic review, we identified an additional 64 measures of the end‐of‐life experience. The most robust measures were in the areas of symptoms, quality of life, and satisfaction; significant gaps existed …", "num_citations": "210\n", "authors": ["2091"]}
{"title": "Off-label use of atypical antipsychotics: an update\n", "abstract": " This review concluded that atypical antipsychotics were used for a range of off-label conditions with varied results and it may not be appropriate to assume class effects. The conclusions of this broad review should be considered carefully for each individual condition bearing in mind the acknowledged presence of publication bias, potential language bias and unexplained heterogeneity.", "num_citations": "180\n", "authors": ["2091"]}
{"title": "Antioxidants vitamin C and vitamin E for the prevention and treatment of cancer\n", "abstract": " OBJECTIVE:  To evaluate the evidence of the supplements vitamin C and vitamin E for treatment and prevention of cancer. METHODS:  Systematic review of trials and meta‐analysis. DATA SOURCES AND MAIN RESULTS:  Thirty‐eight studies showed scant evidence that vitamin C or vitamin E beneficially affects survival. In the ATBC Cancer Prevention Study Group, no statistically significant effect of treatment was seen for any cancer individually, and our pooled relative risk (regardless of tumor type) for α‐tocopherol alone was 0.91 (95% confidence interval [CI]: 0.74, 1.12). All cause mortality was not significant. In the Linxian General Population Trial, the relative risks for cancer death for vitamin C (combined with molybdenum) was 1.06 (95% CI: 0.92, 1.21) and for vitamin E (combined with β‐carotene and selenium) was 0.87 (95% CI: 0.76, 1.00). We identified only 3 studies that reported statistically significant …", "num_citations": "177\n", "authors": ["2091"]}
{"title": "Systematic review of the effects of n−3 fatty acids in inflammatory bowel disease–\n", "abstract": " Background: n−3 Fatty acids are purported to have health effects in patients with inflammatory bowel disease (IBD), but studies have reported mixed results.                    Objective: We aimed to synthesize published and unpublished evidence to determine estimates of the effect of n−3 fatty acids on clinical outcomes in IBD and whether n−3 fatty acids modify the effects of or need for treatment with other agents.                    Design: Computerized databases were searched for studies of n−3 fatty acids in immune-mediated diseases from 1966 to 2003. We also contacted experts in the nutraceutical industry to identify unpublished studies; however, none were identified.                    Results: Reviewers identified 13 controlled trials that assessed the effects of n−3 fatty acids on clinical, sigmoidoscopic, or histologic scores; rates of induced remission or relapse; or requirements for steroids and other …", "num_citations": "175\n", "authors": ["2091"]}
{"title": "Effects of omega-3 fatty acids on cancer.\n", "abstract": " Objectives:To assess the effect of omega-3 fatty acids on 1) tumor incidence 2) clinical outcomes after cancer treatment, and 3) tumor behavior.Data Sources:We searched computerized databases to identify potentially relevant studies and contacted industry experts for unpublished data.Study Selection:Tumor incidence and outcomes after cancer treatment. We screened 4,834 titles, reviewed 356 articles, and included 52 articles in our review. For tumor incidence, we restricted to prospective cohort studies in humans, and for clinical outcomes after cancer treatment, we restricted to randomized controlled trials (RCTs); We had no language restrictions.", "num_citations": "173\n", "authors": ["2091"]}
{"title": "Meditation for posttraumatic stress: Systematic review and meta-analysis.\n", "abstract": " Objective: We conducted a systematic review and meta-analysis that synthesized evidence from randomized controlled trials of meditation interventions to provide estimates of their efficacy and safety in treating adults diagnosed with posttraumatic stress disorder (PTSD). This review was based on an established protocol (PROSPERO: CRD42015025782) and is reported according to PRISMA guidelines. Outcomes of interest included PTSD symptoms, depression, anxiety, health-related quality of life, functional status, and adverse events. Method: Meta-analyses were conducted using the Hartung-Knapp-Sidik-Jonkman method for random-effects models. Quality of evidence was assessed using the Grade of Recommendations Assessment, Development, and Evaluation (GRADE) approach. Results: In total, 10 trials on meditation interventions for PTSD with 643 participants met inclusion criteria. Across interventions …", "num_citations": "117\n", "authors": ["2091"]}
{"title": "The efficacy of omega–3 fatty acids on cognitive function in aging and dementia: A systematic review\n", "abstract": " We systematically reviewed the published literature on the effects of omega–3 fatty acids on measures of cognitive function in normal aging, incidence and treatment of dementia. Computerized databases were searched for published literature to identify potentially relevant studies with the intent to conduct a meta-analysis. We screened 5,865 titles, reviewed 497 studies of which 49 underwent a detailed review, and found 5 studies that pertained to our objectives. We included controlled clinical trials and observational studies, including prospective cohort, case-control, and case series designs; we excluded case reports. We had no language restrictions. We abstracted data on the effects of omega–3 fatty acids and on study design, relevant outcomes, study population, source, type, amount, and duration of omega–3 fatty acid consumption, and parameters of methodological quality. A single cohort study has assessed …", "num_citations": "112\n", "authors": ["2091"]}
{"title": "Bariatric surgery in women of reproductive age: special concerns for pregnancy.\n", "abstract": " ObjectivesTo measure the incidence of contemporary bariatric surgery procedures in women age 18-45 and to assess its impact on fertility, contraception, prepregnancy risk factors, and pregnancy outcomes, including those of neonates.", "num_citations": "94\n", "authors": ["2091"]}
{"title": "Comparison of an interstitial cystitis/bladder pain syndrome clinical cohort with symptomatic community women from the RAND Interstitial Cystitis Epidemiology study\n", "abstract": " Purpose: The RAND Interstitial Cystitis Epidemiology survey estimated that 2.7% to 6.5% of United States women have urinary symptoms consistent with a diagnosis of interstitial cystitis/bladder pain syndrome. We describe the demographic and clinical characteristics of the symptomatic community based RAND Interstitial Cystitis Epidemiology cohort, and compare them with those of a clinically based interstitial cystitis/bladder pain syndrome cohort.Materials and Methods: Subjects included 3,397 community women who met the criteria for the RAND Interstitial Cystitis Epidemiology high sensitivity case definition, and 277 women with an interstitial cystitis/bladder pain syndrome diagnosis recruited from specialist practices across the United States (clinical cohort). Questions focused on demographic information, symptom severity, quality of life indicators, concomitant diagnoses and treatment.Results: Average …", "num_citations": "92\n", "authors": ["2091"]}
{"title": "Efficacy and comparative effectiveness of off-label use of atypical antipsychotics\n", "abstract": " Aripiprazole, olanzapine, quetiapine, risperidone, and ziprasidone are atypical antipsychotics approved by the US Food and Drug Administration (FDA) for treatment of schizophrenia and bipolar disorder. These drugs have been studied for off-label use in the following conditions: dementia and severe geriatric agitation, depression, obsessive-compulsive disorder, posttraumatic stress disorder, and personality disorders. The atypicals have also been studied for the management of Tourette’s syndrome and autism in children. The purpose of this report is to review the scientific evidence on the safety and effectiveness of such off-label uses.", "num_citations": "64\n", "authors": ["2091"]}
{"title": "When, where, why and with whom homeless women engage in risky sexual behaviors: A framework for understanding complex and varied decision-making processes\n", "abstract": " Impoverished women worldwide are at high risk for contracting HIV/AIDS. This study explores how homeless women make risky sex decisions and the role that alcohol and drugs play in this process. We analyze 56 in-depth qualitative descriptions of recent sexual episodes among 28 women living in shelters in Los Angeles, California, USA. The sample (age 18–63) was 46% African American, 21% Hispanic/Latina, and 21% White. Findings suggest that: (1) homeless women engage in multiple types of relationships and sexual behaviors; (2) emotion and attachment play critical roles in women’s risky sex choices; and (3) the role of alcohol and drugs on such choices varies across relationship commitment. Understanding the complexity of sexual decision-making among this population has implications for developing successful risk reduction interventions.", "num_citations": "62\n", "authors": ["2091"]}
{"title": "Depressive disorders and panic attacks in women with bladder pain syndrome/interstitial cystitis: a population-based sample\n", "abstract": " ObjectiveWe report the population prevalence of probable depressive disorders and current panic attacks in women with bladder pain syndrome/interstitial cystitis (BPS/IC) symptoms and describe their characteristics and access care.MethodWe conducted a telephone screening of 146,231 households and telephone interviews with women with BPS/IC symptoms. A weighted probability sample of 1469 women who met the criteria for BPS/IC was identified. Measures of BPS/IC severity, depressive symptoms, panic attacks and treatment utilization were administered. T and χ2 tests were used to examine differences between groups.ResultsOver one third of the sample (n=536) had a probable diagnosis of depression, and 52% (n=776) reported recent panic attacks. Women with a probable diagnosis of depression or current panic attacks reported worse functioning and increased pain and were less likely to work …", "num_citations": "59\n", "authors": ["2091"]}
{"title": "Methodological approaches for a systematic review of end-of-life care\n", "abstract": " As background for a National Institutes of Health State of the Science Conference on Endof- Life-Care, we performed a systematic review of end-of-life care and outcomes. The systematic review was intended to evaluate the evidence in the field from the perspective of concerns important to patients, caregivers, and the health care system. This article relates the challenges in performing a systematic review of end-of-life care and outcomes, and describes the methods that we used to define the scope, search the literature, develop exclusion and inclusion criteria, incorporate various types of articles, and synthesize the results. Major challenges to conducting a review included the need to define \"end of life,\" clarify a conceptual framework of outcomes including definitions of terms and the relationships among terms, and determine specific goals for the review. The review identified 24,423 total citations, of which 911 …", "num_citations": "54\n", "authors": ["2091"]}
{"title": "Antiretroviral (ARV) drug resistance in the developing world.\n", "abstract": " ObjectivesTo describe the overall prevalence of ARV resistance in the developing world, focusing on:(1) treatment naïve populations,(2) the resistance consequences of prevention of mother to child transmission (pMTCT) drug regimens, and (3) the relationship of medication adherence to resistance.", "num_citations": "50\n", "authors": ["2091"]}
{"title": "Are Ayurvedic herbs for diabetes effective?\n", "abstract": " Objective: To evaluate and synthesize the evidence on the effect of Ayurvedic therapies for diabetes mellitus.   Design: Systematic review of trials.   Measurements and main results: We found no study that assessed Ayurvedic as a system of care. Botanical therapy was by far the most commonly studied Ayurvedic treatment. Herbs were studied either singly or as formulas. In all, 993 titles in Western computerized databases and 318 titles identified by hand-searching journals in India were examined, yield ing 54 articles reporting the results of 62 studies. The most-studied herbs were G sylvestre, C indica, fenugreek, and Eugenia jambo/ana. A number of herbal formulas were tested, but Ayush- 82 and 0 -400 were most often studied. Thirty-five of the studies included came from the Western literature, 27 from the Indian. Seven were randomized controlled trials (RCTs) and 10 controlled clinical trials (CCTs) or natural experiments. Twenty-two studies went on to further analysis based on a set of criteria. Of these, 10 were RCTs, eCTs, or natural experiments, 12 were case series or cohort studies. There is evidence to suggest that the herbs C indica, holy basil, fenugreek, and G sylvestre, and the herbal formulas Ayush-82 and 0 -400 have a glucose-lowering effect and deserve further study. Evidence of effectiveness of several other herbs is less extensive (C tamala, E jambo/ana, and Momordica charantia).   Conclusions: There is heterogeneity in the available literature on Ayurvedic treatment for diabetes. Most studies test herbal therapy. Heterogeneity exists in the herbs and formulas tested (more than 44 different interventions identified) and in the …", "num_citations": "43\n", "authors": ["2091"]}
{"title": "Hospital-based integrative medicine: a case study of the barriers and factors facilitating the creation of a center\n", "abstract": " This study tracks the establishment of a single hospital-based integrative medicine center. Although some factors clearly worked in favor of the center, the hospital had few models to guide it and no experience in creating such a clinic. Thus, it made many decisions in the areas of administration, finance, and legal issues that created barriers to the center's success, and the center was ultimately closed.", "num_citations": "36\n", "authors": ["2091"]}
{"title": "Suicidal ideation among patients with bladder pain syndrome/interstitial cystitis\n", "abstract": " ObjectiveTo estimate the prevalence of suicidal ideation (SI) and compare respondents who endorsed SI with respondents who denied SI within a national probability sample of women with bladder pain syndrome or interstitial cystitis (BPS/IC).MethodsData were collected as part of the RAND Interstitial Cystitis Epidemiology (RICE) Study, which screened 146,246 US households to identify adult women who met BPS/IC symptom criteria. In addition to estimating SI prevalence, women with and without recent SI were compared based on demographics, depression symptoms, BPS/IC symptoms, functioning, and treatment.ResultsOf 1019 women with BPS/IC symptoms asked about SI, 11.0% (95% CI = 8.73-13.25) reported SI in the past 2 weeks. Those with SI were more likely to be younger, unemployed, unmarried, uninsured, less educated, and of lower income. Women who endorsed SI reported worse mental health …", "num_citations": "35\n", "authors": ["2091"]}
{"title": "Characteristics of chiropractic patients being treated for chronic low back and neck pain\n", "abstract": " ObjectivesChronic low back pain (CLBP) and chronic neck pain (CNP) are the most common types of chronic pain, and chiropractic spinal manipulation is a common nonpharmacologic treatment. This study presents the characteristics of a large United States sample of chiropractic patients with CLBP and CNP.MethodsData were collected from chiropractic patients using multistage systematic stratified sampling with 4 sampling levels: regions and states, sites (ie, metropolitan areas), providers and clinics, and patients. The sites and regions were San Diego, California; Tampa, Florida; Minneapolis, Minnesota; Seneca Falls and Upstate New York; Portland, Oregon; and Dallas, Texas. Data were collected from patients through an iPad-based prescreening questionnaire in the clinic and emailed links to full screening and baseline online questionnaires. The goal was 20 providers or clinics and 7 patients with CLBP …", "num_citations": "27\n", "authors": ["2091"]}
{"title": "Trials and tribulations on the road to implementing integrative medicine in a hospital setting\n", "abstract": " In this paper, results are reported from a five year qualitative study involving a stakeholder analysis of a hospital-based centre for integrative medicine. The objective of the study was to identify the barriers and the facilitators for creating integrative medicine in this setting. The study documented the timeline of the Centre from its very hopeful beginning to its demise. The paper focuses on the administrative implementation process, examining the original expectations in light of the organisational culture, business model, impact of policies and regulations, and the trade-offs made between the original goals and those attained within this environment. One of the most troubling aspects arising from this case study was that no corrective mechanism was in place for program design flexibility once previously created policies were deemed harmful to the Centre. When the major assumptions on which the Centre was founded …", "num_citations": "23\n", "authors": ["2091"]}
{"title": "Ephedra-Is It Worth the Risk?\n", "abstract": " Mr. Chairman, we welcome the opportunity to submit testimony for the New York State Senate Committee on Consumer Protection on the dietary supplement ephedra. Key findings from our research Ephedra and ephedrine promote modest short-term weight loss their long-term effect is unknown. Ephedrine plus caffeine moderately boosts performance for fit young men there is no evidence that ephedra or ephedrine improves long-term physical performance of athletes or would work for the general public. Ephedra and ephedrine increase the risk of nausea, vomiting, jitteriness, and palpitations. These products may be linked to catastrophic events such as sudden death, heart attack, or stroke.Descriptors:", "num_citations": "23\n", "authors": ["2091"]}
{"title": "Mindfulness meditation for workplace wellness: An evidence map\n", "abstract": " BACKGROUND: Mindfulness interventions aim to foster greater attention and awareness of present moment experiences. Uptake of mindfulness programs in the workplace has grown as organizations look to support employee health, wellbeing, and performance.OBJECTIVE: In support of evidence-based decision making in workplace contexts, we created an evidence map summarizing physical and mental health, cognitive, affective, and interpersonal outcomes from systematic reviews of randomized controlled trials (RCTs) of mindfulness interventions.METHODS: We searched nine electronic databases to July 2017, dually-screened all reviews, and consulted topic experts to identify systematic reviews on mindfulness interventions. The distribution of evidence is presented as an evidence map in a bubble plot.RESULTS: In total, 175 systematic reviews met inclusion criteria. Reviews included a variety of …", "num_citations": "18\n", "authors": ["2091"]}
{"title": "Effects of integrative PTSD treatment in a military health setting\n", "abstract": " Research indicates that the current standard of care for combat-related stress disorders and related conditions is not maximally effective, nor does it fully address the biopsychological aspects, complexity, and overlap of precursors and comorbidities characteristic of posttraumatic stress disorder (PTSD). There is need for comprehensive interventions based upon both neuroscientific information and new integrative care models. The Warrior Combat Stress Reset Program (Reset), an innovative intensive outpatient behavioral health program at the Carl R. Darnall Army Medical Center at Fort Hood, Texas, provided integrative care for active-duty service members for the treatment of PTSD symptoms from 2008 to 2015. The Reset protocol combined trauma-focused behavioral health techniques with complementary and alternative medicine (CAM) modalities including acupuncture, massage, Reiki, reflexology, and yoga. A retrospective, observational, quasi-experimental design was employed to determine the change in health outcomes from pre-to posttreatment. Treatment outcomes were analyzed for 764 service members who attended the 3-week behavioral health program between 2008 and 2013. Results indicate significant reductions in PTSD symptoms (PTSD Checklist–Military version; p<. 001), anxiety (Beck Anxiety Inventory; p<. 001), depression (Beck Depression Inventory II; p<. 001), and pain (Oswestry Pain Index; p<. 001) from pre-to posttreatment. Outcome analysis by year indicates steady improvements in treatment gains for these major outcomes over time. Advancement is occurring in the search for effective, evidence-based treatments …", "num_citations": "18\n", "authors": ["2091"]}
{"title": "The challenge of determining appropriate Care in the era of patient-centered care and rising health care costs\n", "abstract": " Appropriateness of care is typically determined in the United States by evidence on efficacy and safety, combined with the judgments of experts in research and clinical practice, but without consideration of the cost of care or patient preferences. The shift in focus towards patient-centered care calls for consideration of outcomes that are important to patients, accommodation of patient preferences, and incorporation of the costs of care in patient-provider shared clinical decisions. The RAND/UCLA Appropriateness method was designed to determine rates of appropriate or inappropriate care, but the method did not include patient preferences or costs. This essay examines how methods of studying appropriateness can be made more patient-centered by describing a modification of the RAND/UCLA method by including patient outcomes, preferences, and costs.", "num_citations": "15\n", "authors": ["2091"]}
{"title": "Researching the appropriateness of care in the complementary and integrative health professions: part I\n", "abstract": " ObjectivesThe purpose of this article is to report on the Center of Excellence for Research on Complementary and Alternative Medicine at RAND Corporation. The overall project examined the appropriateness of chiropractic spinal manipulation and mobilization for chronic low back pain and chronic cervical pain using the RAND and University of California Los Angeles Appropriateness Method, including patient preferences and costs, to acknowledge the importance of patient-centered care in clinical decision-making.MethodsThis article is a narrative summary of the overall project and its inter-related components (ie, 4 Research Project Grants and 2 centers), including the Data Collection Core, whose activities and learning will be the subject of a following series of methods articles.ResultsThe project team faced many challenges in accomplishing data collection goals. The processes we developed to overcome …", "num_citations": "15\n", "authors": ["2091"]}
{"title": "Program evaluation of total force fitness programs in the military\n", "abstract": " The Chairman of the Joint Chiefs of Staff has charged the military’s medical and research communities to join with the line community in rapidly and efficiently building a framework to promote and measure total force fitness (TFF). The need to identify the elements of promising TFF programs, and to evaluate whether and how they work, has taken on a new urgency, as we witness the heavy toll of combat exposure on our military members and families. We propose a rigorous methodology for conducting program evaluation, including the study of structure, process, and outcomes. The proposed model combines both quantitative and qualitative methods, to assess the effectiveness and replicability of holistic, multidimensional programs as they are implemented. We describe an additional model for the assessment of efficacy through group randomization trials. The result is a comprehensive model that can be used …", "num_citations": "15\n", "authors": ["2091"]}
{"title": "Psychiatric symptoms associated with ephedra use\n", "abstract": " The objective of this review is to describe psychiatric adverse events occurring after ingestion of dietary supplements containing herbal ephedra and to assess the possible relationship between supplement use and the events. The authors reviewed all adverse event reports related to dietary supplements containing herbal ephedra from US FDA MedWatch files as of 30 September, 2001. Psychosis, mania or severe agitation, severe depression, hallucinations, delusions, suicide attempts, paranoia and violent behaviour were classified as serious psychiatric events. Events were categorised based on the amount of information supporting a causal relationship. Out of almost 1800 total adverse events, 57 were classified as both psychiatric in nature and serious. Two-thirds of these psychiatric cases involved patients with pre-existing psychological/psychiatric conditions and/or use of other mood-altering medications or …", "num_citations": "13\n", "authors": ["2091"]}
{"title": "Understanding US Health Systems: using mixed methods to unpack organizational complexity\n", "abstract": " Methods:We collected in-depth information on eight health systems through key informant interviews, descriptive surveys, and document review. Qualitative data were systematically coded. We conducted analyses to identify organizational structures and mechanisms through which health systems influence practice.Results:As expected, we found that health systems vary on multiple dimensions related to organizational structure (eg, size, complexity) which reflects history, market and mission. With regard to levers of influence, we observed within-system variation both in mechanisms (eg, employment of physicians, system-wide EHR, standardization of service lines) and level of influence. Concepts such as “core” versus “peripheral” were more salient than “ownership” versus “contract.”Discussion:Data from secondary sources can help identify and map health systems, but they do not adequately describe them or the …", "num_citations": "12\n", "authors": ["2091"]}
{"title": "Evaluation capacity building in the context of military psychological health: Utilizing Preskill and Boyle’s multidisciplinary model\n", "abstract": " The need for evaluation capacity building (ECB) in military psychological health is apparent in light of the proliferation of newly developed, yet untested programs coupled with the lack of internal evaluation expertise. This study addresses these deficiencies by utilizing Preskill and Boyle’s multidisciplinary ECB model within a post-traumatic stress disorder treatment program. This model outlines a theoretical framework, offers practical strategies, and emphasizes both context and culture, which are paramount in military health-care settings. This study found that the model provides a highly applicable ECB framework that includes ways to identify ECB objectives, tailor activities, and understand outcomes. While there was high utilization of ECB activities by program staff, there was misaligned evaluative thinking, which ultimately truncated sustainable evaluation practice. Based on this research, evaluators can better …", "num_citations": "10\n", "authors": ["2091"]}
{"title": "Scientific evaluation and review of claims in health care (SEaRCH): A streamlined, systematic, phased approach for determining “what works” in healthcare\n", "abstract": " Background: Answering the question of “what works” in healthcare can be complex and requires the careful design and sequential application of systematic methodologies. Over the last decade, the Samueli Institute has, along with multiple partners, developed a streamlined, systematic, phased approach to this process called the Scientific Evaluation and Review of Claims in Health Care (SEaRCH™). The SEaRCH process provides an approach for rigorously, efficiently, and transparently making evidence-based decisions about healthcare claims in research and practice with minimal bias. Methods: SEaRCH uses three methods combined in a coordinated fashion to help determine what works in healthcare. The first, the Claims Assessment Profile (CAP), seeks to clarify the healthcare claim and question, and its ability to be evaluated in the context of its delivery. The second method, the Rapid Evidence …", "num_citations": "10\n", "authors": ["2091"]}
{"title": "Integrative pain management centers in the military: the challenges\n", "abstract": " Objectives: Biomedicine and complementary and alternative medicine are forming new relationships, under the rubric of integrative medicine. Recently, the military has adopted integrative medicine as the model for pain management. An evaluation was conducted on an integrative model for pain management at a major Army medical center to determine the distinct challenges that were encountered during the early stages of this integrative program. Methods: The design is a case study evaluation. Qualitative data were analyzed to determine whether the outcomes in terms of processes were in harmony with the program's mission. Study participants were patients (34), referring providers (25), program staff (20), administrators (18), and related medical center leadership (6). Results: The study uncovered the following challenges: misaligned culture and mission, resources, the valuing of services (relative value …", "num_citations": "9\n", "authors": ["2091"]}
{"title": "Mindfulness meditation for chronic pain: A systematic review\n", "abstract": " 英文摘要 RAND researchers conducted a systematic review that synthesized evidence from randomized controlled trials of mindfulness meditation interventions—used adjunctively or as monotherapy—to provide estimates of their efficacy and safety in alleviating chronic pain in adults.", "num_citations": "9\n", "authors": ["2091"]}
{"title": "Crowdsourcing qualitative thematic analysis\n", "abstract": " Evaluations that include stakeholders aim to understand their perspectives and to ensure that their views are represented. This article offers a new approach to gaining stakeholder perspectives through crowdsourcing. We recruited a sample of individuals with chronic low back pain through a crowdsourcing site. This sample coded textual data describing pain, provided themes, and provided feedback on constructs and procedures. The results generated by the crowdsourced participants were compared to results generated by experts. We found that crowdsourcing to develop code and textual responses was feasible, rapid, and inexpensive, offering the potential to enhance patient stakeholder engagement in evaluation. Crowdsourcing has broad implications for evaluation science beyond the health sector.", "num_citations": "7\n", "authors": ["2091"]}
{"title": "Evaluation of an integrative post-traumatic stress disorder treatment program\n", "abstract": " Objectives: Post-traumatic stress disorder (PTSD) and combat-related stress can be refractory, pervasive, and have a devastating impact on those affected, their families, and society at large. Challenges dealing with symptoms may in turn make a servicemember more susceptible to problems, including alcohol abuse, interpersonal conflict, and occupational problems. An effective treatment strategy will address multifactorial issues by using a holistic multimodal approach. Back on Track is an intensive outpatient program utilizing a holistic philosophy and multimodal treatments to provide a whole systems approach for the treatment of combat-related stress reactions and PTSD in active duty servicemembers. Design/Setting/Subjects: An explanatory, sequential, mixed-methods program evaluation was conducted to assess the effectiveness of a PTSD and combat stress treatment program. Quantitative outcomes were …", "num_citations": "7\n", "authors": ["2091"]}
{"title": "Researching the appropriateness of care in the complementary and integrative health professions part 3: designing instruments with patient input\n", "abstract": " ObjectivesThe purpose of this article is to describe how we designed patient survey instruments to ensure that patient data about preferences and experience could be included in appropriateness decisions. These actions were part of a project that examined the appropriateness of spinal manipulation and mobilization for chronic low back pain and chronic neck pain.MethodsWe conducted focus groups, cognitive interviews, a literature review of measures in prior chiropractic and complementary and integrative health research, and a pilot study to develop questionnaires of patient preferences, experiences, values, and beliefs.ResultsQuestionnaires were administered online to 2024 individuals from 125 chiropractic clinics. The survey included 3 long questionnaires and 5 shorter ones. All were administered online. The baseline items had 2 questionnaires that respondents could complete in different sittings …", "num_citations": "5\n", "authors": ["2091"]}
{"title": "Researching the appropriateness of care in the complementary and integrative health professions Part 4: Putting practice back into evidence-based practice by recruiting clinics …\n", "abstract": " ObjectivesThis paper focuses on the methods of a single study, incorporating data from chiropractic clinics into an evidenced-based investigation of the appropriateness of manipulation for chronic back pain.MethodsA cluster sample of clinics (125) from 6 sites across the United States was chosen for this observation study. Patients with chronic low-back and neck pain were recruited using iPads, completed a series of online questionnaires, and gave permission for their patient records to be scanned. Patient records for a random sample were also obtained. The RAND staff and clinic personnel collected record data.ResultsWe obtained survey data from 2024 patients with chronic low back pain, chronic neck pain, or both. We obtained patient record data from 114 of 125 clinics. These included the records of 1475 of the individuals who had completed surveys (prospective sample), and a random sample of 2128 …", "num_citations": "4\n", "authors": ["2091"]}
{"title": "Claim Assessment Profile: A method for capturing healthcare evidence in the Scientific Evaluation and Review of Claims in Health Care (SEaRCH)\n", "abstract": " Background: Grounding health claims in an evidence base is essential for determining safety and effectiveness. However, it is not appropriate to evaluate all healthcare claims with the same methods. “Gold standard” randomized controlled trials may skip over important qualitative and observational data about use, benefits, side effects, and preferences, issues especially salient in research on complementary and integrative health (CIH) practices. This gap has prompted a move toward studying treatments in their naturalistic settings. In the 1990s, a program initiated under the National Institutes of Health was designed to provide an outreach to CIH practices for assessing the feasibility of conducting retrospective or prospective evaluations. The Claim Assessment Profile further develops this approach, within the framework of Samueli Institute's Scientific Evaluation and Review of Claims in Health Care (SEaRCH …", "num_citations": "4\n", "authors": ["2091"]}
{"title": "A Method for Deconstructing the Health Encounter in Complementary and Alternative Medicine: The Social Context\n", "abstract": " BackgroundA critique of Complementary and Alternative Medicine is that its effectiveness is all placebo. In trying to deconstruct the placebo, scholars have looked at the context in the health encounter, identifying specific and non-specific effects in the doctor-patient relationship including communication; cognitive, psychological, and emotional element of the encounter; the meaning response during the encounter; the impact of the context on outcomes; and how the encounter is manipulated through such things as ritual.MethodsThis study used the chiropractic and osteopathic health encounter as a socially constructed space exemplars and used focus groups and a rapid ethnographic observation method in clinics to study the context of the encounter. The objective was to develop a systematic, valid, and rigorous methodology for collecting data about the contexts of health encounters.ResultsThe study showed that the clinicians and clinical staff consciously construct social settings and the types of interactions that occur within them. This is done consciously and deliberatively.ConclusionThe method we describe provided a rich data base on the context of the health encounter and it shows that these are not non-specific effects. The method could be applied to other health encounters in Complementary and Alternative Medicine and health care.", "num_citations": "3\n", "authors": ["2091"]}
{"title": "Evaluating integrative cancer clinics with the claim assessment profile: an example with the InspireHealth Clinic\n", "abstract": " Background: The evaluation of freestanding integrative cancer clinical programs is challenging and is rarely done. We have developed an approach called the Claim Assessment Profile (CAP) to identify whether evaluation of a practice is justified, feasible, and likely to provide useful information. Objectives: A CAP was performed in order to (1) clarify the healing claims at InspireHealth, an integrative oncology treatment program, by defining the most important impacts on its clients;(2) gather information about current research capacity at the clinic; and (3) create a program theory and path model for use in prospective research. Study Design/Methods: This case study design incorporates methods from a variety of rapid assessment approaches. Procedures included site visits to observe the program, structured qualitative interviews with 26 providers and staff, surveys to capture descriptive data about the program, and …", "num_citations": "3\n", "authors": ["2091"]}
{"title": "Evaluation of an integrative PTSD treatment program\n", "abstract": " Purpose: Advancement is occurring in the search for effective, evidence-based treatments for Post-Traumatic Stress Disorder (PTSD). One innovative program—the Warrior Combat Stress Reset Program—at Fort Hood is showing promise for reducing the symptoms of PTSD, anxiety, and depression through its integrative approach combining traditional individual and group therapy with complementary and alternative medicine (CAM) treatments (eg, Acupuncture, Reiki, Reflexology, Yoga). The objectives of the evaluation were to: 1) Analyze retrospective patient outcomes data and 2) Collect qualitative data from stakeholders including patients, family members, providers, and hospital leaders to identify mechanisms accounting for success or failure of the program.Methods: A mixed-methods program evaluation examined current treatment and practice of CAM for PTSD in conjunction with traditional therapies …", "num_citations": "2\n", "authors": ["2091"]}
{"title": "Regulation of Dietary Supplements in the Military. Report of an Expert Panel\n", "abstract": " The US military has had a longstanding interest in the potential for dietary supplements to enhance performance and optimize health, functions that it collectively refers to as metabolic defense. However, at the same time, the military is concerned about the potential for misuse of supplements. In 2008, at the request of the Samueli Institute, RAND Health conducted an informal one-day workshop on the use of dietary supplements for performance enhancement and on regulatory issues affecting dietary supplements. The workshop included a panel of experts who considered the following questions What types of policies and regulations currently exist regarding the use of dietary supplements in civilian-sector groups, such as among athletes and those whose jobs demand high levels of physical or cognitive performance What types of policies currently exist in the commercial domain around the point-of-sale for dietary supplements What kind of regulations does the military currently have in place with respect to the use and purchase of dietary supplements If it so chose, what could the military do to regulate the use of dietary supplements The purpose of this conference proceeding is to summarize the workshop that occurred on September 16, 2008. The conference proceeding should be of interest to policymakers, human resources and health care personnel who care for individuals in physically or cognitively demanding jobs, and others interested in the use and regulation of use of dietary supplements.Descriptors:", "num_citations": "2\n", "authors": ["2091"]}
{"title": "Sleep management in posttraumatic stress disorder: a systematic review and meta-analysis\n", "abstract": " ObjectivePost-traumatic stress disorder (PTSD) can lead to many negative secondary outcomes for patients, including sleep disturbances. The objective of this meta-analysis is (1) to evaluate the effect of interventions for adults with PTSD on sleep outcomes, PTSD outcomes, and adverse events, and (2) to evaluate the differential effectiveness of interventions aiming to improve sleep compared to those that do not.MethodsNine databases were searched for relevant randomized controlled trials (RCTs) in PTSD from January 1980 to October 2019. Two independent reviewers screened 7176 records, assessed 2139 full-text articles, and included 89 studies in 155 publications for this review. Sleep, PTSD, and adverse event outcomes were abstracted and meta-analyses were performed using the Hartung-Knapp-Sidik-Jonkman method for random effects.ResultsInterventions improved sleep outcomes (standardized …", "num_citations": "1\n", "authors": ["2091"]}
{"title": "Experiences With chiropractic care for patients with low back or neck pain\n", "abstract": " Background:Musculoskeletal disorders are the second leading cause of disability worldwide.Objective:Examine experiences of chiropractic patients in the United States with chronic low back or neck pain.Method:Observational study of 1853 chronic low back pain and neck pain patients (74% female) who completed an online questionnaire at the 3-month follow-up that included Consumer Assessment of Healthcare Providers and Systems (CAHPS) items assessing their experiences with care.Results:We found similar reports of communication for the chiropractic sample and patients in the 2016 CAHPS National Database, but 85% in the database versus 79% in the chiropractic sample gave the most positive response to the time spent with provider item. More patients in the CAHPS database rated their provider at the top of the scale (8 percentage points). More chiropractic patients reported always getting answers to …", "num_citations": "1\n", "authors": ["2091"]}
{"title": "Advancing democratic evaluation: using crowdsourcing to include and engage program participants\n", "abstract": " Democratic evaluation is built on the foundation of social justice, equity, inclusion, and participation. These tenets align with and support current trends in the health sector to engage patients and other stakeholders in all phases of evaluation. However, the high costs and amount of time required make it difficult to routinely involve program participants. In the current study, crowdsourcing is hypothesized to mitigate the barriers to stakeholder inclusion and participation that are key requirements for the application of democratic evaluation. This is a three-phase, mixed methods study with a within-and between-group design. Phase I demonstrated feasibility of access to program participants and credibility of crowdsourced data by comparing data collected through the crowdsourcing platform Amazon Mechanical Turk (MTurk) to a national clinical sample of patients collected in a RAND Corporation evaluation. Primary …", "num_citations": "1\n", "authors": ["2091"]}
{"title": "Meditation for Posttraumatic Stress Disorder: A Systematic Review\n", "abstract": " Posttraumatic stress disorder PTSD is a debilitating condition that emerges after exposure to a traumatic event. Meditation may provide a safe, self-administered, and inexpensive complement to first-line treatments for PTSD. This systematic review synthesized evidence on meditation interventions for the treatment of PTSD PROSPERO 2015 CRD42015025782. We searched eight electronic databases from inception to November 2015 and bibliographies of existing systematic reviews to identify English-language randomized controlled trials RCTs evaluating the efficacy and safety of meditation interventions in patients with PTSD. Two independent reviewers screened identified literature using predetermined eligibility criteria, abstracted study-level information, and assessed study quality. Meta-analyses used the Hartung-Knapp-Sidik-Jonkman method for random-effects models. The quality of evidence was assessed using the GRADE approach. The primary outcome was PTSD symptom severity, and other outcomes included depression, anxiety, quality of life, functional status, and adverse events. Ten RCTs on meditation interventions for PTSD met inclusion criteria, including five studies of mindfulness-based stress reduction, three of yoga, and two of the mantram repetition program. Meditation approach, intervention intensity, and study quality varied considerably. Eight RCTs included patients exposed to combat-associated trauma, six of which focused exclusively on combat-related trauma. Meditation interventions offered as adjunctive therapy reduced PTSD symptoms post-intervention compared with all comparators treatment as usual alone …", "num_citations": "1\n", "authors": ["2091"]}
{"title": "118 IDENTIFYING CHRONIC PROSTATITIS/CHRONIC PELVIC PAIN SYNDROME FOR EPIDEMIOLOGIC STUDIES\n", "abstract": " METHODSResponses from the 434 subjects (151 CP/CPPS, 149 benign prostatic hyperplasia (BPH), and 134 controls) who comprised the original NIH-CPSI validation set were examined. CP/CPPS symptoms were defined per the Nickel definition as follows: the presence of perineal or ejaculatory pain, plus a score of≥ 4 on the NIH-CPSI pain subscale. We calculated the fraction of diagnosed CP/CPPS cases that were correctly identified as having CP/CPPS symptoms (sensitivity), and the fraction of non-CP/CPPS cases that were correctly identified as not CP/CPPS (specificity).RESULTSResults are presented in the Table. The sensitivity of the definition was 70%. The specificity was 91% when compared with BPH patients, and 99% when compared with controls.", "num_citations": "1\n", "authors": ["2091"]}
{"title": "Bariatric surgery in women of reproductive age\n", "abstract": " Objectives:To measure the incidence of contemporary bariatric surgery procedures in women age 18–45 and to assess its impact on fertility, contraception, prepregnancy risk factors, and pregnancy outcomes, including those of neonates.Data Sources and Study Selection:We used the Nationwide Inpatient Sample (NIS), a national sample of over 1,000 hospitals, to measure the trend in the number of women of reproductive age who underwent bariatric procedures from 1998-2005. We searched numerous electronic databases, including Medline and Embase, for potentially relevant studies involving bariatric surgery (gastric bypass, laparoscopic adjustable gastric band, vertical-banded gastroplasty, biliopancreatic diversion), and consequent fertility, contraception, pregnancy, weight management, maternal outcomes, neonatal outcomes, and nutritional deficiencies. We scanned reference lists for additional relevant …", "num_citations": "1\n", "authors": ["2091"]}
{"title": "Chronic disease self-management programs for older adults\n", "abstract": " Arthritis, diabetes, and high blood pressure are chronic diseases of older adults that can be treated but not cured. Drugs can help to improve symptoms and to slow the progression of these diseases. However, patients who know more about their disease often do better than those who rely on drug therapy alone. Patients who work to make themselves healthy (for example, by exercising regularly or by losing weight) also do better. Health providers sometimes develop formal programs to teach patients with chronic disorders what they need to know and do to make their health as good as it can be. These programs are called self-management programs because patients are taught to manage more of their health themselves.", "num_citations": "1\n", "authors": ["2091"]}
{"title": "The sharer\n", "abstract": " Master Gunnery Sergeant's medals commemorated duty on every continent. “Yes, Lieutenant,” he would answer. He was respectful, but I felt ludicrous. He was Experience, and I was Ingenue.", "num_citations": "1\n", "authors": ["2091"]}