{"title": "Softwareplattformen für Unternehmenssoftwareökosysteme\n", "abstract": " Beeinflusst durch Megatrends, wie bspw. die Globalisierung und Individualisierung, sind Softwarefirmen im Umfeld von Unternehmenssoftware immer seltener in der Lage, die von den Kunden gewünschten Leistungen komplett eigenständig in effizienter Art und Weise zu erbringen. Vielmehr sind sie zunehmend von den komplementären Leistungen Dritter, wie bspw. Partnern und Kunden, abhängig. Durch die Kooperation mit diesen Akteuren entstehen Wertschöpfungsnetzwerke, sogenannte Unternehmenssoftwareökosysteme. Erfolgreiche Beispiele im IT-Umfeld stellen die Softwareökosysteme von Microsoft, salesforce oder SAP dar. Dank der Partnerschaften mit Anbietern von komplementärer Software und/oder komplementären Dienstleistungen, integriert durch zentrale Softwareplattformen, werden diese Plattformanbieter in die Lage versetzt, im Innenverhältnis Produkte und Prozesse zu standardisieren, aber gleichzeitig mittels Partnern individuelle Leistungen anzubieten und Kunden durch funktionale sowie technische Lock-in-Effekte an sich zu binden. Allerdings existieren bislang kaum Abhandlungen darüber, wie solche Unternehmenssoftwareökosysteme gezielt gesteuert werden können oder wie deren Softwareplattformen gestaltet sein müssen, um die Ziele dieser Softwareökosysteme zu erreichen. Das vorliegende Buch verfolgt die Zielsetzung, diese Forschungslücke zu schließen, indem zunächst relevante Determinanten der erfolgreichen Gestaltung von Unternehmenssoftwareökosystemen identifiziert und darauf aufbauend systematisch Gestaltungsempfehlungen für Softwareplattformen entwickelt werden. Während die …", "num_citations": "6\n", "authors": ["782"]}
{"title": "Strategic success factors in customization of business software\n", "abstract": " Customers often ask software vendors for business software customized to their needs and fitting into the existing application landscape. But unlike other areas of research there are just a few isolated results about the factors, which promote success of companies offering customization services for business software and which can serve as a guideline. This paper tries to overcome this weakness by presenting the results of a qualitative exploratory study conducted with German and Swiss software companies in 2011.", "num_citations": "3\n", "authors": ["782"]}