{"title": "Design guidelines for software process knowledge repository development\n", "abstract": " ContextStaff turnover in organizations is an important issue that should be taken into account mainly for two reasons:1.Employees carry an organization’s knowledge in their heads and take it with them wherever they go2.Knowledge accessibility is limited to the amount of knowledge employees want to shareObjectiveThe aim of this work is to provide a set of guidelines to develop knowledge-based Process Asset Libraries (PAL) to store software engineering best practices, implemented as a wiki.MethodFieldwork was carried out in a 2-year training course in agile development. This was validated in two phases (with and without PAL), which were subdivided into two stages: Training and Project.ResultsThe study demonstrates that, on the one hand, the learning process can be facilitated using PAL to transfer software process knowledge, and on the other hand, products were developed by junior software engineers …", "num_citations": "76\n", "authors": ["399"]}
{"title": "Gamified system for learning of Scrum development process\n", "abstract": " Agile Scrum process for software development is a framework easy to understand, but its roles, artifacts and events must be trained to ensure that developers perform their activities correctly. Therefore, innovative strategies are required to promote their learning. One such strategy is gamification. This paper aims to describe a gamified system oriented to mobile platforms that allows to apply the Scrum process from the Scrum Master's viewpoint. The gamified system developed was evaluated by university students of Software Engineering. The results show that the gamified system favors the learning of Scrum concepts from a good usability and playability.", "num_citations": "7\n", "authors": ["399"]}
{"title": "Aplicación móvil para mejorar la capacidad cognitiva en adultos mayores utilizando juegos mentales\n", "abstract": " Las tecnologías móviles pueden traer grandes beneficios para el desarrollo de una mejor calidad de vida de las personas, especialmente a una población tan vulnerable como los adultos mayores, los cuales debido a que presentan enfermedades y carencias propias de su edad. Además, debido a la revolución tecnológica que se experimenta actualmente, van quedando rezagados y presentan dificultades para aprender de estas innovaciones. Por tal razón, el objetivo de este estudio, es dar a conocer una iniciativa que pretende mejorar la capacidad cognitiva de ese grupo focal, a través del uso de tecnologías móviles. La aplicación desarrollada está compuesta de cuatro módulos: juegos mentales, calendario, noticias y tests mentales. Los resultados obtenidos en un grupo de adultos mayores corresponden a que muestran un gran interés en categorías como memoria, juegos y entrenamiento cerebral.", "num_citations": "4\n", "authors": ["399"]}
{"title": "Trends in Software Engineering Processes using Deep Learning: A Systematic Literature Review\n", "abstract": " In recent years, several researchers have applied machine learning techniques to several knowledge areas achieving acceptable results. Thus, a considerable number of deep learning models are focused on a wide range of software processes. This systematic review investigates the software processes supported by deep learning models, determining relevant results for the software community. This research identified that the most extensively investigated sub-processes are software testing and maintenance. In such sub-processes, deep learning models such as CNN, RNN, and LSTM are widely used to process bug reports, malware classification, libraries and commits recommendations generation. Some solutions are oriented to effort estimation, classify software requirements, identify GUI visual elements, identification of code authors, the similarity of source codes, predict and classify defects, and analyze bug …", "num_citations": "3\n", "authors": ["399"]}
{"title": "Diseño, desarrollo y evaluación de un recurso educativo digital para la introducción a la Administración de Sistemas Informáticos\n", "abstract": " Este documento presenta el proceso de diseño, desarrollo y evaluación de un recurso educativo digital para estudiantes de primer semestre de Administración de Sistemas Informáticos, de la Universidad Nacional de Colombia, sede Manizales. Este programa curricular de pregrado trabaja en un área de conocimiento interdisciplinar que es afín a la administración ya la informática. El contenido del recurso educativo digital se basa en el perfil profesional de esta disciplina, los conceptos básicos sobre teoría general de sistemas y pensamiento sistémico. Los elementos del recurso fueron diseñados por los profesores del curso y adaptados a formato digital por profesionales especializados. El recurso fue consultado y utilizado por estudiantes del curso, quienes a través de una encuesta evaluaron cada uno de sus elementos y el impacto en su aprendizaje. Los resultados muestran que el recurso educativo digital dio soporte a los temas trabajados de manera presencial en clase y al conocimiento sobre los conceptos básicos de esta interdisciplina. Los estudiantes valoraron positivamente los mapas conceptuales, las diapositivas y los conceptos relacionados con la teoría general de sistemas. Se propone que versiones futuras de este recurso integren los resultados de las actividades indicadas en el recurso y realizadas por los estudiantes.", "num_citations": "3\n", "authors": ["399"]}
{"title": "Techniques Based on Data Science for Software Processes: A Systematic Literature Review\n", "abstract": " Software quality is an important topic for software practitioners in order to guarantee how the system is built and performed. In last years, techniques related to data science have been utilized in software engineering field as sup-port for building mainly prediction models. These approaches focused on trying to minimize software problems during the development and performance of software, helping to make right decisions. This systematic literature review (SLR) aims at investigating the significant techniques of data sciences used in software processes, identifying their major impacts and problems/challenges of use. This review will be of interest for software practitioners concerned on software quality.", "num_citations": "3\n", "authors": ["399"]}
{"title": "La administración de sistemas informáticos, una alternativa a la formación del profesional en tecnologías de información y comunicaciones\n", "abstract": " La Administración de Sistemas es una disciplina relacionada con la informática, afín a la ingeniería de sistemas, que estudia las TIC como función del negocio y la forma de gestionarlas para agregar valor a las organizaciones. Este artículo presenta una visión de lo que es la administración de sistemas informáticos, como una alternativa a la formación del ingeniero de sistemas, la evolución de su rol del profesional en sistemas, sus competencias, áreas de estudio e investigación y su estado actual desde el punto de vista de programas de formación en el contexto colombiano.", "num_citations": "3\n", "authors": ["399"]}
{"title": "Software prototype for learning of computer programming based on digital games\n", "abstract": " This paper describes the development of \"Protoboy\", an educational and fun alternative that applies aspects of Digital Game-Based Learning (DGBL) and gamification in order to motivate students during their education to gain knowledge about logic and computer programming. The software prototype built allows providing programming concepts and challenges that are fun and intuitive. The tests performed on the prototype showed a good evaluation of the aesthetics and perception of the video game by the students.", "num_citations": "2\n", "authors": ["399"]}
{"title": "Evaluation of design and code revisions in academic practices of software engineering\n", "abstract": " Personal Software Process (PSP) is a process that develops individual skills in software engineers to control and improve the quality of their work practices. This paper presents an evaluative study on the effectiveness of design and code reviews includes into the PSP development activities. The study carried out with students of the Management Information Systems in National University of Colombia - Manizales. An experiment was designed to develop a program using PSP scripts forms standards and measures. The program was developed by two groups of students one group used the revisions and the other did not. Test hypotheses carried out show that there are no significant differences in the effectiveness of PSP code and design revisions compared to traditional development in which no revisions are made. However design and code reviews achieved to eliminate defects in the early stages effectively. This …", "num_citations": "1\n", "authors": ["399"]}
{"title": "Towards the development of a framework for encouraging the learning of SPICE model by using knowledge graphs\n", "abstract": " Software process learning is a relevant aspect on software process improvement. In this paper, we present a framework based on knowledge graphs, in order to evaluate the expertise on ISO 15504 software model (SPICE). Having identified some papers related to the target of the research, we have proposed a framework with modules related to mechanisms, to extract both: information from IT workers and SPI models, for generating the corresponding knowledge graphs and matching them, to determine strengths and weaknesses in the learning process of the SPICE model.", "num_citations": "1\n", "authors": ["399"]}