{"title": "Unpacking\" privacy\" for a networked world\n", "abstract": " Although privacy is broadly recognized as a dominant concern for the development of novel interactive technologies, our ability to reason analytically about privacy in real settings is limited. A lack of conceptual interpretive frameworks makes it difficult to unpack interrelated privacy issues in settings where information technology is also present. Building on theory developed by social psychologist Irwin Altman, we outline a model of privacy as a dynamic, dialectic process. We discuss three tensions that govern interpersonal privacy management in everyday life, and use these to explore select technology case studies drawn from the research literature. These suggest new ways for thinking about privacy in socio-technical environments as a practical matter.", "num_citations": "1307\n", "authors": ["1178"]}
{"title": "Twitter adoption and use in mass convergence and emergency events\n", "abstract": " This paper offers a descriptive account of Twitter (a microblogging service) across four high-profile, mass convergence events – two emergency and two national security. We statistically examine how Twitter is being used surrounding these events, and compare and contrast how that behaviour is different from more general Twitter use. Our findings suggest that Twitter messages sent during these types of events contain more displays of information broadcasting and brokerage, and we observe that general Twitter use seems to have evolved over time to offer more of an information-sharing purpose. We also provide preliminary evidence that Twitter users who join during and in apparent relation to a mass convergence or emergency event are more likely to become long-term adopters of the technology.", "num_citations": "1268\n", "authors": ["1178"]}
{"title": "Backchannels on the front lines: Emergency uses of social media in the 2007 Southern California Wildfires\n", "abstract": " Opportunities for participation by members of the public are expanding the information arena of disaster. Social media supports “backchannel” communications, allowing for wide-scale interaction that can be collectively resourceful, self-policing, and generative of information that is otherwise hard to obtain. Results from our study of information practices by members of the public during the October 2007 Southern California Wildfires suggest that community information resources and other backchannel communications activity enabled by social media are gaining prominence in the disaster arena, despite concern by officials about the legitimacy of information shared through such means. We argue that these emergent uses of social media are pre-cursors of broader future changes to the institutional and organizational arrangements of disaster response.", "num_citations": "1032\n", "authors": ["1178"]}
{"title": "Instant messaging in teen life\n", "abstract": " Instant Messaging (IM) is being widely adopted by teenagers. In a study of 16 teenage IM users, we explore IM as an emerging feature of teen life, focusing our questions on its support of interpersonal communication and its role and salience in everyday life. We qualitatively describe the teens' IM use interpersonally, as well as its place in the domestic ecology. We also identify technology adoption conditions and discuss behaviors around privacy management. In this initial investigation, we found differences in the nature of use between high school and college teens, differences we propose are accounted for by teens' degree of autonomy as a function of domestic and scholastic obligations, the development of independent work practices, Internet connectivity access, and even transportation access. Moreover, while teen IM use is in part characterized as an optimizing choice between multiple communications …", "num_citations": "739\n", "authors": ["1178"]}
{"title": "Citizen communications in crisis: anticipating a future of ICT-supported public participation\n", "abstract": " Recent world-wide crisis events have drawn new attention to the role information communication technology (ICT) can play in warning and response activities. Drawing on disaster social science, we consider a critical aspect of post-impact disaster response that does not yet receive much information science research attention. Public participation is an emerging, large-scale arena for computer-mediated interaction that has implications for both informal and formal response. With a focus on persistent citizen communications as one form of interaction in this arena, we describe their spatial and temporal arrangements, and how the emerging information pathways that result serve different post-impact functions. However, command-and-control models do not easily adapt to the expanding data-generating and-seeking activities by the public. ICT in disaster contexts will give further rise to improvised activities and …", "num_citations": "578\n", "authors": ["1178"]}
{"title": "Crisis in a networked world: Features of computer-mediated communication in the April 16, 2007, Virginia Tech event\n", "abstract": " Crises and disasters have micro and macro social arrangements that differ from routine situations, as the field of disaster studies has described over its 100-year history. With increasingly pervasive information and communications technology and a changing political arena where terrorism is perceived as a major threat, the attention to crisis is high. Some of these new features of social life have created changes in disaster response that we are only beginning to understand. The University of Colorado is establishing an area of sociologically informed research and information and communications technology development in crisis informatics. This article reports on research that examines features of computer-mediated communication and information sharing activity during and after the April 16, 2007, crisis at Virginia Tech by members of the public. The authors consider consequences that these technology …", "num_citations": "539\n", "authors": ["1178"]}
{"title": "Crisis in a networked world features of computer-mediated communication in the April 16, 2007, Virginia Tech event\n", "abstract": " Crises and disasters have micro and macro social arrangements that differ from routine situations, as the field of disaster studies has described over its 100-year history. With increasingly pervasive information and communications technology and a changing political arena where terrorism is perceived as a major threat, the attention to crisis is high. Some of these new features of social life have created changes in disaster response that we are only beginning to understand. The University of Colorado is establishing an area of sociologically informed research and information and communications technology development in crisis informatics. This article reports on research that examines features of computer-mediated communication and information sharing activity during and after the April 16, 2007, crisis at Virginia Tech by members of the public. The authors consider consequences that these technology …", "num_citations": "539\n", "authors": ["1178"]}
{"title": "Going wireless: behavior & practice of new mobile phone users\n", "abstract": " We report on the results of a study in which 19 new mobile phone users were closely tracked for the first six weeks after service acquisition. Results show that new users tend to rapidly modify their perceptions of social appropriateness around mobile phone use, that actual nature of use frequently differs from what users initially predict, and that comprehension of service-oriented technologies can be problematic. We describe instances and features of mobile telephony practice. When in use, mobile phones occupy multiple social spaces simultaneously, spaces with norms that sometimes conflict: the physical space of the mobile phone user and the virtual space of the conversation.", "num_citations": "456\n", "authors": ["1178"]}
{"title": "Finding community through information and communication technology in disaster response\n", "abstract": " Disasters affect not only the welfare of individuals and family groups, but also the well-being of communities, and can serve as a catalyst for innovative uses of information and communication technology (ICT). In this paper, we present evidence of ICT use for re-orientation toward the community and for the production of public goods in the form of information dissemination during disasters. Results from this study of information seeking practices by members of the public during the October 2007 Southern California wildfires suggest that ICT use provides a means for communicating community-relevant information especially when members become geographically dispersed, leveraging and even building community resources in the process. In the presence of pervasive ICT, people are developing new practices for emergency response by using ICT to address problems that arise from information dearth and …", "num_citations": "443\n", "authors": ["1178"]}
{"title": "In search of the bigger picture: The emergent role of on-line photo sharing in times of disaster\n", "abstract": " Eyewitness photography is increasingly playing a more significant role in disaster response and recovery efforts. This research elaborates on the ways in which members of the public participate during times of disaster by closely examining the evolving role of a prominent photo-sharing website, Flickr, in events that have occurred since its launch in February 2004. We discuss features of Flickr’s emerging evolutionary growth as a community forum for disaster-related grassroots activity based on the findings from our qualitative study of 29 groups across six disasters over Flickr’s nearly three-year lifespan. Our findings discuss efforts toward the development of norms that attempt to guide the nature of social practice around photographic content during disaster response and recovery efforts.", "num_citations": "336\n", "authors": ["1178"]}
{"title": "Online forums supporting grassroots participation in emergency preparedness and response\n", "abstract": " \"When danger arises, the rule in normal situations is for people to help those next to them before they help themselves.\"", "num_citations": "329\n", "authors": ["1178"]}
{"title": "Social, individual and technological issues for groupware calendar systems\n", "abstract": " Designing and deploying groupware is difficult. Groupware evaluation and design are often approached from a single perspective, with a technologically-, individually-, or socially-centered focus. A study of Groupware Calendar Systems (GCSs) highlights the need for a synthesis of these multiple perspectives to fully understand the adoption challenges these systems face. First, GCSs often replace existing calendar artifacts, which can impact users calendaring habits and in turn influence technology adoption decisions. Second, electronic calendars have the potential to easily share contextualized information publicly over the computer network, creating opportunities for peer judgment about time allocation and raising concerns about privacy regulation. However, this situation may also support coordination by allowing others to make useful inferences about ones schedule. Third, the technology and the social …", "num_citations": "329\n", "authors": ["1178"]}
{"title": "Collective intelligence in disaster: Examination of the phenomenon in the aftermath of the 2007 Virginia Tech shooting\n", "abstract": " We report on the results of an investigation about the “informal,” public-side communications that occurred in the aftermath of the April 16, 2007 Virginia Tech (VT) Shooting. Our on-going research reveals several examples of on-line social interaction organized around the goal of collective problem-solving. In this paper, we focus on specific instances of this distributed problem-solving activity, and explain, using an ethnomethodological lens, how a loosely connected group of people can work together on a grave topic to provide accurate results.", "num_citations": "325\n", "authors": ["1178"]}
{"title": "Voice-mail diary studies for naturalistic data capture under mobile conditions\n", "abstract": " Mobile technology requires new methods for studying its use under realistic conditions\" in the field.\" Reflexively, mobile technology also creates new opportunities for data collection while participants are remotely located. We report on our experiences with a variation on the paper-based diary study technique, which we extend by using voice-mail paired with mobile and landline telephony to more easily collect data in natural situations. We discuss lessons learned from experiences with voice-mail diary studies in two investigations of different scope. We also present suggestions for tailoring the technique to different research objectives, garnering high subject participation, and configuring the voice-mail system for data collection.", "num_citations": "299\n", "authors": ["1178"]}
{"title": "Constructing meaning from space, gesture, and speech\n", "abstract": " Face-to-face communication in the workplace is often conceived of as consisting mainly of spoken language. Although spoken language is clearly a very important medium for the creation of representations, in complex work settings, it is one of several such media. Gestures and the space inhabited by speakers and listeners are normally thought of as providing context for the interpretation of speech. In this chapter we show how space, gesture, and speech are all combined in the construction of complex multilayered representations in which no single layer is complete or coherent by itself. We examine a brief explanation given by one worker to two others. We show how the meaning of the explanation is carried in the coordination among the spatial organization of specilized artifacts, the positioning of gestures with respect to those artifacts, and the words that are spoken.", "num_citations": "296\n", "authors": ["1178"]}
{"title": "The evolving role of the public information officer: An examination of social media in emergency management\n", "abstract": " This work examines how the introduction of social media has affected the role of the Public Information Officer (PIO)—the public relations component of the National Incident Management System (NIMS). Through analysis of 25 PIO interviews, we examine the work practice of PIOs and find that social media expand not only the scope and type of PIO work activity, but also the “information pathways” that exist between PIOs, the media, and members of the public. We model these changes and examine how the presence of social media challenges previous conceptualizations of PIO work. Lastly, we present a view of how PIO work could be better imagined for the future of emergency management organizations.", "num_citations": "280\n", "authors": ["1178"]}
{"title": "Online social media in crisis events\n", "abstract": " By Leysia Palen inquiry within our larger research focus on crisis informatics, one that examines information generation and dissemination activities by members of the public, which is playing an increasingly critical role across all phases of disaster. 1 As social media—which includes blogs, social networking environments, person-to-person and broadcast messaging, and other Web 2.0 applications—becomes more pervasive, their use has significant implications for emergency management practice and policy. ICT enables people—disaster survivors, curious observers, and those who wish to help victims—to connect to one another and to participate in events, including through seeking and providing information peer-to-peer.", "num_citations": "279\n", "authors": ["1178"]}
{"title": "The new cartographers: Crisis map mashups and the emergence of neogeographic practice\n", "abstract": " Crisis situations are ripe for expansion of the neogeographer population and skill set. We qualitatively examine the design and creation of crisis map mashups to describe emergent neogeographic practices in this particular domain. We analyze the circumstances that led to their creation, data selection, and design choices vis-à-vis spatial and temporal information representation. We then discuss the implications of emergent neogeographic practice based on two case examples, which illustrate the merging of professional and participatory geotechnologies, and the opportunity a blending of the two provides for widespread cartographic literacy.", "num_citations": "276\n", "authors": ["1178"]}
{"title": "Discovery and integration of mobile communications in everyday life\n", "abstract": " We report on the results of a study in which 19 new mobile telephone users were closely tracked for the first six weeks after service acquisition. Results show that novices tend to rapidly modify their perceptions of social appropriateness around mobile phone use, that actual nature of use frequently differs from initial predictions, and that comprehension of service-based technologies can be problematic. We also describe instances and features of mobile telephony practice. When in use, mobile phones occupy multiple social spaces simultaneously, spaces with norms that sometimes conflict: the physical space of the mobile phone user and the virtual space of the conversation.", "num_citations": "261\n", "authors": ["1178"]}
{"title": "Why groupware succeeds: Discretion or mandate?\n", "abstract": " Single-user applications are designed with a ‘discretionary use’ model. In contrast, for large systems, upper management support is considered crucial to adoption. Which applies to groupware? The relatively low cost of groupware reduces high-level visibility, but some argue that social dynamics will force mandated use—the large system approach. Interview studies of recently adopted on-line meeting schedulers in two large organizations found successful, near-universal use achieved without managerial mandate. Versatile functionality and ease of use associated with discretionary products appeared to be factors leading to adoption. Other factors included organization-wide infrastructure and substantial peer pressure that developed over time.", "num_citations": "254\n", "authors": ["1178"]}
{"title": "Crisis informatics: Studying crisis in a networked world\n", "abstract": " Serious crises and disasters have micro and macro social arrangements that differ from routine situations, as the field of disaster studies has described over its 100-year history. With increasingly pervasive information and communications technology (ICT) and a changing political arena where terrorism is perceived as a major threat, the attention to crisis is high. Some of these new features of social life have created real change in the sociology of disaster that we are only beginning to understand. However, much of what might seem to be new is not; rather ICT makes some behaviors more visible, in particular first response and altruistic activities. Even so, with each new crisis event, the calls for technological solutions and policy change come fast and furious, often in absence of empirical research. Our lab is establishing an area of sociologically informed research and ICT development in the area of crisis informatics. Here, we report on some of the challenges and findings when conducting empirical study where the subject of attention is disperse, emergent and increasingly expanding through on-line arenas. We specifically consider the challenge of studying citizenside information generation and dissemination activities during the April 16, 2007 crisis at Virginia Tech, which we have investigated both on-site and on-line.", "num_citations": "241\n", "authors": ["1178"]}
{"title": "“I'll get that off the audio” a case study of salvaging multimedia meeting records\n", "abstract": " We describe a case study of a complex, ongoing, collaborative work process, where the central activity is a series of meetings reviewing a wide range of subtle technical topics. The problem is the accurate repxting of the results of these meetings, which is the responsibility of a single person, who is not well-versed in all the topics. We provided tools to capture the meeting discussions and tools to “salvage” the cap tured multimedia recordings. Salvaging is a new kind of activity involving replaying, extracting, organizing, and writing. We observed a year of mature salvaging work in the case study. From this we describe the nature of salvage work (the constituent activities, the use of the workspace, the affordances of the audio medium, how practices develop and differentiate, how the content material affects practice). We also demonstrate how this work relates to the larger work processes (the task demands of the setting …", "num_citations": "201\n", "authors": ["1178"]}
{"title": "From crowdsourced mapping to community mapping: The post-earthquake work of OpenStreetMap Haiti\n", "abstract": " The earthquake that struck Haiti on January 12, 2010 catalyzed a nascent set of efforts in then-emergent “volunteer technology communities.” Among these was the response from OpenStreetMap, a volunteer-driven project that makes geospatial data free and openly available. Following the earthquake, remotely located volunteers rapidly mapped the affected areas to support the aid effort in a remarkable display of crowdsourced work. However, some within that effort believed that the impact and import of open and collaborative mapping techniques could provide much richer value to humanitarian aid work and the long-term development needs of the country. They launched an ambitious project that trialed methods for how to create sustainable and locally-owned community-mapping ecosystems in at-risk regions of the world. This paper describes how an organization that emerged out of the response—the …", "num_citations": "161\n", "authors": ["1178"]}
{"title": "The emergence of online widescale interaction in unexpected events: assistance, alliance & retreat\n", "abstract": " This paper examines online, widescale interaction during an emergency event of national interest. Widescale interaction describes the potential for broad, immediate, and varied participation that the conditions of online forums, and social networking sites in particular, increasingly allow. Here, we examine a group on a popular social networking site as a virtual destination in the aftermath of the Northern Illinois University (NIU) shootings of February 14, 2008 in relation to related activity that happened in response to the Virginia Tech (VT) tragedy 10 months earlier. We consider features of interactions that are enabled when a vast audience converges under such conditions. We discuss how commiseration and information seeking are interrelated, and how geographical communities that share a common experience ally in such a public, online setting.", "num_citations": "161\n", "authors": ["1178"]}
{"title": "Chatting with teenagers: Considering the place of chat technologies in teen life\n", "abstract": " In the last few years, teenagers have been on the forefront of adopting short message service (SMS), a mobile phone-based text messaging system, and instant messaging (IM), a computer-based text chat system. However, while teenage adoption of SMS had led to a series of studies examining the reasons for its popularity, IM use in the teenage population remains understudied. This omission becomes significant given the increasing interest in domestic computing among human-computer interaction (HCI) and computer-supported cooperative work (CSCW) researchers. Further, because of the dearth of empirical work on teenage use of IM, we find that IM and SMS are sometimes incorrectly assumed to share the same features of use. To address these concerns, we revisit our own studies of SMS and IM use and reexamine them in tandem with other published studies on teenage chat. We consider similarities and …", "num_citations": "161\n", "authors": ["1178"]}
{"title": "Mobile telephony in a connected life\n", "abstract": " Mobile phones help manage and grant instant access to users' dispersed social networks but risk violating the age-old social conventions of face-to-face relationships.", "num_citations": "160\n", "authors": ["1178"]}
{"title": "Site-seeing in disaster: An examination of on-line social convergence\n", "abstract": " On-line websites and applications are increasingly playing a role in disaster response and recovery. Yet with the wide variety of on-line grassroots activities that occur in such situations, it can be difficult to make sense of them. In this paper, we describe on-line behavior as socially convergent activity, interpreting it within existing sociological understandings of behavior in disaster events. We discuss seven types of convergent behavior and give examples of on-line activities for each type. By seeing these activities as an essential part of the disaster social arena, we can begin to think about how to support socially convergent phenomena in new and creative ways.", "num_citations": "159\n", "authors": ["1178"]}
{"title": "Trial by fire: The deployment of trusted digital volunteers in the 2011 shadow lake fire\n", "abstract": " We report on the use of a team of trusted digital volunteers during the 2011 Shadow Lake Fire that occurred in the US Pacific Northwest to extend the social media capacity of a Type I incident management team. In this case study, we outline the tools and processes used by this virtual team to coordinate their activities, monitor social media communication and to establish communications with the public around the event. Finally, we discuss the potential merits and limitations of implementing a team of trusted volunteers and explore how this idea could be incorporated into emergency management organizations.", "num_citations": "154\n", "authors": ["1178"]}
{"title": "Of pill boxes and piano benches: \" home-made\" methods for managing medication\n", "abstract": " We report on the results of an ethnographic study of how elders manage their medication with the objective of informing the de-sign of in-home assistive health technology to support\" medication adherence.\" We describe the methods by which elders organize and remember to take their medication-methods that leverage a kind of distributed cognition. Elders devise medication manage-ment systems that rely on the spatial features of their homes, the temporal rhythms of their days, as well as the routines that occa-sion these places and times to help recall and prospective remem-bering. We show how mobile health care workers participate in the development and execution of these systems, and\" read\" them to infer an elder's state of health and ability to manage medication. From this analysis, we present five principles for the design of assistive technology that support the enhanced but on-going use of personalized …", "num_citations": "152\n", "authors": ["1178"]}
{"title": "The Inside Text\n", "abstract": " The eighteenth and nineteenth centuries are regarded as the heyday of a German culture of letter writing. The letter was released from the constraints of a restrictive formal language style (Kanzleistil) and was now written in German instead of Latin. The letter had always been considered a speech substitute as well as a ‘written conversation’and so the orientation to the conversation even became the new guideline of letter-writing. Write as you speak, this was effectively the instruction that is associated with the name Christian Fürchtegott Gellert (1715-1769). It may be an overstatement, but you could consider Gellert a prophet of electronic mail, which is released from all formal constraints and indeed is written much like one speaks. Gellert would not necessarily be pleased by this. For him, it was not about writing as one speaks, but rather:“When I write: I do it only, as if I were speaking, and I must not drive the natural …", "num_citations": "142\n", "authors": ["1178"]}
{"title": "Social media in disaster communication\n", "abstract": " This chapter surveys the rapid rise of social media in a range of disaster experiences, reviewing topics of citizen reporting, community-oriented computing, distributed problem solving, and digital volunteerism as forms of socio-technical innovation, as well as topics of situational awareness and veracity as opportunities and challenges that arise from the social media data deluge. The chapter also reviews the research that examines the inclusion of social media technology and data in existing emergency management work. In reflecting on the decade-old field of research, the authors warn of the danger of inadvertently collapsing all “crisis” experiences together without distinction, which tends to happen because social media platforms cross-cut all emergency situations. In an attempt to isolate what social media newly contributes, the tendency is to fail to consider how non-technological factors strongly …", "num_citations": "141\n", "authors": ["1178"]}
{"title": "The social production of heritage through cross‐media interaction: making place for place‐making\n", "abstract": " The living relationship between intangible and tangible forms of heritage, as well as natural and cultural heritage, is a situated one, always in place. Information and communications technology (ICT) is opening up new ways of experiencing and thinking about heritage by allowing for cross‐media interaction. By combining different media and technologies, cross‐media interaction supports the social production of heritage and creates ‘infrastructures’ that act as places of cultural production and lasting values at the service of a living heritage practice.", "num_citations": "140\n", "authors": ["1178"]}
{"title": "Participatory design in emergency medical service: designing for future practice\n", "abstract": " We describe our research-its approach, results and products-on Danish emergency medical service (EMS) field or\" pre-hospital\" work in minor and major incidents. We discuss how commitments to participatory design and attention to the qualitative differences between minor and major incidents address challenges identified by disaster sociolo-gists when designing for major incidents. Through qualitative research and participatory design, we have examined the features of EMS work and technology use in different emergency situations from the perspective of multiple actors. We conceptualize victims in incidents-and particularly in major incidents, where on-site medical as-sessments is highly incomplete-as boundary objects over which the complex and imperfect work of coordination is done. As an outcome of our participatory design approach, we describe a set of designs in support of future EMS work.", "num_citations": "131\n", "authors": ["1178"]}
{"title": "Discretionary adoption of group support software: Lessons from calendar applications\n", "abstract": " Although the World Wide Web, Internet and organisational intranets have made computer-mediated collaboration possible for many people, adoption of collaboration technologies in business environments still presents challenges and is often slower or less widespread than anticipated Technologies focused on supporting groups fall between strictly single-user applications and enterprise systems. Single-user applications are designed with a “discretionary use” model. In contrast, for large enterprise systems, upper management support is considered crucial for smooth deployment and adoption. Which one applies to technologies that support group work? The relatively low cost of an application such as a shared calendar lowers its visibility in an organisation, reducing management attention to it. However, some argue that the complex social dynamics surrounding such technologies still necessitate a …", "num_citations": "126\n", "authors": ["1178"]}
{"title": "Beyond the handset: designing for wireless communications usability\n", "abstract": " Service-based wireless devices like wireless telephones require users to interact with aspects of the technology beyond the hardware and software of the handset. By entering into contractual relationships with service-providers, and by using network-based services, users interact with a larger system---one that has social and technological components. The operation of the wireless telephone requires the assimilation of heterogeneous sources of information from the device manufacturer, sales people, customer service representatives, marketing people, and members of the popular media, among others, which can easily confound users' understanding of this new class of technology. Opportunities for usability problems therefore scale beyond the handset, as do opportunities for better design. We report the results of a study of 19 novice wireless phone users who were closely tracked for the first 6 weeks after …", "num_citations": "117\n", "authors": ["1178"]}
{"title": "Success & scale in a data-producing organization: The socio-technical evolution of OpenStreetMap in response to humanitarian events\n", "abstract": " OpenStreetMap (OSM) is a volunteer-driven, globally distributed organization whose members work to create a common digital map of the world. OSM embraces ideals of open data, and to that end innovates both socially and technically to develop practices and processes for coordinated operation. This paper provides a brief history of OSM and then, through quantitative and qualitative examination of the OSM database and other sites of articulation work, examines organizational growth through the lens of two catastrophes that spurred enormous humanitarian relief responses-the 2010 Haiti Earthquake and the 2013 Typhoon Yolanda. The temporally-and geographically-constrained events scope analysis for what is a rapidly maturing, whole-planet operation. The first disaster identified how OSM could support other organizations responding to the event. However, to achieve this, OSM has had to refine …", "num_citations": "113\n", "authors": ["1178"]}
{"title": "When home base is not a place: parents’ use of mobile telephones\n", "abstract": " More attention is being paid to the development of information and communication technologies (ICTs) that are sensitive to the needs of people in their homes. By studying mobile telephony in such settings, we contribute to this discussion by examining how behaviors and characteristics of family life shape and in turn are shaped by ICTs. We present the results of a study of the primary caregivers in five families who were studied over the course of a week. We found that parents only relaxed their attachment to their mobile phones when in the presence of their children. Parents and other families perceived their phones as a means of staying connected or tethered across different kinds of situations. Ages of children and their involvement with other institutions beyond the family affected how parents oriented to their mobile phones, matching their parental shift work to those institutional schedules. Transition …", "num_citations": "83\n", "authors": ["1178"]}
{"title": "Calendars on the new frontier: Challenges of groupware technology\n", "abstract": " Groupware calendar systems--on-line, networked calendar software--illuminate difficulties in designing collaborative support technologies for effective, successful use. In the case of groupware calendars, the mundane but important practices of calendaring and scheduling create a potential dilemma for users: individuals' calendars must simultaneously support personal work and social coordination. The technology must meet a wide range of personal calendar support needs, but also employees must individually and collectively resolve serious issues about privacy and interpersonal boundary regulation. Furthermore, the role and function of the technology within the broader context of the organization impacts decisions about groupware participation and the nature of the technology's use.", "num_citations": "65\n", "authors": ["1178"]}
{"title": "Informating crisis: Expanding critical perspectives in crisis informatics\n", "abstract": " Over the past 20 years, the practices of crisis preparedness, response, and recovery have become increasingly dependent on information and communication technology (ICT) to accomplish their work. More recently, crisis informatics has developed an analysis of these phenomena from social and computational perspectives. To further to assess the consequences and opportunities of technological developments in the field, we re-interpret the concept of informating, first developed by Zuboff to describe the impacts of technological changes on the workplace during the 1980s. We draw on four contemporary examples of how ICT is changing the way we conceive of and respond to natural hazards to offer a new reading of the concept of informating in the growing field of crisis informatics. We then argue that this concept suggests the adoption of a more critical agenda for crisis informatics research to better respond to …", "num_citations": "58\n", "authors": ["1178"]}
{"title": "Infrastructure in the wild: What mapping in post-earthquake Nepal reveals about infrastructural emergence\n", "abstract": " Disasters and their impacts have unavoidable spatial characteristics. As such, maps are necessary and omnipresent features of the information landscapes that surround and support disaster response. Professional and volunteer GIS services are increasingly in demand to support map-based information visualization during crises. This paper investigates the work of mapmakers working on the response to the 2015 Nepal earthquakes. In comparison to prior events, we found significantly more collaboration and spatial data sharing took place between map producers working across humanitarian organizations and parts of the Nepal government. Collaboration between mapping practitioners was supported by a complex and emergent information infrastructure composed of social and technical elements, some of which were brought through experience with prior disaster events, and some which were shaped anew …", "num_citations": "51\n", "authors": ["1178"]}
{"title": "Visual representations of disaster\n", "abstract": " Nepal was struck by two major earthquakes in April and May 2015 which gave rise to much media attention. Because of photographs' power to influence how people perceive significant events, we investigate how these disasters are represented visually through Twitter-shared images in three ways. First, we compare how geotagged image tweets are distributed vis-à-vis the reported damage, to see if a seemingly\" objective\" method of representation stands up. Second, with an iteratively developed coding scheme, we examine how images are differently produced and shared within global versus local populations and after each earthquake, with the idea that amplification\" collectively instructs\" what features of the event are most important. Third, we analyze how images from other locations, disasters, and time periods are appropriated as part of the\" story\" of the disaster event. We found differences in image …", "num_citations": "50\n", "authors": ["1178"]}
{"title": "Citizen photojournalism during crisis events\n", "abstract": " During times of crisis, some people feel compelled to take photos to document events as they unfold. Sharing photos in such situations can be informative, news-worthy, and even therapeutic. Though it is fair to say that such activity has taken place since the invention of cameras, today's digital cameras and photo-sharing websites mean that the arena for sharing photographic-based information has expanded its reach to a remarkable extent.", "num_citations": "46\n", "authors": ["1178"]}
{"title": "Crisis information management: Communication and technologies\n", "abstract": " This book explores the management of information in crises, particularly the interconnectedness of information, people, and technologies during crises. Natural disasters, such as the Haiti earthquake and Hurricane Katrina, and 9/11 and human-made crises, such as the recent political disruption in North Africa and the Middle East, have demonstrated that there is a great need to understand how individuals, government, and non-government agencies create, access, organize, communicate, and disseminate information within communities during crisis situations. This edited book brings together papers written by researchers and practitioners from a variety of information perspectives in crisis preparedness, response and recovery. Edited by the author who coined the term crisis informatics Provides new technological insights into crisis management information Contributors are from information science, information management, applied information technology, informatics, computer science, telecommunications, and libraries", "num_citations": "43\n", "authors": ["1178"]}
{"title": "Resilience-building and the crisis informatics agenda: Lessons learned from open cities Kathmandu.\n", "abstract": " Information systems that support crisis responders and disaster risk management efforts are complex sociotechnical phenomena comprised of human capacities and relationships, data and software tools. Research in crisis informatics has highlighted the ways in which emergent groups of digital volunteers, or volunteer technical communities, have mobilized during disaster events to support information management efforts. This paper describes an action research project to support the creation of an ex ante volunteer technical community from among the potentially affected population in Kathmandu, Nepal, one of the most seismically at-risk cities in the world. In exploring this case, we argue that projects that attempt to create local open data ecosystems can be valuable but require investment in their design, execution and on-going maintenance.", "num_citations": "39\n", "authors": ["1178"]}
{"title": "Welcome to the wireless world: Problems using and understanding mobile telephony\n", "abstract": " Wireless telephony adoption is on the rise in many parts of the world (Cahners In-Stat Group, 2000), with recent technological innovations continuing to enhance the capabilities of the technology (McGinity, 1999). The market is extremely competitive. Service providers and wireless handset manufacturers, therefore, are faced with the challenge of designing wireless services and handsets to retain customers.", "num_citations": "36\n", "authors": ["1178"]}
{"title": "Corporate editors in the evolving landscape of OpenStreetMap\n", "abstract": " OpenStreetMap (OSM), the largest Volunteered Geographic Information project in the world, is characterized both by its map as well as the active community of the millions of mappers who produce it. The discourse about participation in the OSM community largely focuses on the motivations for why members contribute map data and the resulting data quality. Recently, large corporations including Apple, Microsoft, and Facebook have been hiring editors to contribute to the OSM database. In this article, we explore the influence these corporate editors are having on the map by first considering the history of corporate involvement in the community and then analyzing historical quarterly-snapshot OSM-QA-Tiles to show where and what these corporate editors are mapping. Cumulatively, millions of corporate edits have a global footprint, but corporations vary in geographic reach, edit types, and quantity. While corporations currently have a major impact on road networks, non-corporate mappers edit more buildings and points-of-interest: representing the majority of all edits, on average. Since corporate editing represents the latest stage in the evolution of corporate involvement, we raise questions about how the OSM community—and researchers—might proceed as corporate editing grows and evolves as a mechanism for expanding the map for multiple uses. View Full-Text", "num_citations": "33\n", "authors": ["1178"]}
{"title": "Coordinating time-critical work with role-tagging\n", "abstract": " A Level-1 US trauma center introduced role-tags in their trauma resuscitation rooms to help team members identify respective medical functions, and to limit the number of people in the rooms to required staff only. We use this in situ experiment with a paper prototype to investigate the role-driven nature of coordination and to identify system requirements for computerized support of role-based coordination in time-critical work. While role information is useful in coordinating time-critical work, our findings show that the current low-tech solution did not provide significant improvement in team coordination. The situations that were most in need of role-identification were the least likely to achieve it because role-tags required work by trauma team members. Similarly, because role-tags allowed workarounds and misuse, they proved ineffective in controlling the number of people in the room. We suggest technological ways …", "num_citations": "29\n", "authors": ["1178"]}
{"title": "Emerging groupware successes in major corporations: Studies of adoption and adaptation\n", "abstract": " Computer support for meeting scheduling is a focus of active research in several areas, including distributed AI and intelligent agents, software engineering, and information systems. It is also of very high applied interest: After a decade of very modest success, commercial scheduling software is taking hold in some organizational settings. However, meeting scheduling is most significant for being one of the first desktop group support applications that is widely used in some large organizations. The slow acceptance of most groupware applications raised questions about the conditions under which successful use would develop. Studies of calendar use and meeting scheduling at Sun, Microsoft, and other organizations provide clear answers to the conditions under which such use can develop. In addition, differences in the patterns of use within and across organizations provide further insight into the …", "num_citations": "29\n", "authors": ["1178"]}
{"title": "Don’t get emotional\n", "abstract": " The topic of emotion in computing is enjoying recent and growing attention. Such attention is problematic because, we argue, foregrounding emotion marks it as a subcomponent of interaction, which has the surprising consequence of reducing the importance of emotion’s function. Emotion has come into vogue in reaction to the emphasis put on work, on efficiency and productivity in human computer interaction for so long. We discuss how this dichotomy is not in itself very fruitful in changing human-computer interaction. We offer this article as a voice in an ongoing discussion about where we are heading, and which directions this discussion could take.", "num_citations": "28\n", "authors": ["1178"]}
{"title": "Expertise in the wired wild west\n", "abstract": " This ethnographic study reveals how expertise was sought, articulated and actuated across online and offline worlds to enable the evacuation of 38 horses from an isolated ranch in the mountainous region of Northern Colorado following a series of devastating flash floods in September 2013. The shared expertise within a loosely connected community of practice bridged spatial-temporal limitations and afforded opportunities for practical assistance and response, both virtually and on the ground. Interaction via social media articulated the parameters of the emergent problem to be solved, and\" cast a net\" to find the expertise necessary to address different aspects of the perceived problem. Eventually, more than 60 people with equine expertise converged onto the ranch, bringing their materials to execute a single-day evacuation and relocation of the herd.", "num_citations": "26\n", "authors": ["1178"]}
{"title": "Spatiotemporal mashups: A survey of current tools to inform next generation crisis support\n", "abstract": " Developments in information and communication technology (ICT) have adjusted the opportunities for spatial and temporal representations of data, possibly permitting the simultaneous visualization of how different regions and populations are affected during large-scale emergencies and crises. We surveyed 13 crisis-related mashups to derive some high-level design directions to guide the design and testing of next generation crisis support tools. The current web mashups offer a new way of looking at how crises are spatiotemporally ordered. However, since all technology is constrained by limitations of design choice, examining the limits and possibilities of what current design choices afford can inform attributes of what next generation crisis support tools would require.", "num_citations": "24\n", "authors": ["1178"]}
{"title": "Of coffee shops and parking lots: Considering matters of space and place in the use of public Wi-Fi\n", "abstract": " Wireless local area networks – or Wi-Fi networks – are proliferating in some societies. Our interest in this exploratory essay is to illustrate how ostensibly free, publicly-accessible Wi-Fi requires users to apply conventional understandings of space and place (particularly commercial spaces and places) as they make sense of some ambiguities about proper use in those places. We show, through an examination of the metaphorical terms used to describe Wi-Fi, how spatial notions are employed in an attempt to define ownership of the signal and rights to its use. We consider how place-behaviors require evaluation of legitimacy of users in public places and of hospitality of Wi-Fi providers. We observe that commercial interests underpin notions of ownership, legitimacy and hospitality of social actors in public places like coffee shops and parking lots. As researchers considering matters of participation in virtual …", "num_citations": "24\n", "authors": ["1178"]}
{"title": "Mobile communications: understanding users, adoption, and design\n", "abstract": " Mobile telephony adoption is on the rise, with industry projections suggesting that wireless subscribers will reach 1 billion worldwide by 2002 [3]. Recent technological innovations have also dramatically enhanced the capabilities of the wireless telephone [8]. No longer restricted to voice communications, wireless devices are now also able to transmit and manipulate data. Leveraging the power of these new technologies, various business sectors are working together to offer a wide array of services, including voice communications, short messaging, information services, web surfing, location-based services, and e-commerce. Each sector is looking for the next\" killer application,\" yet we are still learning about people's information and communication needs while\" on the go\"[9, 10, 11]. Additionally, it is difficult to anticipate what new possibilities or challenges are created for the user upon the introduction of these new …", "num_citations": "22\n", "authors": ["1178"]}
{"title": "Thin Grey Lines: Confrontations With Risk on Colorado's Front Range.\n", "abstract": " This paper reports on two years of ethnographic observation of the science and politics of flood risk in Colorado, as well as design research that examines citizen interaction with expert knowledge about flooding in the region. We argue that the 100-year floodplain standard that inform maps produced by the United States Federal Emergency Management Agency (FEMA)'s National Floodplain Insurance Program (NFIP) represent a problematic form of discursive closure of scientific understanding of flood hazard. We show that in order to meet the requirements of the NFIP, this standard acts as a closure that conveys a certainty that the underlying science does not warrant and foreshortens dialogue on disaster risk and public understanding of flood hazard. Engaging with literature in science and technology studies and human-centered computing, we investigate design opportunities for resisting closure and supporting public formation through encounters with the uncertainty and complexities of risk information.", "num_citations": "19\n", "authors": ["1178"]}
{"title": "Communicating hurricane risks: Multi-method examination of risk imagery diffusion\n", "abstract": " Conveying uncertainty in information artifacts is difficult; the challenge only grows as the demand for mass communication through multiple channels expands. In particular, as natural hazards increase with changing global conditions, including hurricanes which threaten coastal areas, we need better means of communicating uncertainty around risks that empower people to make good decisions. We examine how people share and respond to a range of visual representations of risk from authoritative sources during hurricane events. Because these images are now shared widely on social media platforms, Twitter provides the means to study them on a large scale as close to in vivo as possible. Using mixed methods, this study analyzes diffusion of and reactions to forecast and other risk imagery during the highly damaging 2017 Atlantic hurricane season to describe the collective response to visual representations …", "num_citations": "17\n", "authors": ["1178"]}
{"title": "Heritage matters in crisis informatics: How information and communication technology can support legacies of crisis events\n", "abstract": " Information and communication technologies increasingly enable the capture of experiences that result from disaster and mass emergency events. The social and cultural value of such traces, when collectively generated and shared across people and over time, can enhance or even dramatically change how we remember crises. By drawing from several disciplines concerned with digital heritage, and using investigations from three historically significant disasters, we offer an agenda for how information science and human-centered computing communities might conceptualize digital heritage as an emergent research effort in the crisis domain.", "num_citations": "15\n", "authors": ["1178"]}
{"title": "'Is the Time Right Now?' Reconciling Sociotemporal Disorder in Distributed Team Work\n", "abstract": " Temporal coordination endures as a central topic in computer-supported cooperative work (CSCW) because information systems still struggle to adequately support varying representations of time in the context of collaborations that areboth temporally and geographically dispersed. Moreover, the adaptive practices of these broadly dispersed groups are still not well understood. We ask:How do globally distributed teams temporally coordinate to accomplish their work? We examine an extreme case of online temporal coordination: high-tempo information curation about the urgent humanitarian crisis following the 2017 Hurricane Maria landfall in Puerto Rico. Our analysis of synchronous chat transcripts and data artifacts produced by The Standby Task Force reveals how this digital humanitarian group establishes temporal coordination through different shared understandings of time relative to the crisis, the globally …", "num_citations": "13\n", "authors": ["1178"]}
{"title": "Conversations in the eye of the storm: At-scale features of conversational structure in a high-tempo, high-stakes microblogging environment\n", "abstract": " This work propels social media research beyond the single post as the unit of analysis toward fuller treatment of interaction by making the construct of the conversation analytically available. We offer a method for constructing@ reply conversations in Twitter to apprehend social media conversational features at scale. We apply this method to the high-tempo, high-stakes environment of 2012's Hurricane Sandy, with its high volume of online talk by affected locals and distinct disaster-stage phasing by which to consider interactional difference. We investigate the temporality of conversations; the relationality of who speaks to whom; the number and kind of conversationalists; and how content affects temporal features. The analysis reveals that, during the height of the emergency, people expand conversations both in number and kind of conversational partners-just as their information search intensifies. This expansion …", "num_citations": "12\n", "authors": ["1178"]}
{"title": "The Polyvocality of Resilience: Discovering a Research Agenda through Interdisciplinary Investigation & Community Engagement.\n", "abstract": " This paper presents findings from an interdisciplinary research effort studying community resilience in Boulder, Colorado. Boulder is a progressive region with a history of environmental leadership. The area is currently in the process of recovering from major flooding and has launched several new initiatives related to building longterm resilience to natural disasters and other stressors. In our research, we consider the stakeholders involved in building local resilience as well as the different and often contradictory framings of the concept. This study takes a phenomenological and inductive approach to understanding resilience. In contrast to more reductionist frameworks that are frequently offered, we argue that this allows for greater understanding of the polyvocal and emergent qualities of resilience.", "num_citations": "12\n", "authors": ["1178"]}
{"title": "Constructing meaning from space, gesture and talk\n", "abstract": " Background• Establish the context of the activity.• Tell the reader enough about the setting to enable them to understand the analysis.", "num_citations": "12\n", "authors": ["1178"]}
{"title": "Groupware adoption and adaptation: studies of successful use\n", "abstract": " Groupware adoption and adaptation: studies of successful use: ACM SIGGROUP Bulletin: Vol 18, No 3 ACM Digital Library Logo ACM Logo Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search ACM SIGGROUP Bulletin Newsletter Home Latest Issue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsACM SIGGROUP BulletinVol. , No. Groupware adoption and adaptation: studies of successful use article Groupware adoption and adaptation: studies of successful use Share on Author: Leysia Palen profile image Leysia Palen View Profile Authors Info & Affiliations Publication: ACM SIGGROUP BulletinDecember 1997 https://doi.org/10.1145/270832.270845 4citation 0 Downloads Metrics Total Citations4 Total …", "num_citations": "9\n", "authors": ["1178"]}
{"title": "Safety, sensemaking, and solidarity: Mobile communication in the immediate aftermath of the July 22, 2011, Oslo bombing\n", "abstract": " On July 22, 2011, at 15: 26, a radical right-wing Islamophobe, Anders Behring Breivik, detonated a bomb in the city center of Oslo, Norway, and then killed 69 people and wounded 60 others before the police were able to arrest him on the island of Utøya. This chapter analyzes anonymized mobile phone traffic data in Oslo and around Norway to understand Norwegian mobile phone communication behaviors and see if and how people activated their social networks during this tragedy. We examine the sequencing of calls within individual users’ own strong-tie networks, as well as the geographical diffusion of calls within this network. In addition, interview data are used to further illuminate the quantitative data. Following Bruns et al.(2012), mobile phones are one of several new communication media used in today’s emergency situations that supplement traditional face-to-face, mass media, and landline phone …", "num_citations": "8\n", "authors": ["1178"]}
{"title": "Groupware adoption & adaptation\n", "abstract": " This paper describes my research on the adoption of groupware technologies in business organizations, and their subsequent integration with individual and organizational work practices as a result of wide, sustained use. An initial study of two organizations successfully using a particular group-ware technology---electronic calendars and meeting schedulers---revealed several technical, behavioral, and organizational factors that enabled initial adoption. Additional findings from this study suggested that groupware technology was integrated into work practices quite differently at each site, despite similarities in adoption patterns and other organizational features. My dissertation research will continue to elaborate the conditions that enable adoption of groupware technologies. My investigations will also explore the way electronic calendars are subsequently integrated into local work practices, and the organizational …", "num_citations": "8\n", "authors": ["1178"]}
{"title": "Research agenda in intelligent infrastructure to enhance disaster management, community resilience and public safety\n", "abstract": " Modern societies can be understood as the intersection of four interdependent systems: (1) the natural environment of geography, climate and weather; (2) the built environment of cities, engineered systems, and physical infrastructure; (3) the social environment of human populations, communities and socio-economic activities; and (4) an information ecosystem that overlays the other three domains and provides the means for understanding, interacting with, and managing the relationships between the natural, built, and human environments. As the nation and its communities become more connected, networked and technologically sophisticated, new challenges and opportunities arise that demand a rethinking of current approaches to public safety and emergency management. Addressing the current and future challenges requires an equally sophisticated program of research, technology development, and strategic planning. The design and integration of intelligent infrastructure-including embedded sensors, the Internet of Things (IoT), advanced wireless information technologies, real-time data capture and analysis, and machine-learning-based decision support-holds the potential to greatly enhance public safety, emergency management, disaster recovery, and overall community resilience, while addressing new and emerging threats to public safety and security. Ultimately, the objective of this program of research and development is to save lives, reduce risk and disaster impacts, permit efficient use of material and social resources, and protect quality of life and economic stability across entire regions.", "num_citations": "7\n", "authors": ["1178"]}
{"title": "Designs for home life\n", "abstract": " In this Special Interest Group (SIG) we intend to consider the increasingly popular area of interactive systems design for the home. Aiming to incorporate a wide range of perspectives, the SIG's participants will map out the growing number of research and development programs in the area. Particular emphasis will be given to how home life has been characterized in various programmatic visions and how the CHI community might best capitalize on these characterizations. The importance of an understanding of home life to inform design and future directions in this area will also be reflected on. This SIG is intended to appeal to a broad cross section of the CHI community, ranging from practitioners and developers to computer and social scientists.", "num_citations": "6\n", "authors": ["1178"]}
{"title": "The tools we live by: A description of personal support media in work life\n", "abstract": " This paper reports on results of an extensive, ethnographically-informed survey that queried workers in a high tech company about their uses of digital and nondigital media for managing appointments, reminders, todos, availability, and communications—activities that comprise what we call meta-work. From our approximately 1500 respondents, we found that workers spend the equivalent of one day per week working at home and a quarter of their time in meetings. They manage an array of devices each—laptops, PDAs, phones—in their daily work, many of which are personally owned. Workers also manage multiple complementary calendars to support both mobility and coordination while still depending on email for time and task management. Job function, mobility, and number of meetings affect use of tools to varying degrees.", "num_citations": "6\n", "authors": ["1178"]}
{"title": "Participatory Mapping for Disaster Preparedness: The Development & Standardization of Animal Evacuation Maps.\n", "abstract": " People who own animals are faced with complex decision making in evacuations. In the US, the Emergency Operations Center is often inundated with calls from animal owners who are aware they are under pre-or mandatory evacuation, but are unsure of what to do about evacuating their animals. Often animal evacuation is a highly improvised activity for owners and responders, though there is a now a general push toward streamlining procedures because of the high impact the matter of animals has on society’s welfare during times of emergency. This paper reports on the use of participatory design methods in a mapping project to support the range of people involved in animal evacuation during mass displacement events. The work provides insight into both procedures and standards for creating evacuation maps that communicate clearly with the public and across the range of emergency responders.", "num_citations": "5\n", "authors": ["1178"]}
{"title": "Achieving Accuracy through Ambiguity: the Interactivity of Risk Communication in Severe Weather Events\n", "abstract": " Risks associated with natural hazards such as hurricanes are increasingly communicated on social media. For hurricane risk communication, visual information products—graphics—generated by meteorologists and scientists at weather agencies portray forecasts and atmospheric conditions and are offered to parsimoniously convey predictions of severe storms. This research considers risk interactivity by examining a particular hurricane graphic which has shown in previous research to have a distinctive diffusion signature: the ‘spaghetti plot’, which contains multiple discrete lines depicting a storm’s possible path. We first analyzed a large dataset of microblog interactions around spaghetti plots between members of the public and authoritative weather sources within the US during the 2017 Atlantic hurricane season. We then conducted interviews with a sample of the weather authorities after preliminary findings …", "num_citations": "4\n", "authors": ["1178"]}
{"title": "Social media in crisis communication\n", "abstract": " The use of social media in crisis communication has developed substantially in recent years; social media have been found to play a role in natural disasters and human-made crisis events ranging from the devastating 2010/11 earthquakes in Christchurch, New Zealand, through the 2011 riots in London and the wider UK, to the 2012 hurricane Sandy on the eastern seaboard of the United States. Approaches by emergency response organisations and other stakeholders to the use of social media in crisis communication continue to vary widely, however: while some such organisations are actively exploring a variety of models for incorporating tools such as Facebook and Twitter into their overall emergency media mix, others have been taking a much more cautious approach and continue to see social media as a potential disruption and source of rumours and misinformation. At the same time, the practice of social media analysis as applied to crisis informatics is growing at an extraordinary rate across the humanities and social sciences-as well as computer science and informatics. This panel brings together a number of recognised experts in the study of social media and crisis communication in order to explore the current state of play across a range of disciplines, organisational contexts and international jurisdictions. The adoption of social media by government and other emergency response organisations is always influenced by the specific local contexts of use-including legal frameworks for public communication by emergency services, current social media demographics and rates of take-up, and the potential utility of social media tools in …", "num_citations": "3\n", "authors": ["1178"]}
{"title": "Mobile Communication in the Immediate Aftermath of the 22 July 2011 Oslo Bombing\n", "abstract": " This paper examines the mobile phone-based calling patterns in Norway’s population during the 90 minutes after the explosion of the terrorist bomb in Oslo on Friday, 22 July 2011. The data include the analysis of the calls made during this time period. It examines the propensity to contact others during times of sudden and great uncertainty, with consideration of the relationship between strong ties and weak ties in this mass emergency situation. The analysis shows that people generally made calls to their strongest tie but they were also active in calling people with whom they had weaker connections. The analysis shows that the sequencing of the calls broadly follows the order of decreasing link strength. In addition, the analysis shows how the mobile phone supports the immediate communication needs of people in the affected region as well as those in the concerned periphery. The victims of disasters are interested in receiving information direct from their loved ones as well as information provided by authorities. Emergency management should understand the high importance that people place on immediately interacting with their closest family and friends in the wake of disasters perhaps before making other decisions. In addition, we consider what it means when people mark their relationships with immediate communications during an emergency event, and how that becomes part of the “lore” of the relationships", "num_citations": "3\n", "authors": ["1178"]}
{"title": "Corporate Editors in the Evolving Landscape of OpenStreetMap: A Close Investigation of the Impact to the Map & Community\n", "abstract": " OpenStreetMap (OSM) is both a map and the active community of over a million mappers that create and maintain it. Participation in OSM has largely been studied in terms of motivation and the resulting data quality. Today, the community is comprised by many different interest groups including craft/hobby mappers, humanitarian mappers, professional mappers, and more. The last few years have seen a dramatic growth in a specific group of mappers: corporate editors. These are mappers hired by corporations and edit the map as part of their employment. In November 2018, the OSM Foundation published the​ organized editing guidelines that outline a number of steps all groups engaged in organized editing activities (including corporate data teams) should take to promote transparency, openness, and engagement with other mappers—especially local community. This work identifies ten corporations that are complying with these guidelines and explores their mapping activities. We found these corporations have cumulatively edited over 17M objects globally in the last five years, of which 9M were edited in 2018 [1]. First, we traced the history of corporate involvement in OSM to show that while this growing phenomena of corporate editing is new, it represents just the latest stage in a long history of corporations both contributing to and benefitting from OpenStreetMap. Next, we used historical quarterly-snapshot OSM-QA-Tiles to quantify where the ten corporations are active on the map and what types of edits they are performing. We find these edits are global in geographical scope, yet vary per corporation in location and edit type: Corporations …", "num_citations": "2\n", "authors": ["1178"]}
{"title": "Workshop summary: collaboration & crisis informatics (CCI'2012)\n", "abstract": " Events that include the 9/11 attacks, the 2005 Hurricane Katrina or the 2011 Sendai Earthquake have drawn attention to how individuals, organizations or societies can improve crisis preparedness, resilience and recovery. In all scenarios, collaboration between professional responders, public administrations, citizens is critical to response, and needs to be further understood and explored. In this workshop we will bring together academics from various disciplines as well as reflective practitioners to discuss challenges and approaches for improving intra-and inter-organizational collaboration in crisis situations.", "num_citations": "2\n", "authors": ["1178"]}
{"title": "Inside Text: an introduction\n", "abstract": " Mobile phones and the short-text messaging service (SMS or “text”) in particular are new social phenomena, much marvelled at and much commented upon (See Brown et al, 2002; Katz & Aakhus, 2002; Ling, 2004). This success is said to be because mobiles allow new levels of micromanagement in an age of fraught and tight deadlines (Plant, 2002), or because they allow communities to create and sustain their own language networks (Sandor, 2003: 71-81); but for some commentators, mobiles are making teenagers inarticulate (Gergen, 2003, pp227-41); they are a distraction from true engagement with people at a face to face level (Katz, 2003, pp21-33), and, along with other technologies, they are leading to a dissolution of the ‘civic’society (cf Sennet. For a sample of papers on these topics see: Nyiri, 2003).What is certain is that mobile communication, whether it be fully duplex telephony or SMS traffic, is at …", "num_citations": "2\n", "authors": ["1178"]}
{"title": "Collaborative learning\n", "abstract": " Her statement of frustration echoes the concerns of many teachers who have addressed the basic logistics of productive group work but have yet to witness a level of cognitive and metacognitive learning needed to achieve the kind of breakthrough results they hope to see. To be sure, teachers need to build students’ skill and stamina each year. These are foundational, and the necessary work of doing so should not be dismissed as something that teachers and students should already know how to do simply due to age. In truth, the difficulty students face has more to do with your expectations. After all, it’s usually not a case of their inability to work productively. Chances are very good that they have had ample experience in previous grades. Rather, it is because they don’t know how to work productively for you. Our June 2011 column,“The First 20 Days: Establishing Productive Group Work in the Classroom,” discusses this issue and proposes solutions for getting started.", "num_citations": "2\n", "authors": ["1178"]}
{"title": "Organizational Learning\n", "abstract": " -Third, people began to notice that there was no coherent plan (not surprising since much of it was a relabelling effort).-Fourth, we have tasks forces to try to coordinate Knowledge Management.• sometimes,\" knowledge management\" today seeks to continue and expand the trend of decontextualizing knowledge to a silly extent--eg,-the myth that we can simply\" capture\" the knowledge of a thirty-year expert in explicit form so we can fire the expert and hire someone with no relevant skills off the street who can now use the\" knowledge base\" to perform like an expert-the myth that in the ideal company, all knowledge will be captured worldwide and instantly fed via high band-width lines to a central place where globally optimal decisions can be made for the entire company and fed back out to the periphery for implementation", "num_citations": "2\n", "authors": ["1178"]}
{"title": "Lifelong learning and self-directed learning\n", "abstract": " Sennett explores the disorienting effects of the new capitalism. He reveals the vivid and illuminating contrast between two worlds of work: the vanished world of rigid, hierarchical organizations, where what mattered was a sense of personal character, and the brave new world of corporate re-engineering, risk, flexibility, networking, and short-term teamwork, where what matters is being able to reinvent yourself on a dime.In some ways the changes characterizing the new capitalism are positive; they make for a dynamic economy. But they can also be destructive, eroding the sense of sustained purpose, integrity of self, and trust in others that an earlier generation understood as essential to personal character. In this timely and essential essay, Sennett enables us to understand the social and political context for our contemporary confusions, and he suggests how we need to re-imagine both community and individual …", "num_citations": "2\n", "authors": ["1178"]}
{"title": "Data that matter: opportunities in crisis informatics research\n", "abstract": " In an increasingly global society and on a planet experiencing effects of climate change, large-scale emergencies both instigated by humans and arising from nature can devastate human life and our tightly-woven social fabric. With a promise of improved warning and coordination, a prevailing hope is that information and communication technology (ICT) can help reduce the impacts of large-scale disruptions, including political crises, natural disasters, pandemics, and terrorist threats. Much of the focus of development has been on the formal emergency response effort.", "num_citations": "1\n", "authors": ["1178"]}
{"title": "About time: schedules & sociotemporality\n", "abstract": " The temporal dimension is an often overlooked aspect of human interaction. The treatment and valuation of our own time and others' time is dependent on the social context. The representation of time and time intervals are socially constructed concepts, strongly influencing our behavior. Time's technologies—clocks and calendrical systems—arose from social requirements; they in turn enforce social function. In particular, the institution of the schedule—made possible by the ubiquity of clocks and calendars—has been called a \"cornerstone of social life\" (Zerubavel, 1981). This paper examines the sociotemporal order in the context of public and personal schedules, with an emphasis on time and human interaction in the workplace. Sociotemporal theory is used to explore what role an emerging time-management technology will have in the workplace: networked, on-line scheduling software.", "num_citations": "1\n", "authors": ["1178"]}