{"title": "Foundational issues in artificial intelligence and cognitive science: Impasse and solution\n", "abstract": " The book focuses on a conceptual flaw in contemporary artificial intelligence and cognitive science. Many people have discovered diverse manifestations and facets of this flaw, but the central conceptual impasse is at best only partially perceived. Its consequences, nevertheless, visit themselves as distortions and failures of multiple research projects-and make impossible the ultimate aspirations of the fields. The impasse concerns a presupposition concerning the nature of representation-that all representation has the nature of encodings: encodingism. Encodings certainly exist, but encodingism is at root logically incoherent; any programmatic research predicted on it is doomed too distortion and ultimate failure. The impasse and its consequences-and steps away from that impasse-are explored in a large number of projects and approaches. These include SOAR, CYC, PDP, situated cognition, subsumption architecture robotics, and the frame problems-a general survey of the current research in AI and Cognitive Science emerges. Interactivism, an alternative model of representation, is proposed and examined.", "num_citations": "658\n", "authors": ["1176"]}
{"title": "Beyond recommender systems: Helping people help each other\n", "abstract": " The Internet and World Wide Web have brought us into a world of endless possibilities: interactive Web sites to experience, music to listen to, conversations to participate in, and every conceivable consumer item to order. But this world also is one of endless choice: how can we select from a huge universe of items of widely varying quality? Computational recommender systems have emerged to address this issue. They enable people to share their opinions and benefit from each other’s experience. We present a framework for understanding recommender systems and survey a number of distinct approaches in terms of this framework. We also suggest two main research challenges:(1) helping people form communities of interest while respecting personal privacy, and (2) developing algorithms that combine multiple types of information to compute recommendations.", "num_citations": "462\n", "authors": ["1176"]}
{"title": "The dynamics of mass interaction\n", "abstract": " Usenet may be regarded as the world’s largest and fastest growing conversational application. In 1988 there were fewer than 500 newsgroups. Current estimates vary, but at the time of our data collection in December 1996, there were over 17,000 newsgroups, with approximately 3 million users worldwide (Harrison, 1994). This growth has been achieved without any centralized organization or governing body (King, 1997). The ubiquity of Usenet, and the fact that it supports conversations between hundreds or even thousands of participants, provides the opportunity to study what we term mass interaction. However, we currently lack basic data about Usenet interactions. The current paper analyses over 2.15 million messages produced by 659,450 people in 500 representative newsgroups collected over 6 months. We provide descriptive data about newsgroup demographics, communication strategies, and …", "num_citations": "456\n", "authors": ["1176"]}
{"title": "Creating, destroying, and restoring value in Wikipedia\n", "abstract": " Wikipedia's brilliance and curse is that any user can edit any of the encyclopedia entries. We introduce the notion of the impact of an edit, measured by the number of times the edited version is viewed. Using several datasets, including recent logs of all article views, we show that an overwhelming majority of the viewed words were written by frequent editors and that this majority is increasing. Similarly, using the same impact measure, we show that the probability of a typical article view being damaged is small but increasing, and we present empirically grounded classes of damage. Finally, we make policy recommendations for Wikipedia and other wikis in light of these findings.", "num_citations": "452\n", "authors": ["1176"]}
{"title": "“Blissfully Happy” or “Ready toFight”: Varying Interpretations of Emoji\n", "abstract": " Emoji are commonly used in modern text communication. However, as graphics with nuanced details, emoji may be open to interpretation. Emoji also render differently on different viewing platforms (eg, Apple’s iPhone vs. Google’s Nexus phone), potentially leading to communication errors. We explore whether emoji renderings or differences across platforms give rise to diverse interpretations of emoji. Through an online survey, we solicit people’s interpretations of a sample of the most popular emoji characters, each rendered for multiple platforms. Both in terms of sentiment and semantics, we analyze the variance in interpretation of the emoji, quantifying which emoji are most (and least) likely to be misinterpreted. In cases in which participants rated the same emoji rendering, they disagreed on whether the sentiment was positive, neutral, or negative 25% of the time. When considering renderings across platforms, these disagreements only increase. Overall, we find significant potential for miscommunication, both for individual emoji renderings and for different emoji renderings across platforms.", "num_citations": "382\n", "authors": ["1176"]}
{"title": "Does “authority” mean quality? Predicting expert quality ratings of Web documents\n", "abstract": " For many topics, the World Wide Web contains hundreds or thousands of relevant documents of widely varying quality. Users face a daunting challenge in identifying a small subset of documents worthy of their attention.", "num_citations": "341\n", "authors": ["1176"]}
{"title": "SuggestBot: using intelligent task routing to help people find work in wikipedia\n", "abstract": " Member-maintained communities ask their users to perform tasks the community needs. From Slashdot, to IMDb, to Wikipedia, groups with diverse interests create community-maintained artifacts of lasting value (CALV) that support the group's main purpose and provide value to others. Said communities don't help members find work to do, or do so without regard to individual preferences, such as Slashdot assigning meta-moderation randomly. Yet social science theory suggests that reducing the cost and increasing the personal value of contribution would motivate members to participate more. We present SuggestBot, software that performs intelligent task routing (matching people with tasks) in Wikipedia. SuggestBot uses broadly applicable strategies of text analysis, collaborative filtering, and hyperlink following to recommend tasks. SuggestBot's intelligent task routing increases the number of edits by roughly …", "num_citations": "336\n", "authors": ["1176"]}
{"title": "Wikipedians are born, not made: a study of power editors on Wikipedia\n", "abstract": " Open content web sites depend on users to produce information of value. Wikipedia is the largest and most well-known such site. Previous work has shown that a small fraction of editors--Wikipedians--do most of the work and produce most of the value. Other work has offered conjectures about how Wikipedians differ from other editors and how Wikipedians change over time. We quantify and test these conjectures. Our key findings include: Wikipedians' edits last longer; Wikipedians invoke community norms more often to justify their edits; on many dimensions of activity, Wikipedians start intensely, tail off a little, then maintain a relatively high level of activity over the course of their career. Finally, we show that the amount of work done by Wikipedians and non-Wikipedians differs significantly from their very first day. Our results suggest a design opportunity: customizing the initial user experience to improve retention …", "num_citations": "324\n", "authors": ["1176"]}
{"title": "Discovering personally meaningful places: An interactive clustering approach\n", "abstract": " The discovery of a person's meaningful places involves obtaining the physical locations and their labels for a person's places that matter to his daily life and routines. This problem is driven by the requirements from emerging location-aware applications, which allow a user to pose queries and obtain information in reference to places, for example, “home”, “work” or “Northwest Health Club”. It is a challenge to map from physical locations to personally meaningful places due to a lack of understanding of what constitutes the real users' personally meaningful places. Previous work has explored algorithms to discover personal places from location data. However, we know of no systematic empirical evaluations of these algorithms, leaving designers of location-aware applications in the dark about their choices. Our work remedies this situation. We extended a clustering algorithm to discover places. We also defined a set …", "num_citations": "263\n", "authors": ["1176"]}
{"title": "Think different: increasing online community participation using uniqueness and group dissimilarity\n", "abstract": " Online communities can help people form productive relationships. Unfortunately, this potential is not always fulfilled: many communities fail, and designers don't have a solid understanding of why. We know community activity begets activity. The trick, however, is to inspire participation in the first place. Social theories suggest methods to spark positive community participation. We carried out a field experiment that tested two such theories. We formed discussion communities around an existing movie recommendation web site, manipulating two factors:(1) similarity-we controlled how similar group members' movie ratings were; and (2) uniqueness-we told members how their movie ratings (with respect to a discussion topic) were unique within the group. Both factors positively influenced participation. The results offer a practical success story in applying social science theory to the design of online communities.", "num_citations": "253\n", "authors": ["1176"]}
{"title": "Discovering personal gazetteers: an interactive clustering approach\n", "abstract": " Personal gazetteers record individuals' most importantplaces, such as home, work, grocery store, etc. Using personal gazetteers in location-aware applications offers additional functionality and improves the user experience. However, systems then need some way to acquire them.", "num_citations": "243\n", "authors": ["1176"]}
{"title": "WP: clubhouse? An exploration of Wikipedia's gender imbalance\n", "abstract": " Wikipedia has rapidly become an invaluable destination for millions of information-seeking users. However, media reports suggest an important challenge: only a small fraction of Wikipedia's legion of volunteer editors are female. In the current work, we present a scientific exploration of the gender imbalance in the English Wikipedia's population of editors. We look at the nature of the imbalance itself, its effects on the quality of the encyclopedia, and several conflict-related factors that may be contributing to the gender gap. Our findings confirm the presence of a large gender gap among editors and a corresponding gender-oriented disparity in the content of Wikipedia's articles. Further, we find evidence hinting at a culture that may be resistant to female participation.", "num_citations": "231\n", "authors": ["1176"]}
{"title": "Let's stop pushing the envelope and start addressing it: a reference task agenda for HCI\n", "abstract": " We identify a problem with the process of research in the human-computer interaction (HCI) community-an overemphasis on \"radical invention\" at the price of achieving a common research focus. Without such a focus, it is difficult to build on previous work, to compare different interaction techniques objectively, and to make progress in developing theory. These problems at the research level have implications for practice, too; as researchers we often are unable to give principled design advice to builders of new systems. We propose that the HCI community try to achieve a common focus around the notion of reference tasks. We offer arguments for the advantages of this approach as well as consider potential difficulties. We explain how reference tasks have been highly effective in focusing research into information retrieval and speech recognition. We discuss what factors have to be considered in selecting HCI …", "num_citations": "207\n", "authors": ["1176"]}
{"title": "Overview of human-computer collaboration\n", "abstract": " The paper derives a set of fundamental issues from a definition of collaboration, introduces two major approaches to human-computer collaboration, and surveys each approach, showing how it formulates and addresses the issues. It concludes by proposing some themes that should characterize a unified approach to human-computer collaboration.", "num_citations": "206\n", "authors": ["1176"]}
{"title": "Because I carry my cell phone anyway: functional location-based reminder applications\n", "abstract": " Although they have potential, to date location-based information systems have not radically improved the way we interact with our surroundings. To study related issues, we developed a location-based reminder system, PlaceMail, and demonstrate its utility in supporting everyday tasks through a month-long field study. We identify current tools and practices people use to manage distributed tasks and note problems with current methods, including the common\" to-do list\". Our field study shows that PlaceMail supports useful location-based reminders and functional place-based lists. The study also sheds rich and surprising light on a new issue: when and where to deliver location-based information. The traditional'geofence'radius around a place proves insufficient. Instead, effective delivery depends on people's movement patterns through an area and the geographic layout of the space. Our results both provide a …", "num_citations": "183\n", "authors": ["1176"]}
{"title": "Constructing, organizing, and visualizing collections of topically related web resources\n", "abstract": " For many purposes, the Web page is too small a unit of interaction  and analysis. Web sites are structured multimedia documents consisting of many pages, and users often are interested in obtaining and evaluating entire collections of topically related sites.  Once such a collection is obtained, users face the challenge of exploring, comprehending and organizing the items. We report four innovations that address these user needs: (1) we replaced the Web page with the Web site as the basic unit of interaction and analysis;(2) we defined a new informationstructure, the clan graph, that groups together sets of related sites; (3) we augment the representation of a site with a site profile, information about site structure and content that helps inform  user evaluation of a site; and (4) we invented a new graph visualization, the auditorium visualization, that reveals important structural and content properties of sites within a clan …", "num_citations": "183\n", "authors": ["1176"]}
{"title": "Wireless myoelectric control apparatus and methods\n", "abstract": " Myoelectric and wireless technologies are used for the control of a portable electronic device, such as a cellular telephone or a personal digital assistant (PDA). That is, a portable electronic device has a wireless myoelectric user interface. An apparatus includes a material which forms a forearm or wrist band, myoelectric sensors attached to the band, a digital processor coupled to the myoelectric sensors, and a wireless transmitter coupled to the digital processor. The apparatus is operative to sense and detect particular hand and/or finger gestures, and to broadcast control signals corresponding to the gestures for operative control of the portable electronic device.", "num_citations": "177\n", "authors": ["1176"]}
{"title": "Integrated support for data archaeology\n", "abstract": " Corporate databases increasingly are being viewed as potentially rich sources of new and valuable knowledge. Various approaches to “discovering” or “mining” such knowledge have been proposed. Here we identify an important and previously ignored discovery task, which we call data archaeology. Data archaeology is a skilled human task, in which the knowledge sought depends on the goals of the analyst, cannot be specified in advance, and emerges only through an iterative process of data segmentation and analysis. We describe a system that supports the data archaeologist with a natural, object-oriented representation of an application domain, a powerful query language and database translation routines, and an easy-to-use and flexible user interface that supports interactive exploration. A formal knowledge representation system provides the core technology that facilitates database integration, querying …", "num_citations": "156\n", "authors": ["1176"]}
{"title": "System and method for selecting and displaying hyperlinked information resources\n", "abstract": " A set of seed resources S is received that is typically specified by a user. A set of discovered resources D is identified from a hyperlinked collection of resources C such that each resource in D is in a NK clan graph with respect to the set of seed resources S. An NK clan graph is the set of all resources that are in an N clan with at least K seeds. An N clan is a subgraph G of the hyperlinked collection of resources C such that every node in G is connected to every other node in G by a path of length N or less, and the connecting paths traverse only nodes in the subgraph G. The set of discovered resources D is added to the set of seed resources S. At least some of the resources in subgraph G are displayed to the user to convey information about resources in G as well as the relationship between these resources.", "num_citations": "153\n", "authors": ["1176"]}
{"title": "Avoiding the south side and the suburbs: The geography of mobile crowdsourcing markets\n", "abstract": " Mobile crowdsourcing markets (eg, Gigwalk and TaskRabbit) offer crowdworkers tasks situated in the physical world (eg, checking street signs, running household errands). The geographic nature of these tasks distinguishes these markets from online crowdsourcing markets and raises new, fundamental questions. We carried out a controlled study in the Chicago metropolitan area aimed at addressing two key questions:(1) What geographic factors influence whether a crowdworker will be willing to do a task?(2) What geographic factors influence how much compensation a crowdworker will demand in order to do a task? Quantitative modeling shows that travel distance to the location of the task and the socioeconomic status (SES) of the task area are important factors. Qualitative analysis enriches our modeling, with workers mentioning safety and difficulties getting to a location as key considerations. Our results …", "num_citations": "148\n", "authors": ["1176"]}
{"title": "CollaboraTV: making television viewing social again\n", "abstract": " With the advent of video-on-demand services and digital video recorders, the way in which we consume media is undergoing a fundamental change. People today are less likely to watch shows at the same time, let alone the same place. As a result, television viewing, which was once a social activity, has been reduced to a passive and isolated experience. To study this issue, we developed a system called CollaboraTV and demonstrated its ability to support the communal viewing experience through a month-long field study. Our study shows that users understand and appreciate the utility of asynchronous interaction, are enthusiastic about CollaboraTV's engaging social communication primitives and value implicit show recommendations from friends. Our results both provide a compelling demonstration of a social television system and raise new challenges for social television communication modalities.", "num_citations": "134\n", "authors": ["1176"]}
{"title": "Bioacoustic control system, method and apparatus\n", "abstract": " Bioacoustic sensors and wireless technologies are used for the control of electronic devices, such as a wireless telephones, pagers, music/media players or personal, laptops and personal digital assistant devices (PDA). Such control is implemented with certain systems, methods and apparatus which include bioacoustic sensors, a processor coupled to the bioacoustic sensors, and a transmitter coupled to the processor. The present invention is operative to detect particular hand and/or finger gestures, and to transmit control signals corresponding to the gestures for operative control of an electronic device.", "num_citations": "130\n", "authors": ["1176"]}
{"title": "ContactMap: Organizing communication in a social desktop\n", "abstract": " Modern work is a highly social process, offering many cues for people to organize communication and access information. Shared physical workplaces provide natural support for tasks such as (a) social reminding about communication commitments and keeping track of collaborators and friends, and (b) social data mining of local expertise for advice and information. However, many people now collaborate remotely using tools such as email and voicemail. Our field studies show that these tools do not provide the social cues needed for group work processes. In part, this is because the tools are organized around messages, rather than people. In response to this problem, we created ContactMap, a system that makes people the primary unit of interaction. ContactMap provides a structured social desktop representation of users' important contacts that directly supports social reminding and social data mining. We …", "num_citations": "130\n", "authors": ["1176"]}
{"title": "Living design memory: Framework, implementation, lessons learned\n", "abstract": " We identify an important type of software design knowledge that we call community-specific folklore and discuss problems with current approaches to managing it. We developed a general framework for a living design memory, built a design memory tool, and deployed the tool in a large software development organization. The tool effectively disseminates knowledge relevant to local software design practice. It is embedded in the organizational process to help ensure that its knowledge evolves as necessary. This work illustrates important lessons in building knowledge management systems, integrating novel technology into organizational practice, and carrying out research-development partnerships.", "num_citations": "129\n", "authors": ["1176"]}
{"title": "Personal telephone agent\n", "abstract": " A personal telephone messaging agent can automate routine scheduling, coordinating and information gathering tasks while maintaining the advantages inherent in the telephone system. A person specifies a message and, optionally, some specific questions, and a list of recipients to his or her personal messaging agent. The messaging agent delivers the message to and collects a response from each messaging recipient using the telephone system. When each intended recipient has been reached, the agent contacts the sender to report the results or, optionally, the agent could undertake routine tasks such as scheduling a meeting based upon the responses and assigning a conference room for the meeting.", "num_citations": "128\n", "authors": ["1176"]}
{"title": "Using intelligent task routing and contribution review to help communities build artifacts of lasting value\n", "abstract": " Many online communities are emerging that, like Wikipedia, bring people together to build community-maintained artifacts of lasting value (CALVs). Motivating people to contribute is a key problem because the quantity and quality of contributions ultimately determine a CALV's value. We pose two related research questions: 1) How does intelligent task routing---matching people with work---affect the quantity of contributions? 2) How does reviewing contributions before accepting them affect the quality of contributions? A field experiment with 197 contributors shows that simple, intelligent task routing algorithms have large effects. We also model the effect of reviewing contributions on the value of CALVs. The model predicts, and experimental data shows, that value grows more slowly with review before acceptance. It also predicts, surprisingly, that a CALV will reach the same final value whether contributions are …", "num_citations": "124\n", "authors": ["1176"]}
{"title": "Understanding emoji ambiguity in context: The role of text in emoji-related miscommunication\n", "abstract": " Recent studies have found that people interpret emoji characters inconsistently, creating significant potential for miscommunication. However, this research examined emoji in isolation, without consideration of any surrounding text. Prior work has hypothesized that examining emoji in their natural textual contexts would substantially reduce potential for miscommunication. To investigate this hypothesis, we carried out a controlled study with 2,482 participants who interpreted emoji both in isolation and in multiple textual contexts. After comparing the variability of emoji interpretation in each condition, we found that our results do not support the hypothesis in prior work: when emoji are interpreted in textual contexts, the potential for miscommunication appears to be roughly the same. We also identify directions for future research to better understand the interplay between emoji and textual context.", "num_citations": "119\n", "authors": ["1176"]}
{"title": "Using frequency-of-mention in public conversations for social filtering\n", "abstract": " We report on an investigation of using Usenet newsgroups for social filtering of Web resources. Our main empirical results are:(1) for the period of May’96 to Jul’96, about 23% of Usenet news messages mention Web resources,(2) 19% of resource mentions are recommendations(as opposed, eg, to home pages),(3) we can’automatically recognize recommendations with at least 90% accuracy, and (4) in some newsgroups, certain resources are mentioned significantly more frequently than others and thus appear to play a central role for that community. We have created a Web site that summarizes the most frequently and recently mentioned Web resources for 1400 newsgroups.", "num_citations": "115\n", "authors": ["1176"]}
{"title": "You are what you say: privacy risks of public mentions\n", "abstract": " In today's data-rich networked world, people express many aspects of their lives online. It is common to segregate different aspects in different places: you might write opinionated rants about movies in your blog under a pseudonym while participating in a forum or web site for scholarly discussion of medical ethics under your real name. However, it may be possible to link these separate identities, because the movies, journal articles, or authors you mention are from a sparse relation space whose properties (eg, many items related to by only a few users) allow re-identification. This re-identification violates people's intentions to separate aspects of their life and can have negative consequences; it also may allow other privacy violations, such as obtaining a stronger identifier like name and address. This paper examines this general problem in a specific setting: re-identification of users from a public web movie forum in …", "num_citations": "111\n", "authors": ["1176"]}
{"title": "Lurking? Cyclopaths? A quantitative lifecycle analysis of user behavior in a geowiki\n", "abstract": " Online communities produce rich behavioral datasets, eg, Usenet news conversations, Wikipedia edits, and Facebook friend networks. Analysis of such datasets yields important insights (like the\" long tail\" of user participation) and suggests novel design interventions (like targeting users with personalized opportunities and work requests). However, certain key user data typically are unavailable, specifically viewing, pre-registration, and non-logged-in activity. The absence of data makes some questions hard to answer; ac-cess to it can strengthen, extend, or cast doubt on previous results. We report on analysis of user behavior in Cyclopath, a geographic wiki and route-finder for bicyclists. With access to viewing and non-logged-in activity data, we were able to:(a) replicate and extend prior work on user lifecycles in Wikipedia,(b) bring to light some pre-registration activity, thus testing for the presence of\" educational …", "num_citations": "107\n", "authors": ["1176"]}
{"title": "Putting systems into place: a qualitative study of design requirements for location-aware community systems\n", "abstract": " We present a conceptual framework for location-aware community systems and results from two studies of howsocially-defined places influence people's information sharing and communication needs.", "num_citations": "103\n", "authors": ["1176"]}
{"title": "From “folklore” to “living design memory”\n", "abstract": " We identify an important type of software design knowledge that we call community specific folklore and show problems with current approaches to managing it. We built a tool that serves as a living design memory for a large software development organization. The tool delivers knowledge to developers effectively and is embedded in organizational practice to ensure that the knowledge it contains evolves as necessary. This work illustrates important lessons in building knowledge management systems, integrating novel technology into organizational practice, and managing research-development partnerships.", "num_citations": "101\n", "authors": ["1176"]}
{"title": "Two peers are better than one: aggregating peer reviews for computing assignments is surprisingly accurate\n", "abstract": " Scientific peer review, open source software development, wikis, and other domains use distributed review to improve quality of created content by providing feedback to the work's creator. Distributed review is used to assess or improve the quality of a work (eg, an article). However, it can also provide learning benefits to the participants in the review process. We developed an online review system for beginning computer programming students; it gathers multiple anonymous peer reviews to give students feedback on their programming work. We deployed the system in an introductory programming class and evaluated it in a controlled study. We find that: peer reviews are accurate compared to an accepted evaluation standard, that students prefer reviews from other students with less experience than themselves, and that participating in a peer review process results in better learning outcomes.", "num_citations": "100\n", "authors": ["1176"]}
{"title": "Interactive data analysis employing a knowledge base\n", "abstract": " An information retrieval system implemented as a virtual data base management system which uses a knowledge base management system to provide a problem-oriented conceptual schema for one or more standard data base management systems. In the conceptual schema, a hierarchy of concepts is used to organize individual objects. A classifier determines which concepts an individual object is a representative of and determines the relationship of new concepts to existing concepts. The use of a knowledge base with a classifier permits conversion of queries into concepts and detection of changes in the relationships between individual objects and the concepts. A window-based user interface permits flexible and experimental access to the information. Special features of the user interface permit the user to specify conversion of a query into a concept, to establish monitors to detect such changes, and to define …", "num_citations": "99\n", "authors": ["1176"]}
{"title": "People-to-people-to-geographical-places: the P3 framework for location-based community systems\n", "abstract": " In this paper we examine an emerging class of systems that link People-to-People-to-Geographical-Places; we call these P3-Systems. Through analyzing the literature, we have identified four major P3-System design techniques: People-Centered systems that use either absolute user location (e.g. Active Badge) or user proximity (e.g. Hocman) and Place-Centered systems based on either a representation of people’s use of physical spaces (e.g. ActiveMap) or on a matching virtual space that enables online interaction linked to physical location (e.g. Geonotes). In addition, each feature can be instantiated synchronously or asynchronously. The P3-System framework organizes existing systems into meaningful categories and structures the design space for an interesting new class of potentially context-aware systems. Our discussion of the framework suggests new ways of understanding and addressing the …", "num_citations": "97\n", "authors": ["1176"]}
{"title": "The sound of one hand: A wrist-mounted bio-acoustic fingertip gesture interface\n", "abstract": " Two hundred and fifty years ago the Japanese Zen master Hakuin asked the question,\" What is the Sound of the Single Hand?\" This koan has long served as an aid to meditation but it also describes our new interaction techinique. We discovered that gentle fingertip gestures such as tapping, rubbing, and flicking make quiet sounds that travel by bone conduction throughout the hand. A small wristband-mounted contact microphone can reliably and inexpensively sense these sounds. We harnessed this\" sound in the hand\" phenomenon to build a wristband-mounted bio-acoustic fingertip gesture interface. The bio-acoustic interface recognizes some common gestures that state-of-the-art glove and image-processing techniques capture but in a smaller, mobile package.", "num_citations": "96\n", "authors": ["1176"]}
{"title": "Mining personally important places from GPS tracks\n", "abstract": " The discovery of a person's personally important places involves obtaining the physical locations for a person's places that matter to his daily life and routines. This problem is driven by the requirements from emerging location-aware applications, which allow a user to pose queries awl obtain, information in reference, to places, e.g., ''home\", ''work\" or ''Northwest Health Club\". It is a challenge to map from physical locations to jxtrsonally meaningful places because GPS tracks are continuous data both spatially and temporally, while most existing data mining techniques expect discrete data. Previous work has explored algorithms to discover personal places from location data. However, they all have limitations. Our work proposes a two-step approach that discretized continuous GPS data into places and learns important places from the place features. Our approach was validated using real user data and shown to …", "num_citations": "94\n", "authors": ["1176"]}
{"title": "Interactive data analysis apparatus employing a knowledge base\n", "abstract": " An information retrieval system implemented as a virtual data base management system which uses a knowledge base management system to provide a problem-oriented conceptual schema for one or more standard data base management systems. In the conceptual schema, a hierarchy of concepts is used to organize individual objects. A classifier determines which concepts an individual object is a representative of and determines the relationship of new concepts to existing concepts. The use of a knowledge base with a classifier permits conversion of queries into concepts and detection of changes in the relationships between individual objects and the concepts. A window-based user interface permits flexible and experimental access to the information. Special features of the user interface permit the user to specify conversion of a query into a concept, to establish monitors to detect such changes, and to define …", "num_citations": "90\n", "authors": ["1176"]}
{"title": "Contact management: identifying contacts to support long-term communication\n", "abstract": " Much of our daily communication activity involves managing interpersonal communications and relationships. Despite its importance, this activity of contact management is poorly understood. We report on field and lab studies that begin to illuminate it. A field study of business professionals confirmed the importance of contact management and revealed a major difficulty: selecting important contacts from the large set of people with whom one communicates. These interviews also showed that communication history is a key resource for this task. Informants identified several history-based criteria that they considered useful. We conducted a lab study to test how well these criteria predict contact importance. Subjects identified important contacts from their email archives. We then analyzed their email to extract features for all contacts. Reciprocity, recency and longevity of email interaction proved to be strong predictors …", "num_citations": "89\n", "authors": ["1176"]}
{"title": "Graphical environment for interactively specifying a target system\n", "abstract": " Apparatus for constructing a complex artifact out of primitive artifacts and other complex artifacts. The apparatus has a permanent knowledge base of primitive artifacts, previously-made complex artifacts, and rules defining how complex artifacts are made from primitive artifacts. All artifacts in the permanent knowledge base have been checked for consistency. Artifacts from the permanent knowledge base are displayed in a search area as directed graphs in which the artifacts are represented by nodes. A user may search the permanent knowledge base, and the directed graphs in the search area show the results of the search. To construct a new complex artifact or to add to a complex artifact under construction, the user selects nodes of the directed graphs which represent desired component artifacts. Information about the desired artifacts is copied from the permanent knowledge base to a working knowledge base …", "num_citations": "84\n", "authors": ["1176"]}
{"title": "System and method for locating resources on a network using resource evaluations derived from electronic messages\n", "abstract": " Resources are located on a network by searching a database including resource evaluation information obtained from electronic messages. Electronic messages having information evaluating network resources such as files, websites, and utilities are identified. Evaluation information including the network address of the evaluated resource is stored in the database. Resource information from the resource itself is also stored. A useful and manageable number of evaluated resource titles responsive to a user request for information are presented to the user. The user can browse evaluation information and fetch the resource.", "num_citations": "83\n", "authors": ["1176"]}
{"title": "Toward a geographic understanding of the sharing economy: Systemic biases in UberX and TaskRabbit\n", "abstract": " Despite the geographically situated nature of most sharing economy tasks, little attention has been paid to the role that geography plays in the sharing economy. In this article, we help to address this gap in the literature by examining how four key principles from human geography—distance decay, structured variation in population density, mental maps, and “the Big Sort” (spatial homophily)—manifest in sharing economy platforms. We find that these principles interact with platform design decisions to create systemic biases in which the sharing economy is significantly more effective in dense, high socioeconomic status (SES) areas than in low-SES areas and the suburbs. We further show that these results are robust across two sharing economy platforms: UberX and TaskRabbit. In addition to highlighting systemic sharing economy biases, this article more fundamentally demonstrates the importance of considering …", "num_citations": "80\n", "authors": ["1176"]}
{"title": "Putting users in control of their recommendations\n", "abstract": " The essence of a recommender system is that it can recommend items personalized to the preferences of an individual user. But typically users are given no explicit control over this personalization, and are instead left guessing about how their actions affect the resulting recommendations. We hypothesize that any recommender algorithm will better fit some users' expectations than others, leaving opportunities for improvement. To address this challenge, we study a recommender that puts some control in the hands of users. Specifically, we build and evaluate a system that incorporates user-tuned popularity and recency modifiers, allowing users to express concepts like\" show more popular items\". We find that users who are given these controls evaluate the resulting recommendations much more positively. Further, we find that users diverge in their preferred settings, confirming the importance of giving control to users.", "num_citations": "78\n", "authors": ["1176"]}
{"title": "Crowd-based personalized natural language explanations for recommendations\n", "abstract": " Explanations are important for users to make decisions on whether to take recommendations. However, algorithm generated explanations can be overly simplistic and unconvincing. We believe that humans can overcome these limitations. Inspired by how people explain word-of-mouth recommendations, we designed a process, combining crowdsourcing and computation, that generates personalized natural language explanations. We modeled key topical aspects of movies, asked crowdworkers to write explanations based on quotes from online movie reviews, and personalized the explanations presented to users based on their rating history. We evaluated the explanations by surveying 220 MovieLens users, finding that compared to personalized tag-based explanations, natural language explanations: 1) contain a more appropriate amount of information, 2) earn more trust from users, and 3) make users more …", "num_citations": "77\n", "authors": ["1176"]}
{"title": "Quality is a verb: The operationalization of data quality in a citizen science community\n", "abstract": " Citizen science is becoming more valuable as a potential source of environmental data. Involving citizens in data collection has the added educational benefits of increased scientific awareness and local ownership of environmental concerns. However, a common concern among domain experts is the presumed lower quality of data submitted by volunteers. In this paper, we explore data quality assurance practices in River Watch, a community-based monitoring program in the Red River basin. We investigate how the participants in River Watch understand and prioritize data quality concerns. We found that data quality in River Watch is primarily maintained through universal adherence to standard operating procedures, but there remain areas where technological intervention may help. We also found that rigorous data quality assurance practices appear to enhance rather than hinder the educational goals of the …", "num_citations": "77\n", "authors": ["1176"]}
{"title": "Evaluating emergent collaboration on the Web\n", "abstract": " Li& between web sites can be seen as evidence of a type of emrgeti colkboration among web site authors. We report here on an empiricrd investigation into emergent co~ aboration. We developed a webcrawtig rdgorithrnand tested its performance on topics volunteered by 30 subjects. Our fidmgs includ=", "num_citations": "76\n", "authors": ["1176"]}
{"title": "The computational geowiki: What, why, and how\n", "abstract": " Google Maps and its spin-offs are highly successful, but they have a major limitation: users see only pictures of geographic data. These data are inaccessible except by limited vendor-defined APIs, and associated user data are weakly linked to them. But some applications require access, specifically geowikis and computational geowikis. We present the design and implementation of a computational geowiki. We also show empirically that both geowiki and computational geowiki features are necessary for a representative domain, bicycling, because (a) cyclists have useful knowledge unavailable except from cyclists and (b) cyclist-oriented automatic route-finding is enhanced by user input. Finally, we derive design implications: for example, user contributions presented within a route description are useful, and wikis should support contribution of opinion as well as fact.", "num_citations": "71\n", "authors": ["1176"]}
{"title": "Capturing, sharing, and using local place information\n", "abstract": " With new technology, people can share information about everyday places they go; the resulting data helps others find and evaluate places. Recent applications like Dodgeball and Sharescape repurpose everyday place information: users create local place data for personal use, and the systems display it for public use. We explore both the opportunities--new local knowledge, and concerns--privacy risks, raised by this implicit information sharing. We conduct two empirical studies: subjects create place data when using PlaceMail, a location-based reminder system, and elect whether to share it on Sharescape, a community map-building system. We contribute by:(1) showing location-based reminders yield new local knowledge about a variety of places,(2) identifying heuristics people use when deciding what place-related information to share (and their prevalence),(3) detailing how these decision heuristics can …", "num_citations": "69\n", "authors": ["1176"]}
{"title": "Experiments in social data mining: The TopicShop system\n", "abstract": " Social data mining systems enable people to share opinions and benefit from each other's experience. They do this by mining and redistributing information from computational records of social activity such as Usenet messages, system usage history, citations, or hyperlinks. Some general questions for evaluating such systems are: (1) is the extracted information valuable? and (2) do interfaces based on the information improve user task performance? We report here on TopicShop, a system that mines information from the structure and content of Web pages and provides an exploratory information workspace interface. We carried out experiments that yielded positive answers to both evaluation questions. First, a number of automatically computable features about Web sites do a good job of predicting expert quality judgments about sites. Second, compared to popular Web search interfaces, the TopicShop interface …", "num_citations": "69\n", "authors": ["1176"]}
{"title": "Value-sensitive algorithm design: Method, case study, and lessons\n", "abstract": " Most commonly used approaches to developing automated or artificially intelligent algorithmic systems are Big Data-driven and machine learning-based. However, these approaches can fail, for two notable reasons: (1) they may lack critical engagement with users and other stakeholders; (2) they rely largely on historical human judgments, which do not capture and incorporate human insights into how the world can be improved in the future. We propose and describe a novel method for the design of such algorithms, which we call Value Sensitive Algorithm Design. Value Sensitive Algorithm Design incorporates stakeholders' tacit knowledge and explicit feedback in the early stages of algorithm creation. This increases the chance to avoid biases in design choices or to compromise key stakeholder values. Generally, we believe that algorithms should be designed to balance multiple stakeholders' needs, motivations …", "num_citations": "66\n", "authors": ["1176"]}
{"title": "Specifying preferences based on user history\n", "abstract": " Many applications require users to specify preferences. We support users in this task by letting them define preferences relative to their personal history or that of other users. We implement this idea using a graphical technique called control shadows, which we have implemented on both a desktop computer and on a cell phone with a small, grayscale display. An empirical study compared user performance on the graphical interface and a text table interface with identical functionality. On the desktop, users completed their tasks more quickly and effectively and strongly preferred the graphical interface. On the cell phone, there was no significant difference between the graphical and table interfaces. Finally, personal history proved useful in specifying preferences, but history of other users was not helpful", "num_citations": "66\n", "authors": ["1176"]}
{"title": "An empirical evaluation of user interfaces for topic management of web sites\n", "abstract": " Topic management is the task of gathering, evaluating, organizing, and sharing a set of web sites for a specific topic. Current web tools do not provide adequate support for this task. We created the TopicShop system to address this need. TopicShop includes (1) a webcrawler that discovers relevant web sites and builds site profiles, and (2) user interfaces for exploring and organizing sites. We conducted an empirical study comparing user performance with TopicShop vs. YahooTM. TopicShop subjects found over 80% more high-quality sites (where quality was determined by independent expert judgements) while browsing only 8 1% as many sites and completing their task in 89% of the time. The site profile data that TopicShop provides-in particular, the number of pages on a site and the number of other sites that link to it-was the key to these results, as users exploited it to identify the most promising sites quickly …", "num_citations": "66\n", "authors": ["1176"]}
{"title": "Finding and visualizing inter-site clan graphs\n", "abstract": " For many purposes, the Web page is too small a unit of interaction. Users often want to interact with larger-scale entities, particularly collections of topically related items. We report three innovations that address this user need. l", "num_citations": "57\n", "authors": ["1176"]}
{"title": "The success and failure of quality improvement projects in peer production communities\n", "abstract": " Peer production communities have been proven to be successful at creating valuable artefacts, with Wikipedia as a prime example. However, a number of studies have shown that work in these communities tends to be of uneven quality and certain content areas receive more attention than others. In this paper, we examine the efficacy of a range of targeted strategies to increase the quality of under-attended content areas in peer production communities. Mining data from five quality improvement projects in the English Wikipedia, the largest peer production community in the world, we show that certain types of strategies (eg creating artefacts from scratch) have better quality outcomes than others (eg improving existing artefacts), even if both are done by a similar cohort of participants. We discuss the implications of our findings for Wikipedia as well as other peer production communities.", "num_citations": "56\n", "authors": ["1176"]}
{"title": "How a personalized geowiki can help bicyclists share information more effectively\n", "abstract": " The bicycling community is focused around a real-world activity--navigating a bicycle--which requires planning within a complex and ever-changing space. While all the knowledge needed to find good routes exists, it is highly distributed. We show, using the results of surveys and interviews, that cyclists need a comprehensive, up-to-date, and personalized information resource. We introduce the personalized geowiki, a new type of wiki which meets these requirements, and we formalize the notion of geowiki. Finally, we state some general prerequisites for wiki contribution and show that they are met by cyclists.", "num_citations": "56\n", "authors": ["1176"]}
{"title": "Eliciting and focusing geographic volunteer work\n", "abstract": " Open content communities such as wikis derive their value from the work done by users. However, a key challenge is to elicit work that is sufficient and focused where needed. We address this challenge in a geographic open content community, the Cyclopath bicycle route finding system. We devised two techniques to elicit and focus user work, one using familiarity to direct work opportunities and another visually highlighting them. We conducted a field experiment, finding that (a) the techniques succeeded in eliciting user work,(b) the distribution of work across users was highly unequal, and (c) user work benefitted the community (reducing the length of the average computed route by 1 kilometer).", "num_citations": "55\n", "authors": ["1176"]}
{"title": "Managing long term communications: Conversation and contact management\n", "abstract": " Contact management is an important part of everyday work. People exchange business cards to try to enter each other's contact lists. Local businesses provide refrigerator magnets and calendars so they will be called on when a particular need arises. People who use the telephone extensively are selective about who they add to their speed dial lists. Contact management and conversation management are linked. Many busy professionals discourage voice calls and messages, because E-mail enables them to better manage their time, conversations, and contacts. People also spend large amounts of time transcribing voice mail, browsing E-mail archives and writing todo lists - all of these activities are intended to help track the content and status of outstanding conversations. Together, these practices reveal some of the complexities of contact and conversation management. We investigated contact and …", "num_citations": "55\n", "authors": ["1176"]}
{"title": "What makes users rate (share, tag, edit...)? Predicting patterns of participation in online communities\n", "abstract": " Administrators of online communities face the crucial issue of understanding and developing their user communities. Will new users become committed members? What types of roles are particular individuals most likely to take on? We report on a study that investigates these questions. We administered a survey (based on standard psychological instruments) to nearly 4000 new users of the MovieLens film recommendation community from October 2009 to March 2010 and logged their usage history on MovieLens. We found that general volunteer motivations, pro-social behavioral history, and community-specific motivations predicted both the amount of use and specific types of activities users engaged in after joining the community. These findings have implications for the design and management of online communities.", "num_citations": "53\n", "authors": ["1176"]}
{"title": "An experiment in discovering personally meaningful places from location data\n", "abstract": " As mobile devices become location-aware, they offer the promise of powerful new applications. While computers work with physical locations like latitude and longitude, people think and speak in terms of places, like\" my office\" or``Sue's house''. Therefore, location-aware applications must incorporate the notion of places to achieve their full potential. This requires systems to acquire the places that are meaningful for each user. Previous work has explored algorithms to discover personal places from location data. However, we know of no empirical, quantitative evaluations of these algorithms, so the question of how well they work currently is unanswered. We report here on an experiment that begins to provide an answer; we show that a place discovery algorithm can do a good job of discovering places that are meaningful to users. The results have important implications for system design and open up interesting …", "num_citations": "53\n", "authors": ["1176"]}
{"title": "Using groups of items for preference elicitation in recommender systems\n", "abstract": " To achieve high quality initial personalization, recommender systems must provide an efficient and effective process for new users to express their preferences. We propose that this goal is best served not by the classical method where users begin by expressing preferences for individual items-this process is an inefficient way to convert a user's effort into improved personalization. Rather, we propose that new users can begin by expressing their preferences for groups of items. We test this idea by designing and evaluating an interactive process where users express preferences across groups of items that are automatically generated by clustering algorithms. We contribute a strategy for recommending items based on these preferences that is generalizable to any collaborative filtering-based system. We evaluate our process with both offline simulation methods and an online user experiment. We find that, as …", "num_citations": "52\n", "authors": ["1176"]}
{"title": "Capturing quality: retaining provenance for curated volunteer monitoring data\n", "abstract": " The\" real world\" nature of field-based citizen science involves unique data management challenges that distinguish it from projects that involve only Internet-mediated activities. In particular, many data contribution and review practices are often accomplished\" offline'via paper or general-purpose software like Excel. This can lead to integration challenges when attempting to implement project-specific ICT with full revision and provenance tracking. In this work, we explore some of the current challenges and opportunities in implementing ICT for managing volunteer monitoring data. Our two main contributions are: a general outline of the workflow tasks common to field-based data collection, and a novel data model for preserving provenance metadata that allows for ongoing data exchange between disparate technical systems and participant skill levels. We conclude with applications for other domains, such as …", "num_citations": "51\n", "authors": ["1176"]}
{"title": "Snuggle: Designing for efficient socialization and ideological critique\n", "abstract": " Wikipedia, the encyclopedia\" anyone can edit\", has become increasingly less so. Recent academic research and popular discourse illustrates the often aggressive ways newcomers are treated by veteran Wikipedians. These are complex sociotechnical issues, bound up in infrastructures based on problematic ideologies. In response, we worked with a coalition of Wikipedians to design, develop, and deploy Snuggle, a new user interface that served two critical functions: making the work of newcomer socialization more effective, and bringing visibility to instances in which Wikipedians? current practice of gatekeeping socialization breaks down. Snuggle supports positive socialization by helping mentors quickly find newcomers whose good-faith mistakes were reverted as damage. Snuggle also supports ideological critique and reflection by bringing visibility to the consequences of viewing newcomers through a lens …", "num_citations": "50\n", "authors": ["1176"]}
{"title": "Crafting the initial user experience to achieve community goals\n", "abstract": " Recommender systems try to address the\" new user problem\" by quickly and painlessly learning user preferences so that users can begin receiving recommendations as soon as possible. We take an expanded perspective on the new user experience, seeing it as an opportunity to elicit valuable contributions to the community and shape subsequent user behavior. We conducted a field experiment in MovieLens where we imposed additional work on new users: not only did they have to rate movies, they also had to enter varying numbers of tags. While requiring more work led to fewer users completing the entry process, the benefits were significant: the remaining users produced a large volume of tags initially, and continued to enter tags at a much higher rate than a control group. Further, their rating behavior was not depressed. Our results suggest that careful design of the initial user experience can lead to …", "num_citations": "50\n", "authors": ["1176"]}
{"title": "TopicShop: enhanced support for evaluating and organizing collections of Web sites\n", "abstract": " TopicShop is an interface that helps users evaluate and organize collections of web sites. The main interface components are site profiles, which contain information that helps users select high-quality items, and a work area, which offers thumbnail images, annotation, and lightweight grouping techniques to help users organize selected sites. The two components are linked to allow task integration.Previous work [2] demonstrated that subjects who used TopicShop were able to select significantly more highquality sites, in less time and with less effort. We report here on studies that confirm and extend these results. We also show that TopicShop subjects spent just half the time organizing sites, yet still created more groups and more annotations, and agreed more in how they grouped sites. Finally, TopicShop subjects tightly integrated the tasks of evaluating and organizing sites.", "num_citations": "44\n", "authors": ["1176"]}
{"title": "Helping users program their personal agents\n", "abstract": " Software agents are computer programs that act on behalf of users to perform routine, tedious, and time-consuming tasks. To be useful to an individual user, an agent must be personalized to his or her goals, habits, and preferences. We have created an end-user programming system that makes it easy for users to state rules for their agents to follow. The main advance over previous approaches is that the system automatically determines conflicts between rules and guides users in resolving the conflicts. Thus, user and system collaborate in developing and managing a set of rules that embody the user's preferences for handling a wide variety of situations.", "num_citations": "42\n", "authors": ["1176"]}
{"title": "Geographic human-computer interaction\n", "abstract": " Researchers and practitioners in human-computer interaction are increasingly taking geographic approaches to their work. Whether designing novel location-based systems, developing natural user interfaces for maps, or exploring online interactions over space and time, HCI is discovering that geographic questions, methods, and use cases are becoming integral to our field. Unfortunately, to our knowledge, there have been no direct efforts to unite members of the community exploring geographic HCI. The goal of this forum is to bring together researchers from a variety of areas to provide a summary of what has been done thus far and to discuss options for developing a more formal geographic HCI community. We will also highlight the troublesome lack of communication between scholars in geography and HCI and the opportunities that will result from increased collaboration between the two fields.", "num_citations": "41\n", "authors": ["1176"]}
{"title": "A Collaborative Interface for Editing Large Knowledge Bases.\n", "abstract": " A new generation of knowledge/databases is emerging. These systems contain thousands of objects, densely interconnected and heterogeneously organized, entered from many sources, both human and automated. Such systems present tremendous challenges to their users, who must locate relevant information quickly and add new information effectively. Our research aims to understand and support the knowledge editing task. The HITS Knowledge Editor (HKE) is an interface that supports browsing and modifying the CYC knowledge base (Guha & Lenat 1990). HKE has been designed to be a collaborative interface, following a set of principles for sharing tasks between system and user. We describe these principles and illustrate how HKE provides resources built according to those principles that collaborate with its users on a variety of knowledge editing tasks.Introduction: problems with large knowledge bases", "num_citations": "41\n", "authors": ["1176"]}
{"title": "Misalignment between supply and demand of quality content in peer production communities\n", "abstract": " In peer production communities, individual community members typically decide for themselves where to make contributions, often driven by factors such as “fun” or a belief that “information should be free”. However, the extent to which this bottom-up, interest-driven content production paradigm meets the needs of consumers of this content is unclear. In this paper, we introduce an analytical framework for studying the relationship between content production and consumption in peer production communities. Applying our framework to four large Wikipedia language editions, we find extensive misalignment between production and consumption in all of them. We also show that this misalignment has an enormous effect on Wikipedias readers. For example, over 1.5 billion monthly pageviews in the English Wikipedia go to articles that would be of much higher quality if editors optimally distributed their work to meet reader demand. Examining misalignment in more detail, we observe that there is an excess of high-quality content about certain specific topics, and that the majority of articles with insufficient quality are in a stable state (ie not breaking news). Finally, we discuss technolo-gies and community practises that can help reduce the misalignment between the supply of and demand for high-quality content in peer production communities.", "num_citations": "40\n", "authors": ["1176"]}
{"title": "Does the sharing economy do any good?\n", "abstract": " Despite the benefits offered by sharing economy, researchers have identified several challenges preventing disadvantaged groups (eg low socioeconomic status, un (der) employed and/or users from emerging regions) from receiving the same level of benefits as those from advantaged populations. This panel brings researchers from the sharing economy and mobile crowdsourcing space whose research has identified unique challenges for underserved populations. We consider the opportunities offered by these platforms to disadvantaged communities and examine to what extent these platforms instead may recreate disadvantage, as well as the workarounds communities employ to make these platforms work for them. We examine the opportunities for the CSCW community to address these challenges going forward.", "num_citations": "38\n", "authors": ["1176"]}
{"title": "Apparatus and method for defining rules for personal agents\n", "abstract": " An apparatus and method for a user to program a personal software agent using an agent manager. The agent manager receives instructions for creating a rule. The rule is placed in a hierarchical order. A determination is made as to whether the rule is valid within the hierarchical order. If the rule is not valid, repairs are suggested to make the rule valid.", "num_citations": "37\n", "authors": ["1176"]}
{"title": "Discovering personal paths from sparse gps traces\n", "abstract": " Personal paths capture “personal meaningful places”[13, 14] in temporal sequence. Knowledge of a user’s paths enables novel and useful features for location-aware applications, eg, traffic condition updates for commuting routes, carpool partner finding with similar commuting routes and schedules. Prior work has explored algorithms to discover “significant locations”[1, 2] and “transportation routes”[6, 9] from GPS data, however, we know of no algorithms specifically designed for sparse GPS traces, which represent typical location datasets collected from GPS enabled mobile devices. In this paper, we report two spatio-temporal clustering algorithms, TDJ and R-TDJ, for discovering personal paths. Specifically, the algorithms are designed to address the noisy and sparse nature of GPS data. Our experiment results show that both TDJ and R-TDJ discovered meaningful spatio-temporal clusters to form personal paths. R-TDJ demonstrates better performance on sparse GPS data.", "num_citations": "34\n", "authors": ["1176"]}
{"title": "Geographic ‘place’and ‘community information’preferences\n", "abstract": " People dynamically structure social interactions and activities at various locations in their environments in specialized types of places such as the office, home, coffee shop, museum and school. They also imbue various locations with personal meaning, creating group ‘hangouts’ and personally meaningful ‘places’. Mobile location-aware community systems can potentially utilize the existence of such ‘places’ to support the management of social information and interaction. However, acting effectively on this potential requires an understanding of how: (1) places and place-types relate to people’s desire for place-related awareness of and communication with others; and (2) what information people are willing to provide about themselves to enable place-related communication and awareness. We present here the findings from two qualitative studies, a survey of 509 individuals in New York, and a study of …", "num_citations": "31\n", "authors": ["1176"]}
{"title": "Insert movie reference here: a system to bridge conversation and item-oriented web sites\n", "abstract": " Item-oriented Web sites maintain repositories of information about things such as books, games, or products. Many of these Web sites offer discussion forums. However, these forums are often disconnected from the rich data available in the item repositories. We describe a system, movie linking, that bridges a movie recommendation Web site and a movie-oriented discussion forum. Through automatic detection and an interactive component, the system recognizes references to movies in the forum and adds recommendation data to the forums and conversation threads to movie pages. An eight week observational study shows that the system was able to identify movie references with precision of. 93 and recall of. 78. Though users reported that the feature was useful, their behavior indicates that the feature was more successful at enriching the interface than at integrating the system.", "num_citations": "31\n", "authors": ["1176"]}
{"title": "Studying the effect of similarity in online task-focused interactions\n", "abstract": " Although the Internet provides powerful tools for social interactions, many tasks-for example, information-seeking-are undertaken as solitary activities. Information seekers are unaware of the invisible crowd traveling in parallel to their course through the information landscape. Social navigation systems attempt to make the invisible crowd visible, while social recommender systems try to introduce people directly. However, it is not clear whether users desire or will respond to social cues indicating the presence of other people when they are focused on a task. To investigate this issue, we created an online game-playing task and paired subjects to perform the task based on their responses to a short survey about demographics and interests. We studied how these factors influence task outcomes, the interaction process, and attitudes towards one's partner. We found that demographic similarity affected how people …", "num_citations": "31\n", "authors": ["1176"]}
{"title": "Matching GPS traces to (possibly) incomplete map data: bridging map building and map matching\n", "abstract": " Analysis of geographic data often requires matching GPS traces to road segments. Unfortunately, map data is often incomplete, resulting in failed or incorrect matches. In this paper, we extend an HMM map-matching algorithm to handle missing blocks. We test our algorithm using map data from the Cyclopath geowiki and GPS traces from Cyclopath's mobile app. Even for conservative cutoff distances, our algorithm found a significant amount of missing data per set of GPS traces. We tested the algorithm for accuracy by removing existing blocks from our map dataset. As the cutoff distance was lowered, false negatives were decreased from 34% to 16% as false positives increased from 5% to 10%. Although the algorithm degrades with increasing amounts of missing data, our results show that our extensions have the potential to improve both map matches and map data.", "num_citations": "29\n", "authors": ["1176"]}
{"title": "Does an individual's Myers-Briggs type indicator preference influence task-oriented technology use?\n", "abstract": " Technology innovators face the challenge of finding representative groups of users to participate in design activities. In some cases, software applications will target an audience of millions, and the characteristics of the vast number of potential users are unclear to the design team. In other cases, a technology is so new that the target market of potential users is not known. The Myers-Briggs Type Indicator (MBTI) measures individual personality preferences on four dimensions and is used by psychologists to explain certain differences in human behavior. The definitions of the MBTI dimensions suggest they could be a factor explaining why individuals take different approaches to using software applications. This study explores whether MBTI preferences affect behavior when individuals perform tasks using three different software applications. We find a person’s MBTI type influences how they organize email and the …", "num_citations": "29\n", "authors": ["1176"]}
{"title": "Recommending routes in the context of bicycling: algorithms, evaluation, and the value of personalization\n", "abstract": " Users have come to rely on automated route finding services for driving, public transit, walking, and bicycling. Current state of the art route finding algorithms typically rely on objective factors like time and distance; they do not consider subjective preferences that also influence route quality. This paper addresses that need. We introduce a new framework for evaluating edge rating prediction techniques in transportation networks and use it to explore ten families of prediction algorithms in Cyclopath, a geographic wiki that provides route finding services for bicyclists. Overall, we find that personalized algorithms predict more accurately than non-personalized ones, and we identify two algorithms with low error and excellent coverage, one of which is simple enough to be implemented in thin clients like web browsers. These results suggest that routing systems can generate better routes by collecting and analyzing users' …", "num_citations": "27\n", "authors": ["1176"]}
{"title": "Talking about place: An experiment in how people describe places\n", "abstract": " How people describe places is an important issue for the design of location-aware systems. We report here on an experiment that investigated the types of descriptions people naturally produce for places, the extent to which they tailor descriptions for different audiences, and the factors they consider in deciding how to tailor their descriptions. We identified a number of common types of place descriptions and a few common factors (purpose, knows me, knows area, privacy) that influenced what description a person chose. These results show that social applications should make the audience for place descriptions clear, and that systems should allow multiple descriptions for the same place, including making it possible for users to describe their location in different ways to different people.", "num_citations": "26\n", "authors": ["1176"]}
{"title": "An interactive website to reduce sexual risk behavior: Process evaluation of TeensTalkHealth\n", "abstract": " Background: Different theoretical frameworks support the use of interactive websites to promote sexual health. Although several Web-based interventions have been developed to address sexual risk taking among young people, no evaluated interventions have attempted to foster behavior change through moderated interaction among a virtual network of adolescents (who remain anonymous to one another) and health professionals.Objective: The objective was to conduct a summative process evaluation of TeensTalkHealth, an interactive sexual health website designed to promote condom use and other healthy decision making in the context of romantic and sexual relationships.Methods: Evaluation data were obtained from 147 adolescents who participated in a feasibility and acceptability study. Video vignettes, teen-friendly articles, and other content served as conversation catalysts between adolescents and health educators on message boards.Results: Adolescents’ perceptions that the website encouraged condom use across a variety of relationship situations were very high. Almost 60%(54/92, 59%) of intervention participants completed two-thirds or more of requested tasks across the 4-month intervention. Adolescents reported high levels of comfort, perceived privacy, ease of website access and use, and perceived credibility of health educators. Potential strategies to enhance engagement and completion of intervention tasks during future implementations of TeensTalkHealth are discussed, including tailoring of content, periodic website chats with health educators and anonymous peers, and greater incorporation of features from …", "num_citations": "25\n", "authors": ["1176"]}
{"title": "\" How should I go from _ to _ without getting killed?\" motivation and benefits in open collaboration\n", "abstract": " Many people rely on open collaboration projects to run their computer (Linux), browse the web (Mozilla Firefox), and get information (Wikipedia). While these projects are successful, many such efforts suffer from lack of participation. Understanding what motivates users to participate and the benefits they perceive from their participation can help address this problem. We examined these issues through a survey of contributors and information consumers in the Cyclopath geographic wiki. We analyzed subject responses to identify a number of key motives and perceived benefits. Based on these results, we articulate several general techniques to encourage more and new forms of participation in open collaboration communities. Some of these techniques have the potential to engage information consumers more deeply and productively in the life of open collaboration communities.", "num_citations": "23\n", "authors": ["1176"]}
{"title": "Keeping community in the loop: Understanding wikipedia stakeholder values for machine learning-based systems\n", "abstract": " On Wikipedia, sophisticated algorithmic tools are used to assess the quality of edits and take corrective actions. However, algorithms can fail to solve the problems they were designed for if they conflict with the values of communities who use them. In this study, we take a Value-Sensitive Algorithm Design approach to understanding a community-created and-maintained machine learning-based algorithm called the Objective Revision Evaluation System (ORES)---a quality prediction system used in numerous Wikipedia applications and contexts. Five major values converged across stakeholder groups that ORES (and its dependent applications) should:(1) reduce the effort of community maintenance,(2) maintain human judgement as the final authority,(3) support differing peoples' differing workflows,(4) encourage positive engagement with diverse editor groups, and (5) establish trustworthiness of people and …", "num_citations": "22\n", "authors": ["1176"]}
{"title": "Measuring the impact of personalization and recommendation on user behaviour\n", "abstract": " In recent years, several methods for generating and presenting personalized information have been developed. They are aimed at taming the information overload caused by the vast range of continuously growing content available on the World Wide Web. Examples include adaptive hypertext, which adapts the user interface to the users interests and needs (eg, in mobile portals), and recommender systems that try to predict what items, eg, news, movies or travels, are relevant for the user. Recommender systems use various AI and IR techniques to build their predictions, and they typically interact with the user for presenting and revising their recommendations. Many of these techniques and systems have made their way from research into commercial applications and are now widely used in major eCommerce portals. At the same time, new techniques are being proposed, for improving the recommendation effectiveness or for offering new ways for users to participate, as in social networks on Web 2.0 platforms. The assessment of the benefits, for the end users and the service providers, brought by the scientific and technological development of the personalization techniques is obviously an important issue. In fact, choosing the right evaluation method for personalized web applications, identifying the influential success factors behind different techniques or interpreting results coming from online experiments remain largely open research issues. Off-line experiments, which estimate the recommendation prediction error using an existing dataset of recommendations (as described in the seminal article of Herlocker et al.[1]), is the traditional state-of …", "num_citations": "21\n", "authors": ["1176"]}
{"title": "\" I LOVE THIS SITE!\" vs.\" It's a little girly\" Perceptions of and Initial User Experience with Pinterest\n", "abstract": " Pinterest is a popular social networking site that lets people discover, collect, and share pictures of items from the Web. Among popular social media sites, Pinterest has by far the most skewed gender distribution: women are four times more likely than men to use it. To better understand this, we examined two factors that generally affect whether people try a social site and whether they continue using it: the external perception of a site (eg, as conveyed in popular media) and the site's initial user experience. For the latter, we focused on the role of social bootstrapping, importing contacts from one social site to another. We conducted a survey study, finding that: perceptions of Pinterest among users and non-users of the site differed significantly; trying Pinterest led to substantial changes in user perceptions of the site; social bootstrapping affected users' initial impression of Pinterest, generally improving it for women and …", "num_citations": "19\n", "authors": ["1176"]}
{"title": "Intelligent systems as cooperative systems\n", "abstract": " ObjectiveThe Journal of Intelligent Systems provides readers with a compilation of stimulating and up-to-date articles within the field of intelligent systems. The focus of the journal is on high quality research that addresses paradigms, development, applications and implications in the field of intelligent systems. The Journal of Intelligent Systems is a peer reviewed journal. Special issues can be arranged by contacting the Editor.", "num_citations": "19\n", "authors": ["1176"]}
{"title": "Intelligent assistance through collaborative manipulation\n", "abstract": " This paper introduces, motivates, and illustrates an approach to the construction of intelligent assistance systems that we call collaborative manipulation. We show how a system can offer effective assistance through collaborative manipulation of objects in a shared workspace. We have developed this approach through experience with an intelligent knowledge editing tool, the HITS Knowledge Editor. We illustrate its effectiveness using scenarios taken from a user study.", "num_citations": "19\n", "authors": ["1176"]}
{"title": "Bot detection in Wikidata using behavioral and other informal cues\n", "abstract": " Bots have been important to peer production's success. Wikipedia, OpenStreetMap, and Wikidata all have taken advantage of automation to perform work at a rate and scale exceeding that of human contributors. Understanding the ways in which humans and bots behave in these communities is an important topic, and one that relies on accurate bot recognition. Yet, in many cases, bot activities are not explicitly flagged and could be mistaken for human contributions. We develop a machine classifier to detect previously unidentified bots using implicit behavioral and other informal editing characteristics. We show that this method yields a high level of fitness under both formal evaluation (PR-AUC: 0.845, ROC-AUC: 0.985) and a qualitative analysis of \"anonymous\" contributor edit sessions. We also show that, in some cases, unflagged bot activities can significantly misrepresent human behavior in analyses. Our model …", "num_citations": "18\n", "authors": ["1176"]}
{"title": "Wiki grows up: arbitrary data models, access control, and beyond\n", "abstract": " Ward Cunningham's vision for the wiki was that it would be\" the simplest online database that could possibly work\". We consider here a common manifestation of simplicity: the assumption that the objects in a wiki that can be edited (eg, Wikipedia articles) are relatively independent. As wiki applications in new domains emerge, however, this assumption is no longer tenable. In wikis where the objects of interest are highly interdependent (eg, geographic wikis), fundamental concepts like the revision and undoing must be refined. This is particularly so when fine-grained access control is required (as in enterprise wikis or wikis to support collaboration between citizens and government officials). We explore these issues in the context of the Cyclopath geowiki and present solutions that we have designed and have implemented or are implementing.", "num_citations": "18\n", "authors": ["1176"]}
{"title": "Task specialization in social production communities: The case of geographic volunteer work\n", "abstract": " In social production communities, users' individual and collective efforts lead to the creation of valuable resources—cf. Wikipedia, Open Street Map, and Reddit. Contributors to such communities often specialize in the tasks they choose to do. We found evidence for specialization by work type in Cyclopath, a geographic wiki for bicyclists--most users edit a single type of map feature, such as points of interest or roads and trails. We also saw a user lifecycle effect: as users gain experience, they specialize in editing roads and trails. Our findings suggest more effective ways to organize social production interfaces, compose units of work, and match them to users who want to help.", "num_citations": "18\n", "authors": ["1176"]}
{"title": "Keeping designers in the loop: Communicating inherent algorithmic trade-offs across multiple objectives\n", "abstract": " Artificial intelligence algorithms have been used to enhance a wide variety of products and services, including assisting human decision making in high-stake contexts. However, these algorithms are complex and have trade-offs, notably between prediction accuracy and fairness to population subgroups. This makes it hard for designers to understand algorithms and design products or services in a way that respects users' goals, values, and needs. We proposed a method to help designers and users explore algorithms, visualize their trade-offs, and select algorithms with trade-offs consistent with their goals and needs. We evaluated our method on the problem of predicting criminal defendants' likelihood to re-offend through (i) a large-scale Amazon Mechanical Turk experiment, and (ii) in-depth interviews with domain experts. Our evaluations show that our method can help designers and users of these systems …", "num_citations": "17\n", "authors": ["1176"]}
{"title": "How do people’s concepts of place relate to physical locations?\n", "abstract": " Advances in GPS and wireless networking technologies have enabled a new class of location-aware applications, including location tracking [10,2], location-enhanced messaging [3,9], location-based gaming(www.botfighters.com), and navigation aids for the visually impaired [12]. However, these applications typically represent places quite simply, as a geographical point or a point plus radius. We conducted an experiment that showed that this simple representation is not expressive enough to represent the full range of people’s everyday places. We also present a set of more complicated physical shapes that our subjects found sufficient to cover their places. These results identify representational requirements for location-aware systems, have implications for systems that aim to acquire place representations, suggest enhanced applications, and open up interesting avenues for future research.", "num_citations": "17\n", "authors": ["1176"]}
{"title": "What i see is what you don't get: The effects of (not) seeing emoji rendering differences across platforms\n", "abstract": " Emoji are popular in digital communication, but they are rendered differently on different viewing platforms (e.g., iOS, Android). It is unknown how many people are aware that emoji have multiple renderings, or whether they would change their emoji-bearing messages if they could see how these messages render on recipients' devices. We developed software to expose the multi-rendering nature of emoji and explored whether this increased visibility would affect how people communicate with emoji. Through a survey of 710 Twitter users who recently posted an emoji-bearing tweet, we found that at least 25% of respondents were unaware that the emoji they posted could appear differently to their followers. Additionally, after being shown how one of their tweets rendered across platforms, 20% of respondents reported that they would have edited or not sent the tweet. These statistics reflect millions of potentially …", "num_citations": "16\n", "authors": ["1176"]}
{"title": "Evaluating compliance-without-pressure techniques for increasing participation in online communities\n", "abstract": " Social psychology offers several theories of potential use for designing techniques to increase user contributions to online communities. Some of these techniques follow the\" compliance without pressure\" approach, where users are led to comply with a request without being subjected to any obvious external pressure. We evaluated two such techniques--foot-in-the-door and low-ball--in the context of Cyclopath, a geographic wiki. We found that while both techniques succeeded, low-ball elicited more work than foot-in-the-door. We discuss design and research implications of applying these (and other such techniques) in online communities.", "num_citations": "16\n", "authors": ["1176"]}
{"title": "Bioacoustic control system, method and apparatus\n", "abstract": " Bioacoustic sensors and wireless technologies are used for the control of electronic devices, such as wireless telephones, pagers, music/media players or personal laptops and personal digital assistant (PDA) devices. Such control is implemented with certain systems, methods and apparatus which include bioacoustic sensors, a processor coupled to the bioacoustic sensors, and a transmitter coupled to the processor. The present invention is operative to detect particular hand and/or finger gestures, and to transmit control signals corresponding to the gestures for operative control of an electronic device.", "num_citations": "15\n", "authors": ["1176"]}
{"title": "In case you missed it: benefits of attendee-shared annotations for non-attendees of remote meetings\n", "abstract": " Corporate meetings are increasingly being held remotely using web technologies. With such remote meetings being recorded and made available after the fact, there is a pressing need for tools to access and utilize these recordings efficiently. Our work explores the utility of using annotations generated by meeting attendees to meet this need. We conducted a controlled lab study to evaluate the benefits of sharing annotations. Attendee-created annotations were shared with non-attendees to assist them on typical information retrieval tasks. Results indicate that (a) non-attendees given access to shared annotations performed about as well as attendees provided with their own and shared annotations,(b) non-attendees were more confident in their responses when they used shared annotations as access cues into the recording than when they directly skimmed the video, and (c) attendees utilized shared annotations …", "num_citations": "15\n", "authors": ["1176"]}
{"title": "Freedom versus standardization: structured data generation in a peer production community\n", "abstract": " In addition to encyclopedia articles and software, peer production communities produce structured data, eg, Wikidata and OpenStreetMap's metadata. Structured data from peer production communities has become increasingly important due to its use by computational applications, such as CartoCSS, MapBox, and Wikipedia infoboxes. However, this structured data is usable by applications only if it follows standards. We did an interview study focused on OpenStreetMap's knowledge production processes to investigate how--and how successfully--this community creates and applies its data standards. Our study revealed a fundamental tension between the need to produce structured data in a standardized way and OpenStreetMap's tradition of contributor freedom. We extracted six themes that manifested this tension and three overarching concepts, correctness, community, and code, which help make sense of and …", "num_citations": "14\n", "authors": ["1176"]}
{"title": "Predicting member productivity and withdrawal from pre-joining attachments in online production groups\n", "abstract": " Productive and dedicated members are critical to the success of online production communities like Wikipedia. Many communities organize in subgroups where members voluntarily work on projects of shared interest. In this paper, we investigate how members' pre-joining connections with the subgroup predict their productivity and withdrawal after joining. Drawing insights from attachment theories in social psychology, we examine two types of pre-joining connections: textit {identity-based} attachment (how much members' interests were aligned with the subgroup's topics) and textit {bonds-based} attachment (how much members had interacted with other members of the subgroup). Analyses of 79,704 editors in 1,341 WikiProjects show that 1) both identity-based and bonds-based attachment increased editors' post-joining productivity and reduced their likelihood of withdrawal; 2) identity-based attachment had a …", "num_citations": "14\n", "authors": ["1176"]}
{"title": "Bridging qualitative and quantitative methods for user modeling: Tracing cancer patient behavior in an online health community\n", "abstract": " Researchers construct models of social media users to understand human behavior and deliver improved digital services. Such models use conceptual categories arranged in a taxonomy to classify unstructured user text data. In many contexts, useful taxonomies can be defined via the incorporation of qualitative findings, a mixed-methods approach that offers the ability to create qualitatively-informed user models. But operationalizing taxonomies from the themes described in qualitative work is non-trivial and has received little explicit focus. We propose a process and explore challenges bridging qualitative themes to user models, for both operationalization of themes to taxonomies and the use of these taxonomies in constructing classification models. For classification of new data, we compare common keyword-based approaches to machine learning models. We demonstrate our process through an example in the health domain, constructing two user models tracing cancer patient experience over time in an online health community. We identify patterns in the model outputs for describing the longitudinal experience of cancer patients and reflect on the use of this process in future research.", "num_citations": "13\n", "authors": ["1176"]}
{"title": "Geographic Biases are'Born, not Made' Exploring Contributors' Spatiotemporal Behavior in OpenStreetMap\n", "abstract": " The evolution of contributor behavior in peer production communities over time has been a subject of substantial interest in the social computing community. In this paper, we extend this literature to the geographic domain, exploring contribution behavior in OpenStreetMap using a spatiotemporal lens. In doing so, we observe a geographic version of a'born, not made'phenomenon: throughout their lifespans, contributors are relatively consistent in the places and types of places that they edit. We show how these'born, not made'trends may help explain the urban and socioeconomic coverage biases that have been observed in OpenStreetMap. We also discuss how our findings can help point towards solutions to these biases.", "num_citations": "13\n", "authors": ["1176"]}
{"title": "War versus inspirational in forrest gump: Cultural effects in tagging communities\n", "abstract": " People from different cultures vary in cognition, emotion, and behavior. We explore cultural differences in a tagging system. We developed a model of cultural differences and performed a controlled empirical study with American and Chinese subjects to investigate questions that arise from the model. American and Chinese subjects differed in many ways: the number and types of tags they applied; the extent to which they applied suggested tags or entered new tags of their own; and how often they applied tags that originated from a different culture. Our results are consistent with theories of cultural differences between Asian and Western cultures. Our findings suggest new opportunities and mechanisms for shaping user behavior to produce useful tag repositories.", "num_citations": "13\n", "authors": ["1176"]}
{"title": "Managing design knowledge to provide assistance to large-scale software development\n", "abstract": " The problem is examined of managing design knowledge as a crucial component in a large-scale software development project. The authors explore this design knowledge problem in more detail, describe both technical and nontechnical challenges, discuss the maintenance of such knowledge, and briefly explore the issue of acquisition. A framework is described for providing knowledge-based assistance to software developers. This framework is integrated with and extends an existing design process and exploits that process to address the problem of knowledge maintenance. Then, an implemented design knowledge tool is presented instantiating the framework that gives software developers access to knowledge about a particular error handling mechanism. The organization of the knowledge, the design of the interface, and the status of the implementation are discussed.<>", "num_citations": "13\n", "authors": ["1176"]}
{"title": "Geowiki+ route analysis= improved transportation planning\n", "abstract": " This poster describes the design of a novel route analysis tool based on a community-driven, geographic wiki to assist transportation planners to make better decisions. We highlight the advantages of our tool over other, similar ones---gained due to the use of a wiki-based platform---through a real-life usage scenario.", "num_citations": "12\n", "authors": ["1176"]}
{"title": "An investigation of contents and use of the home wardrobe\n", "abstract": " The home wardrobe is a complex and variable system, interacted with daily by its user/manager in a time-and resource-constrained decision-making process. Ubiquitous computing technology offers advantages in augmenting the decision-making process, and the potential to simultaneously encourage sustainable behaviors. In this study we present an empirical analysis of the contents of 11 home wardrobes and 3-6 months of daily dressing decisions for 5 users. We find that an average of only 7% of our female participants' wardrobes and 47% of our male participants' wardrobes are in regular use. In addition, we present an analysis of wardrobe contents, outfit composition, and garment utility in the wardrobe.", "num_citations": "12\n", "authors": ["1176"]}
{"title": "Using groups of items to bootstrap new users in recommender systems\n", "abstract": " To achieve high quality initial personalization, recommender systems must provide an efficient and effective process for new users to express their preferences. We propose that this goal is best served not by the classical method where users begin by expressing preferences for individual items-this process is an inefficient way to convert a user's effort into improved personalization. Rather, we propose that new users can begin by expressing their preferences for groups of items. We test this idea by designing and evaluating an interactive process where users express preferences across groups of items that are automatically generated by clustering algorithms. We contribute a strategy for recommending items based on these preferences that is generalizable to any collaborative filtering-based system. We evaluate our process with both offline simulation methods and an online user experiment. We find that, as compared with a baseline rate-15-items interface,(a) users are able to complete the preference elicitation process in less than half the time, and (b) users are more satisfied with the resulting recommended items. Our evaluation reveals several advantages and other trade-offs involved in moving from item-based preference elicitation to group-based preference elicitation.", "num_citations": "11\n", "authors": ["1176"]}
{"title": "Involving remote users in continuous design of web content\n", "abstract": " ABSTRACT PHOAKS is a system that automatically recognizes URLS recommended in Usenet messages and continuously updates a large web site that summarizes the recommendation data. We view the automatically generated pages as “rough drafts” that users help to refine. We report here on the mechanisms that allow users to do this, our rationale for these mechanisms, and the issues raised by involving thousands of remote anonymous users in the continuous design of web content.Keywords human-computer interaction, human interface, computersupported cooperative work, organizational computing, social filtering, collaborative filtering, resource discovery, World Wide Web, Usenet, participatory design, remote evrduation, end user modification. INTRODUCTION The main goal of participatory design [13] is to involve users in the process of system design. It focuses on a specific common design process …", "num_citations": "11\n", "authors": ["1176"]}
{"title": "Encouraging online engagement: The role of interdependent self-construal and social motives in fostering online participation\n", "abstract": " Developing and maintaining a user base that actively contributes to an online community is often essential to a website's success. For many online communities, developing such a user-base can be challenge for web designers. Working from a functionalist perceptive, two studies explored how the individual difference of interdependent self-construal was related to participation and engagement in the online community MovieLens.org. In the first study, we found that those individuals high in interdependent self-construal were particularly unlikely to contribute to the website. In an attempt to increase the online engagement of this type of user, we then created an interactive web feature that tapped into the social motives of those high in interdependent self-construal. This feature allows users to create Top Five movie lists that can be shared with other users. In the second study, we found that interdependent self …", "num_citations": "10\n", "authors": ["1176"]}
{"title": "CrowdLens: experimenting with crowd-powered recommendation and explanation\n", "abstract": " Recommender systems face several challenges, eg, recommending novel and diverse items and generating helpful explanations. Where algorithms struggle, people may excel. We therefore designed CrowdLens to explore different workflows for incorporating people into the recommendation process. We did an online experiment, finding that: compared to a state-of-the-art algorithm, crowdsourcing workflows produced more diverse and novel recommendations favored by human judges; some crowdworkers produced high-quality explanations for their recommendations, and we created an accurate model for identifying high-quality explanations; volunteers from an online community generally performed better than paid crowdworkers, but appropriate algorithmic support erased this gap. We conclude by reflecting on lessons of our work for those considering a crowdsourcing approach and identifying several fundamental issues for future work.", "num_citations": "10\n", "authors": ["1176"]}
{"title": "Apparatus and methods for providing design advice\n", "abstract": " A knowledge-based artificial intelligence system which provides design advice. The artificial intelligence system includes a knowledge base of design information. Users of the system indicate an area about which they require design advice. The system provides the relevant advice. Included in the advice is an indication of the\" owner\" of the advice. The advice and the relationship between the design made by the user are part of a trace of the users' session with the system. The trace becomes part of a design document for the design. When the design is reviewed, the trace is reviewed as well. The system includes an interface for updating the knowledge base, and if the design review indicates a need to correct the knowledge base, the corrections are made using the interface for updating. A preferred embodiment of the system is used to provide advice to designers of a large software system concerning the use of an …", "num_citations": "10\n", "authors": ["1176"]}
{"title": "Intelligent assistance for software construction: a case study\n", "abstract": " An important type of software design task involves constructing software artifacts from existing components. Major user tasks are locating relevant components, reusing existing artifacts, and ensuring that the artifact is complete and consistent. We developed a prototype knowledge-based graphical system that supports these tasks. It delivers information to users by adding and deleting graphical objects and changing their appearance. The system was developed in cooperation with an AT&T product organization. They created a production version of the tool for assembling sets of telecommunications features for customers. The tool lets users work at a high level and eases problems with locating relevant features, reusing feature lists, and maintaining consistency.< >", "num_citations": "10\n", "authors": ["1176"]}
{"title": "Person-computer cooperation through collaborative manipulation.\n", "abstract": " Degree: Ph. D.DegreeYear: 1991Institute: The University of Texas at AustinThe primary contribution of this research is to state, motivate, and evaluate an approach to the design of cooperative computer systems. The approach has been embodied in a knowledge editing tool, the HITS Knowledge Editor (HKE). Empirical testing of HKE has shown the effectiveness of the approach.", "num_citations": "10\n", "authors": ["1176"]}
{"title": "Never too old, cold or dry to watch the sky: A survival analysis of citizen science volunteerism\n", "abstract": " CoCoRaHS is a multinational citizen science project for observing precipitation. Like many citizen science projects, volunteer retention is a key measure of engagement and data quality. Through survival analysis, we found that participant age (self-reported at account creation) is a significant predictor of retention. Compared to all other age groups, participants aged 60-70 are much more likely to sign up for CoCoRaHS, and to remain active for several years. We also measured the influence of task difficulty and the relative frequency of rain, finding small but statistically significant and counterintuitive effects. Finally, we confirmed previous work showing that participation levels within the first month are highly predictive of eventual retention. We conclude with implications for observational citizen science projects and crowdsourcing research in general.", "num_citations": "9\n", "authors": ["1176"]}
{"title": "Knowledge management tools for business process support and reengineering\n", "abstract": " Reengineering organizational processes is an imperative in today's business climate, and technology can play an important role in understanding, managing and reengineering business processes. In particular, what we call ‘knowledge management tools’ can be used to streamline process descriptions and deliver organizational knowledge in a timely and appropriate manner. These tools can also facilitate process reengineering by structuring previously informal work artifacts, enabling artifact reuse and promoting more effective organizational collaboration. This paper discusses two research and development collaborations that resulted in deployed knowledge management tools for a large business unit of AT&T, and discusses the importance of managing expectations, the need for existing process maturity, and the issue of knowledge maintenance in technology‐driven business process reengineering.", "num_citations": "9\n", "authors": ["1176"]}
{"title": "A tool for achieving consensus in knowledge representation\n", "abstract": " We develop the notion that knowledge editing is a cooperative activity that requires knowledge editors to reach consensus as they represent information in a knowledge base. We describe an intelligent knowledge editing tool, the HITS Knowledge Editor, and illustrate how it assists knowledge editors in reaching consensus.", "num_citations": "9\n", "authors": ["1176"]}
{"title": "bumpy, caution with merging: An exploration of tagging in a geowiki\n", "abstract": " We introduced tags into the Cyclopath geographic wiki for bicyclists. To promote the creation of useful tags, we made tags wiki objects, giving ownership of tag applications to the community, not to individuals. We also introduced a novel interface that lets users fine-tune their routing preferences with tags. We analyzed the Cyclopath tagging vocabulary, the relationship of tags to existing annotation techniques (notes and ratings), and the roles users take on with respect to tagging, notes, and ratings. Our findings are: two distinct tagging vocabularies have emerged, one around each of the two main types of geographic objects in Cyclopath; tags and notes have overlapping content but serve distinct purposes; users employ both ratings and tags to express their route-finding preferences, and use of the two techniques is moderately correlated; and users are highly specialized in their use of tags and notes. These …", "num_citations": "8\n", "authors": ["1176"]}
{"title": "Distance and attraction: Gravity models for geographic content production\n", "abstract": " Volunteered Geographic Information (VGI), such as contributions to OpenStreetMap and geotagged Wikipedia articles, is often assumed to be produced locally. However, recent work has found that peer-produced VGI is frequently contributed by non-locals. We evaluate this approach across hundreds of content types from Wikipedia, OpenStreetMap, and eBird, and show that these models can describe more than 90% of\" VGI flows\" for some content types. Our findings advance geographic HCI theory, suggesting some spatial mechanisms underpinning VGI production. We also discuss design implications that can help (a) human and algorithmic consumers of VGI evaluate the perspectives it contains and (b) address geographic coverage variations in these platforms (eg via more effective volunteer recruitment strategies).", "num_citations": "7\n", "authors": ["1176"]}
{"title": "Leveraging the contributory potential of user feedback\n", "abstract": " Under contribution is an important problem in online social production communities: important tasks don't get done, and only a small minority of participants are active contributors. How can we remedy this situation? We explore the feasibility of using the act of consuming information as a gateway to contributing information; specifically, we investigate semi-automated means to extract useful information from standard types of user feedback. We explore this approach in the context of a geographic wiki and route-planning system for bicyclists. We analyzed naturally occurring textual route feedback, finding that the feedback was rich in information such as bikeability ratings, tags and notes that are useful to improve the system's route finding and navigational assistance capabilities. We also present a technique to extract such information by engaging users in dialogue immediately after they obtain a route. We believe that …", "num_citations": "7\n", "authors": ["1176"]}
{"title": "Speech and non-speech audio: Navigational information and cognitive load\n", "abstract": " Cell phones and other mobile devices let people receive information anywhere, anytime. Navigation information – directions and distance to a destination, interesting nearby locations, etc. – is especially promising. However, there are challenges to delivering information on a cell phone, particularly with a GUI. GUIs aren't ideal when a person's visual attention is elsewhere, e.g., scanning for landmarks, assessing safety, etc. And they don't work at all for blind people, who particularly need navigation assistance. Our work responds to this challenge. We investigate the use of two non-visual techniques for delivering navigation information, speech and sonification [[3], . We conducted an experiment to compare user performance with and preference for the two techniques, in both single task (navigate to a target) and dual task (navigate to a target and respond to an auditory stimulus) conditions. Users performed better with and preferred sonification in both conditions. We discuss the implications of these results for the design of navigation aids.", "num_citations": "7\n", "authors": ["1176"]}
{"title": "Collaborative filtering to locate, comprehend, and organize collections of Web sites\n", "abstract": " Finding information is a common and fundamental task for Internet users. Search engines such as AltaVista and indices such as Yahoo! are the tools commonly used for this task. Users type in queries using keywords to indicate their interest or navigate through hierarchical directories of topics, eventually obtaining (usually quite large) collections of Web pages.", "num_citations": "7\n", "authors": ["1176"]}
{"title": "IDEA: from Advising to Collaboration\n", "abstract": " IDEA is an application independent environment for the development of intelligent advisory systems for a wide range of interactive computer interfaces. Our work on IDEA addresses two particular aspects of these systems:", "num_citations": "7\n", "authors": ["1176"]}
{"title": "Patterns of Patient and Caregiver Mutual Support Connections in an Online Health Community\n", "abstract": " Online health communities offer the promise of support benefits to users, in particular because these communities enable users to find peers with similar experiences. Building mutually supportive connections between peers is a key motivation for using online health communities. However, a user's role in a community may influence the formation of peer connections. In this work, we study patterns of peer connections between two structural health roles: patient and non-professional caregiver. We examine user behavior in an online health community---CaringBridge.org---where finding peers is not explicitly supported. This context lets us use social network analysis methods to explore the growth of such connections in the wild and identify users' peer communication preferences. We investigated how connections between peers were initiated, finding that initiations are more likely between two authors who have the …", "num_citations": "6\n", "authors": ["1176"]}
{"title": "Health‐related quality of life by human immunodeficiency virus status in a cross‐sectional survey of gay and bisexual prostate cancer survivors\n", "abstract": " Objective Prostate cancer is the most common invasive cancer in gay and bisexual men (GBM). Despite the unique sexual and urinary concerns of this group, studies of prostate cancer rehabilitation have primarily focused on heterosexual men. GBM also have high prevalence of human immunodeficiency virus (HIV), which may be associated with lower health‐related quality of life (HRQOL). We examined the association between HIV status and HRQOL in a cohort of GBM with prostate cancer.   Methods Data from the Restore study, a cross‐sectional online survey of GBM treated for prostate cancer, were used to examine this association. The Expanded Prostate Cancer Index Composite (EPIC) assessed function, bother, and summary measures in four domains: urinary, sexual, bowel, and hormone. Overall physical and mental HRQOL was assessed using the Short‐Form Health Survey (SF‐12). Multivariate …", "num_citations": "6\n", "authors": ["1176"]}
{"title": "Crème de la crème: Elite contributors in an online community\n", "abstract": " In open content communities like Wikipedia and StackOverflow and in open source software projects, a small proportion of users produce a majority of the content and take on much of the required community maintenance work. Understanding this class of users is crucial to creating and sustaining healthy communities. We carried out a mixed-method study of core contributors to the Cyclopath geographic wiki and bicycle routing web site. We present our findings and organize our discussion using concepts from activity theory. We found that the Cyclopath core contributors aren't the dedicated cyclists and that the characteristics of the community shape the site, the rules, and the tools for contributing. Additionally, we found that numerous aspects about the surrounding ecology of related systems and communities may help to shape how the site functions and views itself. We draw implications for future research and …", "num_citations": "6\n", "authors": ["1176"]}
{"title": "From “model world” to “magic world” making graphical objects the medium for intelligent design assistance—a CHI'95 workshop\n", "abstract": " A model world is a computer interface in which the objects and actions mirror the objects and actions in some real world domain. The world changes because of actions by the user and because of the natural processes of the (modeled) world. Users act rather than conversing with some intermediary.We coined the term\" magic world\" to describe an interface that changes not just in response to user actions and the natural processes of the modeled world, but also due to the working of hidden, helpful hands. Behind the scenes, active system processes work on behalf of the user, communicating assistance by manipulating graphical objects in the magic world. Magic worlds have the potential of being more supportive than model worlds, and they can also reduce the risk of harmful anthropomorphization that is associated with traditional agent-based support mechanisms.", "num_citations": "6\n", "authors": ["1176"]}
{"title": "DynaDesigner: a tool for rapid creation of device-independent interactive services\n", "abstract": " DynaDesigner is a tool for creating, testing, and deploying interactive services to be delivered on devices such as telephones, TVs, and PCs. A key feature is that it supports device-independent service design — a service is designed once, independent of any particular device. This eases the design and maintenance task for service providers and makes services easier for consumers to use, since they are consistent across devices. DynaDesigner has been used to design and deploy many services. With DynaDesigner, services can be designed and deployed in hours.", "num_citations": "6\n", "authors": ["1176"]}
{"title": "The role of the system image in intelligent user assistance\n", "abstract": " Many researchers have demonstrated the ways in which well-designed graphical interfaces allow users to acquire conceptual models of the interfaces and the application programs behind these interfaces. It is also clear that the users’ models are initially flawed and incomplete, and the problems that users have with these systems revolve around the misconceptions and alternate conceptualizations in these models. Our work indicates that graphical interfaces may be especially sensitive to misconceptions, and that advisory systems for these kinds of systems must anticipate and resolve such problems. In particular, they must be able to understand alternative conceptual models of the system, and may need to diagnose and remediate these misconceptions. We will describe our work on direct manipulation interfaces and intelligent advisory systems, focusing on the problems people encounter when using interfaces …", "num_citations": "6\n", "authors": ["1176"]}
{"title": "Out with the old, in with the new? unpacking member turnover in online production groups\n", "abstract": " Nearly any group is subject to turnover : some people leave, while others join. Turnover can be especially high in online groups, since participation typically is strictly voluntary. We investigated the effects of member turnover in online groups, specifically in Wikipedia's WikiProjects. We based our studies on theories from organizational science, which suggest that it is not just the amount of turnover, but the characteristics of those leaving and those joining that matter. We characterized leavers and newcomers by their prior productivity, tenure (in the group or community), and participation in other groups within the larger community. Furthermore, we considered the moderating effect of group size on turnover. We analyzed data from 88,427 editors who participated in 1,054 WikiProjects, finding that (1) the positive effects of newcomers to a group were larger than the negative effects of leavers, (2) prior productivity, tenure …", "num_citations": "5\n", "authors": ["1176"]}
{"title": "Because I Carry My Cell Phone Anyway: Effective Everyday Task Management\n", "abstract": " Location-based information systems are a promising, but unproven technology. We developed a novel locationbased reminder system called PlaceMail, and demonstrated its utility in supporting everyday tasks through a monthlong field study. We identified current tools and practices people use to manage everyday tasks. We identified problems with current methods, including with the basic resource of a to-do list. Our field study showed that PlaceMail provided useful location-based reminders and supported the use of lists and rich tasks details. It also shed rich and surprising light on the problem of where and when to delivery location-aware information. The common method of basing delivery on distance or travel time to a place is not sufficient; instead effective delivery depends on people’s movement patterns through an area and the geographic layout of the area. Our results both provide a compelling demonstration of the utility of location-based information and raise significant new challenges for location-based information distribution.", "num_citations": "5\n", "authors": ["1176"]}
{"title": "Location-aware community applications: Privacy issues and user interfaces\n", "abstract": " We are embarked on a research program whose overall goal is to create and study mobile, location-aware applications that let people leverage existing face-to-face relationships in new ways. We have outlined three classes of applications that strengthen community at different points along the spectrum of personal and group relationships. All the applications require users to share some information about their location. Therefore, the applications will be acceptable only if they are based on a clear understanding of how people trade off the benefits of sharing personal information and the risks of loss of privacy, and if they offer interfaces that let users express and manage their privacy preferences effectively and easily. We present our ongoing work aimed at achieving these goals. We describe the applications we are building, identify major privacy issues they raise, and discuss the system and interface design features we are creating to let users control access to their personal information. Key design ideas regarding privacy are:", "num_citations": "5\n", "authors": ["1176"]}
{"title": "What is Spiritual Support and How Might It Impact the Design of Online Communities?\n", "abstract": " Spirituality is an understudied topic in social computing; however, for Online Health Community (OHC) users facing life-threatening illness, it is of fundamental importance. Through in-depth focus groups with OHC stakeholders in a US context, we derive a definition of \"spiritual support\" for use by designers and researchers who study online social support. We show that spiritual support is an integral dimension that underlies other social support types, and that if we ignore spirituality in design, we fail to mitigate problematic issues that arise in online spaces when users' spiritual values clash. Based on participants' ideations, we provide design implications for OHCs and other social media to better facilitate spiritual support through: (1) representing spiritual beliefs, (2) assistance with supportive communication, (3) support network visualization and mobilization, and (4) advance care planning and digital legacy.", "num_citations": "4\n", "authors": ["1176"]}
{"title": "Oh the places You'Ll share: An affordances-based model of social media posting behaviors\n", "abstract": " With rising use of multiple social network sites (SNSs), people now have an increasing number of options for audience, media, and other SNS features at their disposal. In this paper, our goal is to build machine learning models that can predict people» s multi-SNS posting decisions, thus enabling technology that can personalize and augment current SNS use. We explore affordances--the perceived utilities of a SNS» s features-for creating these models. We build an affordance-based model using data collected from a survey about people» s multi-SNS posting behavior (n= 674). Our model predicts posting decisions that are~ 35% more accurate compared to a random baseline, and~ 10% more accurate than predictions based on SNS popularity.", "num_citations": "4\n", "authors": ["1176"]}
{"title": "Sharescape: an interface for place annotation\n", "abstract": " Many people use the Internet to search for geographically local information, with a growing number of websites dedicated to this task. However, it is not clear exactly how users integrate geographic search with content-based search, nor how to obtain reliable information about places in a geographic region. We created Sharescape, a map-based application in which information is contributed by community members. We conducted a user study to evaluate the utility of this means of obtaining information and to investigate how users integrate geographic and content-based search. Our results suggest that 1) maps create an implicit context in an interface that designers should honor, 2) community-maintained information about local geography has important benefits over information mined from web sites, and 3) users often are not aware of the privacy implications of their actions, and therefore designers should …", "num_citations": "4\n", "authors": ["1176"]}
{"title": "ContactMap: using personal social networks to organize communication in a social desktop.\n", "abstract": " A shared physical workplace is a rich social and informational environment. Tasks such as managing communication commitments, keeping track of collaborators and friends, and “social data mining” of local expertise for advice and information are supported naturally by a shared physical workplace. However, many people now collaborate remotely using tools such as email and voicemail. Our field studies show that these tools do not support processes such as social reminding or social data mining. In part, this is because these tools are organized around messages, rather than people. In response to this problem, and informed by our field studies, we created ContactMap, a system that makes people the primary unit of interaction. ContactMap provides a structured visual representation of the important people in the user’s social network; this representation directly supports social reminding and social data mining. We conducted an empirical evaluation of ContactMap, comparing it with traditional email systems on tasks motivated by our fieldwork. Users performed better with ContactMap than their usual email system, and they strongly preferred ContactMap for these tasks. Analysis suggests that ContactMap’s visual interface supports rapid scanning, allowing users to quickly identify relevant contacts and information. It also affords associative reminding about important people and relations between people. We discuss the implications of these results for future communication interfaces and for theories of mediated communication.", "num_citations": "4\n", "authors": ["1176"]}
{"title": "Interacting with recommender systems\n", "abstract": " Many people today live in information-rich worlds, constantly facing the question: what should I do next? Which papers should I read to learn about a new area I am interested in? Which movie should I go to? Which restaurant would I like? The experience of friends and colleagues is a valuable resource for making such decisions, especially friends who are familiar with the subject area and have similar tastes. The field of recommender systems (or collaborative filtering) attempts to automate this process, eg, by supporting people in making recommendations, finding a set of people who are likely to provide good recommendations for a given person, or deriving recommendations from implicit behavior such as browsing activity, buying patterns, and time on task.", "num_citations": "4\n", "authors": ["1176"]}
{"title": "New uses and abuses of interaction history: Help form the research agenda\n", "abstract": " Recording human-computer interaction for the purposes of reusing commands, undoing actions, recovering from crashes, constructing keyboard macros, and observing users has been with us since the earliest command shells and text editors. For much of that time it remained a sleepy “back water” technology area except for a continuing increase in work-monitoring and associated incidents breeching user privacy. However, with the drastic fall of costs for digital storage, processing and telecommunications, all that is now rapidly changing. Digital records of activity are common at work, market-place and home. While new interaction history techniques such as design capture, automatic change bars, readwear, interface agents, digital audio recording, hot lists, version management, viewer histories, automatic biography, usability studies, active badges, wireless personal communicators, position-sensing and caller-id …", "num_citations": "4\n", "authors": ["1176"]}
{"title": "The evolution of SIGCHI conferences and the future of CHI\n", "abstract": " in Africa in 2008 (DIS’08 in Cape Town). We have further provided in-cooperation support to 427 conferences, of which 91 have been in North America, 231 in Europe, 53 in Asia, 25 in Oceania, 19 in South America, and eight in Africa. Not surprisingly, the number of delegates attending our events has grown too. There were 906 attendees of the first CHI conference in 1982, while 3,804 (including telepresence robots) attended CHI 2016. Today more than 9,000 delegates participate in our 24 sponsored conferences. This growth raises challenges for volunteer workload, constrains venue choices, and puts pressures on budgets. This growth has also led to a number of changes in how SIGCHI manages its conferences. Since 2006, SIGCHI has supported the creation of a steering committee for each of our sponsored conferences. Further, the current SIGCHI Executive Committee made some changes with the aim of …", "num_citations": "3\n", "authors": ["1176"]}
{"title": "Local knowledge matters for crowdsourcing systems: Experience from transferring an american site to china\n", "abstract": " We present the results of a preliminary cross-cultural study of Cyclopath, a geographic crowdsourcing system for cyclists. We created a Chinese version and tested it in lab with 40 cyclists in Dalian, China. We analyzed the data entered by users and found some significant differences compared to similar studies done in the US; this illustrates the need for local knowledge in crowdsourcing applications. From usage patterns and interview data, we observed that landmarks play a larger role for navigating the map and requesting routes; this suggests that integrating landmarks better into the Cyclopath UI could improve Chinese users’ experience with the system. Finally, we found that concepts of authority and hierarchy may influence Chinese users’ trust of peer-contributed content; this suggests that reputation mechanisms may help improve trust.", "num_citations": "3\n", "authors": ["1176"]}
{"title": "Path selection: a novel interaction technique for mapping applications\n", "abstract": " Many online mapping applications let users define routes, perhaps for sharing a favorite bicycle commuting route or rating several contiguous city blocks. At the UI level, defining a route amounts to selecting a fairly large number of objects-the individual segments of roads and trails that make up the route. We present a novel interaction technique for this task called path selection. We implemented the technique and evaluated it experimentally, finding that adding path selection to a state-of-the-art technique for selecting individual objects reduced route definition time by about a factor of 2, reduced errors, and improved user satisfaction. Detailed analysis of the results showed path selection is most advantageous (a) for routes with long straight segments and (b) when objects that are optimal click targets also are visually attractive.", "num_citations": "3\n", "authors": ["1176"]}
{"title": "Bioacoustic control system, method and apparatus\n", "abstract": " Bioacoustic sensors and wireless technologies are used for the control of electronic devices, such as wireless telephones, pagers, music/media players or personal laptops and personal digital assistant (PDA) devices. Such control is implemented with certain systems, methods and apparatus which include bioacoustic sensors, a processor coupled to the bioacoustic sensors, and a transmitter coupled to the processor. The present invention is operative to detect particular hand and/or finger gestures, and to transmit control signals corresponding to the gestures for operative control of an electronic device.", "num_citations": "2\n", "authors": ["1176"]}
{"title": "Exploring the Relationship Between\" Informal Standards\" and Contributor Practice in OpenStreetMap\n", "abstract": " Peer production communities create valuable content such as software, encyclopedia articles, and map data. As part of the creation process, these communities define production standards for their content, eg, semantic and syntactic requirements. We carried out a study in OpenStreetMap to investigate the role of that community's standards for geographic metadata. We found that most applied metadata was consistent with the community's standards; however, we also found that the standards identified many opportunities for applying metadata that were not achieved. In addition, when we situated the standards in the context of OpenStreetMap's data model, we found a significant amount of ambiguity; the syntax allowed only one value, but everyday meaning--and the standards themselves--called for multiple values. Our results suggest significant opportunities for OpenStreetMap to produce additional valuable …", "num_citations": "2\n", "authors": ["1176"]}
{"title": "The Role of Human Geography in Collective Intelligence\n", "abstract": " Collective intelligence paradigms were initially developed to address problems that do not have an explicit geographic footprint (eg image labeling [von Ahn and Dabbish 2004]). However, in recent years, researchers and practitioners have used collective intelligence approaches to tackle geographic challenges. This is manifest in particular in physical crowdsourcing systems (eg TaskRabbit and related sharing economy platforms like UberX), peer production communities dedicated to describing geographic phenomena (eg “geowikis”[Priedhorsky and Terveen 2008] such as OpenStreetMap), and the consideration of geotagged social media (eg geotagged tweets and photos, check-ins).Geographers and those in the spatial computing and geographic information science (GIScience) communities have long known that “spatial is special”(eg [Longley et al. 2010; Goodchild 2001]), or that geographic processes have unique properties that are important to consider in both research and practice. In this abstract, we discuss our recent work that shows that collective intelligence is no exception to the “spatial is special” rule. That is, for a given collective intelligence system, the geography of the application area can have a dramatic effect on the operation and ultimate effectiveness of the", "num_citations": "2\n", "authors": ["1176"]}
{"title": "War vs inspirational in forrest gump: Cultural effects in tagging communities\n", "abstract": " People from different cultures vary in cognition, emotion, and behavior. We explore cultural differences in a tagging system. We developed a model of cultural differences and performed a controlled empirical study with American and Chinese subjects to investigate questions that arise from the model. American and Chinese subjects differed in many ways: the number and types of tags they applied; the extent to which they applied suggested tags or entered new tags of their own; and how often they applied tags that originated from a different culture. Our results are consistent with theories of cultural differences between Asian and Western cultures. Our findings suggest new opportunities and mechanisms for shaping user behavior to produce useful tag repositories.", "num_citations": "2\n", "authors": ["1176"]}
{"title": "Asynchronous communication: Fostering social interaction with CollaboraTV\n", "abstract": " With the advent of digital video recorders and video-on-demand services, the way in which we consume media is undergoing a fundamental change. People today are less likely to watch shows at the same time, let alone the same place. As a result, television viewing which was once a social activity has been reduced to a passive, isolated experience. CollaboraTV was designed to address this new mode of television viewing by directly supporting asynchronous communication. We demonstrated its ability to support this communal viewing experience through a lab study and a month-long field study. Our studies show that users understand and appreciate the utility of asynchronous interaction, are enthusiastic about CollaboraTV’s engaging social communication primitives and value implicit show recommendations from friends. Our results both provide a compelling demonstration of a social television system and …", "num_citations": "2\n", "authors": ["1176"]}
{"title": "Literature Review for Online Communities and Recommender Systems\n", "abstract": " The goal of this paper is to review the literature in the area of online communities and recommender systems. Online communities are social phenomenon that appears after the blooming of the Internet, while recommender system is one kind of computer filtering systems that help to solve the problem of information filtering problem that become more and more serious with the introduction of the Internet. In order to better understand online communities, the paper will first give a very general overview of online communities including the history, definition, key attributes, and influences of online communities. Then, it will discuss online communities from sociability, functionality and usability aspects and general guidelines for designing online community systems. Particularly, interpersonal relationships will be discussed in detail. Finally, some future research issues will be discussed. With more and more people join the …", "num_citations": "2\n", "authors": ["1176"]}
{"title": "The dynamics of mass interaction\n", "abstract": " Usenet may be regarded as the worl $ s largest conversatioti appficatioq with over 17,000 newsgronps and 3 fion users. Despite its ubiquity and poptiari~, however, we know Etie about the natore of the interactions it suppo~.~ s empirical paper investigates mass interaction in UseneL We anrdyse over 2.15 Mon messages from 659,450 posters, co~ ected from 500 newsgoups over 6 months. We fit characterise mass interactio~ presenting basic data about demographics, conversational strategies and interactivity-Using predictions tiom the common ground [3] model of interactio~ we next conduct causal modetig to determine relations bemeen demographics, conversational strategim and interactiv~. We find evidence for moderate conversatiomd threading, but hge participation", "num_citations": "2\n", "authors": ["1176"]}
{"title": "Chairs' welcome\n", "abstract": " Chairs' welcome — Experts@Minnesota Skip to main navigation Skip to search Skip to main content Experts@Minnesota Logo Home Profiles Research Units University Assets Projects and Grants Research Output Press / Media Datasets Activities Fellowships, Honors, and Prizes Search by expertise, name or affiliation Chairs' welcome Jofish Kaye, Allison Druin, Cliff Lampe, Dan Morris, Juan Pablo Hourcade, Loren Terveen, Scooter Morris Computer Science and Engineering Research output: Contribution to journal › Editorial › peer-review Overview Fingerprint Original language English (US) Pages (from-to) iii-iv Journal Conference on Human Factors in Computing Systems - Proceedings Volume 07-12-May-2016 State Published - May 7 2016 Event 34th Annual CHI Conference on Human Factors in Computing Systems, CHI EA 2016 - San Jose, United States Duration: May 7 2016 → May 12 2016 Access Link to …", "num_citations": "1\n", "authors": ["1176"]}
{"title": "More efficient tagging systems with tag seeding\n", "abstract": " Tags are a useful mechanism for users to find, organize, and understand items on a web site. A tagging system evolves to reflect a user community’s understanding of an information space. However, the evolution can be problematic: specifically, the ratio of tags to items can decrease over time, to the extent that tags no longer effectively discriminate among items. The primary reason is over application of existing popular tags to most of the items. This makes it difficult for a user to search and navigate using specific tags. We address this problem of disproportionate application of existing popular tags by eliciting applications of those tags that are under applied but highly relevant. In this paper, we introduce two metrics to identify such under applied relevant tags from the system. We then design a controlled study to elicit more applications of these tags, to show how the declining discriminating power of tags is counteracted by interventions in tag applications using these carefully chosen under applied tags, namely seeded tags. We found that users were able to apply these underutilized tags, with the result that about eleven months of lost navigational and search efficiency of the tagging system was attained back. We also monitored subsequent usage of these tags in the system and found that the seeded tags does attract more users in navigation (such as clicks and searches) than before our intervention, suggesting that tag seeding has a persistent effect over the system.", "num_citations": "1\n", "authors": ["1176"]}
{"title": "Bike, bus, and beyond: Extending cyclopath to enable multi-modal routing\n", "abstract": " This project addressed several MnDOT critical issues and strategic directions: easing congestion and improving mobility by making multi-modal transit options more easily accessible. It did so by extending the Cyclopath bicycle route-finding system to support multi-modal routes that combine cycling and transit. This required extensions to the route-finding algorithm – to combine biking and transit appropriately – and user interface – to let users express modal preferences and enhance the visual presentation of routes, e.g., to mark mode shifts. We used the Graphserver open-source software to as the routing engine; by building on existing software, we reduced development effort. We conducted interviews with a number of multimodal transit users to guide the design of the user interface.", "num_citations": "1\n", "authors": ["1176"]}
{"title": "Geographical social production: Lessons from Cyclopath\n", "abstract": " Geographical Social Production (GSP) is a recent phenomenon created by the confluence of geographical and the open content philosophies. In this position paper, we report a few lessons we learned through our experience and research with one such GSP system, Cyclopath, a route-finding geowiki for bicyclists. We believe these lessons would help drive critical thinking about how to make GSP systems better and more efficient.", "num_citations": "1\n", "authors": ["1176"]}
{"title": "From PHOAKS to Topicshop: Experiments in social data mining\n", "abstract": " We live in an age of information abundance. The Internet in particular confronts us with endless possibilities: web sites to experience, music to listen to, conversations to participate in, and every conceivable consumer item to buy. Not only are there vast numbers of possibilities, but they also vary widely in quality. People thus face a difficult information management problem: they cannot hope to evaluate all available choices by themselves unless the topic of interest is severely constrained.", "num_citations": "1\n", "authors": ["1176"]}
{"title": "THE SOCIAL CONTEXT OF INTELLIGENT SYSTEMS\n", "abstract": " ObjectiveThe Journal of Intelligent Systems provides readers with a compilation of stimulating and up-to-date articles within the field of intelligent systems. The focus of the journal is on high quality research that addresses paradigms, development, applications and implications in the field of intelligent systems. The Journal of Intelligent Systems is a peer reviewed journal. Special issues can be arranged by contacting the Editor.", "num_citations": "1\n", "authors": ["1176"]}