{"title": "Test event generation for a fall-detection IoT system\n", "abstract": " The Internet of Things (IoT) is a popular paradigm which has been applied to different areas, such as smart cities, medicine, or business processes. One of the main drawbacks of an IoT system is the amount of information it has to manage and to monitor. This information arrives as events that need to be processed in real-time in order to make correct decisions. The event processing languages (EPLs) were designed to handle this information by defining event patterns which describe relevant situations to be detected and filter the information. In the majority of the relevant situations to detect, the events have a specific behavior which must be analyzed not only to define the event patterns but also to simulate them to test the IoT system. Moreover, in several situations it is quite difficult to obtain test events with specific values: adverse environment conditions, rise or fall in blood pressure, heart attack, falls, among others …", "num_citations": "24\n", "authors": ["2037"]}
{"title": "Evolutionary mutation testing for IoT with recorded and generated events\n", "abstract": " Mutation testing is a testing technique that has been applied successfully to several programming languages. Despite its benefits for software testing, the high computational cost of mutation testing has kept it from being widely used. Several refinements have been proposed to reduce its cost by reducing the number of generated mutants; one of those is evolutionary mutation testing (EMT). Evolutionary mutation testing aims at generating a reduced set of mutants with an evolutionary algorithm, which searches for potentially equivalent and difficult to kill mutants that help improve the test suite. Evolutionary mutation testing has been evaluated in two contexts so far, ie, web service compositions and object‐oriented C++ programmes. This study explores its performance when applied to event processing language queries of various domains. This study also considers the impact of the test data, since a lack of events or …", "num_citations": "20\n", "authors": ["2037"]}
{"title": "IoT–TEG: Test event generator system\n", "abstract": " Internet of Things (IoT) has been paid increasingly attention by the government, academe and industry all over the world. One of the main drawbacks of the IoT systems is the amount of information they have to handle. This information arrives as events that need to be processed in real time in order to make correct decisions. Given that processing the data is crucial, testing the IoT systems that will manage that information is required. In order to test IoT systems, it is necessary to generate a huge number of events with specific structures and values to test the functionalities required by these systems. As this task is very hard and very prone to error if done by hand, this paper addresses the automated generation of appropriate events for testing. For this purpose, a general specification to define event types and its representation are proposed and an event generator is developed based on this definition. Thanks to the …", "num_citations": "18\n", "authors": ["2037"]}
{"title": "Mutation testing of event processing queries\n", "abstract": " Event processing queries are intended to process continuous event streams. These queries are partially similar to traditional SQL queries, but provide the facilities to express rich features (e.g., pattern expression, sliding window of length and time). An error while implementing a query may result in abnormal program behaviors and lost business opportunities. Moreover, queries can be generated with unsanitized inputs and the structure of intended queries might be altered. Thus, a tester needs to test the behavior of queries in presence of malicious inputs. Mutation testing has been found to be effective to assess test suites quality and generating new test cases. Unfortunately, there is no effort to perform mutation testing of event processing queries. In this work, we propose mutation-based testing of event processing queries. We choose Event Processing Language (EPL) as our case study and develop necessary …", "num_citations": "11\n", "authors": ["2037"]}
{"title": "A Wearable Fall Detection System Based on Body Area Networks\n", "abstract": " Falls can have serious consequences for people, leading to restrictions in mobility or, in the worst case, to traumatic-based cases of death. To provide rapid assistance, a portable fall detection system has been developed that is capable of detecting fall situations and, if necessary, alerting emergency services without any user interaction. The prototype is designed to facilitate reliable fall detection and to classify several fall types and human activities. This solution represents a life-saving service for every person that will significantly improve assistance in the case of fall events, which are a part of daily life. Additionally, this approach facilitates independent system operation, since the system does not depend on sensor or network units located within a building structure. This article also introduces fall analysis. To guarantee functional safety, a hazard analysis method named system-theoretic accident model and …", "num_citations": "6\n", "authors": ["2037"]}
{"title": "Mutation testing: Guideline and mutation operator classification\n", "abstract": " Mutation testing has been found to be effective to assess test suites quality and also to generate new test cases. In fact, it has been applied to many languages. Unfortunately there is no research work which focuses its attention on detect deficiencies in the mutation testing studies already done. Moreover, the mutation operators classification has not been tackled at all. When has a mutation testing study an enough grade of maturity? It has not been found an study which determines the grade of maturity of a mutation testing study. We propose a classification of mutation operators which lets us know if it is necessary to define more mutation operators, and also lets us determine if the mutation operators are good enough to consider mature the mutation testing study. The evaluation results show the benefits of the proposed classification. This classification lets the developer do a good evaluation of the programming language under mutation testing, as well as its defined mutation operators. The mutation testing process described in this paper and the mutation operators classification have been developed and analyzed with real cases. New mutation operators for Event Processing Language have been defined and used as examples to understand the proposed mutation operators classification.", "num_citations": "6\n", "authors": ["2037"]}
{"title": "Evaluation of EPL mutation operators with the MuEPL mutation system\n", "abstract": " The expert systems (ESs) have been developed to facilitate the users their tasks, to enhance the productivity and reduce losses. In order to replicate the behaviour of a human expert, they generate output using their stored knowledge base. In a ES, the accumulation of knowledge from different sources is a very important factor. Nowadays, we are living in a world where two crucial processes need to be perform quickly: decision-making and problem solving. The complexity of the decisions and problems lays on the different factors, situations and data that are involved. The Internet of Things (IoT) has been created to address these situations and helps the users to make correct decisions in real time according to the received data. In the concept of IoT, daily life objects are connected to each other so they can transfer data over the internet without a human to human interaction. The combination of IoT and ESs is a step …", "num_citations": "3\n", "authors": ["2037"]}
{"title": "Development of free multimedia resources with encyclopedic aim:  From the classroom to Wikimedia Commons\n", "abstract": " 1. Introduction–Wikipedia is the largest collaborative project which humanity has been developed. It is a free encyclopedia with more than 20 millions of articles in 282 languages and dialects, which have been written by voluntaries from all over the world. The main contributions in Wikipedia are texts, but the encyclopedia also needs photographs, artwork and multimedia materials to illustrate its articles. The target of our project is to involve the students into the development of multimedia elements for Wikipedia. As a result, the work of the students is visible for a wide audience in the Internet, and they can receive feedback of their work for their critical analysis.2. Development–WikiArS [1] is a project that aims to engage students to develop multimedia materials for Wikimedia Commons, the repository of free multimedia files that are used by the Wikipedia and other free projects. Basically, its main objective is that students from art and design degrees provide materials that the photography cannot. This involves, for example, fictional characters artworks according to book descriptions, large scale millenary geological events animations (Figure 1) and atomic-level chemical processes representations.", "num_citations": "3\n", "authors": ["2037"]}
{"title": "Evaluación de la calidad de los mutantes en la prueba de mutaciones\n", "abstract": " La prueba de mutaciones es una técnica de prueba basada en fallos computacionalmente costosa. Debido a esto, se han propuesto diferentes técnicas para reducir dicho coste computacional mediante la reducción del número de mutantes generados. La efectividad de estas técnicas se podría medir de acuerdo a la calidad del subconjunto de mutantes generados. Para ello es necesario establecer una métrica que determine la calidad de un mutante frente al conjunto de casos de prueba sobre el que se ejecuta. En este artículo se presenta una métrica de la calidad de los mutantes, así como una métrica de la calidad de los operadores de mutación. Además se muestran los resultados experimentales obtenidos al aplicar dichas métricas a varias composiciones WS-BPEL.", "num_citations": "3\n", "authors": ["2037"]}
{"title": "Desarrollo de materiales multimedia libres de carácter enciclopédico: Del aula a Wikimedia Commons\n", "abstract": " Wikipedia es el proyecto colaborativo más grande desarrollado por el ser humano. Es una enciclopedia libre con más de 20 millones de artículos con miles de fotografías, ilustraciones y elementos multimedia. En este artículo presentamos la experiencia desarrollada en la Universidad de Cádiz dentro de la iniciativa wikiARS, que tiene por objetivo involucrar al alumnado de titulaciones relacionadas con arte y diseño en el desarrollo de obras multimedia para Wikimedia Commons, el repositorio de archivos multimedia libres de Wikipedia. Esto incluye, por ejemplo, ilustraciones de seres de ficción según descripciones de libros, animaciones que muestren sucesos geológicos a gran escala, procesos y representaciones moleculares, etc. A cada alumno se le asigna un experto en la materia a tratar como si de un cliente se tratara. El profesorado se cerciora de que durante su trabajo, el alumno aplica técnicas adecuadas para asegurar su correcto aprendizaje. Además, los alumnos deben seguir los estándares y normas de la comunidad: formatos recomendados, resoluciones permitidas, etiquetado de metadatos, etc. Los resultados hasta la fecha han sido muy positivos, habiendo publicado más de 80 recursos multimedia libres. Los alumnos participantes en la iniciativa valoran muy positivamente publicar sus obras en un escaparate único como es Wikipedia.", "num_citations": "2\n", "authors": ["2037"]}
{"title": "IoT-TEG 4.0: A New Approach 4.0 for Test Event Generation\n", "abstract": " The Industry 4.0 (I4.0) is a paradigm settled down by the introduction of the Internet of things (IoT) into the production and manufacturing environment. I4.0 promotes the connection of physical items such as sensors, devices, and enterprise assets, to each other and to the Internet. The information that flows through these items is vital because it serves to make relevant decisions. One of the main features of I4.0 is its adaptability to the human needs, this means that the items included in the I4.0 network are heterogeneous and they are large in number. The majority of I4.0 papers, which are focused on testing, describe a specific system or part of the I4.0 network. We have not found any paper that undertakes the testing of multiple connected IoT devices that will receive, process, and make decisions according to the complex and real data that travel through the network. In this article, we present IoT-TEG (Test Event …", "num_citations": "1\n", "authors": ["2037"]}
{"title": "Combining Evolutionary Mutation Testing with Random Selection\n", "abstract": " Mutation testing is a well-known fault-based technique that has been applied to different domains as new technologies have appeared. Evolutionary Mutation Testing (EMT) finds mutants that are useful to produce new test cases. It uses evolutionary algorithms to reduce the number of mutants that are generated, keeping as many difficult to kill and stubborn mutants (strong mutants) as possible in the reduced set. Given the popularity of real-time systems, the MuEPL mutation system was developed for the Esper Event Processing Language (EPL), a query language aimed at the Internet of Things (IoT). In past work, EMT was integrated into MuEPL, and it reduced the cost of finding strong mutants in some EPL queries but not in others. This study takes a step forward by proposing and evaluating two metaheuristics for EMT that combine EMT and random selection: one which bootstraps the hall of fame with a random …", "num_citations": "1\n", "authors": ["2037"]}
{"title": "Mutation Operators for Google Query Language\n", "abstract": " Nowadays the technology is being created and adapted to satisfy the user necessities. Among them, obtaining information as fast as possible. Google knows how to meet this demand developing and offering new services that provide the requested information quickly. Google technology can be used to develop products using the Google App Engine (GAE). In order to manipulate the data, GAE uses the Google Query Language (GQL), a SQL-like language, that has been designed to provide a solution to the necessity of having super-fast access to data warehouses. The quality of the developed products is essential and therefore, testing them is mandatory. In this paper, we propose the use of mutation testing to detect faults during the development of applications that use GQL. With this goal, we introduce a set of specific mutation operators for GQL.", "num_citations": "1\n", "authors": ["2037"]}
{"title": "Herramientas para automatizar la evaluación presencial\n", "abstract": " La evaluación de la actividad del alumno durante el desarrollo de las asignaturas, es una tarea importante pero a la vez, difícil de realizar. El plantear numerosas pruebas y correcciones de trabajos y/o exámenes durante el curso, conlleva mucho tiempo y trabajo del profesor, a la vez que resulta difícil integrarlo en el desarrollo de las sesiones presenciales. En este artículo se describen los procedimientos y las aplicaciones, que se han desarrollado para ayudar a la evaluación de pruebas presenciales -con exámenes en papel- de forma casi-automática.", "num_citations": "1\n", "authors": ["2037"]}