{"title": "Impact analysis by mining software and change request repositories\n", "abstract": " Impact analysis is the identification of the work products affected by a proposed change request, either a bug fix or a new feature request. In many open-source projects, such as KDE, Gnome, Mozilla, Openoffice, change requests, and related data, are stored in a bug tracking system such as Bugzilla. These data, together with the data stored in a versioning system, such as CVS, are a valuable source of information on which useful analyses can be performed. In this paper we propose a method to derive the set of source files impacted by a proposed change request. The method exploits information retrieval algorithms to link the change request description and the set of historical source file revisions impacted by similar past change requests. The method is evaluated by applying it on four open-source projects", "num_citations": "239\n", "authors": ["201"]}
{"title": "Supporting change request assignment in open source development\n", "abstract": " Software repositories, such as CVS and Bugzilla, provide a huge amount of data regarding, respectively, source code and change request history. In this paper we propose a study on how change requests have been assigned to developers involved in an open source project and a method to suggest the set of best candidate developers to resolve a new change request. The method is based on the hypothesis that, given a new change request, developers that have resolved similar change requests in the past are the best candidates to resolve the new one. The suggestion can be useful for project managers in order to choose the best candidate to resolve a particular change request and/or to construct a competence database of developers working on software projects. We use the textual description of change requests stored in software repositories to index developers as documents in an information retrieval …", "num_citations": "169\n", "authors": ["201"]}
{"title": "Fine grained indexing of software repositories to support impact analysis\n", "abstract": " Versioned and bug-tracked software systems provide a huge amount of historical data regarding source code changes and issues management. In this paper we deal with impact analysis of a change request and show that data stored in software repositories are a good descriptor on how past change requests have been resolved. A fine grained analysis method of software repositories is used to index code at different levels of granularity, such as lines of code and source files, with free text contained in software repositories. The method exploits information retrieval algorithms to link the change request description and code entities impacted by similar past change requests. We evaluate such approach on a set of three open-source projects.", "num_citations": "127\n", "authors": ["201"]}
{"title": "Learning gene regulatory networks from only positive and unlabeled data\n", "abstract": " Recently, supervised learning methods have been exploited to reconstruct gene regulatory networks from gene expression data. The reconstruction of a network is modeled as a binary classification problem for each pair of genes. A statistical classifier is trained to recognize the relationships between the activation profiles of gene pairs. This approach has been proven to outperform previous unsupervised methods. However, the supervised approach raises open questions. In particular, although known regulatory connections can safely be assumed to be positive training examples, obtaining negative examples is not straightforward, because definite knowledge is typically not available that a given pair of genes do not interact. A recent advance in research on data mining is a method capable of learning a classifier from only positive and unlabeled examples, that does not need labeled negative examples. Applied to the reconstruction of gene regulatory networks, we show that this method significantly outperforms the current state of the art of machine learning methods. We assess the new method using both simulated and experimental data, and obtain major performance improvement. Compared to unsupervised methods for gene network inference, supervised methods are potentially more accurate, but for training they need a complete set of known regulatory connections. A supervised method that can be trained using only positive and unlabeled data, as presented in this paper, is especially beneficial for the task of inferring gene regulatory networks, because only an incomplete set of known regulatory connections is available in public …", "num_citations": "114\n", "authors": ["201"]}
{"title": "Identification of genetic determinants of breast cancer immune phenotypes by integrative genome-scale analysis\n", "abstract": " Cancer immunotherapy is revolutionizing the clinical management of several tumors, but has demonstrated limited activity in breast cancer. The development of more effective treatments is hindered by incomplete knowledge of the genetic determinant of immune responsiveness. To fill this gap, we mined copy number alteration, somatic mutation, and expression data from The Cancer Genome Atlas (TCGA). By using RNA-sequencing data from 1,004 breast cancers, we defined distinct immune phenotypes characterized by progressive expression of transcripts previously associated with immune-mediated rejection. The T helper 1 (Th-1) phenotype (ICR4), which also displays upregulation of immune-regulatory transcripts such as PDL1, PD1, FOXP3, IDO1, and CTLA4, was associated with prolonged patients' survival. We validated these findings in an independent meta-cohort of 1,954 breast cancer gene …", "num_citations": "106\n", "authors": ["201"]}
{"title": "How software repositories can help in resolving a new change request\n", "abstract": " In open source development, software evolution tasks are usually managed with a bug tracker system, such as Bugzilla [1], and a versioning system, such as CVS [2]. This provides for a huge amount of historical data regarding bug resolutions and new enhancement feature implementations. We discuss how software repositories can help developers in managing a new change request, either a bug or an enhancement feature. The hypothesis is that data stored in software repositories are a good descriptor on how past change requests have been resolved. Textual descriptions of fixed change requests stored in software repositories, both Bugzilla and CVS, are used to index developers and source files as documents in an information retrieval system. For a new change request, such indexes can be useful to identify the most appropriate developers to resolve it, or to predict the set of impacted source files.", "num_citations": "90\n", "authors": ["201"]}
{"title": "A metabolic function of FGFR3-TACC3 gene fusions in cancer\n", "abstract": " Chromosomal translocations that generate in-frame oncogenic gene fusions are notable examples of the success of targeted cancer therapies 1, 2, 3. We have previously described gene fusions of FGFR3-TACC3 (F3–T3) in 3% of human glioblastoma cases 4. Subsequent studies have reported similar frequencies of F3–T3 in many other cancers, indicating that F3–T3 is a commonly occuring fusion across all tumour types 5, 6. F3–T3 fusions are potent oncogenes that confer sensitivity to FGFR inhibitors, but the downstream oncogenic signalling pathways remain unknown 2, 4, 5, 6. Here we show that human tumours with F3–T3 fusions cluster within transcriptional subgroups that are characterized by the activation of mitochondrial functions. F3–T3 activates oxidative phosphorylation and mitochondrial biogenesis and induces sensitivity to inhibitors of oxidative metabolism. Phosphorylation of the phosphopeptide …", "num_citations": "83\n", "authors": ["201"]}
{"title": "Learning from bug-introducing changes to prevent fault prone code\n", "abstract": " A version control system, such as CVS/SVN, can provide the history of software changes performed during the evolution of a software project. Among all the changes performed there are some which cause the introduction of bugs, often resolved later with other changes.", "num_citations": "70\n", "authors": ["201"]}
{"title": "Interactive visualization tools to improve learning and teaching in online learning environments\n", "abstract": " This paper presents two interactive visualization tools for learning management systems (LMS) in order to improve learning and teaching in online courses. The first tool was developed at the Intelligent Information Systems Laboratory (IISLab) at the Tampere University of Technology (TUT). The tool is used to analyse students' activity from automatically recorded user log data and to build interactive visualizations. They provide valuable insights into the learning process and participation of students in a course offered to teachers and students. The second tool was developed at the Unitelma Sapienza University. It extends navigation and search functionalities in the discussion forum of an LMS with a topic-driven paradigm. The tool analyses forum content and automatically identifies discussion topics. It then enhances the original forum with a topic-driven navigation structure and an interactive search graph. Both tools …", "num_citations": "61\n", "authors": ["201"]}
{"title": "De novo reconstruction of gene regulatory networks from time series data, an approach based on formal methods\n", "abstract": " Reverse engineering of gene regulatory relationships from genomics data is a crucial task to dissect the complex underlying regulatory mechanism occurring in a cell. From a computational point of view the reconstruction of gene regulatory networks is an undetermined problem as the large number of possible solutions is typically high in contrast to the number of available independent data points. Many possible solutions can fit the available data, explaining the data equally well, but only one of them can be the biologically true solution. Several strategies have been proposed in literature to reduce the search space and/or extend the amount of independent information.In this paper we propose a novel algorithm based on formal methods, mathematically rigorous techniques widely adopted in engineering to specify and verify complex software and hardware systems. Starting with a formal specification of gene …", "num_citations": "51\n", "authors": ["201"]}
{"title": "Cancer-related CD15/FUT4 overexpression decreases benefit to agents targeting EGFR or VEGF acting as a novel RAF-MEK-ERK kinase downstream regulator in metastatic colorectal cancer\n", "abstract": " Cancer-related immune antigens in the tumor microenvironment could represent an obstacle to agents targeting EGFR “cetuximab” or VEGF “bevacizumab” in metastatic colorectal cancer (mCRC) patients. Infiltrating immune cells into tumor tissues, cancer-related expression of immune antigens (CD3, CD8, CD68, CD73, MPO, CD15/FUT4) from 102 mCRC patients receiving first-line Cetuximab or Bevacizumab plus chemotherapy were assessed by immunohistochemistry and validated in an independent tissue microarrays of 140 patients. Genome-wide expression profiles from 436 patients and 60 colon cancer cell lines were investigated using bioinformatics analysis. In vitro kinase assays of target genes activated by chemokines or growth factors were performed. Here, we report that cancer-related CD15/FUT4 is overexpressed in most of mCRCs patients (43 %) and associates with lower intratumoral CD3+ and …", "num_citations": "47\n", "authors": ["201"]}
{"title": "A taxonomy of information retrieval models and tools\n", "abstract": " Information retrieval is attracting significant attention due to the exponential growth of the amount of information available in digital format. The proliferation of information retrieval objects, including algorithms, methods, technologies, and tools, makes it difficult to assess their capabilities and features and to understand the relationships that exist among them. In addition, the terminology is often confusing and misleading, as different terms are used to denote the same, or similar, tasks.", "num_citations": "42\n", "authors": ["201"]}
{"title": "Ensemble of gene signatures identifies novel biomarkers in colorectal cancer activated through PPARγ and TNFα signaling\n", "abstract": " We describe a novel bioinformatic and translational pathology approach, gene Signature Finder Algorithm (gSFA) to identify biomarkers associated with Colorectal Cancer (CRC) survival. Here a robust set of CRC markers is selected by an ensemble method. By using a dataset of 232 gene expression profiles, gSFA discovers 16 highly significant small gene signatures. Analysis of dichotomies generated by the signatures results in a set of 133 samples stably classified in good prognosis group and 56 samples in poor prognosis group, whereas 43 remain unreliably classified. AKAP12, DCBLD2, NT5E and SPON1 are particularly represented in the signatures and selected for validation in vivo on two independent patients cohorts comprising 140 tumor tissues and 60 matched normal tissues. Their expression and regulatory programs are investigated in vitro. We show that the coupled expression of NT5E and DCBLD2 robustly stratifies our patients in two groups (one of which with 100% survival at five years). We show that NT5E is a target of the TNF-α signaling in vitro; the tumor suppressor PPARγ acts as a novel NT5E antagonist that positively and concomitantly regulates DCBLD2 in a cancer cell context-dependent manner.", "num_citations": "40\n", "authors": ["201"]}
{"title": "Mining candidate web services from legacy code\n", "abstract": " Mining services from existing software system is a relevant challenge to enable the development of service-oriented systems. Very often, although a service realizing a feature needed to develop a service-oriented system is not available, such a feature might have been implemented in existing software systems. This paper proposes an approach for the identification of services in existing legacy code. The approach combines the use of textual similarity between a free-text query and the text extracted from the legacy code with a structural matching between a goal, expressed as a WSDL document, and XML-based interfaces of features reverse engineered from the source code. A performance assessment has been performed on two open source projects.", "num_citations": "40\n", "authors": ["201"]}
{"title": "Systems biology analysis reveals NFAT5 as a novel biomarker and master regulator of inflammatory breast cancer\n", "abstract": " Inflammatory breast cancer (IBC) is the most rare and aggressive variant of breast cancer (BC); however, only a limited number of specific gene signatures with low generalization abilities are available and few reliable biomarkers are helpful to improve IBC classification into a molecularly distinct phenotype. We applied a network-based strategy to gain insight into master regulators (MRs) linked to IBC pathogenesis.                    In-silico modeling and Algorithm for the Reconstruction of Accurate Cellular Networks (ARACNe) on IBC/non-IBC (nIBC) gene expression data (n = 197) was employed to identify novel master regulators connected to the IBC phenotype. Pathway enrichment analysis was used to characterize predicted targets of candidate genes. The expression pattern of the most significant MRs was then evaluated by immunohistochemistry (IHC) in two independent cohorts of IBCs (n = 39) and nIBCs (n …", "num_citations": "39\n", "authors": ["201"]}
{"title": "RGBM: regularized gradient boosting machines for identification of the transcriptional regulators of discrete glioma subtypes\n", "abstract": " We propose a generic framework for gene regulatory network (GRN) inference approached as a feature selection problem. GRNs obtained using Machine Learning techniques are often dense, whereas real GRNs are rather sparse. We use a Tikonov regularization inspired optimal L-curve criterion that utilizes the edge weight distribution for a given target gene to determine the optimal set of TFs associated with it. Our proposed framework allows to incorporate a mechanistic active biding network based on cis-regulatory motif analysis. We evaluate our regularization framework in conjunction with two non-linear ML techniques, namely gradient boosting machines (GBM) and random-forests (GENIE), resulting in a regularized feature selection based method specifically called RGBM and RGENIE respectively. RGBM has been used to identify the main transcription factors that are causally involved as master …", "num_citations": "35\n", "authors": ["201"]}
{"title": "Infer gene regulatory networks from time series data with probabilistic model checking\n", "abstract": " Gene regulatory relationships constitute a complex mechanism of interactions adopted by cells to control behaviours and functions of a living organism. The identification of such relationships from genomics data through a computational approach is a challenging task as the large number of possible solutions is typically high in contrast to the number of available independent data points. Literature approaches address the problem by reducing the search space and/or extend the amount of independent information. In this paper we propose a probabilistic variant of a previous proposed approach based on formal methods. The method starts with a formal specification of gene regulatory hypotheses and then determines which is the probability that such hypotheses are explained by the available time series data. Both direction and sign (inhibition/activation) of regulations can be detected whereas most of literature …", "num_citations": "32\n", "authors": ["201"]}
{"title": "VEGA: Variational segmentation for copy number detection\n", "abstract": " Motivation: Genomic copy number (CN) information is useful to study genetic traits of many diseases. Using array comparative genomic hybridization (aCGH), researchers are able to measure the copy number of thousands of DNA loci at the same time. Therefore, a current challenge in bioinformatics is the development of efficient algorithms to detect the map of aberrant chromosomal regions.                    Methods: We describe an approach for the segmentation of copy number aCGH data. Variational estimator for genomic aberrations (VEGA) adopt a variational model used in image segmentation. The optimal segmentation is modeled as the minimum of an energy functional encompassing both the quality of interpolation of the data and the complexity of the solution measured by the length of the boundaries between segmented regions. This solution is obtained by a region growing process where the stop …", "num_citations": "24\n", "authors": ["201"]}
{"title": "Identification of long non-coding transcripts with feature selection: a comparative study\n", "abstract": " The unveiling of long non-coding RNAs as important gene regulators in many biological contexts has increased the demand for efficient and robust computational methods to identify novel long non-coding RNAs from transcripts assembled with high throughput RNA-seq data. Several classes of sequence-based features have been proposed to distinguish between coding and non-coding transcripts. Among them, open reading frame, conservation scores, nucleotide arrangements, and RNA secondary structure have been used with success in literature to recognize intergenic long non-coding RNAs, a particular subclass of non-coding RNAs. In this paper we perform a systematic assessment of a wide collection of features extracted from sequence data. We use most of the features proposed in the literature, and we include, as a novel set of features, the occurrence of repeats contained in transposable elements. The aim is to detect signatures (groups of features) able to distinguish long non-coding transcripts from other classes, both protein-coding and non-coding. We evaluate different feature selection algorithms, test for signature stability, and evaluate the prediction ability of a signature with a machine learning algorithm. The study reveals different signatures in human, mouse, and zebrafish, highlighting that some features are shared among species, while others tend to be species-specific. Compared to coding potential tools and similar supervised approaches, including novel signatures, such as those identified here, in a machine learning algorithm improves the prediction performance, in terms of area under precision and recall curve, by 1 to …", "num_citations": "23\n", "authors": ["201"]}
{"title": "Detection of statistically significant network changes in complex biological networks\n", "abstract": " Biological networks contribute effectively to unveil the complex structure of molecular interactions and to discover driver genes especially in cancer context. It can happen that due to gene mutations, as for example when cancer progresses, the gene expression network undergoes some amount of localized re-wiring. The ability to detect statistical relevant changes in the interaction patterns induced by the progression of the disease can lead to the discovery of novel relevant signatures. Several procedures have been recently proposed to detect sub-network differences in pairwise labeled weighted networks. In this paper, we propose an improvement over the state-of-the-art based on the Generalized Hamming Distance adopted for evaluating the topological difference between two networks and estimating its statistical significance. The proposed procedure exploits a more effective model selection criteria to generate p-values for statistical significance and is more efficient in terms of computational time and prediction accuracy than literature methods. Moreover, the structure of the proposed algorithm allows for a faster parallelized implementation. In the case of dense random geometric networks the proposed approach is 10-15x faster and achieves 5-10% higher AUC, Precision/Recall, and Kappa value than the state-of-the-art. We also report the application of the method to dissect the difference between the regulatory networks of IDH-mutant versus IDH-wild-type glioma cancer. In such a case our method is able to identify some recently reported master regulators as well as novel important candidates. We show that our network differencing …", "num_citations": "23\n", "authors": ["201"]}
{"title": "Jimpa: An eclipse plug-in for impact analysis\n", "abstract": " Impact analysis is the identification of the work products affected by a proposed change request, either a bug fix or a new feature demand. Jimpa is a plug-in for Eclipse that implements an impact analysis approach based on data stored in software repositories, such as CVS and Bugzilla. Plug-in architecture and functionalities are presented", "num_citations": "22\n", "authors": ["201"]}
{"title": "How crosscutting concerns evolve in JHotDraw\n", "abstract": " Programmers tend to isolate concerns in source code as a way to achieve a clearer visualization of scattered and tangled code. Thus, a crosscutting concern can be well represented as the set of tangled and scattered lines of code across the system. With such model, we found that crosscutting concerns are first inserted in the system and then maintained through a set of changes performed exclusively for those concerns. Versioned software systems provide a huge amount of historical data regarding source code changes. We use a fine grained analysis method of CVS repositories to observe the evolution of three crosscutting concerns, Observer, Persistence, and Undo, in JHotDraw. Analyzing the history of crosscutting concerns gives us the opportunity to better understand their nature, which helps in developing and evaluating new aspect mining techniques", "num_citations": "22\n", "authors": ["201"]}
{"title": "Transcriptional regulatory networks of tumor-associated macrophages that drive malignancy in mesenchymal glioblastoma\n", "abstract": " Glioblastoma (GBM) is a complex disease with extensive molecular and transcriptional heterogeneity. GBM can be subcategorized into four distinct subtypes; tumors that shift towards the mesenchymal phenotype upon recurrence are generally associated with treatment resistance, unfavorable prognosis, and the infiltration of pro-tumorigenic macrophages. We explore the transcriptional regulatory networks of mesenchymal-associated tumor-associated macrophages (MA-TAMs), which drive the malignant phenotypic state of GBM, and identify macrophage receptor with collagenous structure (MARCO) as the most highly differentially expressed gene. MARCOhigh TAMs induce a phenotypic shift towards mesenchymal cellular state of glioma stem cells, promoting both invasive and proliferative activities, as well as therapeutic resistance to irradiation. MARCOhigh TAMs also significantly accelerate tumor engraftment and growth in vivo. Moreover, both MA-TAM master regulators and their target genes are significantly correlated with poor clinical outcomes and are often associated with genomic aberrations in neurofibromin 1 (NF1) and phosphoinositide 3-kinases/mammalian target of rapamycin/Akt pathway (PI3K-mTOR-AKT)-related genes. We further demonstrate the origination of MA-TAMs from peripheral blood, as well as their potential association with tumor-induced polarization states and immunosuppressive environments. Collectively, our study characterizes the global transcriptional profile of TAMs driving mesenchymal GBM pathogenesis, providing potential therapeutic targets for improving the effectiveness of GBM immunotherapy.", "num_citations": "20\n", "authors": ["201"]}
{"title": "Identification of a novel gene signature of ES cells self-renewal fluctuation through system-wide analysis\n", "abstract": " Embryonic Stem cells (ESCs) can be differentiated into ectoderm, endoderm, and mesoderm derivatives, producing the majority of cell types. In regular culture conditions, ESCs' self-renewal is maintained through molecules that inhibit spontaneous differentiation enabling long-term cellular expansion. This undifferentiating condition is characterized by multiple metastable states that fluctuate between self-renewal and differentiation balance. Here, we aim to characterize the high-pluripotent ESC metastate marked by the expression of Zscan4 through a supervised machine learning framework based on an ensemble of support vector machine (SVM) classifiers. Our study revealed a leukaemia inhibitor factor (Lif) dependent not-canonical pluripotency signature (AF067063, BC061212, Dub1, Eif1a, Gm12794, Gm13871, Gm4340, Gm4850, Tcstv1/3, and Zfp352), that specifically marks Zscan4 ESCs' fluctuation. This novel ESC metastate is enhanced by high-pluripotency culture conditions obtained through Extracellular signal Regulated-Kinase (ERK) and Glycogen synthase kinase-3 (Gsk-3) signaling inhibition (2i). Significantly, we reported that the conditional ablation of the novel ESC metastate marked by the expression of Gm12794 is required for ESCs self-renewal maintenance. In conclusion, we extend the comprehension of ESCs biology through the identification of a novel molecular signature associated to pluripotency programming.", "num_citations": "18\n", "authors": ["201"]}
{"title": "Detection of long non–coding RNA homology, a comparative study on alignment and alignment–free metrics\n", "abstract": " Long non-coding RNAs (lncRNAs) represent a novel class of non-coding RNAs having a crucial role in many biological processes. The identification of long non-coding homologs among different species is essential to investigate such roles in model organisms as homologous genes tend to retain similar molecular and biological functions. Alignment–based metrics are able to effectively capture the conservation of transcribed coding sequences and then the homology of protein coding genes. However, unlike protein coding genes the poor sequence conservation of long non-coding genes makes the identification of their homologs a challenging task. In this study we compare alignment–based and alignment–free string similarity metrics and look at promoter regions as a possible source of conserved information. We show that promoter regions encode relevant information for the conservation of long non-coding …", "num_citations": "17\n", "authors": ["201"]}
{"title": "Emerging insight into MAPK inhibitors and immunotherapy in colorectal cancer\n", "abstract": " Our understanding of the genetic and non-genetic molecular alterations associated with colorectal cancer (CRC) progression and therapy resistance has markedly expanded in the recent years. In addition to their effects on tumor biology, targeted therapies can have effects on host immune responses. However, the mechanisms by which immune cells organize tumor microenvironments to regulate T-cell activity need to be comprehensively defined. There is good evidence in the literature that alterations in different members of the MAPK superfamily (mainly ERKs and p38 MAPKs) modify the inflammatory response and antitumor immunity, enhancing metastatic features of the tumors. In addition, a plethora of alterations that emerge at relapse often converge on the activation of MAPKs, particularly, ERKs, which act in concert with other oncogenic signals to modulate cellular homeostasis and clonal evolution during …", "num_citations": "17\n", "authors": ["201"]}
{"title": "Topic-driven semi-automatic reorganization of online discussion forums: A case study in an e-learning context\n", "abstract": " Online discussion forums represent, nowadays, one of the main asynchronous communication means and information sources over the Internet. The forum paradigm is adopted by the most followed websites, such as social networks and blogs. The effectiveness of discussion forums as information source, i.e., the capability to satisfy their users' information needs, depends on their information richness first, but also on how their are organized and effectively moderated. Forums organized and moderated by topics of discussion tend to host messages on related subjects and, overall, provide a classification of message threads which eases information search. In this paper we propose a semi-automatic approach to detect topics of discussion in a forum and to enhance its organization by providing a hierarchical topic-driven navigation view on its messages. We adopt Information Retrieval (IR) techniques, such as topic …", "num_citations": "15\n", "authors": ["201"]}
{"title": "A map of tumor–host interactions in glioma at single-cell resolution\n", "abstract": " Background           Single-cell RNA sequencing is the reference technique for characterizing the heterogeneity of the tumor microenvironment. The composition of the various cell types making up the microenvironment can significantly affect the way in which the immune system activates cancer rejection mechanisms. Understanding the cross-talk signals between immune cells and cancer cells is of fundamental importance for the identification of immuno-oncology therapeutic targets.                             Results           We present a novel method, single-cell Tumor–Host Interaction tool (scTHI), to identify significantly activated ligand–receptor interactions across clusters of cells from single-cell RNA sequencing data. We apply our approach to uncover the ligand–receptor interactions in glioma using 6 publicly available human glioma datasets encompassing 57,060 gene expression profiles from 71 patients. By …", "num_citations": "13\n", "authors": ["201"]}
{"title": "JAK/Stat5-mediated subtype-specific lymphocyte antigen 6 complex, locus G6D (LY6G6D) expression drives mismatch repair proficient colorectal cancer\n", "abstract": " Human microsatellite-stable (MSS) colorectal cancers (CRCs) are immunologically “cold” tumour subtypes characterized by reduced immune cytotoxicity. The molecular linkages between immune-resistance and human MSS CRC is not clear. We used transcriptome profiling, in silico analysis, immunohistochemistry, western blot, RT-qPCR and immunofluorescence staining to characterize novel CRC immune biomarkers. The effects of selective antagonists were tested by in vitro assays of long term viability and analysis of kinase active forms using anti-phospho antibodies. We identified the lymphocyte antigen 6 complex, locus G6D (LY6G6D) as significantly overexpressed (around 15-fold) in CRC when compared with its relatively low expression in other human solid tumours. LY6G6D up-regulation was predominant in MSS CRCs characterized by an enrichment of immune suppressive regulatory T-cells and a limited repertoire of PD-1/PD-L1 immune checkpoint receptors. Coexpression of LY6G6D and CD15 increases the risk of metastatic relapse in response to therapy. Both JAK-STAT5 and RAS-MEK-ERK cascades act in concert as key regulators of LY6G6D and Fucosyltransferase 4 (FUT4), which direct CD15-mediated immune-resistance. Momelotinib, an inhibitor of JAK1/JAK2, consistently abrogated the STAT5/LY6G6D axis in vitro, sensitizing MSS cancer cells with an intact JAK-STAT signaling, to efficiently respond to trametinib, a MEK inhibitor used in clinical setting. Notably, colon cancer cells can evade JAK2/JAK1-targeted therapy by a reversible shift of the RAS-MEK-ERK pathway activity, which explains the treatment failure of JAK1 …", "num_citations": "13\n", "authors": ["201"]}
{"title": "Retinoic acid induces embryonic stem cells (ESCs) transition to 2 cell-like state through a coordinated expression of Dux and Duxbl1\n", "abstract": " Embryonic stem cells (ESCs) are derived from inner cell mass (ICM) of blastocyst. In serum/LIF culture condition, they show variable expression of pluripotency genes that mark cell fluctuation between pluripotency and differentiation metastate. The ESCs subpopulation marked by zygotic genome activation gene (ZGA) signature, including Zscan4, retains a wider differentiation potency than epiblast-derived ESCs. We have recently shown that retinoic acid (RA) significantly enhances Zscan4 cell population. However, it remains unexplored how RA initiates the ESCs to 2-cell like reprogramming. Here we found that RA is decisive for ESCs to 2C-like cell transition, and reconstructed the gene network surrounding Zscan4. We revealed that RA regulates 2C-like population co-activating Dux and Duxbl1. We provided novel evidences that RA dependent ESCs to 2C-like cell transition is regulated by Dux, and antagonized by Duxbl1. Our suggested mechanism could shed light on the role of RA on ESC reprogramming.", "num_citations": "12\n", "authors": ["201"]}
{"title": "Selection of negative examples in learning gene regulatory networks\n", "abstract": " Supervised learning methods have been recently exploited to learn gene regulatory networks from gene expression data. They consist of building a binary classifier from feature vectors composed by expression levels of a set of known regulatory connections, available in public databases (eg. RegulonDB, TRRD, Transfac, IPA), and using such a classifier to predict new unknown connections. The input to a binary supervised classifier consists normally of positive and negative examples, but usually the only available information are a partial set of gene regulations, i.e. positive examples, and unlabeled data which could include both positive and negative examples. A fundamental challenge is the choice of negative examples from such unlabeled data to make the classifier able to learn from data. We exploit the known topology of a gene network to select such negative examples and show whether such an …", "num_citations": "12\n", "authors": ["201"]}
{"title": "On the use of process trails to understand software development\n", "abstract": " Software repositories, such as version control systems (CVS) and bug-tracking systems (Bugzilla), provide useful information about software process trails left by developers during the evolution of a software project. Mining these repositories provides a way to understand software development, to support predictions about software development, and to plan various aspects of software projects. We introduce three cases in the areas of impact analysis, change request assignment, and crosscutting concern mining, that takes benefit from historical information and show that the combination of different type of analyses can improve the performance of these software engineering models", "num_citations": "12\n", "authors": ["201"]}
{"title": "A visual approach to define xml to fo transformations\n", "abstract": " XML is the most influential standard for data exchange and Web presentation. The power of XML derives from the fact that the aspects of structuring, representing and visualizing a piece of information are handled independently with specific tools. In this article we deal with the information visualization aspect, which in XML is managed through XSLT transformations, and propose a visual approach to define XML to FO transformations. The approach has been implemented in a graphical environment that eases the definition of the format and visualization of XML documents by means of a graphicalcontent/container metaphor.", "num_citations": "8\n", "authors": ["201"]}
{"title": "A review of COVID-19 biomarkers and drug targets: resources and tools\n", "abstract": " The stratification of patients at risk of progression of COVID-19 and their molecular characterization is of extreme importance to optimize treatment and to identify therapeutic options. The bioinformatics community has responded to the outbreak emergency with a set of tools and resource to identify biomarkers and drug targets that we review here. Starting from a consolidated corpus of 27 570 papers, we adopt latent Dirichlet analysis to extract relevant topics and select those associated with computational methods for biomarker identification and drug repurposing. The selected topics span from machine learning and artificial intelligence for disease characterization to vaccine development and to therapeutic target identification. Although the way to go for the ultimate defeat of the pandemic is still long, the amount of knowledge, data and tools generated so far constitutes an unprecedented example of global …", "num_citations": "7\n", "authors": ["201"]}
{"title": "An experience of fuzzy linear regression applied to effort estimation\n", "abstract": " An Experience of Fuzzy Linear Regression applied to Effort Estimation IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS Archivio della ricerca dell'Università degli studi del Sannio Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno An Experience of Fuzzy Linear Regression applied to Effort Estimation Italiano Italiano English An Experience of Fuzzy Linear Regression applied to Effort Estimation / Canfora, G; Cerulo, Luigi; Troiano, Luigi. - (2004). Scheda breve Scheda completa Titolo: An Experience of Fuzzy Linear Regression applied to Effort Estimation Autori interni: CANFORA, Gerardo CERULO, Luigi TROIANO, LUIGI Data di pubblicazione: 2004 Handle: http://hdl.handle.net/20.500./10752 Appare nelle tipologie: 4.1 Contributo in Atti di convegno File in questo prodotto: ci . …", "num_citations": "7\n", "authors": ["201"]}
{"title": "Deep learning predicts short non-coding RNA functions from only raw sequence data\n", "abstract": " Small non-coding RNAs (ncRNAs) are short non-coding sequences involved in gene regulation in many biological processes and diseases. The lack of a complete comprehension of their biological functionality, especially in a genome-wide scenario, has demanded new computational approaches to annotate their roles. It is widely known that secondary structure is determinant to know RNA function and machine learning based approaches have been successfully proven to predict RNA function from secondary structure information. Here we show that RNA function can be predicted with good accuracy from a lightweight representation of sequence information without the necessity of computing secondary structure features which is computationally expensive. This finding appears to go against the dogma of secondary structure being a key determinant of function in RNA. Compared to recent secondary structure based methods, the proposed solution is more robust to sequence boundary noise and reduces drastically the computational cost allowing for large data volume annotations. Scripts and datasets to reproduce the results of experiments proposed in this study are available at: https://github.com/bioinformatics-sannio/ncrna-deep.", "num_citations": "6\n", "authors": ["201"]}
{"title": "Measuring XML document similarity: a case study for evaluating information extraction systems\n", "abstract": " Measuring similarity between trees, such as XML structured information, has an important role in many applications, and in particular in the evaluation of the effectiveness of information extraction systems (IES). In this paper we present an experience in evaluating the effectiveness of IES in terms of extraction and adaptation effectiveness. In the first part of the paper a similarity measure between XML trees based on a common subtree detection algorithm is introduced; then, a case study aimed at the evaluation of the effectiveness of a group of IES is presented as an example of application.", "num_citations": "6\n", "authors": ["201"]}
{"title": "Can fuzzy mathematics enrich the assessment of software maintainability?\n", "abstract": " Software maintainability depends both on qualitative and quantitative data. Existing maintainability models aggregate data into hierarchies of characteristics with given dependencies. However, data used to score the characteristics can be uncertain or even completely unknown. Therefore, it would be meaningful to evaluate sensitivity of the aggregated result, ie the maintainability, with respect to the uncertainty and incompleteness of data. In addition, real cases require an aggregation model able to evaluate the impact of changing the dependencies among the characteristics in the hierarchy on the maintainability. In this paper we argue that fuzzy mathematics can help to solve these problems. In particular, we show how a fuzzy aggregation model can be adopted to evaluate maintainability according to a hierarchical model.", "num_citations": "6\n", "authors": ["201"]}
{"title": "Transforming quantities into qualities in assessment of software systems\n", "abstract": " The assessment of software systems often requires to consider together qualitative and quantitative aspects. Because of the different nature, measures belong to different domains. The main problem is to aggregate such information into a derived measure able to provide an overall estimation. This problem has been traditionally solved trough the transformation of qualitative assessments into quantitative measures. Indeed, such a transformation implicitly assumes a conceptual equivalence between the terms quantitative and objective on one side, and qualitative and subjective on the other side. An alternative approach is to consider logical aggregation models, able to infer the overall evaluation based on the assessment of individual attributes. This approach requires an early transformation of quantitative measures in qualitative assessments. Such a transformation is possible trough the use of judgment functions …", "num_citations": "6\n", "authors": ["201"]}
{"title": "A negative selection heuristic to predict new transcriptional targets\n", "abstract": " Supervised machine learning approaches have been recently adopted in the inference of transcriptional targets from high throughput trascriptomic and proteomic data showing major improvements from with respect to the state of the art of reverse gene regulatory network methods. Beside traditional unsupervised techniques, a supervised classifier learns, from known examples, a function that is able to recognize new relationships for new data. In the context of gene regulatory inference a supervised classifier is coerced to learn from positive and unlabeled examples, as the counter negative examples are unavailable or hard to collect. Such a condition could limit the performance of the classifier especially when the amount of training examples is low. In this paper we improve the supervised identification of transcriptional targets by selecting reliable counter negative examples from the unlabeled set. We introduce an …", "num_citations": "5\n", "authors": ["201"]}
{"title": "A tool for Decision Support implementing OFNWA approach: a case study\n", "abstract": " A Tool for Decision Support Implementing OFNWA Approach: A Case Study IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS Archivio della ricerca dell'Università degli studi del Sannio Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno A Tool for Decision Support Implementing OFNWA Approach: A Case Study Italiano Italiano English A Tool for Decision Support Implementing OFNWA Approach: A Case Study / Canfora, G; Cerulo, Luigi; Rosa, Preziosi; Troiano, Luigi. - (2003). Scheda breve Scheda completa Titolo: A Tool for Decision Support Implementing OFNWA Approach: A Case Study Autori interni: CANFORA, Gerardo CERULO, Luigi TROIANO, LUIGI mostra contributor esterni Data di pubblicazione: 2003 Handle: http://hdl.handle.net/20.500./10754 Appare nelle : 4.1 in …", "num_citations": "5\n", "authors": ["201"]}
{"title": "Infer gene regulatory networks from time series data with formal methods\n", "abstract": " Reverse engineering of regulatory relationships from genomics data is emerging as crucial to dissect the complex underlying regulatory mechanism occurring in a cell. In this paper we propose a novel reverse engineering algorithm that makes use of formal methods, usually adopted in engineering to specify and verify concurrent software and hardware systems. With a formal specification of gene regulatory hypotheses we are able to prove mathematically whether a time course experiment belongs or not to the formal specification, determining in fact whether a gene regulation exists or not. The method is capable to detect both direction and sign (inhibition/activation) of regulations whereas most of literature methods which are limited to undirected and/or unsigned relationships. The method, empirically evaluated on experimental and synthetic datasets, reaches high levels of accuracy, outperforming literature …", "num_citations": "4\n", "authors": ["201"]}
{"title": "Where is bug resolution knowledge stored?\n", "abstract": " ArgoUML uses both CVS and Bugzilla to keep track of bug-fixing activities since 1998. A common practice is to reference source code changes resolving a bug stored in Bugzilla by inserting the id number of the bug in the CVS commit notes. This relationship reveals useful to predict code entities impacted by a new bug report. In this paper we analyze ArgoUML software repositories with a tool, we have implemented, showing what are Bugzilla fields that better predict such impact relationship, that is where knowledge about bug resolution is stored.", "num_citations": "4\n", "authors": ["201"]}
{"title": "Circulating microRNAs expression profile in newly diagnosed and imatinib treated chronic phase–chronic myeloid leukemia\n", "abstract": " Chronic myeloid leukemia (CML) is a stem cell derived malignant disorder result of translocation t(9;22)(q34;q11) called Philadelphia chromosome (Ph+). microRNAS (miRNAs) are involved in several biological processes, altering the progression of various pathologies, including CML. This study evaluated whether circulating miRNAs display differential expression profiles in peripheral blood of CML-Chronic Phase (CML-CP) patients newly diagnosed in comparison with CML-CP treated with imatinib. We obtained peripheral blood samples from CML-CP Ph+ patients divided among group 1 (untreated newly diagnosed) and group 2 (treated with imatinib). A pool of total leukocytes from healthy donors was considered as control group. Expression analyses were performed for 768 miRNAs by RT-qPCR array. Bioinformatic tools were used to identify significant pathways and interaction networks. We found 80 …", "num_citations": "3\n", "authors": ["201"]}
{"title": "Centrosome Dynamics and Its Role in Inflammatory Response and Metastatic Process\n", "abstract": " Metastasis is a process by which cancer cells escape from the location of the primary tumor invading normal tissues at distant organs. Chromosomal instability (CIN) is a hallmark of human cancer, associated with metastasis and therapeutic resistance. The centrosome plays a major role in organizing the microtubule cytoskeleton in animal cells regulating cellular architecture and cell division. Loss of centrosome integrity activates the p38-p53-p21 pathway, which results in cell-cycle arrest or senescence and acts as a cell-cycle checkpoint pathway. Structural and numerical centrosome abnormalities can lead to aneuploidy and CIN. New findings derived from studies on cancer and rare genetic disorders suggest that centrosome dysfunction alters the cellular microenvironment through Rho GTPases, p38, and JNK (c-Jun N-terminal Kinase)-dependent signaling in a way that is favorable for pro-invasive secretory phenotypes and aneuploidy tolerance. We here review recent data on how centrosomes act as complex molecular platforms for Rho GTPases and p38 MAPK (Mitogen activated kinase) signaling at the crossroads of CIN, cytoskeleton remodeling, and immune evasion via both cell-autonomous and non-autonomous mechanisms. View Full-Text", "num_citations": "2\n", "authors": ["201"]}
{"title": "An approach to identify mirna associated with cancer altered pathways\n", "abstract": " MicroRNAs play an important role in the regulation of gene expression by binding mRNA targets causing their degradation or blocking their translation. Several genes has been found to be implicated as miRNA targets in different types of malignant tumors suggesting their involvement in cancer pathogenesis. Detecting direct miRNA–targets associations is not straightforward as in principle targets expressions are not altered except when they are completely repressed by the degradation complex.               In this paper we propose an approach to identify direct miRNA–targets associations hypotheses by means of indirect association measures such as mutual information. Indirect regulons of miRNA and Transcription Factors (TFs) are compared with the Fisher’s exact test to identify potential co-regulations which may constitute potential miRNA–TF direct associations.               We apply the method on two …", "num_citations": "2\n", "authors": ["201"]}
{"title": "Labeling negative examples in supervised learning of new gene regulatory connections\n", "abstract": " Supervised learning methods have been recently exploited to learn gene regulatory networks from gene expression data. The basic approach consists into building a binary classifier from feature vectors composed by expression levels of a set of known regulatory connections, available in public databases or known in literature. Such a classifier is then used to predict new unknown connections.               The quality of the training set plays a crucial role in such an inference scheme. In binary classification the training set should be composed of positive and negative examples, but in Biology literature the only collected information is whether two genes interact. Instead, the counterpart information is usually not reported, as Biologists are not aware to state whether two genes are not interacting.               The over presence of topology motifs in currently known gene regulatory networks, such as, feed–forward …", "num_citations": "1\n", "authors": ["201"]}