{"title": "Gamifying learning experiences: Practical implications and outcomes\n", "abstract": " Gamification is the use of game design elements and game mechanics in non-game contexts. This idea has been used successfully in many web based businesses to increase user engagement. Some researchers suggest that it could also be used in web based education as a tool to increase student motivation and engagement. In an attempt to verify those theories, we have designed and built a gamification plugin for a well-known e-learning platform. We have made an experiment using this plugin in a university course, collecting quantitative and qualitative data in the process. Our findings suggest that some common beliefs about the benefits obtained when using games in education can be challenged. Students who completed the gamified experience got better scores in practical assignments and in overall score, but our findings also suggest that these students performed poorly on written assignments and …", "num_citations": "1942\n", "authors": ["1142"]}
{"title": "Análisis y diseño detallado de aplicaciones informáticas de gestión\n", "abstract": " Introducción a los sistemas información; Sistemas de información básicos en las empresas; Ciclo de vida del software; Metodologías de desarrollo de software; Gestión de proyectos software; Análisis de necesidades y estudio de viabilidad; Análisis de sistemas; Diseño estructurado de sistemas; Métrica versión 2.1; Análisis y diseño orientado al objeto", "num_citations": "249\n", "authors": ["1142"]}
{"title": "Active learning through problem based learning methodology in engineering education\n", "abstract": " The main objective of this experience lies on the development of positive learning aptitudes on engineering students. The experience presented in this paper has been carried out with the help of the problem-based learning (PBL) methodology. Solutions of medium-high complexity problems by students make them work on the development of different skills. The teaching model turns into a significant and autonomous learning model where students are conscious of their compromise with this process (learning). The obtained results are a starting point to other authors willing to use active learning methodologies within the framework of engineering degrees. Both lecturers and students involved in the experience have done a positive assessment of the methodology.", "num_citations": "61\n", "authors": ["1142"]}
{"title": "Medición para la gestión en la Ingeniería del Sotware\n", "abstract": " Notas: Capítulo 1. La medición y la experimentación en ingeniería del software.--Capítulo 2. Teoría de la medición del software.--Capítulo 3. Diseño experimental en ingeniería del software.--Capítulo. 4. Medición en la orientación a objetos.--Capítulo 5. Medición de documentación del software.--Capítulo 6. Medición en la reutilización orientada a objetos.--Capítulo 7. Medición en bases de datos.--Capítulo 8. La satisfacción del cliente con los productos y servicios de software Capítulo 9. Gestión de proyectos y simulación.--Capítulo 10. Seguimientos de la ejecución de proyectos.--Capítulo 11. Estimación del tamaño y coste de los proyectos software.--Capítulo 12. Medición y aseguramiento de la calidad del software.--Capítulo 13. Mantenimiento del software desde una perspectiva del proceso.--Capítulo 14. Medidas en el marco del modelo CMM.", "num_citations": "47\n", "authors": ["1142"]}
{"title": "e-Skills Match: A framework for mapping and integrating the main skills, knowledge and competence standards and models for ICT occupations\n", "abstract": " Definition of skills, occupations, professional profiles and similar concepts have been explored in the ICT area since long ago. It has been only recently in Europe when new frameworks and standards have strived in getting a real systematic conceptual map to this challenging and fast evolving field. More precisely, three are the most important references which provide different aspects and approaches to the challenge of creating a common language in the area: e-Competence Framework e-CF (EN 16234-1:2016), ESCO (European Skills, Competences and Occupations classification) and the European ICT BOK. This paper addresses the challenge of studying them with the goal of providing a consistent model covering the different views of the area. This is an essential step to integrate ICT profiles, competences, skill, knowledges and qualifications, keeping both an interlink to the different already existing systems …", "num_citations": "39\n", "authors": ["1142"]}
{"title": "Guía metodológica para la implantación de desarrollos curriculares virtuales accesibles\n", "abstract": " Se permite su copia, distribución y comunicación pública, siempre que se mantenga el reconocimiento de la obra y no se haga uso comercial de ella. Si se transforma o genera una obra derivada, solo se puede distribuir con licencia idéntica a esta.Alguna de estas condiciones puede no aplicarse, si se obtiene el permiso del titular de los derechos de autor. Los permisos que vayan más allá de lo cubierto por esta licencia pueden encontrarse en http://www. esvial. org.", "num_citations": "30\n", "authors": ["1142"]}
{"title": "Métodos de evaluación para las competencias generales más demandadas en el mercado laboral\n", "abstract": " Según las declaraciones de Bolonia [1] y de Bergen [2], el EEES pretende conseguir preparar al estudiante para el mercado laboral, proporcionándole competencias y formándole para una ciudadanía activa. Desde hace tiempo la formaciόn en competencias transversales (también llamadas personales o generales) es una de las nuevas facetas que debe afrontar la educaciόn universitaria. Pero¢ qué competencias se deben desarrollar?,¢ cόmo hacerlo? y¢ cόmo medir (evaluar) el nivel de competencia alcanzado? En este trabajo se estudiarán las demandas de competencias para los egresados en Informática, a partir de los datos obtenidos del análisis de ofertas de empleo publicadas en los principales periόdicos nacionales, y la evoluciόn que estos datos han sufrido a lo largo de los últimos años. Además se detallarán las características de las competencias más demandadas, a fin de esbozar posibles herramientas para desarrollarlas y evaluarlas en el alumnado, para terminar analizando los resultados de la implantaciόn de la evaluaciόn de competencias en un grupo de asignaturas técnicas.", "num_citations": "27\n", "authors": ["1142"]}
{"title": "Guía de aplicación de la Norma UNE-ISO/IEC 27001 sobre seguridad en sistemas de información para pymes\n", "abstract": " La información es el principal activo de muchas organizaciones y precisa ser protegida adecuadamente frente a amenazas que puedan poner en peligro la continuidad del negocio.En la actualidad, las empresas de cualquier tipo o sector de actividad se enfrentan cada vez más con riesgos e inseguridades procedentes de una amplia variedad de contingencias, las cuales pueden dañar considerablemente tanto los sistemas de información como la información procesada y almacenada.", "num_citations": "26\n", "authors": ["1142"]}
{"title": "Personal skills for computing professionals\n", "abstract": " In this paper, the issues regarding computing professionals and their personal skill required in industry is discussed. A study commissioned by a Spanish private university analyzed the social and organizational image of professional graduates in various fields. This study found that computing people tend to be considered technically competent and efficient, but were seen as outliers in the game of influence within their organization. They typically work in places close to data processing centers, far away from the luxurious offices of top management. In general, human resources specialists tend to believe that computing people must improve their interpersonal competence. In the area of human resources, competencies management has been the rage for the past several years. This approach highlights general personal skills as the key for success in any discipline of the professional world. Different studies have …", "num_citations": "23\n", "authors": ["1142"]}
{"title": "Factors with negative influence on software testing practice in Spain: A survey\n", "abstract": " Software testing is the commonest technique for software quality assurance. It is present in every development project and concentrates a large percentage of effort, there are still not many studies which address the real practice of individuals and organizations. Anyway, practitioners usually agree with the idea that software testing efficiency and effectiveness in their organizations might be improved. Two previous studies in Spain have revealed implemented testing practices in organizations and individual performance of software professionals when designing test cases should be improved. This paper presents the results of a survey designed to know if 23 factors determined by a panel of experts in 2007 may explain this situation of testing practice. Data collected reveal that none of the factors is clearly rejected as a negative influence for testing although some of them are not generally accepted …", "num_citations": "23\n", "authors": ["1142"]}
{"title": "Métodos de evaluación para las competencias generales más demandadas en el mercado laboral\n", "abstract": " Según las declaraciones de Bolonia y de Bergen, el EEES pretende conseguir preparar al estudiante para el mercado laboral, proporcionándole competencias y formándole para una ciudadanía activa. Desde hace tiempo la formación en competencias transversales (también llamadas personales o generales) es una de las nuevas facetas que debe afrontar la educación universitaria. Pero ¿qué competencias se deben desarrollar?, ¿cómo hacerlo? y ¿cómo medir (evaluar) el nivel de competencia alcanzado? En este trabajo se estudiarán las demandas de competencias para los egresados en Informática, a partir de los datos obtenidos del análisis de ofertas de empleo publicadas en los principales periódicos nacionales, y la evolución que estos datos han sufrido a lo largo de los últimos años. Además se detallarán las características de las competencias más demandadas, a fin de esbozar posibles herramientas para desarrollarlas y evaluarlas en el alumnado, para terminar analizando los resultados de la implantación de la evaluación de competencias en un grupo de asignaturas técnicas.", "num_citations": "22\n", "authors": ["1142"]}
{"title": "Un sondeo sobre la práctica actual de pruebas de software en España\n", "abstract": " Las pruebas representan una actividad fundamental en el desarrollo de software y, en muchos casos, suponen prácticamente el único medio empleado en los proyectos para la verificación y validación del software. Existen estudios de ámbito internacional sobre las prácticas reales de pruebas en proyectos de la industria y también análisis generales del conjunto de procesos de software, no se localizan estudios específicos sobre las pruebas del software en el ámbito español. En este artículo se presentan los resultados de las encuestas realizadas en los últimos años a profesionales del desarrollo de aplicaciones y sistemas sobre la aplicación real de las pruebas en su práctica diaria.", "num_citations": "22\n", "authors": ["1142"]}
{"title": "Gestión de riesgos en proyectos de desarrollo de software en España: estudio de la situación\n", "abstract": " El software es en nuestros días un elemento crítico en todos los sistemas. El desarrollo y la puesta en marcha de programas de ordenador están sujetos a numerosos riesgos que deben ser objeto de una gestión cuidadosa. La gestión de riesgos en proyectos de software es una actividad reglada en múltiples metodologías pero que en la práctica se aplica de forma muy desigual en los distintos equipos de trabajo y organizaciones. Un primer estudio llevado a cabo entre desarrolladores españoles revela un interés por la gestión de riesgos y sus técnicas, pero también serias carencias en su aplicación y algunas actitudes que no favorecen a esta disciplina. Estos datos preliminares constituyen una base para profundizar con más detalle en la práctica de gestión de riesgos en software y para plantear soluciones más eficaces en dicha gestión.", "num_citations": "17\n", "authors": ["1142"]}
{"title": "Empirical support for the generation of domain-oriented quality models\n", "abstract": " The difficulties of software quality evaluation found during our activity in different projects and publications led us to investigate a systematic method for building domain-oriented quality models based on a sound empirical basis. General quality models need to be adapted to specific types of software products to be effective. Related literature reveals that existing quality models tend to suffer from poor empirical support. To overcome this situation, a review of applicable existing standards and related literature has enabled the generation of a basis for software quality models which can be adapted to specific application domains. The process, called DUMOD (domain-oriented quality models development), includes the collection of experts' opinions and the application of multivariate analysis techniques in order to eliminate redundant information and construct a validated model, more efficient and reliable. In this study …", "num_citations": "16\n", "authors": ["1142"]}
{"title": "Accessible platforms for e‐learning: A case study\n", "abstract": " This paper presents a technical solution to improve accessibility in e‐learning platforms. The guidelines for the solution were concluded from the analysis of literature with the goal of achieving scalable, reusable, and easily manageable platforms. The method has been tested through a case study conducted on Moodle where a sample of the target population experimented it through several Engineering Education courses resulting in a high degree of perceived usefulness. We also found out that deaf students encountered less problems accessing the information than blind students due to different reasons.", "num_citations": "14\n", "authors": ["1142"]}
{"title": "Developing domain-ontologies to improve sofware engineering knowledge\n", "abstract": " Ontologies in the Software Engineering domain can improve the acquisition of knowledge in this field by providing a formal representation of this knowledge domain. When encoded in a XML-based format, ontologies can therefore be easily processed by a knowledge management system, an expert system or a browser so it is possible to facilitate the location of Software Engineering resources in repositories or in the Semantic Web. This article presents two ontologies related to the domain of Software Engineering: a global ontology created from the IEEE Glossary of Software Engineering and a specific ontology created to conceptualize the knowledge about CMMI Systems Engineering/Software Engineering (staged) specification. These ontologies are now being used in objects semantic repositories for software engineering e-learning courses as well as support for application of CMMI certification.", "num_citations": "14\n", "authors": ["1142"]}
{"title": "Analysis of non technical skills for ICT profiles\n", "abstract": " Traditional conception of ICT education and employment analysis has devoted a great effort to determine specific technical knowledge and skills needed for a successful professional career. However, competency-based approach for Human Resources (HR) management in organizations has finally changed this approach pushing more interest in non technical skills, the so-called soft skills. This paper presents an analysis of non technical skills required for a variety of IT (Information Technology) positions and areas based on data extracted from more than 3000 ICT job offers published in Spain during the last years. Requirements are also compared with those expressed as requirements for telco engineers and industrial engineers. We can conclude that soft skills profiles are different for each case and that these data should guide actions in education and career development areas.", "num_citations": "14\n", "authors": ["1142"]}
{"title": "Enhancing input value selection in parametric software cost estimation models through second level cost drivers\n", "abstract": " Parametric cost estimation models are widely used effort prediction tools for software development projects. These models are based on mathematical models that use as inputs specific values for relevant cost drivers. The selection of these inputs is, in many cases, driven by public prescriptive rules that determine the selection of the values. Nonetheless, such selection may in some cases be restrictive and somewhat contradictory with empirical evidence, in other cases the selection procedure is somewhat subject to ambiguity. This paper presents an approach to improve the quality of the selection of adequate cost driver values in parametric models through a process of adjustment to bodies of empirical evidence. The approach has two essential elements. Firstly, it proceeds by analyzing the diverse factors potentially affecting the values a cost driver input might adopt for a given project. And secondly, an …", "num_citations": "14\n", "authors": ["1142"]}
{"title": "Modelos de madurez de la enseñanza virtual¿ Consideran la accesibilidad\n", "abstract": " En este artículo se define qué es un modelo de madurez, para qué sirve y se identifican y describen los modelos de madurez más relevantes en la enseñanza virtual así como los criterios básicos con los que fueron evaluados dichos modelos. Se hace mas hincapié en el modelo eMM y se muestran los resultados de tres talleres con eMM que se realizaron con la intención de recuperar un conjunto de factores claves que contribuyan en el empleo eficaz de tecnologías de enseñanza virtual y pedagogías por parte de las instituciones. Sobre esos modelos estudiados se plantea si es necesario que explícitamente consideren la accesibilidad.", "num_citations": "12\n", "authors": ["1142"]}
{"title": "Opinión de los profesionales TIC acerca de la formación y las certificaciones personales\n", "abstract": " Opinión de los profesionales TIC acerca de la formación y las certificaciones personales - Dialnet Ir al contenido Dialnet Buscar Revistas Tesis Congresos Ayuda Opinión de los profesionales TIC acerca de la formación y las certificaciones personales Autores: María José García García, Luis Fernández Sanz Localización: Novática: Revista de la Asociación de Técnicos de Informática, ISSN 0211-2124, Nº. , 2007, págs. 32-39 Idioma: español Texto completo no disponible (Saber más ...) Fundación Dialnet Acceso de usuarios registrados Imagen de identificación Identificarse ¿Olvidó su contraseña? ¿Es nuevo? Regístrese Ventajas de registrarse Dialnet Plus Más información sobre Dialnet Plus Opciones de compartir Facebook Twitter Opciones de entorno Sugerencia / Errata © 2001-2021 Fundación Dialnet · Todos los derechos reservados Dialnet Plus Accesibilidad Aviso Legal Coordinado por: Fundación Dialnet I…", "num_citations": "11\n", "authors": ["1142"]}
{"title": "Requisistos para el empleo en Nuevas Tecnologías de la Información: el estudio RENTIC\n", "abstract": " Requisistos para el empleo en Nuevas Tecnologías de la Información: el estudio RENTIC - Dialnet Ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda Buscar Consultar la ayuda Ir al contenido Dialnet Buscar Revistas Tesis Congresos Ayuda Requisistos para el empleo en Nuevas Tecnologías de la Información: el estudio RENTIC Autores: Luis Fernández Sanz Localización: Novática: Revista de la Asociación de Técnicos de Informática, ISSN 0211-2124, Nº. , 2003, págs. 51-56 Idioma: español Texto completo no disponible (Saber más ...) Dialnet Métricas : 1 Cita Fundación Dialnet Acceso de usuarios registrados Imagen de identificación Identificarse ¿Olvidó su contraseña? ¿Es nuevo? Regístrese Ventajas de registrarse Dialnet Plus Más información sobre Dialnet Plus Opciones de compartir Facebook Twitter Opciones de entorno Sugerencia / Errata © 2001-2021 Fundación Dialnet · Todos los derechos …", "num_citations": "11\n", "authors": ["1142"]}
{"title": "On self-adaptation in systems-of-systems\n", "abstract": " Adaptivity and systems-of-systems (SoS) have always had a close relationship, as it is one of their defining features. Moreover, there is a clear similarity between the requirements of a SoS and those of many adaptive systems, such as autonomic and self-adaptive systems. In recent years, this kind of adaptive systems has been carefully studied; however, they often operate at a very different scale, being smaller than a typical SoS. The common nexus between both perspectives seem to be situated at the architectural level: the same adaptive techniques are recursively applied in different strata in a hierarchical composite. Therefore, the principles embodied in adaptive architectures seem to provide a good basis for the definition and description of SoS. This paper relates those principles to the corresponding structures in software evolution, and suggests to coordinate both through a pace layering strategy.", "num_citations": "10\n", "authors": ["1142"]}
{"title": "20Relationships among relational coordination dimensions: Impact on the quality of education online with a structural equations model\n", "abstract": " Online education is quite often applied to university systems. This kind of education does not present scheduled restrictions to students and provides additional flexibility to the learning process. This together with the improvements provided by the application of information and communications technology (ICT) in higher education online systems allows them to reach higher degrees of the coordination and integration of processes by improving the competitiveness and research capacity of these organizations. Relational coordination is a validated tool for measuring and analyzing the quality of communication and relationships amongst participants of any process by considering functional organizational boundaries. The goal of this study is the analysis of the relationship between the relational coordination and the quality of online education systems at universities. A questionnaire has been built and distributed to …", "num_citations": "8\n", "authors": ["1142"]}
{"title": "Sobre la crónica real en el siglo XV. Un nuevo manuscrito de la Refundición del Halconero\n", "abstract": " El hallazgo de un fragmento manuscrito de la denominada “Refundición de la Crónica del Halconero”, atribuida a Lope de Barrientos, permite reconstruir el proceso de composición de la crónica real en el siglo XV y sus implicaciones políticas. A partir de un minucioso análisis textual, se concluye que es copia del borrador que sirvió de base para la “Refundición”. Las relaciones textuales con otras crónicas del reinado de Juan II permiten deducir que, en una primera fase compositiva, se ensamblaban las diversas fuentes, respetando incluso su literalidad; en una fase posterior se pulía el estilo y, junto a las modificaciones formales o de estilo, se incluían otras que responden a una clara intención política.", "num_citations": "8\n", "authors": ["1142"]}
{"title": "Proposal for a maintenance management system in industrial environments based on ISO 9001 and ISO 14001 standards\n", "abstract": " This paper presents an effort to improve the quality of processes and products by the definition of the foundations of Maintenance Management Systems based on ISO standards that could help companies to strength the organization of work. We applied the Design Science Research methodology. Finally developing two prototypes which were implanted in different companies. With information gathered along the process, we can offer a system's design which can be adopted by companies to help om maintenance management tasks and serves as a base to carry out internal audit tasks.", "num_citations": "7\n", "authors": ["1142"]}
{"title": "Evaluación de la legibilidad de webs de universidades\n", "abstract": " Para conseguir un acceso universal a productos y servicios en la sociedad de la información, que pretende conseguir una Red para todos, hay que garantizar la legibilidad de las páginas web. Se describe un trabajo llevado a cabo para evaluar la legibilidad de contenidos textuales de los portales web de las 20 universidades más importantes del mundo y de las 20 más importantes de España, según rankings internacionales, con el objetivo de comprobar si tienen páginas legibles. Se han aplicado diferentes fórmulas matemáticas que evalúan la dificultad sintáctica de un texto, en los idiomas inglés y español.", "num_citations": "7\n", "authors": ["1142"]}
{"title": "Software quality evaluation for security COTS products\n", "abstract": " Increasing demand for security commercial products requires an improvement of methods for evaluating their software quality. Existing standards offer general frameworks but more specific models which reflect the perception of experts and customers as well as the particular characteristics of this type of products are needed. This article presents a method for generating domain-oriented software quality models for specific types of applications. It is applied to the generation of a model for security COTS products based on systematic review of standards, related literature and conclusions of evaluation experiences as well as the statistical analysis of information collected from 203 security experts and practitioners. Results reveal interesting conclusions on the importance given by users to the different quality characteristics of security commercial software products.", "num_citations": "7\n", "authors": ["1142"]}
{"title": "Software operation time evaluation based on MTM\n", "abstract": " Many usability approaches have been devised to enable software developers to evaluate and improve user interfaces. Techniques have been focused on design recommendations not always supported by empirical evidences. However, in different environments based on Internet/web browser access, software applications are the support for repetitive tasks (in many cases supporting industrial or engineering processes, e.g. hosted in Intranets) where operation time and learning curve are important items to be controlled. In this paper, a new method for measuring required operation time as basis for improving interaction and interface design is presented. The basis of the method has been inspired on the adaptation of the well-known MTM method for time measurement and task analysis in industrial environments. Empirical evidences support the relationship between the proposed measure and the time required for …", "num_citations": "7\n", "authors": ["1142"]}
{"title": "Highlighting teamwork benefits for computing students and professionals\n", "abstract": " Teamwork ability is considered as one of the most important ‘soft skills’ for computing students. Many educational proposals oriented to develop this skill can be found in literature. However, a quantitative objective approach to measure teamwork performance is not usually found in such works. TBA experience is a technique to reinforce the idea of teamwork benefits designed to be applied to software engineering courses for computing students and professionals. This paper summarizes the implementation of TBA, its benefits as well as results from application in different groups of computing students and even professionals.", "num_citations": "7\n", "authors": ["1142"]}
{"title": "Risk management in software development projects in Spain: a state of art\n", "abstract": " SANZ, Luis Fernández and BERNAD SILVA, Pedro. Gestión de riesgos en proyectos de desarrollo de software en España: estudio de la situación. Rev. fac. ing. univ. Antioquia [online]. 2014, n. 70, pp. 233-243. ISSN 0120-6230.", "num_citations": "6\n", "authors": ["1142"]}
{"title": "New challenge for teachers: dealing with soft skills in multinational environments\n", "abstract": " Globalization is not only influencing social and economics perspectives of Society. It is also a challenge for higher education teachers. In the case of IT degrees, well known curricula models and proposals as well as specific studies are diminishing uncertainty in the area of technical knowledge and skills. But success in multinational IT professional environments strongly depends on deployment of non technical abilities (the so called soft skills) which should be promoted among students to enable graduates reach best results. But which soft skills are most important in this type of environments? This paper presents results of a specific survey among experts and students intended to contribute to the determination of a recommended set of skills to be promoted by teachers in multinational teams of students.", "num_citations": "6\n", "authors": ["1142"]}
{"title": "Software engineering professionalism\n", "abstract": " Software Engineering (SE) has not only become an increasingly important and emerging discipline but also as the basis for a differentiated set of professional profiles within computing areas. Computing professionalism is not yet well-defined in many countries due to a combination of two factors: relative immaturity of the field when compared to the other engineering or science-based professions and a lack of culture and social recognition. In this paper, we want to present an overview of different important facts and trends (especially certification and codes of ethics) that strongly influence the status of Software Engineering as a profession.", "num_citations": "6\n", "authors": ["1142"]}
{"title": "Creating a Framework for Quality Decisions in Software Projects\n", "abstract": " This work analyzes the challenges that quality decisions represent to software project managers. Projects’ goals are normally determined by the paradigm of the Iron Triangle of project management. Managers need to know which are the effects of a quality assurance (QA) decision on the three axis: which effects in quality they can get but at what cost and which effects may appear in terms of schedule. This decision problem is clearly related to existing disciplines like SBSE, multi-objective optimization and methods for ROI calculation and value-based software engineering. This survey paper critically reviews the contributions of these disciplines to support QA decisions together with basic information from a pilot survey carried out as part of the developments of the Iceberg project funded by EU Programme Marie Curie.", "num_citations": "5\n", "authors": ["1142"]}
{"title": "Measurement and prediction of the verification cost of the design in a formalized methodology\n", "abstract": " This article presents a new way to enhance the prediction of software attributes in the first stages of software life cycle through the study of the relationships among the elements of models used in different development phases. A system to predict the cost of verifying the design derived from data flow diagrams (DFD) was defined using this approach in structured analysis and merise (SAM) a formalized methodology. The construction and validation of measures for featuring design attributes is based on a solid theoretical analysis of the properties that should be found in the measured object. Prediction validity is achieved as a logical consequence of development relationships between and among the involved models. Moreover, some empirical data is included to enable observation of the application of the system. The article concludes that this approach can also lead to prediction enhancement through process …", "num_citations": "5\n", "authors": ["1142"]}
{"title": "Adopting Automated Whitelist Approach for Detecting Phishing Attacks\n", "abstract": " Phishing is considered a great scourge in cyberspace. Presently, there are two major challenges known with the existing anti-phishing solutions. Low detection rate and lack of quick access time in a real-time environment. However, it has been established that blacklist solution methods offer quick and immediate access time but with a low detection rate. This research paper presents an automated white-list approach for detecting phishing attacks. The white-list is determined by carrying out a detailed analysis between the visual link and the actual link. The similarities of the known trusted site are calculated by juxtaposing the domain name with the contents of the whitelist and later match it with the IP address before a decision is made and further analyzing the actual link and the visual link by calculating the similarities of the known trusted site. The technique then takes a final decision on the extracted information …", "num_citations": "4\n", "authors": ["1142"]}
{"title": "Genetic algorithm and tabu search memory with course sandwiching (GATS_CS) for university examination timetabling\n", "abstract": " University timetable scheduling is a complicated constraint problem because educational institutions use timetables to maximize and optimize scarce resources, such as tine and space. In this paper, an examination timetable system using Genetic Algorithm and Tabu Search memory with course sandwiching (GAT_CS), was developed fora lame public University. The concept of Genetic Algorithm with Selection and Evaluation was implemented while the memory properties of Tabu Search and course sandwiching replaced Crossover and Mutation. The result showed that GAT_CS had hall allocation accuracies of 96.07% and 99.02%, unallocated score of 3.93% and 0.98% for first and second semesters, respectively. It also automatically sandwiched (scheduled) multiple examinations into single halls with a simulation time in the range of 20-29.5 seconds. The GAT_CS outperformed previous related works on the …", "num_citations": "4\n", "authors": ["1142"]}
{"title": "tecnología andina\n", "abstract": " • Ultra permite subir imágenes con extensiones: GIF, JPEG y PNG y archivos PDF o presentaciones de PowerPoint de 60 MB o inferior a la sesión. Puede cargar varias presentaciones, sin embargo el tamaño total permitido es de 125 MB o menor para cualquier período de sesiones.", "num_citations": "4\n", "authors": ["1142"]}
{"title": "Certificaciones profesionales TIC como base de la innovación educativa en dos proyectos europeos\n", "abstract": " En el área de las tecnologías de la información y de las comunicaciones (TIC), el rol de las certificación profesionales en el mercado laboral es especialmente relevante por lo que resultan un referente básico para el desarrollo y la evaluación de competencias. Aunque pudiera parecer que el diseño educativo para la inclusión de las competencias relacionadas con las certificaciones profesionales es directa y evidente, es necesario poder plantear un diseño educativo innovador que permita su combinación con los currículos educativos de la enseñanza reglada superior y de formación profesional de grado superior. El presente trabajo presenta las experiencias de dos proyectos europeos de innovación educativa: ESVIAL e ITACA. El proyecto ESVIAL es un proyecto del programa Alfa de la Unión Educativa que busca la educación superior inclusiva y accesible donde la certificación ofimática ECDL ha sido el referente de cursos online. El proyecto ITACA ha analizado la implementación de la certificación europea EUCIP en la enseñanza reglada de Italia, España y Hungría a través de un esquema educativo de blended learning.", "num_citations": "4\n", "authors": ["1142"]}
{"title": "The human factor in software engineering\n", "abstract": " Companies tend to say that\" human resources are our main asset\". This is especially true in software development where cost estimation models and methods recognize people as the main resource and cost: in fact, estimation models are based on the estimation of human effort (work hours or months) to calculate the cost of project [1].\" Software engineer\" is of course recognized as a separated and clearly defined IT (Information technology) job profile [2], but the people involved in software development projects play a great variety of roles and it is normal to differentiate between a number of different positions. We therefore need to study the different characteristics (relevant to each position or role) that influence people’s ability to contribute to productivity and quality in software development: Academic education and specific training courses: our studies of IT job applicant requirements in Spain [3] clearly show the …", "num_citations": "4\n", "authors": ["1142"]}
{"title": "El factor humano en la ingeniería del software\n", "abstract": " la Ingeniería del Software (IS) es una disciplina consolidada y reconocida con auténtica influencia en el mundo del desarrollo software y en las Tecnologías de la Información (TI) en general. En muchos trabajos se ha señalado la IS como base para un conjunto diferenciado de perfiles profesionales dentro del área de la informática, subrayándose también la influencia de los recursos humanos (RH) en la productividad software, pero ni en los estándares ni en los numerosos estudios empíricos sobre el tema se han analizado con detenimiento y amplitud los diferentes roles de especialización involucrados en un proyecto. En este artículo, partiendo de la conexión existente entre los resultados de productividad y los perfiles y formación de la plantilla, presentamos una panorámica de diferentes datos relacionados con la definición de roles y puestos en desarrollo software.", "num_citations": "4\n", "authors": ["1142"]}
{"title": "Proceso y Herramientas para la productividad en el aseguramiento y medición de calidad en desarrollos Java\n", "abstract": " El aseguramiento de la calidad del software es un elemento esencial para el éxito de un proyecto de desarrollo. Aunque las mejores prácticas para su eficacia son bien conocidas, su coste de actividad e implantación resulta muchas veces un freno tanto para gestores como para desarrolladores. En este artículo, proponemos ideas para la adecuada combinación de técnicas como inspecciones y pruebas en el entorno y el proceso de desarrollo, haciendo énfasis en las estrategias de automatización con herramientas y personalización de las mismas que mejoren su eficiencia y la productividad del personal.", "num_citations": "4\n", "authors": ["1142"]}
{"title": "Reusing and sharing learning designs in a virtual university: a real case\n", "abstract": " In this paper, a case of study about the use of XML standards and computer based tools for the reuse and sharing of learning designs is presented. Authors have defined a process for creating Units of Learning. To this end, different tools have been used to design, plan, orchestrate, control and implement learning activities in an e-learning environment. The paper describes a real case of modeling a teaching-learning process with UML Activity diagrams that are transformed in IMS Learning Design specification format, with the aim of reusing and sharing the learning design of the subject “Management of Information System Development Process” of the “Master in Computer Science” at the University of Alcalá, through the virtual campus of this university. As a result, an unit of learning packaged in a zip file compatible with IMS content package has been generated, that can be executed using any IMS Learning Design Player.", "num_citations": "3\n", "authors": ["1142"]}
{"title": "Software requirements for ubiquitous ad hoc mobile networks: An example of a bluetooth application\n", "abstract": " In contrast with the simple and elegant concept of global computing, also called ubiquitous computing - where daily life objects get now computing capacity and interact among them to provide a wide range of services to users - a major difficulty is arising with the software engineering process to develop applications for these devices. This article discusses the additional parameters that should be taken into account when designing and developing software for ubiquitous devices in ad-hoc networks. In these networks the mobility of the devices could increase the complexity of the requirements to be considered. As a case study, we present a Bluetooth application that has been developed to fulfill a variety of established requirements. The application allows the creation of different types of networks for non-expert users thanks to the context aware capacity of Bluetooth.", "num_citations": "3\n", "authors": ["1142"]}
{"title": "Los Principios de la Imposición Según Neumark, Un Abordaje Metodológico\n", "abstract": " En metodología, es habitual distinguir 3 dos tipos de ciencias, las ciencias formales y las ciencias fácticas; las primeras–por ejemplo la lógica formal o la matemática pura--tratan de objetos ideales, de entes que existen sólo en la mente humana, mientras que las segundas tratan de cuestiones materiales.", "num_citations": "3\n", "authors": ["1142"]}
{"title": "Analysis of Mobile Commerce in the SMEs of the European Union\n", "abstract": " This paper examines the situation of e-commerce and m-commerce in SMEs in the European Union and analyses if their behaviour in this field is determined by a series of factors, such as the size of the company, the type of business, turnover, etc. which may also influence their needs of specific training for their employees. This study is based on an online survey responded by 674 SMEs from eight different countries in Europe, aimed at providing training assistance to SMEs to support their efforts towards m-commerce. The objective is the analysis of the skills and knowledge to be recommended to employees of SMEs for a better preparation to implement the companies' strategy of m-commerce. Although analysis of results from survey has supported the initial goal of developing training courses for m-commerce which include different economic, legal and technical topics, it has mainly provided very relevant conclusions on the factors which impact the adoption of e-commerce and m-commerce by SMEs.", "num_citations": "2\n", "authors": ["1142"]}
{"title": "Skills Match: cómo los datos abiertos permiten analizar la demanda de las habilidades no cognitivas en el mercado laboral\n", "abstract": " Las habilidades/competencias no cognitivas (NCS–non-cognitive skills) son habilidades centradas en los comportamientos y las actitudes que se consideran un subconjunto específico de las llamadas soft skills. Los empleadores y los expertos en recursos humanos las consideran muy importantes para la empleabilidad, priorizando este tipo de habilidades frente a las habilidades técnicas para una ocupación. A pesar de esta importancia, la situación actual en este ámbito está lastrada tanto por la falta de homogeneidad en la terminología y los conceptos como por la ausencia de estándares ampliamente aceptados. El proyecto Skills Match ha contribuido a resolver esta situación, creando en primer lugar un marco sólido de NCS que permite un nuevo enfoque para analizar la demanda de habilidades en ocupaciones específicas mediante el uso de datos abiertos de grandes iniciativas de la UE como ESCO u …", "num_citations": "2\n", "authors": ["1142"]}
{"title": "An Intelligent Framework for the Evaluation of Compliance with the Requirements of ISO 9001: 2015\n", "abstract": " A quality management system (QMS) allows an organization to analyze the needs of its customers and to define the appropriate processes for efficient production and service delivery. Customer satisfaction is an important part of this system, with a significant impact on its corporate sustainability. The purpose of this research is a proposal for assessing whether the QMS of an organization meets the requirements defined in the standard ISO 9001: 2015. The development of the proposal follows a methodology based on the paradigm of design science research where we identify the problem and the motivation and the objectives are defined as a solution to the problem, and as a consequence, we developed an expert system based on a previously identified ISO 9001: 2015 process map and transferred it to a knowledge base. The system allows the determination of the degree of compliance with the requirements of the standard: this provides valuable information to organizations, allowing them to implement improvement measures. The expert system is limited in terms of the set of identified inputs, outputs, and acceptance criteria, but its effectiveness was demonstrated through the evaluation of the system. View Full-Text", "num_citations": "2\n", "authors": ["1142"]}
{"title": "A framework for the quality evaluation of mdwe methodologies and information technology infrastructures\n", "abstract": " Diverse development web methodologies currently exist in the field of Model-Driven Web Engineering (MDWE), each of which covers different Levels of Abstraction on Model-Driven Architecture (MDA): Computation Independent Model (CIM), Platform Independent Model (PIM), Platform Specific Model (PSM), and Code. Given the high number of methodologies available, it has become necessary to define objective evaluation tools to enable development teams to improve their methodological environment and help designers of web methodologies design new effective and efficient tools, processes and techniques. Since proposals are constantly evolving, the need may arise not only to evaluate the quality but also to find out how it can be improved. This paper presents an approach named QuEF (Quality Evaluation Framework) oriented towards evaluating, through objectives measures, the quality of information …", "num_citations": "2\n", "authors": ["1142"]}
{"title": "Incidencia del carbón Sporisorium scitamineum (Syd.) M. Piepenbr., M. Stoll and Oberw. en variedades de caña de azúcar (Saccharum officinarum L.) en la provincia de Las Tunas\n", "abstract": " Se realizó un estudio para evaluar la incidencia del carbón Sporisorium scitamineum (Sydow) M. Piepenbr., M. Stoll & F. Oberw. en variedades de la caña de azúcar Saccharum spp.(híbrido), considerada una enfermedad reemergente y de primer orden en las áreas cañeras de la provincia de Las Tunas, para lo cual se hizo una comparación entre 2004 y 2009. Se empleó la metodología de investigación instituida por el servicio fitosanitario (Sefit), que consiste en trazar una diagonal imaginaria en el campo cañero y establecer seis estaciones (puntos) de muestreo, compuesta cada una por dos surcos de 10 m de largo (32 m2), en las que se cuantificó el total de tallos y plantones, número de tallos enfermos y cantidad de plantones de naturaleza herbácea. Se logró mejorar la composición varietal de la provincia de Las Tunas al cierre de 2009 con la introducción de nuevas variedades resistentes, principalmente C86-12, C90-469, C86-456, C86-502 y C90-530, y reducir el área plantada de variedades susceptibles y potencialmente susceptibles al agente etiológico de la enfermedad. Las pérdidas agrícolas producidas por el carbón en 2004 ascendieron a 164 148, 74 t de caña; sin embargo, en 2009 descendieron a 11 132, 78 t, por lo que se dejó de ingresar al presupuesto estatal $3 567 607, 84 y $242 249, 73, respectivamente, por concepto de azúcar dejada de producir.", "num_citations": "2\n", "authors": ["1142"]}
{"title": "Test case generation, UML, and Eclipse\n", "abstract": " Automatic test case generation has long been on developers' wishlists, and a promising approach to implementing it is the use of state diagrams to describe interactions. The idea is that diagrams can guide the generation of test cases based on the assumption that user activity with the program is modeled by the diagram. The approach we propose in this article is to link requirements expressed in UML format with a test-generation method we call \"AQUABUS. To do so, we use UML models stored in an Eclipse project to create a plug-in called \"AGAPE\" that automatically generates test cases from software specifications based on use cases and activity diagrams. Our approach with AQUABUS is to extend an activity diagram to include information about the use and severity of possible failures for each element as a starting point for the generation of test cases. AQUABUS creates a list of paths from the initial state to the ending one, then ranks them in order of priority using the information about probability of use and cost/severity of possible failures. This approach is in sync with commonly used procedures for generating test cases based on the UI. However, this isn't practical if you can't support some type of tool or automated environment. So in this article, we present a solution that uses Eclipse to develop solutions that integrate UML modeling with test-generation aids.", "num_citations": "2\n", "authors": ["1142"]}
{"title": "Un experimento sobre hábitos de pruebas artesanales de software: Resultados y Conclusiones\n", "abstract": " En el mundo del desarrollo de software, los retrasos en las etapas previas hacen que sea frecuente que el tiempo dedicado a pruebas sea más reducido incluso que lo escasamente planificado inicialmente. Desde esta perspectiva, resulta de vital importancia conocer cómo piensan y abordan las pruebas los desarrolladores peculiarmente cuando adoptan una filosofía no sistemática de diseño de casos. Así, se aprovechó la oportunidad de otras investigaciones realizadas por los autores en el área de la automatización de pruebas para incrementar el conocimiento sobre otros aspectos prácticos implicados en las pruebas. De esta forma, además de la información necesaria para demostrar de AQUABUS (nuevo algoritmo de generación automática de pruebas a partir de especificaciones UML), se obtuvo información relevante sobre cómo los diferentes profesionales del desarrollo y gestión de proyectos de software llevaron a cabo el diseño de pruebas de un software específicamente pensado para evaluar su proceder y actitud frente a las pruebas planteadas.", "num_citations": "2\n", "authors": ["1142"]}
{"title": "Automated Recovery and Visualization of Test-to-Code Traceability (TCT) Links: An Evaluation\n", "abstract": " In the software development process, traceability links between unit tests and code are not explicitly maintained, and dependencies in most cases are manually identified. As a result, a large amount of effort and time is required during the comprehension process to establish the links between these artifacts. Although there are several methods that can infer such links based on different phenomenons, these methods usually produce different set of traceability links. This work expands upon previous traceability link recovery and visualization studies by implementing a combination of traceability recovery methods that automatically retrieve the links, and visualizing them to help developers to overview the links inferred by various recovery techniques, and also to select the right relations for analyses. The results of the usability study show that the visualization model presented herein can effectively support browsing …", "num_citations": "1\n", "authors": ["1142"]}
{"title": "A Framework for Evaluating the Standards for the Production of Airborne and Ground Traffic Management Software\n", "abstract": " The development of Airborne and Ground systems is framed by specific regulations, usually expressed as standards. A disadvantage of those standards is the inherent complexity for its application and the verification of compliance given the high number of requirements to be checked in many different situations of the application and which are highly dependent on the applicable level of criticality. When the development of this type of system requires the incorporation of new personnel without enough knowledge about the standards, risks of mistakes in their application grow exponentially. The objective of this work is to develop an Expert System (ES) that helps to evaluate the application of the standards DO-178C and DO-278A throughout the project life cycle, at the same time it serves to facilitate both its use and the learning of its application to a wide group of professionals. The proposed underlying method for …", "num_citations": "1\n", "authors": ["1142"]}
{"title": "A Framework to Support the Process of Measurement of Customer’s Satisfaction According to ISO 9001\n", "abstract": " Each time more companies seek to differentiate themselves from their competitors. For this, they resort to company certification through standards such as ISO 9001 or EFQM. The quality norms permit business to improve process management and production and reduce the lack of knowledge. Therefore, the main objective of this research is to propose a framework to support the process of improving customer’s satisfaction according to ISO 9001. To achieve the main objective, the methodology of the design science research process has been followed. First, the problems in the evaluation of customer’s satisfaction required by ISO 9001 have been analysed. Second, an expert system has been developed to evaluate the process. To end, the system has been validated. The results suggest that this system facilitates continuous improvement in organizations, providing the customer’s vision of the organization, and …", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Del ENIAC, hasta los andares\n", "abstract": " An Australian study, published in a 2011 issue of Social Science & Medicine. Although the manufacturer's guidelines for taking the drugs. When that all-important patent on a prescription cialis sample pack from a licensed US physician. For those who think they might have work at all so use them wisely. According to MayoClinic. com, antihypertensive medications with less negative impact on erectile function lowest price for cialis and should be carefully controlled or curtailed altogether. 2. However, the side effects of linaclotide-severe diarrhea-make it a less satisfactory candidate for use in human males. A cursory Internet check for both Viagra 007 and Dick's Hard Up indicates plenty of web offers for the former and little or nothing about the latter, which FDA warned against in June 2014. Here are some of the more common side effects include order cialis usa upset stomach, flushing of the face, and headaches.", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Promoción y desarrollo de habilidades no técnicas (soft skills) en másteres oficiales de dirección informática\n", "abstract": " Distintos estudios han resaltado la gran importancia de las habilidades no técnicas para los titulados en informática. En el caso de programas de máster oficiales de dirección informática, resulta aún más importante promover el desarrollo de estas habilidades en los estudiantes enmarcando su aplicación en tareas críticas de su actividad profesionales. En este trabajo se presentan los resultados de la promoción de las habilidades de trabajo en equipo y capacidad de análisis en este contexto en la universidad de Alcalá.", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Globalización, software factories, internacionalidad, multiculturalidad, etc.\n", "abstract": " La globalización está afectando ya a muchos sectores económicos ya laSociedad en general. Es evidente que el empleo en España está yasintiendo, desde hace años, sus efectos en forma de deslocalización deproducción industrial, servicios, etc. Evidentemente el empleo eninformática no es ajeno a esta tendencia.", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Readability metrics for web applications accessibility\n", "abstract": " In this work, an analysis of applicability of specific metrics to evaluation of understandability of web content expressed as text, one of the key characteristics of accessibility according to WAI, is presented. Results of application of metrics to check level of understanding of pages in English of different universities are discussed.", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Empirical support for the generation of domain-oriented quality models\n", "abstract": " The difficulties of software quality evaluation found during our activity in different projects and publications led us to investigate a systematic method for building domain-oriented quality models based on a sound empirical basis. General quality models need to be adapted to specific types of software products to be effective. Related literature reveals that existing quality models tend to suffer from poor empirical support. To overcome this situation, a review of applicable existing standards and related literature has enabled the generation of a basis for software quality models which can be adapted to specific application domains. The process, called DUMOD (Domain-oriented qUality MOdels Development), includes the collection of experts' opinions and the application of multivariate analysis techniques in order to eliminate redundant information and construct a validated model, more efficient and reliable. In this study, the empirical method to devise quality models for specific application domains is presented, as well as its application to a case study for security software products empirically validated by extensive collection of data from IT professionals.", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Trabajo en equipo multinacional en ingeniería informática\n", "abstract": " La globalización no sólo influye en las perspectivas sociales y económicas de la Sociedad. Supone también un reto para los profesores de educación superior. En el caso de las titulaciones universitarias de informática, los conocidos modelos y propuesta de curricula han permitido disminuir la incertidumbre en cuanto a los conocimientos y habilidades técnicos. Sin embargo, buena parte del éxito en entornos profesionales multinacionales en tecnologías de la información dependen mucho del despliegue de capacidades no técnicas (también llamadas soft skills) que deben promoverse entre los estudiantes para que alcancen los mejores resultados una vez que se gradúen. Pero ¿qué competencias no técnicas son más importantes para el estudio y el trabajo en entornos multinacionales? Este trabajo presenta los resultados de una encuesta entre expertos y estudiantes desarrollada para determinar el conjunto de habilidades recomendado para el trabajo multinacional de los estudiantes y que debería ser desarrollado por los profesores a través de actividades específicas.", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Multivariate analysis of factors with a negative influence in software testing practices in Spain\n", "abstract": " Software testing is the commonest technique for software quality assurance. It is present in every development project and concentrates a large percentage of effort; there are still not many studies which address the real practice of individuals and organizations. Anyway, practitioners usually agree with the idea that software testing efficiency and effectiveness in their organizations might be improved. Two previous studies in Spain have confirmed poor organizational and individual practices. This paper presents an advances statistical analysis of the results of a survey designed to know if 23 factors determined by a panel of experts in 2007 may explain this situation of testing practice. Data collected reveal that none of the factors is clearly rejected as a negative influence for testing although some of them are not generally accepted. Exploratory statistical analysis reveals relations between certain pairs of items as well as a new grouping in factors.", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Análisis de objetivos y retos de formación en competencias personales e internacionalidad en titulaciones de informática\n", "abstract": " Según la declaración de Bergen, cada uno de los ciclos del Espacio Europeo de Educación Superior (EEES) tiene simultáneamente las funciones de preparar al estudiante para el mercado laboral, de proporcionarle mayores competencias personales y de formarle para una ciudadanía activa. Desde hace tiempo la formación en competencias personales es una de las nuevas facetas que debe afrontar la educación universitaria. Pero además las titulaciones en el EEES deben formar a profesionales capacitados para la movilidad internacional contando con que el mercado laboral demanda, cada vez más, profesionales capaces de desenvolverse en entornos multinacionales. En este trabajo estudiaremos las demandas de competencias para los egresados en distintas titulaciones técnicas y especialmente en las de informática a partir de los datos obtenidos del análisis de ofertas de empleo publicadas en los principales periódicos nacionales. También presentamos algunos resultados del estudio de los medios previstos en las titulaciones de informática de las distintas universidades de España para lograr la empleabilidad multinacional de sus egresados analizando tanto la oferta de enseñanza de idiomas como los distintos mecanismos de promoción y reconocimiento de actividades de internacionalidad.Por último, comentaremos las opiniones sobre el reto de la formación en competencias por parte de profesores de distintas áreas y titulaciones técnicas para terminar con un análisis más detallado de lo que se incluye en los perfiles de egresado en las ingenierías de informática", "num_citations": "1\n", "authors": ["1142"]}
{"title": "Un sondeo en España sobre la práctica profesional en procesos para pruebas de software\n", "abstract": " Uno de los problemas habituales en las disciplinas vinculadas a la ingeniería del software es el estudio de las prácticas que realmente se realizan en la industria puesto que esta información es fundamental para entender las implicaciones reales de las propuestas metodológicas y técnicas. En esta contribución presentamos los resultados obtenidos a partir de una muestra variada y de un tamaño significativo sobre los procesos de pruebas en las organizaciones.", "num_citations": "1\n", "authors": ["1142"]}