{"title": "Mobile multiplatform development: An experiment for performance analysis\n", "abstract": " The variety of operating platforms in mobile devices involves separate standards, programming languages, and distribution markets. This poses a challenge on software developers, as to select what platform to develop first for. Web-based multiplatform development tools offer a solution under the principle of developing once using target-agnostic technologies, able to be deployed in multiple platforms; nonetheless, it has been reported that web-based applications suffer significant performance decreases. In this paper, we present a study to analyze the performance of mobile web applications using PhoneGap and Android OS to understand the most relevant performance matters raised by multiplatform tools. We report an experiment focused on evaluating execution time, to characterize the performance overhead found in a web app with respect to an identical native application.", "num_citations": "104\n", "authors": ["1250"]}
{"title": "Evolution of mobile software development from platform-specific to web-based multiplatform paradigm\n", "abstract": " In this paper, we outline a projection on the trend of using web technologies for creating end-user applications in mobile devices. Following a paradigm shift in the software industry, from only-binary applications to dynamic web applications, mobile web development tools evolve to offer an integral native solution that allows to simplify the soft-ware process and broad its scope to a true, single cross-platform development effort. Soon, mobile web development tools will be preferred by designers and programmers thanks to their versatility, economy and usefulness, less dependent on specific platforms and SDKs, while fully functional and reliable in comparison to their binary counterparts.", "num_citations": "78\n", "authors": ["1250"]}
{"title": "A Method for Characterizing Energy Consumption in Android Smartphones\n", "abstract": " Cellular phones and tablets are ubiquitous, with a market penetration that is counted in millions of active users and units sold. The increasing computing capabilities and strict autonomy requirements on mobile devices drive a particular concern on energy utilization and optimization of this kind of equipment. In this paper, we investigate an approach to relate the energy consumption of smartphones with the operational status of the device, surveying parameters exposed by the operating system using an Android application. Our goal is to explore the means to expand the information that may help to produce more reliable measurements that can be used in further research for designing energy optimization profiles for mobile devices and identify optimization needs.", "num_citations": "75\n", "authors": ["1250"]}
{"title": "Software Development Processes for Mobile Systems: Is Agile Really Taking Over the Business?\n", "abstract": " Mobile applications differ from desktop software due to their particular execution environment, limited resources, high autonomy requirement, market competition, etc. This situation brings the need of having customized development processes that respond efficiently to these challenges, to facilitate the development of high quality products that are able to excel and remain competitive in this domain. While a number of research papers have consistently proposed the adoption of Agile practices, it is not clear how a software development process would help to solve the issues present in the mobile domain. Moreover, there is a lack of evidence that shows a clear link between the proposed methodologies and their utilization in a real-world setting. Finally, the rapid evolution of the mobile environment challenges several of the premises upon which the proposed methodologies were created. In this paper, we present a …", "num_citations": "72\n", "authors": ["1250"]}
{"title": "Software assurance practices for mobile applications\n", "abstract": " Mobile software applications have to cope with a particular environment that involves small size, limited resources, high autonomy requirements, competitive business models and many other challenges. To provide development guidelines that respond to these needs, several practices have been introduced; however, it is not clear how these guidelines may contribute to solve the issues present in the mobile domain. Furthermore, the rapid evolution of the mobile ecosystem challenges many of the premises upon which the proposed practices were designed. In this paper, we present a survey of the literature on software assurance practices for mobile applications, with the objective of describing them and assessing their contribution and success. We identified, organized and reviewed a body of research that spans in three levels: software development processes, software product assurance practices, and …", "num_citations": "63\n", "authors": ["1250"]}
{"title": "Potential advantages and disadvantages of multiplatform development frameworks–A vision on mobile environments\n", "abstract": " In this paper, we present a position on potential advantages and disadvantages that may rise after the utilization of multiplatform frameworks for creating mobile applications. Mobile frameworks evolve to offer solutions that allow to simplify the development process in order to achieve products that can be deployed in different mobile operating systems. Based on the experience of the large success of web applications in desktop computing, a similar paradigm shift from target-specific to cross-platform applications could be foreseen in the mobile software industry. Development and marketing practices should understand this philosophy, learn from similar experiences and identify its advantages and disadvantages, to exploit the potential of the opportunities and anticipate to the challenges that changing a development paradigm brings forth. Our objective is to promote discussion by introducing a series of questions to …", "num_citations": "61\n", "authors": ["1250"]}
{"title": "Teaching Computational Thinking Using Agile Software Engineering Methods: A Framework for Middle Schools\n", "abstract": " Computational Thinking (CT) has been recognized as one of the fundamental skills that all graduates should acquire. For this reason, motivational concerns need to be addressed at an early age of a child, and reaching students who do not consider themselves candidates for science, technology, engineering, and mathematics disciplines is important as well if the broadest audience possible is to be engaged. This article describes a framework for teaching and assessing CT in the context of K-12 education. The framework is based on Agile software engineering methods, which rely on a set of principles and practices that can be mapped to the activities of CT. The article presents as well the results of an experiment applying this framework in two sixth-grade classes, with 42 participants in total. The results show that Agile software engineering methods are effective at teaching CT in middle schools, after the addition …", "num_citations": "60\n", "authors": ["1250"]}
{"title": "Can execution time describe accurately the energy consumption of mobile apps? An experiment in Android\n", "abstract": " Measuring the energy spent by a software application is a problem that can be solved by having the proper hardware or software instruments. However, not always such tools are available or the provide resolution cannot fit the needs of the user, for instance when measuring a very small piece of code. This problem is particularly relevant on mobile software products, as they are developed to be executed in an environment limited in energy resources. Mobile software engineers should take special consideration on the energy consumption when designing and implementing an application. In this paper, we propose that the energy consumed by a unit of code can be approximated by the execution time. Using software benchmarks run with different data loads, we measured the execution time required to complete the job, and using a software tool to measure the energy spent during the execution of the benchmark …", "num_citations": "54\n", "authors": ["1250"]}
{"title": "Students want to create apps: leveraging computational thinking to teach mobile software development\n", "abstract": " Computational Thinking (CT) is recognised as one of the fundamental skills of all graduates. Nevertheless, some issues can emerge when trying to introduce CT into schools; for example, teachers might not be willing to add topics to their intensive syllabi. Therefore, out-of-school venues such as summer schools can be considered a great opportunity for exposure to CT. Moreover, summer schools allow students to meet first hand researchers and help them pursue their interest far from the regular school climate. High school students in general are very curious for the creation of mobile apps; however, most of them get discouraged because they perceive this activity as a very difficult task. Here we describe the MobileDev summer school, a one-week training and hands-on experience in current topics of software development for mobile devices. The curiosity of the students for developing mobile apps is used to …", "num_citations": "40\n", "authors": ["1250"]}
{"title": "Better Code for Better Apps: A Study on Source Code Quality and Market Success of Android Applications\n", "abstract": " The quality of a mobile application is a major concern for developers, users and application stores. Even though several mobile-specific techniques have been proposed to evaluate the quality of a mobile software product, there is little evidence about their applicability as an efficient way to forecast a potential success of a mobile software product in a real app store. In this paper, we investigated the contribution of the code quality in the market success of Android apps in the Google Play store. We retrieved the source code of 100 Open Source mobile apps, we calculated a set of product metrics, and we obtained several market indicators from an application store. Utilizing statistical methods we determined whether there is a relationship between product quality and market success. The results obtained shown consistently that the quality of the source code has a marginal impact into the indices that describe the …", "num_citations": "40\n", "authors": ["1250"]}
{"title": "Agile Software Development Processes for Mobile Systems: Accomplishment, Evidence and Evolution\n", "abstract": " Mobile software applications have to cope with a particular execution environment that includes limited resources, high autonomy requirements, market regulations, and many other constraints. To provide a software development process that responds to these challenges, several methodologies proposed the adoption of Agile practices; however, it is not clear how a software development process would help to solve all the issues present in the mobile domain. Moreover, the rapid evolution of the mobile environment questions several of the premises upon which the proposed methodologies were designed. In this paper, we present a review on Agile software development processes for mobile applications and their implementations, with the objective of knowing the contribution of Agile methods to address the needs of the mobile software in a real production environment. In addition, we aim to put up to date …", "num_citations": "29\n", "authors": ["1250"]}
{"title": "Method reallocation to reduce energy consumption: An implementation in android os\n", "abstract": " Mobile applications have become ubiquitous, adopted by millions of users that register billions of downloads a day. To increase the competitiveness of the mobile software product, developers should care in a very detailed fashion about the qualities demanded by end users, execution targets and mobile markets. One important quality is the ability of the application to consume energy efficiently, as mobile devices are powered by batteries and they hold a very strong autonomy requirement. In this paper, we investigate the impact that the allocation of a software routine has in the overall energy consumption of a mobile device. We implemented software benchmarks in Java and C and we exercised them in different execution scopes of the Android OS runtime. We measured the amount of energy required to complete each job to determine the energy consumed by each routine, and to know in what cases it is advisable …", "num_citations": "24\n", "authors": ["1250"]}
{"title": "DroidSense: a mobile tool to analyze software development processes by measuring team proximity\n", "abstract": " Understanding the dynamics of a software development process is of paramount importance for managers to identify the most important patterns, to predict potential quality and productivity issues, and to plan and implement corrective actions. Currently, major techniques and tools in this area specialize on acquiring and analyzing data using software metrics, leaving unaddressed the issue of modeling the “physical” activities that developers do. In this paper, we present DroidSense, a non-invasive tool that runs on Android-based mobile phones and collects data about developers involvement in Agile software development activities, e.g. Pair Programming, daily stand-ups, or planning game, by measuring their proximity to computers and also other developers. DroidSense collects data automatically via Bluetooth signal created by other phones, personal computers, and other devices. We explain detailed …", "num_citations": "21\n", "authors": ["1250"]}
{"title": "Design Thinking and Agile Practices for Software Engineering: An Opportunity for Innovation\n", "abstract": " Commonly, the instruction of Software Engineering implements processes that are inherent to the theory and practice of software development. Traditional and Agile methods lay the foundation for building\" functional software products\" that meet the requirements of a system of a larger scope. However, if we consider software as a product that frequently has the mission of satisfying the needs of human users, we can go beyond the typical\" analysis-design-implementation-testing\" process, to reinterpret it with the\" empathize-define-ideate-prototype-testing\" proposed by Design Thinking, a development methodology commonly used in creative and innovative professional settings. In this work, we study the use of Design Thinking as a methodological approach for the instruction of Software Engineering at undergraduate level, in courses that have the particular aim of creating innovative software products from scratch …", "num_citations": "19\n", "authors": ["1250"]}
{"title": "Energy-Aware Performance Evaluation of Android Custom Kernels\n", "abstract": " Smartphones play a key role in several aspects of our daily life. Their range of application is constantly growing, making them versatile and necessary. However, mobile devices face an important problem: they hold an important autonomy requirement, which is constantly challenged by the short life of batteries. Researchers and practitioners have proposed different strategies to preserve battery life in mobile devices, both from hardware and software point of views. One of the software-based approaches is to apply optimizations at the level of the kernel of the operating system. This strategy is attractive, as it may improve the battery consumption of all applications running on top of the software kernel. The scope of this paper is to compare current Android kernel-based modifications evaluating their impact on battery consumption. To do it, we performed performance tests on each kernel, monitoring the battery …", "num_citations": "19\n", "authors": ["1250"]}
{"title": "Defining relevant software quality characteristics from publishing policies of mobile app stores\n", "abstract": " Publishing a product in a mobile app store implies a process that makes a software product accessible to millions of users. Developers require the means to evaluate the quality of the mobile software product from a viewpoint that considers the mobile business, users, target platforms and app stores. In this paper, we surveyed the publishing guidelines of six major app stores to identify the most important software quality requirements set upon mobile apps. We leveraged the ISO/IEC 25010 quality standard as a mechanism to assure the fulfillment of the quality requirements from the mobile app stores, and we defined an association between such requirements and the characteristics of the quality standard. Finally, we introduced a Mobile App Quality Model, which aims to provide a reference to assure the development of mobile-specific, marketcompliant mobile software applications.", "num_citations": "14\n", "authors": ["1250"]}
{"title": "Blending mobile programming and liberal education in a social-economic high school\n", "abstract": " Mobile programming is one of the fastest growing approaches in many fields, such as marketing or e-commerce. From the educational perspective, this means that students should understand that they can build mobile applications (apps) without being professionals, and at the same time recognize their own potential to use technology in any professional path they choose. This goal is not trivial, even if students are in general curious and open to learn about the creation of apps. Indeed, especially in liberal education, students get discouraged upfront as they perceive programming as a difficult task. This paper describes a course that was created to fit the educational needs of a social-economic high school. Students take part of an interdisciplinary project in which the Software Engineering process is used to promote CT skills. The course was repeated twice and involved 29 students (8 th  and 9 th  grade).", "num_citations": "10\n", "authors": ["1250"]}
{"title": "A study of energy-aware implementation techniques: Redistribution of computational jobs in mobile apps\n", "abstract": " As devices like smartphones and tablets have been adopted by millions of users, the offer of mobile software products and services has as well evolved significantly. Current mobile software products require hardware resources, computer job and network connectivity that is reflected in increasing power needs. This power demand represents a major challenge to the strong autonomy requirement of mobile devices, powered by batteries. As a consequence, one of the most important qualities of mobile software development is the ability to produce applications that consume energy resources wisely. To accomplish this goal, different approaches have been proposed, including energy-aware software design and implementation techniques. The energy aware software design techniques considered in this work are two: Method Reallocation, which refers to the placement of pieces of code in different execution scopes …", "num_citations": "10\n", "authors": ["1250"]}
{"title": "Analysis of offloading as an approach for energy-aware applications on android os: A case study on image processing\n", "abstract": " Energy consumption on mobile devices has been studied with the objective of finding ways to extend the device’s autonomy, responding to a clear requirement from the end user. Computation offloading is an energy aware design technique that moves the execution of software routines outside the mobile device. In this paper, we illustrate a case study of an energy aware image processing application for Android mobile systems, which exercises process offloading to describe a quantitative outline of its actual contribution to save energy in a mobile device. We compared the battery consumption of local and remote executions of selected benchmarks, finding that even though in some cases it is actually more economical to offload the process, the expenses of overhead and network usage have a high impact on the energy required by the application.", "num_citations": "9\n", "authors": ["1250"]}
{"title": "Using software quality standards to assure the quality of the mobile software product\n", "abstract": " Due to the high relevance gained by mobile software applications, software developers require a way to measure and track the quality of their mobile products from a domain-specific, quantitative point of view. Currently, there is no a link between the general quality goals set by the mobile ecosystem and the practices that have to be exercised to develop a compliant application. In this work, we pursue the implementation of a strategy to extend software quality standards to supply mechanisms to measure the quality of mobile software products from the point of view of developers and users, in the context of mobile execution environments and mobile application markets.", "num_citations": "8\n", "authors": ["1250"]}
{"title": "Teaching software design engineering across the K-12 curriculum: Using visual thinking and computational thinking\n", "abstract": " Over the years a number of methodologies have been proposed in Software Engineering to deal with systems design. High among them is visual thinking (VT). VT is a well known strategy to foster more ideas and generate consensus within a group. In this paper, we propose the application of VT in the design phase of computational thinking in the K-12 curriculum. The goal is to facilitate the interchange of ideas in a team of students, and assist on orchestrating an all-hands, brainstorming working strategy that ensures that all the participants speak and are listened, and that all the viewpoints are taken into account. We describe the results of an experience of visual thinking applied in the design phase across the K-12 curriculum.", "num_citations": "7\n", "authors": ["1250"]}
{"title": "Leveraging Robot Programming to Foster Computational Thinking\n", "abstract": " In 2013, ACM recognized Computational Thinking (CT) as “one of the fundamental skills desired of all graduates”. This means that, especially in liberal education environments, one of the challenges of CT courses is to motivate students who are discouraged upfront as they perceive programming as a difficult task. Applications that have tangible results typically stimulate students’ interests. For instance, Educational Robotics (ER) is recognized as a tool to enhance higher order thinking skills and to facilitate teamwork. In this paper, we describe a course that has been designed to use ER (ie, programming a maze-solving robot) to foster CT. Each activity of the course has been designed to foster specific CT skills and to contribute to CT assessment, which remains a challenge in CT research. We report the results of an experiment, in a liberal education environment, with a total of 13 ninth graders (15.4% M, 84.6% F).", "num_citations": "6\n", "authors": ["1250"]}
{"title": "A measurement tool to track drones battery consumption during flights\n", "abstract": " The autonomy of mobile systems depends greatly on the capability of the power source that supplies the necessary energy. Typically these sources are limited batteries that cannot keep up with the functionality and services that modern mobile equipment features. This situation motivates researchers and practitioners to develop strategies to promote efficient energy usage on mobile platforms. However, to reduce the energy consumption it is required to have reliable means to measure the devices behavior and its relationship to the battery discharge. This problem is relevant in platforms that depend strongly on batteries like cellphones, tablets, wearables, or drones. This paper focuses on drones, introducing a software system that acquires data during a drone mission, featuring an online battery discharge analyzer. The goal of this software is to provide a means to identify the operations that spend more …", "num_citations": "6\n", "authors": ["1250"]}
{"title": "Towards optimization of energy consumption of drones with software-based flight analysis\n", "abstract": " The capabilities and applications of new drones require a high demand of power that traditional batteries cannot sustain, triggering the need of developing strategies to promote efficient energy usage on drone platforms. However, to reduce the energy consumption it is required to have reliable means to measure the device’s behavior and its relationship to the battery discharge. This paper introduces Green Flight, a software system that acquires data during a drone mission, featuring an online battery discharge analyzer and a real-time suggestions mode to help to optimize the overall power consumption of the drone, allowing for longer, more autonomous missions.", "num_citations": "5\n", "authors": ["1250"]}
{"title": "End-User Software Development: Effectiveness of a Software Engineering-Centric Instructional Strategy\n", "abstract": " Aim/Purpose This work aims to introduce and evaluate an instructional strategy that aids end-users with developing their software products during intensive projectbased events.", "num_citations": "4\n", "authors": ["1250"]}
{"title": "A Strategy for Assessing the Acquisition of Computational Thinking Competences: A Software Engineering Approach\n", "abstract": " Evaluating the acquisition of Computational Thinking skills can be a very complicated process, especially in a context in which, in addition to the development of the skills, the quality of an outcome product is of particular relevance. In this paper, we propose a strategy to assess the acquisition of Computational Thinking competences through eight metrics that measure the quality of a working software product. Our approach includes leveraging Block-Based Programming Languages to incorporate Software Engineering practices for a metric collection effort that delivers value for the evaluation of the quality of software product as an observable outcome of the acquisition of Computational Thinking competences.", "num_citations": "3\n", "authors": ["1250"]}
{"title": "From Game Design with Children to Game Development with University Students: What Issues Come Up?\n", "abstract": " This paper reports on the development of game design ideas by children. These were specified in structured informal documents and low-fidelity paper prototypes. University students were challenged to develop children's informal specifications of games into high-fidelity interactive prototypes, and to have these tested with children. What issues did university students encounter in children's informal specifications? This paper answers such questions by explaining the organization of the development process for students in as much details so as to allow for its analysis and replicability in different contexts.", "num_citations": "3\n", "authors": ["1250"]}
{"title": "The future of energy-aware software: The case of drones\n", "abstract": " The capabilities of new generation drones have boosted a higher demand of power that limited sources like batteries cannot keep up with. This situation triggers a need for designing strategies toward efficient power consumption to reduce the energy demand of these platforms. In this article, we express a vision on Software Engineering methodologies that supply processes, tools, and metrics to evaluate the energy consumption for drones at system level. With this knowledge, we may outline a research agenda to develop ways to utilize software solutions to measure and optimize the energy consumption of ubiquitous, highly autonomous computing devices.", "num_citations": "3\n", "authors": ["1250"]}
{"title": "Preparing mobile software development processes to meet mission-critical requirements\n", "abstract": " Mobile systems have evolved to a level where they are required to carry out their operations in a wide range of environments, from voice communication, networking and entertainment to complex business applications. Software running on mobile devices has as well grown to a point in which it has earned a major role and impact on the overall performance and capability of a system. This situation attracts a genuine interest of knowing in a more detailed fashion the conditions under which mobile software systems are conceived, designed, implemented, and maintained, both from process and product point of views.In parallel,“mission-critical” is a recurrent concept in Software Engineering that refers to software systems in which a malfunction may lead to injuries, loss of lives or loss of significant investment. As consequence, these systems require the highest care through all steps of the software development cycle [1]. Application areas of mission-critical software comprehend manufacturing control, transportation systems, weapon delivery systems, space programs, air traffic control, medical systems and many others [2].", "num_citations": "3\n", "authors": ["1250"]}
{"title": "Computational thinking through mobile programming\n", "abstract": " Computational Thinking (CT) is considered a fundamental skill for everyone. Therefore, research has focused on defining age and grade-appropriate curricula for teaching CT. In this context, mobile programming can be a good means to foster CT. Indeed, the growing adoption of mobile devices, also among females, minorities, and all economic groups, provides a powerful opportunity for engaging students. Nevertheless, further issues need to be addressed, in particular in the context of liberal education. For example, most of the students enroll in these schools because they have higher interest for liberal arts, and perceive programming as a very difficult task. Also, issues can emerge when trying to introduce new courses into schools. In this paper, we describe a course, which aims at creating a mobile application with students having no background in software development. The main strategy to accomplish this …", "num_citations": "2\n", "authors": ["1250"]}
{"title": "An Android Kernel Extension to Save Energy Resources Without Impacting User Experience\n", "abstract": " The autonomy of mobile devices is a requirement of utmost importance for end users. The autonomy is strongly related to the capacity of the built-in battery, in combination with the technical capabilities and the demand of energy of the diverse components of the device. As mobile equipment becomes more powerful and demanding, the need to find ways to optimize the overall energy consumption of the system grows as a critical research path. Software, as an instrumental component of a mobile system, is also an attractive target to deploy energy saving approaches. Several techniques of software-based energy aware strategies have been explored, including solutions placed at operating system, compiler and application level. In this paper, we present an energy saving strategy at operating system level. Our approach is implemented in the form of kernel extensions that assess the status of the device, and …", "num_citations": "2\n", "authors": ["1250"]}
{"title": "Building Smart Apps for Smart Cities: un esempio di sinergia tra PCTO ed Educazione Civica, concluso ai tempi di COVID-19\n", "abstract": " Con la legge 92/2019 è stato introdotto, all’interno del percorso scolastico italiano, l’insegnamento dell’educazione civica (GU n. 195 del 21-8-2019). Essa contribuisce a formare cittadini responsabili e promuove la partecipazione piena e consapevole alla vita sociale. Le linee guida emanate con DM 35 del 22/06/2020 contengono, nell’allegato C, l’integrazione del Profilo educativo, culturale e professionale dello studente al termine del II ciclo di istruzione e di formazione (allegato A del D. lgs. n. 226/2005), in cui in particolare si legge la competenza di:“[…] Cogliere la complessità dei problemi esistenziali, morali, politici, sociali, economici e scientifici e formulare risposte personali argomentate”. In questo articolo proponiamo un esempio di sinergia tra PCTO ed Educazione civica, attraverso l’acquisizione di competenze digitali e la realizzazione di una app socialmente rilevante. Il progetto è stato suddiviso in cinque fasi, riproducibili in diversi contesti disciplinari, ed anticipa gli obiettivi formativi richiesti dal Ministero dell’Istruzione per i prossimi anni scolastici.", "num_citations": "1\n", "authors": ["1250"]}
{"title": "Experience Report of a Software Development Course in a Faculty of Fine Arts\n", "abstract": " This paper describes the implementation of Computational Thinking techniques to promote the development of software development skills in Fine Arts postgraduate students, understanding that the population does not have formal academic training in Computer Science. We present a case study observed during a software development course taught to a non-expert population of Fine Arts postgraduate students. As a result of the implementation of Computational Thinking concepts, students executed software solutions applicable to real-world problems, and Computational Thinking competencies were observed through characteristics of concepts, practices and perspectives. This paper discusses as well situations that may set basis for strategies of assessment or evaluation of Computational Thinking principles.", "num_citations": "1\n", "authors": ["1250"]}
{"title": "The Incorporation of Drones as Object of Study in Energy-aware Software Engineering\n", "abstract": " As drones expand their ability to perform longer and more complex tasks, one of the first concerns that rise is their capacity to perform those tasks in a reliable way. Reliability can be understood from different aspects: the ability of the drone to perform accurately, safely and autonomously. In this paper, we focus on understanding the current efforts to ensure the last quality, autonomy, from the point of view of energy-awareness for drone systems. It emerges that drones as object of study in energy aware Software Engineering is still an emerging, unexplored area, which requires to learn from advances and experimentation in other mobile and ubiquitous devices like cellular phones or tablets. Still, it is required to understand the opportunities and limitations of drones as computational targets. A research agenda should be set and followed to leverage software as an opportunity to foster drones as energy-aware devices.", "num_citations": "1\n", "authors": ["1250"]}
{"title": "Preserving energy resources using an android kernel extension: A case study\n", "abstract": " In this paper, we present our experience designing and testing an energy saving strategy for mobile phones, implemented at operating system level, using Android OS. Our approach was to deploy kernel extensions that assess the status of the device, and enable economic profiles without user intervention. Our experiments showed that the power management kernel extension was able to extend the battery runtime by 70% to 75%, at the expense of impacting the experience of the user with an estimated performance degradation of 20% to 30%.", "num_citations": "1\n", "authors": ["1250"]}
{"title": "Open Source Software: Mobile Open Source Technologies\n", "abstract": " The International Conference on Open Source Systems (OSS) celebrated 10 years of interchange, discussion, progress, and openness. This year we received a relevant number of submission and workshop proposals, on all aspects of open source. Moreover, the conference was honored with the presence of distinguished speakers from leading technology companies who shared their experience on how to achieve success on top of open source technologies. A total of 37 high-quality contributions from 18 countries were accepted in the final program, thanks to the effort and coordination of the program chairs and the rigorous reviews of the Program Committee.In 2014, OSS traveled to Latin America, landing in the beautiful city of San Jose, capital of the lively Republic of Costa Rica. OSS 2014 took place in Latin America, a region that experiences an enthusiastic and continuous growth in the development and …", "num_citations": "1\n", "authors": ["1250"]}
{"title": "Standard-based strategy to assure the quality of the mobile software product\n", "abstract": " The high relevance gained by mobile software applications, the large number of users, and the growing development competition, trigger a need for a method to measure and track the quality of mobile software products from a domain-specific, quantitative point of view. We pursue the implementation of a strategy to extend software quality standards to supply mechanisms to measure the quality of mobile software products, for developers to have a well-founded understanding of whether their applications meet the market's demands and user expectations", "num_citations": "1\n", "authors": ["1250"]}
{"title": "A novel application of open source technologies to measure agile software development process\n", "abstract": " In the last 10 years Open Source products have been widely used in industry. New methodologies and best practices to develop Open Source software appeared. In this work, we present an application that runs on Android-based mobile phones and collects proximity data with other devices via Bluetooth. The application gives new insights into measuring proximity inside a team of software developers. Data collection process is automatic so that the team members are not distracted from their daily activities. The collected data represent time frames when developers work alone at their machines and when they do Pair Programming with their colleagues.", "num_citations": "1\n", "authors": ["1250"]}