{"title": "The design of adaptive acquisition of users feedback: An empirical study\n", "abstract": " Users' feedback is a main source of knowledge on how users perceive the role of software in meeting their requirements. Collectively, such feedback helps shaping software autonomous and semi-autonomous adaptation decisions of what is called Social Adaptation. It also helps developers to identify loci in the system where an evolution should be introduced in the next release. Despite this role of users' feedback, there is a lack of systematic engineering approaches on how to design its acquisition mechanisms. In this paper, we observe that the acquisition of feedback should be itself adaptive to the context of use. We conduct an empirical study following a mixed-method sequential exploratory approach to explore the main drivers of such adaptation and understand users' attitude when being asked to provide feedback. Our findings are meant to enrich the knowledge base for developers and researchers in users …", "num_citations": "38\n", "authors": ["1501"]}
{"title": "Adaptive software-based feedback acquisition: A persona-based design\n", "abstract": " Users' feedback is vital to improve software quality and it provides developers with a rich knowledge on how software meets users' requirements in practice. Feedback informs how software should adapt, or be adapted, at runtime and what evolutionary actions to take in the next release. However, studies have noted that accommodating the different preferences of users on how feedback should be requested is a complex task and requires a careful engineering process. This calls for an adaptive feedback acquisition mechanisms to cater for such variability. In this paper, we tackle this problem by employing the concept of Persona to aid software engineers understand the various users' behaviours and improve their ability to design feedback acquisition techniques more efficiently. We create a set of personas based on a mixture of qualitative and quantitative studies and propose PAFA, a Persona-based method for …", "num_citations": "34\n", "authors": ["1501"]}
{"title": "Wisdom of the crowd within enterprises: Practices and challenges\n", "abstract": " The Wisdom of the Crowd advocates that decisions collectively made by a diverse crowd could be better than those made by an elite group of experts. The Wisdom of the Crowd puts preconditions on this to work correctly. This concerns the diversity of the crowd, their independence from each other, their decentralisation, and the methods of aggregating their distributed knowledge and forming collective decisions. Although the concept is inspiring, its interpretation and conduct differ significantly amongst enterprises, especially with regard to the culture and style of management. In addition, we still lack reflections on how the Wisdom of the Crowd worked in the practice of modern enterprises. To address this lack of knowledge, this paper conducts an empirical study following a mixed method approach involving 35 senior managers coming from 33 different industries in the UK. In the first phase we interview eight …", "num_citations": "26\n", "authors": ["1501"]}
{"title": "Engineering software-based motivation: a persona-based approach\n", "abstract": " Software-based motivation refers to the use of technology to enhance the engagement and efficiency of people in performing tasks and following a certain behaviour. Instances of such paradigm include gamification, persuasive technology and entertainment computing. Despite its potential, an ad-hoc introduction of software-based motivation to a business environment may lead to detrimental effects such as creating pressure and tension, and also reducing quality and authenticity. Hence, we advocate the need for a systematic engineering process to develop software solutions for motivation requirements. One of the challenges is in the high diversity in users' perception and acceptance of motivation strategies and their software-based incarnations. In this paper, we propose the use of personas as an intermediate step which increases efficiency in the engineering process for both engineers and users. We conduct …", "num_citations": "25\n", "authors": ["1501"]}
{"title": "Gamified culture-aware feedback acquisition\n", "abstract": " User feedback is crucial to improve software quality. For example, it can be used to identify missing features and clarify user trends and preferences for future improvement. However, obtaining user feedback is not a 'one-off' process which requires that developers need to gather user feedback in an on-going approach. The problem lies here: the majority of users are generally lack motivation and interest in providing feedback, especially in a constant and frequent style. Moreover, studies have noted that the cultural difference also plays a key role in software designs which will affect how users would like to feedback requests to be designed. In this paper, we advocate that gamification is a powerful technique to maximize users' motivation and change their reaction to feedback requests. We conducted an empirical study and identified some key differences between Western and Middle Eastern users on what motivated …", "num_citations": "21\n", "authors": ["1501"]}
{"title": "Online Misinformation Spread: A Systematic Literature Map\n", "abstract": " Misinformation is widely and rapidly spreading on social media platforms. This could result in severe negative effects on users and the quality of online generated content. Luckily, there is a growing interest among researchers to combat this spread of misinformation on social media platforms. Despite this growing interest and to the best of the author's knowledge, there are no studies that cover and classify the types of research being published on this topic. To overcome this gap, the author performed a literature systematic mapping to produce a comprehensive overview of this research area. This results in the identification of 101 primary studies that met the inclusion/exclusion criteria of articles defined in this study. These primary studies were then categorized according to their research type, contribution type, and research focus. The results indicated that most studies focus on providing solutions to detect …", "num_citations": "14\n", "authors": ["1501"]}
{"title": "Persuasive and culture-aware feedback acquisition\n", "abstract": " User feedback is an important factor to improve software quality. For example, it can provide information on missing features and clarify user trends and preferences for future improvement. However, gathering user’s feedback is not an easy process since the majority of users lack motivation and interest in providing feedback, especially in a constant and frequent style. In addition, studies have noted that the cultural differences among users also play a role in affecting their motivations to feedback acquisition. In this paper, we empirically investigate the role of culture in affecting users’ perception and motivations to give feedback. Our study identifies some key differences between Western and Middle Eastern users on what motivate them to provide feedback and what could have an influence on the quality of the feedback they give. This also makes the case for the need to design a persuasive and culture …", "num_citations": "11\n", "authors": ["1501"]}
{"title": "An implementation method for Arabic keyword tendency using decision tree\n", "abstract": " Generally, keyword recurrences change over certain periods of time. Traditional approaches estimated classes (increasing, relatively constant and decreasing) that indicate keywords' attribute changes in a document over certain periods of time using a decision tree. Furthermore, all earlier approaches are based on keywords in English and French languages. Therefore, the extension of keywords to other languages such as Arabic could strengthen further researches in this domain. This paper introduces new method to extract Arabic keywords from corpora based on their recurrences changes in a document over given periods of time using a decision tree. The new approach is applied on new data set field (computer science) which makes it different to traditionally used methods. The comparison between the manually classified results and the evaluation of the decision tree results reveals that F-measures of …", "num_citations": "2\n", "authors": ["1501"]}
{"title": "Examining Tacit Knowledge Transfer Processes for Enterprise System Projects Success: A conceptual framework\n", "abstract": " This paper examining the main tacit knowledge transferring processes and sub-processes that may affect on enterprise systems projects success. Authors proposed a conceptual framework contain five tacit knowledge transferring processes: readiness to share; readiness to receive; transmission channels; tacit knowledge transfer, and substantiation. The sample consists of enterprise systems specialist and IT project managers. A fuzzy set Qualitative Comparative Analysis (fsQCA) were adopted to observe the higher coverage causal configurations sub-processes affect on each process. The results confirm that the nine sub-processes (trust, face to face interaction, knowledge absorption, training, motivation, ability, relationship, instructions, and documents)-sequentially-are the most critical configurations for transferring tacit knowledge processes to success enterprise systems projects.", "num_citations": "2\n", "authors": ["1501"]}
{"title": "Misinformation-Aware Social Media: A Software Engineering Perspective\n", "abstract": " Misinformation is extensively and speedily spreading on social media platforms. This leads to sever negative impact on users of social media and the quality of online created content. Fortunately, there is a growing interest among researchers to fight misinformation on social media by the production of algorithms that can detect low quality information. However, none of these studies focus on how to promote a healthier behaviour among social media users to minimize the act of spreading misinforming. In this paper, the author advocates that gamification can be adopted for the aim of enhancing users' behaviour towards misinformation and increasing their critical digital literacy. An empirical study was conducted to investigate users' perceptions with regards to the use of several gamification elements on social media to combat misinformation spread. The results indicated that users' preferences and perceptions vary …", "num_citations": "1\n", "authors": ["1501"]}
{"title": "Analysis of Gamification Elements to Explore Misinformation Sharing Based on U&G Theory: A Software Engineering Perspective\n", "abstract": " Gamification elements provide a personal drive to urge user experience, emotion, fun, and engagement, positively or negatively. These gamification elements may have been unintentionally employed through the design and implementation process of social media platforms to encourage users’ behaviour towards misinformation sharing. This study intends to answer the subsequent question” What are the mostly used gamification elements that could possibly encourage users to share misinformation on social media platforms?”. The study empirically investigates the usage of gamification elements and their relation to U&G theory with 286 participants. The results indicated that gamification elements usage scored high with regard to the self-expression perspective (frequency= 216), as well as the interaction& collaborations perspective (frequency= 198). whereas, the information seeking perspective scored low (frequency= 59) and leaderboard were the least usage (frequency= 43). The results may be useful to guide software engineering, developers, GUI specialists to cater for design elements settings and their possible negative effects in social media contexts.", "num_citations": "1\n", "authors": ["1501"]}