{"title": "What Is Flowing in Lean Software Development?\n", "abstract": " The main concern of the software industry is to deliver more products in shorter time-cycles to customers with an acceptable economic justification. In virtue of these concerns, the software industry and researchers in the field of software engineering have engaged in the process of adopting lean principles. In this paper, we are seeking the knowledge that could help us better understand the nature of flows in software development. We define a generalized concept of the value creation points and an axiomatic system that capture the specifics of software development. Further, a generalized definition of the flow makes it possible to identify super-classes of waste sources. Finally, we define a concept of decision flow, suggesting what a value creation point could be in the software development context. The decision flow is an inseparable part of the software development activities and it carries capabilities of …", "num_citations": "35\n", "authors": ["1335"]}
{"title": "Early empirical assessment of the practical value of GQM+Strategies\n", "abstract": " The success of a measurement initiative in a software company depends on the quality of the links between metrics programs and organizational business goals. GQM+Strategies is a new approach designed to help in establishing links between the organizational business goals and measurement programs. However, there are no reported industrial experiences that demonstrate the practical value of the method. We designed a five-step research approach in order to assess the method’s practical value. The approach utilized revised Bloom’s taxonomy as a framework for assessing the practitioners’ cognition level of the concepts. The results of our study demonstrated that the method has practical value for the case company, and it is capable of addressing real-world problems. In the conducted empirical study, the cognition level of the practitioners was sufficient for a successful implementation of the method.", "num_citations": "13\n", "authors": ["1335"]}
{"title": "SAS: A tool for the GQM+Strategies grid derivation process\n", "abstract": " GQM+Strategies is an approach designed to help the software industry develop measurement programs that are aligned with business goals. The resulting structure, which aligns metrics (GQM goals) and business goals, is called a grid. Usefulness (quality) of the grids depends on how well the environment is characterized by the grid elements. Our research objective was to construct a tool which would support and improve the context/assumption definition and strategy selection activities of the grid derivation process. The constructive research work took place between two pilot applications of the GQM+Strategies approach. The first one identified key requirements, while the second one was used to test the tool. For the validation we used a questionnaire to assess practitioners’ feedback regarding usefulness of the tool. We augmented the GQM+Strategies toolbox with the SAS tool. The principles used to …", "num_citations": "11\n", "authors": ["1335"]}
{"title": "Towards multi-method research approach in empirical software engineering\n", "abstract": " This paper presents results of a literature analysis on Empirical Research Approaches in Software Engineering (SE). The analysis explores reasons why traditional methods, such as statistical hypothesis testing and experiment replication are weakly utilized in the field of SE. It appears that basic assumptions and preconditions of the traditional methods are contradicting the actual situation in the SE. Furthermore, we have identified main issues that should be considered by the researcher when selecting the research approach. In virtue of reasons for weak utilization of traditional methods we propose stronger use of Multi-Method approach with Pragmatism as the philosophical standpoint.", "num_citations": "9\n", "authors": ["1335"]}
{"title": "An extension of the GQM+Strategies approach with formal causal reasoning\n", "abstract": " Context: Successful organizations need to manage and synchronize their strategic objectives with daily operations and activities. In general, achieving that requires a continuous process of organizational alignment. GQM+Strategies is an approach that helps software organizations with documenting and aligning organizational goals and strategies, and developing measurement programs. Objective: In this paper, the GQM+Strategies approach is further evolved and extended to include capabilities to evaluate the relationships of organizational goals and strategies through causal analysis. Method: We used an analytical paradigm to develop a formal causal model over the GQM+Strategies structure. In addition, an empirical pre-experimental study was designed to test practitioners’ abilities to provide necessary input for the formal causal model. Results: A developed formal causal model over the GQM+Strategies …", "num_citations": "6\n", "authors": ["1335"]}
{"title": "On the Problem of Software Project Management Tools Coexistence and Migration\n", "abstract": " Software development is a complex process involving many diverse activities. In order to eliminate delays, stay within the budget, and prevent project runaways software project managers must control and guide the development team throughout the project's lifecycle. They apply a number of project management tools, of both economic and managerial nature, to help manage a number of important issues in the process of software development. Different project management tools (PMTs) can be used simultaneously within the same software project that can cause the problems with the data synchronization and the data exchange between these PMTs. Besides, during the changes which occur in the organization and its environment, an organization is sometimes forced or willing to migrate to other PMT (s). New tools mostly do not support previously used data formats. That way, a vast amount of data and knowledge about the projects that were managed with the support of legacy tools is lost. In this paper an approach to solve the problems of data synchronization, exchange and loss caused by PMTs' coexistence and migration is presented. It is suggested to design a data warehouse that transforms diverse data sources into an integrated data set for permanent, long-term storage. Integrated data provide a unified, reconciled view of project management data gathered by means of different project management tools suitable to analytical decision makers.", "num_citations": "1\n", "authors": ["1335"]}
{"title": "Do the microservices improve the agility of software development teams?\n", "abstract": " Nowadays, agile approaches are becoming the mainstream paradigm for organizing the software development teams. However, in practice, some aspects of the agility of software development, eg the speed of development, scalability, reusability, and modularity are constrained or diminished due to the software product design itself or because of the inappropriate use of technologies. The recent advancement in the service-oriented architectures and cloud technologies resulted with a concept of microservices. Microservices are small independently releasable, upgradable and replaceable services that work together around a business domain. They support agile development principles and core aspects stated above. In this paper, we review the available literature for microservices and point out their benefits. The literature findings are used for designing a questionnaire for gathering information from an industrial project that utilizes the concept of the microservices. Overall results confirm microservice effectiveness on a variety of system elements and factors stated in literature. Therefore conclusion about question do the microservices improve the agility of software development teams could be simple yes. But on the other hand, there are quite a few statements to consider described in this paper if we want to answer how and to what extent do microservices improve the software development agility.", "num_citations": "1\n", "authors": ["1335"]}
{"title": "Value-Management Challenges: Experiences from Research Projects with Finnish ICT Industry\n", "abstract": " Nowadays, the software industry has at its disposal several approaches that accentuate the concept of value, eg, lean or agile software development. However, our experience has shown that arriving at an understanding of what is meant by value in a given organizational context presents real challenges. And, one of the reasons for having those challenges is a difficulty to trace value creation in creative industries, like software or ICT. This motivated us to identify and describe the most common valuemanagement challenges we encountered while conducting two research projects with the Finnish ICT industry. We discuss the relationship between the value-management challenges and value traceability. Finally, we propose some concrete research tracks based on that discussion.", "num_citations": "1\n", "authors": ["1335"]}