{"title": "Empirical evaluation of an educational game on software measurement\n", "abstract": " Software measurement is considered important in improving the software process. However, teaching software measurement remains a challenging issue. Although, games and simulations are regarded powerful tools for learning, their learning effectiveness is not rigorously established. This paper describes the results of an explorative study to investigate the learning effectiveness of a game prototype on software measurement in order to make an initial judgment about its potential as an educational tool as well as to analyze its appropriateness, engagement and strengths & weaknesses as guidance for further evolution. Within the study, a series of experiments was conducted in parallel in three master courses in Brazil. Results of the study reveal that the participants consider the content and structure of the game appropriate, but no indication for a significant difference on learning effectiveness could be …", "num_citations": "83\n", "authors": ["1382"]}
{"title": "LeCs: A collaborative case study system\n", "abstract": " Research on Intelligent Tutoring Systems has much to contribute to distance learning applications. Recently the distance learning area has experienced an increasing demand for the development of applications that make use of the new information and communication technologies (e.g., the web) as the medium for delivering courses. Intelligent distance learning can supply this demand and also provide real-time support to the distance learning process through the incorporation of ITS techniques. In this paper we describe LeCS - a collaborative case study system. LeCS supports web-based distance learning from case studies, allowing collaborative learning between a group of learners that is geographically dispersed. It provides the necessary tools to carry out the case solution development and accomplishes functions that altogether assist the learning process.", "num_citations": "48\n", "authors": ["1382"]}
{"title": "Uma arquitetura baseada em agentes para suporte ao ensino à distância\n", "abstract": " Existe atualmente uma demanda pela modelagem de sistemas de suporte ao ensino colaborativo em ambientes distribuídos. Estes sistemas são ambientes eletrônicos que suportam e mediam trabalho e aprendizado cooperativo em uma rede de computadores.Este trabalho apresenta uma plataforma orientada a agentes para suportar a cooperação de usuários através da Internet. A plataforma proposta define uma arquitetura multiagente que adota a estrutura de um sistema de federação de agentes. A comunicação dos agentes utiliza um estrutura formalizada baseada na Linguagem de Comunicação de", "num_citations": "45\n", "authors": ["1382"]}
{"title": "Promovendo a Aprendizagem de Engenharia de Requisitos de Software através de um Jogo Educativo\n", "abstract": " Pesquisadores apontam que a origem das principais causas de falhas em projetos de desenvolvimento de software tem sido a execução inadequada do processo de Engenharia de Requisitos. Isto ocorre porque parte da mão de obra que entra no mercado de trabalho tem pouca ou nenhuma experiência para exercer a função de analista de requisitos. Este artigo apresenta um jogo educativo, desenvolvido em meio digital, que faz uso de aspectos lúdicos e de desafios para promover uma aprendizagem mais natural do processo de Engenharia de Requisitos. A avaliação da eficácia do jogo para o ensino foi realizada através de um experimento envolvendo mais de 30 alunos.", "num_citations": "35\n", "authors": ["1382"]}
{"title": "A method framework for engineering process capability models\n", "abstract": " Software Process Improvement, based on a Maturity Level or a Process Capability Profile, from a capability maturity model or an ISO/IEC 15504-based model, is well established in the software industry as a successful mean for improving software intensive organizations. In consequence there is an opportunity to understand how these models have been developed and consolidate this knowledge to support the development of new models by, among others, the industry. This article introduces a Method Framework for Engineering Process Capability Models as an element of a methodology on a Process Capability Profile to drive Process Improvement. This method framework is based on five previous successful experiences in which we experiment different processes to develop different process capability models. The current version is composed of sequential practices, customization rules, examples of utilization and examples of techniques. An initial validation indicates a first confidence that this method framework is a useful proposal for developing methods and processes for engineering process capability models.", "num_citations": "31\n", "authors": ["1382"]}
{"title": "Uma abordagem para a modelagem colaborativa de processos de software em micro e pequenas empresas\n", "abstract": " Este artigo descreve uma abordagem para a modelagem de processos de software adaptada para micro e pequenas empresas de software (MPEs). O trabalho propõe um modelo colaborativo que por meio de oficinas promove a discussão entre os envolvidos para a modelagem e validação dos processos. Para a validação inicial da abordagem, ela foi aplicada em 5 empresas em Florianópolis/SC.", "num_citations": "24\n", "authors": ["1382"]}
{"title": "TraceBoK: Toward a software requirements traceability body of knowledge\n", "abstract": " This paper introduces the idea of building a body of knowledge (BoK) to gather the better practices in software requirements traceability that could bring major benefits for analyzing, managing, and implementing software changes impact. The implementation of traceability in the organizations is still a challenge even many studies have been conducted on the subject. The aim of this work is to evaluate traceability approaches focusing on software product traceability by a systematic review. We conducted a series of interviews with practitioners to complement the evaluation. Based on this study, we categorize the approaches, and we propose a body of knowledge (Bok) on traceability requirements TraceBoK. This BoK intends to assist software engineers to decide how to define an implementation of traceability in the development and maintenance of software products. Experts in traceability have evaluated this BoK …", "num_citations": "19\n", "authors": ["1382"]}
{"title": "Empirical study upon software testing learning with support from educational game.\n", "abstract": " Although software testing is seen as one of the main quality measurements of software, test practices and techniques are still seldom applied by software development companies. One possible reason to this scenario is the lack of skilled and available professionals to implements such techniques and practices. The teaching of software testing is typically approached as a topic of Software Engineering lectures. In this context, one of the main challenges is to allow the student to apply the concepts seen in classroom. The developed educational game aims to allow the students to practice through experimenting concepts, techniques and practices of software testing in a simulated environment. To evaluate the game contribution, we present the results of two experiments performed with undergraduate students. In the first experiment the learning effectiveness was compared to students who did not play the game. In the …", "num_citations": "16\n", "authors": ["1382"]}
{"title": "Intelligent agent-based approach for distance learning\n", "abstract": " This work proposes a multi-agent approach for the development of personal software agents supported by networks. Personal assistants that help users with several tasks like finding information, learning, scheduling calendars or consulting to decision-making are generalpurpose systems that can be viewed as a collection of intelligent agents. A distributed framework with three different types of agents will be defined in this paper. Each type of agent uses different intelligent techniques to solve specific problems. The combination of these agents provides an environment that supports and mediates the cooperative work and learning in a network. The use of the proposed framework for supporting distance learning will be shown as an application. In addition, this paper will discuss another possible scenario: an application for working capital administration.", "num_citations": "12\n", "authors": ["1382"]}
{"title": "Avaliação da aprendizagem em experimentos com jogo educativo de engenharia de requisitos\n", "abstract": " A Engenharia de Requisitos tem sido apontada como a origem das principais causas na falha de projetos de software em empresas. Isto vem ocorrendo, entre outros motivos, porque parte dos estudantes entra no mercado de trabalho sem a experiência necessária para exercer a função de analista de requisitos. Como consequência, projetos podem não atender as expectativas do cliente, uma vez que falta a aplicação de boas práticas da Engenharia de Requisitos. O objetivo deste trabalho é avaliar empiricamente a aprendizagem de Engenharia de Requisitos por meio de aplicações de um jogo educacional. A avaliação é apresentada a partir de dois experimentos com alunos de curso superior, indicando que o uso de jogos educativos pode contribuir para a aprendizagem de Engenharia de Requisitos.", "num_citations": "11\n", "authors": ["1382"]}
{"title": "Using Technologies as Virtual Environments for Computer Teaching: A Systematic Review.\n", "abstract": " This research discusses the use of Augmented Reality, Virtual Reality and Mixed Reality technology applications in the learning process of relevant content to the Computer Science area. This systematic review aims to identify applications that use technologies to represent virtual environments and support the teaching and learning of Computer Science subjects. A protocol was elaborated and executed, resulting in the final selection of 14 papers from four databases, published from 2010 to 2018. The examined papers presented information that categorized technology applications in terms of tools used. Contents addressed to the identification of applied instructional strategies and techniques, and the recognition of effects on the learning process. As a result, we found virtual environments that show potential to teaching basic content in courses related to Computer Science. In addition, the application of virtual …", "num_citations": "10\n", "authors": ["1382"]}
{"title": "GreenRM: Reference Model for Sustainable Software Development.\n", "abstract": " Information technology and the environment have a relationship until then signaled by the effects caused by excessive energy consumption, greenhouse gas emissions and the e-waste. In our paper we present the GreenRM reference model for sustainable software development. We focus on the model structure definition and the benefits identified with its implementation. We also present a comparison between the model processes and attributes with the environmental requirements of ISO/IEC 14001 to demonstrate its compatibility. In addition we present a model early assessment in three Brazilian software organizations to evaluate the model technical and financial feasibility.", "num_citations": "9\n", "authors": ["1382"]}
{"title": "Gamificaçao: Agente motivador na aprendizagem de engenharia de software\n", "abstract": " Estudos mostram que a utilização da Gamificação e de elementos de jogos em ambientes sérios podem aumentar a motivação para execução de atividades. A utilização de Gamificação em ambientes de aprendizagem vem sendo estudada para demonstrar sua eficiência em relação à motivação. Além da motivação extrínseca, ela permite também a geração de motivação intrínseca. Desta forma, a utilização da Gamificação na educação pode contribuir para aumentar a motivação dos estudantes no processo de aprendizagem, já que as atividades acadêmicas tradicionais são usualmente consideradas monótonas. Este trabalho apresenta a análise da relação entre a motivação e o efeito na aprendizagem a partir de um ambiente gamificado.", "num_citations": "8\n", "authors": ["1382"]}
{"title": "Técnicas para Engenharia de Modelos de Capacidade de Processo de Software\n", "abstract": " With the success of Software Process Improvement, based on Process Capability Model, there is an opportunity to understand how these models have been developed and consolidate this knowledge to support the development of new models by, among others, the industry. This article presents techniques for Engineering Process Capability Models as an element of a Method Framework for such engineering. The current version is composed of a set of techniques already used in experiences of develop, evolve and customize Process Capability Models. An initial validation indicates a first confidence that this method framework, including the set of techniques, is a useful proposal for developing methods and processes for engineering process capability models.", "num_citations": "8\n", "authors": ["1382"]}
{"title": "Mapping process capability models to support integrated software process assessments\n", "abstract": " Software process assessments have been used to verify the conformance with quality reference models or standards, usually in a context of software process improvement programs. Most of these assessments are concerned with just one specific model or standard. However, organizations could be interested in more than one model, being necessary to offer an integrated assessment that allows evaluate the conformance with different models at the same time, reducing time and costs. To do this, it is necessary to have some kind of mapping among the models to permit some level of automation. In this context, this paper presents a method to mapping process capability models and standards, including its application. A software tool is also presented to demonstrate how to use the resulting mapping in a real life situation.", "num_citations": "6\n", "authors": ["1382"]}
{"title": "FAPS: Ferramenta para apoiar Avaliações Integradas de Processos de Software\n", "abstract": " Este trabalho apresenta uma ferramenta para apoiar uma avaliação integrada de processos de software que reúne os requisitos de modelos e normas de referência reconhecidos nacional e internacionalmente como os modelos MPS. BR, CMMI e a norma ISO/IEC 15504 em um único processo de avaliação. A ferramenta desenvolvida quando aplicada deve permitir que uma organização realize uma avaliação alinhada com os requisitos de todos os modelos e norma supracitados simultaneamente.", "num_citations": "6\n", "authors": ["1382"]}
{"title": "Microservices identification strategies: A review focused on Model-Driven Engineering and Domain Driven Design approaches\n", "abstract": " A proper architectural design for a microservices system is crucial for its success. Although there are several design strategies to identify software components in general, microservices demands special consideration. In this context of distributed systems, the component size directly impacts on nonfunctional requirements, such as performance, flexibility, reusability, etc. Design practices of coupling and cohesion have to be fine-tuned to determine the ideal microservices granularity. In order to shed light on this question, this study conducted a Systematic Literature Review that investigates microservices identification proposals. From procedures and guidelines inspired by Kitchenham et al., a rigorous research protocol was defined and performed, that covers publications from 2013 to 2019. Starting with an initial screening of 715 papers, 27 studies were considered relevant to answer four research questions. Besides …", "num_citations": "5\n", "authors": ["1382"]}
{"title": "A Method for Tridimensional Process Assessment Using Modelling Theory\n", "abstract": " This article introduces a process assessment method that uses modeling theory to consider the continuously improved process under three dimensions. These dimensions are related with three types of process models used during a process improvement cycle: Process Capability Profile model, Process Enactment Description model and Process Performance Indicator model. The article presents the motivations for this work, the objectives, methodology and process for this work, a description of the proposed method, experiences using the method and considerations about its evaluation.", "num_citations": "5\n", "authors": ["1382"]}
{"title": "Modelo de Capacidade de Processo para o Software Público Brasileiro\n", "abstract": " Este artigo descreve o desenvolvimento da versão preliminar do Modelo de Capacidade de Processo para o Software Público Brasileiro. O modelo é construído cooperativamente e de forma compartilhada por universidades, grupos de pesquisa e com apoio das próprias comunidades do Portal do Software Público Brasileiro. Sua construção é coordenada pelo Centro de Tecnologia da Informação Renato Archer em parceria com Laboratório de Qualidade e Produtividade de Software da Univali. Este trabalho é financiado pela FINEP e integra o projeto de construção de um Modelo de Referência de Capacidade de Processo de Software alinhado às características e necessidades das comunidades do Portal do Software Público Brasileiro.", "num_citations": "5\n", "authors": ["1382"]}
{"title": "Practices and Techniques for Engineering Process Capability Models\n", "abstract": " Software Process Improvement, based on a Maturity Level or a Process Capability Profile, from a Capability Maturity Model or an ISO/IEC 15504-based model, is well established in the software industry as a successful practical means for improving software intensive organizations. In consequence there is an opportunity to understand how these models have been developed and consolidate this knowledge to support the development of new models by a broader community including the industry. This article introduces practices and techniques of a Method Framework for Engineering Process Capability Models as an element of a methodology on a Process Capability Profile to drive Process Improvement. This method framework is based on previous experiences to develop different process capability models. Its current version is composed of sequential practices, customization rules, guidelines for using the framework, a repository for examples of utilization and another repository for examples of techniques. This method framework is part of a methodology. An initial validation indicates a first confidence that this method framework is a useful proposal for developing methods and processes for engineering process capability models.", "num_citations": "5\n", "authors": ["1382"]}
{"title": "Specification of a MIB XML for Systems Management\n", "abstract": " This work presents an XML application for systems management. The main purpose is showing how to map the information from a MIB to a XML document. It introduces the system management architecture based on SNMP and XML agents. According to the MIB proposed a DTD file, containing the available information structure, is specified to represent the management information. The mapping from MIB to XML document follows some rules: identifiers are defined to mapping the management information representation; the script file is created to associate the information from the DTD file to an identifier; The collect file is created to represent the MIB with the information collected automatically from the system management; the XML file is created from the DTD file using the script (contents) and collect (information) files. A Web application is also presented to show the use of XML document as a MIB and its results.", "num_citations": "5\n", "authors": ["1382"]}
{"title": "Accessible Features to Support Visually Impaired People in Game Development:: A Systematic Literature Review of the last 15 years\n", "abstract": " This paper presents a systematic review of the literature to investigate best practices for developing digital games for people with visual impairments. The execution of the search protocol that focused on papers published between 2004 and 2019, 17 papers were obtained from two online databases. The selected papers present information about the application of accessibility features that were tested in a minimum viable product applied to people with visual impairments. As a result, it was found that most papers focus on navigation systems, which is a feature used in most digital games, and all of them make use of sound effects. In most of the researched papers, audio is the main instrument to assist the visually impaired player. The development features presented in the systematic review can serve as a basis for developers in the field. Finally, there is still little content in the literature on accessible features …", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Diagnóstico de processos em organizações intensivas em software usando um sistema especialista\n", "abstract": " Este trabalho apresenta o desenvolvimento de um sistema especialista para auxiliar no diagnóstico automatizado do ciclo de vida de desenvolvimento de software de uma organização. A metodologia, envolveu a participação de especialistas na área de melhoria de processos e de organizações intensivas em software. O principal objetivo do diagnóstico automatizado é avaliar a situação atual dos processos da organização, identificando pontos fracos e fortes que servirão de base para iniciativas de melhoria de processo. A avaliação dos resultados está sendo realizada sob o ponto de vista de especialistas e das organizações. São apresentados os resultados da avaliação com 6 organizações e 7 especialistas.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Green metrics to software development organizations: a systematic mapping\n", "abstract": " Green IT and computing are key areas to contribute with the environment sustainability. Recent researches have been exploring tools, practices, process, frameworks, reference models in Green IT, as well as they are mitigating the impact of the technology on the user of raw materials, electrical energy costs, greenhouse gas emissions or generation e-waste. Sizing up earnings and costs of green practices and processes will allow that software organizations can invest more in environment actions. This paper presents a systematic mapping study about green metrics, with objective to discover the state-of-the art drived by software engineering.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "SPI City: Jogo Educacional para Apoiar o Ensino de Melhoria de Processo de Software\n", "abstract": " Pesquisas tem demonstrado que uma das principais dificuldades na mplementação de Melhoria de Processo de Software estão relacionadas com a falta de conhecimento sobre as técnicas básicas da Engenharia de Software e a falta de entendimento dos modelos de referência de processo de software. Este artigo apresenta um jogo desenvolvido, em meio digital, para apoiar a capacitação de Melhoria de Processo de Software. O jogo simula situações do dia a dia de empresas de desenvolvimento de software em que os resultados esperados do Modelo de Referência MPS para Software (MR-MPS-SW) são explorados. O artigo ainda apresenta os resultados dos experimentos realizados com o jogo que permitiram comprovar que ele auxilia na aprendizagem de Melhoria de Processo de Software.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Autodiagnóstico de processo de software baseado em sistema especialista\n", "abstract": " Há diversos métodos e modelos que são utilizados para apoiar as iniciativas de melhoria de processos de software. A primeira etapa do processo de melhoria, independente da abordagem ou modelo adotado, é utilizar um diagnóstico do estado atual do processo. Esta atividade é complexa com relação à análise de dados (realizada manualmente) e implica que a mesma seja realizada por um especialista. Considerando que a maioria das empresas de software no Brasil é formada por micro e pequenas empresas, nem sempre é possível contratar um especialista para avaliar o seu processo. Sendo assim, este artigo apresenta uma abordagem de autodiagnóstico utilizando um sistema web baseado em sistema especialista.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Revealing the influence of leadership on software process improvement initiatives\n", "abstract": " Studies on factors influencing Software Process Improvement initiatives (SPI) has revealed that in addition to technological factors, human and social factors also interfere in their success. An investigation to understand the influence of leadership initiatives in SPI is important to identify alternatives to SPI programs so they can be managed more effectively. This paper presents a work in progress mapping on leadership, specifically in SPI initiatives. The paper presents the selected publications with emphasis on findings related to leadership initiatives in SPI. With this work, we found that there is still space in the literature for research specifically on the influence of leadership in SPI initiatives, providing an opportunity for contributions that will be explored in this work in progress by the authors.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Compreendendo a influência da liderança nas iniciativas de melhoria de processo de desenvolvimento de software\n", "abstract": " Estudos sobre fatores que influenciam as iniciativas de melhoria de processo de software (MPS) tem revelado que além dos fatores tecnológicos fatores humanos e sociais também interferem em seu sucesso. Uma investigação para compreender a influência da liderança nas iniciativas MPS é relevante para identificar alternativas para os programas de MPS poderem ser geridos de forma cada vez mais efetiva. Este artigo apresenta um mapeamento de estudos relativos à liderança, especificamente em iniciativas de MPS. O trabalho apresenta as publicações estudadas, dando ênfase nos achados referentes à liderança nestas inciativas. Com este trabalho, foi possível verificar que ainda existe espaço na literatura para uma pesquisa especificamente sobre a influência da liderança em iniciativas de MPS oferecendo uma oportunidade para contribuições que serão exploradas pelos autores em trabalhos futuros.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Um framework de métodos para o desenvolvimento de modelos de capacidade de processo\n", "abstract": " Está estabelecido na indústria que uma forma bem sucedida de se alcançar a melhoria de processos das organizações intensivas em software é seguir modelos de maturidade ou capacidade como os modelos do Capability Maturity Model Integration (CMMI) ou da norma ISO/IEC 15504. Isto incentiva o estudo para compreender melhor como estes modelos são construídos e a pesquisa para definir uma sistemática que auxilie na elaboração de novos modelos de capacidade de processo para domínios específicos. Esta dissertação apresenta um Framework de Métodos para a Construção de Modelos de Capacidade de Processo como elemento de uma metodologia de Perfil de Capacidade de Processo para orientar a Melhoria de Processos. Este framework de métodos foi construído com base em experiências anteriores bem sucedidas com a aplicação de processos distintos para desenvolver diferentes modelos de capacidade de processo. O Framework de Métodos é constituído de uma sequência de práticas, regras de customização, exemplos de utilização e exemplos de técnicas utilizadas para a construção de modelos de capacidade de processo. O framework foi inicialmente avaliado a partir do mapeamento das práticas e regras no processo de desenvolvimento de modelos existentes de reconhecimento nacional e internacional. A aplicação do framework é ainda demonstrada por meio da instanciação de um método para a construção de um modelo inédito de capacidade de processo para o Software Público Brasileiro.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Um chatterbot para auxiliar no aprendizado em qualidade de software\n", "abstract": " Este artigo procura fazer uma contribuição na utilização de chatterbots para auxiliar no aprendizado em qualidade de software. Grande parte dos ambientes existentes atualmente para educação à distância está focada no uso de ferramentas tradicionais como chats e fóruns, os chatterbots funcionam como uma alternativa a essas ferramentas, nele o usuário obtém as informações através de uma conversa, com a vantagem de ter acesso às informações a qualquer momento. Chatterbots são programas que possuem a capacidade de interagir com o usuário por meio de textos. O chatterbot criado utiliza uma base de conhecimento desenvolvida na linguagem AIML e possui conhecimentos em qualidade de software.", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Aplicando avaliações de contextualização em processos de software alinhados ao cmmi-se/sw\n", "abstract": " In the context of the research project GOAL 1/PLATIC (Information and Communication Technology Platform), 5 overview assessments have been realized in software organizations of different size in the beginning of the process improvement programs. The objective of these assessments has been to understand in a general manner the actual situation of the software process of the organizations focusing on improvement in alignment with maturity level 2 of the CMMI-SE/SW. In this paper, we briefly present the method used for the overview assessments and our experiences applying the method in 5 organizations in Florianópolis, including costs, benefits and lessons learned.Resumo. No contexto do projeto META1/PLATIC–Plataforma de Tecnologia da Informação e Comunicação, no início dos programas de melhoria de processo, foram realizadas 5 avaliações de contextualização (overview assessments) em …", "num_citations": "4\n", "authors": ["1382"]}
{"title": "Self-adaptive Systems Driven by Runtime Models.\n", "abstract": " Model-Driven Software Engineering (MDSE) represents a promising research area with a variety of challenging issues open for discussion. Expanding the limits of the MDSE paradigm, runtime models keep abstract representations of the running system in order to trigger on-the-fly software reconfigurations. One of the most popular applications of runtime models are self-adaptive systems, since abstractions can be finetuned not only in the development phases, but also in runtime. As this kind of system needs to modify its behavior during execution, this can be achieved by means of high-level model interventions. The objective of this article is to present relevant approaches of self-adaptive systems driven by runtime models. This article can help practitioners to get an overall picture of current approaches, in terms of methods, techniques and tools. Researchers can also be inspired to create new or to extend current approaches, facing the challenges identified here. To that end, we conducted a rigorous Systematic Literature Review based on the guidelines proposed by Kitchenham. This paper provides answers for four research questions, based on 16 selected articles. In the conclusion, we present some considerations and challenges based on the results obtained from this review.", "num_citations": "3\n", "authors": ["1382"]}
{"title": "eLISA: informatização do sistema integrado de bibliotecas da UNIVALI–SIBIUN eLISA: an automated integrated system for UNIVALI libraries-SIBIUN p. 28-40\n", "abstract": " Este trabalho apresenta a importância que a informática vem exercendo sobre as bibliotecas do SIBIUN (Sistema Integrado de Bibliotecas da UNIVALI), através da experiência com uma nova ferramenta tecnológica. O software eLISA gerencia todo o material bibliográfico do sistema, bem como, os dados referentes aos seus usuários. Ele auxilia o usuário na busca e recuperação da informação desejada. O software foi desenvolvido para permitir uma evolução contínua, visando um melhor atendimento à comunidade acadêmica em geral e a seus usuários diretos e indiretos.Abstract: This work presents the importance of the library automation on the libraries of SIBIUN (Libraries Integrated System of UNIVALI), showing the experience with a new technological tool. The software eLISA manages all the system bibliographic material as well the data about its users. It helps the user to find and to recover the desired information. The software was developed to allow further enhancements. It offers na improved service to the general academic community and to their direct and indirect users.", "num_citations": "3\n", "authors": ["1382"]}
{"title": "Um Ambiente Colaborativo para o Ensino à Distância\n", "abstract": " A aprendizagem colaborativa é uma característica implícita na aprendizagem através de estudos de caso, na medida em que o método requer que os estudantes colaborem para resolver um caso. Neste artigo, descreve-se um ambiente de aprendizado colaborativo inteligente que apoia a atividade de grupo na aprendizagem através de estudos de caso à distância. A arquitetura do sistema é baseada em agentes e o sistema dá assistência aos estudantes durante o processo colaborativo de desenvolver uma solução para um estudo de caso.", "num_citations": "3\n", "authors": ["1382"]}
{"title": "Aplicando avaliações de contextualização em processos de software alinhados ao nível F do MR-MPS v1. 2\n", "abstract": " Objetivo➢ Apresentar os resultados obtidos com a aplicação da abordagem de avaliação de contextualização adaptada para atender aos processos do nível F dom modelo MPS. BR", "num_citations": "2\n", "authors": ["1382"]}
{"title": "Ludic Practices to Support the Development of Software Engineering Educational Games: A Systematic Review\n", "abstract": " In this paper we presente a systematic review of the literature with the objective of identifying playful practices used in educational games. From this result, began the construction of a catalog of playful practices to support the development of educational games. Our research is focused initially on the area of Software Engineering. However, the structure of the systematic review and the catalog under development can be extended to other areas. With a traceable structure among the key elements of the catalog (play practices, levels of knowledge and contents), we try to present a practical reference material for developers of educational games or even for teachers who want to apply recreational activities in the classroom. The catalog under construction is available on a wiki in order to enable it to grow collaboratively. In addition to the results of the systematic review, this article also presents an initial version of the …", "num_citations": "1\n", "authors": ["1382"]}
{"title": "Integrando requisitos, gestão de defeitos e gestão de testes de software\n", "abstract": " Considerando os sistemas para gestão de requisitos, testes e defeitos, percebe-se, nas principais ferramentas gratuitas usadas atualmente, que não há uma solução integrada para documentar, no mesmo sistema, os testes executados e os defeitos encontrados durante o processo de desenvolvimento de software. Além do fato de ter que usar no mínimo duas ferramentas diferentes, esses sistemas não empregam boas práticas de usabilidade, então as empresas tendem a não documentar ou documentar apenas uma parte do processo. Diante desses fatos, este trabalho desenvolveu um único sistema que contempla as funcionalidades essenciais presentes nas ferramentas gratuitas e emprega boas práticas de usabilidade.", "num_citations": "1\n", "authors": ["1382"]}
{"title": "MPVerde–Modelo de Referência para Aplicação de Processos Verdes em Organizações de Software\n", "abstract": " Este artigo apresenta um modelo de referência para apoiar a implementação de processos e práticas verdes em organizações de desenvolvimento de software. O modelo proposto é estruturado em níveis de capacidade e maturidade, tendo sido desenvolvido com base em conceitos e práticas da TI verde. A preocupação com o meio ambiente traz um diferencial de mercado importante para estas organizações e pode proporcionar um ambiente organizacional que estimula o crescimento individual dos seus profissionais. Este trabalho apresenta ainda o resultado de avaliações do modelo em três organizações de desenvolvimento de software.", "num_citations": "1\n", "authors": ["1382"]}
{"title": "A method to define process capability profiles from the characteristics of very small software enterprises\n", "abstract": " This work presents a method for the definition of process capability profiles lined up with the specific business model of small software companies. The developed method is made up of a process, artifacts and guides that assist to obtain process profiles, considering the specific characteristics (business model, enterprise growth stage and value discipline) of each small software company. Therefore, the application of the method allows selecting a set of adjusted processes and lined up with the business model offering more objective improvement actions to a small software company. Partial results obtained during a pilot evaluation of the method in a small software company in Florianópolis/SC are also presented.", "num_citations": "1\n", "authors": ["1382"]}
{"title": "A Collaborative Framework To Support Distance Learning In Production Engineering\n", "abstract": " Supporting Distance Learning in Production Engineering involves enabling collaboration between two or more learners in a distributed environment that runs over a computer network. This implies in both providing a computational framework for collaborative learning and supporting the learning process in a different kind of media. The computational framework for collaborative learning consists of a system that includes the necessary tools for the learners to carry out the required learning activities. Supporting the learning process means providing some assistance to the learners, concerning the functions which are performed by the teacher in the traditional classroom according to the educational method used. In this paper we present our computational, Artificial Intelligence-based approach to the design of a collaborative framework to support distance learning from case studies in production engineering. The context for this application is a distance course on production engineering that includes disciplines containing openended problems about design, analysis, selection, planning, and/or business decision situations.", "num_citations": "1\n", "authors": ["1382"]}