{"title": "Service-oriented middleware for the future internet: state of the art and research directions\n", "abstract": " Service-oriented computing is now acknowledged as a central paradigm for Internet computing, supported by tremendous research and technology development over the last 10 years. However, the evolution of the Internet, and in particular, the latest Future Internet vision, challenges the paradigm. Indeed, service-oriented computing has to face the ultra large scale and heterogeneity of the Future Internet, which are orders of magnitude higher than those of today’s service-oriented systems. This article aims at contributing to this objective by identifying the key research directions to be followed in light of the latest state of the art. This article more specifically focuses on research challenges for service-oriented middleware design, therefore, investigating service description, discovery, access, and composition in the Future Internet of services.", "num_citations": "216\n", "authors": ["115"]}
{"title": "Applying the 3C model to groupware development\n", "abstract": " This paper introduces an approach based on the 3C (communication, coordination and cooperation) collaboration model to the development of collaborative systems. The 3C model is studied by means of a detailed analysis of each of its three elements, followed by a case study of a learningware application and the methodology of a web-based course, both designed based on this model. Moreover, this paper describes a component-based system architecture following this 3C approach.", "num_citations": "201\n", "authors": ["115"]}
{"title": "Do modelo de colaboração 3c à engenharia de groupware\n", "abstract": " This paper introduces an engineering approach based on the 3C model (Communication, Coordination and Cooperation) to the design and implementation of collaborative systems. Initially the 3C collaboration model is detailed. Then, a software development cycle is presented, being mapped to Groupware Engineering.Resumo. Este artigo introduz uma abordagem de engenharia baseada no modelo 3C (Comunicação, Coordenação e Cooperação) para o projeto e implementação de sistemas colaborativos. Inicialmente, o modelo de colaboração 3C é apresentado. Em seguida, é mostrado um ciclo de desenvolvimento de software, mapeando suas fases para a Engenharia de Groupware.", "num_citations": "170\n", "authors": ["115"]}
{"title": "The 3c collaboration model\n", "abstract": " Computational support for collaboration may be realized through the interplay between communication, coordination, and cooperation tools. Communication is related to the exchange of messages and information among people; coordination is related to the management of people, their activities and resources; and cooperation is the production taking place on a shared workspace. This model, which we call the 3C model, was originally proposed by Ellis, Gibbs, and Rein (1991), with some terminological differences. Cooperation, which Ellis et al. denominates “collaboration,” here characterizes the joint operation in a shared workspace.", "num_citations": "151\n", "authors": ["115"]}
{"title": "The development and application of distance learning courses on the internet\n", "abstract": " This paper presents the methodology, results and difficulties encountered in the development and delivery of a course through the Internet. The course, which is about the application of information technology to education, is being delivered using the AulaNet environment, which is groupware for the creation, participation and maintenance of Web-based courses. A model for group work is provided. This paper also shows how this kind of environment can be used to provide support, and to facilitate and manage cooperative learning.", "num_citations": "144\n", "authors": ["115"]}
{"title": "Engenharia de Groupware: desenvolvimento de aplicações colaborativas\n", "abstract": " A tecnologia gera ambientes que dão suporte às diferentes formas de relacionamento humano e, por conseguinte, revoluciona o modo de se trabalhar na sociedade conectada. A criação de espaços de compartilhamento e troca de informação propicia o trabalho colaborativo distribuído e descentralizado. A Engenharia de Software, que muito avançou no desenvolvimento de aplicações mono-usuário, foi buscar na área de CSCW—trabalho colaborativo apoiado por computadores—os conceitos necessários para esta nova realidade.Este curso é uma introdução à tecnologia de groupware, software para apoiar o trabalho colaborativo. O assunto é apresentado do ponto de vista conceitual, propondo um modelo de colaboração baseado nos aspectos de Comunicação, Coordenação e Cooperação. Também é formulada uma proposta de Engenharia de Groupware, com a qual espera-se identificar os elementos necessários à criação de aplicações colaborativas, trabalhando com requisitos de groupware e técnicas de UML (Unified Modeling Language) estendida para esta finalidade. As abordagens conceitual e ferramental são discutidas usando exemplos de aplicações de groupware.", "num_citations": "128\n", "authors": ["115"]}
{"title": "Modelo 3C de Colaboração para o desenvolvimento de Sistemas Colaborativos\n", "abstract": " Este artigo apresenta como o Modelo 3C de Colaboração (Comunicação, Coordenação e Cooperação) tem sido apropriado por nosso grupo de pesquisa para o desenvolvimento de sistemas colaborativos. Constata-se que este modelo é útil em diferentes etapas do processo de desenvolvimento: para auxiliar a análise do groupware a ser desenvolvido; no estabelecimento do foco para o desenvolvimento de sucessivas versões do groupware num processo iterativo e investigativo; e para o desenvolvimento de arquitetura e componentes 3C.", "num_citations": "85\n", "authors": ["115"]}
{"title": "How should my chatbot interact? A survey on social characteristics in human–chatbot interaction design\n", "abstract": " Chatbots’ growing popularity has brought new challenges to HCI, having changed the patterns of human interactions with computers. The increasing need to approximate conversational interaction styles raises expectations for chatbots to present social behaviors that are habitual in human–human communication. In this survey, we argue that chatbots should be enriched with social characteristics that cohere with users’ expectations, ultimately avoiding frustration and dissatisfaction. We bring together the literature on disembodied, text-based chatbots to derive a conceptual model of social characteristics for chatbots. We analyzed 56 papers from various domains to understand how social characteristics can benefit human–chatbot interactions and identify the challenges and strategies to designing them. Additionally, we discussed how characteristics may influence one another. Our results provide relevant …", "num_citations": "82\n", "authors": ["115"]}
{"title": "Why is programming so difficult to learn? Patterns of Difficulties Related to Programming Learning Mid-Stage\n", "abstract": " New software engineers and casual developers are needed in many different areas. However, students face many difficulties while learning the logic of computer programming, frequently failing in university courses. This Ph.D. research aims to identify difficulty patterns related to learning how to program, a crucial part of software engineers training. The research methodology comprises studies that put together results from a systematic literature review and empirical data collected from qualitative and quantitative studies. The difficulties identified will be compiled into a model, which may assist students in sharpening their focus, and teachers in preparing their lessons and teaching material, as well as researchers in employing methods and tools to support learning", "num_citations": "76\n", "authors": ["115"]}
{"title": "Inter-and intra-relationships between communication coordination and cooperation in the scope of the 3C Collaboration Model\n", "abstract": " Based on the 3C collaboration model, this article descries the mapping of a variety of collaboration forms onto inter-relationships between communication, coordination and cooperation. In order to investigate how to provide computational support for these three functional collaboration dimensions the analysis shifts from the inter-relationships between these three dimensions to their intra-relationships. Finally, Gestalt psychology principles are used to discuss the suitability of the approach to human perception.", "num_citations": "76\n", "authors": ["115"]}
{"title": "Teorias e modelos de colaboração\n", "abstract": " Teorias e modelos de colaboração fornecem uma visão sobre como e porque as pessoas trabalham em grupo. Neste capítulo discutimos as Teorias dos Jogos, a Teoria da Atividade, o Modelo 3C de Colaboração, Padrões de Colaboração e o Modelo de Tuckman sobre o Desenvolvimento de Grupo. As teorias e modelos nos apoiam a analisar o trabalho em grupo para que possamos selecionar e projetar sistemas colaborativos.", "num_citations": "58\n", "authors": ["115"]}
{"title": "No need to read messages right now: helping mediators to steer educational forums using statistical and visual information\n", "abstract": " In an education environment, a forum provides a valuable tool that can be used to foster reflection and a deeper analysis of subjects being discussed. However, as an asynchronous communication tool, participation can occur at any time, demanding a constant attention of the teacher to satisfactorily mediate the group and the discussion. In addition, a reasonable number of messages can be posted in a short period of time, making it hard to follow up and coordinate the discussion. This paper proposes an approach based on statistical and visual analysis of messages characteristics to alert the teacher about potential problems.", "num_citations": "58\n", "authors": ["115"]}
{"title": "Projeto de Comunicação em Groupware: desenvolvimento, interface e utilização\n", "abstract": " Este texto apresenta a comunicação em groupware, software voltado para o apoio ao trabalho em grupo, detalhando um modelo de colaboração baseado nos conceitos de comunicação, coordenação e cooperação. São apresentados ferramentas de comunicação e exemplos de aplicações. Com base nesta abordagem, são introduzidos aspectos especificamente voltados à comunicação, com os quais espera-se subsidiar o desenvolvimento de projetos de comunicação em groupware.", "num_citations": "56\n", "authors": ["115"]}
{"title": "Desenvolvimento de groupware componentizado com base no modelo 3C de colaboração\n", "abstract": " Janeiro, 2006. 275p. Tese de Doutorado–Departamento de Informática, Pontifícia Universidade Católica do Rio de Janeiro.", "num_citations": "53\n", "authors": ["115"]}
{"title": "Suporte à percepção em ambientes de aprendizagem colaborativa\n", "abstract": " Neste artigo é analisado como a percepção se relaciona com a comunicação, com a coordenação e com a cooperação, e conseqüentemente com a colaboração, entre pessoas em ambientes de aprendizagem colaborativa. Para isto é apresentado um modelo de colaboração e os elementos de percepção do ambiente AulaNet são analisados, buscando-se identificar quais são as informações relevantes, como são geradas, como os elementos de percepção–elementos da interface do ambiente por onde são disponibilizadas as informações destinadas a prover percepção–foram definidos e como os indivíduos têm controle sobre eles. Estas análises visam levantar subsídios para o projeto de elementos de percepção em ambientes de aprendizagem colaborativa.", "num_citations": "53\n", "authors": ["115"]}
{"title": "Single or multiple conversational agents? An interactional coherence comparison\n", "abstract": " Chatbots focusing on a narrow domain of expertise are in great rise. As several tasks require multiple expertise, a designer may integrate multiple chatbots in the background or include them as interlocutors in a conversation. We investigated both scenarios by means of a Wizard of Oz experiment, in which participants talked to chatbots about visiting a destination. We analyzed the conversation content, users' speech, and reported impressions. We found no significant difference between single-and multi-chatbots scenarios. However, even with equivalent conversation structures, users reported more confusion in multi-chatbots interactions and adopted strategies to organize turn-taking. Our findings indicate that implementing a meta-chatbot may not be necessary, since similar conversation structures occur when interacting to multiple chatbots, but different interactional aspects must be considered for each scenario.", "num_citations": "51\n", "authors": ["115"]}
{"title": "Is the unfolding of the group discussion off-pattern? Improving coordination support in educational forums using mobile devices\n", "abstract": " A forum is a valuable tool to foster reflection in an in-depth discussion; however, it forces the course mediator to continually pay close attention in order to coordinate learners’ activities. Moreover, monitoring a forum is time consuming given that it is impossible to know in advance when new messages are going to be posted. Additionally, a forum may be inactive for a long period and suddenly receive a burst of messages forcing forum mediators to frequently log on in order to know how the discussion is unfolding to intervene whenever it is necessary. Mediators also need to deal with a large amount of messages to identify off-pattern situations. This work presents a piece of action research that investigates how to improve coordination support in a forum using mobile devices for mitigating mediator’s difficulties in following the status of a forum. Based on summarized information extracted from message meta-data …", "num_citations": "51\n", "authors": ["115"]}
{"title": "Use of categorization and structuring of messages in order to organize the discussion and reduce information overload in asynchronous textual communication tools\n", "abstract": " This paper shows how the use of categorization and structuring of messages in asynchronous textual communication tools could be useful in course delivery via the Internet in order to facilitate the argumentation and to guide the participants to reflect about their messages. Although the use of categorization caused an increase in the total number of messages, there was a reduction of the information overload and an increase in the quality of the discussion. We also show how the message categorization was used in a distance course delivered through the AulaNet environment, showing how we defined and improved the set of categories, and how it helped the students.", "num_citations": "49\n", "authors": ["115"]}
{"title": "Development of groupware based on the 3C collaboration model and component technology\n", "abstract": " Groupware is evolutionary and difficult to develop and maintain. Thus, its code becomes unstructured and difficult to evolve. In this paper, a groupware development approach based on components organized according to the 3C collaboration model is proposed. In this model, collaboration is analyzed based on communication, coordination and cooperation. Collaboration requirements, analyzed based on the 3C model, are mapped onto software components. These components aid developers to assembly groupware. The RUP-3C-Groupware, which is a groupware development process, is used for that purpose. This process is a RUP extension focused on groupware domain, and is the result of 8 years of experience with the development of collaborative services for the AulaNet Project. The proposed approach is applied as a case study to the development of the new version of the AulaNet environment …", "num_citations": "44\n", "authors": ["115"]}
{"title": "Elementos de percepção como forma de facilitar a colaboração em cursos via Internet\n", "abstract": " Neste artigo é analisado como a percepção pode facilitar a comunicação, a coordenação e a cooperação, e conseqüentemente a colaboração, nos ambientes de aprendizagem. Também são abordados fatores como a definição de quais informações de percepção são relevantes, como escolher os mecanismos de percepção adequados e a influência dos elementos de percepção na sobrecarga de informação. Por fim, a aplicação no ambiente de aprendizagem AulaNet dos conceitos tratados é relatada como forma de exemplificar as idéias discutidas.Abstract: Neste artigo é analisado como a percepção pode facilitar a comunicação, a coordenação e a cooperação, e conseqüentemente a colaboração, nos ambientes de aprendizagem. Também são abordados fatores como a definição de quais informações de percepção são relevantes, como escolher os mecanismos de percepção adequados e a influência dos elementos de percepção na sobrecarga de informação. Por fim, a aplicação no ambiente de aprendizagem AulaNet dos conceitos tratados é relatada como forma de exemplificar as idéias discutidas.", "num_citations": "44\n", "authors": ["115"]}
{"title": "Analyzing discourse structure to coordinate educational forums\n", "abstract": " In this paper, aspects related to discourse structure like message chaining, message date and categorization are used by teachers to coordinate educational forums in the AulaNet environment. These aspects can be computationally analyzed without having to inspect the content of each message. This analysis could be applied to forums in other educational environments.", "num_citations": "42\n", "authors": ["115"]}
{"title": "Analysis and design of awareness elements in collaborative digital environments: A case study in the AulaNet learning environment\n", "abstract": " In this paper an analysis is made about how awareness in digital learning environments relates to communication, coordination and cooperation and, consequently, collaboration. A collaboration model, where awareness occupies a central position, is presented. The awareness elements of the AulaNet environment are also analyzed, seeking to identify what awareness information is relevant, how it is generated, how the awareness elements were defined and how individuals control them. This analysis seeks to provide information regarding a project about awareness elements in collaborative digital learning environments.", "num_citations": "35\n", "authors": ["115"]}
{"title": "Reprovações e trancamentos nas disciplinas de introdução à programação da universidade de são paulo: Um estudo preliminar\n", "abstract": " A disciplina de introdução à programação ensina aos alunos a lógica da programação de computadores, desenvolvendo o pensamento sistemático e criativo. Entretanto, muitos autores a apontam como sendo uma das disciplinas que os alunos mais reprovam. Com o intuito de investigar tal afirmação, realizamos um levantamento dos resultados das disciplinas de introdução à programação na USP de 2010 a 2014. O índice de reprovação na disciplina foi de 30%, sendo que em vários casos ultrapassam os 50%. Esses dados mantemse constantes ao longo dos anos e mais de 25% dos alunos aprovados neste período fizeram 2 ou mais vezes a disciplina. Comparando-se com disciplinas do mesmo semestre, nos cursos de computação, ela é uma das que mais reprova.", "num_citations": "34\n", "authors": ["115"]}
{"title": "Usando a categorização e estruturação de mensagens textuais em cursos pelo ambiente AulaNet\n", "abstract": " Este trabalho indica como o uso da categorização e da estruturação de mensagens em ferramentas de comunicação textuais assíncronas pode ser útil para organizar a discussão, aprofundar o debate dos temas e levar os participantes a refletir sobre suas mensagens, resultando numa melhoria no trabalho do grupo e no aprendizado. Apesar de seu uso ter propiciado a elevação do número de mensagens, forneceu subsídios para que a sobrecarga de informação fosse reduzida. Neste trabalho, é relatado o uso da categorização e estruturação de mensagens em um curso via Internet através do ambiente de aprendizagem AulaNet, mostrando o processo de definição e aperfeiçoamento do conjunto de categorias.", "num_citations": "34\n", "authors": ["115"]}
{"title": "Participação e avaliação no ambiente virtual AulaNet da PUC-Rio\n", "abstract": " Ao se adotar uma estratégia de aprendizagem colaborativa para um curso baseado na Web, surge a necessidade de se utilizar formas de avaliação que levam em consideração as interações do indivíduo com seus colegas em vez de basear-se apenas nos progressos e atividades individuais. O ambiente de ensino-aprendizagem AulaNet oferece relatórios de acompanhamento de participação que dão ao grupo informações de percepção para uma análise quantitativa e qualitativa da sua performance. Neste capítulo são discutidos os aspectos referentes a esta forma de avaliação no ambiente AulaNet. O curso de Tecnologias de Informação Aplicadas à Educação é apresentado para exemplificar a utilização do ambiente num curso ministrado completamente à distância. São apresentados aspectos da dinâmica do curso, alguns de seus resultados e o modelo de colaboração que norteou o desenvolvimento do curso e do ambiente AulaNet.", "num_citations": "31\n", "authors": ["115"]}
{"title": "Inter-e intra-relações entre comunicação, coordenação e cooperação\n", "abstract": " Baseado no modelo 3C de colaboração, neste artigo descreve-se como diversas formas de colaborar são mapeadas nos inter-relacionamentos entre comunicação, coordenação e cooperação. Também é visto, em virtude das intra-relações entre estas dimensões, como é necessário dar suporte computacional para estas três dimensões da colaboração no groupware independentemente do seu propósito específico. Estas inter-e intra-relações são consideradas no ciclo de desenvolvimento da Engenharia de Groupware.", "num_citations": "30\n", "authors": ["115"]}
{"title": "Collaboration technology in teams and organizations: Introduction to the special issue\n", "abstract": " Information technology advances in recent years have facilitated new forms of information and knowledge sharing. Teams and organizations are increasingly exploring and adopting new technologies to support collaborative work. Such technologies range from collaboration and communication technologies that connect members of virtual teams across national and international boundaries to social media technologies that allow teams and organizations to disseminate and gather information from within and outside their institutional boundaries. The widespread availability of smart phones has given whole societies opportunities to participate in large-scale sensemaking, problem solving, and efforts to organize collaborative action. Some of the more popular modern collaboration technologies that have been widely employed in organizations include wikis, social networks, crowdsourcing, tagging plugins, and …", "num_citations": "28\n", "authors": ["115"]}
{"title": "Sobre o desenvolvimento e aplicação de cursos totalmente a distância na Internet\n", "abstract": " Este trabalho descreve a metodologia usada, os resultados e as dificuldades encontradas no desenvolvimento e na aplicação de um curso completamente à distância via Internet. O assunto do curso é o uso das tecnologias da informação aplicadas à educação e é ministrado utilizando o ambiente AulaNet, um groupware para a criação, participação e administração de cursos através da Web. Este trabalho também procura mostrar como este tipo de ambiente pode ser utilizado para dar suporte, animar e administrar um processo de aprendizagem cooperativa via Internet.", "num_citations": "28\n", "authors": ["115"]}
{"title": "Tecnologias de Informação Aplicadas à Educação: construindo uma rede de aprendizagem usando o ambiente AulaNet\n", "abstract": " Este trabalho descreve a metodologia usada, os resultados e as dificuldades encontradas no desenvolvimento e na aplicação de um curso completamente à distância via Internet. O curso é sobre o uso das tecnologias da informação aplicadas à educação e é ministrado utilizando o ambiente AulaNet, um groupware para a criação, participação e administração de redes de aprendizagem através da Web. Palavras-chaves: educação a distância, instrução baseada na Web, aprendizagem cooperativa, AulaNet.", "num_citations": "27\n", "authors": ["115"]}
{"title": "Impacts of coding practices on readability\n", "abstract": " Several conventions and standards aim to improve maintainability of software code. However, low levels of code readability perceived by developers still represent a barrier to their daily work. In this paper, we describe a survey that assessed the impact of a set of Java coding practices on the readability perceived by software developers. While some practices promoted an enhancement of readability, others did not show statistically significant effects. Interestingly, one of the practices worsened the readability. Our results may help to identify coding conventions with a positive impact on readability and, thus, guide the creation of coding standards.", "num_citations": "25\n", "authors": ["115"]}
{"title": "Sistemas de comunicação para colaboração\n", "abstract": " Sistemas de comunicação são a base dos sistemas colaborativos. São usados na composição de sistemas mais complexos como redes sociais e ambientes virtuais; nesses contextos são denominados serviços de comunicação. Nesse capítulo, é apresentada a evolução dos diferentes tipos de sistemas computacionais para estabelecer a comunicação humana na colaboração: correio eletrônico; mensageiro e bate-papo; videoconferência; blog e microblog; lista, fórum e mapa de discussão. Esses sistemas são analisados a partir da perspectiva histórica, cultural e tecnológica; são discutidas as características, as possibilidades e implicações desses meios que estabelecem novas formas de escrever, ler, se relacionar, socializar, trabalhar, pensar, amar, dentre outras experiências.", "num_citations": "25\n", "authors": ["115"]}
{"title": "Novas estratégias de avaliação online\n", "abstract": " Muitos cursos aplicados através da web utilizam um esquema tradicional de avaliação, baseado em questões que são corrigidas pelo professor ou que podem ser corrigidas automaticamente (múltipla escolha, verdadeiro ou falso, associação de colunas etc.). Estes métodos de avaliação são insuficientes se o curso online utilizar uma abordagem colaborativa de aprendizagem.Na aprendizagem colaborativa, o aprendiz é responsável pela sua própria aprendizagem e pela aprendizagem dos outros membros do grupo. Os aprendizes constroem conhecimento através da reflexão a partir da discussão em grupo. A troca ativa de informações instiga o interesse e o pensamento crítico, possibilitando aos aprendizes alcançarem melhores resultados do que quando estudam individualmente. Na aprendizagem colaborativa, os professores deixam de ser uma autoridade para se transformarem em orientadores (LUCENA e FUKS, 2000). Na Tabela 1 são estabelecidas as principais diferenças entre o ensino tradicional e a aprendizagem colaborativa.", "num_citations": "25\n", "authors": ["115"]}
{"title": "Coordenação de Fóruns Educacionais: encadeamento e categorização de mensagens\n", "abstract": " Neste artigo são apresentados alguns subsídios que podem ser utilizados pelo docente de um curso na coordenação de fóruns educacionais. São analisados aspectos relativos à estruturação do discurso e à categorização de mensagens. Estes aspectos podem ser analisados sem que o docente tenha que inspecionar o conteúdo de cada umas das mensagens individualmente. As ferramentas de fóruns dos ambientes educacionais podem ser construídas levando-se em conta estes aspectos para fornecer auxílio ao docente na avaliação e condução da discussão.Abstract: In this paper, some aspects of newsgroups that could be used by teachers to coordinate the discussion are presented. These aspects are related to discourse structure and message categorization. These aspects can be analyzed without having to inspect the content of each message. The newsgroups of educational environment could be improved using these aspects in order to assist the teacher in the evaluation and conduction of the discussion.", "num_citations": "23\n", "authors": ["115"]}
{"title": "Nosql na web 2.0: Um estudo comparativo de bancos não-relacionais para armazenamento de dados na web 2.0\n", "abstract": " A quantidade de dados gerados, armazenados e processados atingiu escalas inéditas com a Web 2.0. Soluções além dos bancos de dados relacionais estão sendo implementadas e utilizadas por organizações da Web 2.0 para lidar com dados desse volume. Ao conjunto desses bancos de dados nãorelacionais se deu o nome de NOSQL. Para entender seus casos de uso, é necessário categorizá-los, classificá-los e compará-los com relação a seus modelos de dados e seus atributos de escalabilidade e performance. Esse artigo apresenta uma taxonomia dessas novas tecnologias, suas principais diferenças com relação aos bancos de dados relacionais e como lidam com o compromisso entre escalabilidade e outros atributos de qualidade de sistemas.", "num_citations": "22\n", "authors": ["115"]}
{"title": "Communication, Coordination, and Cooperation in Computer-Supported Learning: the AulaNet Experience\n", "abstract": " This chapter introduces an approach based on the 3C (communication, coordination, and cooperation) collaboration model to the development and analysis of collaborative systems, by means of a case study of a learningware (AulaNet) and the methodology of a Web-based course, both designed based on the model. The 3C model is presented through the analysis of each of its three elements, followed by the case study of its application in the AulaNet environment and in the ITAE (Information Technology Applied to Education) course, an entirely online course that has been taught since 1998.", "num_citations": "20\n", "authors": ["115"]}
{"title": "Using a Groupware Technology to Implement Cooperative Learning via the Internet-A case study\n", "abstract": " The Internet presents numerous new resources for teaching/learning. Despite this, it also brings many difficulties. To get around some of them, the AulaNet environment was developed in such a way that teachers could concern themselves about producing educational content while the environment manages the learners' navigation for them. Moreover, the environment offers integrated communication, coordination and cooperation services that can be added on to the course in order to supplement it. The course on \"Information Technology Applied to Education\" is wholly taught via the Internet though the AulaNet environment. The purpose of the course is to get students to learn to work with information technology as a group, turning them into Web-based educators. The class has been conducted since 1998. This paper reports how the AulaNet was configured and how its services aided in the creation and …", "num_citations": "20\n", "authors": ["115"]}
{"title": "Towards an engineering approach for groupware development: learning from the AulaNet LMS development\n", "abstract": " This paper presents the AulaNet learning management system, its architecture and the collaboration model that guided its development and that was refined during this process. A case study of an online course indicates the necessity to have an architectural support for collaboration aspects and a collaboration-based engineering approach to groupware development. This approach, groupware engineering, is based on software engineering and on concepts originated in the field of CSCW.", "num_citations": "19\n", "authors": ["115"]}
{"title": "Informações estatísticas e visuais para a mediação de fóruns educacionais\n", "abstract": " Em um ambiente educacional, uma ferramenta de fórum é usada para incentivar a reflexão e uma análise aprofundada dos tópicos em discussão. Entretanto, por ser uma ferramenta assíncrona, a participação ocorre a qualquer hora, o que demanda uma atenção constante do professor para poder mediar o grupo e a discussão. Uma quantidade considerável de mensagens é enviada em um curto período de tempo, dificultando o acompanhamento e a coordenação da discussão. Este artigo aborda uma experiência de uso de análises estatísticas e visuais para instrumentar o docente na detecção de potenciais problemas.", "num_citations": "18\n", "authors": ["115"]}
{"title": "Applying the 3C model to groupware engineering\n", "abstract": " This paper introduces an approach based on the 3C collaboration model (communication, coordination and cooperation) to the development of collaborative systems. This approach is denominated Groupware Engineering, which is based on Software Engineering, enhanced by concepts originated from the field of CSCW and related areas. The 3C model is studied by means of a detailed analysis of each one of its three elements, accompanied by a case study of a learningware together with the methodology of a web-based course, both designed based on the model. Moreover, the paper describes a component based system architecture following this 3C approach.", "num_citations": "18\n", "authors": ["115"]}
{"title": "Estruturação e categorização de mensagens em ferramentas de comunicação textuais assíncronas\n", "abstract": " Comunicar-se assincronamente através de computadores minimiza as barreiras geográficas e temporais, mas pode levar a situações de excesso de informações, que ocasionam desorganização e desentendimentos. Uma maneira de minimizar a chance de ocorrer esta sobrecarga é organizar as mensagens trocadas, estruturando e categorizando-as. Dependendo das necessidades de colaboração do grupo, pode-se adotar diferentes modelos de estruturação e conjuntos de categorias, o que refletirá na escolha da ferramenta de comunicação apropriada. O objetivo deste trabalho é abordar a estruturação e a categorização de mensagens com relação a aspectos da colaboração, como comunicação, coordenação, cooperação, percepção e sobrecarga de informação. Para isto será mostrado como a estruturação e a categorização de mensagens estão disponíveis em serviços de comunicação textuais …", "num_citations": "18\n", "authors": ["115"]}
{"title": "A inteligência coletiva na web: Uma análise de domínio para o jornalismo online\n", "abstract": " A colaboração é uma característica marcante da Web 2.0. Das interações entre as pessoas, emerge o que vem sendo chamado de inteligência coletiva. Este conceito vem ganhando notoriedade no meio acadêmico e no mercado e envolve a busca por conhecimento a partir do processamento da interação e da colaboração em larga escala que acontecem na Internet. O Jornalismo Online também explora os benefícios da Web 2.0 de forma a tirar proveito da Inteligência Coletiva. Não há um padrão e cada site de jornalismo explora essa característica de maneira própria. Neste trabalho apresentamos uma classificação da Inteligência Coletiva através da execução de uma análise de domínio utilizando a metodologia FODA baseada no modelo 3C de colaboração (comunicação, coordenação, cooperação). Foram encontradas 14 características sendo que a Busca, Atividades Recentes e Compartilhar são as mais recorrentes.", "num_citations": "16\n", "authors": ["115"]}
{"title": "Prescribing e-Learning Activities Using Workflow Technologies.\n", "abstract": " In this paper we propose a new coordination approach for the AulaNet Learning Management System. The proposed coordination protocol is based on a workflow mechanism that could be used by teachers to define some specific sequence of activities within a course run within AulaNet. This way, at least part of the social protocol that governs the flow of the course could be enforced by software.", "num_citations": "16\n", "authors": ["115"]}
{"title": "Evaluating the utilization of Twitter messages as a source of security alerts\n", "abstract": " The fast spread of computer security alerts, like vulnerabilities notifications, applications updates and threats of attacks, is essential to the implementation of efficient reactive measures against security incidents. This paper presents an empirical study that evaluates the efficiency of using Twitter posts, related to computer security, as notifications of security alerts. The justification to this study is the fact that posts from microblogs have a very fast spread over the Internet. By using similarity analysis and clustering between Twitter posts and alerts from specialized sites, it was verified that microblogs spread computer security alerts in a reliable way, reach a high level of dissemination and inform about security threats even before some specialized sites.", "num_citations": "15\n", "authors": ["115"]}
{"title": "Component-Based Groupware Development Based on the 3C Collaboration Model\n", "abstract": " Groupware é evolucionário e possui dificuldades específicas de desenvolvimento e manutenção. Seu código normalmente se torna desestruturado e difícil de evoluir. Neste artigo, é proposta uma abordagem de desenvolvimento de groupware baseado em componentes organizados em função do modelo 3C de colaboração. Neste modelo, a colaboração é analisada a partir da comunicação, coordenação e cooperação. Os requisitos de colaboração do grupo, analisados em função do modelo 3C, são mapeados em componentes de software, também organizados em função do modelo. A abordagem proposta é investigada num estudo de caso no desenvolvimento da nova versão do ambiente AulaNet. O código do ambiente atualmente sofre dos problemas mencionados. Para instanciar os serviços de comunicação do AulaNet, kits de componentes foram desenvolvidos. Os componentes possibilitam a composição e customização dos serviços para refletir mudanças na dinâmica da colaboração.", "num_citations": "14\n", "authors": ["115"]}
{"title": "Collaborative features in content sharing web 2.0 social networks: A domain engineering based on the 3c collaboration model\n", "abstract": " Researchers and developers still replicate ideas with low reuse when developing Web 2.0 applications. A domain engineering identify and document communalities and variabilities of an application family fostering reuse. In this work, we used a domain engineering approach for content sharing features of social networks. We used as a method the FODA (Feature Oriented Domain Analysis) with patterns for computer-mediated interaction to describe the collaborative features and the 3C collaboration model to classify them. To implement the commonalities, we defined and developed a component kit based on an infrastructure named Groupware Workbench. We conducted an experiment and a case study to evaluate the artifacts generated by the domain engineering.", "num_citations": "13\n", "authors": ["115"]}
{"title": "Componentes Baseados no Modelo 3C para o Desenvolvimento de Ferramentas Colaborativas\n", "abstract": " Software components may be used to encapsulate collaborative systems development complexity. Structuring these components by means of the 3C collaboration model, a more realistic representation and a more flexible groupware are obtained. In this paper, the application and technical architectures of the AulaNet learning environment are shown, illustrating how components support the evolution of one the AulaNet services.Resumo. Componentes de software podem ser usados para encapsular a complexidade inerente ao desenvolvimento de aplicações colaborativas. Ao estruturar estes componentes em função do modelo de colaboração 3C obtém-se uma representação mais próxima da realidade e um groupware mais flexível. Neste artigo são apresentadas as arquiteturas de aplicação e técnica do ambiente de aprendizagem AulaNet, mostrando como os componentes dão suporte à evolução de um de seus serviços.", "num_citations": "13\n", "authors": ["115"]}
{"title": "Difficulties of programming learning from the point of view of students and instructors\n", "abstract": " Computer programming courses are mandatory for many majors. However, the high rate of failures shows that students have difficulties in assimilating the topics. The objective of this research is to understand these difficulties. Analyzing diaries filled out by students and interviews with instructors, we identified difficulties related to language and understanding and some strategies used to mitigate them. The analysis and understanding of the difficulties may support the creation of teaching strategies and tools to facilitate the teaching and learning of computer programming.", "num_citations": "12\n", "authors": ["115"]}
{"title": "Uma arquitetura para o desenvolvimento de ferramentas colaborativas para o ambiente de aprendizagem aulanet\n", "abstract": " Sistemas colaborativos devem ser suficientemente flexíveis para serem adaptados às características do grupo e à evolução dos processos de trabalho. Neste artigo é apresentada a nova arquitetura do ambiente AulaNet, construída com técnicas de desenvolvimento baseado em componentes para prover a flexibilidade necessária. É apresentado um estudo de caso com um dos serviços do ambiente, para mostrar como a ferramenta pode ser adaptada para acompanhar a evolução da dinâmica do curso.Abstract: Collaborative systems should be flexible enough to adapt to group characteristics and to work processes evolution. In this paper, the new architecture of the AulaNet learning environment is presented. This architecture was developed using component-based techniques to provide the necessary flexibility. A case study is presented, showing how the component-based architecture accommodates the changes needed to support the evolution of a course dynamics.", "num_citations": "12\n", "authors": ["115"]}
{"title": "Rede Social Arquigrafia-Brasil: Design de um ambiente online baseado em transdisciplinaridade e colaboração\n", "abstract": " A Web2. 0 favorece o uso de ambientes sociais colaborativos em diversos setores da sociedade. Este artigo apresenta um projeto transdisciplinar “Rede Social Arquigrafia-Brasil” que objetiva o desenvolvimento de um ambiente colaborativo centrado no usuário e na comunidade para a documentação imagética e estudo da arquitetura brasileira e que deverá ter um papel importante na construção do conhecimento arquitetônico.", "num_citations": "11\n", "authors": ["115"]}
{"title": "Engineering Groupware for E-Business\n", "abstract": " This paper introduces an engineering approach to the modeling, design and implementation of collaborative systems, applied to ebusiness. This approach, called Groupware Engineering, is based on the 3C collaboration model (Communication, Coordination and Cooperation). Initially, the 3C model is studied by means of an analysis of each one of its three elements. Then, other phases of Groupware Engineering, such as requirement analysis and component implementation, are introduced. Finally, an example presents the application of this approach to a business-web.", "num_citations": "11\n", "authors": ["115"]}
{"title": "As disciplinas de introdução à programação na USP: um estudo preliminar\n", "abstract": " A disciplina de Introdução à Programação faz parte da grade curricular dos cursos de computação e de outras áreas. Apesar da percepção de que é uma disciplina difícil, há poucos dados sobre seus resultados. Este reporta um levantamento quantitativo do índice de reprovações e trancamentos nas disciplinas de Introdução à Programação na USP no período de 2010-1 a 2014-2. Foram realizadas análises diferenciadas, por exemplo, alunos que são da computação dos demais, alunos que frequentam a disciplina pela primeira vez e geral, diferença de resultados por professor e linguagem utilizada.", "num_citations": "9\n", "authors": ["115"]}
{"title": "Combining communication and coordination toward articulation of collaborative activities\n", "abstract": " In this paper, we present a proposal for the articulation of collaborative activities based on communication and coordination representation models. Articulation is essential in any kind of collaboration and involves pre- articulation of the tasks, their management, and post-articulation. For the representation of pre- and post-articulation phases, conversation clichés (communication) are used. For the coordination phase, a model separating the tasks and their interdependencies is used. The articulation schema, which is especially suited to e-business applications, is then applied to a business-web example.", "num_citations": "9\n", "authors": ["115"]}
{"title": "Combinando Comunicação e Coordenação em Groupware\n", "abstract": " Neste artigo, é apresentada uma proposta para articulação baseada em modelos de representação de comunicação e coordenação para atividades colaborativas apoiadas por groupware. Para a representação das fases de pré e pós-articulação, clichês de conversação são utilizados. Para a fase de coordenação, um modelo que separa as tarefas de suas interdependências é utilizado. O esquema de articulação é então aplicado a um exemplo de business-web.", "num_citations": "9\n", "authors": ["115"]}
{"title": "Using the AulaNet Learning Environment to Implement Collaborative Learning via Internet\n", "abstract": " The AulaNet environment was developed in a way to allow teachers to concentrate mainly on producing content while the environment help to manage learner navigation. Furthermore, AulaNet offers integrated communication, coordination and cooperation services that can be added to courses in order to supplement them. One of the courses that is being taught via Internet through AulaNet at PUC-Rio is called Information Technology Applied to Education (ITAE), which is taught completely online. This paper explains how AulaNet was configured and how its services helped in the creation and application of the ITAE course during the period 1998 to 2002.", "num_citations": "9\n", "authors": ["115"]}
{"title": "AulaNet 3.0: desenvolvendo aplicações colaborativas baseadas em componentes 3C\n", "abstract": " In this paper, the development of groupware applications for the AulaNet learningware is addressed. This piece of software is currently evolving into version 3.0, which is component-based. The usage of the collaboration 3C Model (Communication, Coordination and Cooperation) to guide the development of AulaNet 3.0 services is discussed. The following topics are addressed: frameworks and component’s kits built to support the groupware development; the services’ architecture; the services’ development process; and AulaNet’s PDA version.Resumo. Neste artigo, aborda-se o desenvolvimento de aplicações groupware para o learningware AulaNet que está evoluindo para a versão 3.0 que é baseada em componentes. Discute-se como o Modelo 3C de colaboração (Comunicação, Coordenação e Cooperação) vem sendo usado para guiar o desenvolvimento dos serviços do AulaNet 3.0. Discute-se: os frameworks e os kits de componentes construídos para dar suporte ao desenvolvimento de groupware; a arquitetura elaborada para montar um serviço; o processo de desenvolvimento dos serviços; e a extensão do AulaNet para PDAs.", "num_citations": "8\n", "authors": ["115"]}
{"title": "Awareness support in the AulaNet learning environment\n", "abstract": " In this paper, the role of awareness in the 3C collaboration model is discussed, detailing how it relates to its main aspects: communication, coordination and cooperation. Then, some awareness elements of the AulaNet learning environment, which was developed based on this collaboration model, are analyzed.", "num_citations": "8\n", "authors": ["115"]}
{"title": "Using groupware tools to extend the organizational memory with collaboration aspects\n", "abstract": " In this paper is described how computer supported cooperative work can be used to enhance project development memory, focusing on software development. The collaboration model that is presented is based upon the concepts of communication, coordination and cooperation. Each of these concepts is analyzed regarding software specification. The paper presents some examples of systems that seek to capture and refine group ideas through the process of argumentation. The paper also shows how the building of project memory can facilitate the recovery of the context and the reasoning that led to the taking of project decisions.", "num_citations": "8\n", "authors": ["115"]}
{"title": "It's How You Say It: Identifying Appropriate Register for Chatbot Language Design\n", "abstract": " Designing chatbots that produce language that is natural and appropriate to a given context is critical in satisfying user expectations. Currently, little is known about how a chatbot's linguistic choices should be designed to conform with the language humans produce in similar contexts. In this paper, we draw on existing sociolinguistic theory to adapt a technique calledregister analysis to (a) characterize the linguistic register used by humans in a specific conversational context; and (b) drive chatbot language design. Our exploratory study investigates the application of register analysis for tourist assistants chatbots and shows how the results could be used to develop them to adopt the appropriate register.", "num_citations": "7\n", "authors": ["115"]}
{"title": "Using awareness information to enhance online discussion forums: a systematic mapping study\n", "abstract": " Context: Since online discussion forums are widely used in Distance Learning platforms, instructors ought to be aware of what is happening in them. Goal: Our study aimed to identify scientific studies that investigate awareness in online forums in Learning Management Systems (LMS) and Massive Open Online Courses (MOOC). Method: We conducted a systematic mapping to identify, filter, and classify primary studies. Results: We selected 51 papers and categorized the difficulties faced by discussion forum users into four groups: visualization, motivation, structural, and accompaniment. In addition, we identified six types of awareness elements: informal, group-structural, workspace, social, task, and concept awareness. The results were divided into two types: system/framework and approach/investigation. Conclusion: our study provides an overview of the state of the art and challenges concerning awareness …", "num_citations": "7\n", "authors": ["115"]}
{"title": "Uma engenharia de domínio baseada em padrões de interação e no modelo 3C de colaboração para redes sociais de compartilhamento na Web 2.0\n", "abstract": " A Web 2.0 aumentou a possibilidade de socialização por meio de ferramentas para interação mediada por computador. Com isso surgiram muitos sistemas, desenvolvidos por meio de reimplementação e pouco reúso. Este cenário ilustra a necessidade de uma Engenharia de Domínio. Neste trabalho apresentamos uma engenharia do domínio para redes sociais de compartilhamento de objetos. Foi utilizada uma extensão da metodologia FODA com o modelo 3C de colaboração para classificar e padrões para interação mediada por comutador para descrever as características colaborativas identificadas. Para desenvolver os componentes, baseados nessas características, foi utilizada uma plataforma chamada Groupware Workbench. Foi realizada uma avaliação com desenvolvedores para verificar a adequação da abordagem utilizada.", "num_citations": "7\n", "authors": ["115"]}
{"title": "Assessment of collaboration in online courses\n", "abstract": " New educational dynamics require new assessment strategies. In this article, three strategies for evaluating the collaboration of learners are presented and discussed: assessment of participation in conferences, assessment of competence and collaborative assessment. These strategies have been investigated in a course taught entirely at distance by the AulaNet, which supplies some mechanisms for the application of these new assessment strategies.", "num_citations": "7\n", "authors": ["115"]}
{"title": "Evoluindo para uma Arquitetura de Groupware Baseada em Componentes: o Estudo de Caso do Learningware AulaNet\n", "abstract": " Groupware must be flexible in order to satisfy the different characteristics and the continuous evolution of the workgroups and processes where it is used. One way of achieving such flexibility is to use component-based development techniques. This article proposes a new J2EE-based architecture to be used as a basis for building different types of groupware. It ensues in the new AulaNet architecture that will guide the construction of a groupware generator. The current AulaNet architecture, the difficulties identified in maintaining it and some of the reasons that led to the proposal of a new architecture are also presented.Resumo. Groupware deve ser flexível para atender às diversas características dos grupos e processos de trabalho onde são utilizados. Uma forma de atingir esta flexibilidade é utilizar técnicas de desenvolvimento baseado em componentes. Neste artigo é proposta uma nova arquitetura baseada em J2EE para o ambiente AulaNet, um ambiente de ensino-aprendizagem na Web. Pretende-se utilizar esta arquitetura como base para a construção de groupware de diferentes propósitos. A arquitetura atual do ambiente e seus problemas e características que levaram a necessidade de uma nova arquitetura também são abordados.", "num_citations": "7\n", "authors": ["115"]}
{"title": "Um groupware baseado no ambiente AulaNet desenvolvido com componentes\n", "abstract": " Na sociedade da informação as pessoas têm que aprender a trabalhar cooperativamente com as novas tecnologias desenvolvidas. O ambiente AulaNet é uma proposta para este tipo de aprendizagem. Mas como seria um ambiente para o trabalho cooperativo? Neste artigo é proposto o projeto do eLabora, um ambiente para o gerenciamento do trabalho em grupo baseado no AulaNet, a ser desenvolvido numa abordagem de framework baseado em componentes.", "num_citations": "7\n", "authors": ["115"]}
{"title": "Desenvolvimento e aplicação de cursos totalmente a distância na Internet\n", "abstract": " This paper presents the methodology, the results and the difficulties found in the development and delivery of a course through the Internet. The course is about the application of information technology to education. The course is being delivered using the AulaNet environment, a groupware for the creation, participation and maintenance of Web-based courses. This paper also shows how this kind of environment can be used to give support, facilitate and manage cooperative learning.Resumo. Este trabalho descreve a metodologia usada, os resultados e as dificuldades encontradas no desenvolvimento e na aplicação de um curso completamente à distância via Internet. O assunto do curso é o uso das tecnologias de informação aplicadas à educação e é ministrado utilizando o ambiente AulaNet, um groupware para a criação, participação e administração de cursos através da Web. Este trabalho também procura mostrar como este tipo de ambiente pode ser utilizado para dar suporte, animar e administrar um processo de aprendizagem cooperativa via Internet.", "num_citations": "7\n", "authors": ["115"]}
{"title": "Visual programming and automatic evaluation of exercises: An experience with a STEM course\n", "abstract": " Programming capabilities are important to the new professionals. Although several initiatives all over the world haves been proposed for teaching programming to people at all levels. Many undergraduate students still fail in the programming courses. Proposed strategies have included visual programming and automatic evaluation of exercises. Nevertheless, there is still a lack of knowledge about students' perceived difficulties in using these strategies in practice: that is, their challenges to learning how to program. In this paper, we report a study aimed at understanding these difficulties and strategies in a STEM course. We used an environment comprising a visual programming tool to introduce algorithms, iVProg with iAssign, and the virtual programming lab (VPL) to introduce programming in C, both with automatic assessment integrated to Moodle. We report quantitative and qualitative results and future directions …", "num_citations": "6\n", "authors": ["115"]}
{"title": "Middleware de Integração entre o Ambiente AulaNet e o Ginga\n", "abstract": " The Ginga middleware allows the development of interactive applications to the digital TV independently from the hardware platform of the set-top box providers. In this paper a middleware is proposed to integrate the AulaNet environment with Ginga, in a way to provide a platform for teachinglearning through the digital TV. The middleware will be developed using component based development techniques, taking into account the existing system architecture.", "num_citations": "6\n", "authors": ["115"]}
{"title": "Competency management for group formation on the AulaNet learning environment\n", "abstract": " The IMS Project uses the notion of competency to model educational objectives. In the AulaNet learning environment competency management is used to form subgroups that, in the case of this article, are assigned to generate new educational content for the Information Technologies Applied to Education course. The purpose of this course is to get learners to learn to work with information technology as a group, turning them into Web-based educators.", "num_citations": "6\n", "authors": ["115"]}
{"title": "Elementos de percepção em ambientes de aprendizagem como forma de facilitar a comunicação, coordenação e cooperação\n", "abstract": " Resumo? Neste artigo é analisado como a percepção pode facilitar a comunicação, a coordenação e a cooperação, e conseqüentemente a colaboração, nos ambientes de aprendizagem. Também são abordados fatores como a definição de quais informações de percepção são relevantes, como escolher os mecanismos de percepção adequados e a influência dos elementos de percepção na sobrecarga de informação. Por fim, a aplicação no ambiente de aprendizagem AulaNet dos conceitos tratados é relatada como forma de exemplificar as idéias discutidas.", "num_citations": "6\n", "authors": ["115"]}
{"title": "Categorização e Estruturação de Mensagens Textuais em Ambientes Virtuais de Colaboração\n", "abstract": " As tecnologias de telecomunicações estão levando a um crescimento não gerenciável da quantidade, da natureza e da qualidade da informação disponível. Este problema é especialmente drástico na colaboração via Internet, onde normalmente os membros de um grupo têm que se comunicar intensamente para resolver suas tarefas. Uma maneira de minimizar a chance de ocorrer sobrecarga de informação na comunicação é organizar as mensagens trocadas, estruturando e categorizando-as. Porém, ao alterar a forma de se comunicar, podem ocorrer outros efeitos na colaboração do grupo. O objetivo deste trabalho é analisar se a categorização e a estruturação de mensagens realmente reduzem a sobrecarga de informação, quais outros efeitos ocasionam na comunicação e na colaboração de um grupo que se comunica assincronamente através de mensagens textuais, quais efeitos trazem para os indivíduos e quais as dificuldades da sua implantação e do seu uso. Para isso a categorização de mensagens foi implementada em serviços de comunicação assíncronos do ambiente de aprendizagem AulaNet, e utilizada durante quatro semestres num curso ministrado pela Internet, cuja abordagem é fortemente focada na colaboração através da comunicação.", "num_citations": "6\n", "authors": ["115"]}
{"title": "User engagement in an open collaboration community after the insertion of a game design element: An online field experiment\n", "abstract": " Gamification has been proposed as a possible solution to low user engagement in open collaboration communities. However, most studies do not present statistical analyses and few studies analyze the criterion validity between behavioral and self-reported engagement measures. This study seeks to understand whether gamification contributed to greater behavioral and self-reported engagement in an open collaboration community. We conducted an online field experiment to analyze user engagement in two versions of a new feature, with or without a game design element (Progress bar), with 36 and 37 users, respectively. A subset of the participants (18 users) answered an online questionnaire about their engagement with the system. We found that the group of users with the highest self-reported engagement scores performed the most actions, and users who accessed the Progress bar performed the highest number of actions. More studies are needed to better understand the relationship between each action and the engagement.", "num_citations": "5\n", "authors": ["115"]}
{"title": "Promoting engagement in open collaboration communities by means of gamification\n", "abstract": " Open collaboration communities depend on contributors. To reduce users’ engagement problems with collaborative systems, the use of gamification has been discussed. However, most gamification methods are generic and do not emphasize the collaborative aspects. This research aims to define a process to promote engagement in open collaboration communities by means of gamification. The process will be refined through action research cycles.", "num_citations": "5\n", "authors": ["115"]}
{"title": "Automated instructional design for CSCL: A hierarchical task network planning approach\n", "abstract": " In Computer Supported Collaborative Learning (CSCL), one of the most important tasks for instructional designers is to define scenarios that foster group learning. Such scenarios, defined as Units of Learning (UoLs), comprise different components and are organized according to pedagogical approaches to orchestrate group learning processes. Examples of UoL components are learning objects, student roles, student characteristics (e.g., background, preferences, learning styles, etc.), instructional/learning goals, and activities, among others. Thus, the instructional design (ID) of a proper UoL for CSCL is a complex task that requires practice and experience. This is particularly true when designing, developing, adapting, and customizing UoLs, taking into consideration different instructional/learning goals and individual preferences of students. This paper therefore proposes using a Hierarchical Task Network (HTN …", "num_citations": "5\n", "authors": ["115"]}
{"title": "Cálculo de Reputação em Redes Sociais\n", "abstract": " Confiança e reputaçao estao ligadas, pois dependendo da reputaçao de uma pessoa, outra pode decidir se confia nela ou nao. Com o avanço da tecnologia e da internet, esses conceitos também sao adotados nas comunidades online. O objetivo do presente trabalho consiste na criaçao de um modelo para o cálculo de reputaçao, baseado em dados qualitativos e quantitativos provenientes da interaçao dos participantes em uma rede social. Para atingir esse objetivo é definida uma modificaçao do algoritmo PageRank usado pelo Google para obter uma ordenaçao dos usuários a partir de suas interaçoes.", "num_citations": "5\n", "authors": ["115"]}
{"title": "Suporte à coordenação e à cooperação em uma ferramenta de comunicação textual assíncrona: Um estudo de caso no ambiente AulaNet\n", "abstract": " Sistemas colaborativos são particularmente propícios a falhas e devem ser flexíveis para serem adaptados às características do grupo e à evolução dos processos de trabalho. A nova arquitetura do ambiente AulaNet foi construída baseada em componentes de forma a prover a flexibilidade necessária. Para exemplificar a evolução dos processos de trabalho e o suporte arquitetural dado, é apresentado um estudo de caso com o serviço de fórum do ambiente.", "num_citations": "5\n", "authors": ["115"]}
{"title": "Comparação da resolução colaborativa de problemas em sala de aula e através do ambiente Aulanet\n", "abstract": " Este trabalho descreve comparativamente a resolução colaborativa de problemas em sala de aula e através do AulaNet. O experimento foi conduzido no curso de Sistemas Operacionais da graduação em Engenharia de Computação da PUC-Rio. Constatou-se que, utilizando métodos de trabalho distintos, os grupos pesquisados alcançaram resultados semelhantes em ambos os ambientes. Outros aspectos como tamanho dos grupos, liderança e satisfação com o trabalho também foram analisados.Abstract: This paper compares collaborative problem resolution in the classroom and using the AulaNet Environment. The experiment was conducted in the Operating Systems discipline of the undergraduate course of Computer Engineering at PUC-Rio. Results showed that the groups studied accomplished similar results in both environments, though by different working methods. Other aspects like group size, leadership and satisfaction at work were also analyzed.", "num_citations": "5\n", "authors": ["115"]}
{"title": "Pedagogical Content for Professors of Introductory Programming Courses\n", "abstract": " Teaching introductory programming requires knowledge of both content and pedagogy. Pedagogy includes understanding the typical difficulties students face as they learn, as well as recognizing didactic strategies professors can use to help students to overcome these difficulties. Our research aims to improve the pedagogical knowledge instructors have to teach introductory programming courses, especially those new in this area. We conducted 16 semi-structured interviews with instructors who teach introductory programming courses and collected diaries filled by 110 students during their studies. Qualitative analysis of this data revealed a set of difficulties students faced when learning programming basics and a set of didactic strategies professors use to mitigate them. The results were reviewed by senior instructors in order to confirm them and by junior instructors to verify the importance of this material from their …", "num_citations": "4\n", "authors": ["115"]}
{"title": "A component based workbench for groupware prototyping\n", "abstract": " Several software development problems are especially relevant for groupware development. Problems like synchronism, concurrence, sharing and distribution are critical; the area of CSCW (Computer Supported Cooperative Work) is highly interdisciplinary; and business process that define the workgroup dynamics are difficult to model and to support. The area normally requires qualified programmers, which spend most of their time solving low level technical issues. The developed code becomes highly coupled and difficult to evolve. Other areas advanced considerably when programmers were able to experiment and rapid prototype. For example, IDEs that offer interface widgets allow programmer to think in terms of user interaction instead of window construction technical details. In this paper, component based technology is being used in groupware development to try to overcome its intrinsic difficulties and to promote creativity in new products generation. A two-level component workbench organized according to a collaboration model is presented.", "num_citations": "4\n", "authors": ["115"]}
{"title": "Integração do AulaNet com a TV Digital\n", "abstract": " O Brasil vem se preparando para a adoção da TV digital. O potencial de disseminação desta tecnologia e a disponibilidade de conteúdos multimídia disponíveis oferecem uma abordagem promissora para o ensino-aprendizagem. O Ambiente AulaNet, utilizado para gerenciar conteúdos e para hospedar serviços colaborativos na Web, está sendo adaptado para oferecer suporte ao ensino-aprendizagem na TV digital. Neste artigo, é abordada a integração do ambiente com a infra-estrutura da TV digital.Abstract: Brazil is getting ready for digital TV. The potential of dissemination of this technology and the availability multimedia content offer a promising approach for teaching-learning. The AulaNet environment, used to manage contents and to host collaborative services in the Web, is being adapted to offer support to teaching-learning using the digital TV. This article presents the integration of the environment with the infrastructure of the digital TV.", "num_citations": "4\n", "authors": ["115"]}
{"title": "Smart Audio City Guide: um sistema colaborativo para apoio ao deslocamento urbano de pessoas com deficiência visual\n", "abstract": " O desenvolvimento de novas tecnologias favorece o aparecimento de novos meios de inclusao social. Este artigo apresenta um projeto multidisciplinar chamado Smart Audio City Guide, que objetiva criar um ambiente colaborativo por meio do uso de smartphones e mensagens de voz georeferenciadas, para auxiliar na mobilidade de pessoas com deficiência visual em meios urbanos. O sistema desenvolvido coloca em prática os estudos realizados sobre a criaçao de sistemas colaborativos e interaçao homem-máquina. Foi estudada a maneira como deficientes visuais interagem com smartphones com telas sensıveis ao toque. Testes já foram realizados com o auxılio de um primeiro protótipo, e apresentaram resultados muito promissores. Diversos usuários cegos submetidos ao teste aprovaram o seu desenvolvimento e afirmaram que o aplicativo pode significar mais independência em seu cotidiano. O projeto, em desenvolvimento, deverá ser finalizado nos próximos meses. O aplicativo estará disponıvel para o público em geral até o final de 2013.", "num_citations": "3\n", "authors": ["115"]}
{"title": "Analysis of security messages posted on twitter\n", "abstract": " The fast spread of computer security alerts, like vulnerabilities notifications, applications updates and threats of attacks, is essential to efficient reactive measures against security incidents. This paper presents an empirical study that evaluates the efficiency of using twitter posts, related to computer security, as notifications of security alerts. The justification to this study is the fact that posts from microblogs have a very fast spread over the Internet. By using similarity analysis and clustering between twitter posts and alerts from specialized sites, it was verified that microblogs spread computer security alerts in a reliable way, reach a high level of dissemination and inform about security threats before some specialized sites.", "num_citations": "3\n", "authors": ["115"]}
{"title": "ARQUIGRAFIA-brasil social network: Design of an online environment based on transdisciplinarity and collaboration\n", "abstract": " The Web2.0 has opened a great opportunity for collaborative social environments. This article presents a transdisciplinary project named “Arquigrafia-Brasil Social Network”, which aims the development of a user centered collaborative environment to document and study Brazilian architecture through images. It may play an important role in the architecture knowledge construction.", "num_citations": "3\n", "authors": ["115"]}
{"title": "Analyzing and assessing collaborative learning activities in a web-based environment\n", "abstract": " Upon adopting a collaborative learning strategy for a Web based course, it is necessary to use assessment techniques that take into account the interaction of individuals with their colleagues instead of basing them only on individual progress and activities. The AulaNet learning management system offers participation follow-up reports that provide the group with coordination information, making it possible quantitative and qualitative performance analysis. The Information Technologies Applied to Education course is presented as an example of the use of the environment in a course that is entirely taught through the Web. Aspects of the assessment of collaborative activities and the ensuing follow-up reports are presented in the paper.", "num_citations": "3\n", "authors": ["115"]}
{"title": "Uso da categorização e estruturação de mensagens para dinamizar a discussão e reduzir a sobrecarga de informação em cursos via Internet\n", "abstract": " This paper shows how the use of categorization and structuring of messages in asynchronous textual communication tools could be useful in courses delivered via Internet in order to organize the argumentation and guide the participants to reflect about their messages. Although the use of categorization causes an increase in the total number of messages, there is a reduction at the information overload. The use of message categorization in a distance course through the AulaNet environment elaborates on how to define and improve the set of categories.Resumo. Este trabalho indica como o uso da categorização e da estruturação de mensagens em ferramentas de comunicação textuais assíncronas pode ser útil para facilitar a discussão e levar os participantes a refletir sobre suas mensagens, resultando numa melhoria no trabalho do grupo e no aprendizado. Apesar de seu uso propiciar a elevação do número de mensagens, têm-se subsídios para que a sobrecarga de informação seja reduzida. Neste trabalho, é relatado o uso da categorização e estruturação de mensagens em um curso via Internet através do ambiente AulaNet, mostrando o processo de definição e aperfeiçoamento do conjunto de categorias.", "num_citations": "3\n", "authors": ["115"]}
{"title": "The application and enhancement of Web based courses\n", "abstract": " This paper presents the methodology, the results and the difficulties found in the development and delivery of a course through the Internet. The course is about the application of information technology to education and is being delivered using the AulaNet environment, which is a groupware for the creation, participation and maintenance of Web-based courses. This paper also shows how this kind of environment can be used to provide support, facilitate and manage cooperative learning.", "num_citations": "3\n", "authors": ["115"]}
{"title": "Categorização de mensagens nos serviços de grupo de discussão e grupo de interesse do ambiente aulaNet\n", "abstract": " Neste artigo é feito um estudo da discussão assíncrona textual baseada na Web, através da bibliografia e de ambientes de apoio existentes, como gIBIS e AulaNet. A partir deste estudo e da observação da discussão realizada durante um semestre numa turma da disciplina Tecnologia de Informação Aplicada à Educação, são propostas modificações ao ambiente e uma estruturação da discussão a serem usadas e verificadas em uma nova turma da mesma disciplina, aplicada no ambiente AulaNet. O AulaNet é um ambiente para a criação, participação e administração de cursos baseados na Web.", "num_citations": "3\n", "authors": ["115"]}
{"title": "Connections and Influences Among Topics of Learning How to Program\n", "abstract": " This Full Paper of Innovative Practice research shows results that could help to avoid some challenges faced by those who seek to learn how to program. To help improve learning, educators need a deep understanding of the obstacles students must overcome; otherwise, teaching strategies will be uncertain. Moreover, a shallow understanding of topics learned in introductory programming courses can negatively influence the learning of future topics. With the above motivation, we conducted 16 semi-structured interviews with instructors who teach introductory programming courses and we also collected diaries kept by 110 students during their studies. The qualitative analysis of these data revealed connections between the studied contents such as dependencies. Our analysis shows that many difficulties arise from the incorrect application of the knowledge necessary in learning new content, usually because the …", "num_citations": "2\n", "authors": ["115"]}
{"title": "Thematic series on software engineering from a social network perspective\n", "abstract": " In the Internet age, the concept of social network is emerging as both a useful means for understanding software development activities and a concept for designing software tools to support these activities. Employing Social Networking is useful in part, because it brings a focus to stakeholders in software development including developers, their managers, their support staff, QA analysts, requirement engineers, etc. Social networks represent how people communicate, coordinate, cooperate, and develop working relationships. The concept is also useful as it reflects the network-centric organization for dealing with highly inter-dependent artifacts–including complex source code, systems and subsystems, requirement and specification documents, etc. However, the knowledge on social network in software engineering is spread across the literature and the term social network is used for multiple purposes, such as social networking sites, social capital, interpersonal connections, and social structures. This thematic series puts together papers that employ the concept of social networks either in studying software development from an empirical approach or use the concept as a central basis for developing software tool support. Readers will find in this issue a centralized resource for research in this area.", "num_citations": "2\n", "authors": ["115"]}
{"title": "AulaNet TVD: Um protótipo de integração do ambiente de ensino-aprendizagem AulaNet para TV digital\n", "abstract": " Este trabalho apresenta a integração de um sistema Web de ensino-aprendizagem, denominado AulaNet, com a televisão digital interativa. Este artigo retrata alguns problemas tecnológicos encontrados e a arquitetura de integração adotada. Foi feita uma análise a fim de determinar as vantagens e limitações da TV digital e como as ferramentas do sistema base podem ser aproveitadas nesse contexto. A aplicação resultante deste projeto é um sistema para TV digital denominado AulaNet TVD.", "num_citations": "2\n", "authors": ["115"]}
{"title": "Sempre Atento ao Fórum: Alertas SMS para os Aprendizes se Coordenarem\n", "abstract": " Neste trabalho, é investigado o envio de alertas para auxiliar aprendizes a coordenarem sua participação em fóruns educacionais. Para cumprir as tarefas exigidas neste tipo de atividade, aprendizes têm que acompanhar a discussão e realizar as tarefas exigidas. Uma dificuldade que os participantes de um fórum têm é que o momento da chegada de mensagens é imprevisível, exigindo acesso freqüente ao ambiente educacional para saber como a discussão está se desenvolvendo. Este trabalho apresenta um estudo de caso onde são utilizados alertas através de mensagens de texto SMS para prover suporte à coordenação através de mais informações de percepção sobre o progresso do fórum.Abstract: In this paper, alerts regarding forum progress as a means of helping learners to follow educational forums is investigated. In order to accomplish the tasks required in this kind of activities, learners must follow the discussion and identify when is the best time to send their messages. One difficulty that they face is the fact that the moment a message will arrive is unforeseeable, demanding frequent forum access to find out how the discussion is progressing. This paper presents a case study in which alerts through SMS messages to notify learners about the forum progress, providing awareness as a way to support coordination.", "num_citations": "2\n", "authors": ["115"]}
{"title": "O Uso de uma Arquitetura Baseada em Componentes para Incrementar um Serviço do Ambiente AulaNet\n", "abstract": " Flexibility is necessary in groupware. A groupware should be adapted to each group characteristics and to the evolution of work process. The flexibility can be provided by the use of component based techniques. In this paper, components are used to increment a collaborative service of the AulaNet learning environment.Resumo. Flexibilidade é necessária no uso de um groupware. O groupware deve ser adaptável às diversas características dos grupos e à evolução dos processos de trabalho. Este flexibilidade pode ser facilitada pelo uso de técnicas de desenvolvimento baseado em componentes. Neste artigo é apresentado o uso de componentes para incrementar um serviço de colaboração do ambiente de ensino-aprendizagem AulaNet.", "num_citations": "2\n", "authors": ["115"]}
{"title": "Towards an engineering approach for groupware development\n", "abstract": " Software Engineering, which has advanced substantially in the development of single-user applications but only recently started addressing the human factor problem, fails to support group aspects so needed in collaborative applications. The groupware engineering enhance software engineering with CSCW concepts to develop collaborative applications. The groupware engineering cycle is based on the 3C collaboration model.", "num_citations": "2\n", "authors": ["115"]}
{"title": "Chatbots language design: the influence of language variation on user experience\n", "abstract": " Chatbots are often designed to mimic social roles attributed to humans. However, little is known about the impact on user's perceptions of using language that fails to conform to the associated social role. Our research draws on sociolinguistic theory to investigate how a chatbot's language choices can adhere to the expected social role the agent performs within a given context. In doing so, we seek to understand whether chatbots design should account for linguistic register. This research analyzes how register differences play a role in shaping the user's perception of the human-chatbot interaction. Ultimately, we want to determine whether register-specific language influences users' perceptions and experiences with chatbots. We produced parallel corpora of conversations in the tourism domain with similar content and varying register characteristics and evaluated users' preferences of chatbot's linguistic choices in terms of appropriateness, credibility, and user experience. Our results show that register characteristics are strong predictors of user's preferences, which points to the needs of designing chatbots with register-appropriate language to improve acceptance and users' perceptions of chatbot interactions.", "num_citations": "1\n", "authors": ["115"]}
{"title": "CoNCRA: A Convolutional Neural Networks Code Retrieval Approach\n", "abstract": " Software developers routinely search for code using general-purpose search engines. However, these search engines cannot find code semantically unless it has an accompanying description. We propose a technique for semantic code search: A Convolutional Neural Network approach to code retrieval (CoNCRA). Our technique aims to find the code snippet that most closely matches the developer's intent, expressed in natural language. We evaluated our approach's efficacy on a dataset composed of questions and code snippets collected from Stack Overflow. Our preliminary results showed that our technique, which prioritizes local interactions (words nearby), improved the state-of-the-art (SOTA) by 5% on average, retrieving the most relevant code snippets in the top 3 (three) positions by almost 80% of the time. Therefore, our technique is promising and can improve the efficacy of semantic code retrieval.", "num_citations": "1\n", "authors": ["115"]}
{"title": "Quem é quem finalista de discussão? Identificando diferentes emails de um mesmo participante\n", "abstract": " Listas de discussão possibilitam a comunicação entre várias pessoas utilizando a estrutura do e-mail. Listas são utilizadas para discutir diversos assuntos, desde entretenimento até desenvolvimento de software. Elas constituem uma fonte rica de informações sobre a comunicação de seus membros e o histórico das interações é utilizado para estudos quantitativos sobre o comportamento, organização e evolução da comunidade ali existente. Entretanto, usuários utilizam múltiplos endereços de email, que acabam sendo interpretados como diferentes pessoas em muitos estudos, distorcendo os resultados das análises de redes sociais e levando a conclusões equivocadas. Para evitar esse tipo de problema, alguns trabalhos propõem heurísticas para determinação única do autor das mensagens, porém pouco se sabe sobre o quão efetiva são essas heurísticas. O objetivo deste trabalho é comparar três heurísticas de desambiguação de autores utilizadas na literatura. Neste estudo, utilizamos as listas de discussão de 16 projetos de software livre da Fundação Apache e encontramos indícios de que o número de endereços de e-mails utilizados na comunidade pode influenciar a qualidade dos resultados das heurísticas e que a escolha da heurística de identificação de autores depende do conjunto de dados a ser utilizado. Os resultados deste trabalho podem servir de base para pesquisadores que investigam listas de discussão de comunidades abertas com grande número de participantes.", "num_citations": "1\n", "authors": ["115"]}
{"title": "CReAMA: A Component-Based Reference Architecture for Collaborative Mobile Applications\n", "abstract": " Developers of mobile collaborative systems deal with many technical issues, in addition to the usual difficulties for collaborative systems development. Sharing and reusing architectural solutions help these developers to cope with technical difficulties. This paper proposes a reference architecture defined to guide the development of component-based mobile collaborative systems. Systems developed according to this architecture may reuse components and address common collaborative mobile applications requirements.", "num_citations": "1\n", "authors": ["115"]}
{"title": "A Taxonomy of Computer Mediated Conversation\n", "abstract": " In this century we have witnessed the emergence of systems such as Twitter, Facebook and other social media with millions of users. These post-massive systems provide different conversation media. This article discusses the conversation media popularized with cyber culture, their historical evolution, the criteria that characterize and differentiate them, and proposes a taxonomy for its classification.", "num_citations": "1\n", "authors": ["115"]}
{"title": "Erratum to: Service-oriented middleware for the Future Internet: state of the art and research directions\n", "abstract": " By using this website, you agree to our Terms and Conditions, California Privacy Statement, Privacy statement and Cookies policy. Manage cookies/Do not sell my data we use in the preference centre.", "num_citations": "1\n", "authors": ["115"]}
{"title": "Um modelo para o suporte computacional da inteligência coletiva na Web\n", "abstract": " A web 2.0 é caracterizada por ser colaborativa. Das interações entre pessoas, emerge o que vem sendo chamado de inteligência coletiva. Há vários algoritmos para dar suporte à inteligência coletiva em sistemas web, porém muitas vezes seu uso é complicado, dificultando a exploração do seu potencial em aplicações web. Como o conceito de inteligência coletiva é muito amplo e mal definido, foi realizada uma análise de domínio, uma classificação das técnicas e seus usos nos sistemas atuais de forma a criar um modelo para o suporte computacional da inteligência coletiva na web.", "num_citations": "1\n", "authors": ["115"]}
{"title": "Resultados da avaliação de um curso baseado na Web\n", "abstract": " Este trabalho descreve a avaliação, os resultados e as dificuldades encontradas no desenvolvimento e na aplicação de um curso completamente à distância via Internet. O assunto do curso é o uso das tecnologias da informação aplicadas à educação. O curso é ministrado através do AulaNet, um ambiente para o ensino e aprendizagem na Web. O curso foi avaliado a partir de dados coletados da interação dos participantes, do ponto de vista dos instrutores e através de questionários e entrevistas aplicados aos aprendizes.Abstract. This paper describes the evaluation of a Web based course and the difficulties met in its development and application. The subject of the course is the use of information technology applied to education. The course was given using the AulaNet learning environment. The evaluation was based on the data collected from the interaction between participants, from the mediators' points of view and from questionnaires and interviews answered by the learners.", "num_citations": "1\n", "authors": ["115"]}
{"title": "AulaNeteLabora: Developing a groupware to bring the work and learning environment together\n", "abstract": " Abstract? In an information society, people must learn to work in groups with new communication and information technologies. With the AulaNet environment, developed using a prototyping approach, it is possible to carry out this type of cooperative learning. In this article, it is proposed the eLabora project, a component-based framework approach for the management of work groups based upon the AulaNet environment experience.", "num_citations": "1\n", "authors": ["115"]}
{"title": "PREDIÇÃO DE RESULTADO DE ELEIÇÃO PARA REITOR DE UNIVERSIDADE USANDO TWEETS COMO FONTE DE PESQUISA\n", "abstract": " Nos processos eletivos da Universidade Tecnológica Federal do Paraná (UTFPR) não ocorrem pesquisas eleitorais. As pesquisas eleitorais são importantes fontes democráticas de opiniões. A curiosidade em antecipar resultados é natural do ser humano, mas a principal finalidade de uma pesquisa está no contexto estratégico dos candidatos, que podem planejar ações, como mobilização para uma provável disputa de segundo turno, agradecimento aos eleitores, ou mesmo reconhecimento de uma derrota antes do resultado oficial. Para os comitês dos candidatos da UTFPR é custoso gerenciar equipes de pesquisa distribuídas geograficamente em 12 câmpus. Uma forma alternativa de fazer pesquisa eleitoral consiste em minerar dados do Twitter procurando classificar as mensagens conforme a polaridade de seus conteúdos, o que pode identificar intenções de voto. O uso desse mecanismo pode substituir a forma custosa e complexa de gerenciar equipes de pessoas distribuídas que ocorre nas pesquisas eleitorais tradicionais. Neste artigo as mensagens do Twitter são utilizadas para observar se o resultado de uma deliberação política para reitor da UTFPR corresponde aos resultados oficiais do pleito eleitoral.", "num_citations": "1\n", "authors": ["115"]}
{"title": "Detecç ao de Alertas de Segurança em Redes de Computadores Usando Redes Sociais\n", "abstract": " Neste artigo é apresentado um método de extraç ao de notificaç oes de segurança a partir de mensagens postadas em redes sociais. Nossa metodologia consiste em coletar e processar as mensagens de segurança postadas no Twitter usando técnicas de mineraçao de dados, em especıfico, agrupamento e classificaçao. Desenvolvemos um método para extrair e evidenciar alertas e problemas de segurança em ambientes de redes de computadores, otimizado com heurısticas de aumento de relevância. Como resultado, verificou-se que cerca de 92% das mensagens recuperadas abordam tópicos relacionados com segurança de redes de computadores e que mais de 50% representam potenciais alertas.Abstract. This paper presents a method of extracting security notifications based on messages posted on social networks. We collect and process security messages posted on Twitter using data mining techniques, in particular, clustering and classification. We developed a method to extract and to show alerts and security problems in computing environments, with optimized heuristics to increase relevance. As a result, it was found that about 92% of retrieved messages address topics relating to network security, and more than 50% represent potential alerts.", "num_citations": "1\n", "authors": ["115"]}