{"title": "Conformant planning via symbolic model checking and heuristic search\n", "abstract": " In this paper we tackle the problem of Conformant Planning: find a sequence of actions that guarantees goal achievement regardless of an uncertain initial condition and of nondeterministic action effects. Our approach, set in the framework of search in the belief space, is based on two main intuitions. First, symbolic model checking techniques, Binary Decision Diagrams in particular, can be used to represent and expand the search space, and to provide an efficient computational platform. Second, driving the search solely with reachability information is not effective, and the notion of knowledge has to be taken explicitly into account.We make the following contributions. First, we thoroughly analyze reachability heuristics: we formally prove their admissibility, we show how they can be implemented by means of symbolic techniques, and experimentally evaluate them. Second, we analyze the limitations of reachability …", "num_citations": "146\n", "authors": ["1606"]}
{"title": "Strong planning under partial observability\n", "abstract": " Rarely planning domains are fully observable. For this reason, the ability to deal with partial observability is one of the most important challenges in planning. In this paper, we tackle the problem of strong planning under partial observability in nondeterministic domains: find a conditional plan that will result in a successful state, regardless of multiple initial states, nondeterministic action effects, and partial observability.We make the following contributions. First, we formally define the problem of strong planning within a general framework for modeling partially observable planning domains. Second, we propose an effective planning algorithm, based on and-or search in the space of beliefs. We prove that our algorithm always terminates, and is correct and complete. In order to achieve additional effectiveness, we leverage on a symbolic, bdd-based representation for the domain, and propose several search strategies …", "num_citations": "130\n", "authors": ["1606"]}
{"title": "Strong Planning in Non-Deterministic Domains Via Model Checking.\n", "abstract": " . Most real world domains are non-deterministic: the state of the world can be incompletely known, the effect of actions can not be completely foreseen, and the environment can change in unpredictable ways. Automatic plan formation in non-deterministic domains is, however, still an open problem. In this paper we show how to do strong planning in non-determini, tic domains, ie finding automatically plans which are guaranteed to achieve the goal regardless of nondeterminism. We define a notion of planning solution which is guaranteed to achieve the goal independently of non-determinism, a notion of plan including conditionals and iterations, and an automatic decision procedure for strong planning based on model checking techniques. The procedure is correct, complete and returns optimal plans. The work has been implemented in MBP, a planner based on model checking techniques.", "num_citations": "129\n", "authors": ["1606"]}
{"title": "A framework for integrating business processes and business requirements\n", "abstract": " Service-oriented architectures and Web service infrastructure provide the ideal framework for interconnecting organizations and for defining distributed business applications. The possibility to exploit business process definition and execution languages is particularly relevant for capturing the process-oriented nature of these applications. However, business processes by themselves are not enough to manage the changes and to allow an organization to continuously adapt its business model to the typical needs of distributed applications. To achieve this flexibility, it is of uttermost importance to link the business processes to the organizational strategy and to the business goals that motivate the need of these processes. We propose a framework for representing strategies and goals of an organization in terms of business requirements. The framework allows to describe how an organizational strategy is …", "num_citations": "108\n", "authors": ["1606"]}
{"title": "Requirements-driven verification of web services\n", "abstract": " We propose a requirements-driven approach to the design and verification of Web services. The proposed methodology starts from a requirements model, which defines a business domain at a “strategic” level, describing the participating actors, their mutual dependencies, goals, require- ments, and expectations. This business requirements model is then refined into a business process model. In this refinement, definitions of the processes carried out by the actors of the domain are added to the model in the form of BPEL4WS code. We show how to exploit model checking tech- niques for the verification of the specification, both at the requirements and at the process level. At the requirements level, model checking is used to validate the specification against a set of queries specified by the designer; at the process level, it is used to verify if the BPEL4WS processes satisfy the constraints described in the requirements …", "num_citations": "101\n", "authors": ["1606"]}
{"title": "Verifying SystemC: A software model checking approach\n", "abstract": " SystemC is becoming a de-facto standard for the development of embedded systems. Verification of SystemC designs is critical since it can prevent error propagation down to the hardware. SystemC allows for very efficient simulations before synthesizing the RTL description, but formal verification is still at a preliminary stage. Recent works translate SystemC into the input language of finite-state model checkers, but they abstract away relevant semantic aspects, and show limited scalability. In this paper, we approach formal verification of SystemC by reduction to software model checking. We explore two directions. First, we rely on a translation from SystemC to a sequential C program, that contains both the mapping of the SystemC threads in form of C functions, and the coding of relevant semantic aspects (e.g. of the SystemC kernel). In terms of verification, this enables the “off-the-shelf” use of model checking …", "num_citations": "98\n", "authors": ["1606"]}
{"title": "Conformant planning via model checking\n", "abstract": " Conformant planning is the problem of finding a sequence of actions that is guaranteed to achieve the goal for any possible initial state and nondeterministic behavior of the planning domain. In this paper we present a new approach to conformant planning. We propose an algorithm that returns the set of all conformant plans of minimal length if the problem admits a solution, otherwise it returns with failure. Our work is based on the planning via model checking paradigm, and relies on symbolic techniques such as Binary Decision Diagrams to compactly represent and efficiently analyze the planning domain. The algorithm, called cmbp, has been implemented in the mbp planner. cmbp is strictly more expressive than the state of the art conformant planner sc cgp. Furthermore, an experimental evaluation suggests that cmbp is able to deal with uncertainties more efficiently than cgp.", "num_citations": "85\n", "authors": ["1606"]}
{"title": "Heuristic search+ symbolic model checking= efficient conformant planning\n", "abstract": " Planning in nondeterministic domains has gained more and more importance. Conformant planning is the problem of finding a sequential plan that guarantees the achievement of a goal regardless of the initial uncertainty and of nondeterministic action effects. In this paper, we present a new and efficient approach to conformant planning. The search paradigm, called heuristic-symbolic search, relies on a tight integration of symbolic techniques, based on the use of Binary Decision Diagrams, and heuristic search, driven by selection functions taking into account the degree of uncertainty. An extensive experimental evaluation of our planner HSCP against the state of the art conformant planners shows that our approach is extremely effective. In terms of search time, HSCP gains up to three orders of magnitude over the breadth-first, symbolic approach of CMBP, and up to five orders of magnitude over the heuristic search of GPT, requiring, at the same time, a much lower amount of memory.", "num_citations": "82\n", "authors": ["1606"]}
{"title": "Kratos – A Software Model Checker for SystemC\n", "abstract": " The growing popularity of SystemC has attracted research aimed at the formal verification of SystemC designs. In this paper we present Kratos, a software model checker for SystemC. Kratos verifies safety properties, in the form of program assertions, by allowing users to explore two directions in the verification. First, by relying on the translation from SystemC designs to sequential C programs, Kratos is capable of model checking the resulting C programs using the symbolic lazy predicate abstraction technique. Second, Kratos implements a novel algorithm, called ESST, that combines Explicit state techniques to deal with the SystemC Scheduler, with Symbolic techniques to deal with the Threads. Kratos is built on top of NuSMV and MathSat, and uses state-of-the-art SMT-based techniques for program abstractions and refinements.", "num_citations": "73\n", "authors": ["1606"]}
{"title": "Diagnostic information for realizability\n", "abstract": " Realizability – checking whether a specification can be implemented by an open system – is a fundamental step in the design flow. However, if the specification turns out not to be realizable, there is no method to pinpoint the causes for unrealizability. In this paper, we address the open problem of providing diagnostic information for realizability: we formally define the notion of (minimal) explanation of (un)realizability, we propose algorithms to compute such explanations, and provide a preliminary experimental evaluation.", "num_citations": "72\n", "authors": ["1606"]}
{"title": "Formal verification of requirements using spin: A case study on web services\n", "abstract": " In this paper we describe a novel approach for the formal specification and verification of distributed processes in a Web service framework. The formal specification is provided at two different levels of abstraction. The strategic level describes the requirements of the Web service domain, in terms of the different actors participating to it, with their goals and needs and with their mutual dependencies and expectations. The process level shows how these requirements are operationalized into communicating processes running on the different Web servers. We model the strategic level exploiting Formal Tropos (FT), a language for the formal definition of the requirements of agent-oriented systems which is based on linear time logic. We model the process level using Promela, a language designed to describe communicating concurrent processes and amenable to formal verification. We exploit the SPIN model checker to …", "num_citations": "72\n", "authors": ["1606"]}
{"title": "Requirements validation for hybrid systems\n", "abstract": " The importance of requirements for the whole development flow calls for strong validation techniques based on formal methods. In the case of discrete systems, some approaches based on temporal logic satisfiability are gaining increasing momentum. However, in many real-world domains (e.g. railways signaling), the requirements constrain the temporal evolution of both discrete and continuous variables. These hybrid domains pose substantial problems: on one side, a continuous domain requires very expressive formal languages; on the other side, the resulting expressiveness results in highly intractable problems.               In this paper, we address the problem of requirements validation for real-world hybrid domains, and present two main contributions. First, we propose the HRELTL logic, that extends the Linear-time Temporal Logic with Regular Expressions (RELTL) with hybrid aspects. Second, we …", "num_citations": "70\n", "authors": ["1606"]}
{"title": "Computing predicate abstractions by integrating BDDs and SMT solvers\n", "abstract": " The efficient computation of exact abstractions of a concrete program for a given set of predicates is key to the efficiency of Counter-Example Guided Abstraction-Refinement (CEGAR). Recent work propose the use of DPLL-based SMT solvers, modified into enumerators. This technique has been successfully applied in the realm of software, where a control flow graph is available to direct the exploration. However this approach shows some limitations when the number of models grows: in fact, it intrinsically relies on the enumeration of all the implicants, which basically requires the enumerations of all the disjuncts in the DNF of the abstraction. In this paper, we propose a new technique to improve the construction of abstractions. We complement SMT solvers with the use of BDDs, which enables us to avoid the model explosion. Essentially, we exploit the fact that BDDs are a DAG representations of the space that a …", "num_citations": "64\n", "authors": ["1606"]}
{"title": "Software model checking SystemC\n", "abstract": " SystemC is an increasingly used language for writing executable specifications of systems-on-chip. The verification of SystemC, however, is a very difficult challenge. Simulation features great scalability, but can miss important defects. On the other hand, formal verification of SystemC is extremely hard because of the presence of threads, and the intricacies of the communication and scheduling mechanisms. In this paper, we explore formal verification for SystemC by means of software model checking techniques, which have demonstrated substantial progress in recent years. We propose an accurate model of SystemC and three complementary encodings of SystemC to finite-state processes, sequential and threaded programming models. We implement the proposed approaches in a tool chain and carry out a thorough experimental evaluation using several benchmarks taken from the literature on SystemC …", "num_citations": "54\n", "authors": ["1606"]}
{"title": "Formal verification and validation of ERTMS industrial railway train spacing system\n", "abstract": " Formal verification and validation is a fundamental step for the certification of railways critical systems. Many railways safety standards (e.g. the CENELEC EN-50126, EN-50128 and EN-50129 standards implement the mandatory safety requirements of IEC-61508-7 standard for Functional and Safety) currently mandate the use of formal methods in the design to certify correctness.               In this paper we describe an industrial application of formal methods for the verification and validation of “Logica di Sicurezza” (LDS), the safety logic of a railways ERTMS Level 2 system developed by Ansaldo-STS. LDS is a generic control software that needs to be instantiated on a railways network configuration. We developed a methodology for the verification and validation of a critical subset of LDS deployed on typical realistic railways network configurations. To show feasibility, effectiveness and scalability, we have …", "num_citations": "48\n", "authors": ["1606"]}
{"title": "Sound and complete algorithms for checking the dynamic controllability of temporal networks with uncertainty, disjunction and observation\n", "abstract": " Temporal networks are data structures for representing and reasoning about temporal constraints on activities. Many kinds of temporal networks have been defined in the literature, differing in their expressiveness. The simplest kinds of networks have polynomial algorithms for determining their consistency or controllability, but corresponding algorithms for more expressive networks (e.g., Those that include observation nodes or disjunctive constraints) have so far been unavailable. However, recent work has introduced a new approach to such algorithms based on translating temporal networks into Timed Game Automata (TGAs) and then using off-the-shelf software to synthesize execution strategies -- or determine that none exist. So far, that approach has only been used on Simple Temporal Networks with Uncertainty, for which polynomial algorithms already exist. This paper extends the temporal-network-to-TGA …", "num_citations": "46\n", "authors": ["1606"]}
{"title": "Boolean abstraction for temporal logic satisfiability\n", "abstract": " Increasing interest towards property based design calls for effective satisfiability procedures for expressive temporal logics, e.g. the IEEE standard Property Specification Language (PSL).               In this paper, we propose a new approach to the satisfiability of PSL formulae; we follow recent approaches to decision procedures for Satisfiability Modulo Theory, typically applied to fragments of First Order Logic. The underlying intuition is to combine two interacting search mechanisms: on one side, we search for assignments that satisfy the Boolean abstraction of the problem; on the other, we invoke a solver for temporal satisfiability on the conjunction of temporal formulae corresponding to the assignment. Within this framework, we explore two directions. First, given the fixed polarity of each constraint in the theory solver, aggressive simplifications can be applied. Second, we analyze the idea of conflict …", "num_citations": "44\n", "authors": ["1606"]}
{"title": "Bounded verification of past LTL\n", "abstract": " Temporal logics with past operators are gaining increasing importance in several areas of formal verification for their ability to concisely express useful properties. In this paper we propose a new approach to bounded verification of PLTL, the linear time temporal logic extended with past temporal operators. Our approach is based on the transformation of PLTL into Separated Normal Form, which in turn is amenable for reduction to propositional satisfiability. An experimental evaluation shows that our approach induces encodings which are significantly smaller and more easily solved than previous approaches, in the cases of both model checking and satisfiability problems.", "num_citations": "43\n", "authors": ["1606"]}
{"title": "NuSMV 2.2 Tutorial\n", "abstract": " In this tutorial we give a short introduction to the usage of the main functionalities of NUSMV. In Chapter 2 [Examples], page 3 we describe the input language of NUSMV by presenting some examples of NUSMV models. Chapter 3 [Simulation], page 8 shows how the user can get familiar with the behavior of a NUSMV model by exploring its possible executions. Chapter 4 [CTL Model Checking], page 13 and Chapter 5 [LTL Model Checking], page 17 give an overview of BDD-based model checking, while Chapter 6 [Bounded Model Checking], page 20 presents SAT-based model checking in NUSMV.", "num_citations": "42\n", "authors": ["1606"]}
{"title": "Safety assessment of AltaRica models via symbolic model checking\n", "abstract": " AltaRica is a language used to describe safety critical systems that has become a de-facto European industrial standard for Model-Based Safety Assessment (MBSA). However, even the most mature tool for the support for MBSA of AltaRica models, i.e. Dassault's OCAS, has several limitations. The most important ones are its inability to perform many analyses exhaustively, severe scalability issues, and the lack of model checking techniques for temporal properties.In this paper we present a novel approach for the analysis of AltaRica models, based on a translation into an extended version of the model checker NuSMV. The translation relies on a novel formal characterization of the Dataflow dialect of AltaRica used in OCAS. The translation is formally defined, and its correctness is proved. Based on this formal characterization, a toolset has been developed and integrated within OCAS, thus enabling functional …", "num_citations": "38\n", "authors": ["1606"]}
{"title": "From PSL to NBA: a modular symbolic encoding\n", "abstract": " The IEEE standard property specification language (PSL) allows to express all omega-regular properties mixing linear temporal logic (LTL) with sequential extended regular expressions (SEREs), and is increasingly used in many phases of the hardware design cycle, from specification to verification. Many verification engines are able to manipulate nondeterministic Buchi automata (NBA), that can represent omega-regular properties. Thus, the ability to convert PSL into NBA is an important enabling factor for the reuse of a large wealth of verification tools. Recent works propose a two-step conversion from PSL to NBA: first, the PSL property is encoded into an alternating Buchi automaton (ABA); then, the ABA is converted into an NBA with variants of Miyano-Hayashi's construction. These approaches are problematic in practice: in fact, they are often unable to carry out the conversion in acceptable time, even for PSL …", "num_citations": "38\n", "authors": ["1606"]}
{"title": "Dynamic controllability via timed game automata\n", "abstract": " Temporal networks are data structures for representing and reasoning about temporal constraints on activities. Many kinds of temporal networks have been defined in the literature, differing in their expressiveness. The simplest kinds of networks have polynomial algorithms for determining their temporal consistency or different levels of controllability, but corresponding algorithms for more expressive networks (e.g., those that include observation nodes or disjunctive constraints) have so far been unavailable. This paper introduces a new approach to determine the dynamic controllability of a very expressive class of temporal networks that accommodates observation nodes and disjunctive constraints. The approach is based on encoding the dynamic controllability problem into a reachability game for Timed Game Automata (TGAs). This is the first sound and complete approach for determining the dynamic …", "num_citations": "37\n", "authors": ["1606"]}
{"title": "Formal verification of infinite-state BIP models\n", "abstract": " We propose two expressive and complementary techniques for the verification of safety properties of infinite-state BIP models. Both our techniques deal with the full BIP specification, while the existing approaches impose considerable restrictions: they either verify finite-state systems or they do not handle the transfer of data on the interactions and priorities.               Firstly, we propose an instantiation of the ESST (Explicit Scheduler Symbolic Thread) framework to verify BIP models. The key insight is to apply symbolic reasoning to analyze the behavior of the system described by the BIP components, and an explicit-state search to analyze the behavior of the system induced by the BIP interactions and priorities. The combination of symbolic and explicit exploration techniques allow to benefit from abstraction, useful when reasoning about data, and from partial order reduction, useful to mitigate the state space …", "num_citations": "37\n", "authors": ["1606"]}
{"title": "Comparing different variants of the IC3 algorithm for hardware model checking\n", "abstract": " IC3 is one of the most successful algorithms for hardware model checking. Since its invention in 2010, several variants of the original algorithm have been published, proposing optimizations and/or alternative procedures for many different steps of the algorithm. In this paper, we present a thorough empirical comparison of a large set of optimizations and procedures for the steps of IC3, considering “high-level” variants/extensions to the basic algorithm, as well as “low-level” optimizations/configuration settings. We implemented each of them in the same tool, optimizing the implementations to the best of our knowledge. This enabled for a flexible experimentation in a controlled environment, and to gain new insights about their most important differences and commonalities, as well as about their performance characteristics. We conducted the experiments using as benchmarks the problems used in the last four editions …", "num_citations": "36\n", "authors": ["1606"]}
{"title": "Formalizing requirements with object models and temporal constraints\n", "abstract": " Flaws in requirements often have a negative impact on the subsequent development phases. In this paper, we present a novel approach for the formal representation and validation of requirements, which we used in an industrial project. The formalism allows us to represent and reason about object models and their temporal evolution. The key ingredients are class diagrams to represent classes of objects, their relationships and their attributes, fragments of first order logic to constrain the possible configurations of such objects, and temporal logic operators to deal with the dynamic evolution of the configurations. The approach to formal validation allows to check whether the requirements are consistent, if they are compatible with some scenarios, and if they guarantee some implicit properties. The validation procedure is based on satisfiability checking, which is carried out by means of finite instantiation and model …", "num_citations": "30\n", "authors": ["1606"]}
{"title": "Symbolic model checking and safety assessment of altarica models\n", "abstract": " Altarica is a language used to describe critical systems. In this paper we present a novel approach to the analysis of Altarica models, based on a translation into an extended version of NuSMV. This approach opens up the possibility to carry out functional verification and safety assessment with symbolic techniques. An experimental evaluation on a set of industrial case studies demonstrates the advantages of the approach over currently available tools.", "num_citations": "29\n", "authors": ["1606"]}
{"title": "Boosting lazy abstraction for SystemC with partial order reduction\n", "abstract": " The SystemC language is a de-facto standard for the description of systems on chip. A promising technique, called ESST, has recently been proposed for the formal verification of SystemC designs. ESST combines Explicit state techniques to deal with the SystemC Scheduler, with Symbolic techniques, based on lazy abstraction, to deal with the Threads. Despite its relative effectiveness, this approach suffers from the potential explosion of thread interleavings.               In this paper we propose the adoption of partial order reduction (POR) techniques to alleviate the problem. We extend ESST with two complementary POR techniques (persistent set, and sleep set), and we prove the soundness of the approach in the case of safety properties. The extension is only seemingly trivial: the POR, applied to the scheduler, must be proved not to interfere with the lazy abstraction of the threads.               We implemented …", "num_citations": "29\n", "authors": ["1606"]}
{"title": "NuSmv: a reimplementation of smv\n", "abstract": " This paper describes the rst results of a joint project between CMU and IRST whose goal is to produce a reimplementation of Smv. The idea is that this new model checker, called NuSmv, should be usable, customizable and extensible, with as little e ort as possible, also by people di erent from the developers. A further goal is to produce a system which is very robust, and close to the standards required by industry.", "num_citations": "29\n", "authors": ["1606"]}
{"title": "Solving strong controllability of temporal problems with uncertainty using SMT\n", "abstract": " Temporal Problems (TPs) represent constraints over the timing of activities, as arising in many applications such as scheduling and temporal planning. A TP with uncertainty (TPU) is characterized by activities with uncontrollable duration. Different classes of TPU are possible, depending on the Boolean structure of the constraints: we have simple (STPU), constraint satisfaction (TCSPU), and disjunctive (DTPU) temporal problems with uncertainty. In this paper we tackle the problem of strong controllability, i.e. finding an assignment to all the controllable time points, such that the constraints are fulfilled under any possible assignment of uncontrollable time points. Our approach casts the problem in the framework of Satisfiability Modulo Theory (SMT), where the uncertainty of durations can be modeled by means of universal quantifiers. The use of quantifier elimination techniques leads to quantifier-free …", "num_citations": "28\n", "authors": ["1606"]}
{"title": "Timelines with temporal uncertainty\n", "abstract": " Timelines are a formalism to model planning domains where the temporal aspects are predominant, and have been used in many real-world applications. Despite their practical success, a major limitation is the inability to model temporal uncertainty, ie the plan executor cannot decide the duration of some activities.", "num_citations": "28\n", "authors": ["1606"]}
{"title": "Using timed game automata to synthesize execution strategies for simple temporal networks with uncertainty\n", "abstract": " A Simple Temporal Network with Uncertainty (STNU) is a structure for representing and reasoning about temporal constraints in domains where some temporal durations are not controlled by the executor. The most important property of an STNU is whether it is dynamically controllable (DC) whether there exists a strategy for executing the controllable time-points that guarantees that all constraints will be satisfied no matter how the uncontrollable durations turn out. This paper provides a novel mapping from STNUs to Timed Game Automata (TGAs) that:(1) explicates the deep theoretical relationships between STNUs and TGAs; and (2) enables the memoryless strategies generated from the TGA to be transformed into equivalent STNU execution strategies that reduce the real-time computational burden for the executor. The paper formally proves that the STNU-to-TGA encoding properly captures the execution semantics of STNUs.", "num_citations": "27\n", "authors": ["1606"]}
{"title": "Semi-formal functional verification by EFSM traversing via NuSMV\n", "abstract": " Simulation-based verification of hardware systems is well-established in industrial practice thanks to the ease-of-use of the approach and to its scalability. However, it notoriously suffers from the lack of exhaustiveness. On the other hand, while pure formal verification techniques provide high confidence in the design correctness, they are very limited in terms of scalability. As an alternative, semi-formal validation techniques are currently under investigation. Semi-formal approaches fulfil the tradeoff between high-coverage results, scalability of the design, and reduced resource requirements. In this work, a semi-formal approach for hardware verification is presented by exploiting constrained random simulation and extended finite state machine (EFSM) traversal through heuristics. The proposed heuristics aim to uniformly, and rapidly, visit the design space, exploiting a NuSMV-based constraint solving technique to …", "num_citations": "26\n", "authors": ["1606"]}
{"title": "Supporting the negotiation between global and local business requirements in service oriented development\n", "abstract": " The development of service oriented applications very often needs to address the problem of satisfying two conflicting kinds of business needs: global business requirements, ie, the regulations that dictate the rules of engagement between different organizations, and local business requirements, ie, the rules local to each involved partner which derive from its internal business needs. In this paper, we propose a development process where both global and local service requirements, as well as their behaviors, are incrementally agreed among partners and built through negotiation steps. The development process is supported by the explicit definition of both global and local requirements at different levels of abstraction. We express requirements in a language with a clear semantics, and which allows for explicit links to executable business processes, eg, written in BPEL4WS. This development process opens up the possibility to adopt a variety of supporting techniques. In particular, automated verification is used to detect design or implementation problems. Automated synthesis of executable business processes allows for a speed up in the development process and reduces development effort. Finally, execution monitoring is able to detect run-time problems with respect to specified requirements.", "num_citations": "26\n", "authors": ["1606"]}
{"title": "Conditional planning under partial observability as heuristic-symbolic search in belief space\n", "abstract": " Planning under partial observability in nondeterministic domains is a very significant and challenging problem, which requires dealing with uncertainty together with and-or search. In this paper, we propose a new algorithm for tackling this problem, able to generate conditional plans that are guaranteed to achieve the goal despite of the uncertainty in the initial condition and the uncertain effects of actions. The proposed algorithm combines heuristic search in the and-or space of beliefs with symbolic BDD-based techniques, and is fully amenable to the use of selection functions. The experimental evaluation shows that heuristic-symbolic search may behave much better than state-of-the-art search algorithms, based on a depth-first search (DFS) style, on several domains.", "num_citations": "25\n", "authors": ["1606"]}
{"title": "Formal Tropos: language and semantics\n", "abstract": " In this document we provide a description of the Formal Tropos language and its semantics.", "num_citations": "24\n", "authors": ["1606"]}
{"title": "Symbolic compilation of PSL\n", "abstract": " The IEEE standard property specification language (PSL) is increasingly used in many phases of the hardware design cycle, from specification to verification. PSL combines linear temporal logic (LTL) with sequential extended regular expressions (SEREs) and, thus, provides a natural formalism to express all omega-regular properties. In this paper, we propose a new method for efficiently converting PSL formulas into symbolically represented nondeterministic (generalized) Buchi automata (NGBA) that are typically used in many verification and analysis tools. The construction is based on a normal form that separates the LTL and the SERE components, and allows for a modular and specialized encoding. The compilation is enhanced by a set of syntactic transformations that aim at reducing the state space of the resulting NGBA. These rules enable to achieve, at low cost, the simplification that can be achieved with …", "num_citations": "23\n", "authors": ["1606"]}
{"title": "Strong temporal planning with uncontrollable durations: a state-space approach\n", "abstract": " In many practical domains, planning systems are required to reason about durative actions. A common assumption in the literature is that the executor is allowed to decide the duration of each action. However, this assumption may be too restrictive for applications. In this paper, we tackle the problem of temporal planning with uncontrollable action durations. We show how to generate robust plans, that guarantee goal achievement despite the uncontrollability of the actual duration of the actions. We extend the state-space temporalplanning framework, integrating recent techniques for solving temporalproblems under uncertainty. We discuss different ways of lifting the total order plans generated by the heuristic search to partial orderplans, showing (in) completeness results for each of them. We implemented our approach on top of COLIN, a state-of-the-art planner. An experimental evaluation over several benchmark problems shows the practical feasibility of the proposed approach.", "num_citations": "21\n", "authors": ["1606"]}
{"title": "Solving temporal problems using smt: Strong controllability\n", "abstract": " Many applications, such as scheduling and temporal planning, require the solution of Temporal Problems (TP’s) representing constraints over the timing of activities. A TP with uncertainty (TPU) is characterized by activities with uncontrollable duration. Depending on the Boolean structure of the constraints, we have simple (STPU), constraint satisfaction (TCSPU), and disjunctive (DTPU) temporal problems with uncertainty.               In this work we tackle the problem of strong controllability, i.e. finding an assignment to all the controllable time points, such that the constraints are fulfilled under any possible assignment of uncontrollable time points. We work in the framework of Satisfiability Modulo Theory (SMT), where uncertainty is expressed by means of universal quantifiers. We obtain the first practical and comprehensive solution for strong controllability: the use of quantifier elimination techniques leads to …", "num_citations": "21\n", "authors": ["1606"]}
{"title": "Strong temporal planning with uncontrollable durations\n", "abstract": " Planning in real world domains often involves modeling and reasoning about the duration of actions. Temporal planning allows such modeling and reasoning by looking for plans that specify start and end time points for each action. In many practical cases, however, the duration of actions may be uncertain and not under the full control of the executor. For example, a navigation task may take more or less time, depending on external conditions such as terrain or weather.In this paper, we tackle the problem of strong temporal planning with uncontrollable action durations (STPUD). For actions with uncontrollable durations, the planner is only allowed to choose the start of the actions, while the end is chosen, within known bounds, by the environment. A solution plan must be robust with respect to all uncontrollable action durations, and must achieve the goal on all executions, despite the choices of the environment.We …", "num_citations": "20\n", "authors": ["1606"]}
{"title": "HRELTL: A temporal logic for hybrid systems\n", "abstract": " Hybrid traces are useful to describe behaviors of dynamic systems where continuous and discrete evolutions are combined. The ability to represent sets of traces by means of formulas in temporal logic has recently found important applications in various fields, such as requirements analysis, compositional verification, and contract-based design. In this paper we present HRELTL, a temporal logic to characterize hybrid traces. The logic is highly expressive: it allows the description of continuous behaviors, by expressing mathematical constraints over derivatives, and discrete behaviors, by constraining values of variables across instantaneous transitions. HRELTL combines the power of temporal operators and regular expressions, and enjoys important properties such as sampling invariance.We demonstrate that the satisfiability problem for a fragment of HRELTL allows for a satisfiability-preserving reduction to …", "num_citations": "20\n", "authors": ["1606"]}
{"title": "Searching powerset automata by combining explicit-state and symbolic model checking\n", "abstract": " The ability to analyze a digital system under conditions of uncertainty is important in several application domains. The problem is naturally described in terms of search in the powerset of the automaton representing the system. However, the associated exponential blow-up prevents the application of traditional model checking techniques. This work describes a new approach to searching powerset automata, which does not require the explicit powerset construction. We present an efficient representation of the search space based on the combination of symbolic and explicit-state model checking techniques. We describe several search algorithms, based on two different, complementary search paradigms, and we experimentally evaluate the approach.", "num_citations": "19\n", "authors": ["1606"]}
{"title": "Dynamic controllability of disjunctive temporal networks: Validation and synthesis of executable strategies\n", "abstract": " The Temporal Network with Uncertainty (TNU) modeling framework is used to represent temporal knowledge in presence of qualitative temporal uncertainty. Dynamic Controllability (DC) is the problem of deciding the existence of a strategy for scheduling the controllable time points of the network observing past happenings only. In this paper, we address the DC problem for a very general class of TNU, namely Disjunctive Temporal Network with Uncertainty. We make the following contributions. First, we define strategies in the form of an executable language; second, we propose the first decision procedure to check whether a given strategy is a solution for the DC problem; third we present an efficient algorithm for strategy synthesis based on techniques derived from Timed Games and Satisfiability Modulo Theory. The experimental evaluation shows that the approach is superior to the state-of-the-art.", "num_citations": "18\n", "authors": ["1606"]}
{"title": "Verification and performance evaluation of AADL models\n", "abstract": " This paper reports on a model-based approach to system-software co-engineering which is tailored to critical on-board systems for the aerospace domain but is relevant to a much wider class of dependable systems. Our main contribution is a formal semantics for a greater part of standardised AADL, the Architecture Analysis and Design Language, and its Error Model Annex. It covers nominal and degraded hardware/software operations, hybrid (and timing) aspects as well as probabilistic faults, their propagation and recovery. The accompanying software toolset employs SAT-based and symbolic model checking techniques and probabilistic variants thereof. The precise nature of these techniques together with the formal semantics provide a trustworthy modelling and analysis framework to support, among others, assessment of functional correctness, evaluation of performance measures and automated derivation of …", "num_citations": "18\n", "authors": ["1606"]}
{"title": "Solving temporal problems using SMT: weak controllability\n", "abstract": " Temporal problems with uncertainty are a well established formalism to model time constraints of a system interacting with an uncertain environment. Several works have addressed the definition and the solving of controllability problems, and three degrees of controllability have been proposed: weak, strong, and dynamic. In this work we focus on weak controllability: we address both the decision and the strategy extraction problems. Extracting a strategy means finding a function from assignments to uncontrollable time points to assignments to controllable time points that fulfills all the temporal constraints. We address the two problems in the satisfiability modulo theory framework. We provide a clean and complete formalization of the problems, and we propose novel techniques to extract strategies. We also provide experimental evidence of the scalability and efficiency of the proposed techniques.", "num_citations": "17\n", "authors": ["1606"]}
{"title": "An analytic evaluation of SystemC encodings in promela\n", "abstract": " SystemC is a de-facto standard language for high-level modeling of systems on chip. We investigate the feasibility of explicit state model checking of SystemC programs, proposing several ways to convert SystemC into Promela. We analyze the expressiveness of the various encoding styles, and we experimentally evaluate their impact on the search carried out by SPIN on a significant set of benchmarks. We also compare the results with recent approaches to symbolic verification of SystemC. Our approach never returns false positives, detects assertion violations much faster than recent formal approaches, and has the novel feature of pinpointing non-progressing delta cycles.", "num_citations": "17\n", "authors": ["1606"]}
{"title": "A comprehensive approach to on-board autonomy verification and validation\n", "abstract": " Deep space missions are characterized by severely constrained communication links. To meet the needs of future missions and increase their scientific return, future space systems will require an increased level of autonomy on-board. In this work, we propose a comprehensive approach to on-board autonomy relying on model-based reasoning, and encompassing many important reasoning capabilities such as plan generation, validation, execution and monitoring, FDIR, and run-time diagnosis. The controlled platform is represented symbolically, and the reasoning capabilities are seen as symbolic manipulation of such formal model. We have developed a prototype of our framework, implemented within an on-board Autonomous Reasoning Engine. We have evaluated our approach on two case-studies inspired by real-world, ongoing projects, and characterized it in terms of reliability, availability and performance.", "num_citations": "17\n", "authors": ["1606"]}
{"title": "An SMT-based approach to weak controllability for disjunctive temporal problems with uncertainty\n", "abstract": " The framework of temporal problems with uncertainty (TPU) is useful to express temporal constraints over a set of activities subject to uncertain (and uncontrollable) duration. In this work, we focus on the most general class of TPU, namely disjunctive TPU (DTPU), and consider the case of weak controllability, that allows one to model problems arising in practical scenarios (e.g. on-line scheduling).We first tackle the decision problem, i.e. whether there exists a schedule of the activities that, depending on the uncertainty, satisfies all the constraints. We propose a logical approach, based on the reduction to a problem of Satisfiability Modulo Theories (SMT), in the theory of Linear Real Arithmetic with Quantifiers. This results in the first implemented solver for weak controllability of DTPUs.Then, we tackle the problem of synthesizing control strategies for scheduling the activities. We focus on strategies that are amenable …", "num_citations": "16\n", "authors": ["1606"]}
{"title": "Structure-aware computation of predicate abstraction\n", "abstract": " The precise computation of abstractions is a bottleneck in many approaches to CEGAR-based verification. In this paper, we propose a novel approach, based on the use of structural information. Rather than computing the abstraction as a single, monolithic quantification, we provide a structure-aware abstraction algorithm, based on two complementary steps. The first, highlevel step exploits the structure of the system, and partitions the abstraction problem into the combination of several smaller abstraction problems. This is represented as a formula with quantifiers. The second, low-level step exploits the structure of the formula, in particular the occurrence of variables within the quantifiers, and applies a set of low-level rewriting rules aiming at further reducing the scope of quantifiers. We experimentally evaluate the approach on a substantial set of benchmarks, and show significant speed ups compared to monolithic …", "num_citations": "15\n", "authors": ["1606"]}
{"title": "Software model checking with explicit scheduler and symbolic threads\n", "abstract": " In many practical application domains, the software is organized into a set of threads, whose activation is exclusive and controlled by a cooperative scheduling policy: threads execute, without any interruption, until they either terminate or yield the control explicitly to the scheduler. The formal verification of such software poses significant challenges. On the one side, each thread may have infinite state space, and might call for abstraction. On the other side, the scheduling policy is often important for correctness, and an approach based on abstracting the scheduler may result in loss of precision and false positives. Unfortunately, the translation of the problem into a purely sequential software model checking problem turns out to be highly inefficient for the available technologies. We propose a software model checking technique that exploits the intrinsic structure of these programs. Each thread is translated into a separate sequential program and explored symbolically with lazy abstraction, while the overall verification is orchestrated by the direct execution of the scheduler. The approach is optimized by filtering the exploration of the scheduler with the integration of partial-order reduction. The technique, called ESST (Explicit Scheduler, Symbolic Threads) has been implemented and experimentally evaluated on a significant set of benchmarks. The results demonstrate that ESST technique is way more effective than software model checking applied to the sequentialized programs, and that partial-order reduction can lead to further performance improvements.", "num_citations": "13\n", "authors": ["1606"]}
{"title": "Model-based codesign of critical embedded systems\n", "abstract": " We present a comprehensive methodology for the specification and analysis of critical embedded systems. The methodology is based on an architectural design language that enables modeling of both software and hardware components, timed and hybrid behavior, faulty behavior and degraded modes of operation, error propagation and recovery. The methodology is supported by an integrated platform, implemented on top of state-of-the-art tools, that provides verification capabilities ranging from requirements analysis to functional verification, safety assessment, performability evaluation, diagnosis and diagnosability.", "num_citations": "13\n", "authors": ["1606"]}
{"title": "nuXmv 2.0. 0 user manual\n", "abstract": " NUXMV inherits, and thus provides to the user, all the functionalities of NUSMV [CCG+ 02]. In this section we revise all the new features distinguishing them in those for the analysis of finite-state domains, those for the analysis of infinite-state domains, and other generic features.", "num_citations": "12\n", "authors": ["1606"]}
{"title": "On-board autonomy via symbolic model-based reasoning\n", "abstract": " Deep space and remote planetary exploration missions are characterized by severely constrained communication links and often require intervention from Ground to overcome the difficulties encountered during the mission. An adequate Ground control could be compromised due to communication delays and required Ground decision-making time, endangering the system, although safing procedures are strictly adhered to. To meet the needs of future missions and increase their scientific return, space systems will require an increased level of autonomy on-board. We propose a solution to on-board autonomy relying on model-based reasoning. Our approach integrates many important functionalities (such as plan generation, plan execution and monitoring, fault detection identification and recovery, and run-time diagnosis) in a uniform formal framework. The spacecraft is equipped with an Autonomous Reasoning Engine (ARE) structured according to a generic three-layer hybrid autonomy architecture: Deliberative, Executive and Control Layers. The ARE uses a symbolic representation of the controlled platform. Reasoning capabilities are seen as symbolic manipulation of such formal model. We have developed a prototype of the ARE, and we have evaluated it on two case studies inspired by real-world ongoing projects: a planetary rover and an orbiting spacecraft. For each case study, we have used a simulator to characterize the approach in terms of reliability, availability and performances.", "num_citations": "12\n", "authors": ["1606"]}
{"title": "Certifying proofs for LTL model checking\n", "abstract": " In the context of formal verification, certifying proofs are proofs of the correctness of a model in a deduction system produced automatically as outcome of the verification. They are quite appealing for high-assurance systems because they can be verified independently by proof checkers, which are usually simpler to certify than the proof-generating tools. Model checking is one of the most prominent approaches to formal verification of temporal properties and is based on an algorithmic search of the system state space. Although modern algorithms integrate deductive methods, the generation of proofs is typically restricted to invariant properties only. In this paper, we solve this issue in the context of Linear-time Temporal Logic. By exploiting the k-liveness algorithm, we show how to extend proof generation capabilities for invariant checking to cover full LTL properties, in a simple and efficient manner, with essentially no …", "num_citations": "11\n", "authors": ["1606"]}
{"title": "System-software co-engineering: Dependability and safety perspective\n", "abstract": " The need for an integrated system-software co-engineering framework to support the design of modern space systems is pressing. The current tools and formalisms tend to be tailored to specific analysis techniques and are not amenable for the full spectrum of required system aspects such as safety, dependability and performability. Additionally, they cannot handle the intertwining of hardware and software interaction. As such, the current practices lack integration and coherence. We recently developed a coherent and multidisciplinary approach towards developing space systems at architectural design level, linking all of the aforementioned aspects, and assessed it with several industrial evaluations. This paper reports on the approach, the evaluations and our perspective on current and future developments.", "num_citations": "11\n", "authors": ["1606"]}
{"title": "Syntactic optimizations for PSL verification\n", "abstract": " The IEEE standard Property Specification Language (PSL) allows to express all ω-regular properties mixing Linear Temporal Logic (LTL) with Sequential Extended Regular Expressions (SEREs), and is increasingly used in many phases of the hardware design cycle, from specification to verification.               In recent works, we propose a modular and symbolic PSL compilation that is extremely fast in conversion time and outperforms by several orders of magnitude translators based on the explicit construction and minimization of automata. Unfortunately, our approach creates rather redundant automata, which result in a penalty in verification time.               In this paper, we propose a set of syntactic simplifications that enable to significantly improve the verification time without paying the price of automata simplifications. A thorough experimental analysis over large sets of paradigmatic properties shows that …", "num_citations": "11\n", "authors": ["1606"]}
{"title": "Extending nuXmv with Timed Transition Systems and Timed Temporal Properties\n", "abstract": " nuXmv is a well-known symbolic model checker, which implements various state-of-the-art algorithms for the analysis of finite- and infinite-state transition systems and temporal logics. In this paper, we present a new version that supports timed systems and logics over continuous super-dense semantics. The system specification was extended with clocks to constrain the timed evolution. The support for temporal properties has been expanded to include  formulas with parametric intervals. The analysis is performed via a reduction to verification problems in the discrete-time case. The internal representation of traces has been extended to go beyond the lasso-shaped form, to take into account the possible divergence of clocks. We evaluated the new features by comparing nuXmv with other verification tools for timed automata and , considering different benchmarks from the literature. The results …", "num_citations": "9\n", "authors": ["1606"]}
{"title": "Tighter integration of BDDs and SMT for Predicate Abstraction\n", "abstract": " We address the problem of computing the exact abstraction of a program with respect to a given set of predicates, a key computation step in Counter-Example Guided Abstraction Refinement. We build on a recently proposed approach that integrates BDD-based quantification techniques with SMT-based constraint solving to compute the abstraction. We extend the previous work in three main directions. First, we propose a much tighter integration of the BDD-based and SMT-based reasoning where the two solvers strongly collaborate to guide the search. Second, we propose a technique to reduce redundancy in the search by blocking already visited models. Third, we present an algorithm exploiting a conjunctively partitioned representation of the formula to quantify. This algorithm provides a general framework where all the presented optimizations integrate in a natural way. Moreover, it allows to overcome the …", "num_citations": "9\n", "authors": ["1606"]}
{"title": "Abstraction in planning via model checking\n", "abstract": " Planning via Model Checking is a novel approach to planning. It is based on the reformulation of a planning problem to the exploration of a nite state automaton. Automata exploration can be e ciently performed with Model Checking, a formal veri cation technique widely applied in design of industrial systems. For very large domains, however, a state explosion can arise. Abstractions can be used to tackle the problem. In this paper we show how Abstraction techniques developed in classical planning can be lifted to the Planning via Model Checking paradigm.", "num_citations": "9\n", "authors": ["1606"]}
{"title": "Validating domains and plans for temporal planning via encoding into infinite-state linear temporal logic\n", "abstract": " Temporal planning is an active research area of Artificial Intelligence because of its many applications ranging from roboticsto logistics and beyond. Traditionally, authors focused on theautomatic synthesis of plans given a formal representation of thedomain and of the problem. However, the effectiveness of suchtechniques is limited by the complexity of the modeling phase: it ishard to produce a correct model for the planning problem at hand. In this paper, we present a technique to simplify the creation ofcorrect models by leveraging formal-verification tools for automaticvalidation. We start by using the ANML language, a very expressivelanguage for temporal planning problems that has been recentlypresented. We chose ANML because of its usability andreadability. Then, we present a sound-and-complete, formal encodingof the language into Linear Temporal Logic over predicates withinfinite-state variables. Thanks to this reduction, we enable theformal verification of several relevant properties over the planningproblem, providing useful feedback to the modeler.", "num_citations": "8\n", "authors": ["1606"]}
{"title": "Verification of parametric system designs\n", "abstract": " System designs are often modeled as sets of threads whose activations are controlled by a domain-specific scheduler. Especially in the early design phases, the interactions between the threads and the scheduler often depend on parameters (such as the duration of thread suspensions) for which a value is not available. In this paper, we tackle the verification of designs with parametric scheduler-thread interaction. We propose a new method, called Semi-Symbolic Scheduler/Symbolic Threads (S3ST), to prove that a design satisfies the specified assertions for all possible values of the interaction parameters. We build on Explicit-Scheduler/Symbolic-Threads (ESST), an effective technique for verifying designs with cooperative scheduling, that is however limited to the case of non-parametric interactions. As in ESST, S3ST analyzes each thread symbolically using lazy predicate abstraction. The key difference is in the …", "num_citations": "4\n", "authors": ["1606"]}
{"title": "Forward Conformant Planning via Symbolic Model Checking\n", "abstract": " Conformant planning is the problem of finding a sequence of actions that is guaranteed to achieve the goal for any possible initial state and nondeterministic behavior of the planning domain. In this paper we present a new algorithm for conformant planning, returning conformant plans of minimal length if the problem admits a solution, otherwise returning with failure. This work extends previous work on conformant planning, based on model checking techniques. The algorithm presented in this paper takes full advantage of the symbolic representation based on Binary Decision Diagrams (BDDs). In particular, it proceeds forwards, from the initial states towards the goal. It is thus able to exploit forward computation steps, which some times can be significantly more efficient than the corresponding backwards. Furthermore, it implements a new simplification technique which also significantly improves the performance, by containing the combinatorial explosion of the number of explored plans due to the use of a serial encoding. Experimental results suggest that our conformant planner CMBP, besides being strictly more expressive than the state of the art conformant planner CGP, is also able to deal with uncertainties more efficiently.", "num_citations": "4\n", "authors": ["1606"]}
{"title": "Using quantified Boolean logics to verify web service composition requirements\n", "abstract": " This paper illustrates a framework for the definition of formal requirements on the behavior of Web service compositions. The framework exploits Quantified Linear Time Logics (QLTL) as formal specification language. The paper also discusses two approach for the verification of such formal requirements. The first approach, which is classical, transforms QLTL formulas into (nonquantified) Linear Time Logic formulas by expanding the quantifiers, and then exploits SAT-based Bounded Model Checking techniques on the resulting LTL formulas. The second approach, which is novel, exploits Bounded Model Checking techniques based on Quantified Boolean Formulas (QBF), thus avoiding the explicit expansion of the quantifiers.", "num_citations": "3\n", "authors": ["1606"]}
{"title": "SMT-based satisfiability of first-order LTL with event freezing functions and metric operators\n", "abstract": " In this paper, we propose to extend First-Order Linear-time Temporal Logic with Past adding two operators “at next” and “at last”, which take in input a term and a formula and return the value of the term at the next state in the future or last state in the past in which the formula holds. The new logic, named LTL-EF, can be interpreted with different models of time (including discrete, dense, and super-dense time) and with different first-order theories (à la Satisfiability Modulo Theories (SMT)). We show that the “at next” and “at last” can encode (first-order) MTL 0,∞ with counting. We provide rewriting procedures to reduce the satisfiability problem to the discrete-time case (to leverage on the mature state-of-the-art corresponding verification techniques) and to remove the extra functional symbols. We implemented these techniques in the nuXmv model checker enabling the analysis of LTL-EF and MTL 0,∞ based on SMT …", "num_citations": "2\n", "authors": ["1606"]}
{"title": "Conformant planning via symbolic model checking\n", "abstract": " We tackle the problem of planning in nondeterministic domains, by presenting a new approach to conformant planning. Conformant planning is the problem of finding a sequence of actions that is guaranteed to achieve the goal despite the nondeterminism of the domain. Our approach is based on the representation of the planning domain as a finite state automaton. We use Symbolic Model Checking techniques, in particular Binary Decision Diagrams, to compactly represent and efficiently search the automaton. In this paper we make the following contributions. First, we present a general planning algorithm for conformant planning, which applies to fully nondeterministic domains, with uncertainty in the initial condition and in action effects. The algorithm is based on a breadth-first, backward search, and returns conformant plans of minimal length, if a solution to the planning problem exists, otherwise it terminates …", "num_citations": "2\n", "authors": ["1606"]}
{"title": "Formal Methods for Industrial Critical Systems\n", "abstract": " Formal Methods for Industrial Critical Systems - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Formal Methods for Industrial Critical Systems Kowalewski, Stefan ; Roveri, Marco Abstract Publication: Lecture Notes in Computer Science Pub Date: 2010 DOI: 10.1007/978-3-642-15898-8 Bibcode: 2010LNCS.6371.....K Keywords: Computer Science; Software Engineering; Logics and Meanings of Programs; Programming Languages; Compilers; Interpreters; Special Purpose and Application-Based Systems full text sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is …", "num_citations": "2\n", "authors": ["1606"]}
{"title": "On Board Model Checking for Space Applications\n", "abstract": " On Board Model Checking for Space Applications IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno On Board Model Checking for Space Applications Italiano Italiano English On Board Model Checking for Space Applications / Alessandro Cimatti; Andrea Guiotto; Marco Roveri. - (2008), pp. 10-11. ((Intervento presentato al convegno ADCSS tenutosi a Noordwijk, The Netherlands nel 29/10/2008 - 31/10/2008. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda breve Scheda completa Titolo: On Board Model Checking for Space Applications Autori: Cimatti, Alessandro Roveri, Marco mostra contributor esterni Data di …", "num_citations": "2\n", "authors": ["1606"]}
{"title": "The NuSMV Model Checker\n", "abstract": " NuSMV is a symbolic model checker developed by ITC-IRST and UniTN with the collaboration of CMU and UniGE. The NuSMV project aims at the development of a state-of-the-art model checker that: is robust, open and customizable; can be applied in technology transfer projects; can be used as research tool in different domains. NuSMV is OpenSource: developed by a distributed community,“Free Software” license.", "num_citations": "2\n", "authors": ["1606"]}
{"title": "Planning in non-deterministic domains via symbolic model checking\n", "abstract": " In this chapter we describe the motivations that justify the work presented in this thesis and the objectives that we would like to achieve with this work. Finally we briefly discuss the structure of this dissertation.", "num_citations": "2\n", "authors": ["1606"]}
{"title": "A comprehensive approach to on-board autonomy verification and validation\n", "abstract": " Deep space missions are characterized by severely constrained communication links. To meet the needs of future missions and increase their scientific return, future space systems will require an increased level of autonomy on-board. In this work, we propose a comprehensive approach to on-board autonomy. We rely on model-based reasoning, and we consider many important (on-line and off-line) reasoning capabilities such as plan generation, validation, execution and monitoring, runtime diagnosis, and fault detection, identification, and recovery. The controlled platform is represented symbolically, and the reasoning capabilities are seen as symbolic manipulation of such formal model. We have developed a prototype of our framework, and we have integrated it within an on-board Autonomous Reasoning Engine. Finally, we have evaluated our approach on three case-studies inspired by real-world projects and …", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Certifying proofs for SAT-based model checking\n", "abstract": " In the context of formal verification, certifying proofs are evidences of the correctness of a model in a deduction system produced automatically as outcome of the verification. They are quite appealing for high-assurance systems because they can be verified independently by proof checkers, which are usually simpler to certify than the proof-generating tools. Model checking is one of the most prominent approaches to formal verification of temporal properties and is based on an algorithmic search of the system state space. Although modern algorithms integrate deductive methods, the generation of proofs is typically restricted to invariant properties only. Moreover, it assumes that the verification produces an inductive invariant of the original system, while model checkers usually involve a variety of complex pre-processing simplifications. In this paper we show how, exploiting the k-liveness algorithm, to extend proof …", "num_citations": "1\n", "authors": ["1606"]}
{"title": "A data-driven approach for rul prediction of an experimental filtration system\n", "abstract": " This paper illustrates a data-driven approach adopted to address the PHME2020 Data Challenge competition. The aim of the challenge was to estimate the Remaining Useful Lifetime (RUL) of an experimental filtration device analyzing its clogging status by means of static (eg data sheets, fluid type, sensors) and dynamic (eg sensing data) information. We address the problem employing different state-of-the-art feature extraction, feature selection, and machine learning techniques. In this paper, we describe the approach followed to assess the problem and to generate robust and adaptable prediction models together with a corresponding performance assessment and robustness evaluation. The performance of the proposed solution is calculated in term of penalty score. The final penalty score 57.24 ranked 2nd in the above-mentioned data challenge competition.", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Innovative Rover Operations Concepts-Autonomous Planner (IRONCAP)-Concluding the adventure\n", "abstract": " I. Introduction his paper recaps first on the aims of the study giving a brief background to why this study was needed. It then presents the architecture designed for the prototype detailing the relationship and positioning within a ground segment including the expected interactions with the various components of a ground segment. We follow this by describing the contrast between rover science operations planning and engineering operations planning illustrating the common and/or conflicting requirements. The paper introduces the planning and scheduling techniques that are", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Innovative Rover Operations Concepts-Autonomous Planner (IRONCAP)-Supporting Rover Operations Planning on Ground\n", "abstract": " IRONCAP is an ESA study project to explore and define the concepts, techniques and interactions needed to plan and schedule the activities of an interplanetary rover. Its aim is to develop a prototype system to support the science and engineering planning activities of an interplanetary rover using state-of-the-art methods and techniques in planning and scheduling combined with existing and/or developing ground segment systems and technologies. The prototype will support the situational analysis of the rover and facilitate the planning and scheduling of activities/observation for the applicable autonomy levels, supporting the teams in their daily activities. As with any rover mission, situational assessment of the rover has to be performed to establish the context in which the planning of operations can be performed. This is performed on an engineering level and on a science level both with their own goals and …", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Innovative rover operations concepts—Autonomous planning keeping a dog on the lead\n", "abstract": " The Innovative Rover Operations Concepts–Autonomous Planning (IRONCAP) is an ESA study project to explore and define the concepts and interactions needed to control and plan the activities of an interplanetary rover. Its aim is to develop a prototype system to support the science and engineering planning of an interplanetary rover using stateof-the-art methods and techniques in planning and scheduling combined with existing and/or developing ground segment systems and technologies. In this paper we outline the aims of the study giving a brief background to why this study is needed, present the current architecture for the prototype, detail the contrast between rover science operations planning and engineering operations planning illustrating any common or contrasting requirements, introduce the planning and scheduling techniques being investigated during the study and summarize the synergies with other ESA projects. We will conclude with a look at the current status of the project and present its current direction and outlook.", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Formal Methods for Industrial Critical Systems: 15th International Workshop, FMICS 2010, Antwerp, Belgium, September 20-21, 2010. Proceedings\n", "abstract": " This volume contains the papers presented at FMICS 2010, the 15th Inter-tional Workshop on Formal Methods for Industrial Critical Systems, which was held on September 20-21, 2010, in Antwerp, Belgium. Previous workshops of the ERCIM working group on Formal Methods for Industrial Critical Systems wereheld in Oxford (March 1996), Cesena (July 1997), Amsterdam (May 1998), Trento (July 1999), Berlin (April 2000), Paris (July 2001), Malaga (July 2002), Trondheim (June2003), Linz (September 2004), Lisbon (September 2005), Bonn (August 2006), Berlin (July 2007), L Aquila (September 2008), and Eindhoven (November 2009). The aim of the FMICS workshop series is to provide a forum for researchers who are interested in the development and application of formal methods in industry. In particular, these workshops bring together scientists and engineers who are active in the area of formal methods and are interested in exchanging their experiences in the industrial usage of these methods. These workshops also strive to promote research and development for the improvement of formal methods and tools for industrial applications. The FMICS 2010 workshop was co-located with ASE 2010, the 25th IEEE/ACMInternationalConferenceonAutomatedSoftwareEngineering, which o? ereda choiceofeventsintheareainadditionto themainconference. More-formation about ASE 2010 and the co-located events can be found on http://soft. vub. ac. be/ase20", "num_citations": "1\n", "authors": ["1606"]}
{"title": "From sequential extended regular expressions to NFA with symbolic labels\n", "abstract": " Practical property specification languages such as the IEEE standard PSL use at their core Sequential Extended Regular Expressions (SERE). In order to enable the reuse of traditional verification techniques, it is necessary to translate SEREs into automata. SERE are regular expressions built over alphabets resulting from the state variables of the design under analysis. Thus, a traditional approach to generate the automaton would suffer from the fact that the size of the alphabet is exponential in the number of symbols in the design. In this work, we tackle this problem by proposing non-deterministic finite automata with symbolic representation of transitions labels, by way of propositional formulas, while states and transitions are explicitly represented. We provide a symbolic version of the algorithms for all the major operations over non-deterministic finite automata. The approach has been implemented in the AutLib …", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Improved Decision Heuristic for High Performance SAT Based Static Property Checking\n", "abstract": " This document contains important aspects of SAT Solver performances and specification for improving this performance.", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Using abstraction to prove theorems in boolean algebra\n", "abstract": " We use abstraction as a tool to simplify proofs in Boolean Algebra (BA). We mechanize proofs by abstraction inside ABSFOL. We use OTTER to assess the e ectiveness of our approach.", "num_citations": "1\n", "authors": ["1606"]}
{"title": "Discovery and Identification of Memory Corruption Vulnerabilities on Bare-metal Embedded Devices\n", "abstract": " Memory corruption vulnerabilities remain a prevalent threat on low-cost bare-metal devices. Fuzzing is a popular technique for automatically discovering such vulnerabilities. However, bare-metal devices lack even basic security mechanisms such as Memory Management Unit. Consequently, fuzzing approaches encounter silent memory corruptions with no visible effects, making even discovery difficult. Once discovered, it is also essential to identify the type of observed vulnerability for applying mitigation. Both discovery and identification remain open challenges in the case of fuzzing firmware binaries. This paper addresses these problems by proposing an automated instrumentation technique that allows the observation of memory corruption vulnerabilities that are otherwise not observable and facilitates the automated identification of the observed vulnerability. Additionally, we surveyed state-of-the-art IoT fuzzers …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Optimization Modulo Non-linear Arithmetic via Incremental Linearization\n", "abstract": " Incremental linearization is a conceptually simple, yet effective, technique that we have recently proposed for solving SMT problems on the theories of non-linear arithmetic over the reals and the integers. Optimization Modulo Theories (OMT) is an important extension of SMT which allows for finding models that optimize given objective functions. In this paper, we show how incremental linearization can be extended to OMT in a simple way, producing an incomplete though effective OMT procedure. We describe the main ideas and algorithms, we provide an implementation within the OptiMathSAT OMT solver, and perform an empirical evaluation. The results support the effectiveness of the approach.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Planning with Global State Constraints for Urban Traffic Control\n", "abstract": " Planning with global state constraints is an extension of classical planning in which some properties of each state are derived via a set of constraints. This approach allows us to apply planning techniques in domains involving interconnected physical systems. The crucial feature of such domains is that a single discrete action affects the state of the entire system in a way that is dependent on the global state. Urban Traffic Control refers to coordinating traffic signals over an area in order to reduce congestion and delays. Here we show how this domain can be modelled as a planning problem with global state constraints.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Predicting RUL of Bearings in the Pumps of a Critical Industrial Air Treatment System\n", "abstract": " Predictive maintenance is emerging as a promising technique to overcome the limitations of periodic maintenance. It integrates automatic condition monitoring to evaluate the health status of a system or device, with the estimation of Remaining Useful Life (RUL) of its components, in order to schedule maintenance only when really needed, minimizing the downtime of a plant.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Software Engineering and Formal Methods: SEFM 2017 Collocated Workshops: DataMod, FAACS, MSE, CoSim-CPS, and FOCLASA, Trento, Italy, September 4-5, 2017, Revised Selected Papers\n", "abstract": " This book constitutes revised selected papers from the five workshops collocated with the 15th International Conference on Software Engineering and Formal Methods, SEFM 2017. The 38 papers presented in this volume were carefully reviewed and selected from a total of 55 submissions. They stem from the following workshops: DataMod 2017--6th International Symposium “From Data to Models and Back\"; FAACS 2017--1st Workshop on Formal Approaches for Advanced Computing Systems; MSE 2017--1st Workshop on Microservices: Science and Engineering; CoSim-CPS 2017--1st Workshop on Formal Co-Simulation of Cyber-Physical Systems; FOCLASA 2017--15th International Workshop on Foundations Of Coordination Languages and Self-Adaptive Systems​.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "GIADA, un sistema centralizzato per la gestione dell'irrigazione a domanda/GIADA, a decision support system for a demand-driven irrigation\n", "abstract": " Plant protection models and other decision-support tools (DTs) have become important for integrated pest management (IPM) programs. Directive 128/2009/EC on sustainable use of pesticides defines the role of DTs in supporting decision making on whether and when intervene to protect the crops from harmful organisms. The Italian Action Plan assigns to Regional governments the responsibility of defining DTs suitable to the scope and making them (or their output) available for professional users. Several plant protection models exist in literature, which have been developed for different purposes, by using diverse approaches, in different climatic conditions and agricultural contexts. The criteria for comparing and selecting models for being usefully integrated in the Italian IPM schemes are discussed in this talk, including: model purpose and approach, biological mechanisms accounted for, driving variables, transparency, possibility of adaptation to local conditions, validation, evaluation of usefulness. Searching for a consensus on these criteria would be useful for developing a platform in which the suitable models can be made available for use.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Planning and Scheduling in Temporally Uncertain Domains Andrea Micheli\n", "abstract": " Any form of model-based reasoning is limited by the adherence of the model to the actual reality. Scheduling is the problem of finding a suitable timing to execute a given set of activities accommodating complex temporal constraints. Planning is the problem of finding a strategy for an agent to achieve a desired goal given a formal model of the system and the environment it is immersed in. When time and temporal constraints are considered, the problem takes the name of temporal planning. A common assumption in existing techniques for planning and scheduling is controllability of activities: the agent is assumed to be able to control the timing of starting and ending of each activity. In several practical applications, however, the actual timing of actions is not under direct control of the plan executor.In this thesis, we focus on this temporal uncertainty issue in scheduling and in temporal planning: we propose to natively express temporal uncertainty in the model used for reasoning. We first analyze the state-of-the-art on the subject, presenting a rationalization of existing works. Second, we show how Satisfiability Modulo Theory (SMT) solvers can be exploited to quickly solve different kinds of query in the realm of scheduling under uncertainty. Finally, we address the problem of temporal planning in domains featuring real-time constraints and actions having duration that is not under the control of the planning agent.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "FORTISS Workshop November 20, 2015 Munich, Germany\n", "abstract": " Scientific Challenges Complexity of verification Need to assess system behavior under all operational conditions The system must be robust with respect to faults Testing alone is not enough Limited tool support of current methodologies Most analyses are carried out manually No shared models between design and safety engineers", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Innovative Rover Operations Concepts-Autonomous Planner (IRONCAP)-Concluding the adventure\n", "abstract": " Innovative Rover Operations Concepts - Autonomous Planner (IRONCAP) - Concluding the adventure IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Innovative Rover Operations Concepts - Autonomous Planner (IRONCAP) - Concluding the adventure Italiano Italiano English Innovative Rover Operations Concepts - Autonomous Planner (IRONCAP) - Concluding the adventure / Robin Steel;Alexander Hoffmann;Marc Niezette;Alessandro Cimatti;Marco Roveri;Konstantinos Kapellos;Alessandro Donati;Nicola Policella. - STAMPA. - (2014). [10.2514/6.2014-1838] Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Preface to the special section on Formal Methods for Industrial Critical Systems (FMICS 2009+ FMICS 2010)\n", "abstract": " This special issue contains extended versions of selected papers from the workshops on Formal Methods for Industrial Critical Systems (FMICS) held in Eindhoven, The Netherlands, in November 2009 and in Antwerp, Belgium, in September 2010. These were, respectively, the 14th and 15th of a series of international workshops organized by an open working group supported by ERCIM (European Research Consortium for Informatics and Mathematics) that promotes research in all aspects of formal methods (see details in http://www.inrialpes.fr/vasy/fmics/). The FMICS workshops that have produced this special issue considered papers describing original, previously unpublished research and not simultaneously submitted for publication elsewhere, and dealing with the following themes: *Design, specification, code generation and testing based on formal methods. *Methods, techniques and tools to support …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Formal methods for industrial critical systems, preface to the special section\n", "abstract": " [EN] This special issue contains improved versions of selected papers from the workshops on Formal Methods for Industrial Critical Systems (FMICS) held in Eindhoven, The Netherlands, in November 2009 and in Antwerp, Belgium, in September 2010. These were, respectively, the 14th and 15th of a series of international workshops organized by an open working group supported by ERCIM (European Research Consortium for Informatics and Mathematics) that promotes research in all aspects of formal methods (see details in http://www.inrialpes.fr/vasy/fmics/). The FMICS workshops that have produced this special issue considered papers describing original, previously unpublished research and not simultaneously submitted for publication elsewhere, and dealing with the following themes:   Design, specification, code generation and testing based on formal methods.   Methods, techniques and tools to support automated analysis, certification, debugging, learning, optimization and transformation of complex, distributed, real-time and embedded systems.   Verification and validation methods that address shortcomings of existing methods with respect to their industrial applicability (e.g., scalability and usability issues).   Tools for the development of formal design descriptions.   Case studies and experience reports on industrial applications of formal methods, focusing on lessons learned or new research directions.   Impact and costs of the adoption of formal methods.   Application of formal methods in standardization and industrial forums. The selected papers are the result of several evaluation steps. In response to the call for papers, FMICS 2009 …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "6th International Workshop on Systems Software Verification\n", "abstract": " 6th International Workshop on Systems Software Verification 6th International Workshop on Systems Software Verification SSV’11, August 26, 2011, Nijmegen, The Netherlands Edited by Jörg Brauer Marco Roveri Hendrik Tews OASIcs–Vol. 24–SSV’11 www. dagstuhl. de/oasics Page 2 Editors Jörg Brauer Marco Roveri Hendrik Tews Verified Systems International GmbH Embedded Systems Unit Operating Systems Group Bremen Fondazione Bruno Kessler TU Dresden brauer@ verified. de roveri@ fbk. eu tews@ os. inf. tu-dresden. de ACM Classification 1998 D. 2.4 Software/Program Verification ISBN 978-3-939897-36-1 Published online and open access by Schloss Dagstuhl–Leibniz-Zentrum für Informatik GmbH, Dagstuhl Publishing, Saarbrücken/Wadern, Germany. Online available at http://www. dagstuhl. de/dagpub/978-3-939897-36-1. Publication date July 2012 Bibliographic information published by the …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "OASIcs, Volume 24, SSV'11, Complete Volume\n", "abstract": " OASIcs, Volume 24, SSV'11, Complete Volume 6th International Workshop on Systems Software Verification SSV’11, August 26, 2011, Nijmegen, The Netherlands Edited by Jörg Brauer Marco Roveri Hendrik Tews OASIcs–Vol. 24–SSV’11 www. dagstuhl. de/oasics Page 2 Editors Jörg Brauer Marco Roveri Hendrik Tews Verified Systems International GmbH Embedded Systems Unit Operating Systems Group Bremen Fondazione Bruno Kessler TU Dresden brauer@ verified. de roveri@ fbk. eu tews@ os. inf. tu-dresden. de ACM Classification 1998 D. 2.4 Software/Program Verification ISBN 978-3-939897-36-1 Published online and open access by Schloss Dagstuhl–Leibniz-Zentrum für Informatik GmbH, Dagstuhl Publishing, Saarbrücken/Wadern, Germany. Online available at http://www. dagstuhl. de/dagpub/978-3-939897-36-1. Publication date July 2012 Bibliographic information published by the Deutsche …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "6th International Workshop on Systems Software Verification (SSV 2011)\n", "abstract": " Industrial-strength software analysis and verification has advanced in recent years through the introduction of model checking, automated and interactive theorem proving, and static analysis techniques, as well as correctness by design, correctness by contract, and model-driven development. However, many techniques are working under restrictive assumptions that are invalidated by complex embedded systems software such as operating system kernels, low-level device drivers, or micro-controller code.The aim of SSV workshop series is to bring together researchers and developers from both academia and industry who are facing real software and real problems with the goal of finding real, applicable solutions. It has always been the goal of SSV program committees to let “real problem” really mean real problem (in contrast to real academic problem). The 6th SSV workshop was held on August 26 in Nijmegen in the Netherlands. The workshop was co-located with the second conference on Interactive Theorem Proving (ITP 2011), which took place from 22–25 August at the same place.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "A Critical Overview and Open Questions for Temporal Planning with Uncertainty\n", "abstract": " A Critical Overview and Open Questions for Temporal Planning with Uncertainty IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno A Critical Overview and Open Questions for Temporal Planning with Uncertainty Italiano Italiano English A Critical Overview and Open Questions for Temporal Planning with Uncertainty / Rosella Gennari; Anna Roubickova; Marco Roveri. - To appear(2011). ((Intervento presentato al convegno 3rd ICAPS Workshop on Verification and Validation of Planning and Scheduling Systems - VVPS 2011 tenutosi a Freiburg, Germany nel 13/06/2011. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Proceedings-International Conference on Software Engineering: Preface\n", "abstract": " Proceedings - International Conference on Software Engineering: Preface — University of Illinois Urbana-Champaign Skip to main navigation Skip to search Skip to main content University of Illinois Urbana-Champaign Home University of Illinois Urbana-Champaign Logo Help & FAQ Home Profiles Research Units Research & Scholarship Datasets Activities Press / Media Honors Search by expertise, name or affiliation Proceedings - International Conference on Software Engineering: Preface Sunghun Kim, Sebastian Uchitel, Diego Garbervetsky, Baris Aktemur, Danie Kroening, Alessandro Orso, Nachi Nagappan, Tao Xie, Peter Mueller, Marcelo Cataldo, Nikolai Tillmann, Tiziana Margaria-Steffen, Stefano Tonetta, Alex Bradley, Ning Chen, Nicolas D'Ippolito, Guido De Caso, Pietro Ferrara, Nannan He, Ioannis Kassios Show 21 more Show less Nicolas Kicillof, Matt Lewis, Daniel Meyer, Ralf Nagel, Vincent Nimal, …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Model Checking and Safety Assessment of Altarica models\n", "abstract": " Altarica is a language used to describe critical systems. In this paper we present a novel approach to the analysis of Altarica models, based on a translation into an extended version of NuSMV. This approach opens up the possibility to carry out functional verification and safety assessment with symbolic techniques. An experimental evaluation on a set of industrial case studies demonstrates the advantages of the approach over currently available tools", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Innovative Rover Operations Concepts–Autonomous Planning: Keeping a dog on the lead\n", "abstract": " Innovative Rover Operations Concepts–Autonomous Planning: Keeping a dog on the lead IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Innovative Rover Operations Concepts–Autonomous Planning: Keeping a dog on the lead Italiano Italiano English Innovative Rover Operations Concepts–Autonomous Planning: Keeping a dog on the lead / Robin Steel; Alexander Hoffman; Alessandro Cimatti; Marco Roveri; Konstantinos Kapellos; Alessandro Donati; Nicola Policella. - ELETTRONICO. - (2011). ((Intervento presentato al convegno International Workshop on Planning and Scheduling for Space, IWPSS 2011 tenutosi a Freiburg, Germany nel Giugno 2011. Scheda prodotto non validato …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Overview and Questions for Temporal Planning with Uncertainty in the Environment\n", "abstract": " Automated temporal planning requires coping with uncontrollable actions. This is particularly true of the spacecraft application domain. Therein, there is an ongoing effort towards the definition of representation and reasoning frameworks for finding a plan robust to the uncontrollability and inherent uncertainty of the domain, based either on constraint satisfaction or game theoretical approaches. In this position paper, we first analyse and summarise key notions from the different approaches using a unifying notation. Then we pinpoint questions emerging from our analysis.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "COMPASS Tool\n", "abstract": " COMPASS Tool IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 5 Altro 5.11 Software COMPASS Tool Italiano Italiano English COMPASS Tool / Marco Bozzano; Alessandro Cimatti; Joost-Pieter Katoen; Viet Yen Nguyen; Thomas Noll; Marco Roveri; Ralf Wimmer; Roberto Cavada. - (2010). Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda breve Scheda completa Titolo: COMPASS Tool Autori: Bozzano, Marco Cimatti, Alessandro Roveri, Marco Cavada, Roberto mostra contributor esterni Data di pubblicazione: 2010 Handle: http://hdl.handle.net/11582/31886 Appare nelle tipologie: 5.11 Software File in questo prodotto: Non ci sono file associati a questo prodotto. Utilizza questo identificativo per …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Formal Methods for Industrial Critical Systems-15th International Workshop, FMICS 2010, Antwerp, Belgium, September 20-21, 2010. Proceedings\n", "abstract": " Formal Methods for Industrial Critical Systems - 15th International Workshop, FMICS 2010, Antwerp, Belgium, September 20-21, 2010. Proceedings IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 7 Curatele 7.1 Curatela Formal Methods for Industrial Critical Systems - 15th International Workshop, FMICS 2010, Antwerp, Belgium, September 20-21, 2010. Proceedings Italiano Italiano English Formal Methods for Industrial Critical Systems - 15th International Workshop, FMICS 2010, Antwerp, Belgium, September 20-21, 2010. Proceedings / Stefan Kowalewski; Marco Roveri. - 6371(2010). ((Intervento presentato al convegno Formal Methods for Industrial Critical Systems tenutosi a Antwerp, Belgium nel 20-21/09/2010. Scheda prodotto non validato Attenzione! I dati …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "KRATOS\n", "abstract": " KRATOS IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 5 Altro 5.11 Software KRATOS Italiano Italiano English KRATOS / Marco Roveri; Alessandro Cimatti; Iman Narasamdya; Andrea Micheli; Daniele Campana; Alberto Griggio; Andrei Tchaltsev. - (2010). Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda breve Scheda completa Titolo: KRATOS Autori: Roveri, Marco Cimatti, Alessandro Narasamdya, Iman Micheli, Andrea Griggio, Alberto Tchaltsev, Andrei mostra contributor esterni Data di pubblicazione: 2010 Handle: http://hdl.handle.net/11582/31882 Appare nelle tipologie: 5.11 Software File in questo prodotto: Non ci sono file associati a questo prodotto. Utilizza questo identificativo per …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Final validation of the COCONUT flow and Tools Integration\n", "abstract": " Final validation of the COCONUT flow and Tools Integration — Graz University of Technology Skip to main navigation Skip to search Skip to main content Graz University of Technology Logo English Deutsch Home Persons Research Units Research Outputs Projects Activities Prizes Press / Media Search by expertise, name or affiliation Final validation of the COCONUT flow and Tools Integration Samuel Dellacherie, Georg Hofferek, Graziano Pravadelli, Davide Bresolin, Nicola Bombieri, Luigi Di Guglielmo, Luca Geretti, Tiziano Villa, Giovanni Perbellini, Marco Roveri, Iman Narasamdya, Rob Quigley, Joao Marques-Silva, Florian Letombe, Wolfgang Müller, Markus Becker, Christophe Hui-Bon-Hoa Institute of Applied Information Processing and Communications (7050) Research output: Book/Report › Other report Overview Projects (2) Original language English Publisher . Publication status Published - 2010 Access …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Future plan on use and dissemination\n", "abstract": " Future plan on use and dissemination — Technische Universität Graz Zur Hauptnavigation wechseln Zur Suche wechseln Zum Hauptinhalt wechseln Technische Universität Graz Logo English Deutsch Home Personen Forschungsgruppen Veröffentlichungen Projekte Verwandte Tätigkeiten Prämien Presseberichte Nach Expertise, Namen oder Zugehörigkeit suchen Future plan on use and dissemination Florian Letombe, Georg Hofferek, Graziano Pravadelli, Giovanni Perbellini, Marco Roveri, Iman Narasamdya, Christophe Hui-Bon-Hoa, Rob Quigley, Markus Becker, Wolfgang Müller, Samuel Dellacherie, Franco Fummi Institut für Angewandte Informationsverarbeitung und Kommunikationstechnologie (7050) Publikation: Buch/Bericht/Konferenzband › Sonstiger Bericht Übersicht (Administrator/-in) Projekte (2) Originalsprache englisch Verlag . Publikationsstatus Veröffentlicht - 2010 Zugriff auf Dokument http://www.…", "num_citations": "0\n", "authors": ["1606"]}
{"title": "10th International Workshop on Automated Verification of Critical Systems (AVoCS 2010)\n", "abstract": " Altarica is a language used to describe critical systems. In this paper we present a novel approach to the analysis of Altarica models, based on a translation into an extended version of NuSMV. This approach opens up the possibility to carry out functional verification and safety assessment with symbolic techniques. An experimental evaluation on a set of industrial case studies demonstrates the advantages of the approach over currently available tools.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Formal Methods for Industrial Critical Systems\n", "abstract": " This volume contains the papers presented at FMICS 2010, the 15th International Workshop on Formal Methods for Industrial Critical Systems, which was held on September 20-21, 2010, in Antwerp, Belgium. Previous workshops of the ERCIM working group on Formal Methods for Industrial Critical Systems were held in Oxford (March 1996), Cesena (July 1997), Amsterdam (May 1998), Trento (July 1999), Berlin (April 2000), Paris (July 2001), Malaga (July 2002), Trondheim (June 2003), Linz (September 2004), Lisbon (September 2005), Bonn (August 2006), Berlin (July 2007), L’Aquila (September 2008), and Eindhoven (November 2009).The aim of the FMICS workshop series is to provide a forum for researchers who are interested in the development and application of formal methods in industry. In particular, these workshops bring together scientists and engineers who are active in the area of formal methods …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Codesign of Dependable Systems: A Component-Based Language\n", "abstract": " Codesign of Dependable Systems: A Component-Based Language IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 5 Altro 5.12 Altro Codesign of Dependable Systems: A Component-Based Language Italiano Italiano English Codesign of Dependable Systems: A Component-Based Language / Marco Bozzano; Alessandro Cimatti; Joost-Pieter Katoen; Viet Yen Nguyen; Thomas Noll; Marco Roveri. - (2009). Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda breve Scheda completa Titolo: Codesign of Dependable Systems: A Component-Based Language Autori: Bozzano, Marco Cimatti, Alessandro Roveri, Marco mostra contributor esterni Data di pubblicazione: 2009 Handle: http://hdl.handle.net/…", "num_citations": "0\n", "authors": ["1606"]}
{"title": "NuGAT\n", "abstract": " NuGAT IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 5 Altro 5.11 Software NuGAT Italiano Italiano English NuGAT / Marco Roveri; Alessandro Cimatti; Viktor Schuppan; Andrei Tchaltsev; Roberto Cavada. - (2009). Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda breve Scheda completa Titolo: NuGAT Autori: Roveri, Marco Cimatti, Alessandro Schuppan, Viktor Tchaltsev, Andrei Cavada, Roberto Data di pubblicazione: 2009 Handle: http://hdl.handle.net/11582/31880 Appare nelle tipologie: 5.11 Software File in questo prodotto: Non ci sono file associati a questo prodotto. Utilizza questo identificativo per citare o creare un link a questo documento: http://hdl.handle.net/11582/31880 Citazioni …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "From Informal Safety-Critical Requirements to Property-Driven Formal Validation\n", "abstract": " Most of the efforts in formal methods have historically been devoted to comparing a design against a set of requirements. The validation of the requirements themselves, however, has often been disregarded, and it can be considered a largely open problem, which poses several challenges. The first challenge is given by the fact that requirements are often written in natural language, and may thus contain a high degree of ambiguity. Despite the progresses in Natural Language Processing techniques, the task of understanding a set of requirements cannot be automatized, and must be carried out by domain experts, who are typically not familiar with formal languages. Furthermore, in order to retain a direct connection with the informal requirements, the formalization cannot follow standard model-based approaches. The second challenge lies in the formal validation of requirements. On one hand, it is not even clear which are the correctness criteria or the high-level properties that the requirements must fulfill. On the other hand, the expressivity of the language used in the formalization may go beyond the theoretical and/or practical capacity of state-of-the-art formal verification. In order to solve these issues, we propose a new methodology that comprises of a chain of steps, each supported by a specific tool. The main steps are the following. First, the informal requirements are split into basic fragments, which are classified into categories, and dependency and generalization relationships among them are identified. Second, the fragments are modeled using a visual language such as UML. The UML diagrams are both syntactically restricted (in order to …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "V&D’06: Verification & Debugging\n", "abstract": " V&D’06: Verification & Debugging The 2006 Federated Logic Conference The Seattle Sheraton Hotel and Towers Seattle, Washington August 10-22, 2006 CAV’06 Workshop V&D’06: Verification & Debugging August 21st, 2006 Proceedings Editors: Roderick Bloem, Marco Roveri, and Fabio Somenzi Page 2 Page 3 Table of Contents From Error to Error: Debugging in the Many-Core Era................ 1 John Moondanos Error Diagnosis in Equivalence Checking of High Performance Microprocessors................................................... 4 Alper Sen An Automated Approach for the Interpretation of Counter-Examples.... 6 Lionel van den Berg, Paul Strooper, and Wendy Johnston Dynamic Reverse Code Generation for Backward Execution............ 25 Jooyong Lee Where Do Bugs Come From?....................................... 44 Andreas Zeller Model-Based Debugging—State of the Art And Future Challenges..... 49 Wolfgang Mayer and …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Rat: A tool for formal analysis of requirements\n", "abstract": " Rat: A tool for formal analysis of requirements — Technische Universität Graz Zur Hauptnavigation wechseln Zur Suche wechseln Zum Hauptinhalt wechseln Technische Universität Graz Home Technische Universität Graz Logo English Deutsch Home Personen Forschungsgruppen Veröffentlichungen Projekte Verwandte Tätigkeiten Prämien Presseberichte Nach Expertise, Namen oder Zugehörigkeit suchen Rat: A tool for formal analysis of requirements Ingo Hans Pill, Roderick Paul Bloem, Alessandro Cimatti, Marco Roveri, Simone Semprini, Andrei Tchaltsev Institut für Softwaretechnologie (7160) Publikation: Beitrag in Buch/Bericht/Konferenzband › Beitrag in einem Konferenzband Übersicht (Administrator/-in) Projekte (1) Originalsprache englisch Titel European Conference on Artificial Intelligence Herausgeber (Verlag) . Seiten ?-? Publikationsstatus Veröffentlicht - 2006 Veranstaltung 17th European …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "RAT\n", "abstract": " RAT IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 5 Altro 5.11 Software RAT Italiano Italiano English RAT / Marco Roveri; Alessandro Cimatti; Andrei Tchaltsev; Roberto Cavada; Simone Semprini; Roderick Bloem; Ingo Pill. - (2005). Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda breve Scheda completa Titolo: RAT Autori: Roveri, Marco Cimatti, Alessandro Tchaltsev, Andrei Cavada, Roberto mostra contributor esterni Data di pubblicazione: 2005 Handle: http://hdl.handle.net/11582/31881 Appare nelle tipologie: 5.11 Software File in questo prodotto: Non ci sono file associati a questo prodotto. Utilizza questo identificativo per citare o creare un link a questo documento: http://hdl.handle.net/…", "num_citations": "0\n", "authors": ["1606"]}
{"title": "38050 Povo (Trento), Italy Tel.:+ 39 0461 314312 Fax:+ 39 0461 302040 e− mail: prdoc@ itc. it− url: http://www. itc. it\n", "abstract": " In this paper we describe a novel approach for the formal specification and verification of distributed processes in a Web service framework. The formal specification is provided at two different levels of abstraction. The strategic level describes the requirements of the Web service domain, in terms of the different actors participating to it, with their goals and needs and with their mutual dependencies and expectations. The process level shows how these requirements are operationalized into communicating processes running on the different Web servers. We exploit Formal Tropos (FT), a language for the formal definition of the requirements of agent-oriented systems which is based on Linear Time Logic, to model the strategic level. We operationalize the process level using Promela, a language designed to describe communicating concurrent processes and amenable to formal verification. We exploit the SPIN model checker to perform formal V&V tasks. At the strategic level, requirements are validated against queries formulated by the designer, while at the process level the Promela specifications are verified against the requirements. The implementation of these V&V tasks required the definition of a novel procedure to encode the FT requirements at the strategic level in Promela. The experiments described in the paper show that the approach is effective in revealing possible flaws both in the strategic and in the process models of the Web service domains.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "checking and heuristic search\n", "abstract": " In this paper we tackle the problem of Conformant Planning: find a sequence of actions that guarantees goal achievement regardless of an uncertain initial condition and of nondeterministic action effects. Our approach, set in the framework of search in the belief space, is based on two main intuitions. First, symbolic model checking techniques, Binary Decision Diagrams in particular, can be used to represent and expand the search space, and to provide an efficient computational platform. Second, driving the search solely with reachability information is not effective, and the notion of knowledge has to be taken explicitly into account. We make the following contributions. First, we thoroughly analyze reachability heuristics: we formally prove their admissibility, we show how they can be implemented by means of symbolic techniques, and experimentally evaluate them. Second, we analyze the limitations of reachability heuristics, and propose more informed, yet admissible, heuristics, based on a formal notion of knowledge. Third, we present a practical conformant planning algorithm, where the search is explicitly based on the notion of target knowledge, ie, the amount of information that has to be available in order to reach the goal. The search alternates between the “Acquire Knowledge” mode, where actions have the precise purpose of gathering necessary information, and the “Reach Goal” mode, where actions are directed towards the goal. Finally, we provide a thorough experimental comparison between several conformant planners. Our approach is sometimes able to outperform the competitor systems by orders of magnitude.© 2004 Published …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Towards a Framework for Supporting the Negotiation between Global and Local Business Requirements\n", "abstract": " The development of service oriented applications very often needs to address the problem of satisfying two conflicting kinds of business needs: global business requirements, ie, the regulations that dictate the rules of engagement between different organizations, and local business requirements, ie, the rules local to each involved partner which derive from its internal business needs. In this paper, we propose a development process where both global and local service requirements, as well as their behaviors, are incrementally agreed among partners and built through negotiation steps. The development process is supported by the explicit definition of both global and local requirements at different levels of abstraction. We express requirements in a language with a clear semantics, and which allows for explicit links to executable business processes, eg, written in BPEL4WS. This development process opens up the possibility to adopt a variety of supporting techniques. In particular, automated verification is used to detect design or implementation problems. Automated synthesis of executable business processes allows for a speed up in the development process and reduces development effort. Finally, execution monitoring is able to detect run-time problems with respect to specified requirements.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Planning in Non Deterministic Domains via Symbolic Model\n", "abstract": " In this work is tackled the Artificial Intelligence problem of Automatic Planning using Symbolic Model Checking (SMC) techniques developed within the Formal Verification community for the verification of designs. A planning problem consists of finding a sequence of actions from an initial state to a desired final state. The use of SMC techniques allowed for a formal definition and for an efficient handling of a large class of planning problems that classical planning systems developed within Artificial Intelligence Planning are not able to deal with. Two restricting hypothesis of classical planning have been removed. The first hypothesis consists in the determinism of the planning domain, where an action execution in a state leads to a unique state. In the thesis the planning domain is assumed to be non-deterministic and is modeled as a non-deterministic finite state automata. The second hypothesis consists in assuming …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Model Checking\n", "abstract": " Each component is presented by specifying state variables: determine the state space and the labeling. initial values for state variables: determine the set of initial states. instructions: determine the transition relation. Components can be combined via synchronous composition, asynchronous composition. State explosion problem in model checking: linear in model size, but model is exponential in number of components.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Boutilier, C., T. Dean and S. Koenig Editorial 1–4 Castellini, C., E. Giunchiglia and A. Tacchella SAT-based planning in complex domains: Concurrency, constraints and …\n", "abstract": " Greig, M., see Givan, R. 163–223 Hanks, S., see Madani, O. 5–34 Kim, K.-E. and T. Dean Solving factored MDPs using non-homogeneous partitions 225–251 Koenig, S., C. Tovey and Y. Smirnov Performance bounds for planning in unknown terrain 253–279 Koenig, S., see Boutilier, C. 1–4 Littman, ML, see Majercik, SM 119–162 Madani, O., S. Hanks and A. Condon On the undecidability of probabilistic planning and related stochastic optimization problems 5–34", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Networks: Authors’ instructions\n", "abstract": " I due sommari (in italiano e in inglese) dovrebbero riassumere i contenuti dell’articolo e dovrebbero contenere al massimo 150 parole ciascuno. Dovrebbero essere scritti in carattere 9 punti, rientrati di 1, 0 cm dai margini destro e sinistro. Dovrebbero esserci due righe bianche (10 punti) prima e dopo il sommario.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Networks: istruzioni per gli autori\n", "abstract": " The two abstracts (in Italian and in English) should summarize the contents of the paper and should contain at most 150 words each. It should be set in 9-point font size and should be inset 1.0 cm from the right and left margins. There should be two blank (10-point) lines before and after the abstract.Sommario. I due sommari (in italiano e in inglese) dovrebbero riassumere i contenuti dell’articolo e dovrebbero contenere al massimo 150 parole ciascuno. Dovrebbero essere scritti in carattere 9 punti, rientrati di 1, 0 cm dai margini destro e sinistro. Dovrebbero esserci due righe bianche (10 punti) prima e dopo il sommario.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "NuSMV\n", "abstract": " NuSMV IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Fondazione Bruno Kessler Catalogo Ricerca FBK 5 Altro 5.11 Software NuSMV Italiano Italiano English NuSMV / Marco Roveri; Alessandro Cimatti; Roberto Cavada; Andrei Tchaltsev; Andrea Micheli; Alessandro Mariotti; Sergio Mover; Marco Pensallorto; Armando Tacchella; Daniel Sheridan; Gavin Keighren; Tommi Junttila; Timo Latvala. - (2002). Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte di FBK. Scheda breve Scheda completa Titolo: NuSMV Autori: Roveri, Marco Cimatti, Alessandro Cavada, Roberto Tchaltsev, Andrei Micheli, Andrea Mariotti, Alessandro Mover, Sergio mostra contributor esterni Data di pubblicazione: 2002 Handle: http://hdl.handle.net/11582/31879 Appare nelle tipologie: 5.11 …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Abstraction in model checking for bug hunting\n", "abstract": " . Temporal logic model checking is one of the most widely used verication techniques. It allows to automatically decide if a design satises its specication. When the specication does not hold an explanation of the oending behavior is produced. Even if it has been proved to be eective in practice this technique suers of the state explosion problem. To tackle this problem various techniques have been proposed. One of the most promising and used is abstraction. An abstraction of the design is computed and the standard model checking algorithms are applied on this abstraction. If the property is veried in the abstract model, then the property is veried in the original design too. Vice versa does not usually hold. The aim of this work is in extending the work done in abstraction and model checking using abstraction in buggy design, thus rening the counterexamples/witnesses of a given temporal property to make it possible to correct the design. 1 Research Area {Main...", "num_citations": "0\n", "authors": ["1606"]}
{"title": "istituto per la ricerca scientifica e tecnologica\n", "abstract": " Most real world domains are non-deterministic: the state of the world can be incompletely known, the e ect of actions can not be completely foreseen, and the environment can change in unpredictable ways. Automatic plan formation in nondeterministic domains is, however, still an open problem. In this paper we show how to do strong planning in non-deterministic domains, ie nding automatically plans which are guaranteed to achieve the goal regardless of non-determinism. We de ne a notion of planning solution which is guaranteed to achieve the goal independently of non-determinism, a notion of plan including conditionals and iterations, and an automatic decision procedure for strong planning based on model checking techniques. The procedure is correct, complete and returns optimal plans. The work has been implemented in mbp, a planner based on model checking techniques.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "ISTITUTO PER LA RICERCA SCIENTIFICA E TECNOLOGICA\n", "abstract": " This paper describes the first results of a joint project between CMU and IRST whose goal is to produce a reimplementation of xyz. The idea is that this new model checker, called xyz, should be usable, customizable and extensible, with as little effort as possible, also by people different from the developers. A further goal is to produce a system which is very robust, and close to the standards required by industry.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Meccanizzazione di Astrazione: Problematiche e Applicazioni\n", "abstract": " Un programma di un computer capace di agire in modo intelligente nel mondo deve avere una rappresentazione generale del mondo in termini della quale gli input sono interpretati. Progettare un tale programma richiede un accordo su che cosa e la conoscenza e su come la si ottiene. Pi u speci camente, vogliamo un programma che decida che cosa fare inferendo in un linguaggio formale che una certa strategia e ettivamente porta al raggiungimento dell'obiettivo pre ssato. Questo richiede la formalizzazione di concetti quali causalit a, abilit ae conoscenza. Questo e in un certo senso equivalente al problema di riuscire a comprendere e quindi simulare i vari meccanismi del ragionamento umano. Possiamo tranquillamente a ermare che questo e l'obiettivo da un certo punto di vista pi u stimolante e ambizioso della ricerca in Intelligenza Arti ciale. Questo ramo della ricerca presenta sia aspetti logici che loso ci (si …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "PISTIS: Trusted Computing Architecture for Low-end Embedded Systems\n", "abstract": " Recently, several hardware-assisted security architectures have been proposed to mitigate the ever-growing cyber-attacks on Internet-connected devices. However, such proposals are not compatible with a large portion of the already deployed resource-constrained embedded devices due to hardware limitations. To fill this gap, we propose PISTIS, a pure-software trusted computing architecture for bare-metal low-end embedded devices. PISTIS enables several security services, such as memory isolation, remote attestation and secure code update, while fully supporting critical features such as Direct Memory Access (DMA) and interrupts. PISTIS targets a wide range of embedded devices including those that lack any hardware protection mechanisms, while only requiring a few kilobytes of Flash memory to store its root of trust (RoT) software. The entire architecture of PISTIS is built from the ground up by leveraging memory protection-enabling techniques such as assembly-level code verification and selective software virtualisation. Most importantly, PISTIS achieves strong security guarantees supported by a formally verified design. We implement and evaluate PISTIS on MSP430 architecture, showing a reasonable overhead in terms of runtime, memory footprint, and power consumption.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "GIADA, UN SISTEMA CENTRALIZZATO PER LA GESTIONE DELL’IRRIGAZIONE A DOMANDA\n", "abstract": " GIADA is a centralized system to manage both irrigation and self-regulation to be used in agriculture, green areas, parks and gardens. A central computing system communicates with the peripherals in the field via freefrequency radio. Peripherals can collect environmental data, pressures, flow rates or other measures and can execute commands, adjustments and manage failures and malfunctions. The peripherals in the field are powered by battery and thanks to the low power consumption have a guaranteed duration of 5 years. Peripheral devices can be operated and managed automatically or manually through authentication with an iButton key. Depending on the location, type of cultivation, environmental data and weather forecasts, the central system computes the optimal irrigation value updated in real time leveraging on an expert system. The user see the quantity proposed by the central expert system and decides whether to apply it directly or make corrections. Everything is controlled by a web interface that allows both the user to view all the information related to the irrigated areas and the administrator to manage the entire system. The central system stores all the data that contribute to the functioning of the system, including weather and forecast data, allowing analysis according to the optimization of the process and of the irrigation network and the search for leaks. Moreover, it poses the basis for more precise forecasting leveraging on emerging technologies based on Artificial Intelligence.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Formal Verification of Requirements using SPIN: A Case Study on Web Services\n", "abstract": " In this paper we describe a novel approach for the formal specification and verification of distributed processes in a Web service framework. The formal specification is provided at two different levels of abstraction. The strategic level describes the requirements of the Web service domain, in terms of the different actors participating to it, with their goals and needs and with their mutual dependencies and expectations. The process level shows how these requirements are operationalized into communicating processes running on the different Web servers. We model the strategic level exploiting Formal Tropos (FT), a language for the formal definition of the requirements of agent-oriented systems which is based on Linear Time Logic. We model the process level using Promela, a language designed to describe communicating concurrent processes and amenable to formal verification. We exploit the SPIN model checker to perform V&V tasks. At the strategic level, requirements are validated against queries formulated by the designer, while at the process level the Promela specifications are verified against the requirements. The implementation of these V&V tasks requires the definition of a novel procedure to encode the FT requirements in Promela. The experiments described in the paper show that the approach is effective in revealing possible flaws both in the strategic and in the process models.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Codesign of Dependable Systems\n", "abstract": " Codesign of Dependable Systems - A Component-Based Modelling Language=1Funded by ESA/ESTEC under Contract No. 21171/07/NL/JD Page 1 Codesign of Dependable Systems A Component-Based Modelling Language1 Marco Bozzano2 Alessandro Cimatti2 Marco Roveri2 Joost-Pieter Katoen1 Viet Yen Nguyen1 Thomas Noll1 1Software Modelling and Verification Group RWTH Aachen University, Germany 2Embedded Systems Group Fondazione Bruno Kessler, Italy MEMOCODE 2009, 15 July 2009 1Funded by ESA/ESTEC under Contract No. 21171/07/NL/JD Page 2 Codesign of Dependable Systems A Component-Based Modelling Language 1. Scope 2. SLIM Syntax 3. Formal Characterisation 4. Injecting Faults 5. COMPASS Toolset 6. Conclusions Page 3 Scope Page 4 Verification of Fault-Tolerant Hardware/Software Systems Component sensor, protocol, controller SMV, Promela, VHDL NuSMV, …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Lemmas for Satisfiability Modulo Transcendental Functions via Incremental Linearization\n", "abstract": " Incremental linearization is a conceptually simple, yet effective, technique that we have recently proposed for solving satisfiability problems over nonlinear real arithmetic constraints, including transcendental functions. A central step in the approach is the generation of linearization lemmas, constraints that are added during search to the SMT problem and that form a piecewise-linear approximation of the nonlinear functions in the input problem. It is crucial for both the soundness and the effectiveness of the technique that these constraints are valid (to not remove solutions) and as general as possible (to improve their pruning power). In this extended abstract, we provide more details about how linearization lemmas are generated for transcendental functions, including proofs of their soundness. Such details, which were missing in previous publications, are necessary for an independent reimplementation of the method.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "A Framework for Integrating Business Processes and Business Requirements\n", "abstract": " Service-oriented architectures and Web service infrastructure provide the ideal framework for interconnecting organizations and for defining distributed business applications. The possibility to exploit business process definition and execution languages is particularly relevant for capturing the process-oriented nature of these applications. However, business processes by themselves are not enough to manage the changes and to allow an organization to continuously adapt its business model to the typical needs of distributed applications. To achieve this flexibility, it is of uttermost importance to link the business processes to the organizational strategy and to the business goals that motivate the need of these processes. In this paper we propose a framework for representing strategies and goals of an organization in terms of business requirements. The framework allows to describe how an organizational strategy is operationalized into activities and implemented by business processes. It also allows to represent the assumptions on the interactions between the different business applications. Finally, this framework allows for the usage of formal analysis techniques, in particular Model Checking, to pinpoint problems and to identify possible solutions in this domain.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "A CEGAR-based Approach for Proving Invariant Properties of Transition Systems on Non-Linear Real Arithmetic\n", "abstract": " Model checking invariant properties of designs, represented as transition systems, with non-linear real arithmetic (NRA) is an important though very hard problem. On the one hand NRA is a hard-to-solve theory; on the other hand most of the powerful model checking techniques lack support for NRA. In this paper, we present a work-in-progress counterexampleguided abstraction refinement (CEGAR) approach that leverages linearization techniques from differential calculus to enable the use of mature and efficient model checking algorithms for transition systems on linear real arithmetic (LRA).", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Formal Tropos\n", "abstract": " Formal Tropos Page 1 Formal Tropos Integrating Formal Methods and Software Engineering Marco Roveri joint work with M. Pistore, A. Fuxman, J. Mylopoulos, P. Traverso and L. Liu roveri@irst.itc.it ITC-IRST, Via Sommarive 18, 38055 Povo, Trento, Italy Formal Tropos – p. 1 Page 2 Outline Motivations The Formal Tropos Project Results so Far: Model Checking Early Requirements Conclusions and Future Works Formal Tropos – p. 2 Page 3 A Software Development Process Late Requirements Implementation Architectural Design Early Requirements Detailed Design Early Requirements amounts to the definition of the domain. Formal Tropos – p. 3 Page 4 A Software Development Process Late Requirements Implementation Architectural Design Early Requirements Detailed Design Early Requirements amounts to the definition of the domain. Late Requirements amounts to explicitly introduce the system and in …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Feature Integration in Requirements Engineering\n", "abstract": " FIREworks is a Working Group that addresses the problem of adding features to complex software products, in particular software for telecommunication services. It aims to provide a feature-oriented approach to software design including requirements specification languages and verification logics, as well as a method for their usage. FIREworks began on 1 May 1997; this document is its second year report.The previous year's report describes the importance and industrial relevance of FIREworks, as well as giving the full list of members and subgroups. All this information is available from the FIREworks home page.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "A Software Model Checker for SystemC\n", "abstract": " Kratos is a new software model checker for SystemC. At the moment Kratos only verifies safety properties in the form of program assertion. It provides two different analyses for verifying such properties. First, Kratos implements a sequential analysis based on the lazy predicate abstraction [15] for verifying sequential C programs. To verify SystemC designs using this analysis, we rely on the translation from SystemC to a sequential C program, such that the resulting C program contains both the mapping of SystemC threads in the form of C functions and the encoding of the SystemC scheduler. Second, Kratos implements a novel concurrent analysis, called ESST [12], that combines Explicit state techniques to deal with the SystemC Scheduler, with Symbolic techniques, based on lazy predicate abstraction, to deal with the Threads. This manual is about how to use Kratos. Details of Kratos’ architecture can be found in [11].", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Requirements Analysis Tool\n", "abstract": " The tool RAT fulfill the need for a proper technological support to formal methods in the setting of requirements analysis by providing its users with the integration of three sets of functionalities that enact the Property Simulation, Property Assurance and Property Realizability methodologies. In this section we show how to interact with RAT in order to accomplish the tasks related to these three methodologies.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Hybrid RELTL for Analog-Mixed Signals\n", "abstract": " Assertion-based verification has been proved of paramount value in the correct development of digital circuits. The key idea is to enhance the design with properties which assert the expected behavior of the circuit according to the designer’s intent. This allows to detect bugs early in the development flow. However, the assertions may grow in number and become very complex. In order to avoid a vacuous verification of the design, specialized techniques have been developed to validate the correctness of the assertions themselves, independently from the design [6]. Linear-time Temporal Logic with Regular Expressions (RELTL) is a propositional temporal logic at the basis of many assertions languages for digital circuits such as PSL [2]. Regular expressions encodes set of discrete sequences of states. The Linear-time Temporal Logic captures the temporal relationships among the sequences. The semantics …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Additionnal Reviewers\n", "abstract": " AIPS 2002 Program Committee Page 1 Program Committee Rachid Alami Ruth Aylett Tony Barret Michael Beetz Craig Boutilier Alessandro Cimatti Tom Dean Edmund Durfee Alfonso Gerevini Enrico Giunchiglia Robert P. Goldman Richard Goodwin James Hendler Félix Ingrand Froduald Kabanza Subbarao Kambhampati Craig Knoblock Jana Koehler Sven Koenig Drew McDermott Alfredo Milani Nicola Muscettola Karen Myers Dana Nau Bernhard Nebel Martha Pollack Jussi Rintanen Erik Sandewall Bart Selman David Smith Reid Simmons Sylvie Thiébaux Manuela Veloso Thierry Vidal Qiang Yang Additionnal Reviewers Marco Baioletti Christopher Beck Piergiorgio Bertoli Silvia Bothelo Mike Bowling Raja Chatila Gabriella Cortellessa Yannis Dimopoulos Minh B. Do David Furcy Ulrich Geske Emmanuel Guéré Peter Haddawy Patrick Haslum Malte Helmert Joerg Hoffmann Philippe Laborie Yaxin Liu Lee …", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Specifying and Analyzing Early Requirements: Some Experimental Results\n", "abstract": " Formal Methods (FM) are usually applied in advanced stages of the development process, and their application in Early Requirements is by no means trivial: FM amounts to validate an implementation against requirements; FM require a detailed description of the behavior of the system; FM concepts are not appropriate for Early Requirements. Formal Methods, and in particular Model Checking cannot be used to prove correctness of the specification.", "num_citations": "0\n", "authors": ["1606"]}
{"title": "Requirements Analysis Tool with Synthesis\n", "abstract": " For information, contact RATSY (ratsy@ list. fbk. eu). The first version of this tool (RAT) has been developed within the PROSYD European project, contract number 507219 (http://www. prosyd. org). The current version (RATSY) has been created within the COCONUT European project, contract number 217069 (http://www. coconut-project. eu).", "num_citations": "0\n", "authors": ["1606"]}