{"title": "Bringing usability concerns to the design of software architecture\n", "abstract": " Software architects have techniques to deal with many quality attributes such as performance, reliability, and maintainability. Usability, however, has traditionally been concerned primarily with presentation and not been a concern of software architects beyond separating the user interface from the remainder of the application. In this paper, we introduce usability-supporting architectural patterns. Each pattern describes a usability concern that is not supported by separation alone. For each concern, a usability-supporting architectural pattern provides the forces from the characteristics of the task and environment, the human, and the state of the software to motivate an implementation independent solution cast in terms of the responsibilities that must be fulfilled to satisfy the forces. Furthermore, each pattern includes a sample solution implemented in the context of an overriding separation based pattern such …", "num_citations": "51\n", "authors": ["1360"]}
{"title": "Desarrollo orientado a objetos con UML\n", "abstract": " UML (Unified Modeling Language) es un lenguaje que permite modelar, construir y documentar los elementos que forman un sistema software orientado a objetos. Se ha convertido en el estándar de facto de la industria, debido a que ha sido concebido por los autores de los tres métodos más usados de orientación a objetos: Grady Booch, Ivar Jacobson y Jim Rumbaugh. Estos autores fueron contratados por la empresa Rational Software Co. para crear una notación unificada en la que basar la construcción de sus herramientas CASE. En el proceso de creación de UML han participado, no obstante, otras empresas de gran peso en la industria como Microsoft, Hewlett-Packard, Oracle o IBM, así como grupos de analistas y desarrolladores.Esta notación ha sido ampliamente aceptada debido al prestigio de sus creadores y debido a que incorpora las principales ventajas de cada uno de los métodos particulares en los que se basa: Booch, OMT y OOSE. UML ha puesto fin a las llamadas “guerras de métodos” que se han mantenido a lo largo de los 90, en las que los principales métodos sacaban nuevas versiones que incorporaban las técnicas de los demás. Con UML se fusiona la notación de estas técnicas para formar una herramienta compartida entre todos los ingenieros software que trabajan en el desarrollo orientado a objetos.", "num_citations": "42\n", "authors": ["1360"]}
{"title": "Interactive knowledge asset management: Acquiring and disseminating tacit knowledge\n", "abstract": " This paper defines and validates a solution to support organizational learning through the interactive evolution of organizational knowledge. The approach includes mechanisms to acquire the experiences of individuals working in different teams and environments, combine them with the existing company’s knowledge assets, and disseminate the evolved knowledge to all the project teams. This solution was validated in a controlled experiment involving junior engineers in a training course over a two-year period. The main objective of this experiment was to assess whether the proposed solution provides an effective learning environment to develop quality products. Results show that the approach helps engineers to improve their ability to learn and adopt new practices for software development, obtaining also high levels of quality in the products developed. These improvements are not immediate, however, so the benefits only become evident with time.", "num_citations": "28\n", "authors": ["1360"]}
{"title": "Knowledge management acquisition improvement by using software engineering elicitation techniques\n", "abstract": " The knowledge externalization phase involves acquiring and transferring the knowledge of individuals to an abstract and effective representation, to organize it, to model it and finally to express this knowledge in an understandable and reusable format. This phase presents some difficulties at the moment to choose the technique that best fit with the knowledge type to be elicited, and sometimes the selected technique is not complete enough to capture all the relevant knowledge for a specific domain. In sum, there are not mechanisms that can be used as a discernment element at the moment to choose the knowledge elicitation technique that better adjust to a particular situation. This paper presents the results obtained from an empirical validation developed to determine the efficiency of knowledge acquisition in the externalization phase of Nonaka’s model, using a set of software engineering elicitation techniques …", "num_citations": "26\n", "authors": ["1360"]}
{"title": "Improving the efficiency of use of software engineering practices using product patterns\n", "abstract": " Low efficiency of use of software engineering best practices and poor quality of the products developed are two of the main reasons for the failure of software projects. This paper describes an architectural model, based on the re-use of process and project assets supported by collaborative mechanisms, which improves the efficiency of use of software processes; and a set of quality parameters under validation. This model was implemented in real software projects.", "num_citations": "21\n", "authors": ["1360"]}
{"title": "Collaborative learning experiences using social networks\n", "abstract": " In this paper authors present a teaching experience using a social network as an enabler of group learning and collaborative work. Authors are university lecturers and they propose on this paper a collaborative learning strategy named “Live Learning Strategy” that supports, on the one hand, lectures and knowledge management in order to identify, create, represent and transfer the key concepts and knowledge regarding their subjects. On the other hand, the strategy uses a social network that combines the case study method together with a collaborative work scenario in order to promote the creativity and group learning among students.", "num_citations": "21\n", "authors": ["1360"]}
{"title": "New Trends in Software Process Modelling\n", "abstract": " Over the years, a variety of software process models have been designed to structure, describe and prescribe the software systems construction process. More recently, software process modelling is increasingly dealing with new challenges raised by the tests that the software industry has to face. This book addresses these new trends in software process modeling related to:• Processes for open source software;• Systems dynamics to model and simulate the software process;• Peopleware: the importance of people in the software development and by extension in the software process. One new software development trend is the development of open source projects. As such projects are a recent creation, the process model governing this type of developments is unfamiliar. This book deals with process modeling for open source software. It also deals with software process simulation applied to the management of software projects and improves the software development process capability according to CMM (Capability Maturity Model). Software development is a conjunction of: the organizational environment, the social environment and the technological environment. The inclusion of these environments will make it possible to output software process models that meet the specified organizational, cultural and technological requirements, providing an exhaustive analysis of the people in the software process, as well as supporting people-oriented software development. This book deals with the development of software by means of people-oriented process models that have proven to be very beneficial.", "num_citations": "18\n", "authors": ["1360"]}
{"title": "Extending Microsoft team foundation server architecture to support collaborative product patterns\n", "abstract": " This paper provides a practical solution, based on process reuse and knowledge management techniques, to make software engineering theories more accessible, easier, and cheaper for software development organizations to implement. It shows how the PIBOK-PB architecture (Process improvement based on knowledge-pattern based) and the extensions of a commercial product, Microsoft solution Visual Studio Team System, are used to achieve this.", "num_citations": "17\n", "authors": ["1360"]}
{"title": "A pattern-based solution to bridge the gap between theory and practice in using process models\n", "abstract": " In order to extend the use of software process improvement programs and to make it independent of organizational features, this work describes the results obtained using a knowledge based model and tool, and proposes a pattern-based solution, using a SPEM (Software Process Engineering Metamodel) exten-sion, in order to improve the efficiency of use of the knowledge-based model proposed.", "num_citations": "17\n", "authors": ["1360"]}
{"title": "Team formation using a systems thinking approach\n", "abstract": " Team performance varies depending on the organization of their members, the exploitation of their synergies and their planning to optimally meet the minimum requirements with the best results. This article reports a dual‐purpose methodology. First, we use the soft systems methodology to start up viability‐driven teamwork based on team complexity, a better understanding of idiosyncrasy, and the synergies leveraging team behavior. The viable systems model is used to propose the essential functions of a team that effectively operates in dynamic organizational environments. Second, this research provides guidance for training teams to apply holistic thinking in their problem‐solving practice by helping them to co‐integrate and apply systemic approach for immersive problem solving. In essence, this article reports success drivers, generic teamwork structures and viability accomplishment references for agilely …", "num_citations": "10\n", "authors": ["1360"]}
{"title": "Mobility management: Deployment and adaptability aspects through mobile data traffic analysis\n", "abstract": " The expected boost in mobile data traffic and the evolution towards the next generation of networks are making cellular operators reconsider whether current approaches for handling mobility could be improved, according to the characteristics of the mobile traffic that actually flows through real networks. In this work, we make use of extensive analysis of real network traces to infer the main characteristics of mobile data traffic for a particular operator. Our analysis focuses on the features related to mobility, i.e., location information, number of handovers, or duration of the data traffic exchange. New techniques to gather the mobility characteristics of the user based on data and control packets correlation are designed and applied to compare the gains of deploying different mobility management approaches. We show that adapting the mobility management mechanism to the degree of mobility and the network …", "num_citations": "10\n", "authors": ["1360"]}
{"title": "Combining software engineering elicitation technique with the knowledge management lifecycle\n", "abstract": " Knowledge elicitation process allows acquiring and transferring the knowledge. This process presents difficulties to select the appropriate elicitation technique. This paper presents a classification of the elicitation techniques used in software engineering and the relationship between the elicitation techniques and some elements of knowledge management as assets knowledge, epistemological dimension of knowledge and the knowledge creation phases. This classification provides a guideline to select a technique or a set of techniques for knowledge elicitation based on phases of Nonaka’s model.", "num_citations": "10\n", "authors": ["1360"]}
{"title": "Reverse engineering and software products reuse to teach collaborative web portals: a case study with final-year computer science students\n", "abstract": " The development of collaborative Web applications does not follow a software engineering methodology. This is because when university students study Web applications in general, and collaborative Web portals in particular, they are not being trained in the use of software engineering techniques to develop collaborative Web portals. This paper presents a strategy for teaching collaborative Web portals based on reverse engineering and reuse mechanisms to engineer the collaborative Web portals' development. This strategy was successfully used in a final-year course of a Computer Science program at Carlos III University of Madrid, Spain. Its use has demonstrated an improvement in the maintainability of the Web projects developed as well as a decrease in the number of failures during the test phase. This is a very important step toward the engineering of Web applications. The students' grades for the same …", "num_citations": "10\n", "authors": ["1360"]}
{"title": "Developing future interactive systems\n", "abstract": " Interactive systems are growing in the last decade because of the amount of fields in which this kind of application can be used as a test bed to experiment in medicine, training, education, and so on. Developing Future Interactive Systems is a compilation of knowledge collected from several researchers in the field of interactive systems, offering an overview of the different parts of the environment that must be taken into account to develop a quality interactive system from the software engineering discipline. The book is oriented to developers of interactive systems, as well as researchers in the field of virtual environments.", "num_citations": "10\n", "authors": ["1360"]}
{"title": "Uncovering hidden process assets: A case study\n", "abstract": " The information technology (IT) industry is not making the best possible use of its intangible process assets. The proposed process assets classification is grounded on the experience existing in the intellectual capital field. IT companies can use this classification to better identify and classify their process assets, thereby gaining an overview of the elements on which their processes depend and incrementing their intellectual capital. Two IT companies participated in a case study in which company chief executive and chief operations officers used the proposed classification, which they considered very useful, to identify a set of important process assets not previously taken into account.", "num_citations": "9\n", "authors": ["1360"]}
{"title": "Software process improvement for practitioners based on knowledge management tools\n", "abstract": " In order to spread the use of software process improvement programs and to make their use independent of organizations features, this work describes the results obtained using a knowledge based model and tool, as well as the proposal of using a patterns based solution implemented using a SPEM extension, in order to improve the efficiency of use of the proposed knowledge based model.", "num_citations": "9\n", "authors": ["1360"]}
{"title": "Patterns in the field of software engineering\n", "abstract": " In the mid 1960’s, the architect Christopher Alexander (1964) came up with the idea of Patterns, as “a solution to a problem within a defined context” and developed this concept. He explains, in a very original way, his ideas of urban planning and building architecture, using patterns to explain the “what”,“when”, and “how” of a design. Alexander invented a Pattern Language that is the fundamental to good building and city designs, and describes it in a collection of repetitive schemas called patterns. In Computer Science, software is susceptible to conceptual patterns. Consequently, Ward Cunningham and Kent Beck, used Alexander’s idea to develop a programming pattern language composed of five patterns as an initiation guide for Smalltalk programming. This work was presented at the Object-Oriented Programming, Systems, Languages & Applications Conference (OOPSLA) in 1987. In the early 1990’s, Erich …", "num_citations": "8\n", "authors": ["1360"]}
{"title": "An agile framework definition for creating an engineering massive open online course from scratch: a case study\n", "abstract": " Massive Open Online Courses (MOOCs) have emerged as disruptors to higher education bringing the possibility to accesslearning contents to thousands of students from all over the world. MOOCs are a new way to design and deliver onlinelearning. Learners become part of an on-line community where they can participate as reviewers, collaborate with eachother and are engaged in watching videos and other multimedia resources. However, MOOCs are also generating a hugedebate around three different aspects: the learning process including evaluation and certification criteria, the lack of skillsamong instructors to design and plan MOOCs and the technical and security issues of MOOC platforms. More specifically, institutions are currently making a great effort to become part of main facilitators’ platforms. They are creating a goodnumber of methodologies, guidelines and best practices to equip instructors with the necessary skills to produce high-quality learning resources that can encourage learners’ participation and decrease the dropout rate. On the other hand, engineering education is one of the main areas of interest in MOOC courses. In the software and computer engineering areait ispossible to find a huge number of MOOCs in particular topicsranging from anintroductory to a master level. However, just a few courses address a holistic view of a domain such as software engineering due to the intrinsic difficulty ofsummarizing in a few weeks the main concepts of an engineering discipline. That is why, in this paper, authors introduce anAgile MOOC Development Lifecycle (AMDL) to address the challenge of designing a MOOC from …", "num_citations": "7\n", "authors": ["1360"]}
{"title": "Métodos de Pronóstico por Indicadores dentro de la Gestión del Conocimiento Organizacional\n", "abstract": " Frecuentemente se manifiestan dificultades en la toma de decisiones debido a que no se cuenta con mecanismos robustos que permitan obtener indicadores predictivos utilizando como base los datos del pasado. Resulta entonces de vital importancia contar con herramientas y procedimientos que permitan aplicar métodos de pronósticos de indicadores para comprobar su factibilidad y uso dentro de la gestión del conocimiento organizacional. Esto ha motivado nuestra investigación en pos de un marco metodológico que permita la ponderación de la evolución de los indicadores. El presente trabajo propone un aporte científico en el campo de la mejora de la gestión por indicadores, en organizaciones conscientes de la importancia de tomar decisiones estratégicas a partir de la evolución de los indicadores que marcan el rumbo y el estado de salud de la organización.", "num_citations": "7\n", "authors": ["1360"]}
{"title": "A fuzzy internal model for intelligent avatars\n", "abstract": " The lack of believability of nowadays virtual characters may lead the users of Distributed Virtual Environments to stop using them, once the initial attraction of the innovation has declined. The successful use in the future of Distributed Virtual Environments for complex tasks, beyond simple chatting systems, might depend on our ability to provide the user with powerful virtual representations (avatars), which can be used not just as a presence indicator, but also as a tool to communicate with other users and establish interesting interactions. On the other hand, a very complex avatar, with many features and controls, can make it very difficult and tedious for the user to fully exploit the avatar’s possibilities. This paper presents a proposal for an internal model of avatars that allows the user to delegate some actions on an underlying intelligent agent. The main component of the model, the psychological model, is explained in detail. The use of the model is based on a fuzzy valuation and a definition of fuzzy relationships among the parameters. A dynamic updating process is also defined to maintain the internal state of the avatar. We have applied the model to an interesting game environment, where some of its most powerful characteristics are successfully exploited.", "num_citations": "7\n", "authors": ["1360"]}
{"title": "A model of biomimetic process assets to simulate their impact on strategic goals\n", "abstract": " Process assets (PAs) are acknowledged as contributing to the business value of organizations. Even so, they are still classed and employed as passive elements ready for use for special purposes. This paper considers how the evolution of active PAs over time can best influence the achievement of specific strategic objectives for decision making by CEOs regarding which PAs should be empowered and which do not require investment, etc. This proposal is formulated by rethinking PAs as dynamic elements armed with biomimetic intelligence. This means conceiving of PAs as live elements that interact and make use of swarm intelligence in order to provide a permanent overview of individual PA evolution and its impact on strategic goals. The NetLogo modelling and simulation tool was used to build the proposed model. The input for the simulation model was taken from a real experience of PAs previously …", "num_citations": "6\n", "authors": ["1360"]}
{"title": "Interaction patterns for future interactive systems components\n", "abstract": " The development of future interactive systems (FIS) is in its infancy, so detailed guides describing the process to design them hardly exist. This may be due to the fact that their development is quite recent and what their components are and how they must be combined to develop a FIS are not yet clear or widely accepted.         Our approach towards a thorough understanding of FIS was to analyse the different types of FIS and to extract general characteristics, which can be considered generic, in order to describe what a FIS consists of and how it works.         In this paper, we present a classification of the components of a generic FIS and propose interactive behaviour patterns, which can be used to design the FIS components more easily. These patterns are part of the SENDA framework, which was defined to facilitate the rigorous development of a specific kind of FIS, which is Virtual Environments (VEs). The …", "num_citations": "6\n", "authors": ["1360"]}
{"title": "Adapting traditional software processes to virtual environments development\n", "abstract": " Virtual environments (VEs) are special kinds of interactive systems currently used in many fields such as education, training and medicine. However, as VE development is relatively recent, there is little experience in the area. Software engineering, the discipline which assures quality software, has not been successfully applied to date. In developing VEs, the object‐oriented software engineering paradigm is the most suitable even though principles and techniques are insufficient. In this paper, we will demonstrate this inadequacy through the development of two different VEs, identify the processes to be improved, offer a set of guidelines to improve them (coined SENDA), and present the results obtained with SENDA. Copyright © 2003 John Wiley & Sons, Ltd.", "num_citations": "6\n", "authors": ["1360"]}
{"title": "The amusement internal modelling for believable behaviour of avatars in an intelligent virtual environment\n", "abstract": " Nobody has doubts about the Virtual Environments as a tool with a future: their possible applications are huge and they are very attractive for users. However, the lack of believability of virtual characters leads the users to get bored of these Virtual Environments or, at least, to lose the impression of being interacting with other real users, instead of a simple avatar. It becomes necessary a model which provides a rich internal representation, full believability and easiness of use by means of an intelligent automation.", "num_citations": "6\n", "authors": ["1360"]}
{"title": "How Can Virtual Agents Improve Communication in Virtual Environments\n", "abstract": " Despite the wide offer in terms of research and development lines covered by Virtual Environments (VEs), the application that has attracted a highest number of users is the use of VEs to interact and communicate with other users. Users search in VEs for a more complete communication than that provided by traditional computer mediated communication (CMC) systems, such as typed chat. The objective would be the establishment of a Total Communication, that is, the simultaneous use of multiple communication channels that complement each other and enrich the interaction. VEs look like a very promising solution. The key idea is to extend those traditional CMC systems with a three-dimensional representation of each user, called avatar, which adds visual communication channels to the usual written/spoken dialog. Unfortunately, current VEs are not actually improving CMC. However, with a different focus VEs …", "num_citations": "5\n", "authors": ["1360"]}
{"title": "Strategic characterization of process assets based on asset quality and business impact\n", "abstract": " PurposeThe purpose of this paper is to present the strategic intangible process assets characterization (SIPAC) methodology illustrated by an example of its application to the field of information technology (IT). This is a pioneering methodology for characterizing the impact and quality of intangible process assets and intellectual capital as levers to achieve organizational objectives. This strategic intellectual capital approach will help to identify both intangible assets and indicators geared to meeting organizational objectives. This is of vital importance since the success of an organization can be construed in terms of goal achievement.Design/methodology/approachThe paper illustrates an example of the step-by-step application of the proposed methodology at an IT company. The aim is to describe its use in a real case so that other companies can benefit from the replication of the methodology used.FindingsThe …", "num_citations": "4\n", "authors": ["1360"]}
{"title": "Measuring the degree of innovation in education through the implementation of an indicator based on analyzing MOOC-related activities\n", "abstract": " Nowadays, the digital transformation is affecting any task, activity, process that is done in any organization or even in our daily life activities. The education sector, considered as one of the leading sectors in terms of innovation through technology, is also facing a transformation in which digital technology is rapidly evolving. In this context, the Massive Open Online Courses (MOOC) phenomenon has gained a lot of attraction due to the capability of reaching thousands or even millions of students from all over the world. However, the activities related to MOOCs are not yet being evaluated or quantified as a driver of change. Since the creation of MOOCs requires support and institutional commitment to deliver high-quality courses on technology-based platforms, it seems reasonable to measure the degree of innovation in education through the definition of an indicator that collects the commitment of an …", "num_citations": "4\n", "authors": ["1360"]}
{"title": "Smart Intangible Knowledge Assets Valuation\n", "abstract": " Intellectual capital represents the intangible resources of wealth creation. Although there is no one definition of this concept, it is widely accepted that it can be split into human, structural and relational capital. Human capital refers to knowledge that resides in people; structural capital refers to knowledge that resides in the organization and technology; and relational capital refers to knowledge that resides in the relations with clients and stakeholders in general. Several models of intellectual capital models were developed from 1992 to 1998. These models work by managing a set of indicators which are part of the chosen intellectual capital model. Then again, the OECD has confirmed the advancement of knowledge-based economies, and intellectual capital looks to be very interesting as a field capable of explaining the value of knowledge in these growing knowledge-based economies. A problem arises, however …", "num_citations": "4\n", "authors": ["1360"]}
{"title": "Organizational knowledge capitalization based on product patterns and Web 2.0 technology\n", "abstract": " Nowadays knowledge is seen as one of the most important assets for organizations, nevertheless assessing the value of organizational knowledge is a challenge because most of it exists as tacit knowledge in the mind every member of an organization. In order to overcome this issue authors propose a working strategy to gather and to explicitly represent organizational knowledge in order to foster its capitalization. In this paper authors propose, on the one hand, the use of a knowledge representation artifact based on patterns together with a transactive memory system to allow encoding, storing, and retrieving knowledge collectively in a smart manner, on the other hand, authors propose the use of Web 2.0 technologies and tools to facilitate knowledge access and representation, and to foster cooperation among organization’s members towards knowledge capitalization.", "num_citations": "4\n", "authors": ["1360"]}
{"title": "Valence Matters in Judgments of Stock Accumulation in Blood Glucose Control and Other Global Problems\n", "abstract": " Stock-flow failure is a reasoning error in dynamic systems that has great societal relevance: people misjudge a level of accumulation (ie, stock) considering the information on flows that increase (ie, inflow) or decrease (ie, outflow) over time. Many interventions, including the use of analogies and graphical manipulations, to counteract this failure and help people integrate the flow information have been tested with little or no success. We suggest that this error relates to the valence of a problem: the framing of the inflow or outflow direction as “good” or “bad” is associated with the direction of its accumulation over time. To explore the effects of valence on accumulation judgments, we employ a scenario of a common health problem: blood glucose control through sugar consumption and insulin flows. We also investigate improvements of performance in a second scenario that result after viewing a video of a dynamic system demonstrating the effects of the correct accumulation trend. We discuss the implications of our findings for the blood glucose example and other global problems.", "num_citations": "3\n", "authors": ["1360"]}
{"title": "System dynamics and agent-based modelling to represent intangible process assets characterization\n", "abstract": " PurposeThis paper aims to address the use of modelling and simulation tools to enhance intangible process assets management by simulating and automating their characterization depending on their quality and impact on an organizational business goal.Design/methodology/approachThe authors conducted a study comparing two simulation-based approaches to characterize intangible assets: system dynamics and agent-based simulation.FindingsStrategic business studies have not yet considered the use of simulation techniques to characterize the intangible assets at length. The proposed solution introduces significant improvements for strategic data visualization, providing company stakeholders with a practical and helpful prism through which to view an easily adaptable, cheap and meaningful source of information about their company’s process assets, and their behaviour based on operation indicators …", "num_citations": "3\n", "authors": ["1360"]}
{"title": "Una aproximación a la aplicación de métodos matemáticos en el control de gestión por indicadores\n", "abstract": " Durante todo proceso de creación de indicadores existe la tendencia a invertir la mayor parte del tiempo en la búsqueda de: qué necesitamos medir, qué queremos medir o bien qué nos están pidiendo que midamos. Una parte de este tiempo se emplea en conocer la disponibilidad de los datos que nos llevan a construir esos indicadores y otra menor en ver la necesidad de desarrollar nuevas bases de datos sobre aquellos no disponibles.", "num_citations": "3\n", "authors": ["1360"]}
{"title": "Methodological and Technological Framework Proposal to Capitalize Organizational Knowledge\n", "abstract": " Society is becoming a great source of knowledge and innovation, the synergy of all the ideas that are coming from all the countries across the world is fostering the rise of a new kind of society where knowledge plays an important role, nevertheless today's society needs a global strategy to improve knowledge management in order to ensure its accessibility. This paper introduces a global strategy supported on the one hand, by a methodological framework that proposes a transactive memory system to allow encoding, storing, and retrieving knowledge collectively in a smart manner, on the other hand, it is supported by a technological framework based on Web 2.0 technologies aimed to implement the methods and strategies defined in the transactive memory system. Moreover, this global strategy must ensure the maturity of the generated knowledge in order to foster innovation, also knowledge use must be tracked …", "num_citations": "3\n", "authors": ["1360"]}
{"title": "Selecting a software elicitation technique according to layers of knowledge and preciseness: A case study\n", "abstract": " This paper presents a case study analyzing a set of software engineering elicitation techniques. The aim of the case study is to demonstrate that completeness and preciseness are two criteria to be incorporated into the set of existing parameters used to classify and select which elicitation technique to apply depending on the project context variables. Completeness refers to how well each elicitation technique elicits domain, task and strategic requirements, and preciseness refers to how many requirements a software engineer is able to elicit using each technique. Based on the results, we can state that completeness and preciseness perform differently for each analyzed technique. Therefore, these two criteria are necessary in order to improve elicitation technique selection. Also, the techniques used in this case study have been ranked according to the above-mentioned criteria, that is, which technique included in …", "num_citations": "2\n", "authors": ["1360"]}
{"title": "Enhancing productivity through products and knowledge reuse\n", "abstract": " One of the symptoms of project failure is the low efficiency of use of software process assets and the quality of products developed. This paper describes a reuse-based solution to the existing problems and limitations of representing knowledge, experience of processes and products generated during the development of a software project. This solution has been successfully validated in real projects.", "num_citations": "2\n", "authors": ["1360"]}
{"title": "Transactive Memory System Proposal to Foster Collaborative Learning and Knowledge Sharing into Organizations.\n", "abstract": " Knowledge management on learning organizations is a broad area that still needs more research in order to offer to organizations a set of methodologies, technologies and strategies that allow them to capitalise their knowledge. This paper proposes as a solution the development of a transactive memory system to allow organizations and their members to collectively encode, store, and retrieve knowledge in a smart manner, where every piece of knowledge could be accessible to all organization members in order to help them to perform their daily activities, and at the same time to allow organizations to assess the quality of their knowledge as well as to represent, use and reuse all their know-how towards their organizational and business goals.", "num_citations": "2\n", "authors": ["1360"]}
{"title": "Software process improvement proposal applying six sigma and patterns\n", "abstract": " Software Process Improvement Proposal Applying CMMI, Six Sigma and Patterns Page 1 Software Process Improvement Proposal Applying Six Sigma and Patterns Maria-Isabel Sanchez-Segura, Arturo Mora-Soto, Fuensanta Medina-Dominguez, Antonio Amescua SEPG Europe 2008 – Munich, Germany Page 2 Agenda ► Work allocation ► Motivation & background ► Issues in SPI deployment ► Proposal to overcoming SPI issues ► Proposed framework ► Product Patterns ► Structure ► Use in combination with six sigma ► Solution: deployment and example ► Validation ► Conclusions and future works 2 Page 3 Agenda ► Work allocation ► Motivation & background ► Issues in SPI deployment ► Proposal to overcoming SPI issues ► Proposed framework ► Product Patterns ► Structure ► Use in combination with six sigma ► Solution: deployment and example ► Validation ► Conclusions and future …", "num_citations": "2\n", "authors": ["1360"]}
{"title": "New trends in software process modelling\n", "abstract": " Over the years, a variety of software process models have been designed to structure, describe and prescribe the software systems construction process. More recently, software process modelling is increasingly dealing with new challenges raised by the tests that the software industry has to face. This book addresses these new trends in software process modeling related to:. Processes for open source software;. Systems dynamics to model and simulate the software process;. Peopleware: the importance of people in the software development and by extension in the software process. One new softwa", "num_citations": "2\n", "authors": ["1360"]}
{"title": "Software Process Change, ser\n", "abstract": " A. Amescua, J. Garcia, MI Sanchez-Segura & F. Medina-Dominguez, Software Process Change, ser - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Software Process Change, ser A. Amescua, J. Garcia, MI Sanchez-Segura & F. Medina-Dominguez In O. Stock & M. Schaerf (eds.), Lecture Notes in Computer Science. Springer Verlag (2006) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Software in Philosophy of Computing and Information (categorize this paper) Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers …", "num_citations": "2\n", "authors": ["1360"]}
{"title": "A Process for the Analysis of Virtual Environments\n", "abstract": " Virtual Environments (VEs) are a relatively new type of software application, with a 3D graphical scenario in which avatars, as representations of the human users, and autonomous virtual agents inhabit and interact with each other and with the objects in the environment. Despite the increasing use of VEs and growing number of developed systems, the methodological issues related to the development process of VEs have been largely ignored, applying ad-hoc informal processes and techniques. This paper presents the software development processes proposed within a methodological framework for VE development called SENDA, and it describes in more detail the tasks included within the Analysis process. New techniques and artifacts are proposed for some activities in the analysis process for which no appropriate solutions have been found in traditional software engineering methodologies.", "num_citations": "2\n", "authors": ["1360"]}
{"title": "SENDA: A whole process to develop virtual environments\n", "abstract": " The use of virtual environments (VEs) is increasing rapidly, and people are demanding easier and more credible ways to interact with these new sites. We define VEs as a special kind of 3D virtual environment, inhabited by avatars which represent humans in the VE, or even autonomous agents. This kind of software was selected because of its increasing importance as the new future trend in interactive software applications. From a software engineering point of view, VEs can be seen as a special kind of information system, so they must be analyzed, designed, and implemented in this respect. Our aim is to improve software engineering’s traditional software processes to achieve quality VEs. In this chapter, we present a framework called SENDA, which defines a formal process model to develop VEs.", "num_citations": "2\n", "authors": ["1360"]}
{"title": "Knowledge governance maturity assessment can help software engineers during the design of business digitalization projects\n", "abstract": " Software engineers and IT professionals face the challenge of envisioning the needs and wishes of their client companies, whose long‐term survivability depends on their adaptability to the digital business ecosystem, which is impregnating more or less every single sector of the economy. Looking at the data reported on the business digitalization project success rate, we realize that there is a lot of room for improvement. In this paper, we focus on the results of developing 10 business digitalization projects for 10 small and medium enterprises, where the software engineers in charge of the projects assessed the knowledge governance maturity of client companies before proposing any specific projects to support their digital businesses. We surveyed the software engineers participating in the above projects to gather their impressions of using knowledge governance assessment as a tool to predictively visualize the …", "num_citations": "1\n", "authors": ["1360"]}
{"title": "ALTUS: A Process-Oriented, Knowledge Governance Maturity Model\n", "abstract": " In view of the importance of knowledge as a key resource for companies sustainability and improvement, and in view of the existing efforts made to keep organizations informed about the way they should take care of their know-how, this chapter describes ALTUS, a process-oriented, knowledge maturity model, that helps organizations to assess its knowledge maturity level regarding the performance of a set of capabilities that are oriented to improve strategic or business goals through the accomplishment of several specific knowledge governance processes. This orientation through capabilities, processes and strategic/business goals achievement for knowledge governance is auditable, traceable and sustainable along the time.", "num_citations": "1\n", "authors": ["1360"]}
{"title": "A Methodology to Manage Organizational Procedures Through Ontologies\n", "abstract": " Organizations today need to maintain relationships with actors who intervene in the execution of key processes. This creates problems for the correct administration of the organization's procedures and in administrating a shared jargon, increasing costs related to the procedures. The objective of this paper is to present the MONPRO methodology, which supports the management of organizational procedures through the creation of specific ontologies of the organizational domain (including employee jargon and natural language), allowing any person with knowledge in computer science to create ontologies, without needing to be an expert. MONPRO is composed of five phases. The activities in each of them define a series of forms and diagrams that lead the ontology developer to break down the procedure and obtain the necessary resources to build the ontology. To test the methodology, the Presentation and …", "num_citations": "1\n", "authors": ["1360"]}
{"title": "Guideline to Select Knowledge Elicitation Techniques\n", "abstract": " Knowledge elicitation process allows acquiring and transferring the knowledge. Actually, this process presents difficulties to select the appropriate elicitation technique. This paper presents a classification of the elicitation techniques used in software engineering and the relationship between the elicitation techniques and some elements of knowledge management as assets knowledge, epistemological dimension of knowledge and the knowledge creation phases. This classification provides a guideline to select a technique or a set of techniques for knowledge elicitation based on phases of Nonaka’s model.", "num_citations": "1\n", "authors": ["1360"]}
{"title": "A study on how software engineering supports projects management\n", "abstract": " This paper contains the results of the study of the following Software Process Reference Models for Improvement Programmes: CMMI, ISO 15504, and the UP, XP, PSP, TSP Methodologies, from a project management point of view. The project management processes analyzed in the above software engineering formalisms were: estimation, planning and quality management. As a result of this study, we offer an overview of the presence, integration, and ease of use of each project management process in the software engineering formalism selected. Results obtained reveal a good degree of integration among processes but a low level of ease of use in most part of the selected formalisms.", "num_citations": "1\n", "authors": ["1360"]}
{"title": "Approaching software process improvement to organizations.\n", "abstract": " Software engineering process models, methodologies, standards, and in general any kind of formalism in this field are important improvements in the development of software systems but the gap between their definition and the practice ofthem is still very big. This paper describes a model and a web based tool that represents an approach to software engineering process improvement programs to organizations in order tocover the gap between software engineeringin theory and in practice, joining software process improvement and knowledge management disciplines.", "num_citations": "1\n", "authors": ["1360"]}
{"title": "Improving virtual environments analysis process\n", "abstract": " The use of Virtual Environments (VEs) is increasing rapidly and people are demanding easier and more credible ways to interact with these new sites. We define a VE as a special kind of 3D virtual environment, inhabited by avatars which represent humans in the VE, or even autonomous agents. This kind of software was selected because of its increasing importance as the new future trend in interactive software applications. From a software engineering point of view, VEs can be seen as a special kind of information system, so they must be analyzed, designed, implemented, etc. Our aim is to improve software engineering's traditional software processes to achieve quality VEs. In this paper, we present the guidelines to perform properly the analysis of a VE.", "num_citations": "1\n", "authors": ["1360"]}
{"title": "Software Engineering and HCI Techniques Joined to Develop Virtual Environments.\n", "abstract": " This paper focuses on a specific kind of software applications called Virtual Environments (VEs) or Virtual Worlds, Virtual Communities, etc., inhabited by avatars, which are the representation either of real humans users of the VE or autonomous agents. Virtual Environments (VEs), or Virtual World, are growing very quickly and people demand easier and more believable ways to interact in these new sites [4],[10],[12].From the point of view of software engineering, VEs can be seen as a special kind of software systems, in this sense, they must be analyzed, designed, implemented, etc., as any other software system. However, VEs development require special tasks and techniques, which are not provided by traditional software engineering methodologies. The question we would like to address is: define the products to be developed during the construction of an VE taking into", "num_citations": "1\n", "authors": ["1360"]}
{"title": "TRABAJO FIN DE CARRERA\n", "abstract": " Con el crecimiento de las redes de ordenadores y especialmente de la red Internet, los usuarios de las mismas han encontrado un nuevo atractivo en aplicaciones como Chats, MUDs, EVs y, en general, aplicaciones en las cuales la idea subyacente no es la interacción con el sistema, sino con otros usuarios que hacen uso de la misma aplicación u otra similar en distintos lugares del mundo.El primer MUD (Multi-User Dungeon) fue desarrollado por Roy Trubshaw y Richard Bartle en 1978. En sus comienzos, el término MUD hacía referencia a un juego de aventuras concreto, y posteriormente empezó a referirse a todo tipo de entornos textuales a los que la gente se conectaba para participar en juegos de aventura multijugador.", "num_citations": "1\n", "authors": ["1360"]}