{"title": "Software development: Agile vs. traditional.\n", "abstract": " Organizations face the need to adapt themselves to a complex business environment, in continuous change and transformation. Under these circumstances, organization agility is a key element in gaining strategic advantages and market success. Achieving and maintaining agility requires agile architectures, techniques, methods and tools, able to react in real time to change requirements. This paper proposes an incursion in the software development, from traditional to agile.", "num_citations": "233\n", "authors": ["2236"]}
{"title": "Combining business intelligence with cloud computing to delivery agility in actual economy\n", "abstract": " The present economic crisis experienced by all the states of the world orients more and more the information technology industry towards efficiency. One of the instruments that can provide efficiency to an organization is Cloud Computing. At the same time, any organization is striving to become intelligent and to achieve competition advantages through the use of a Business Intelligence (BI) solution. The present paper presents aspects of the mix BI and Cloud Computing, putting the stress on the integration of a Cloud BI solution within organizations. Also, the opportunity of using a Cloud BI solution is analyzed in contrast with that of using a traditional BI solution, through the ROI indicator.", "num_citations": "119\n", "authors": ["2236"]}
{"title": "Analyzing agile development-from waterfall style to Scrumban.\n", "abstract": " The spectacular evolution of information and communications technology in the last two decades and the growing obvious chase of utopian maximization of profit by economic organizations have made an impact on various fields, including that of methodological instruments regarding the lifecycle of software development. We will speak about the necessity of organizational ability to adapt to continuously changing market conditions, which leads undoubtedly to acquiring functional flexibility and, in the end, of business agility. Also, the agility of a business (not only in software development) is supported by the manifestation of agility on all three architectural levels: business, informational, technological. In this study we aim to identify the elements that impact on agility in developing software products, in a gradual approach, from the traditional waterfall model towards approaches like Scrumban. Additionally, we will understand the social dimension of using agile methodologies in software development projects and the main barriers in adopting such methodologies.", "num_citations": "59\n", "authors": ["2236"]}
{"title": "Combining Knowledge, Process and Business Intelligence to Delivering Agility in Collaborative Environment\n", "abstract": " In a collaborative environment, agility represents an objective for any organization, given the fact that all organizations must face complex interaction between agents, must quickly adapt to frequent market changes and be innovative. In this context, organizations have to continually change their business strategy in order to be able to use the market opportunities and cope with the pressure of an uncertain business environment. As a result, Business Process Management (BPM), Case Management, and other instruments and solutions have been adapted/built in order to respond to the current demands of the organizations in the field of modelling of collaborative processes.As a response to the complex interactions between partners, integration of knowledge and business processes represents an important step in improving the agility of the organization. For intensive knowledge based processes Case Management may be used, which provides a real time image on the current events and generates a rapid response to the organization’s internal and external events. Business Intelligence (BI) is used at the present for performance management within business processes, helping the organization to automatically detect the problems/opportunities and to initiate corrective actions and/or change business rules in order to optimise processes. The paper provides an approach on the way in which knowledge may be combined with processes and Business Intelligence in order to achieve agility within the collaborative environment.", "num_citations": "20\n", "authors": ["2236"]}
{"title": "The audit of business intelligence solutions\n", "abstract": " Although in this period humanity passes through a relative economic crisis, we all agree that our environment is that of a society of information and knowledge, based on communication and teleactivity, one that is also called information society. Every new form of activity in the information society has an associated informational component consisting in a software program, an application, a system, etc. It is a certainty that in the new economic environment it is necessary to adjust quickly to the opportunities of the market, through Business Process Reengineering, adoption of Business Intelligence solutions, implementation of complex automation applications like Enterprise Resource Planning. But, more than this, in, the digital economy the stress is put on the “label”, the “image”, the “brand”, and these features that are associated to organizations may be obtained by the information audit processes. The present study is focusing on the problem of information audit developed in one of the upper forms of manifestation of the information society in the field of changing the ways of doing business: Business Intelligence.", "num_citations": "18\n", "authors": ["2236"]}
{"title": "How to Succed in Business Intelligence Initiative: A Case Study for Acquisitions in Romanian Public Institutions\n", "abstract": " Considering the demands of knowledge society each organization must became an intelligence organization. Business Intelligence (BI) helps achieving this goal. The large variety of Business Intelligence solutions on the market, the difficult process to select one of them and evaluate the impact of the selected solution on the organization leads to the need of creating a strategy to help organizations chose the best solution for investment. Taking into account that every organization must spend its money carefully, and every solution that does not provide a rapid impact on the basic business is not considered a viable solution, the efficiency of its use must be correctly evaluated and demonstrated based on evaluation criteria, but also through monetary analyses (more difficult to achieve). We suggest and explain the main steps in order to choose the right solution and to evaluate it and we present a case study of the integration in Romanian public institutions of a Business Intelligence solution for acquisitions.", "num_citations": "16\n", "authors": ["2236"]}
{"title": "Cloud computing and agile organization development\n", "abstract": " In the 3rd millennium economy, defined by globalization and continuous reduction of natural resources, the economic organization becomes the main actor in the phenomenon of transformation and adaptation to new conditions. Even more, the economic environment, which is closely related to the social environment, undergoes complex metamorphoses, especially in the management area. In this dynamic and complex social and environmental context, the economic organization must possess the ability to adapt, becoming a flexible and agile answer to new market opportunities. Considering the spectacular evolution of information and communications technology, one of the solutions to ensure organization agility is cloud computing. Just like the development of any science requires adaptation to theories and instruments specific to other fields, a cloud computing paradigm for the agile organization must appeal to models from management, cybernetics, mathematics, structuralism and information theory (or information systems theory).", "num_citations": "14\n", "authors": ["2236"]}
{"title": "Standards and costs for quality management of e-learning services\n", "abstract": " The proportions of the technological development in the field of communications and information represent an irrefutable premise for significant changes in all the spheres of human life. Corroborated with the advance of the Internet recorded in the last decade, these changes form the perfect recipe for the emergence (ever since the '90s), functioning and development of flexible forms of labour at distance, using the technology of information and communication. Among the first domains where the impact of technology is very strong may be named education, marketing, advertising and commerce; the forms of manifestation are materialized in e-learning, cyber-marketing, online advertising and electronic commerce. But the simple use of technology does not automatically assure the success of the new forms of activity. These transformations of the traditional into digital, of the classic into virtual must be accompanied by the adequate support with respect to the quality of services, standards, platforms and the hardware and software technologies. If we are referring to the educational domain, we have to analyze the e-learning phenomenon or tele-education in its spectacular evolution in such a recent history. Quality represents a landmark of major importance in all the fields of modern society based on knowledge. From the perspective of tele-education, quality assurance must be focalized on three main directions: the quality of the actual educational process (class/course support, platform, technology, etc.); the quality of the instructor (professional training, qualification, specialization, pedagogic ability, teaching method, etc.); the quality of the person …", "num_citations": "14\n", "authors": ["2236"]}
{"title": "E-Voting Solutions for Digital Democracy in Knowledge Society\n", "abstract": " Emergent technologies specific to current information and knowledge society, and social networks influence every aspect of our existence, from lucrative activities to recreational ones. There is no part of our life that is not influenced by the explosive development of general information and communication technologies. We witness a spectacular and until recently unimagined metamorphoses of work nature, business process reengineering, controversial evolution of social networks and new directions of electronic government. Over this background of changes, we take on the tasks of deepening the understanding of field that is largely unexplored, namely the electronic vote in digital democracy, without taking any side, pro or against this type of casting our electoral options. The current context encompasses technological, legislative, political, economic and social aspects. Even more, the context of electronic voting in digital democracy involves aspects regarding globalization, technical challenges concerning interoperability, data standardization and security.", "num_citations": "13\n", "authors": ["2236"]}
{"title": "An agile architecture framework that leverages the strengths of business intelligence, decision management and service orientation\n", "abstract": " In nowadays economy, the tendency of any enterprise is to become an intelligent one and through new and innovative strategies of business intelligence (BI) obtain a competitive advantage on the market. At the same time, the collaborative environment involves the need for modern solutions to cope with the complex interactions between participants and the frequently changing market. In these circumstances, enterprises tend to go beyond agility and achieve a dynamic vision on demand. In a narrow sense, the agility incorporates ideas of flexibility, balance, adaptability and coordination. The enterprise agility may be considered the ability of the enterprise to adapt rapidly and to cost efficiently in response to changes in its operating environments (Wang & Lee, 2011; Dove, 2001). The intelligent enterprise is the learning enterprise where the capability to continuously adapt to changes and unpredictable environments is developed (Brătianu et al., 2006). In addition to the previous definition, we shall consider the intelligent enterprise as having a lean, agile and learning enterprise knowledge infrastructure as driver for sustainable competitive advantage. According to the Gartner Group, the agile enterprise must be “Real-time, service-oriented and event-controlled”(Vickoff, 2007).Thus, within enterprises the need for proactive, challenging instruments appeared having a strong impact when compared with conventional reports, dashboards, analyses carried out by OLAP (On Line Analytical Processing) systems and this aspect may be noticed at the business intelligence suppliers. Due to the industry changes, the year 2007 marked the beginning of a …", "num_citations": "13\n", "authors": ["2236"]}
{"title": "Virtual organization-cybernetic economic system. Modeling partner selection process\n", "abstract": " Nowadays, at the peak development of information and communication technologies, one of the higher forms of informational society in the business area is the virtual organization. The literature presents various theories on the virtual organizations. They examine aspects of organizational, juridical, managerial, economic nature. This paper will introduce a new paradigm of the virtual organization - the cybernetic economic system. Systemic approach goes beyond the virtual organization characteristics, determined by the simple affiliation to the abstract notion o system - which will be proven below. We will determine how this entity, adopted by the real world, adheres to the laws of the economic cybernetic systems. Also, we will identify the specific elements of informational and managerial nature in the lifecycle of the virtual organization.", "num_citations": "12\n", "authors": ["2236"]}
{"title": "A framework for measuring the impact of BI solution\n", "abstract": " Taking into account the need for the implementation of a BI (business intelligence) solution at the organization level, the strategic nature of this solution, the large investment needed, the dispersion of benefits inside the organization, the effects on the culture of business and the fact that most of the benefits returned are difficult to be evaluated through traditional measures, adequate techniques must be established in order to evaluate the BI initiatives. The object of this paper is to settle a evaluation framework that will help in choosing the best solution of investment, in determining the opportunity of its implementation and, at the same time, will represent an instrument in BI process management. The article provides an approach on identification and measurement of BI solution costs and benefits, on the evaluation of risks and lines of research on intangible benefits evaluation.", "num_citations": "9\n", "authors": ["2236"]}
{"title": "Premise ale trecerii la societatea informationala\n", "abstract": " Societatea informationala presupune utilizarea intensiva a informatiei în toate sferele activitatii si existentei umane, cu impact economico-social semnificativ. Noile tehnologii informationale sunt utilizate atât la nivel individual, cât si în cadrul organizatiilor cu o flexibilitate ridicata, rezultata din independenta activitatii umane în raport cu spatiul si timpul. De aceea, o implementare corecta a societatii informationale presupune convergenta a trei factori cheie: tehnologia informatiei, tehnologia comunicatiilor si productia de multimedia.[ANCI][Ducheyne, 1996][McConnell et al., 1996][*** eE] Cuvinte cheie: tehnologie, informatie, Internet, telecomunicatie, economie, munca la distanta, potential de afaceri. aracterizarea societatii informationaleDezvoltarea rapida a tehnologiei informatiei în ultimii ani a avut un impact crescând asupra societatii si a economiei globale, aducând în prim plan schimbari fundamentale ale modelelor de productie si distributie, conditiilor comerciale, ocuparii fortei de munca si vietii cotidiene. La începutul unui nou mileniu, economia mondiala se afla într-un proces de trecere de la societatea predominant industriala la un nou set de reguli–societatea informationala, care conduce la aparitia a ceea ce se numeste noua economie. Premisele trecerii la societatea informationala sunt dictate de dinamica foarte puternica a noii economii, în care tehnologiile digitale fac tot mai facile si mai ieftine accesarea, procesarea, stocarea si transmiterea informatiilor. Acest volum imens de informatii disponibile creeaza oportunitati de exploatare a lor prin crearea de noi produse si servicii, prin dezvoltarea de noi activitati si sporirea numarului de …", "num_citations": "9\n", "authors": ["2236"]}
{"title": "From a smart education environment to an eco-school through fog & cloud computing in IoT context\n", "abstract": " One of the most visible domains of the last decade emerging technological explosion is education. In this paper we will analyze the educational field seen as an intelligent learning environment, in the context of a modern information and communication technology paradigm: fog & cloud computing. An intelligent educational environment built on the IoT (Internet of Things) ecosystem involves at least two dimensions: conceptual and functional. These aspects will be highlighted in this paper, identifying the intensity of cloud computing relations and fog computing–IoT, as global infrastructure for building an intelligent education environment. In the current economic, social and environmental conditions, developing an intelligent educational frame must take into account multiple aspects. Among them are critical factors, like legal frame, ecological dimension and quality insurance. Any intelligent educational frame must consider the environmental factors and converge towards and ecological structure, an eco-school.", "num_citations": "8\n", "authors": ["2236"]}
{"title": "Collaborative Environment and Agile Development.\n", "abstract": " Over time, information and communications technology development has made a direct impact on human activity in the individual context as well as familial, economic and social. This has laid the premise for adoption of new and modern paradigms in individual and organizational activity management. The evolutionary climax of the social universe is called nowadays knowledge society. The knowledge society succeeds the information society, emphasizing the development of the opportunities brought by collaborative work environment and agile approach. In this paper we will highlight the use of collaborative environment in agile software development, as an instrument for managing organizations in knowledge society. Thus, we will emphasize the paradigms of agile testing, validation and verification in collaborative environment.", "num_citations": "8\n", "authors": ["2236"]}
{"title": "Challenges of 4D (ata) model for electronic government\n", "abstract": " Social evolution pyramid, built on the foundation of the ‘90s capitalist society, lead to the emergence of the informational society–years 1990 to 2005–and knowledge society–years 2005 to 2020. The literature starts using a new concept, a new form of association–artificial intelligence society–foreseen to be established in the next time frame. All these developments of human society and translations or leaps (most of the times apparently timeless) were, are and will be possible only due to the advancing information and communications technologies. The leap to Democracy 3.0, based on information and communication technologies prompts to a radical change in the majority of the classical concepts targeting society structure and the way it is guided and controlled. Thus, concepts become electronic concepts (or econcepts) through the use of new technologies. E-concepts keep the essence of the classical principles of liberty and democracy, adding a major aspect of the new way of communication and spreading ideas between people. The main problem is to quantify, analyze and foresee the way technological changes will influence not only the economic system, but also the daily life of the individual and the society. Unfortunately (or maybe fortunately, depending on the point of view), all these evolutions and technological and social developments are as many challenges for the governments of the world. In this paper we will highlight only four of the challenges facing the governments, grouped in a structured model with the following specific concepts: Big Data, Social Data, Linked Data and Mobile Data. This is an emerging paradigm of the …", "num_citations": "7\n", "authors": ["2236"]}
{"title": "Main aspects of the adoption of cloud solutions in managing service-oriented organizations-the case of higher education\n", "abstract": " The present day context of information and communications technology (ICT) raises the need for better online products and services for users. Organizations that implement ICT on a large scale meet an important hurdle: the need to continuously configure and parameterize the computing systems. This arises from the limited storage space, maintenance resources, the need to re-qualify the personnel and replace software licenses. Cloud Computing solutions may provide a way around this problem. Basically, Cloud Computing solutions provide services to users though a web browser. An immediate consequence is opportunity to downscale the software costs. Also, Cloud Computing creates great opportunities for business intelligence application like predictive analyses and large data storage, presenting itself as a good data source [4]. The advantages of Cloud Computing solutions for managing service oriented organizations are obvious. This is supported by the categories of characteristic users of Cloud Computing: common user (SaaS–Software as a Service), application developer (PaaS–Platform as a Service), and system administrator (IaaS–Infrastructure as a Service).", "num_citations": "7\n", "authors": ["2236"]}
{"title": "Cost-performance evaluation environment for the adoption of a case management solution\n", "abstract": " In order to enter or stay on the market organizations must respond swiftly to the market demands and to possible unforeseeable events, considering the present permanent changing business environment and the economic crisis that most world countries are facing. For the organizations too be more flexible, business process modeling must be done according to the present technologic and economic context, specific to the knowledge-based economy. On this basis, one of the most commonly used business process management solutions is Case Management. The present paper provides an approach on the stages and elements necessary for the successful integration of a Case Management solution, putting forward the creation of an evaluation environment of its impact on the organization. For this purpose, the article provides a starting point for the identification and measurement of the main costs and benefits of …", "num_citations": "6\n", "authors": ["2236"]}
{"title": "Using Cloud Computing to Address Challenges Raised by the Internet of Things\n", "abstract": " The growing number of connected smart devices and the expansion of data storage capacities and data analytics make the fabric of the global interconnection of the manifold universe of human existence. On top of that, the premise of this type of global network of technology infrastructure enables the development of efficient and dynamic enterprise services. The Internet of Things  (IoT) interconnects real-world objects through a large variety of technologies, devices, and protocols. Besides its benefits, the IoT is faced with problems and challenges related to scalability, interoperability, reliability, efficiency, availability, storage, and security (known as the Big 7 of IoT), which experts try to overcome with various solutions. This chapter addresses one of the solutions, namely, Cloud Computing . It dwells on the seven challenges in IoT and the extent to which Cloud Computing can address them (the Big 7 of IoT). It …", "num_citations": "5\n", "authors": ["2236"]}
{"title": "Information audit for decision processes\n", "abstract": " Originating from the Latin auditum–as the endeavor of listening, verifying and recommending–generally the audit translates into a rational and independent contribution to the homeostasis of the audited system. It is a modern buzz word, applied to various systems, from the traditional ones–financial, accounting etc.–to the informational, decisional, communication, bureaucratic ones etc. Under the informational-decisional context, the audit knows specific developments, built on the quality aspect of data or on the stages of the information life cycle. In the following we will present theoretical and practical aspects of information auditing for decision processes, through a case study. The presentation highlights the logical and structural frame of the information audit stages, from planning and definition of the mission to the evaluation and writing the audit report.", "num_citations": "5\n", "authors": ["2236"]}
{"title": "Agile collaborative architecture for the development of e-government services in Romania: Electronic public procurement case study\n", "abstract": " When speaking about electronic government, Romania is giving a special attention to relations between government and organizations. The main reason is the fact that private organizations are the driving force of economic growth. On the other hand, are two principles of public procurement: more attention to transparency and efficient use of public funds. SEAP (Public Procurement Electronic System) as G2B  eGovernment solution was gradually developed starting 2002, offering numerous benefits. Still, it does not solve all the problems and challenges of the procurement process. This chapter offers a general view of the current state of the public procurement in Romanian organizations, highlighting the strengths and weaknesses of SEAP. Also, we present solutions for improvement of public procurement process, both from legislative and technological perspective. Special attention is given to a performant …", "num_citations": "4\n", "authors": ["2236"]}
{"title": "A redefinition of telework through cloud computing-telework 2. 0\n", "abstract": " In this paper we aim to analyse two paradigms, from the perspective of the mutual recursivity between them: telework and cloud computing. The main purpose of this scientific endeavour is to determine the level of support of each paradigm for the other and the synergic effect generated by their interdependence. We will approach functional, juridical and environmental issues. As result, we aim to highlight the way Cloud computing solutions may revolutionize all that is telework and who telework may be redefined through the transition to a superior level, called telework 2.0.", "num_citations": "4\n", "authors": ["2236"]}
{"title": "Organizarea virtuala a întreprinderii\n", "abstract": " Formele clasice de organizare nu mai coincid cu noile conditii impuse de globalizare si de schimbarile structurale. Întreprinderile reactioneaza la noua dinamica a pietei si la cresterea incertitudinii prin intermediul strategiilor de aparare sau de divizare a riscului. Acest lucru, presupune intrarea în cooperare cu alte firme si crearea de retele strategice. Potentialul tehnologic al retelelor se loveste de mentalitatile anumitor parti implicate în retea. Aceste obstacole apar si în cazul organizatiei virtuale. Cuvinte cheie: organizatie virtuala, management, retea, structura formala, tehnologia informatiei si comunicatiilor. tunci când ne ocupam de conceptul de organizare virtuala, în primul rând trebuie sa facem distinctie între organizatie virtuala si întreprindere virtuala. Conceptul de organizatie virtuala descrie nivelul functional, în timp ce întreprinderea virtuala se refera la nivelul institutional, lucru care ne ofera doua criterii de definire a organizarii virtuale. organizarea virtuala, relanseaza formele traditionale de comunicare si regulile, acest lucru putând însemna expansiunea organizarii clasice; întreprindere virtuala este un principiu de organizare interna, manifestând caracteristicile principale ale organizatiei virtuale. Daca virtualizarea înseamna ceva mai mult decât reteaua electronica din departamentele întreprinderii, atunci organizatia virtuala are caracteristici si modalitati originale de realizare.", "num_citations": "4\n", "authors": ["2236"]}
{"title": "SOA, SoBI & EDA–Paradigms for Integration Capabilities of BI Platform\n", "abstract": " A Business Intelligence (BI) provider may offer a basic solution, a packed application or a comprising BI platform which integrates components from individual technologies in a synergic system. The providers’ tendency is to standardize the instruments offered on a single server platform. The article analyzes the integration capabilities and problems of BI platforms, emphasizes the differences between emergent technologies and suggests integration solutions. The analysis is useful both to the providers of BI solutions–in order to develop some agile platforms, as well as to their users–representing an important factor in selecting the solution. In addition, the conclusions to be drawn will emphasize the tendencies from the BI market and will represent the support in creating some agile platforms.", "num_citations": "3\n", "authors": ["2236"]}
{"title": "Informational trends for organizations in information society\n", "abstract": " Companies have always been very carefully managed money, raw materials, machines and human resources. Today, they recognize the growing importance of the fifth big resource: information. They have finally understood that the within the global market with increased competition, using modern methods for planning, coordination and control, a company cannot function without acknowledging information and communications technology progress.", "num_citations": "3\n", "authors": ["2236"]}
{"title": "Investigating the Impact of the Internet of Things in Higher Education Environment\n", "abstract": " The developments in information and communications technologies (ICT) come with changes in all the fields of life, including the education system. At the same time, the IoT (Internet of Things) is turning ever more important as regards the overall benefits that it brings to smart cities as well as the education system. Starting March 2020, the COVID-19 pandemic has caused fast-paced changes in education and forced the ICT integration in higher education. Despite that, the IoT is still at the beginning in the education system and the impact of its adoption is far from being fully understood. This article is aimed at describing a smart education environment and the extent to which the IOT is conducive to this desideratum. The paper also identifies and describes the most important benefits and challenges related to the adoption of the IoT in higher education. In order to analyze the impact of the IoT adoption in the education …", "num_citations": "2\n", "authors": ["2236"]}
{"title": "QAaaS in a Cloud IoT Ecosystem\n", "abstract": " The current transition state of the global society, both from economic and (mostly) technological perspective, goes–again–into overtime. Borrowed from fundamental domains and applied into science and research, the latest technological developments are built on graphene, silicene, phosphorene and stanene. The fourth industrial revolution changes perceptions and redefines the status of the individual, transforming him from con-sumer into pro-sumer of energy. Spintronics stimulates the production of accessories specific to the Internet of Things (IoT), like smart clothes connected to internet and implanted phones. Additionally, technology influences software development methodologies facing us with paradigms that transcend philosophies like green, grid, cloud computing and advance toward a superior manifestation of computer programming: Fog Computing (with the next level being presumably Rainbow Computing). Within this avalanche of transformations, technologies and paradigms, one aspect that has to evolve continuously is the quality assurance (QA). Hidden under various concept or methodology encapsulations, quality assurance in all fields and mostly in technological development and software paradigm play a key role. In an ecosystem defined by the context of Cloud IoT, quality assurance as service becomes a real challenge. In this paper we highlight the ways the ecosystem engages in its development not only things, beings, energies, sensors or objects but also technologies. One such popular technology is cloud computing which, in the context of IoT, sees a spectacular development of its own cluster of services, a potential …", "num_citations": "2\n", "authors": ["2236"]}
{"title": "Development of Human Resources Using New Technologies in Long-Life Learning.\n", "abstract": " Abstract Information and communication technologies (ICT) offer new opportunities to reinvent the education and to make people and makes learning more fun and contemporary but poses many problems to educational institutions. Implementation of ICT determines major structural changes in the organizations and mental switch from bureaucratic mentality to customer-oriented one. In this paper I try to evaluate methods of developing the lifelong learning programs, impact to human resources training and development and the impact of this process on educational institutions. E-learning usage in training the human resources can make a new step in development of the education institutions, human resources and companies.", "num_citations": "2\n", "authors": ["2236"]}
{"title": "USING BLOCKCHAIN TECHNOLOGY IN SMART UNIVERSITY.\n", "abstract": " The evolution of information and communications technology (ICT) has a huge impact in all spheres of activity, leading to major changes in every process, gaining important benefits but also facing challenges, especially those related to data security and protection. In the educational sector, there was a switch from traditional university to ICT based university. The use of SOA (Service Oriented Architecture), Cloud Computing, Internet of Things (IoT) and other technologies paves the way to switch to a new stage: intelligent university. Although IoT offers numerous benefits to the educational system, scalability and security of increasing number of objects connected to the network are major challenges. Switching to a decentralized IoT may be a solution for this challenge. Blockchain technology allows decentralization of process management thus being able to solve many of current problems of IoT, especially regarding …", "num_citations": "1\n", "authors": ["2236"]}
{"title": "E-Government in Romania–a Case Study\n", "abstract": " Continuous development of digital communication systems has led to restructuring the information systems into ever cheaper, interconnectable and globally accessible entities, thus allowing individuals to turn towards the so-called e-Government (or electronic government). The government is an institution that fulfills critical needs of society; at some point every citizen has to interact with it. This paper reviews the general picture of the e-Government, with focuses on specific strategies and features of the Romanian electronic government approach, while proposing suggestions and solutions for developing each of them. Electronic government involves the adoption of information and communications technology (ICT) into government functions and procedures, with the goal of increasing efficiency, transparency and participation of citizens in the public life. Therefore, in order for a society to function well, a well-oiled electronic government is necessary. Electronic government uses ICT as a support tool for developing a good government. Proper application of e-Government allows increasing efficiency for governing tasks, improving processes and procedures, increasing quality of public services, improving the use of information in decision making processes and improving communication between various government entities. Through electronic government, municipalities have direct interaction with the citizens. The relation between municipalities and citizens is unavoidable, in terms of; commercial records of corporations, registrations of motor vehicles or enlisting a child into a school, all these require the citizens to interact with state authorities. The …", "num_citations": "1\n", "authors": ["2236"]}
{"title": "Combining Cloud-based Workflow Management System with SOA and CEP to Create Agility in Collaborative Environment.\n", "abstract": " In current economy, technological solutions like cloud computing, service-oriented architecture (SOA) and complex event processing (CEP) are recognized as modern approaches used for increasing the business agility and achieving innovation. The complexity of collaborative business environment raises more and more the need for performant workflow management systems (WfMS) that meet current requirements. Each approach has advantages, but also faces challenges. In this paper we propose a solution for integration of cloud computing with WfMS, SOA and CEP that allows these technologies to complete each other and bank on their benefits to increase agility and reduce the challenges/problems. The paper presents a short introduction in the subject, followed by an analysis of the combination between cloud computing and WfMS and the benefits of cloud based workflow management system. The paper ends with a solution for combining cloud WfMS with SOA and CEP in order to gain business agility and real time collaboration, followed by conclusions and research directions.", "num_citations": "1\n", "authors": ["2236"]}
{"title": "Security Solutions for Privacy Preserving Improved Data Mining.\n", "abstract": " Approaches of data analysis in the context of Business Intelligence solutions are presented, when the data is scarce with respect to the needs of performing an analysis. Several scenarios are presented: usage of an initial dataset obtained from primary data as a reference for the quality of the results, enriching the dataset through decoration with derived attributes and enriching the dataset with external data. Each type of dataset decoration is used to improve the quality of the analysis’ results. After being subject to improvement using the presented methods, the improved dataset contains a large number of attributes regarding a subject. As some attributes refer to sensitive information or imply sensitive information about the subject, therefore dataset storage needs to prevent unwanted analysis that could reveal such information. A method for dataset partitioning is presented with respect to the predictive capacity of a set of attributes over a sensitive attribute. The proposed partitioning includes also means to hide the link between the real subject and stored data.", "num_citations": "1\n", "authors": ["2236"]}
{"title": "E-learning solutions based on service-oriented technologies\n", "abstract": " Considering the current stage of development, where the nature of work is changing and moving towards virtual organization of activities, the educational process also undergoes deep changes. The effect of these changes is widely known as e-learning. The importance and marginal utility of e-learning become obvious against the background of world crisis. These are only a few reasons behind the unsurprising adoption of e-learning on global scale. Yet, the simple implementation of e-learning solutions is not enough to guarantee the success of this modern education technology. A successful solution will have to combine the human resource with the modern service-oriented technology. In this paper we will present the most important aspects of implementing a successful e-learning solution. They are: the current stage of implementing e-learning solutions in Romania and worldwide, modern technologies for e …", "num_citations": "1\n", "authors": ["2236"]}
{"title": "Designing Flexible E-Business Workflow Systems.\n", "abstract": " In today's business environment organizations must cope with complex interactions between actors adapt fast to frequent market changes and be innovative. In this context, integrating knowledge with processes and Business Intelligence is a major step towards improving organization agility. Therefore, traditional environments for workflow design have been adapted to answer the new business models and current requirements in the field of collaborative processes. This paper approaches the design of flexible and dynamic workflow management systems for electronic businesses that can lead to agility.", "num_citations": "1\n", "authors": ["2236"]}
{"title": "„Electronic biddings for public acquisitions of goods, services and work: Romanian approach”\n", "abstract": " E-Procurement defines the automation of an organization’s procurement processes using web-based applications. E-procurement applications consolidate the paper-based catalogs of multiple vendors by digitizing product information into a single, one-stop shopping source for direct and indirect goods and services. The most common e-procurement model involves a host or intermediary service provider linking buyers and sellers in an interconnected supply chain using a web based e-procurement application. This paper analyzes how the Romanian electronic public acquisition system meets the requirements of the informational society and the European integration.", "num_citations": "1\n", "authors": ["2236"]}