{"title": "Finding collaborative innovation networks through correlating performance with social network structure\n", "abstract": " This paper contributes to the ongoing stream of research correlating social network structure with individual and organizational performance. While teaching a course on optimizing online communication behaviour and social network analysis, we collected preliminary data on the relationship between dynamic social network structures and individual and team performance. Students from Helsinki University of Technology and University of Cologne, who had never met face to face, formed virtual interdisciplinary teams collaborating on a common task, the communication analysis of online communities. As part of their task, students correlated performance of the community they were analysing with social network structure. In this research, we compare social network structure and individual and team performance of participants in a multi-user online computer game with social network structure and performance …", "num_citations": "155\n", "authors": ["2224"]}
{"title": "Scaling agile\n", "abstract": " Agile software development has become mainstream. Industry-scale agility for distributed teams, large projects, or critical systems requires scaling agile practices, which agile scaling frameworks attempt to provide. Here, Maria Paasivaara and I explore frameworks such as the Scaled Agile Framework (SAFe) and show best practices from two industry case studies. I look forward to hearing from both readers and prospective column authors about this column and the technologies you want to know more about.", "num_citations": "121\n", "authors": ["2224"]}
{"title": "Adopting SAFe to scale agile in a globally distributed organization\n", "abstract": " Large software development organizations adopting agile methods need solutions and models to help scale agile to fit their needs. During recent years, several frameworks for scaling agile have been created by consultants, including the Scaled Agile Framework (SAFe), Large-scale Scrum (LeSS) and Disciplined Agile Delivery (DAD). However, research on how these frameworks are adopted in practice is seriously lacking. In this paper we describe how Comptel, a globally distributed software development company, adopted the SAFe framework in two business lines. Based on eleven interviews we present why and how the organization adopted SAFe, and discuss related challenges and success factors. The comparison of the two adoptions showed that investing in SAFe trainings, engaging people and change agents, hiring a coach, investing in a full-time release train engineer, preparing well for the first …", "num_citations": "99\n", "authors": ["2224"]}
{"title": "Communication needs, practices and supporting structures in global inter-organizational software development projects\n", "abstract": " This paper presents communication needs, supporting structures and communication practices collected from global software development projects. The data was gathered by 32 interviews from seven global interorganizational projects. We identified four important communication needs: problem solving, informing and monitoring, relationship building, and decision-making and coordination. Structures supporting communication were: organizational structure with communicating roles, partial synchronization of intra-organizational processes, and project level coordination. Communication practices are built upon and facilitated by these structures. A surprising finding was that companies rarely had any company level practices that were used in all interorganizational projects. Instead, the practices were formed by trial and error and were mainly project specific.", "num_citations": "44\n", "authors": ["2224"]}
{"title": "Stakeholder perceptions of the adoption of continuous integration--a case study\n", "abstract": " Continuous integration is an important support mechanism for fast delivery of new features. However, its adoption in industry has often been problematic, partly due to social challenges. However, there is little knowledge of the exact nature of the challenges, and how different stakeholders perceive the need for and adoption of continuous integration. In this paper, we describe how the introduction of continuous integration was perceived by different stakeholders in a R&D program at Ericsson. The case provided a rare opportunity to study the adoption of continuous integration in a large distributed organization. We interviewed 27 stakeholders and found differing perceptions of continuous integration: how suitable it is for the organization, how adoption should be organized, and whether it is possible to achieve sufficient quality through automated testing. These differences of perception were mainly consequences of …", "num_citations": "36\n", "authors": ["2224"]}
{"title": "Communication Practices in Inter-Organisational Product Development\n", "abstract": " Geographically distributed, inter-organisational product development projects are becoming increasingly common. However, companies face challenges in managing this kind of complicated projects. Most of the challenges are related to communication. This study focused on communication needs, problems and practices in distributed inter-organisational product development projects.  The main objective was to identify and describe successful communication practices. In addition, the study aimed to increase the understanding of the communication needs behind the practices, as well as to identify communication problems and unsuccessful practices. From the methodological point of view, studying daily communication in distributed projects is challenging. In this study we experimented with the usage of social process simulation as a tool to study communication.  Methodologically, the research was a qualitative multiple-case study consisting of 12 case projects. The cases were grouped into two separate studies according to the industry. Study 1 concentrated on distributed inter-organisational projects that developed plastic products, whereas Study 2 examined global software development projects. In Study 1, data was collected using the social process simulation method, which combines several data collection methods, such as semi-structured interviews and simulation sessions. In Study 2, semi-structured interviews were used.  The main contribution of this research is a set of eighteen successful communication practices that were identified in distributed product development projects. The practices include, e.g., frequent deliveries, the …", "num_citations": "27\n", "authors": ["2224"]}
{"title": "Correlating performance with social network structure through teaching social network analysis\n", "abstract": " Teaching a course on optimizing online communication behavior and social network analysis permitted us to obtain preliminary results on correlating temporal online communication patterns with team performance. Students from Helsinki University of Technology and University of Cologne who had never met face to face formed virtual interdisciplinary teams collaborating on a common task. While collaborating over long distance, students kept track of their own communication activities by e-mail, chat, and conference calls with Skype. The contribution of this paper is twofold. First, we introduce an innovative course format creating an empirical base for team performance in a distributed online communication environment. Secondly, we provide basic analysis of correlations between SNA measures and team performance. Students used these insights to optimize their own communication behavior for future …", "num_citations": "25\n", "authors": ["2224"]}
{"title": "Coaching global software development projects\n", "abstract": " This paper presents a multiple-case study on how three globally distributed software development projects from a large Scandinavia-based IT organization introduced agile practices with the help of a company internal coaching team. The data was gathered by ten semi-structured interviews: we interviewed four coaches and six persons from the coached projects. We describe how the coaches cooperated with the case projects, helping them to adopt agile practices. We present the challenges the projects faced, as well as the benefits they gained. Our results show that when coaching globally distributed projects it is especially important to gain executive support from all the sites, to involve all sites in the change process, to build a common vision in a collaborative workshop, to invite coaches as early as possible, to aim for a long-term coaching relationship, and to remember that the project team owns the change …", "num_citations": "17\n", "authors": ["2224"]}
{"title": "Practical guide to managing distributed software development projects\n", "abstract": " Practical Guide to Managing Distributed Software Development Projects — Aalto University's research portal Skip to main navigation Skip to search Skip to main content Aalto University's research portal Logo Accessibility statement English Suomi Home Profiles Research output Datasets Projects Prizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name or affiliation Practical Guide to Managing Distributed Software Development Projects Maria Paasivaara, Nico Hiort af Ornäs, Peitsa Hynninen, Casper Lassenius, Tuomas Niinimäki, Arttu Piri Research output: Working paper › Professional Overview Original language English Place of Publication Espoo Pages 156 ISBN (Electronic) 978-952-3043-2 Publication status Published - 2010 MoE publication type D4 Published development or research report or study Publication series Name Helsinki University of Technology Software …", "num_citations": "15\n", "authors": ["2224"]}
{"title": "Predicting 2016 US presidential election polls with online and media variables\n", "abstract": " Traditional media has always played a large role in elections by informing voters and shaping opinions, and recently, social media and various Internet information sources have also become considerable influencers on the voters. There is data publicly available on how these information sources and media channels are being used, which could potentially be analyzed for their effects on the election process. This chapter aims to determine if social media, Internet traffic, and traditional media data can be used to predict elections by searching for patterns between the data and poll numbers for 2016 US Republican and Democratic primaries. The results suggest that machine learning models with linear regression can produce quite accurate predictions; also statistically significant correlations were found between polls and betting odds and polls and Facebook page likes. More sophisticated methods could …", "num_citations": "11\n", "authors": ["2224"]}
{"title": "Cultural differences in the understanding of history on Wikipedia\n", "abstract": " This paper sheds light on cultural differences in the understanding of historical military events between Chinese, English, French, German, and Swedish Wikipedia language editions. Differences in understanding historical events can lead to intercultural misinterpretation and conflicts that cause negative consequences for international relations. We identified the most important historical events, mined cross-cultural relations, investigated word usage in war-related pages and performed network, complexity, and sentiment analysis. We also analyzed the usage of war-related words and the quantity of war-related events mentioned in different languages. Our findings suggest that World War I and World War II are the most important historical events within English, French, and German cultures and English Wikipedia contains more violence and war-related content, with a higher level of complexity than other …", "num_citations": "8\n", "authors": ["2224"]}
{"title": "Communication in Networked Product Development-A Case Study\n", "abstract": " New products are increasingly developed in inter-company networks. There are several benefits arising from collaboration between firms, eg, speeding up product development; obtaining resources, knowledge or technology; and sharing costs and risks. However, several studies have shown that the objectives of a collaboration are not always met (eg Bruce et al, 1995). Many of the problems leading to unsuccessful collaborative projects originate from a lack of communication and trust (Wynstra et al, 2001; Bruce et al, 1995). Moreover, previous communication research studying intra-organisational projects has shown that effective and efficient communication is a prerequisite for the success of a project (Moenaert et al, 2000) and that the better the product development team members are connected to each other and to key external parties, the more successful the project is going to be (Tushman & Katz, 1980).This study hypotheses that successful communication is even more important for networked, inter-organisational product development projects than it is for intraorganisational projects, since these networked projects face barriers that are not so common in intra-organisational projects, such as geographical distance and differences in organisational culture and operating procedures. Arranging successful co-operation, and especially communication, in spite of these barriers, poses new challenges and brings out several questions: What are the needs for communication of networked new product development projects? How should communication be arranged? When should communication take place? What kind of information should be …", "num_citations": "8\n", "authors": ["2224"]}
{"title": "COINs Change Leaders-Lessons Learned from a Distributed Course\n", "abstract": " In this paper we analyze the communication network of 50 students from five universities in three countries participating in a joint course on Collaborative Innovation Networks (COINs). Students formed ten teams. Interaction variables calculated from the e-mail archive of individual team members predict the level of creativity of the team. Oscillating leadership, where members switch between central and peripheral roles is the best predictor of creativity, it is complemented by the variance in the amount of sending or receiving information, and by answering quickly, and positive language. We verify our automatically generated creativity metrics with interviews.", "num_citations": "7\n", "authors": ["2224"]}
{"title": "Benefits and Challenges of Adopting SAFe-An Empirical Survey\n", "abstract": " During the last two decades, turbulent business environments tempted firms to adopt agile methods to cope with the everchanging customer demands. The success of agile methods in small and co-located teams inspired companies to apply them to large-scale endeavors. Agile scaling frameworks, such as the Scaled Agile Framework (SAFe), have been proposed by practitioners to scale agile practices to large projects and enterprises. Companies are increasingly taking these frameworks into use. However, the number of quantitative empirical studies assessing the benefits and challenges of adopting the agile scaling frameworks is still limited. This paper starts filling in this gap by presenting the results from a survey of 100 industry participants around the world on their perception of the benefits and challenges of adopting the SAFe framework. Our results show that the SAFe adoption improves transparency, as well as collaboration and dependency management between agile teams. The most commonly mentioned challenges of the SAFe adoption are organizational politics, difficulties in establishing an agile mindset, change resistance, and team formation challenges.", "num_citations": "3\n", "authors": ["2224"]}
{"title": "Evolution of the Agile Scaling Frameworks\n", "abstract": " Over the past decade, agile methods have become the favored choice for projects undertaken in rapidly changing environments. The success of agile methods in small, co-located projects has inspired companies to apply them in larger projects. Agile scaling frameworks, such as Large Scale Scrum and Scaled Agile Framework, have been invented by practitioners to scale agile to large projects and organizations. Given the importance of agile scaling frameworks, research on those frameworks is still limited. This paper presents our findings from an empirical survey answered by the methodologists of 15 agile scaling frameworks. We explored (i) framework evolution,(ii) main reasons behind their creation,(iii) benefits, and (iv) challenges of adopting these frameworks. The most common reasons behind creating the frameworks were improving the organization’s agility and collaboration between agile teams. The most commonly claimed benefits included enabling frequent deliveries and enhancing employee satisfaction, motivation, and engagement. The most mentioned challenges were using frameworks as cooking recipes instead of focusing on changing people’s culture and mindset.", "num_citations": "3\n", "authors": ["2224"]}
{"title": "Teaching the Scrum Master Role using Professional Agile Coaches and Communities of Practice\n", "abstract": " As Scrum seems to be the most popular Agile method at the moment, most universities teaching software development teach it. A Scrum Team consists of a Scrum Master, a Product Owner, and developers. The Scrum Master role is vital in the team. However, looking at the industry, companies have difficulties both in hiring good Scrum Masters and convincing their developers or other personnel to take that role. Agile trainers do offer short Scrum Master training courses. However, we lacking information on how to train Scrum Masters in university education.In this paper, we report how we arranged a one-semester long Scrum Master training course. During the course, students worked as team Scrum Masters under the guidance of professional agile coaches and collaborated in a Scrum Master Community of Practice.We collected data by performing 13 post-course semi-structured interviews with Scrum Masters and …", "num_citations": "1\n", "authors": ["2224"]}
{"title": "Changing network structures in the plastics industry: from a slow changing to a fast changing industry\n", "abstract": " This paper presents a classification of company networks in the Finnish injection molding industry. The research question is how the change in business environment, from a slow changing to fast changing environment has affected company network structures in this industry. On the basis of the authors' research, they classified company networks in the injection molding industry into three categories: networks for producing simple plastic products; networks for producing complex plastic products; and future networks for plastic products. They noticed that product complexity had a great effect on network structure. They compared these network types with respect to several factors, such as product life cycle, production batch size, product quality requirements, coordination of the network role of different partners in the network, division of work and responsibilities, type of network relationship and amount and type of …", "num_citations": "1\n", "authors": ["2224"]}