{"title": "A methodology and tool support for managing business rules in organisations\n", "abstract": " Business rules are evidently important for organisations as they describe how they are doing business. Their value has also been recognised within the information system (IS) domain, mostly because of their ability to make applications flexible and amenable to change. In this paper, we propose a methodology that helps business people and developers to keep business rules at the business level inline with the rules that are implemented at the system level. In contrast to several existing approaches that primarily focus on business rules in the scope of an application, our methodology addresses the entire IS of an organisation. The paper also describes requirements for a tool support that would be appropriate to support the methodology.", "num_citations": "212\n", "authors": ["373"]}
{"title": "Robust network community detection using balanced propagation\n", "abstract": " Label propagation has proven to be an extremely fast method for detecting communities in large complex networks. Furthermore, due to its simplicity, it is also currently one of the most commonly adopted algorithms in the literature. Despite various subsequent advances, an important issue of the algorithm has not yet been properly addressed. Random (node) update orders within the algorithm severely hamper its robustness, and consequently also the stability of the identified community structure. We note that an update order can be seen as increasing propagation preferences from certain nodes, and propose a balanced propagation that counteracts for the introduced randomness by utilizing node balancers. We have evaluated the proposed approach on synthetic networks with planted partition, and on several real-world networks with community structure. The results confirm that balanced propagation is …", "num_citations": "182\n", "authors": ["373"]}
{"title": "The CHEMDNER corpus of chemicals and drugs and its annotation principles\n", "abstract": " The automatic extraction of chemical information from text requires the recognition of chemical entity mentions as one of its key steps. When developing supervised named entity recognition (NER) systems, the availability of a large, manually annotated text corpus is desirable. Furthermore, large corpora permit the robust evaluation and comparison of different approaches that detect chemicals in documents. We present the CHEMDNER corpus, a collection of 10,000 PubMed abstracts that contain a total of 84,355 chemical entity mentions labeled manually by expert chemistry literature curators, following annotation guidelines specifically defined for this task. The abstracts of the CHEMDNER corpus were selected to be representative for all major chemical disciplines. Each of the chemical entity mentions was manually labeled according to its structure-associated chemical entity mention (SACEM) class: abbreviation, family, formula, identifier, multiple, systematic and trivial. The difficulty and consistency of tagging chemicals in text was measured using an agreement study between annotators, obtaining a percentage agreement of 91. For a subset of the CHEMDNER corpus (the test set of 3,000 abstracts) we provide not only the Gold Standard manual annotations, but also mentions automatically detected by the 26 teams that participated in the BioCreative IV CHEMDNER chemical mention recognition task. In addition, we release the CHEMDNER silver standard corpus of automatically extracted mentions from 17,000 randomly selected PubMed abstracts. A version of the CHEMDNER corpus in the BioC format has been generated as well. We …", "num_citations": "179\n", "authors": ["373"]}
{"title": "Web portals: the new gateways to Internet information and services\n", "abstract": " A Web portal is a special web site designed to act as a gateway giving convenient access to other related sites. This book investigates the various types of portals and describes how they can be used in business applications. After considering the nature of portals, the book describes the first general portals like Yahoo, and how they came into being. Portals are used in businesses of all types and sizes and this book discusses how portals can be used in large business corporations as well as small to medium enterprises. Web portals have increasing importance to marketers as, by their nature, they retain their users who must return to them frequently. They also provide a useful means of making information and knowledge readily available in a convenient form to authorised users. This book covers a wide range of issues relating to the use of portals in business.", "num_citations": "159\n", "authors": ["373"]}
{"title": "An expert system for detecting automobile insurance fraud using social network analysis\n", "abstract": " The article proposes an expert system for detection, and subsequent investigation, of groups of collaborating automobile insurance fraudsters. The system is described and examined in great detail, several technical difficulties in detecting fraud are also considered, for it to be applicable in practice. Opposed to many other approaches, the system uses networks for representation of data. Networks are the most natural representation of such a relational domain, allowing formulation and analysis of complex relations between entities. Fraudulent entities are found by employing a novel assessment algorithm, Iterative Assessment Algorithm (IAA), also presented in the article. Besides intrinsic attributes of entities, the algorithm explores also the relations between entities. The prototype was evaluated and rigorously analyzed on real world data. Results show that automobile insurance fraud can be efficiently detected with …", "num_citations": "155\n", "authors": ["373"]}
{"title": "Unfolding communities in large complex networks: Combining defensive and offensive label propagation for core extraction\n", "abstract": " Label propagation has proven to be a fast method for detecting communities in large complex networks. Recent developments have also improved the accuracy of the approach; however, a general algorithm is still an open issue. We present an advanced label propagation algorithm that combines two unique strategies of community formation, namely, defensive preservation and offensive expansion of communities. The two strategies are combined in a hierarchical manner to recursively extract the core of the network and to identify whisker communities. The algorithm was evaluated on two classes of benchmark networks with planted partition and on 23 real-world networks ranging from networks with tens of nodes to networks with several tens of millions of edges. It is shown to be comparable to the current state-of-the-art community detection algorithms and superior to all previous label propagation algorithms, with …", "num_citations": "148\n", "authors": ["373"]}
{"title": "Practice-driven approach for creating project-specific software development methods\n", "abstract": " Both practitioners and researchers agree that if software development methods were more adjustable to project-specific situations, this would increase their use in practice. Empirical investigations show that otherwise methods exist just on paper while in practice developers avoid them or do not follow them rigorously. In this paper we present an approach that deals with this problem. Process Configuration, as we named the approach, tells how to create a project-specific method from an existing one, taking into account the project circumstances. Compared to other approaches that deal with the creation of project-specific methods, our approach tends to be more flexible and easier to implement in practice as it introduces few simplifications. The proposed approach is practice-driven, i.e. it has been developed in cooperation with software development companies.", "num_citations": "97\n", "authors": ["373"]}
{"title": "Self-similar scaling of density in complex real-world networks\n", "abstract": " Despite their diverse origin, networks of large real-world systems reveal a number of common properties including small-world phenomena, scale-free degree distributions and modularity. Recently, network self-similarity as a natural outcome of the evolution of real-world systems has also attracted much attention within the physics literature. Here we investigate the scaling of density in complex networks under two classical box-covering renormalizations–network coarse-graining–and also different community-based renormalizations. The analysis on over 50 real-world networks reveals a power-law scaling of network density and size under adequate renormalization technique, yet irrespective of network type and origin. The results thus advance a recent discovery of a universal scaling of density among different real-world networks [P.J. Laurienti, K.E. Joyce, Q.K. Telesford, J.H. Burdette, S. Hayasaka, Universal …", "num_citations": "88\n", "authors": ["373"]}
{"title": "Community structure of complex software systems: Analysis and applications\n", "abstract": " Due to notable discoveries in the fast evolving field of complex networks, recent research in software engineering has also focused on representing software systems with networks. Previous work has observed that these networks follow scale-free degree distributions and reveal small-world phenomena, while we here explore another property commonly found in different complex networks, i.e. community structure. We adopt class dependency networks, where nodes represent software classes and edges represent dependencies among them, and show that these networks reveal a significant community structure, characterized by similar properties as observed in other complex networks. However, although intuitive and anticipated by different phenomena, identified communities do not exactly correspond to software packages. We empirically confirm our observations on several networks constructed from Java and …", "num_citations": "87\n", "authors": ["373"]}
{"title": "Trust management in a blockchain based fog computing platform with trustless smart oracles\n", "abstract": " Trust is a crucial aspect when cyber-physical systems have to rely on resources and services under ownership of various entities, such as in the case of Edge, Fog and Cloud computing. The DECENTER’s Fog Computing Platform is developed to support Big Data pipelines, which start from the Internet of Things (IoT), such as cameras that provide video-streams for subsequent analysis. It is used to implement Artificial Intelligence (AI) algorithms across the Edge-Fog-Cloud computing continuum which provide benefits to applications, including high Quality of Service (QoS), improved privacy and security, lower operational costs and similar. In this article, we present a trust management architecture for DECENTER that relies on the use of blockchain-based Smart Contracts (SCs) and specifically designed trustless Smart Oracles. The architecture is implemented on Ethereum ledger (testnet) and three trust management …", "num_citations": "78\n", "authors": ["373"]}
{"title": "An approach for concurrent evaluation of technical and social aspects of software development methodologies\n", "abstract": " The paper presents an approach for evaluation of software development methodologies (SDM) that considers the aspects of a SDM’s social adoption and technical efficiency. It builds on existing evaluation models used in the field of SDM. Case study approach was used to validate the model in four software development organisations. In all four cases the management confirmed that the model provided valuable new insights into adoption and efficiency of the companies’ SDM.", "num_citations": "71\n", "authors": ["373"]}
{"title": "Software systems through complex networks science: Review, analysis and applications\n", "abstract": " Complex software systems are among most sophisticated human-made systems, yet only little is known about the actual structure of'good'software. We here study different software systems developed in Java from the perspective of network science. The study reveals that network theory can provide a prominent set of techniques for the exploratory analysis of large complex software system. We further identify several applications in software engineering, and propose different network-based quality indicators that address software design, efficiency, reusability, vulnerability, controllability and other. We also highlight various interesting findings, eg, software systems are highly vulnerable to processes like bug propagation, however, they are not easily controllable.", "num_citations": "55\n", "authors": ["373"]}
{"title": "Model of complex networks based on citation dynamics\n", "abstract": " Complex networks of real-world systems are believed to be controlled by common phenomena, producing structures far from regular or random. These include scale-free degree distributions, small-world structure and assortative mixing by degree, which are also the properties captured by different random graph models proposed in the literature. However, many (non-social) real-world networks are in fact disassortative by degree. Thus, we here propose a simple evolving model that generates networks with most common properties of real-world networks including degree disassortativity. Furthermore, the model has a natural interpretation for citation networks with different practical applications.", "num_citations": "53\n", "authors": ["373"]}
{"title": "Using business rules technologies to bridge the gap between business and business applications\n", "abstract": " Business rules represent a significant aspect of every business environment, since they define and constrain business processes in enterprises. Therefore, many business-governing rules have to be implemented in business-supporting applications, in order to reflect the real business environment. In fact, software engineers have been doing that, for as long as the applications have been built. However, not every approach is appropriate. For example, if business rules are buried into program code, applications become very difficult to maintain when business changes. This paper examines business rules from the applicationdevelopment perspective, discussing traditional and contemporary business-oriented approaches to business rule implementation. A special focus is given to the modern technologies that support isolation of business rules in the application architecture.", "num_citations": "48\n", "authors": ["373"]}
{"title": "Ubiquitousness of link-density and link-pattern communities in real-world networks\n", "abstract": " Community structure appears to be an intrinsic property of many complex real-world networks. However, recent work shows that real-world networks reveal even more sophisticated modules than classical cohesive (link-density) communities. In particular, networks can also be naturally partitioned according to similar patterns of connectedness among the nodes, revealing link-pattern communities. We here propose a propagation based algorithm that can extract both link-density and link-pattern communities, without any prior knowledge of the true structure. The algorithm was first validated on different classes of synthetic benchmark networks with community structure, and also on random networks. We have further applied the algorithm to different social, information, technological and biological networks, where it indeed reveals meaningful (composites of) link-density and link-pattern communities. The …", "num_citations": "44\n", "authors": ["373"]}
{"title": "Managing business rules in enterprises\n", "abstract": " Business rules are evidently an important business category since they describe how enterprises are doing business. Their value in developing applications that are flexible and amenable to change has made them attractive also within information system (IS) domain. In the paper we describe how business rules can be used as information resources that help in establishing the link between organization’s business and its supporting IS. We show a business rule management scenario that integrates the activities for managing the business rule in an organization, and the activities that support business rule management across the IS development life cycle.", "num_citations": "43\n", "authors": ["373"]}
{"title": "Do PageRank-based author rankings outperform simple citation counts?\n", "abstract": " The basic indicators of a researcher's productivity and impact are still the number of publications and their citation counts. These metrics are clear, straightforward, and easy to obtain. When a ranking of scholars is needed, for instance in grant, award, or promotion procedures, their use is the fastest and cheapest way of prioritizing some scientists over others. However, due to their nature, there is a danger of oversimplifying scientific achievements. Therefore, many other indicators have been proposed including the usage of the PageRank algorithm known for the ranking of webpages and its modifications suited to citation networks. Nevertheless, this recursive method is computationally expensive and even if it has the advantage of favouring prestige over popularity, its application should be well justified, particularly when compared to the standard citation counts. In this study, we analyze three large datasets of …", "num_citations": "33\n", "authors": ["373"]}
{"title": "Network-based statistical comparison of citation topology of bibliographic databases\n", "abstract": " Modern bibliographic databases provide the basis for scientific research and its evaluation. While their content and structure differ substantially, there exist only informal notions on their reliability. Here we compare the topological consistency of citation networks extracted from six popular bibliographic databases including Web of Science, CiteSeer and arXiv. org. The networks are assessed through a rich set of local and global graph statistics. We first reveal statistically significant inconsistencies between some of the databases with respect to individual statistics. For example, the introduced field bow-tie decomposition of DBLP Computer Science Bibliography substantially differs from the rest due to the coverage of the database, while the citation information within arXiv. org is the most exhaustive. Finally, we compare the databases over multiple graph statistics using the critical difference diagram. The citation …", "num_citations": "30\n", "authors": ["373"]}
{"title": "Holistic approach to fraud management in health insurance\n", "abstract": " Fraud present an immense problem for health insurance companies and the only way to fight fraud is by using specialized fraud management systems. The current research community focussed great efforts on different fraud detection techniques while neglecting other also important activities of fraud management. We propose a holistic approach that focuses on all 6 activities of fraud management, namely,(1) deterrence,(2) prevention,(3) detection,(4) investigation,(5) sanction and redress, and (6) monitoring. The main contribution of the paper are 15 key characteristics of a fraud management system, which enable construction of a fraud management system that provides effective and efficient support to all fraud management activities. We base our research on literature review, interviews with experts from different fields, and a case study. The case study provides additional confirmation to expert opinions, as it puts our holistic framework into practice.", "num_citations": "26\n", "authors": ["373"]}
{"title": "Group detection in complex networks: An algorithm and comparison of the state of the art\n", "abstract": " Complex real-world networks commonly reveal characteristic groups of nodes like communities and modules. These are of value in various applications, especially in the case of large social and information networks. However, while numerous community detection techniques have been presented in the literature, approaches for other groups of nodes are relatively rare and often limited in some way. We present a simple propagation-based algorithm for general group detection that requires no a priori knowledge and has near ideal complexity. The main novelty here is that different types of groups are revealed through an adequate hierarchical group refinement procedure. The proposed algorithm is validated on various synthetic and real-world networks, and rigorously compared against twelve other state-of-the-art approaches on group detection, hierarchy discovery and link prediction tasks. The algorithm is …", "num_citations": "25\n", "authors": ["373"]}
{"title": "Educational portals: A way to get an integrated, user-Centric university information system\n", "abstract": " Portal-based solutions have been proved in practice to be a promising technology that offers companies a way to transform and integrate their information systems more effectively and at lower cost. The main point of this paper is to discuss the use of portals in institutions of higher education. We examine the motivating factors that drive higher-education institutions to use portal-based solutions. As an example, we explain how the University of Ljubljana is taking advantage of portal technology and what benefits are to be expected from the use of portals as core components of the university’s new user-centric information system.", "num_citations": "22\n", "authors": ["373"]}
{"title": "Agilne metodologije razvoja informacijskih sistemov\n", "abstract": " Pojem agilnost ter trendi, ki jih s tem povezujemo, so se na področju metodologij razvoja informacijskih sistemov pojavili kot rezultat kritičnega pogleda na celovite, večinoma težko obvladljive metodologije, ki proces razvoja predpišejo do vsake najmanjše podrobnosti. Kljub kakovosti, ki jo takšne metodologije navadno dosegajo, je njihova uporaba v praksi omejena, saj jim z željo po čimprejšnjih rezultatih težko sledimo. Novi trendi priporočajo zasnovo ter uporabo prilagodljivih metodologij, ki so» ravno dovolj «predpisljive ter hitro in enostavno prilagodljive. V prispevku opredelimo pojem agilnost ter opišemo s tem povezane trende. V nadaljevanju podamo naše izkušnje pri uporabi novih trendov za zasnovo sodobnih metodologij razvoja informacijskih sistemov.", "num_citations": "22\n", "authors": ["373"]}
{"title": "Node mixing and group structure of complex software networks\n", "abstract": " Large software projects are among most sophisticated human-made systems consisting of a network of interdependent parts. Past studies of software systems from the perspective of complex networks have already led to notable discoveries with different applications. Nevertheless, our comprehension of the structure of software networks remains to be only partial. Here we investigate correlations or mixing between linked nodes and show that software networks reveal dichotomous node degree mixing similar to that recently observed in biological networks. We further show that software networks also reveal characteristic clustering profiles and mixing. Hence, node mixing in software networks significantly differs from that in, e.g., the Internet or social networks. We explain the observed mixing through the presence of groups of nodes with common linking pattern. More precisely, besides densely linked groups known …", "num_citations": "20\n", "authors": ["373"]}
{"title": "Framework for the delivery of information system due diligence\n", "abstract": " The IS field lacks a scientifically based analytical tool for delivering IS due diligence. Due Diligence is the activity of identifying and measuring the risks and increasing the likelihood of productive investment. In this article, we propose a framework for IS due diligence development based on our generalized experiences conducting IS due diligence in more than 60 banks and financial organizations in Europe.", "num_citations": "19\n", "authors": ["373"]}
{"title": "Open and scalable IoT platform and its applications for real time access line monitoring and alarm correlation\n", "abstract": " We present an open intelligent communication platform that can be used to support various usage scenarios related to future internet of things. Its purpose is twofold: to support fusion of large amounts of data, irrespective of their source or structure and to provide users or devices with semantically analysed and enriched data according to their needs and context. Using the platform, users are able to access enriched data, receive warnings and notifications about events recognised by the system. We present applications for the real time access line monitoring and alarm correlation that respond to telecommunications operators’ needs in the field of proactive line measurement in enabling the helpdesk and field technical teams to pinpoint the cause of service degradations.", "num_citations": "18\n", "authors": ["373"]}
{"title": "Software process improvement based on the method engineering principles\n", "abstract": " While it used to be a common belief that the use of rigorous methods in software development is beneficial if not compulsory to assure success of software development projects, the investigations in practice reveal developers often avoid to follow prescribed methods and that there is a wide gap between the organizations’ official methods and the work actually performed by their developers in IT projects. According to the literature, there are many reasons contributing to this rather undesirable situation. The two of them are rigidity of methods and their social inappropriateness. In the MasterProc project we have addressed these issues by developing a framework and tool-support for the reengineering of software development methods. Using the framework an organisation can reengineer its existing ways of working into a method that is organisation-specific and auto-adjustable to specifics of its projects. The …", "num_citations": "18\n", "authors": ["373"]}
{"title": "Sampling promotes community structure in social and information networks\n", "abstract": " Any network studied in the literature is inevitably just a sampled representative of its real-world analogue. Additionally, network sampling is lately often applied to large networks to allow for their faster and more efficient analysis. Nevertheless, the changes in network structure introduced by sampling are still far from understood. In this paper, we study the presence of characteristic groups of nodes in sampled social and information networks. We consider different network sampling techniques including random node and link selection, network exploration and expansion. We first observe that the structure of social networks reveals densely linked groups like communities, while the structure of information networks is better described by modules of structurally equivalent nodes. However, despite these notable differences, the structure of sampled networks exhibits stronger characterization by community-like groups …", "num_citations": "17\n", "authors": ["373"]}
{"title": "Issues and challenges in business rule based information systems development\n", "abstract": " An explicit manipulation of business rules in information systems development (ISD) is an old domain. There were many attempts in the last two decades to define how the rules should be dealt with throughout the ISD activities. Despite many results that have been achieved, several questions regarding business rule manipulation within ISD remain unresolved and present challenges for future research. The objective of this paper is to discuss these challenges and where possible to point out some directions for potential solutions", "num_citations": "17\n", "authors": ["373"]}
{"title": "Unfolding network communities by combining defensive and offensive label propagation\n", "abstract": " Label propagation has proven to be a fast method for detecting communities in complex networks. Recent work has also improved the accuracy and stability of the basic algorithm, however, a general approach is still an open issue. We propose different label propagation algorithms that convey two unique strategies of community formation, namely, defensive preservation and offensive expansion of communities. Furthermore, the strategies are combined in an advanced label propagation algorithm that retains the advantages of both approaches; and are enhanced with hierarchical community extraction, prominent for the use on larger networks. The proposed algorithms were empirically evaluated on different benchmarks networks with planted partition and on over 30 real-world networks of various types and sizes. The results confirm the adequacy of the propositions and give promising grounds for future analysis of (large) complex networks. Nevertheless, the main contribution of this work is in showing that different types of networks (with different topological properties) favor different strategies of community formation.", "num_citations": "16\n", "authors": ["373"]}
{"title": "A framework and tool-support for reengineering software development methods\n", "abstract": " The purpose of the research described in this paper is to propose a framework and supporting tools that will help software companies to establish formalised methods that will be technically and socially sound with their needs. Following the framework the companies can asses and improve their existing ways of working, capture them into formalised methods and continuously enrich them based on the past development experiences. Furthermore, the formalised methods that are designed based on the suggested framework are flexible and can be automatically adjusted by the supporting tools to suite circumstances of a particular project or team. This paper describes the framework philosophy and its tool support.", "num_citations": "16\n", "authors": ["373"]}
{"title": "The Scenario for Constructing Flexible, People Focused Systems Development Methodologies\n", "abstract": " Systems development is a very complex process, which requires disciplined methodological approaches. While there are many arguments underpinning the use of systems development methodologies empirical investigations show that methodologies are underused in practice and what is more their use is not on the increase. In this paper we discuss the usage of agile methodologies which tend to be more people-focused and adaptable to project-specific circumstances. We believe that usage of such methodologies may encourage practitioners to rank the methodologies higher in terms of their contributions to successful development. In the paper we propose a scenario for development, introduction and maintenance of an agile methodology in an organisation.", "num_citations": "16\n", "authors": ["373"]}
{"title": "Empirical comparison of network sampling: How to choose the most appropriate method?\n", "abstract": " In the past few years, the storage and the analysis of large-scale and fast evolving networks presents a great challenge. Therefore, a number of different techniques have been proposed for sampling large networks. Studies on network sampling primarily analyze the changes of network properties under the sampling. In general, network exploration techniques approximate the original networks more accurate than random node and link selection. Yet, link selection with additional subgraph induction step outperforms most other techniques. In this paper, we apply subgraph induction also to random walk and forest-fire sampling and evaluate the effects of subgraph induction on the sampling accuracy. We analyze different real-world networks and the changes of their properties introduced by sampling. The results reveal that the techniques with subgraph induction improve the performance of techniques without …", "num_citations": "15\n", "authors": ["373"]}
{"title": "Method for selection of motor insurance fraud management system components based on business performance: Transporto priemonių draudimo apgavysčių valdymo sistemos komponentų …\n", "abstract": " Apgavystės transporto priemonių draudimo srityje lemia draudimo kompanijų nuostolius, kurie vertinami 100 milijardų dolerių per metus. Dėl to apgavysčių valdymo srityje atliekama nemažai tyrimų, tačiau daugumoje iš jų nagrinėjamos tik dalinės problemos ir daromos prielaidos, kad apgavysčių valdymo veiklos rūšys nepriklauso viena nuo kitos. Apgavysčių valdymo sistemų komponentų tyrimai retai tiesiogiai siejami su jų įtaka verslo veiklos efektyvumui. Tai lemia dažną problemą, kuri būdinga praktiniam apgavysčių valdymo sistemų naudojimui: tik nedaug draudimo kompanijų gali objektyviai įvertinti, kuris iš daugelio apgavysčiu valdymo sistemų komponentų, siūlomų tyrėjų ir pardavėjų, padėtu jiems išspręsti problemas, susijusias su apgavysčių valdymu. Darbe siūlomas metodas, kuris gali būti panaudotas kaip strateginė priemonė, skirta apgavysčių valdymo procesui patobulinti transporto priemonių …", "num_citations": "14\n", "authors": ["373"]}
{"title": "A tool for IT process construction\n", "abstract": " ContextThe field of IT processes lacks a scientifically-based tool that constructs organisation-specific IT processes according to the organisation’s socio-technical characteristics.ObjectiveIn this paper we propose a solution to this problem in the form of IT process engineering (ITPE). ITPE is based on established method engineering principles which we have adapted to IT process construction.MethodThe tool was demonstrated by having three organisations use ITPE to each construct two IT processes.ResultsITPE provided useful guidance in all three cases.ConclusionsThe study demonstrates that method engineering principles can be applied in research fields other than information system development.", "num_citations": "14\n", "authors": ["373"]}
{"title": "Sieve-based relation extraction of gene regulatory networks from biological literature\n", "abstract": " Relation extraction is an essential procedure in literature mining. It focuses on extracting semantic relations between parts of text, called mentions. Biomedical literature includes an enormous amount of textual descriptions of biological entities, their interactions and results of related experiments. To extract them in an explicit, computer readable format, these relations were at first extracted manually from databases. Manual curation was later replaced with automatic or semi-automatic tools with natural language processing capabilities. The current challenge is the development of information extraction procedures that can directly infer more complex relational structures, such as gene regulatory networks. We develop a computational approach for extraction of gene regulatory networks from textual data. Our method is designed as a sieve-based system and uses linear-chain conditional random fields and rules for relation extraction. With this method we successfully extracted the sporulation gene regulation network in the bacterium Bacillus subtilis for the information extraction challenge at the BioNLP 2013 conference. To enable extraction of distant relations using first-order models, we transform the data into skip-mention sequences. We infer multiple models, each of which is able to extract different relationship types. Following the shared task, we conducted additional analysis using different system settings that resulted in reducing the reconstruction error of bacterial sporulation network from 0.73 to 0.68, measured as the slot error rate between the predicted and the reference network. We observe that all relation extraction sieves contribute to the …", "num_citations": "13\n", "authors": ["373"]}
{"title": "Assessing the effectiveness of real-world network simplification\n", "abstract": " Many real-world networks are large, complex and thus hard to understand, analyze or visualize. Data about networks are not always complete, their structure may be hidden, or they may change quickly over time. Therefore, understanding how an incomplete system differs from a complete one is crucial. In this paper, we study the changes in networks submitted to simplification processes (i.e., reduction in size). We simplify 30 real-world networks using six simplification methods and analyze the similarity between the original and simplified networks based on the preservation of several properties, for example, degree distribution, clustering coefficient, betweenness centrality, density and degree mixing. We propose an approach for assessing the effectiveness of the simplification process to define the most appropriate size of simplified networks and to determine the method that preserves the most properties of …", "num_citations": "13\n", "authors": ["373"]}
{"title": "Architecture of standard-based, interoperable and extensible IoT platform\n", "abstract": " IoT Platform marketplace is gaining a lot of attention in many areas. The paper presents an interoperable and extensible IoT framework that follows oneM2M standard. The framework is validated by a reference implementation that includes automatic sensor recognition and pairing, NoSQL support, complex event processing and alarming and extensions for IoT devices communication over HTTP, WebSocket, CoAP, MQTT, Z-Wave, ZigBee and Bluetooth. The novelty includes the theoretical and practical solution to the proposed platform. Furthermore, we show the feasibility to build generally useful IoT platforms that are based on standards.", "num_citations": "12\n", "authors": ["373"]}
{"title": "Quantifying the consistency of scientific databases\n", "abstract": " Science is a social process with far-reaching impact on our modern society. In recent years, for the first time we are able to scientifically study the science itself. This is enabled by massive amounts of data on scientific publications that is increasingly becoming available. The data is contained in several databases such as Web of Science or PubMed, maintained by various public and private entities. Unfortunately, these databases are not always consistent, which considerably hinders this study. Relying on the powerful framework of complex networks, we conduct a systematic analysis of the consistency among six major scientific databases. We found that identifying a single \"best\" database is far from easy. Nevertheless, our results indicate appreciable differences in mutual consistency of different databases, which we interpret as recipes for future bibliometric studies.", "num_citations": "11\n", "authors": ["373"]}
{"title": "DMDSS: Data mining based decision support system to integrate data mining and decision support\n", "abstract": " Modern organizations use several types of decision support systems to facilitate decision support. In many cases OLAP based tools are used in the business area, which enable multiple views on data and through that a deductive approach to data analysis. Data mining extends the possibilities for decision support by discovering patterns and relationships hidden in data and therefore enabling the inductive approach of data analysis. The paper introduces data mining based decision support system, which was designed for business users to enable them to use data mining models to facilitate decision support with only a basic level of knowledge of data mining", "num_citations": "11\n", "authors": ["373"]}
{"title": "Discourse sense classification from scratch using focused rnns\n", "abstract": " The subtask of CoNLL 2016 Shared Task focuses on sense classification of multilingual shallow discourse relations. Existing systems rely heavily on external resources, hand-engineered features, patterns, and complex pipelines fine-tuned for the English language. In this paper we describe a different approach and system inspired by end-to-end training of deep neural networks. Its input consists of only sequences of tokens, which are processed by our novel focused RNNs layer, and followed by a dense neural network for classification. Neural networks implicitly learn latent features useful for discourse relation sense classification, make the approach almost language-agnostic and independent of prior linguistic knowledge. In the closed-track sense classification task our system achieved overall 0.5246 F1-measure on English blind dataset and achieved the new state-of-the-art of 0.7292 F1-measure on Chinese blind dataset.", "num_citations": "10\n", "authors": ["373"]}
{"title": "An architecture and stochastic method for database container placement in the edge-fog-cloud continuum\n", "abstract": " Databases as software components may be used to serve a variety of smart applications. Currently, the Internet of Things (IoT), Artificial Intelligence (AI) and Cloud technologies are used in the course of projects such as the Horizon 2020 EU-Korea DECENTER project in order to implement four smart applications in the domains of Smart Homes, Smart Cities, Smart Construction and Robot Logistics. In these smart applications the Big Data pipeline starts from various sensor and video streams to which AI and feature extraction methods are applied. The resulting information is stored in database containers, which have to be placed on Edge, Fog or Cloud infrastructures. The placement decision depends on complex application requirements, including Quality of Service (QoS) requirements. Information that must be considered when making placement decisions includes the expected workload, the list of candidate …", "num_citations": "9\n", "authors": ["373"]}
{"title": "Empirical comparison of network sampling techniques\n", "abstract": " In the past few years, the storage and analysis of large-scale and fast evolving networks present a great challenge. Therefore, a number of different techniques have been proposed for sampling large networks. In general, network exploration techniques approximate the original networks more accurately than random node and link selection. Yet, link selection with additional subgraph induction step outperforms most other techniques. In this paper, we apply subgraph induction also to random walk and forest-fire sampling. We analyze different real-world networks and the changes of their properties introduced by sampling. We compare several sampling techniques based on the match between the original networks and their sampled variants. The results reveal that the techniques with subgraph induction underestimate the degree and clustering distribution, while overestimate average degree and density of the original networks. Techniques without subgraph induction step exhibit exactly the opposite behavior. Hence, the performance of the sampling techniques from random selection category compared to network exploration sampling does not differ significantly, while clear differences exist between the techniques with subgraph induction step and the ones without it.", "num_citations": "9\n", "authors": ["373"]}
{"title": "SkipCor: Skip-mention coreference resolution using linear-chain conditional random fields\n", "abstract": " Coreference resolution tries to identify all expressions (called mentions) in observed text that refer to the same entity. Beside entity extraction and relation extraction, it represents one of the three complementary tasks in Information Extraction. In this paper we describe a novel coreference resolution system SkipCor that reformulates the problem as a sequence labeling task. None of the existing supervised, unsupervised, pairwise or sequence-based models are similar to our approach, which only uses linear-chain conditional random fields and supports high scalability with fast model training and inference, and a straightforward parallelization. We evaluate the proposed system against the ACE 2004, CoNLL 2012 and SemEval 2010 benchmark datasets. SkipCor clearly outperforms two baseline systems that detect coreferentiality using the same features as SkipCor. The obtained results are at least comparable to the current state-of-the-art in coreference resolution.", "num_citations": "9\n", "authors": ["373"]}
{"title": "Group extraction for real-world networks: The case of communities, modules, and hubs and spokes\n", "abstract": " Large real-world networks are often composed of characteristic groups of nodes with common linking pattern. Densely connected groups known as communities are perhaps the most well studied example with diverse applications in various fields. However, most real-world networks also contain other characteristic groups of nodes, while some parts of networks reveal no significant groups at all. To overcome the latter, Zhao et al. have recently proposed a community extraction criteria that explicitly guards against extracting groups that are not statistically significant. We extend their framework to arbitrary groups of nodes and propose a local group quality criteria W. Let S be a group of nodes and let T represent its linking pattern. Criteria W favors links between S and T, and penalizes links between S and TC, while disregarding links with both endpoints in SC. For this talk we consider groups with S= T that correspond to communities and groups with S∩ T=∅ denoted modules, with hub and spokes as a special case (for| T|= 1). We apply the extraction framework to the famous American football social network and a software network compiled from JUNG network analysis library (among others). Expectedly, communities explain almost 70% of the structure in the case of the social network, while other groups account for less than 5%(according to the number of links| L|). On the other hand, communities contain only≈ 12% of the links in the software network, whereas modules, and hubs and spokes, account for≈ 65% of the structure. All extracted groups well coincide with the ground truth and the literature.0 2 4 6 8 10 12# extracted groups", "num_citations": "9\n", "authors": ["373"]}
{"title": "Measuring and improving software development methodology value by considering technical and social suitability of its constituent elements\n", "abstract": " The theoretical research in the field of software development methodologies (SDM) shows that the use of SDM should improve the efficiency of the development team and the quality of the developed product. Interestingly, however, in practice not many software development organisations use SDM. In our paper, we present an evaluation model that provides a foundation for measuring SDM suitability on two dimensions: the SDM technical suitability for a given project and its social suitability for a given development team. Our work is based on two research areas, one socially oriented (diffusion and adoption of software process innovations) and the other technically oriented (situational method engineering). We believe that the model could be useful for software developing organisations, which want to improve their SDM.", "num_citations": "9\n", "authors": ["373"]}
{"title": "A software agent for social networks using natural language processing techniques\n", "abstract": " Machine-learning techniques are widely used in the computer processing of natural language. Software agents are programs that use machine learning and natural language processing to communicate with users and to perform certain tasks or provide specific information. This paper provides an overview of basic software agents and describes the implementation of an intelligent software agent for social network Facebook Finally, the results of the research propose potential improvements of implemented system.", "num_citations": "8\n", "authors": ["373"]}
{"title": "Extracting gene regulation networks using linear-chain conditional random fields and rules\n", "abstract": " Published literature in molecular genetics may collectively provide much information on gene regulation networks. Dedicated computational approaches are required to sip through large volumes of text and infer gene interactions. We propose a novel sieve-based relation extraction system that uses linear-chain conditional random fields and rules. Also, we introduce a new skip-mention data representation to enable distant relation extraction using first-order models. To account for a variety of relation types, multiple models are inferred. The system was applied to the BioNLP 2013 Gene Regulation Network Shared Task. Our approach was ranked first of five, with a slot error rate of 0.73.", "num_citations": "8\n", "authors": ["373"]}
{"title": "A new application model for mobile technologies\n", "abstract": " The information society demands higher and higher productivity from people, which they indeed can achieve by using services and access information in the state of mobility. Mobile applications represent new application models that enable information support in the state of mobility. First, we discuss mobile applications in the context of information society, define their scope and limitations. Then we introduce a classical mobile application model, context, context-awareness, and context-aware mobile application model. In order to show the potential of information support in the state of mobility, we then discuss types of mobile applications and emphasise the significance of workflow concept for mobile applications.", "num_citations": "8\n", "authors": ["373"]}
{"title": "Collective information extraction using first-order probabilistic models\n", "abstract": " Traditional information extraction (IE) tasks roughly consist of named-entity recognition, relation extraction and coreference resolution. Much work in this area focuses primarily on separate subtasks where best performance can be achieved only on specialized domains.", "num_citations": "7\n", "authors": ["373"]}
{"title": "Employing Semantic Web technologies in financial instruments trading\n", "abstract": " The lack of rapid approaches in ontology development led us to define Rapid Ontology Development (ROD) approach. The following approach includes the development process and constant evaluation of the steps in the process. The ROD approach was then applied to development of Financial Instruments and Trading Strategies (FITS) ontology. We pointed out that ontology development process does not conclude with successful definition of schematic part of ontology, but that developers should continue with post development activities where additional axiomatic information and instances with dynamic imports from various sources are defined. The result is executable ontology as part of Semantic Web application that can employ data from several data sources. The overall process of ontology development presented in this paper is suitable for users without extensive technical and programming skills.", "num_citations": "7\n", "authors": ["373"]}
{"title": "Traversal and relations discovery among business entities and people using semantic web technologies and trust management\n", "abstract": " There are several data silos containing information about business entities and people but are not semantically connected. If in integration process of data sources trust management is also employed than we can expect much higher success rate in relations discovery among entities. Majority of current mash-up approaches that deal with integration of information from several data sources omit or don ‘t fully address the aspect of trust. In this paper we discuss semantic integration of personal and business information from various data sources coupled with trust layer. The resulting system has higher and more deﬁned solidity while trust for single entity and also for data source is deﬁned. The case study presented in the paper focuses on integration of personal information from data sources mainly maintained by government authorities who have higher trustability than information from social networks, but we also include other less trusted sources. The developed SocioLeaks system allows users traversal and further relation discovery in a graph based manner.", "num_citations": "6\n", "authors": ["373"]}
{"title": "Generalized network community detection\n", "abstract": " Community structure is largely regarded as an intrinsic property of complex real-world networks. However, recent studies reveal that networks comprise even more sophisticated modules than classical cohesive communities. More precisely, real-world networks can also be naturally partitioned according to common patterns of connections between the nodes. Recently, a propagation based algorithm has been proposed for the detection of arbitrary network modules. We here advance the latter with a more adequate community modeling based on network clustering. The resulting algorithm is evaluated on various synthetic benchmark networks and random graphs. It is shown to be comparable to current state-of-the-art algorithms, however, in contrast to other approaches, it does not require some prior knowledge of the true community structure. To demonstrate its generality, we further employ the proposed algorithm for community detection in different unipartite and bipartite real-world networks, for generalized community detection and also predictive data clustering.", "num_citations": "6\n", "authors": ["373"]}
{"title": "Token-and constituent-based linear-chain crf with svm for named entity recognition\n", "abstract": " The amount of chemical information is rapidly growing in the scientific literature and all other sorts of free text documents. We here propose a novel system that uses different types of linear-chain conditional random fields models and combines their results using a support vector machine classifier. We introduce the constituent-based models, which are in contrast to traditional token-based approaches, trained using noun phrase (ie possible mention) sequences. Furthermore, we employ two types of sequence labelings. For the first type the labels consist of a full set of target classes and for the second they consist of only binary labels, which denote whether the current node represents a chemical entity mention or not. We applied the proposed algorithm to the CHEMDNER 2013 task and for this report we evaluated it on the training and development datasets.", "num_citations": "5\n", "authors": ["373"]}
{"title": "Network monitoring applications based on IoT system\n", "abstract": " We present applications for network monitoring based on intelligent communication platform that can also be used to support various usage scenarios related to future internet of things. Applications presented include real time DSL access line monitoring and IPTV monitoring, correlated with lightning reports. The solution is used in the field of proactive monitoring, enabling the operator's helpdesk and field technical teams to pinpoint the cause of service degradations.", "num_citations": "5\n", "authors": ["373"]}
{"title": "Information system due diligence data as an input for knowledge management\n", "abstract": " This paper presents a study on how to use a specific information system due diligence framework (ISDDF) to facilitate information system knowledge management. More specifically, the study demonstrates how to collect relevant and important data on the current state of the organization’s information system in an efficient way, and how these data can be useful in the initial phase of the information system knowledge management life cycle. General information system due diligence can be seen as an explanatory theory that helps the stakeholders to obtain detailed information on what, how, why, when, and where, all concerning the matters of their information system. In contrast, the initial information system due diligence only acts as a prediction theory that helps the stakeholders to get a high-level picture on the current and desired state of the information system. The article outlines definitions of due diligence, various information system due diligence types and briefly presents the ISDDF, which was founded in Slovenia several years ago for conducting information system due diligences in financial industry. With this framework information system due diligence can be conducted in a very short time frame in a small or large-sized organization. The paper presents the hypothesis that the ISDDF can be applied as a knowledge collection tool in knowledge management life cycle. In order to prove this hypothesis, general information system due diligence activities were carried out in two organizations. Moreover, the paper describes a case study of information system due diligence in the selected organization. Finally, the results of this case study are …", "num_citations": "5\n", "authors": ["373"]}
{"title": "Podatkovne baze nosql\n", "abstract": " Kratica NOSQL pomeni» Not Only SQL «in se jo pogosto povezuje z novo skupino podatkovnih baz, ki so se pojavile kot odgovor na težave, s katerimi se srečujemo pri uporabi relacijski baz podatkov.", "num_citations": "5\n", "authors": ["373"]}
{"title": "Merging data sources based on semantics, contexts and trust\n", "abstract": " RUL - Merging data sources based on semantics, contexts and trust Univerza v Ljubljani Repozitorij Univerze v Ljubljani Nacionalni portal odprte znanosti Odprta znanost DiKUL A- A+ slv | eng IskanjeBrskanjeNovo v RULKaj je RULV številkahPomočPrijava izpis_h1_title_alt Merging data sources based on semantics, contexts and trust Šubelj, Lovro (Avtor), Jelenc, David (Avtor), Zupančič, Eva (Avtor), Lavbič, Dejan (Avtor), Trček, Denis (Avtor), Krisper, Marjan (Avtor), Bajec, Marko (Avtor) URL URL - Predstavitvena datoteka, za dostop obiščite http://internetjournals.net/journals/tir/2011/January/Full%20Journal.pdf Povezava se odpre v novem oknu Jezik: Angleški jezik Ključne besede: zlivanje podatkov, semantični dvig podatkov, kontekst, obvladovanje zaupanja, odkrivanje entitet, odpravljanje redundance, merging data, semantic elevation, context, trust management, entity resolution, redundancy elimination Vrsta : (…", "num_citations": "5\n", "authors": ["373"]}
{"title": "Sense classification of shallow discourse relations with focused RNNs\n", "abstract": " Understanding the sense of discourse relations between segments of text is essential to truly comprehend any natural language text. Several automated approaches have been suggested, but all rely on external resources, linguistic feature engineering, and their processing pipelines are built from substantially different models. In this paper, we introduce a novel system for sense classification of shallow discourse relations (FR system) based on focused recurrent neural networks (RNNs). In contrast to existing systems, FR system consists of a single end-to-end trainable model for handling all types and senses of discourse relations, requires no feature engineering or external resources, is language-independent, and can be applied at the word and even character levels. At its core, we present our novel generalization of the focused RNNs layer, the first multi-dimensional RNN-attention mechanism for constructing text/argument embeddings. The filtering/gating RNN enables downstream RNNs to focus on different aspects of the input sequence and project it into several embedding subspaces. These argument embeddings are then used to perform sense classification. FR system has been evaluated using the official datasets and methodology of CoNLL 2016 Shared Task. It does not fall a lot behind state-of-the-art performance on English, the most researched and supported language, but it outperforms existing best systems by 2.5% overall results on the Chinese blind dataset.", "num_citations": "4\n", "authors": ["373"]}
{"title": "Smart contracts for container based video conferencing services: Architecture and implementation\n", "abstract": " Today, container-based virtualization is very popular due to the lightweight nature of containers and the ability to use them flexibly in various heterogeneously composed systems. This makes it possible to collaboratively develop services by sharing various types of resources, such as infrastructures, software and digitalized content. In this work, our home made video-conferencing (VC) system is used to study resource usage optimisation in business context. An application like this, does not provide monetization possibilities to all involved stakeholders including end users, cloud providers, software engineers and similar. Blockchain related technologies, such as Smart Contracts (SC) offer a possibility to address some of these needs. We introduce a novel architecture for monetization of added-value according to preferences of the stakeholders that participate in joint software service offers. The developed …", "num_citations": "4\n", "authors": ["373"]}
{"title": "General Context-Aware Data Matching and Merging Framework\n", "abstract": " Due to numerous public information sources and services, many methods to combine heterogeneous data were proposed recently. However, general end-to-end solutions are still rare, especially systems taking into account different context dimensions. Therefore, the techniques often prove insufficient or are limited to a certain domain. In this paper we briefly review and rigorously evaluate a general framework for data matching and merging. The framework employs collective entity resolution and redundancy elimination using three dimensions of context types. In order to achieve domain independent results, data is enriched with semantics and trust. However, the main contribution of the paper is evaluation on five public domain-incompatible datasets. Furthermore, we introduce additional attribute, relationship, semantic and trust metrics, which allow complete framework management. Besides overall results …", "num_citations": "4\n", "authors": ["373"]}
{"title": "Advanced Information Systems Engineering Workshops: CAiSE 2012 International Workshops, Gdańsk, Poland, June 25-26, 2012, Proceedings\n", "abstract": " This book constitutes the thoroughly refereed proceedings of eight international workshops held in Gdańsk, Poland, in conjunction with the 24th International Conference on Advanced Information Systems Engineering, CAiSE 2012, in June 2012. The 35 full and 17 short revised papers were carefully selected from 104 submissions. The eight workshops were Agility of Enterprise Systems (AgilES), Business/IT Alignment and Interoperability (BUSITAL), Enterprise and Organizational Modeling and Simulation (EOMAS), Governance, Risk and Compliance (GRCIS), Human-Centric Process-Aware Information Systems (HC-PAIS), System and Software Architectures (IWSSA), Ontology, Models, Conceptualization and Epistemology in Social, Artificial and Natural Systems (ONTOSE), and Information Systems Security Engineering (WISSE).", "num_citations": "4\n", "authors": ["373"]}
{"title": "Clustering assortativity, communities and functional modules in real-world networks\n", "abstract": " Complex networks of real-world systems are believed to be controlled by common phenomena, producing structures far from regular or random. Clustering, community structure and assortative mixing by degree are perhaps among most prominent examples of the latter. Although generally accepted for social networks, these properties only partially explain the structure of other networks. We first show that degree-corrected clustering is in contrast to standard definition highly assortative. Yet interesting on its own, we further note that non-social networks contain connected regions with very low clustering. Hence, the structure of real-world networks is beyond communities. We here investigate the concept of functional modules---groups of regularly equivalent nodes---and show that such structures could explain for the properties observed in non-social networks. Real-world networks might be composed of functional modules that are overlaid by communities. We support the latter by proposing a simple network model that generates scale-free small-world networks with tunable clustering and degree mixing. Model has a natural interpretation in many real-world networks, while it also gives insights into an adequate community extraction framework. We also present an algorithm for detection of arbitrary structural modules without any prior knowledge. Algorithm is shown to be superior to state-of-the-art, while application to real-world networks reveals well supported composites of different structural modules that are consistent with the underlying systems. Clear functional modules are identified in all types of networks including social. Our findings thus …", "num_citations": "4\n", "authors": ["373"]}
{"title": "Celovit pristop za izvedbo skrbnega pregleda informacijskega sistema\n", "abstract": " Telekom Slovenije, dd Nadgradnja E-Arhiva izhodnih računov Page 1 redni mesečni sestanek slovenskega odseka ISACA Celovit pristop za izvedbo skrbnega pregleda informacijskega sistema Boštjan DELAK Ljubljana, 4. december 2012 3_ISACA_20121204 Page 2 Predstavitev predavatelja dr. Boštjan Delak, CISA, CIS, preizkušeni revizor IS, samostojni svetovalec ITAD, Revizija in svetovanje doo (www.itad.si) (www.suvi.si) e-pošta: bostjan.delak@itad.si 3_ISACA_20121204 4.12.2012 2 Page 3 Namesto uvoda Pregled ✓Sistematski zdravniški pregled, ✓Managerski zdravniški pregled, ✓Specialistični zdravniški pregled (okulist, zobozdravnik, …) ✓Tehnični pregled avtomobila, ✓Dimnika, ✓Plinskih naprav, ✓… ✓JEK, ✓…. ✓Kaj pa pregled informacijskega sistema (IS)? 3_ISACA_20121204 4.12.2012 3 Page 4 Namesto uvoda – AJPES statistika Poslovni subjekti v Republiki Sloveniji, stanje na dan 30.9.2012 Vir…", "num_citations": "4\n", "authors": ["373"]}
{"title": "Enterprise modelling with UML\n", "abstract": " Making effective project selection decisions in an enterprise requires a clear idea of where the enterprise is in the current state, what its vision for the future is, and how to make a transition to its desired future state possible. A strategic plan is a document that encompasses this information and is produced as an output of corporate strategic planning. In this paper we examine business modelling as an integral part of strategic planning, where models of a current and future enterprise are developed and refined. The question that we address in this regard is, whether the unified modelling language (UML) notation, the today’s defacto standard in engineering modelling, can serve as an appropriate language for enterprise modelling, in particular for corporate strategic planning. In the paper we discuss types of models that are usually used in strategic planning to describe the enterprise from different perspectives and suggest some extensions to the UML notation to make it more suitable for this purpose.", "num_citations": "4\n", "authors": ["373"]}
{"title": "Reconstructing de facto software development methods\n", "abstract": " Software development is a complex process that requires disciplined engineering approaches. Empirical studies show that companies still don’t document their development practice, or if they do, these are not up-to-date and do not reflect how they really develop software. The main objective of this paper is to propose an approach that can help companies in documenting their real development practice. Comparing to existing approaches that require substantial effort on the side of project members, our approach extracts information on development practice directly from software repositories. Five companies have been studied to identify information that can be retrieved from software repositories. Based on this, an approach to reconstruct development practice has been developed. The approach has been evaluated on a real software repository shared by an additional company. The results confirm that software repository information suffice for the reconstruction of various aspects of development process, i.e. disciplines, activities, roles, and artifacts.", "num_citations": "3\n", "authors": ["373"]}
{"title": "Novelties within the framework for information system due diligence\n", "abstract": " The information system (IS) field lacks a scientifically based analytical tool for rapid delivery of IS due diligence. In 2013, a framework for IS due diligence (FISDD) was published. The work on this framework was continued with proceeding development and evaluation. One of the most important objectives of today’s business is making savings concerning various resources. The main novelty of the upgraded framework is the replacement of some of the manually conducted questionnaires with web-based questionnaires. This novelty reduces the total time required for on-site ISDD activities by 35–50%, as has been the result of several real cases. The results demonstrate and confirm the usefulness of upgrading FISDD, which increases its efficiency in DD processes, which is the main contribution of this article.", "num_citations": "3\n", "authors": ["373"]}
{"title": "Advanced Information Systems Engineering: 28th International Conference, CAiSE 2016, Ljubljana, Slovenia, June 13-17, 2016. Proceedings\n", "abstract": " This book constitutes the proceedings of the 28th International Conference on Advanced Information Systems Engineering, CAiSE 2016, held in Ljubljana, Slovenia, in June 2016. The 35 papers presented in this volume were carefully reviewed and selected from 211 submissions. The program included the following paper sessions: Collaboration, Business Process Modeling. Innovation, Gamication, Mining and Business Process Performance, Requirements Engineering, Process Mining, Conceptual Modeling, Mining and Decision Support, Cloud and Services, Variability and Configuration, Open Source Software, and Business Process Management.", "num_citations": "3\n", "authors": ["373"]}
{"title": "Comparison of software repositories for their usability in software process reconstruction\n", "abstract": " Software development process is like any other business process composed of activities carried out by process participants in order to achieve a certain goal. In contrast to a typical business process that is relatively deterministic and thus repeatable, software processes are much more dynamic in nature and dependent on a number of circumstances. This explains why actual software development practice in organizations defer from what these organizations prescribe within their adopted software development methods. The research that is reported in this paper aims at analyzing the suitability of software repositories to support de facto software process reconstruction. We examine most common utility tools that are used in software development and analyze the information they capture (we do that for a number of open source and commercial projects). We than suggest what would be a reasonable level of documentation for a software process so that this information would adequately facilitate project managers and developers at their work. Finally, based on our findings, we provide guidelines on how organizations should use software repositories to support the process reconstruction.", "num_citations": "3\n", "authors": ["373"]}
{"title": "The adoption of method engineering principles for the creation of organization specific IT processes\n", "abstract": " This article presents the idea of introducing method engineering concepts into the field of IT process construction. This field lacks of scientifically based systematic approach for IT process construction. Many important decisions about the structure of IT process are made according to the IT process consultant’s personal experience and subjective opinion. In this paper we propose a predefined approach for IT process construction which is based on the (scientifically) established method engineering principles and adapted to IT process construction specifics.", "num_citations": "3\n", "authors": ["373"]}
{"title": "Agent oriented approach for integration of BI systems\n", "abstract": " Decision support in enterprises is gaining its importance in the age of Internet and e-business. While dealing with the need for fast response in the dynamic competitive environments and rapid increase of information available on various networks we propose multi-agent system approach to backend decision support. Research case study presented in the paper is from the domain of mobile communications with system's main goal of delivering right information at the right time to the right users. We integrate several BI systems such as data mining and data warehousing with information available on the Internet. Ontologies are used to store derived knowledge, to support knowledge exchange between our MAS and other systems, to support agent-to-agent communication and enable seamless extending of MAS capabilities.", "num_citations": "3\n", "authors": ["373"]}
{"title": "Software development methodology evaluation model\n", "abstract": " In the paper we present software development methodology evaluation model that helps a software development company to find out what is the most suitable methodology for its needs. The purpose of the evaluation model is not to prescribe the use of a certain methodology, but merely to suggest what kind of methodology is suitable for a certain type of organization or project. In the paper we discuss requirements and guidelines for the evaluation model, and design and function of the model.", "num_citations": "3\n", "authors": ["373"]}
{"title": "Who reads and who cites? unveiling author citation dynamics by modeling citation networks\n", "abstract": " Networks are the simplest representation of complex systems of interacting parts. Despite seemingly plain form real-world networks reveal characteristic structural properties that are absent from regular or random systems. Scale-free degree distributions, small-world structure (ie, high clustering and short paths), degree mixing (ie, degree correlations at links’ ends) and communities (ie, densely linked groups) are perhaps the most widely analyzed properties in the literature. Note that communities imply assortative (ie, positively correlated) mixing by degree that is most notably pronounced in social networks. The above are also the properties captured by many random graph models [1]. However, non-social networks greatly deviate from this picture. Biological and technological networks are in fact degree disassortative (ie, negatively correlated), while different information networks often reveal no clear degree mixing and lower clustering (eg, citation networks). We here present an evolving random graph model denoted Citation model [4, 3]. Each newly added node explores the network using the burning process of [1], while links of the visited nodes are copied independently of the latter (Fig. 1). The model generates scale-free networks with arbitrary degree mixing and clustering, and very well reproduces the structure of over 60 years of Web of Science data (Fig. 2). The model also has a natural interpretation for citation networks. The process imitates an author of a paper including references into bibliography (ie, citation dynamics). Author first reads a related paper, or selects the paper that triggered the research, and cites it and/or some of its …", "num_citations": "3\n", "authors": ["373"]}
{"title": "nutIE—A modern open source natural language processing toolkit\n", "abstract": " Nowadays, there are many tools and applications available that use novel machine learning algorithms, but only few tools exist that bridge the gap between the computer scientists and general public. The latter especially holds for the field of natural language processing. Therefore in this paper we present a new information extraction toolkit, called nutIE, that offers a frontend for end-to-end text analysis using a modern javascript-based web application. The core of the toolkit includes all the high-level information extraction techniques with supporting preprocessing and evaluation methods. All these can be accessed by a Scala programmatic API or an arbitrary third-party application via REST interface. It has already been shown that the integrated toolkit's algorithms achieve state-of-the art results. The toolkit is currently applied at international text processing projects and courses.", "num_citations": "2\n", "authors": ["373"]}
{"title": "Logmap+: Relational data enrichment and linked data resources matching\n", "abstract": " Relational database to ontology mapping and ontology matching techniques are mostly addressed separately, even though it is known that the real power of semantic data lies in data interconnection. The latter is especially important when designing a new ontology, which often includes at least some of the concepts that already exist in the linked open data cloud. Thus, in this paper we describe a new end-to-end tool LogMap+ for transformation of relational data into an ontology and matching it against a pre-existent semantic source. Apart from offering the efficient web-based application, the main contributions are the improvements of the domain specific LogMap system. We evaluate our general tool against OAEI 2014 challenge datasets and achieve comparable results to the top performing algorithms and also outperform the domain specific LogMap tool.", "num_citations": "2\n", "authors": ["373"]}
{"title": "Comparison of software repositories for their usability in software process reconstruction\n", "abstract": " Software development process is like any other business process composed of activities carried out by process participants in order to achieve a certain goal. In contrast to a typical business process that is relatively deterministic and thus repeatable, software processes are much more dynamic in nature and dependent on a number of circumstances. This explains why actual software development practice in organizations defer from what these organizations prescribe within their adopted software development methods. The research that is reported in this paper aims at analyzing the suitability of software repositories to support de facto software process reconstruction. We examine most common utility tools that are used in software development and analyze the information they capture (we do that for a number of open source and commercial projects). We than suggest what would be a reasonable level of …", "num_citations": "2\n", "authors": ["373"]}
{"title": "Analiza kompleksnih omrezij: osnovni pojmi in primeri uporabe v praksi\n", "abstract": " Predvsem z razmahom svetovnega spleta, druzabnih omrezij in drugih oblik sporocanja so se v zadnjih letih zacele pojavljati bogate podatkovne zbirke, ki poleg osnovnih lastnosti o posameznikih hranijo tudi razlicne vrste relacij med njimi. Relacije med entitetami navadno skrivajo veliko kolicino informacij, in tako razkrivajo kompleksne lastnosti, ki bi sicer pogosto ostale neodkrite. S preucevanjem relacij med entitetami se ukvarja analiza omrezij, ki trenutno velja za eno najbolj aktualnih podrocij v analizi podatkov. V prispevku najprej predstavimo osnovne pojme analize omrezij, ter izpostavimo vidnejše dosezke in odkritja iz preteklih let. V nadaljevanju nato predstavimo izbrane primere uporabe ter podamo nekatere moznosti uporabe v javni upravi.", "num_citations": "2\n", "authors": ["373"]}
{"title": "A method for rapid creation of a virtual software development team\n", "abstract": " Companies dealing with software development are often facing problems related to cadre as a consequence of rapid technology changes and varying project requirements. Frequently, when a new project is commenced additional workforce is required, but after the project is finished these additional employees are not needed anymore. Possible solution for the problem is formation of a virtual development team. Use of virtual development teams in the field of software development is a well established practice. However, such teams are usually assembled for longer periods and their members are relatively permanent. The goal of our research is to create methodological approach that would enable a software development company to rapidly start an ad hoc virtual team when needed. Members of such team would be only temporary and their tasks relatively simple and independent. In our opinion, such …", "num_citations": "2\n", "authors": ["373"]}
{"title": "On the Application of the ISD Method Engineering Approach in Non-ISD Domains\n", "abstract": " Situational method engineering (SME) is concerned with the design, construction, and evaluation of methods that are aimed at the development of particular software products in well-defined development situations. The SME approach features characteristics such as flexibility, adaptability, modularity, reusability, and reference to situational aspects. These aspects may not only be useful for the engineering of software but also for the engineering of work systems, organizational structures, or enterprises. This paper therefore presents exemplary applications of the SME approach in domains that are different from software engineering. It furthermore discusses potentials and limitations of the transfer and application of SME principles, concepts, and techniques to those subject areas.", "num_citations": "2\n", "authors": ["373"]}
{"title": "What coins the bitcoin? Exploratory analysis of bitcoin market value by network group discovery\n", "abstract": " Bitcoin is a peer-to-peer digital currencies that gained tremendous popularity in recent years. Daily market trade currently exceeds 100000 BTC (over 50 million USD) with≈ 70000 processed transactions. It relies on a network of computers that solve complex mathematical problems as a part of a process that verifies and permanently records every transaction made. Unlike traditional currencies, no central authority governs the supply or has control over bitcoins. The bitcoin market value thus depends solely on people’s confidence or trust in it, similar to other real-world commodities and assets. Consequently, little is known about the trading behavior on exchange markets and their periodic or mutual dynamics. We thus here report the results of a preliminary exploratory analysis of bitcoin market value from a popular exchange market BitStamp. We collect the data for a period of five days in January 2014 at a rate of about one minute and construct different network representation of the time series. In particular, we consider proximity networks including cycle [1] and correlation [2] networks, transition networks [3] and visibility graphs [4](see Fig. 1). Cycle network has a grid-like structure with uniform degree distribution and high clustering. On the contrary, the transition network reveals very sparse topology with bell-shaped degree distribution and no pronounced degree correlations. Correlation network and visibility graph are scale-free and small-world with assortative mixing by degree, otherwise a characteristic of social networks. Next, we apply a node group discovery approach to constructed networks in order to gain an insight into the their structure …", "num_citations": "2\n", "authors": ["373"]}
{"title": "A Framework for Reengineering Software Development Methods\n", "abstract": " Empirical investigations clearly show that in contrast to the theory which implies that the use of methods in software development is beneficial, their use in practice is actually very low. Several reasons have been identified recently as contributing to this rather paradoxical situation. Most importantly: the socio-technical inappropriateness of a prescribed method to the company's actual ways of working, and the rigidity, i.e. inability of a prescribed method to be adapted to a particular problem. In this paper, we present a framework that deals with these issues. Its purpose is to help software development companies to reengineer their software development processes by establishing formalized and flexible methods based on the actual ways of working in that companies. The framework has been developed in cooperation with software development companies.", "num_citations": "2\n", "authors": ["373"]}
{"title": "Pravila na semantičnem spletu\n", "abstract": " RUL - Pravila na semantičnem spletu Univerza v Ljubljani Repozitorij Univerze v Ljubljani Nacionalni portal odprte znanosti Odprta znanost DiKUL A- A+ slv | eng IskanjeBrskanjeNovo v RULKaj je RULV številkahPomočPrijava izpis_h1_title_alt Pravila na semantičnem spletu Lavbič, Dejan (Avtor), Bajec, Marko (Avtor), Krisper, Marjan (Avtor) URL URL - Predstavitvena datoteka, za dostop obiščite http://www.dlib.si/details/URN:NBN:SI:DOC-EVSBHBDX Povezava se odpre v novem oknu Jezik: Slovenski jezik Ključne besede: semantični splet, pravila, RuleML, SWRL Vrsta gradiva: Delo ni kategorizirano (r6) Tipologija: 1.01 - Izvirni znanstveni članek Organizacija: FRI - Fakulteta za računalništvo in informatiko Leto izida: 2006 Založnik: Elektrotehniška zveza Slovenije Št. strani: str. [249]-254 Številčenje: Letn. 73, št. 5 UDK: 004 ISSN pri članku: 0013-5852 COBISS.SI-ID: 5690452 Povezava se odpre v novem oknu : : : -.…", "num_citations": "2\n", "authors": ["373"]}
{"title": "Scenarios for improvement of software development methodologies\n", "abstract": " In recent years many initiatives to improve a use of formal software development methodologies (SDM) in organisations have been commenced, nevertheless not many successful. Different studies show that many software development organisations do not own a formal SDM, and only a fraction of organisations that own a formal SDM actually follow it [2, 5, 13, 14].", "num_citations": "2\n", "authors": ["373"]}
{"title": "Scenarij za načrtovanje, uvedbo in uporabo agilnih metodologij razvoja informacijskih sistemov\n", "abstract": " Razvoj programske opreme je kompleksen proces, ki zahteva disciplinirane metodološke pristope. Čeprav obstajajo številni argumenti v prid uporabi metodologij, empirične raziskave kažejo, da se te v praksi redko uporabljajo, in kar je še pomembneje, njihova uporaba ne narašča. Pogosto se pokaže, da sta za to krivi togost metodologij in neupoštevanje socioloških dejavnikov. V prispevku opišemo pojavitev agilnih metodologij kot pristopa, ki utegne dvigniti uporabo metodologij v praksi. Jedro prispevka je scenarij za načrtovanje, uvedbo in uporabo agilnih metodologij, ki smo ga razvili na osnovi izkušenj pri uvajanju agilnih pristopov v praksi..Abstract", "num_citations": "2\n", "authors": ["373"]}
{"title": "Določitev metodologije za razvojne projekte informacijskih sistemov v državni upravi na podlagi metodologije EMRIS\n", "abstract": " V letošnjem letu je EMRIS je kot metodologija razvoja informacijskih sistemov v okviru državne uprave doživel drugo izdajo. Druga izdaja je rezultat skrbništva EMRIS, katerega naloga kot stalnega procesa je stalno posodabljanje metodologije v skladu z najnovejšimi strokovnoznanstvenimi dosežki na področju metodologij razvoja informacijskih sistemov. Med ostalimi cilji je bil glavni cilj za drugo izdajo prilagoditev metodologije za podporo razvoju informacijskih sistemov za elektronsko poslovanje.Prispevek ima dva glavna cilja. Prvi cilj je predstaviti novosti, ki jih z drugo izdajo prinaša metodologija EMRIS na področju strateškega planiranja in strukturnega razvoja. Za področje strateškega planiranja bosta med drugim tako predstavljena model povezovanja in model uporabe mobilnih aplikacij, predstavljen pa bo tudi odločitveni model za določitev prioritet projektov. Za področje strukturnega razvoja pa bo poudarek na predstavitvi faze načrtovanja kot sestavnega dela razvoja informacijskega sistema.", "num_citations": "2\n", "authors": ["373"]}
{"title": "Izbrana načela agilnega načrtovanja\n", "abstract": " Eden številnih pristopov k razvoju informacijskih rešitev, ki temelji na iterativnem razvojnem modelu, je agilni pristop. Njegova posebnost v primerjavi z drugimi pristopi je v poudarku, ki jo pristop namenja zagotovitvi prilagodljivosti. Prispevek predstavlja pet izbranih načel agilnega načrtovanja, s pomočjo katerih je moč zagotoviti prilagodljivost načrta ter se v dobri meri izogniti tipičnim pomanjkljivostim načrtovanja.Abstract", "num_citations": "2\n", "authors": ["373"]}
{"title": "Management systems in the classroom\n", "abstract": " Improving education is a prominent theme in many countries and, in the drive to raise standards, increasing quantities of data about pupils’ attainment and progress is being generated. These data, collected at many levels in the educational system, provide a means to both monitor the performance of individual schools and to ‘benchmark’ and set targets at local and national levels.", "num_citations": "2\n", "authors": ["373"]}
{"title": "IS Strategic plan for the University of Ljubljana: Experiences and Results\n", "abstract": " University of Ljubljana the largest Slovenian university now facing organizational and legislation changes which affect founding rules and procedure. Present information system does not enable the information support needed to implement the changes. The project “Strategic plan of the development of information system at the University of Ljubljana” has been founded in order to define the plan for information system reengineering and renovation. The paper introduces the project mentioned and its results.", "num_citations": "2\n", "authors": ["373"]}
{"title": "Using Data Warehouses in University Information Systems\n", "abstract": " In this paper we first briefly describe a data warehouse concept in general. We discuss the benefits of using it, trying to point out that data warehousing is important, not only in business enterprises, but in the university environment as well. Next we present a case study of using a data warehouse to enhance an existing information system, which handles admissions to university. Activities that are carried out within the admission process insert and use data from the operational database, which is then re-created every scholastic year. Instead of linking all databases together to perform a complex analysis, we could use a data warehouse, loaded with complete data set. Many advantages could be achieved with such an approach.", "num_citations": "2\n", "authors": ["373"]}
{"title": "A Smart and Safe Construction Application Design for Fog Computing\n", "abstract": " Many emerging smart applications use sensor data, which are integrated by using various Big Data platforms. Such smart applications must address several requirements including high Quality of Service, privacy and security. Emerging fog computing technologies may provide some new possibilities to address these requirements through the design of multi-tier, container-based applications. In this work, we present the design of a smart application for the domain of civil engineering, which is currently undergoing testing and evaluation.", "num_citations": "1\n", "authors": ["373"]}
{"title": "Smart City as a Platform-Based Ecosystem\n", "abstract": " While for a smart city there is no generally accepted definition, there exists a wide consensus of what a smart city (or country) should bring to its citizens. It is believed that it such smart environment, all required conditions are met for a quality of life of individuals and communities and for sustainable economic growth. In most circumstances, this is associated with the availability of health and social security, the ease of use of public services, efficient mobility, security, job and business opportunities etc. How to achieve that remains a challenge of the 21st century. In this paper, we describe a program of R&D projects that were launched in late 2016 within the Slovenian Smart Specialization initiative as a response to the aforementioned challenge.", "num_citations": "1\n", "authors": ["373"]}
{"title": "Iterative joint extraction of entities, relationships and coreferences from text sources\n", "abstract": " Machine understanding of textual documents has been challenging since the early computer era. Since the information extraction research field emerged it has inferred multiple natural language processing tasks, such as named entities recognition, relationships extraction and coreference resolution. Even though for the purpose of the end-to-end information extraction all of the three tasks are crucial, existing work has been focusing merely on one specific task at the time or at best on their connection in a pipeline. In this paper we introduce a novel iterative and joint information extraction system that interconnects all the three tasks together using iterative feature functions which use the advantage of the intermediate extractions. Furthermore, we introduce a special transformation of data into skip-mention sequences to enable the extraction of relations and coreferences using fast first-order graphical models …", "num_citations": "1\n", "authors": ["373"]}
{"title": "Text mining in medicine\n", "abstract": " Many medical applications and current ongoing medical research depend on text mining techniques. It is estimated that 90 % of all data is unstructured, such as emails, voice or video records, data streams, and Word documents. In the last decade, the estimated growth of unstructured data is about 62 %, whereas the amount of structured data has grown only by 22 %. In this chapter we therefore overview some methods and tools that enable researchers to automatically retrieve, extract, and integrate unstructured medical data. Due to increasing number of unstructured documents, the automatic text mining methods ease access to relevant data, already conducted research along with its results, and save money by trying to eliminate repeated research experiments. Natural language processing is lately receiving a lot of attention because researchers are trying to adapt techniques from other domains to work on …", "num_citations": "1\n", "authors": ["373"]}
{"title": "LASTNOSTI VELIKIH REALNIH OMREŽIJ IN PRIMERI UPORABE\n", "abstract": " V zadnjih letih so postala omrežja izjemno popularna, saj predstavljajo močno orodje za predstavitev in analizo kompleksnih sistemov, sestavljenih iz velikega števila med seboj povezanih komponent. Takšne sisteme najdemo tako v realnem kot navideznem svetu, v naravi in tehnologiji, in so trenutno predmet številnih analiz in študij. Teorija omrežij je v preteklosti ponudila že številna pomembna spoznanja kot na primer fenomen majhnega sveta, odpornost tehnoloških omrežij in obstoj komun v socialnih omrežjih. Poleg slednjega pa je omogočila razlago različnih dinamičnih procesov kot na primer gibanje ljudi v družbi, navigacija po svetovnem spletu ali pa nadzor v kompleksnih bioloških sistemih. Primere analize omrežij tako najdemo v biologiji, družbenih znanostih, ekonomiji, računalništvu in informatiki, ter še na številnih drugih področjih. Kljub zgornjemu pa je uporaba teorije omrežij še vedno v veliki meri omejena zgolj na akademske kroge. V prispevku zato predstavimo osnovne lastnosti velikih omrežij ter podamo nekatere zanimivejše primere uporabe.", "num_citations": "1\n", "authors": ["373"]}
{"title": "Rapid development of executable ontology for financial instruments and trading strategies\n", "abstract": " In this paper we employ Rapid Ontology Development approach (ROD) with constant evaluation of steps in the process of ontology construction for development of Financial Instruments and Trading Strategies (FITS) ontology. We show that ontology development process does not conclude with successful definition of schematic part of ontology but we continue with post development activities where additional axiomatic information and instances with dynamic imports from various sources are defined. The result is executable ontology as part of Semantic Web application that uses data from several semi structured sources. The overall process of construction is suitable for users without extensive technical and programming skills and those users are rather experts in the problem domain.", "num_citations": "1\n", "authors": ["373"]}
{"title": "Application of method engineering principles in practice: Lessons learned and prospects for the future\n", "abstract": " It seems that in IT sector we are all aware that for the development of non-trivial software the use of software methods is very important. They provides as with knowledge and guidance for the development process which otherwise might become too chaotic and out of control. It has been empirically proven that software development companies which have successfully established their software processes are more efficient, produce software of higher quality and have shorter time-to-market period; specifically if they are able to adapt their ways of working to specifics of a particular project.", "num_citations": "1\n", "authors": ["373"]}
{"title": "Sistem za avtomatsko detekcijo goljufij pri elektronskem poslovanju\n", "abstract": " V času elektronskega poslovanja in pojava poslovnih modelov deljenja dobička (ang. revenue sharing) goljufije postajajo pereč problem. Zaradi goljufije klikanja na oglase podjetje Google izgubi več kot milijardo dolarjev na leto, saj je od 10 do 15 odstotkov klikov na njihove oglase goljufivih. Proti goljufijam se lahko uspešno borimo le z uporabo učinkovitih sistemov za detekcijo goljufij. Kot vsako področje ima tudi področje detekcije goljufij določene posebnosti, ki jih moramo pri graditvi takih sistemov upoštevati, če želimo biti uspešni. Specifike je mogoče strniti v šest razredov: specifike podatkov, problem ocenjevanja uspešnosti detekcije, problem razlage sklepanja, problem kombiniranja več metod, zahteva po adaptivnosti in zahteva po zmogljivosti. Članek poda predlog zasnove sistema za detekcijo goljufij in skozi opis statičnega in dinamičnega vidika tega sistema pojasni, kako le-ta uspešno naslovi omenjene specifike. Statični vidik sistema predstavljata opisa strukture jedra za detekcijo goljufij, ki izvaja samo detekcijo goljufij, in strukture celotnega sistema, ki poleg jedra za detekcijo goljufij vsebuje tudi podatke ter uporabniški vmesnik. Dinamični vidik zajema dva pomembna procesa, ki ju mora sistem podpreti. To sta proces detekcije in razreševanja goljufij ter proces učenja in izboljšave sistema.", "num_citations": "1\n", "authors": ["373"]}
{"title": "Vpliv MDA na proces razvoja programske opreme\n", "abstract": " Organizacija Object Management Group (OMG) je sredi lanskega leta predstavila prvo različico specifikacije arhitekture za razvoj programske opreme na podlagi modelov-Model driven architecture (MDA). Bistvo MDA je dvig nivoja abstrakcije, na katerem nastaja programska oprema, česar posledica so tudi pomembne spremembe v procesu razvoja programske opreme. V začetku prispevka je na kratko predstavljen standard MDA, v nadaljevanju pa se posvetimo predvsem vplivu MDA na proces razvoja programske opreme.", "num_citations": "1\n", "authors": ["373"]}
{"title": "Tracking Business Rule Evolution to Support Is Maintenance.\n", "abstract": " Business rules are an important business category as they describe how enterprises are doing business. Their ability to make applications flexible and amendable to change makes them attractive also within the information system domain. In the paper we argue that if business rules are tracked from their source to their implementation this can help in IS maintenance. We introduce the business rule management scenario for managing business rules in enterprises. The scenario advocates using business rule management as an interface between business modelling and IS development and maintenance.", "num_citations": "1\n", "authors": ["373"]}