{"title": "Implementing an ITIL-based IT service management measurement system\n", "abstract": " The IT Infrastructure Library (ITIL) provides guidelines for IT service providers how to design, manage and support IT services. ITIL is the most widely used IT service management framework. It consists of best practices that can be used in implementing, for example service support processes, such as incident management and problem management. Although ITIL includes a wide list of process metrics, it does not provide sufficient information how IT service management process measurements should be done in practice. The research problem in this paper is how the measurement of the IT service support processes can be improved? In this paper, an ITIL-based IT service management measurement system (ITSM-MS) and its implementation project are presented. The ITSM-MS can be used to measure the performance of IT service support processes. The ITSM-MS was developed in cooperation between MaISSI …", "num_citations": "65\n", "authors": ["98"]}
{"title": "Service-oriented software engineering (SOSE) framework\n", "abstract": " The gap between business decision making and software engineering causes inefficiency and quality problems in software development. Software engineers do not understand organization's value creation objectives and their influence on software production and structure. For this reason software does not fulfill the requirements of business and software quality is inadequate too often. The objective of the authors in the service-oriented software engineering project (SOSE) is to develop methods and tools to improve quality and profitability of software development. In this paper the authors described SOSE framework and clarify with examples its phases, utility, and application in pilot projects. SOSE framework's first activity is to create a well-defined business case. Then, business processes and data concepts are identified, to meet business requirements of the business case, and modelled with informal diagrams …", "num_citations": "46\n", "authors": ["98"]}
{"title": "Proactive management of IT operations to improve IT services\n", "abstract": " IT Service Operations is a high priority improvement target for IT service providers because it is critical for business operations and involves daily interaction with customers, thus directly effecting customer satisfaction. An action research project involving three organizations explored current IT service operation activities and challenges and initiated projects to improve service operation at each organization. The findings indicate that the major challenges include reactive rather than proactive approach to IT operations management, measurement and reporting, classification of incidents, management of customer feedback, and interfaces between IT service operation processes. Recommendations are formulated to help IT service managers and theoretical contributions are provided.", "num_citations": "36\n", "authors": ["98"]}
{"title": "Challenges and problems in release management process: A case study\n", "abstract": " The IT Infrastructure Library (ITIL) is the most widely used IT service management framework and a de facto standard. ITIL provides instructions for IT service providers and organizations how to design, manage and support IT services. However, adopting best practices of ITIL can be difficult for many IT companies. The main contribution of this paper is to present challenges and problems that were identified during a case study focusing on improvement of the release management process. Key challenges included the lack of process description, too high release distribution rate, and poor traceability between incident records and release records.", "num_citations": "31\n", "authors": ["98"]}
{"title": "Defining the relationships between IT service management and IT service governance\n", "abstract": " IT service provider organizations need both IT service management (ITSM) and IT service governance (ITSG) to ensure successful service provision for their customers. However, current service science literature has not adequately addressed how these activities differ from each other. Focusing solely on IT service management and ignoring service governance aspects may cause difficulties in measuring the performance of service management, defining and deploying the roles and responsibilities of service management, allocating the resources for right service improvements and adopting the service-oriented process culture. The research problem of this study is: How does IT service management differ from IT service governance? The main contribution of the study is a framework for IT service governance and a roadmap of IT service management frameworks and standards that can be utilized in …", "num_citations": "27\n", "authors": ["98"]}
{"title": "Towards an improved it service desk system and processes: a case study\n", "abstract": " An IT service desk provides a Single Point of Contact for the customers and users regarding support requests. The world-wide adoption of IT Infrastructure Library (ITIL) framework has also pushed organizations to improve their service desk operations. However, improving the service desk is a serious challenge for many IT service providers. Many government organizations in Finland have started to use ITIL in their service desks and need help in configuring service desk tools and defining processes. The research problem of this study is: How could an IT service provider’s service desk operations be improved by using IT service management best practices? The main contribution of this paper is to present results of a case study on IT service support in Finnish Tax Administration. First, the customer support challenges are described. Second, we present how these challenges were solved by using ITIL based practices. Third, we show how service desk performance and ITSM training usefulness were measured. Finally, lessons learnt from the case are presented.", "num_citations": "26\n", "authors": ["98"]}
{"title": "Defining requirements for an incident management system: A case study\n", "abstract": " An incident management process is performed by the service desk that acts as contact point to the users and customers. The service desk records each incident (a failure report or a service request) reported by a user or a customer in the incident management system. Many IT organizations are interested in establishing an incident management system (IMS) that is compliant with IT infrastructure library (ITIL) service management framework. In this study, we aim to answer the research question is: what types of requirements should be taken account in building an incident management system. Lessons learned from a tool specification project in healthcare domain are presented. An effective IMS should be capable of handling incidents, service requests, problems and requests for change (RFCs); enable relating several incidents and RFCs to one problem; have a public known error database; and contain information …", "num_citations": "25\n", "authors": ["98"]}
{"title": "Identifying knowledge management challenges in a service desk: A case study\n", "abstract": " Service desk plays a central role within IT service management. The main goal of the service desk is to record failure reports and service requests from software users and customers. The main contribution of this study is to present knowledge management challenges in the service desk function of a large IT service provider company in Finland. Data for this study were collected through interviews with 31 service desk workers. Several challenges were identified in the service desk work. Challenges were related to incident classification, quality of instruction documents, automatization of incident and order processes, escalation of incidents and the interface between incident management and problem management.", "num_citations": "23\n", "authors": ["98"]}
{"title": "Identifying IT service management challenges: A case study in two IT service provider companies\n", "abstract": " Continual service improvement within IT service management is an important research topic. Nowadays, IT services should be actively developed and improved in order to increase quality and cost effectiveness. Continual Service Improvement enables identification of bottlenecks and weak areas in the services. The research problem of this study is: what types of challenges exist in the IT service management from IT service provider's perspective? The main contribution of this study is to present ITSM challenges in two IT service provider companies in Finland. In order to categorize results, we used the three core perspectives of ITSM people, process, and technology. These three areas provide inputs to the continual service improvement lifecycle phase which controls and manages the identified improvements. Data for this study were mainly collected through interviews with 21 IT service management specialists.", "num_citations": "21\n", "authors": ["98"]}
{"title": "Lessons learnt from the improvement of customer support processes: A case study on incident management\n", "abstract": " IT Infrastructure Library (ITIL) is the most widely used IT service management framework that provides guidelines how to create, manage and support IT services. Service support processes, such as incident management and problem management, are among the first ITIL processes that organizations start to implement. However, several challenges may exist in the process implementation. The research question of this study is: which issues are important in establishing an ITIL-based incident management process? The main contribution of this paper is to present lessons learnt from an ITIL-based process improvement project that focused on establishing an incident management process in an IS department of a university hospital. Our results show that key issues in implementing incident management are to 1) define the basic concepts of incident management with concrete examples and 2) define process …", "num_citations": "20\n", "authors": ["98"]}
{"title": "Examining challenges in IT service desk system and processes: a case study\n", "abstract": " The adoption of IT Infrastructure Library (ITIL) framework is a challenging task for many IT service provider organizations. Many government organizations in Finland have also started to use ITIL and need help in configuring tools and defining processes. The research problem of this study is: What types of challenges exist in the IT service provider’s customer support? The main contribution of this paper is to present challenges on IT service support of Finnish Tax Administration.", "num_citations": "19\n", "authors": ["98"]}
{"title": "Improving incident management processes in two IT service provider companies\n", "abstract": " Many IT service provider organizations are interested in using IT Infrastructure Library (ITIL) framework to improve the quality of customer support. ITIL is a collection of best practices for IT service management. However, many organizations consider the improvement of service management processes as a challenging task. The research problem of this study is: How incident management can be improved in IT service provider companies by using the ITIL framework? The main contribution of this paper is to present results from a case study with two IT service provider organizations that established an ITIL-based incident management processes to improve their customer support activities.", "num_citations": "17\n", "authors": ["98"]}
{"title": "Improving IT service management processes: A case study on IT service support\n", "abstract": " IT services and IT service management play a very important role in the today’s IT industry. Software as service approach enables IT customers to focus on using the software while IT service providers take care of the installation, configuration, support and maintenance activities. Various process frameworks can be used to improve IT service management processes. The most widely used IT service management framework is the IT Infrastructure Library (ITIL) that provides best practices for IT service providers on how to design, manage and support IT services. Despite the IT service management process frameworks, implementing an effective service support interface between an IT service provider and an IT customer is a big challenge. The research problem in this study is: what types of challenges are related to the service support interface between an IT service provider and IT customers. The main …", "num_citations": "16\n", "authors": ["98"]}
{"title": "Establishing a measurement system for IT service management processes: a case study\n", "abstract": " IT service providers need effective and efficient methods how to design, manage, support and measure IT services. IT Infrastructure Library (ITIL) is the most widely used IT service management framework. It consists of best practices that can be used in implementing, for example service support processes, such as incident management and problem management. Although IT service management frameworks and standards provide some guidelines for measuring IT services, many IT organizations consider service measurement as a difficult task. The research problem in this paper is how the measurement of the IT service support processes can be improved? The main contribution of this study is to 1) describe the implementation process of the ITIL-based IT service management measurement system (ITSM-MS), 2) describe the system architecture and the main functions of the ITSM-MS, 3) propose a framework for measuring IT services and 4) present the lessons learnt from the ITSMMS implementation process. The ITSM-MS can be used to measure the performance of IT service support processes. The measurement system was developed in cooperation between a software engineering research project and a large IT service provider company in Finland.", "num_citations": "16\n", "authors": ["98"]}
{"title": "Difficulties in establishing a defect management process: A case study\n", "abstract": " A well-organized defect management process is one of the success factors for implementing software projects in time and in budget. The defect management process includes defect prevention, defect discovery and resolution, defect causal analysis, and the process improvement. However, establishing an organization-wide defect management process is a complicated task. The main research question in this paper is what kind of difficulties organizations have regarding the defect management process. Our findings show that problems are related to defect resolution reports, limited project resources for fixing defects, and challenges in creating a test environment. Results are based on our observations from four case organizations. The main contribution of this study is to help organizations to identify and avoid typical problems with defect management.", "num_citations": "16\n", "authors": ["98"]}
{"title": "Improving release and patch management processes: An empirical case study on process challenges\n", "abstract": " Implementing release management and patch management processes effectively are challenges for both IT companies and IT customer organizations. Patch management is an essential sub process of release management within overall software maintenance. The research problem in this study is what types of challenges are related to release management and patch management processes and how the common pitfalls could be avoided. Data for the case study were collected from an information technology (IT) company and an IT department of IT customer organization, which apply IT Infrastructure Library framework (ITIL). The main contribution of the paper is to describe the real-world challenges regarding the release and patch management processes and present the lessons learned with proposed improvements.", "num_citations": "14\n", "authors": ["98"]}
{"title": "A Conceptual Model of IT Service Problem Managementz\n", "abstract": " IT service providers need a systematic problem management model to handle problems in IT services effectively. However, many IT organizations have difficulties in establishing a problem management model that is suitable for a service-oriented business. This is due to complex IT service management standards that include a large number of new concepts, which partly overlap with those of traditional software engineering. In this paper, we propose a conceptual model which clarifies the concepts within IT service problem management, and connects these concepts to traditional software engineering tasks, such as testing and defect management. A design pattern is used to document our model. This study has been carried out in co-operation with IT companies and their customers in the electricity domain in Finland", "num_citations": "14\n", "authors": ["98"]}
{"title": "Exploring the impact of IT service management process improvement initiatives: a case study approach\n", "abstract": " IT companies worldwide have started to improve their service management processes based on best practice frameworks, such as IT Infrastructure Library (ITIL). However, many of these companies face difficulties in demonstrating the positive outcomes of IT service management (ITSM) process improvement. This has led us to investigate the research problem: What positive impacts have resulted from IT service management process improvement? The main contributions of this paper are 1) to identify the ITSM process improvement outcomes in two IT service provider organizations and 2) provide advice as lessons learnt.", "num_citations": "13\n", "authors": ["98"]}
{"title": "Improving IT service desk and service management processes in finnish tax administration: a case study on service engineering\n", "abstract": " Due to success of IT service management frameworks, the service desk function and the incident management process are improvement targets of high priority for many IT companies at the moment. The main goal of the incident management process is to restore normal service operation as quickly as possible. The research problem of this study is: How service engineering processes and service desk can be improved by using ITIL-based best practices? The main contribution of this paper is to 1) describe the phases of a study that focused on improving service desk and incident management process from IT service management perspective and 2) provide lessons learnt from the study. The case study was carried out with a single case: Finnish Tax Administration.", "num_citations": "11\n", "authors": ["98"]}