{"title": "Expertise networks in online communities: structure and algorithms\n", "abstract": " Web-based communities have become important places for people to seek and share expertise. We find that networks in these communities typically differ in their topology from other online networks such as the World Wide Web. Systems targeted to augment web-based communities by automatically identifying users with expertise, for example, need to adapt to the underlying interaction dynamics. In this study, we analyze the Java Forum, a large online help-seeking community, using social network analysis methods. We test a set of network-based ranking algorithms, including PageRank and HITS, on this large size social network in order to identify users with high expertise. We then use simulations to identify a small number of simple simulation rules governing the question-answer dynamic in the network. These simple rules not only replicate the structural characteristics and algorithm performance on the …", "num_citations": "1138\n", "authors": ["1182"]}
{"title": "Knowledge sharing and yahoo answers: everyone knows something\n", "abstract": " Yahoo Answers (YA) is a large and diverse question-answer forum, acting not only as a medium for sharing technical knowledge, but as a place where one can seek advice, gather opinions, and satisfy one's curiosity about a countless number of things. In this paper, we seek to understand YA's knowledge sharing and activity. We analyze the forum categories and cluster them according to content characteristics and patterns of interaction among the users. While interactions in some categories resemble expertise sharing forums, others incorporate discussion, everyday advice, and support. With such a diversity of categories in which one can participate, we find that some users focus narrowly on specific topics, while others participate across categories. This not only allows us to map related categories, but to characterize the entropy of the users' interests. We find that lower entropy correlates with receiving higher …", "num_citations": "1015\n", "authors": ["1182"]}
{"title": "The intellectual challenge of CSCW: The gap between social requirements and technical feasibility\n", "abstract": " Over the last 10 years, Computer-Supported Cooperative Work (CSCW) has identified a base set of findings. These findings are taken almost as assumptions within the field. In summary, they argue that human activity is highly flexible, nuanced, and contextualized and that computational entities such as information sharing, roles, and social norms need to be similarly flexible, nuanced, and contextualized. However, current systems cannot fully support the social world uncovered by these findings. In this article I argue that there is an inherent gap between the social requirements of CSCW and its technical mechanisms. The social-technical gap is the divide between what we know we must support socially and what we can support technically. Exploring, understanding, and hopefully ameliorating this social-technical gap is the central challenge for CSCW as a field and one of the central problems for human-computer …", "num_citations": "988\n", "authors": ["1182"]}
{"title": "Privacy in e-commerce: examining user scenarios and privacy preferences\n", "abstract": " Privacy is a necessary concern in electronic commerce. It is difficult, if not impossible, to complete a transaction without revealing some personal data–a shipping address, billing information, or product preference. Users may be unwilling to provide this necessary information or even to browse online if they believe their privacy is invaded or threatened.Fortunately, there are technologies to help users protect their privacy. P3P (Platform for Privacy Preferences Project) from the World Wide Web Consortium is one such technology. However, there is a need to know more about the range of user concerns and preferences about privacy in order to build usable and effective interface mechanisms for P3P and other privacy technologies. Accordingly, we conducted a survey of 381 US Net users, detailing a range of commerce scenarios and examining the participants' concerns and preferences about privacy. This paper …", "num_citations": "760\n", "authors": ["1182"]}
{"title": "Augmenting organizational memory: a field study of answer garden\n", "abstract": " A growing concern for organizations and groups has been to augment their knowledge and expertise. One such augmentation is to provide an organizational memory, some record of the organization's knowledge. However, relatively little is known about how computer systems might enhance organizational, group, or community memory. This article presents Answer Garden, a system for growing organizational memory. The article describes the system and its underlying implementation. It then presents findings from a field study of Answer Garden. The article discusses the usage data and qualitative evaluations from the field study, and then draws a set of lessons for next-generation organizational memory systems.", "num_citations": "751\n", "authors": ["1182"]}
{"title": "Answer Garden: A tool for growing organizational memory\n", "abstract": " Answer Garden allows organizations to develop databases of commonly asked questions that grow “organically” as new questions arise and are answered. It is designed to help in situations (such as field service organizations and customer “hot lines”) where there is a continuing stream of questions, many of which occur over and over, but some of which the organization has never seen before. The system includes a branching network of diagnostic questions that helps users find the answers they want. If the answer is not present, the system automatically sends the question to the appropriate expert, and the answer is returned to the user as well as inserted into the branching network. Experts can also modify this network in response to users' problems. Our initial Answer Garden database contains questions and answers about how to use the X Window System.", "num_citations": "620\n", "authors": ["1182"]}
{"title": "Beyond concern: Understanding net users’ attitudes about online privacy\n", "abstract": " People are concerned about privacy, particularly on the Internet. While many studies have provided evidence of this concern, few have explored the nature of the concern in detail, especially for the online environment. This chapter presents a studsy that helps to better understand the nature of online privacy concerns, looking beyond the fact that people are concerned and attempt to understand how they are concerned. The results will help inform both policy decisions as well as the development of technology tools that can assist Internet users in protecting their privacy.", "num_citations": "556\n", "authors": ["1182"]}
{"title": "Sharing expertise: Beyond knowledge management\n", "abstract": " The field of knowledge management focuses on how organizations can most effectively store, manage, retrieve, and enlarge their intellectual properties. The repository view of knowledge management emphasizes the gathering, providing, and filtering of explicit knowledge. The information in a repository has the advantage of being easily transferable and reusable. But it is not easy to use decontextualized information, and users often need access to human experts. This book describes a more recent approach to knowledge management, which the authors call\" expertise sharing.\" Expertise sharing emphasizes the human aspects--cognitive, social, cultural, and organizational--of knowledge management, in addition to information storage and retrieval. Rather than focusing on the management level of an organization, expertise sharing focuses on the self-organized activities of the organization's members. The book addresses the concerns of both researchers and practitioners, describing current literature and research as well as offering information on implementing systems. It consists of three parts: an introduction to knowledge sharing in large organizations; empirical studies of expertise sharing in different types of settings; and detailed descriptions of computer systems that can route queries, assemble people and work, and augment naturally occurring social networks within organizations.", "num_citations": "434\n", "authors": ["1182"]}
{"title": "Questions in, knowledge in? A study of Naver's question answering community\n", "abstract": " Large general-purposed community question-answering sites are becoming popular as a new venue for generating knowledge and helping users in their information needs. In this paper we analyze the characteristics of knowledge generation and user participation behavior in the largest question-answering online community in South Korea, Naver Knowledge-iN. We collected and analyzed over 2.6 million question/answer pairs from fifteen categories between 2002 and 2007, and have interviewed twenty six users to gain insights into their motivations, roles, usage and expertise. We find altruism, learning, and competency are frequent motivations for top answerers to participate, but that participation is often highly intermittent. Using a simple measure of user performance, we find that higher levels of participation correlate with better performance. We also observe that users are motivated in part through a point …", "num_citations": "320\n", "authors": ["1182"]}
{"title": "Considering an organization's memory\n", "abstract": " The term orgarzkationd mmo~ is due for an ovtid Niemory appem to be ev-ere m organization, ye $ tie tem has been Hed to a fav uses. h this paper we examine what memoq m an organization rem is. Basal on an ethnographic study of a tdephone hofie group, this paper presents a micro-level-ysis of a hotie cm the work acti~ surrounding the cM, and the memory med in tie work ach~. We do this _ from the viewpornt of &luted cognition tieory, finding it titi for an understitig of an organization’s memory.", "num_citations": "314\n", "authors": ["1182"]}
{"title": "Crowdsourcing and knowledge sharing: strategic user behavior on taskcn\n", "abstract": " Witkeys are a thriving type of web-based knowledge sharing market in China, supporting a form of crowdsourcing. In a Witkey site, users offer a small award for a solution to a task, and other users compete to have their solution selected.", "num_citations": "281\n", "authors": ["1182"]}
{"title": "Reexamining organizational memory\n", "abstract": " We approach this problem using distributed cognition theory [4, 6] because its theoretical language spans the diverse manifestations of OM—from private to public, small scale to large scale. Our goal is to find theoretical concepts that can help us frame better designs.", "num_citations": "280\n", "authors": ["1182"]}
{"title": "Definitional and contextual issues in organizational and group memories\n", "abstract": " Describes how organizations looking to augment their memories through information technologies can employ an organizational memory system. Organizational and group memories can include a wide variety of materials, including documents, rationales for decisions, formal descriptions of procedures, and so on. Discusses findings from case studies of six organizations using or attempting to use the Answer Garden, a type of organizational memory system. Examines two major issues in the implementation of such systems: the gap between the idealized definition of organizational memory and the constrained realities of organizational life; and the effects of reducing contextual information in computer‐based memory. Suggests some avenues for managing these issues as well as for further technical and organizational research.", "num_citations": "231\n", "authors": ["1182"]}
{"title": "Privacy in context\n", "abstract": " Context-aware computing offers the promise of significant user gains-the ability for systems to adapt more readily to user needs, models, and goals. Dey, Abowd, and Salber (2001 [this special issue]) present a masterful step toward understanding context-aware applications. We examine Dey et al. in the light of privacy issues-that is, individuals' control over their personal data-to highlight some of the thorny issues in context-aware computing that will be upon us soon. We argue that privacy in context-aware computing, especially those with perceptually aware environments, will be quite complex. Indeed, privacy forms a co-design space between the social, the technical, and the regulatory. We recognize that Dey et al. is a necessary first step in examining important software engineering concerns, but future research will need to consider how regulatory and technical solutions might be co-designed to form a public good.", "num_citations": "203\n", "authors": ["1182"]}
{"title": "Sharing knowledge and expertise: The CSCW view of knowledge management\n", "abstract": " Knowledge Management (KM) is a diffuse and controversial term, which has been used by a large number of research disciplines. CSCW, over the last 20 years, has taken a critical stance towards most of these approaches, and instead, CSCW shifted the focus towards a practice-based perspective. This paper surveys CSCW researchers’ viewpoints on what has become called ‘knowledge sharing’ and ‘expertise sharing’. These are based in an understanding of the social contexts of knowledge work and practices, as well as in an emphasis on communication among knowledgeable humans. The paper provides a summary and overview of the two strands of knowledge and expertise sharing in CSCW, which, from an analytical standpoint, roughly represent ‘generations’ of research: an ‘object-centric’ and a ‘people-centric’ view. We also survey the challenges and opportunities ahead.", "num_citations": "201\n", "authors": ["1182"]}
{"title": "Social activity indicators: interface components for CSCW systems\n", "abstract": " Knowing what social activity is occurring within and through a Computer-Supported Cooperative Work (CSCW) system is often very useful. This is especially true for computer-mediated communication systems such as chat and other synchronous applications. People will attend to these systems more closely when they know that there is interesting activity on them.Interface mechanisms for indicating social activity, however, are often ad-hoc, if present at all. This paper argues for the importance of displaying social activity as well as proposes a generalized mechanism for doing so. This social activity indication mechanism is built upon a new CSCW toolki~ the Cafe ConstructionKit, and the Cafe ConstructionKit provides a number of important facilities for making construction of these indicators easy and straight-forward. Accordingly, this paper presents both the Cafe ConstructionKit as a CSCW toolkit as well as a …", "num_citations": "198\n", "authors": ["1182"]}
{"title": "Augmenting a window system with speech input\n", "abstract": " Some necessary background in speech recognition and window systems is given, with an analysis of how they might be combined. Xspeak, a navigation application, and its operation and a field study of its use are described. With Xspeak, window navigation tasks usually performed with a mouse can be controlled by voice. An improved version, Xspeak II, which incorporates a language for translating spoken commands, is introduced.< >", "num_citations": "172\n", "authors": ["1182"]}
{"title": "Privacy critics: UI components to safeguard users' privacy\n", "abstract": " Creating usable systems to protect online privacy is an inherently difficult problem. Privacy critics are semi-autonomous agents that help people protect their online privacy by offering suggestions and warnings. Two sample critics are presented.", "num_citations": "170\n", "authors": ["1182"]}
{"title": "A construction set for multimedia applications\n", "abstract": " The authors describe an interface system called Athena Muse. Muse is an experiment kit for the construction of multimedia learning environments. Learning environments developed with Muse offer a diverse set of complementary interaction techniques, styles, and devices. An interface developer can choose from four representation approaches: directed graphs, multidimensional spatial frameworks, declarative constraints, and procedural languages.< >", "num_citations": "165\n", "authors": ["1182"]}
{"title": "Hanging on the ‘wire: a field study of an audio-only media space\n", "abstract": " The primary focus of this article is an analysis of an audio-only media space from a computer-supported cooperative work (CSCW) perspective. To explore whether audio by itself is suitable for shared media systems, we studied a workgroup using an audio-only media space. This media space, called Thunderwire, combined high-quality audio with open connec-tions to create a shared space for its users. The two-month field study provided a richly nuanced understanding of this audio spaces social use. The system afforded rich sociable interactions. As well, users were able to create a useful, usable social space; however, through an analysis of the social norms that the participants formulated, we show that they had to take into account being in an audio-only environment. Within the field study, then, audio by itself was sufficient for a usable media space and a useful social space, but users were forced to adapt to …", "num_citations": "164\n", "authors": ["1182"]}
{"title": "Thunderwire: A field study of an audio-only media space\n", "abstract": " To explore the potential of using audio by itself in a shared media system, we studied a workgroup using an audio-only media space. This media space, called Thunderwire, combined high-quality audio with open connections to create a shared space for its users.The two-month field study provided a richly nuanced understanding of this audio space’s social use. The system afforded rich sociable interactions, Indeed, within the field study, audio by itself afforded a telepresent environment for its users. However while a usable media space and a useful social space, Thunderwire required its users to adapt to many audio-only conditions.", "num_citations": "147\n", "authors": ["1182"]}
{"title": "Privacy in pervasive environments: next generation labeling protocols\n", "abstract": " In pervasive environments, privacy is likely to be a major issue for users, and users will want to be notified of potential data capture. To provide notice to users, this paper argues for what it calls labeling protocols, technical mechanisms through which users can be informed of data requests and their consequences. Recent experiences with the Platform for Privacy Preferences Project (P3P), an attempt to provide privacy mechanisms for the Web, suggest important lessons for the design of a next generation labeling protocol that will be usable and useful in pervasive environments. This paper examines the P3P lessons and open issues with an eye to pervasive requirements.", "num_citations": "145\n", "authors": ["1182"]}
{"title": "Surfing the next wave: design and implementation challenges of ubiquitous computing\n", "abstract": " As computing becomes more mobile and pervasive, designing and implementing ubiquitous computing environments emerge as key challenges for information systems research and practice. The four short papers in this article report the highlights of the second Ubiquitous Computing Workshop at Case Western Reserve University in October 2003. The objectives of the papers are to set up a research agenda in this emerging interdisciplinary field, to share current level of understanding of leading edge research topics, and to create cumulative research streams in this field. Note: This paper consists of an overview of the second Ubiquitous Computing Workshop by its organizers, Kalle Lyytinen and Youngjin Yoo, followed by four papers summarizing its four major working groups. The four papers were prepared and can be read independently. They are not integrated.", "num_citations": "145\n", "authors": ["1182"]}
{"title": "Searching for expertise in social networks: a simulation of potential strategies\n", "abstract": " People search for people with suitable expertise all of the time in their social networks-to answer questions or provide help. Recently, efforts have been made to augment this searching. However, relatively little is known about the social characteristics of various algorithms that might be useful. In this paper, we examine three families of searching strategies that we believe may be useful in expertise location. We do so through a simulation, based on the Enron email data set.(We would be unable to suitably experiment in a real organization, thus our need for a simulation.) Our emphasis is not on graph theoretical concerns, but on the social characteristics involved. The goal is to understand the tradeoffs involved in the design of social network based searching engines.", "num_citations": "142\n", "authors": ["1182"]}
{"title": "Organizational memory as objects, processes, and trajectories: An examination of organizational memory in use\n", "abstract": " For proper knowledge management, organizations must consider how knowledge is kept and reused. The term organizational memory is due for an overhaul. Memory appears to be everywhere in organizations; yet, the term has been limited to only a few uses. Based on an ethnographic study of a telephone hotline group, this paper presents a micro-level, distributed cognition analysis of two hotline calls, the work activity surrounding the calls, and the memory used in the work activity. Drawing on the work of Star, Hutchins, and Strauss, the paper focuses on issues of applying past information for current use. Our work extends Strauss' and Hutchins' trajectories to get at the understanding of potential future use by participants and its role in current information storage. We also note the simultaneously shared provenance and governance of multiple memories – human and technical. This analysis and the …", "num_citations": "142\n", "authors": ["1182"]}
{"title": "Organizational memory: processes, boundary objects, and trajectories\n", "abstract": " The term organizational memory is due for an overhaul. Memory appears to be everywhere in organizations; yet, the term has been limited to only a few uses. Based on an ethnographic study of a telephone hotline group, this paper presents a micro-level, distributed cognition analysis of two hotline calls, the work activity surrounding the calls, and the memory used in the work activity. We find a number of interesting theoretical concepts that are useful in further describing and analyzing organizational memory.", "num_citations": "141\n", "authors": ["1182"]}
{"title": "Discovery-based games for learning software\n", "abstract": " We propose using discovery-based learning games to teach people how to use complex software. Specifically, we developed Jigsaw, a learning game that asks players to solve virtual jigsaw puzzles using tools in Adobe Photoshop. We conducted an eleven-person lab study of the prototype, and found the game to be an effective learning medium that can complement demonstration-based tutorials. Not only did the participants learn about new tools and techniques while actively solving the puzzles in Jigsaw, but they also recalled techniques that they had learned previously but had forgotten.", "num_citations": "128\n", "authors": ["1182"]}
{"title": "Collaborative help in chronic disease management: supporting individualized problems\n", "abstract": " Coping with chronic illness disease is a long and lonely journey, because the burden of managing the illness on a daily basis is placed upon the patients themselves. In this paper, we present our findings for how diabetes patient support groups help one another find individualized strategies for managing diabetes. Through field observations of face-to-face diabetes support groups, content analysis of an online diabetes community, and interviews, we found several help interactions that are critical in helping patients in finding individualized solutions. Those are:(1) patients operationalize their experiences to easily contextualize and share executable strategies;(2) operationalization has to be done within the larger context of sharing illness trajectories; and (3) the support groups develop common understanding towards diabetes management. We further discuss how our findings translate into design implications for …", "num_citations": "111\n", "authors": ["1182"]}
{"title": "Privacy issues and human-computer interaction\n", "abstract": " Privacy can be a key aspect of the user experience with computers, online systems, and new technologies. Knowing what to consider about users and their views of computer systems can only improve privacy mechanisms. Human-Computer Interaction (HCI) is the subfield of Computer Science that studies how people interact with and through computational technologies. This chapter examines what HCI, as a research area, offers to both those designing and those researching privacy mechanisms.HCI is a large research field in its own right. HCI’s roots were in human factors and the design and evaluation of “man-machine” interfaces for airplanes and other complex and potentially dangerous mechanical systems. The first papers in what would later be known as HCI were in the 1970s and concerned the design of user interfaces in time-sharing systems. The field took off with the advent of personal computers and the single-user interface in the early 1980s. HCI’s roots then were in cognitive-oriented, single-user interfaces–the so-called user interface.", "num_citations": "106\n", "authors": ["1182"]}
{"title": "When fitness trackers don't'fit' end-user difficulties in the assessment of personal tracking device accuracy\n", "abstract": " Personal tracking technologies allow users to monitor and reflect on their physical activities and fitness. However, users are uncertain about how accurately their devices track their data. In order to better understand this challenge, we analyzed 600 product reviews and conducted 24 interviews with tracking device users. In this paper, we describe what methods users used to assess accuracy of their tracking devices and identify seven problems they encountered. We found that differences in users' expectations, physical characteristics, types of activities and lifestyle led them to have different perceptions of the accuracy of their devices. With the absence of sound mental models and unclear understanding of the concepts of accuracy and experimental controls, users designed faulty tests and came to incorrect conclusions. We propose design recommendations to better support end-users' efforts to assess and improve …", "num_citations": "104\n", "authors": ["1182"]}
{"title": "Activity lifespan: An analysis of user survival patterns in online knowledge sharing communities\n", "abstract": " Retaining participation is crucial for information services, online knowledge sharing services among them. We present the first comprehensive analysis of users’ activity lifespan across three predominant online knowledge-sharing communities. Extending previous work focusing on initial interactions of new users, we use survival analysis to quantify participation patterns that can be used to predict individual lifespan over the long term. We discuss how cross-site differences in user participation and the underlying factors can be related to differences in system design and culture. We conduct a longitudinal comparison of the communities’ evolvement between two distinct stages, the initial days just after the site launch and one year later. We also observe that sub-communities corresponding to different topics differ in their ability to sustain users. All results reveal the complexity and diversity in users’ engagement to a site and design implications are discussed.", "num_citations": "104\n", "authors": ["1182"]}
{"title": "Achieving safety: A field study of boundary objects in aircraft technical support\n", "abstract": " Boundary objects are a critical, but understudied, theoretical construct in CSCW. Through a field study of aircraft technical support, we examined the role of boundary objects in the\" achievement of safety\" by service engineers. The resolution process of repair requests was captured in two compound boundary objects. These crystallizations did not manifest a static interpretation, but instead were continually re-interpreted in light of meta-negotiations. This suggests design implications for organizational memory systems which can more fluidly represent the meta-negotiations surrounding boundary objects.", "num_citations": "95\n", "authors": ["1182"]}
{"title": "Successful classroom deployment of a social document annotation system\n", "abstract": " NB is an in-place collaborative document annotation website targeting students reading lecture notes and draft textbooks. Serving as a discussion forum in the document margins, NB lets users ask and answer questions about their reading material as they are reading. NB users can read and annotate documents using their web browsers, without any special plug-ins. We describe the NB system and its evaluation in real class environment, where students used it to submit their reading assignments, ask questions and get or provide feedback. We show that this tool can be and has been successfully incorporated into a number of different classes at different institutions. To understand how and why, we focus on a particularly successful class deployment where the instructor adapted his teaching style to take students' comment into account. We analyze the annotation practices that were observed-including the way …", "num_citations": "94\n", "authors": ["1182"]}
{"title": "Competing to Share Expertise: The Taskcn Knowledge Sharing Community.\n", "abstract": " \" Witkeys\" are websites in China that form a rapidly growing web-based knowledge market. A user who posts a task also offers a small fee, and many other users submit their answers to compete. The Witkey sites fall in-between aspects of the now-defunct Google Answers (vetted experts answer questions for a fee) and Yahoo Answers (anyone can answer or ask a question). As such, these sites promise new possibilities for knowledge-sharing online communities, perhaps fostering the freelance marketplace of the future. In this paper, we investigate one of the biggest Witkey websites in China, Taskcn. com. In particular, we apply social network prestige measures to a novel construction of user and task networks based on competitive outcomes to discover the underlying properties of both users and tasks. Our results demonstrate the power of this approach: Our analysis allows us to infer relative expertise of the users and provides an understanding of the participation structure in Taskcn. The results suggest challenges and opportunities for this kind of knowledge sharing medium.", "num_citations": "92\n", "authors": ["1182"]}
{"title": "Beyond boundary objects: Collaborative reuse in aircraft technical support\n", "abstract": " Boundary objects are a critical, but understudied, theoretical construct in CSCW. Through a field study of aircraft technical support, we examined the role of boundary objects in the practical achievement of safety by service engineers. Their resolution of repair requests was preserved in the organization’s memory via three compound boundary objects. These crystallizations did not manifest a static interpretation, but instead were continually reinterpreted in light of meta-negotiations. This suggests design implications for organizational memory systems which can more fluidly represent the meta-negotiations surrounding boundary objects.", "num_citations": "92\n", "authors": ["1182"]}
{"title": "QuME: a mechanism to support expertise finding in online help-seeking communities\n", "abstract": " Help-seeking communities have been playing an increasingly critical role in the way people seek and share information. However, traditional help-seeking mechanisms of these online communities have some limitations. In this paper, we describe an expertise-finding mechanism that attempts to alleviate the limitations caused by not knowing users' expertise levels. As a result of using social network data from the online community, this mechanism can automatically infer expertise level. This allows, for example, a question list to be personalized to the user's expertise level as well as to keyword similarity. We believe this expertise location mechanism will facilitate the development of next generation help-seeking communities.", "num_citations": "91\n", "authors": ["1182"]}
{"title": "Learning probabilistic user profiles: Applications for finding interesting web sites, notifying users of relevant changes to web pages, and locating grant opportunities\n", "abstract": " This article describes three agents that help a user locate useful or interesting information on the World Wide Web. The agents learn a probabilistic profile to find, classify, or rank other sources of information that are likely to interest the user.", "num_citations": "90\n", "authors": ["1182"]}
{"title": "Behind the help desk: evolution of a knowledge management system in a large organization\n", "abstract": " This paper examines the way in which a knowledge management system (KMS)-by which we mean the people, processes and software-came into being and evolved in response to a variety of shifting social, technical and organizational pressures. We draw upon data from a two year ethnographic study of a sophisticated help desk to trace the KMS from its initial conception as a\" Common Problems\" database for help desk personnel, to its current instantiation as a set of Frequently Asked Questions published on an intranet for help desk clients. We note how shifts in management, organizational structure, incentives, software technologies, and other factors affected the development of the system. This study sheds light on some of the difficulties that accompany the implementation of CSCW systems, and provides an analysis of how such systems are often designed by bricolage.", "num_citations": "85\n", "authors": ["1182"]}
{"title": "Memory in the small: An application to provide task-based organizational memory for a scientific community\n", "abstract": " Many forms of organizational memory must exist embedded within the organizational processes and tasks. This paper argues that \"memory-in-the small\", memory utilized in the performance of an organizational task, can serve as an effective performance support mechanism. By basing organizational memory upon organizational tasks (and basing task support upon organizational memory), organizational memory systems can provide additional and necessary support services for organizations and communities. As an example of memory-in-the-small, this paper describes a software application called the ASSIST, that combines organizational memory with task performance for a scientific community. The ASSIST utilizes and stores the collective memory of astrophysicists about data analysis and is used world-wide by astrophysicists. The paper also considers the theoretical and architectural issues involved when …", "num_citations": "83\n", "authors": ["1182"]}
{"title": "An introduction to the Chicago School of Sociology\n", "abstract": " The “Chicago School” refers to a specific group of sociologists at the University of Chicago during the first half of this century. Their way of thinking about social relations was heavily qualitative, rigorous in data analysis, and focused on the city as a social laboratory. This paper provides a brief introduction to the school, as well as an overview of some of their most central themes.", "num_citations": "82\n", "authors": ["1182"]}
{"title": "Computing, social activity, and entertainment: A field study of a game MUD\n", "abstract": " Are game and entertainment systems different than work-oriented systems? What drives the user's experience in a collaborative game? To answer these questions, we performed a participant-observation study of a combat MUD, a game similar to Dungeons and Dragons. Our interest is in how this social world is arranged and managed (rather than, for example, in how participants form or display individual identities). The study explores the social arrangements and activities that give meaning and structure to the participants. We found that conflict and cooperation were the dominant social activities on this MUD, much more so than sociability. The game's management played a critical function in maintaining and promoting these activities. Moreover, novelty and entertainment were important for the design of both the system features and the sociality itself.", "num_citations": "81\n", "authors": ["1182"]}
{"title": "Providing social interaction in the digital library\n", "abstract": " In the old days, we used to sit all in one room around the Mini. Everyone knew what was going on. If I had a problem, I could just ask. Now we all sit in our separate offices [with workstations] and no one talks..--Astrophysicist.", "num_citations": "77\n", "authors": ["1182"]}
{"title": "I just don't know why it's gone maintaining informal information use in inpatient care\n", "abstract": " We conducted a field-based study examining informal nursing information. We examined the use of this information before and after the adoption of a CPOE (Computerized Provider Order Entry) system in an inpatient unit of a large teaching hospital. Before CPOE adoption, nurses used paper working documents to detail psycho-social information about patients; after the CPOE adoption, they did not use paper or digital notes as was planned. The paper describes this process and analyses how several interlocked reasons contributed to the loss of this information in written form. We found that a change in physical location, sufficient convenience, visibility of the information, and permanency of information account for some, but not all, of the outcome. As well, we found that computerization of the nursing data led to a shift in the politics of the information itself-the nurses no longer had a cohesive agreement about the …", "num_citations": "74\n", "authors": ["1182"]}
{"title": "Caring through data: Attending to the social and emotional experiences of health datafication\n", "abstract": " Designing systems to support the social context of personal data is a topic of importance in CSCW, particularly in the area of health and wellness. The relational complexities and psychological consequences of living with health data, however, are still emerging. Drawing on a 12+ month ethnography and corroborating survey data, we detail the experiences of parents using Nightscout--an open source, DIY system for remotely monitoring blood glucose data-with their children who have type one diabetes. Managing diabetes with Nightscout is a deeply relational and (at times) contested activity for parent-caregivers, whose practices reveal the tensions and vulnerabilities of caregiving work enacted through data. As engagement with personal data becomes an increasingly powerful way people experience life, our findings call for alternative data narratives that reflect a multiplicity of emotional concerns and social …", "num_citations": "70\n", "authors": ["1182"]}
{"title": "CPOE workarounds, boundary objects, and assemblages\n", "abstract": " We conducted an ethnographically based study at a large teaching hospital to examine clinician workarounds engendered by the adoption of a Computerized Prescribe Order Entry (CPOE) system. Specifically, we investigated how adoption of computerized systems may alter medical practice, order management in particular, as manifested through the working-around behavior developed by doctors and nurses to accommodate the changes in their day-to-day work environment. In this paper, we focus on clinicians' workarounds, including those workarounds that gradually disappeared and those that have become routinized. Further, we extend the CSCW concept of boundary object (to\" assemblage\") in order to understand the workarounds created with CPOE system use and the changing nature of clinical practices that are increasingly computerized.", "num_citations": "69\n", "authors": ["1182"]}
{"title": "Identifying unmet informational needs in the inpatient setting to increase patient and caregiver engagement in the context of pediatric hematopoietic stem cell transplantation\n", "abstract": " Background              Patient-centered care has been shown to improve patient outcomes, satisfaction, and engagement. However, there is a paucity of research on patient-centered care in the inpatient setting, including an understanding of unmet informational needs that may be limiting patient engagement. Pediatric hematopoietic stem cell transplantation (HSCT) represents an ideal patient population for elucidating unmet informational needs, due to the procedure’s complexity and its requirement for caregiver involvement.                               Methods              We conducted field observations and semi-structured interviews of pediatric HSCT caregivers and patients to identify informational challenges in the inpatient hospital setting. Data were analyzed using a thematic grounded theory approach.                               Results              Three stages of the caregiving experience that could potentially be supported …", "num_citations": "67\n", "authors": ["1182"]}
{"title": "Sharing expertise: The next step for knowledge management\n", "abstract": " There are numerous ways to handle knowledge within organizations. Indeed, knowledge management has been a flourishing commercial area for almost ten years, and one can point to many precursors within organizations as well. Knowledge management—regardless of its title or position in history—has always been an important, though not necessarily frequent, aspect of organizational life. It would be difficult to imagine a modern corporation that did not occasionally reflect on and improve its methods of handling communications, data, and information—or try to learn from its experience. In this chapter, we move from the metaphor of knowledge management to a new metaphor, expertise sharing, which promotes a focus on the inherently collaborative and social nature of the problem.In our view, knowledge management subsumes a number of differing strategies. What all of these strategies share—as do many informationaccess strategies—are interactions with or foundations in the social setting of an organization or institution. This is made explicit in descriptions of social capital. While social capital itself can be many things, we consider here its use within an organizational knowledge management definition (Cohen and Prusak 2001; Lesser, Fontaine, and Slusher 2000; Stewart 2001; Wenger 1998).(See the excellent review of the definitions and connotations of social capital in chapter 2 of this volume.)", "num_citations": "66\n", "authors": ["1182"]}
{"title": "Transition and reflection in the use of health information: the case of pediatric bone marrow transplant caregivers\n", "abstract": " The impact of health information on caregivers is of increasing interest to HCI/CSCW in designing systems to support the social and emotional dimensions of managing health. Drawing on an interview study, as well as corroborating data including a multi-year ethnography, we detail the practices of caregivers (particularly parents) in a bone marrow transplant (BMT) center. We examine the interconnections between information and emotion work performed by caregivers through a liminal lens, highlighting the BMT experience as a time of transition and reflection in which caregivers must quickly adapt to the new social world of the hospital and learn to manage a wide range of patient needs. The transition from parent to'caregiver'is challenging, placing additional emotional burdens on the intensive information work for managing BMT. As a time of reflection, the BMT experience also provides an occasion for generative …", "num_citations": "63\n", "authors": ["1182"]}
{"title": "Social activity indicators for groupware\n", "abstract": " Suppose you're a member of a few development teams, working with people who are geographically dispersed. You're using distributed groupware to work with your team mates. How do you decide when to work on a project and when to ignore requests to work on a project, when there are enough users on the groupware system to bother using it, who is available to answer a question, and which applications should get the most real estate on your screen? To help answer these questions, distributed groupware systems must indicate something about the social world they represent-who is on the system and what they are doing. User interfaces for groupware (or computer supported cooperative work (CSCW) applications) must therefore convey social information. It's energizing to know, for example, that your team mates are busy working away on a project. And it's nice to know when your friends or colleagues are …", "num_citations": "60\n", "authors": ["1182"]}
{"title": "Do-I-Care: A collaborative web agent\n", "abstract": " Social filtering and collaborative resource discovery mechanisms often fail because of the extra burden, even tiny, placed on the user. This work proposes an innovative World Wide Web agent that uses a model of collaboration that leverages the natural incentives for individual users to easily provide for collaborative work.", "num_citations": "59\n", "authors": ["1182"]}
{"title": "User-centered design groups to engage patients and caregivers with a personalized health information technology tool\n", "abstract": " Health information technology (IT) has opened exciting avenues for capturing, delivering and sharing data, and offers the potential to develop cost-effective, patient-focused applications. In recent years, there has been a proliferation of health IT applications such as outpatient portals. Rigorous evaluation is fundamental to ensure effectiveness and sustainability, as resistance to more widespread adoption of outpatient portals may be due to lack of user friendliness. Health IT applications that integrate with the existing electronic health record and present information in a condensed, user-friendly format could improve coordination of care and communication. Importantly, these applications should be developed systematically with appropriate methodological design and testing to ensure usefulness, adoption, and sustainability. Based on our prior work that identified numerous information needs and challenges of HCT …", "num_citations": "55\n", "authors": ["1182"]}
{"title": "Virtual gifts and guanxi: supporting social exchange in a chinese online community\n", "abstract": " Significant cultural differences persist between East and West. Software systems that have been proven to operate efficiently within one culture can fail in the context of the other, especially if they are intended to support rich social interactions. In this paper we demonstrate how a virtual currency system, not unlike ones employed by many US-based websites, evolved within a thriving Chinese online forum into an essential medium for extremely diverse and culturally specific social exchange activities. The social interactions reflect the traditional Chinese idea of guanxi, or interpersonal influence and connectedness, while at the same time incorporating the norms of a new generation of Internet users.", "num_citations": "54\n", "authors": ["1182"]}
{"title": "The X Toolkit: More Bricks for Building User-Interfaces or Widgets for Hire.\n", "abstract": " Primitives for application-level user interface construction facilities currently under development at MIT Project Athena are described. The design philosophy of the X Toolkit and associated widgets and some of the practical implications are discussed.", "num_citations": "51\n", "authors": ["1182"]}
{"title": "Privacy and security issues in e-commerce\n", "abstract": " Privacy–the control over one’s personal data–and security–the attempted access to data by unauthorized others–are two critical problems for both e-commerce consumers and sites alike. Without either, consumers will not visit or shop at a site, nor can sites function effectively without considering both. This chapter reviews the current state of the art and the relevance for privacy and security respectively. We examine privacy from social psychological, organizational, technical, regulatory, and economic perspectives. We then examine security from technical, social and organizational, and economic perspectives.", "num_citations": "50\n", "authors": ["1182"]}
{"title": "Surviving the information explosion: How people find their electronic information\n", "abstract": " We report on a study of how people look for information within email, files, and the Web. When locating a document or searching for a specific answer, people relied on their contextual knowledge of their information target to help them find it, often associating the target with a specific document. They appeared to prefer to use this contextual information as a guide in navigating locally in small steps to the desired document rather than directly jumping to their target. We found this behavior was especially true for people with unstructured information organization. We discuss the implications of our findings for the design of personal information management tools.", "num_citations": "49\n", "authors": ["1182"]}
{"title": "Rating friends without making enemies\n", "abstract": " As online social networks expand their role beyond maintaining existing relationships, they may look to more faceted ratings to support the formation of new connections between their users. Our study focuses on one community employing faceted ratings, CouchSurfing. org, and combines data analysis of ratings, a large-scale survey, and in-depth interviews. In order to understand the ratings, we revisit the notions of friendship and trust and uncover an asymmetry: close friendship includes trust, but high levels of trust can be achieved without close friendship. To users, providing faceted ratings presents challenges, including differentiating and quantifying inherently subjective feelings such as friendship and trust, concern over a friend's reaction to a rating, and knowledge of how ratings can affect others' reputations. One consequence of these issues is the near absence of negative feedback, even though a small portion of actual experiences and privately held ratings are negative. We show how users take this into account when formulating and interpreting ratings, and discuss designs that could encourage more balanced feedback.", "num_citations": "48\n", "authors": ["1182"]}
{"title": "Mediated voice communication via mobile IP\n", "abstract": " Impromptu is a mobile audio device which uses wireless Internet Protocol (IP) to access novel computer-mediated voice communication channels. These channels show the richness of IP-based communication as compared to conventional mobile telephony, adding audio processing and storage in the network, and flexible, user-centered call control protocols. These channels may be synchronous, asynchronous, or event-triggered, or even change modes as a function of other user activity. The demands of these modes plus the need to navigate with an entirely non-visual user interface are met with a number of audio-oriented user interaction techniques.", "num_citations": "46\n", "authors": ["1182"]}
{"title": "Group information management\n", "abstract": " Activities of PIM are often embedded in group or organizational contexts. To work effectively within a group, an individual must manage information not only for his or her personal use but also to share with other members of the group. Obviously, one would like to leverage the activities of others around. Being able to obtain telephone numbers, schedule group meetings, determine the availability of one’s peers, and obtain important collaborative information is invaluable. What are the issues, if any, in leveraging the work of others, in order to incorporate their calendar, contacts, and other information into one’s own PIM system? And what would be involved in sharing one’s own data for use by others?This chapter reviews the host of issues involved in the collaborative use of personal information. Topics covered include motivation, adoption patterns, interaction styles, control over personal information, privacy, and trust. The goal is to facilitate sharing personal information by considering these issues; fully considered, they can enable the cooperative adoption and use of tools to support group information management (GIM). GIM refers to the practice and the study of the individual actions performed to support group activity. The support of this information management behavior includes the ability to acquire, organize, maintain, retrieve and use artifacts such as documents (paper-based and digital), web pages, and email messages. Groups can be small (eg, a team of 6 or 7) or large (eg, an organization with thousands of members). They can be ephemeral (eg, chance encounters at a social event) or ongoing (eg, a software project team). Groups can …", "num_citations": "44\n", "authors": ["1182"]}
{"title": "Localizing chronic disease management: Information work and health translations\n", "abstract": " Based on interviews with people who had diabetes, high blood pressure, and kidney disease in Flint, Michigan, we found people actively doing information work to manage their health in the face of poverty, potentially violent conditions, high stress, and a distrust of institutionalized medicine. More specifically, we observed people translating information into the context of their everyday lives. We present various translations of health information in the form of local strategies for chronic illness management. Study findings highlight initial implications to support health information services on a community level.", "num_citations": "43\n", "authors": ["1182"]}
{"title": "Agency in assistive technology adoption: visual impairment and smartphone use in Bangalore\n", "abstract": " Studies on technology adoption typically assume that a user's perception of usability and usefulness of technology are central to its adoption. Specifically, in the case of accessibility and assistive technology, research has traditionally focused on the artifact rather than the individual, arguing that individual technologies fail or succeed based on their usability and fit for their users. Using a mixed-methods field study of smartphone adoption by 81 people with visual impairments in Bangalore, India, we argue that these positions are dated in the case of accessibility where a non-homogeneous population must adapt to technologies built for sighted people. We found that many users switch to smartphones despite their awareness of significant usability challenges with smartphones. We propose a nuanced understanding of perceived usefulness and actual usage based on need-related social and economic functions …", "num_citations": "41\n", "authors": ["1182"]}
{"title": "Contribution, commercialization & audience: understanding participation in an online creative community\n", "abstract": " This paper presents a qualitative study of attitudes towards participation and contribution in an online creative community. The setting of the work is an online community of practice focused on the use and development of a user-customizable music software package called Reaktor. Findings from the study highlight four emergent topics in the discourse related to user contributions to the community: contribution assessment, support for learning, perceptions of audience and tensions about commercialization. Our analysis of these topics frames discussion about the value and challenges of attending to amateur and professional users in online creative communities.", "num_citations": "41\n", "authors": ["1182"]}
{"title": "The Do-I-Care Agent: Effective Social Discovery and Filtering on the Web.\n", "abstract": " The Web is a vast, dynamic source of information and resources. Because of its size and diversity, it is increasingly likely that if the information one seeks is not already there, it will be soon. Unfortunately, finding the right places to look, and persistently revisiting those places until the information is available is an onerous task. In this paper, we describe Do-I-Care (DICA), an agent that uses both technical and social mechanisms to ease the burden of locating\" interesting\" new information and resources on the Web.DICA monitors Web pages previously found by the agent’s user to be relevant for any changes. It then compares these changes against a user model, classifies them as potentially interesting or not, and reports the interesting changes to the user. The user model is derived by accepting relevance feedback on changes previously found. Because the agent focuses on changes to known pages rather than discovering new pages, we increase the likelihood that the information found will be interesting. DICA combines an effortless collaboration mechanism with the natural incentives for individual users to maintain and train their own agents. Simply by pointing DICA agents at other agents, changes and opinions can be propagated from agent to agent automatically. Thus, individuals train and use DICA for themselves, but by using a simple technical mechanism, other users can use those results without the additional effort that often accompanies collaboration.", "num_citations": "41\n", "authors": ["1182"]}
{"title": "Joining the backstage: locality and centrality in an online community\n", "abstract": " The design of viable, small‐scale community spaces on the Net is often a hit‐or‐miss affair. To better understand promising approaches in this design space, it is necessary to go back in time to examine an earlier community technology. A field study is presented of The Castle, a dial‐up bulletin board system, that focuses on Disneyland. As a “gathering place for Disney enthusiasts”, The Castle is a fascinating, albeit eccentric, online community. The Castle's centrality in the fans’ interest network allows it to function as a collecting point. Here people find similar enthusiasts and even those with insider knowledge. Yet, because of the cost structure of dial‐up access (an accidental side‐effect of the technology), participants are overwhelmingly geographically local, which has useful consequences for social maintenance. It is argued that the geographical locality and centrality of interest allow The Castle to thrive. Most …", "num_citations": "35\n", "authors": ["1182"]}
{"title": "Resources, co-evolution and artifacts: Theory in CSCW\n", "abstract": " A topic of significant interest to the CSCW, IT and IS communities is the issue of how software and other technical systems come to be adopted and used. We know from considerable research that people use systems in many ways, and that the process of incorporating them in their everyday activities can require a great deal of effort. One way of understanding adoption and use is by considering artifacts as resources in people's environments.\" Resources, Co-Evolution and Artifacts: Theory in CSCW\" looks at how resources get created, adopted, modified, and die, by using a number of theoretical and empirical studies to carefully examine and chart resources over time. It examines issues such as: how resources are tailored or otherwise changed as the situations and purposes for which they are used change; how a resource is maintained and reused within an organisation; the ways in which the value of a resource comes to be recognised and portrayed; the ways in which an artifact is transformed to enable it to function more effectively as a resource; the ways in which an artifact's usage practices evolve as it becomes recognized as a resource; how one might approach the problem of designing a resource de novo; the ways in which opportunistic use of an artifact transforms it into a new kind of resource.", "num_citations": "34\n", "authors": ["1182"]}
{"title": "Lived data: tinkering with bodies, code, and care work\n", "abstract": " Human–computer interaction research on personal informatics in health care has focused on systems that aim to support patient empowerment and enable better health outcomes with data monitoring and tracking. Through examining the lived experience of personal data used to manage chronic illness, we show how such technology design is also the site of radical dependencies, collaborative care arrangements, and wider sociopolitical concerns tied to new forms of technical labor and shifts in medical expertise. Drawing from ethnographic research with open source, do-it-yourself collectives engaged in opening up corporate-controlled type 1 diabetes devices and data, we propose the analytical lens of lived data. Lived data emphasize data as an integral way of living, enacted through a multiplicity of things, relations, and practices, from bodies and needles, social media support groups, and legal processes to …", "num_citations": "32\n", "authors": ["1182"]}
{"title": "Doctors and psychosocial information: records and reuse in inpatient care\n", "abstract": " We conducted a field-based study at a large teaching hospital to examine doctors' use and documentation of patient care information, with a special focus on a patient's psychosocial information. We were particularly interested in the gaps between the medical work and any representations of the patient. The paper describes how doctors record this information for immediate and long-term use. We found that doctors documented a considerable amount of psychosocial information in their electronic health records (EHR) system. Yet, we also observed that such information was recorded selectively, and a medicalized view-point is a key contributing factor. Our study shows how missing or problematic representations of a patient affect work activities and patient care. We accordingly suggest that EHR systems could be made more usable and useful in the long run, by supporting both representations of medical processes …", "num_citations": "32\n", "authors": ["1182"]}
{"title": "I-DIAG: from community discussion to knowledge distillation\n", "abstract": " I-DIAG is an attempt to understand how to take the collective discussions of a large group of people and distill the messages and documents into more succinct, durable knowledge. I-DIAG is a distributed environment that includes two separate applications, CyberForum and Consolidate. The goals of the project, the architecture of IDIAG, and the two applications are described. We focus on technical mechanisms to augment social maintenance and social regulation in the system.", "num_citations": "31\n", "authors": ["1182"]}
{"title": "Arkose: reusing informal information from online discussions\n", "abstract": " Online discussions such as a large-scale community brainstorming often end up with an unorganized bramble of ideas and topics that are difficult to reuse. A process of distillation is needed to boil down a large information space into information that is concise and organized. We take a system-augmented approach to the problem by creating a set of tools with which human editors can collaboratively distill a large amount of informal information.", "num_citations": "29\n", "authors": ["1182"]}
{"title": "Communities and technologies: an approach to foster social capital?\n", "abstract": " Communities are social entities whose actors share common needs, interests, or practices: they constitute the basic units of social experience. With regard to communities, social capital captures the structural, relational and cognitive aspects of the relationships among their members. Social capital is defined as a set of properties of a social entity (eg norms, level of trust, and intensive social networking) which enables joint activities and cooperation for mutual benefit. It can be understood as the glue which holds communities together. On this panel we will discuss whether and how information technology can strengthen communities by fostering social capital.", "num_citations": "28\n", "authors": ["1182"]}
{"title": "Collaborating globally: culture and organizational computer-mediated communications\n", "abstract": " Culture shapes interpersonal communication. However, little is known about how culture interacts with computer-mediated communication (CMC) tools in a business context. We present a large-scale empirical study of cultural differences in computer mediated social interactions in a global company. Our dataset includes 9,000 volunteer users and more than 20 million records of their email and Instant Messaging conversations. We compared social network characteristics, preferences for CMC tools, and expression of sentiment across employees working in seven countries. Significant differences emerged and the patterns are consistent with the inherent cultural characteristics as suggested by cultural theories. In addition, we uncover the complex manner in which culture interacts with preference and use of different communication mediums. The existence of pervasive and complex cultural differences, points to the need to understand and account for such differences in designing cross-cultural collaborative systems.", "num_citations": "27\n", "authors": ["1182"]}
{"title": "Mailing Lists: Why Are They Still Here, What's Wrong With Them, and How Can We Fix Them?\n", "abstract": " Mailing lists have existed since the early days of email and are still widely used today, even as more sophisticated online forums and social media websites proliferate. The simplicity of mailing lists can be seen as a reason for their endurance, a source of dissatisfaction, and an opportunity for improvement. Using a mixed-method approach, we studied two community mailing lists in depth with interviews and surveys, and surveyed a broader spectrum of 28 lists. We report how members of the different communities use their lists and their goals and desires for them. We explore why members prefer mailing lists to other group communication tools. But we also identify several tensions around mailing list usage that appear to contribute to dissatisfaction with them. We conclude with design implications, discussing ways to alleviate these tensions while preserving mailing lists' appeal.", "num_citations": "25\n", "authors": ["1182"]}
{"title": "Cooperative documentation: the patient problem list as a nexus in electronic health records\n", "abstract": " The patient Problem List (PL) is a mandated documentation component of electronic health records supporting the longitudinal summarization of patient information in addition to facilitating the coordination of care by multidisciplinary medical teams. In this paper, we report an ethnographic study that examined the institutionalization of the PL. Specifically, we explored:(1) how different groups (primary care providers, inpatient hospitalists, specialists, and emergency doctors) perceived the purposes of the PL differently;(2) how these deviated perceptions might affect their use of the PL; and (3) how the technical design of the PL facilitated or hindered the clinical practices of these groups. We found significant ambiguity regarding the definition, benefits, and use of the PL across different groups. We also found that certain groups (eg primary care providers) had developed effective cooperative strategies regarding the use …", "num_citations": "25\n", "authors": ["1182"]}
{"title": "A novel health information technology communication system to increase caregiver activation in the context of hospital-based pediatric hematopoietic cell transplantation: a …\n", "abstract": " Background: Pediatric hematopoietic cell transplantation (HCT), commonly referred to as blood and marrow transplantation (BMT), is an intense treatment modality that requires the involvement of engaged caregivers during the patient’s (child’s) prolonged hospitalization. The ubiquity of electronic health records (EHRs) and a trend toward patient-centered care could allow a novel health information technology (IT) system to increase parental engagement. The paucity of research on acute care, hospital-based (inpatient) health IT applications for patients or caregivers provides an opportunity for testing the feasibility of such applications. The pediatric BMT population represents an ideal patient group to conduct an evaluation due to the lengthy inpatient stays and a heightened need for patient activation.Objective: The primary objective of this study is to assess the feasibility of implementing the BMT Roadmap in caregivers as an intervention during their child’s inpatient hospitalization. The BMT Roadmap is an inpatient portal prototype optimized for tablet with a user-centered design. It integrates patient-specific laboratory and medication data from the EHR in real-time and provides support in terms of discharge goals, home care education, and other components. Feasibility will be proven if (1) the BMT Roadmap functions and can be managed by the study team without unexpected effort,(2) the system is accessed by users at a defined minimum threshold, and (3) the qualitative and quantitative research conducted provides quality data that address the perceived usefulness of the BMT Roadmap and could inform a study in a larger sample size …", "num_citations": "24\n", "authors": ["1182"]}
{"title": "Co-constructing family memory: understanding the intergenerational practices of passing on family stories\n", "abstract": " Sharing family stories is an integral aspect of how families remember together and build a sense of connection. Yet, when generations in families are separated by large geographic and temporal distances, the everyday taken-for-granted processes of sharing family stories shift from conversational to mediated forms. To inform HCI research and practice in mediating family stories, we contribute an account of the co-constructive intergenerational social practices enacted to co-construct and interpret family stories. These practices demonstrate the agency of both storytellers and listeners as they work to discover, decipher, and reconstruct family stories. We close by drawing insights from this setting to frame key design challenges for multi-lifespan information systems mediating asynchronous, asymmetric, co-constructive and socially weighted information sharing interactions.", "num_citations": "23\n", "authors": ["1182"]}
{"title": "Understanding individual and collaborative problem-solving with patient-generated data: Challenges and opportunities\n", "abstract": " Making effective use of patient-generated data (PGD) is challenging for both patients and providers. Designing systems to support collaborative and individual use of PGD is a topic of importance in CSCW, considering the limitations of informatics tools. To inform better system design, we conducted a study including focus groups, observations and interviews with patients and providers to understand how PGD is interpreted and used. We found that while PGD is useful for identifying and solving disease-related problems, the following differences in patient-provider perceptions challenge its effective use - different perceptions about what is a problem, selecting what kinds of problems to focus on, and using different data representations. Drawing on these insights, we reflect on two specific conceptualizations of disease management behavior (sensemaking and problem-solving) as they relate to data specific activities …", "num_citations": "23\n", "authors": ["1182"]}
{"title": "Sharing expertise\n", "abstract": " The field of knowledge management focuses on how organizations can most effectively store, manage, retrieve, and enlarge their intellectual properties. The repository view of knowledge management emphasizes the gathering, providing, and filtering of explicit knowledge. The information in a repository has the advantage of being easily transferable and reusable. But it is not easy to use decontextualized information, and users often need access to human experts.This book describes a more recent approach to knowledge management, which the authors call\" expertise sharing.\" Expertise sharing emphasizes the human aspects--cognitive, social, cultural, and organizational--of knowledge management, in addition to information storage and retrieval. Rather than focusing on the management level of an organization, expertise sharing focuses on the self-organized activities of the organization's members. The book …", "num_citations": "23\n", "authors": ["1182"]}
{"title": "\" If these walls could talk\" designing with memories of places\n", "abstract": " This work explores the potential value of using the enormous amount of activity traces latest ubicomp environments have started to capture. We sought to understand potential practices of using these traces in the long term through a field-based study in the USA that examines how today's people use traces left by their predecessors in the houses where they live.", "num_citations": "22\n", "authors": ["1182"]}
{"title": "Bringing the field into the lab: supporting capture and replay of contextual data for the design of context-aware applications\n", "abstract": " When designing context-aware applications, it is difficult to for designers in the studio or lab to envision the contextual conditions that will be encountered at runtime. Designers need a tool that can create/re-create naturalistic contextual states and transitions, so that they can evaluate an application under expected contexts. We have designed and developed RePlay: a system for capturing and playing back sensor traces representing scenarios of use. RePlay contributes to research on ubicomp design tools by embodying a structured approach to the capture and playback of contextual data. In particular, RePlay supports: capturing naturalistic data through Capture Probes, encapsulating scenarios of use through Episodes, and supporting exploratory manipulation of scenarios through Transforms. Our experiences using RePlay in internal design projects illustrate its potential benefits for ubicomp design.", "num_citations": "22\n", "authors": ["1182"]}
{"title": "Impromptu: managing networked audio applications for mobile users\n", "abstract": " This paper discusses the software architecture of Impromptu, a mobile IP-based audio computing platform, with an associated set of network-based applications and services. Impromptu merges the communication properties and universal mobility of the telephone with the multi-tasking and open protocol world of the handheld PC. Its supporting architecture handles multiple streaming audio applications, provides speech services for consistent audio user interfaces across applications, and enables user management of these varied applications running simultaneously.", "num_citations": "22\n", "authors": ["1182"]}
{"title": "Such easy-to-use systems! How organizations shape the design and use of online help systems\n", "abstract": " Despite the pervasiveness and proliferation of computerized systems, people still get stuck when they are trying to use them. Because organizations are heavily invested in their systems, they seek efficient and effective means to allocate necessary resources to make systems usable. Online help systems attempt to provide such targeted assistance in a variety of modes. This paper will review several online help systems, highlighting the organizational issues inherent in online help by focusing on the organizational arrangements that contextualize the design and use of these systems.", "num_citations": "22\n", "authors": ["1182"]}
{"title": "KidKeeper: Design for capturing audio mementos of everyday life for parents of young children\n", "abstract": " Children grow up fast. Many parents want to capture the candid, fleeting moments of their young children's lives to treasure later, but these moments are difficult to anticipate and to capture without disruption. Current technologies to address this are limited to indiscriminately capturing everything, or are dependent on parents' presence and prescience to initiate capture and manually record the moment. To address these limitations, we introduce KidKeeper, a toy-like system to capture, select, and deliver everyday family memories with minimal effort and disruption to family life. It uses an innovative approach to capture that we call\" integrated capture,\" that combines previous attempts to continuously capture family memories with the practice-oriented approach of\" unremarkable computing\" to embed capture capabilities unobtrusively into everyday activities. In our study, we explore how technologies like KidKeeper …", "num_citations": "20\n", "authors": ["1182"]}
{"title": "Information work in bone marrow transplant: Reducing misalignment of perspectives\n", "abstract": " Patients are often overwhelmed in their efforts to understand their illnesses and determine what actions to take. In this paper, we want to show why care is sometimes not co-managed well between clinicians and patients, and the necessary information is often not well coordinated. Through a 2.5-year field study of an adult bone marrow transplant (BMT) clinic, we show there are different experiences of temporal ordering, or temporalities, between clinicians and patients (and their caregivers). We also show that misalignments between these temporalities can seriously affect the articulation (coordination) and information work that must go on for people to co-manage their conditions with clinicians. As one example, information flows can be misaligned, as a result of differing temporalities, causing sometimes an overwhelming amount of information to be presented and sometimes a lack of properly contextualized …", "num_citations": "20\n", "authors": ["1182"]}
{"title": "The ProD framework for proactive displays\n", "abstract": " A proactive display is an application that selects content to display based on the set of users who have been detected nearby. For example, the Ticket2Talk [17] proactive display application presented content for users so that other people would know something about them.", "num_citations": "20\n", "authors": ["1182"]}
{"title": "Toward health information technology that supports overweight/obese women in addressing emotion-and stress-related eating\n", "abstract": " Emotion-and stressed-related eating (ESRE) is associated with weight management difficulties and is more likely to affect women than men. Additionally, health information technology (HIT) for weight management tends to be less effective for women than it is for men, and less effective for people who engage in ESRE. Therefore, this study explores how HIT can support overweight/obese women curb ESRE behavior. Study participants, all adult overweight/obese women (BMI'25), logged dietary intake for 10 days with the Lose It! smartphone app as an elicitation exercise. Cross sectional, semi-structured interviews (N= 22) were then conducted to explore technology support needs concerning ESRE behavior. Findings revealed participants had the following needs: holistic health goal development, building motivation to achieve goals, and assistance with handling stress. Resulting HIT guidelines include supporting …", "num_citations": "19\n", "authors": ["1182"]}
{"title": "Memory in the small: Combining collective memory and task support for a scientific community\n", "abstract": " Many forms of memory exist embedded within the processes and tasks of an organization or community. Memory in the small, or memory utilized in the performance of an institutionally important task, serves as an effective task support mechanism. By basing memory on tasks (and basing task support on memory), memory systems can provide additional and necessary support services for organizations and communities. As an example of memory in the small, in this article we describe a software system, called the ASSIST, that combines memory with task performance for a scientific community. The ASSIST utilizes and stores the collective memory of astrophysicists about data analysis, and is used worldwide by astrophysicists. In this article, we also consider the architectural and theoretical issues involved when combining memory with task performance.", "num_citations": "19\n", "authors": ["1182"]}
{"title": "Beyond usability: taking social, situational, cultural, and other contextual factors into account\n", "abstract": " Design and evaluation in mainstream HCI have often relied on scientific measurements of efficiency and error. Although usability and usefulness are still primary concerns for HCI, researchers and designers in the field are attempting to move beyond, investigating a variety of approaches such as user experience, aesthetic interaction, ambiguity, slow technology, and various ways to understand the social, cultural, and other contextual aspects of our world. While some are driven by non-utilitarian theoretical frameworks, many are not informed by any particular framework or theory. Regardless, there has not been a coherent body of discussion in the field of HCI. This SIG will provide a forum for people to discuss current and future design approaches that move beyond usability. It will address both the relation of underlying paradigms and the relation of design and research.", "num_citations": "18\n", "authors": ["1182"]}
{"title": "Metaphors along the information highway\n", "abstract": " It is absolutely essentially that the metaphors of use surrounding the NII and its component services be examined critically. We need to do this for two reasons. The descriptions and explanations of the NII and its component services will affect the societal debate around implementation and social impacts. Some of the metaphors used to describe the NII, however, distort the real effects and possibilities inherent in the NII.The NII's use is likely to have dramatic effects on our notions of democracy, eduction, community, equality and other important features of our society. Nonetheless, the terms of acceptance and adoption for the NII are not yet set societally. It is important to do this critical examination now, before the metaphors and terms get permanently established.", "num_citations": "18\n", "authors": ["1182"]}
{"title": "Kurator: Using the crowd to help families with personal curation tasks\n", "abstract": " People capture photos, audio recordings, video, and more on a daily basis, but organizing all these digital artifacts quickly becomes a daunting task. Automated solutions struggle to help us manage this data because they cannot understand its meaning. In this paper, we introduce Kurator, a hybrid intelligence system leveraging mixed-expertise crowds to help families curate their personal digital content. Kurator produces a refined set of content via a combination of automated systems able to scale to large data sets and human crowds able to understand the data. Our results with 5 families show that Kurator can reduce the amount of effort needed to find meaningful memories within a large collection. This work also suggests that crowdsourcing can be used effectively even in domains where personal preference is key to accurately solving the task.", "num_citations": "17\n", "authors": ["1182"]}
{"title": "Precarious interventions: Designing for ecologies of care\n", "abstract": " In this paper, we present ethnographic account of people's everyday behavioral health experiences in the city of Jackson, Michigan to explore community forms of care work through an infrastructural lens. Detailing people's interactions with clinical processes and health policies, local resources, and diverse social worlds, we highlight problematic healthcare delivery gaps, as well as the informal (and often invisible) practices people depend upon to manage their health needs given socioeconomic hardships and cultural concerns. We also discuss the city's efforts to support local behavioral health needs through the development of a community health record. Placing fieldwork findings in conversation with the goals of this ongoing civic design project, we propose the analytic sensibility of precarious intervention to unpack the significance of the infrastructural tensions and power relations at play when people seek …", "num_citations": "16\n", "authors": ["1182"]}
{"title": "Do I Care: Tell me what’s changed on the Web\n", "abstract": " We describe the Do-I-Care agent, which uses machine learning to detect\" interesting\" changes to Web pages previously found to be relevant. Because this agent focuses on changes to known pages rather than discovering new pages, we increase the likelihood that the information found will be interesting. The agent’s accuracy in finding interesting changes and in learning is improved by exploiting regularities in how pages are changed. Additionally, these agents can be used collaboratively by cascading them and by propagating interesting findings to other users’ agents.", "num_citations": "16\n", "authors": ["1182"]}
{"title": "Curating an infinite basement: understanding how people manage collections of sentimental artifacts\n", "abstract": " Valuable memories are increasingly captured and stored as digital artifacts. However, as people amass these digital mementos, their collections are rarely curated, due to the volume of content, the effort involved, and a general lack of motivation, which can result in important artifacts being obscured and forgotten in an accumulation of content over time. Our study aims to better understand the challenges and goals of people dealing with large collections, and to provide insight into how people select and pay attention to large collections of digital mementos. We conducted an interpretivist analysis of forum data from UnclutterNow. com, where participants discussed issues they face in curating the sentimental artifacts in their homes. We uncovered a number of social, temporal, and spatial affordances and concerns that influence the ways that people curate their memories, and discuss how curation is closely tied to …", "num_citations": "15\n", "authors": ["1182"]}
{"title": "Knowledge management in practice: a special issue\n", "abstract": " Organizations of different kinds, from structured companies up to social networks or virtual communities, are becoming increasingly aware of the need to collect, organize, mobilize, and increase the expertise and knowledge which characterize their ability to stay alive, adapt, and evolve in a turbulent context. Knowledge Management (KM) is the current term for the different organizational and technological approaches to answer this need. KM, from a management perspective, is an attempt to rationalize and manage the vast amounts of formal and informal knowledge that any organization, especially large companies, has. KM, from a practice perspective, investigates the everyday practices that lead to organizationally situated use of that formal and informal knowledge (Ackerman et al. 2008). While the KM discourse has long been focusing on opportunities to externalize and represent knowledge in artifacts, the …", "num_citations": "14\n", "authors": ["1182"]}
{"title": "Communitynetsimulator: Using simulations to study online community networks\n", "abstract": " Help-seeking communities have been playing an increasingly critical role the way people seek and share information online, forming the basis for knowledge dissemination and accumulation. Consider:                                 About.com, a popular help site (http://about.com), boasts 30 million distinct users each month                                               Knowledge-iN, a Korean site (http://kin.naver.com/), has accumulated 1.5 million question and answers.", "num_citations": "14\n", "authors": ["1182"]}
{"title": "Observations on using speech input for window navigation.\n", "abstract": " We discuss the suitability of speech recognition for navigating within a window system and we describe Xspeak, an iinpleinentation of voice control for the X Window System. We made this interface available to a number of student programmers, ancl compared the use of speech and a pointer for window navigation through empirical and observational means. Our experience indicates that speech was attractive for some users, and we coininent on their activities and recognition accuracy. These observations reveal pitfalls and advantages of using speech input in wiilclows systems.", "num_citations": "14\n", "authors": ["1182"]}
{"title": "Issues and opportunities in transitions from speciality care: a field study of bone marrow transplant\n", "abstract": " Transitional points in patient care, such as handoffs and hospital discharges, are known to have unique information challenges. Transitions following long-term care involve even more complex processes. In this study, we examine the informational and contextual issues for patients transitioning from the care of specialists who have come to know them through long-term partnerships to clinicians potentially less familiar with patients’ chronic care concerns. The context is bone marrow transplant (BMT); specifically allogeneic transplants, which involve risk for particular chronic complications and a long-term process that requires close monitoring of patients by BMT specialists for at least a year beyond the actual transplant procedure. Based on a 16-month field study, we examine patient experience and clinician viewpoints regarding the transition of patient responsibility from BMT clinicians to primary care or oncologists …", "num_citations": "13\n", "authors": ["1182"]}
{"title": "The use of aesthetics in HCI systems\n", "abstract": " As computing expands its domain from workplace to pervasive and domestic environments, interest in aesthetics for designing is increasing in HCI. HCI literatures in aesthetics provide wide variety of theoretical foundations for how aesthetics might be interpreted and potentially used for design. However, aesthetics in designing HCI systems have been mainly studied as a source for decoration or visualizing information. In this paper, we present our initial investigation on a qualitative study with an awareness information system prototype to explore what decorative artallcan bring to HCI systems beyond decoration and/or effective communication.", "num_citations": "13\n", "authors": ["1182"]}
{"title": "Yeah, the Rush ain't here yet-Take a break: Creation and use of an artifact as organizational memory\n", "abstract": " In order to understand organizational memory, it is important to understand how things become adopted as memory resources in organizations. In this paper, we describe the genesis and use of an artifact that became a memory resource for a wide range of activities. We discuss how the creation and use of the rush cheat sheet (RCS) and its associated representations at Dallas Ft. Worth TRACON brought together information and expert knowledge across organizational boundaries. Multi-organizational information became synthesized in a composite that could be used as a resource by the contributing organizations, acting as a boundary object. However, it is multiple representations of the same data that enable it to be so used. Using distributed cognition theory, we examined the conditions under which data transforms from an internal resource to a boundary object; speculating about domain generalization.", "num_citations": "13\n", "authors": ["1182"]}
{"title": "Understanding localness of knowledge sharing: a study of Naver KiN'here'\n", "abstract": " In location-based social Q&A, the questions related to a local community (eg local services and places) are typically answered by local residents (ie who have the local knowledge). In this work, we wanted to deepen our understanding of the localness of knowledge sharing through investigating the topical and typological patterns related to the geographic characteristics, geographic locality of user activities, and motivations of local knowledge sharing. To this end, we analyzed a 12-month period Q&A dataset from Naver KiN\" Here\" and a supplementary survey dataset from 285 mobile users. Our results revealed several unique characteristics of location-based social Q&A. When compared with conventional social Q&A sites, Naver KiN\" Here\" had very different topical/typological patterns. Naver KiN\" Here\" exhibited a strong spatial locality where the answerers mostly had 1-3 spatial clusters of contributions, the topical …", "num_citations": "12\n", "authors": ["1182"]}
{"title": "Researching telemedicine: Capturing complex clinical interactions with a simple interface design\n", "abstract": " Telemedicine has been shown to be an effective means of managing follow-up care in chronic diseases such as depression. Exactly why telemedicine calls work, however, remains largely unknown because there are no adequate research tools to describe the complex communicative interactions in these encounters. We report here an ongoing project to investigate the efficacy of telemedicine in depression care, arguing that technical communication specialists have unique contributions to make to this kind of research.", "num_citations": "12\n", "authors": ["1182"]}
{"title": "Information entrepreneurialism, information technologies, and the continuing vulnerability of privacy\n", "abstract": " In the early 1990s Lotus Development Corporation announced plans to market a CD-based database of household marketing data, Marketplace: Household. Lotus Marketplace: Household would have given anyone with a relatively inexpensive Apple Macintosh access to personal data on more than 120 million Americans (Levy, 1991; Culnan, 1993). Lotus Marketplace: Household is only one example of surveillance and monitoring technologies and products. Many similar cases can be found. In 1991, for example, the Metromail division of RR Donnelley obtained names from voter-registration lists to sell to direct mail campaigns, violating state laws (Wartzman, 1994). More recently, in 1994 the Orange County, California sheriff's department constructed a text and photo database of possible gang members to help thwart a growing trend of ethnic gang violence. The database included many teenagers of Hispanic or …", "num_citations": "12\n", "authors": ["1182"]}
{"title": "Answer garden and the organization of expertise\n", "abstract": " Answer Garden facilitates the building of anorganizational memOTy for commonly asked questions and their answers. The system includes an easy-to-use set of information retrieval engines, includinga branching network of diagnostic questions. If the answer to the user's need is not present in the database, the system automatically routesthe question to the appropriate human expert, and the answer is returned to the user as well as inserted into the branching network and database.", "num_citations": "11\n", "authors": ["1182"]}
{"title": "Practice-based CSCW Research: ECSCW bridging across the Atlantic\n", "abstract": " Practice-based CSCW research is an orientation towards empirically-grounded research embracing particular methodological approaches with the aim of creating new theory about work, collaboration, and cooperative technologies. While practice-based CSCW research has several strong roots in both North America and Europe: ECSCW and Europe remain central to this tradition. In this panel we will discuss the practice-based research approach asking questions such as: What is the nature of Practice-based Computer Supported Cooperative Work research? How is it different from other CSCW research approaches? What is the relationship between these traditions in terms of conceptual approaches, methodologies and open questions for future research? This panel will discuss openly the diversity and commonalities between different CSCW traditions-and argue that practice-based CSCW research is not …", "num_citations": "10\n", "authors": ["1182"]}
{"title": "Social overlays: Collectively making websites more usable\n", "abstract": " Many small organizations lack the expertise and resources to conduct usability evaluations of their websites. Social Overlays, presented here, is a new system that allows a community of users to collectively improve their website.                 Social Overlays enables end–users to identify and repair common user interface problems through creating “overlays” on web pages as part of their regular use, thereby improving usability while reducing the need for professional services. In short, Social Overlays harnesses the diversity of experience and ideas within a community to \"crowd source\" usability.                 To evaluate Social Overlays, we examined whether a group of community members without any usability training could use Social Overlays to identify and repair UI problems on their medium–sized community’s website. We found that they could. Community users were able to uncover a large number of UI …", "num_citations": "10\n", "authors": ["1182"]}
{"title": "Supporting collaborative help for individualized use\n", "abstract": " In this paper, we seek to advance the research around utilizing collaborative help for supporting individualized use of technologies. We do this by shedding light on the ways that users of MythTV, a highly flexible open-source software system for home entertainment enthusiasts, collaboratively help one another in maintaining their individualized MythTV systems. By analyzing the MythTV user community's mailing list archive, documentation, and wiki, coupled with user interviews we discuss how the community utilizes configuration artifacts as proxies to easily mobilize and exchange knowledge. While exchanging concrete artifacts such as scripts and configuration files was seen to sometimes increase the efficiency of knowledge transfer, it also presented several challenges. Negotiating the transparency of configuration artifacts, navigating the customization and appropriation gulfs, and aligning usage trajectories all …", "num_citations": "10\n", "authors": ["1182"]}
{"title": "The national virtual observatory\n", "abstract": " Like many scientific communities, the astronomy community faces a coming avalanche of data as instrumentation improves in quality as well as in its ability to integrate with computational and data resources. Unlike scientific fields that are oriented around a small number of major instruments, such as high-energy physics, astronomers use a large number of telescopes located around the world that are designed and calibrated to look at celestial objects in fundamentally different ways. Both space and terrestrial telescopes are designed to observe objects across a narrow part of the energy spectrum, typically focusing on a small part of the spectrum from the infrared to X-ray wavelengths. While each telescope has the potential to reveal and characterize new astronomical objects, even more powerful would be the ability to combine the data produced by each of these instruments to create a unified picture of the observable universe. This data fusion requires federating a large number of data sets, and developing the search and analysis routines that allow investigation across multiple wavelengths.The National Virtual Observatory (NVO) project is funded by the National Science Foundation (NSF) to provide the cyberinfrastructure necessary to support the federation of a large number of astronomical data sets, allowing search across multiple data sets and the development of simulations that incorporate many types of astronomical data. 1 Through the development of tools and standardized data models, the NVO hopes to enable the combination of multiple pointed-observation telescopes and sky surveys into a large, unified data set that effectively …", "num_citations": "10\n", "authors": ["1182"]}
{"title": "Design considerations for semi-automated tracking: self-care plans in spinal cord injury\n", "abstract": " Self-care in Spinal Cord Injury (SCI) is highly complex and individualized. Patients struggle to adapt to life with SCI, especially when they go home after rehabilitation. We conducted a field study to understand how self-care plans work for patients in their lived experience and what requirements there might be for an augmentative system. We found that patients develop their own self-care plans over time, and that routinization plays a key role in SCI self-care. Importantly, self-care activities exist in different states of routinization that have implications for the technological support that should be provided. Our findings suggest that self-care can be supported by different types of semi-automated tracking that account for the different routinization of activities, the collaborative nature of care, and the life-long, dynamic nature of this condition. The findings from our study also extend recent guidelines for semi-automated …", "num_citations": "9\n", "authors": ["1182"]}
{"title": "The way I talk to you: Sentiment expression in an organizational context\n", "abstract": " Sentiment is a rich and important dimension of social interaction. However, its presence in computer-mediated communication in corporate settings is not well understood. This paper provides a preliminary study of people's expression of sentiment in email conversations in an organizational context. The study reveals that sentiment levels evolve over time during the process of newcomers' socialization, that sentiment varies according to tie-strength with the recipient, and that sentiment patterns can be indicative of one's position in the corporate social network as well as job performance. These findings shed light on the complex and dynamic nature of sentiment patterns, and would inspire further explorations and applications of sentiment analysis in organizations.", "num_citations": "9\n", "authors": ["1182"]}
{"title": "Exploring social dimensions of personal information management with adults with AD/HD\n", "abstract": " Studies in personal information management (PIM) have primarily examined PIM behavior as an individual activity. In this paper, we discuss social dimensions of PIM, more specifically, socially derived PIM activities. The biggest challenge adults with Attention Deficit/Hyperactivity Disorder (AD/HD) face is managing information and tasks. Accordingly, online forums for sharing PIM strategies is a wide spread practice among many individuals with AD/HD. Those that are not engaged in online forums are also found to often rely on social resources in forming PIM strategies. We discuss social dimensions of PIM emerged from our 16 interviews with adults with AD/HD and coaches of AD/HD. Our findings provide a good starting point towards understanding the social, adaptive and evolutionary nature of PIM practices, which would later inform design implications.", "num_citations": "9\n", "authors": ["1182"]}
{"title": "Sharing map annotations in small groups: X marks the spot\n", "abstract": " Advances in location-sensing technology, coupled with an increasingly pervasive wireless Internet, have made it possible (and increasingly easy) to access and share information with context of one’s geospatial location. We conducted a four-phase study, with 27 students, to explore the practices surrounding the creation, interpretation and sharing of map annotations in specific social contexts. We found that annotation authors consider multiple factors when deciding how to annotate maps, including the perceived utility to the audience and how their contributions will reflect on the image they project to others. Consumers of annotations value the novelty of information, but must be convinced of the author’s credibility. In this paper we describe our study, present the results, and discuss implications for the design of software for sharing map annotations.", "num_citations": "9\n", "authors": ["1182"]}
{"title": "Obsolescence: Uncovering values in technology use\n", "abstract": " Orlando, in his book Obsolete Objects in the Literary Imagination, interprets the listing of the objects in this sonnet as intensifying “the primary defunctionalization of the things”(18). Until line 5, the old objects in the chest seemed to bring good reminiscence. In line 6, on the contrary, these objects suddenly turn into “great clutter”, which needs to be sold in order to be replaced with “some nice fresh roses”. This is a representative example of how obsolescence is construed in our everyday lives. Obsolete objects bring memories, warmth, and nostalgia, yet we often view them as the defunctionalized, impractical, uncertain, or worthless that will eventually have to be replaced with the new.When it comes to technological objects, functionality, efficiency, and usefulness are the central reasons for their existence. Accordingly, becoming obsolete poses a great challenge towards the reason for their existence, raising our perception about obsolete technology as a waste. Strasser (Strasser) wrote in the 1920s—“economic growth was fueled by what had once been understood as waste.” This notion carries over to today’s computing environment in which the high rate of machine turnover translates into tremendous profitability for the computing industries. Hence planned obsolescence, planning and engineering the obsolescence, became a long-established principle in American consumer economics (Sterne).", "num_citations": "9\n", "authors": ["1182"]}
{"title": "Designing for all users: including the odd users\n", "abstract": " The field of HCI has played an important role in broadening the spectrum of users of computational artifacts. However, users with extreme preferences are mostly ignored by the designers and researchers because they do not constitute a large portion of the market and the users lack generalizable characteristics. In order to further discuss these concerns, this paper introduces a case about the extreme users and the challenges they face. The paper ends with discussing future directions and challenges in designing for all users in the field of HCI.", "num_citations": "9\n", "authors": ["1182"]}
{"title": "The birth of an organizational resource: The surprising life of a cheat sheet\n", "abstract": " In this chapter, we describe the genesis and use of an artifact that became a resource for a wide range of activities. We discuss how the creation and use of the rush cheat sheet (RCS) and its associated representations at the Dallas-Ft. Worth TRACON (Tower Radar Approach Control) brought together information and expert knowledge across organizational boundaries. Multi-organizational information became synthesized in a composite that could be used as a resource uniquely by the contributing organizations, as well as by different roles within each organization.", "num_citations": "9\n", "authors": ["1182"]}
{"title": "Developing for privacy: Civility frameworks and technical design\n", "abstract": " The Sunday Boston Globe of January 30, 2000 was very representative of current newspapers. In addition to the usual mayhem, fires, weather, traffic accidents, and sports, the newspaper contained a number of Internet related stories, all roughly on a similar topic. A page one story discussed Internet gambling. Even though it is illegal in US, Internet gambling has merely moved offshore. Another story reports the widow of Frank Malina, an artist, has been sued over the word “Leonardo.” Malina founded an academic journal called “Leonardo” in 1968, but a French corporation is claiming trademark damages because the journal shows up in Web searches for their site “Leonardo”. Another story tells people how to avoid auction scams on e-bay and similar Web sites.Even Miss Manners, an etiquette column, wades in. Judith Martin, its author, admonishes people not to spread idle gossip in Internet forums. She notes …", "num_citations": "9\n", "authors": ["1182"]}
{"title": "Socio-technical design for the care of people with spinal cord injuries\n", "abstract": " The Spinal Cord Injury Living and Learning System helps spinal cord injury (SCI) patients to acquire self-care skills through a clinician-managed virtual coaching program. It does this within a “smart” sensor-rich environment that helps monitor people with SCI and provides feedback to them, their caregivers, and clinicians. In this chapter, we discuss the basic design of the system, the requirements analysis and formative evaluation, and the technical lessons learned. We note the issues of sensor completeness and computational completeness in the technical design. We close with an analysis of what it means to design within a rapidly changing technical environment, one where the capabilities and constraints are unclear. The problem, as we discuss, is understanding how the social requirements and the unclear technical will join together over time, which we call the socio-technical trajectory problem in design.", "num_citations": "7\n", "authors": ["1182"]}
{"title": "Supporting reflection through play: field testing the home trivia system\n", "abstract": " In this work, we designed and field-tested a system called Home Trivia to explore how we can use activity traces captured in the home to allow household members to reflect on how they use technology, which has become an issue of increasing concern among families that have seen their home lives intertwined with Internet-enabled devices. Home Trivia captures traces of using technology at home and then shows those traces to family members as content of a puzzle game they can play together. The results of testing Home Trivia in the field show that the design of the game allows engagement and reflection to reinforce each other. Moreover, our work enriches and further develops the idea of using ambiguity as a resource for design with the insight that allowing users to reduce ambiguity through recollecting past events and communicating with others can help trigger reflection.", "num_citations": "7\n", "authors": ["1182"]}
{"title": "Computerization and information assembling process: nursing work and CPOE adoption\n", "abstract": " This paper presents an ethnographic study investigating how nurses assemble information to start their shift's work. We examined this process before and after the adoption of a Computerized Prescriber Order Entry (CPOE) system in an inpatient unit of a large teaching hospital. Before the CPOE adoption, nurses used several collaboratively-created group working documents to assist in this information assembling process; after the CPOE adoption, they mainly used the CPOE itself for their information needs. We found while computerization facilitated medical data assembling process and improved order handling practice, it also resulted in some information gaps in understanding patients in their larger care context. We analyzed what it means when the computerization of medical information turns local knowledge into more readily available and public information objects, as well as what that means for patients …", "num_citations": "7\n", "authors": ["1182"]}
{"title": "Extra-technical information for method libraries\n", "abstract": " With the development of a number of problem-solving method (PSM) libraries, recent work has focused on the need for a method description language to describe PSMs for easier retrieval, understanding and reuse. Fensel, et al.(1999) have proposed a Unified Problem-solving Method Development Language (UPML) to address this need. However, to date, this language is focused on formal descriptions of capabilities, and on ontologies that describe inputs and outputs. While these technical descriptions of a method are clearly important, we suggest that other extra-technical information about PSMs can be essential for cost-effective reuse. This information is especially important for those PSMs that are available as an implemented software product. In some user communities, these informal, pragmatic data about a method are as important as any description of the capabilities of a method. Thus, we suggest that expanding UPML in this direction is an important research task. As an initial step, we propose a set of attributes and features that should be added to UPML in order to capture and use extra-technical information about PSMs.", "num_citations": "7\n", "authors": ["1182"]}
{"title": "Using collective intelligence for supporting diabetes patients\n", "abstract": " Research has shown that online health communities have become places with increasing potential for getting emotional as well as informational support through interactions with peer patients. However, further work is needed to support the specialized problems that many patients have. In this paper, we present our qualitative study on diabetes patients’ face-to-face support groups and online communities. Our preliminary results show four patient needs in controlling diabetes: understanding uncommon symptoms; finding where one stands; understanding the effectiveness of new interventions; and knowing patient profiles. These needs point to design implications that could greatly benefit from using techniques in collective intelligence (CI) both in further analyzing the needs among online community users as well as in assisting patients in fulfilling their needs.", "num_citations": "6\n", "authors": ["1182"]}
{"title": "Answer Garden: A tool for growing organizational memory.\n", "abstract": " Degree: Ph. D.DegreeYear: 1994Institute: Massachusetts Institute of TechnologyAnswer Garden allows organizations to develop databases of commonly asked questions that grow\" naturally\" as new questions arise and are answered. It is designed to help in situations (such as customer\" hot lines\" or help desks) where there is a continuing stream of questions, many of which occur over and over, but some of which the organization has never seen before. Answer Garden includes a branching network of diagnostic questions, as well as additional information retrieval methods, that help users find the answers they want. If the answer is not present, the system automatically routes the question to the appropriate expert, and the answer is returned to the user as well as inserted into the information database. Experts can also modify this network in response to users''problems. Through their normal interactions, users and …", "num_citations": "6\n", "authors": ["1182"]}
{"title": "Supporting Collaboratively Constructed Independence: A Study of Spinal Cord Injury\n", "abstract": " Independence is a central concern for people in the care of many chronic conditions. It is often viewed as a goal that can be facilitated with the use of patient data. It is also viewed, especially from the medical side, as something an individual achieves. However, in the lived experience, independence is often a set of collaborative practices. In this paper, we unpack findings from an interview-based study of Spinal Cord Injury (SCI) self-care. We found that independence - both functional and in the form of effecting agency - must be co-constructed by the choices and activities of the care network, including the person with disability, caregivers, and clinicians. This collaboratively shaped independence also affects potential collection and use of data in support of self-care. We describe how collaboratively shaped independence informs requirements and constraints for the design of sensor-based networks for self-care in …", "num_citations": "5\n", "authors": ["1182"]}
{"title": "Communities and Technologies 2007: Proceedings of the Third Communities and Technologies Conference, Michigan State University 2007\n", "abstract": " This book covers the relationship between information and communication technologies (ICTs) and communities–both physical and virtual. Community technology applications are studied in many contexts. The book demonstrates the dynamic and interdisciplinary nature of evolving communities and technologies scholarship.", "num_citations": "5\n", "authors": ["1182"]}
{"title": "SISN: a toolkit for augmenting expertise sharing via social networks\n", "abstract": " The current study attempts to address the social-technical gap by developing a toolkit that can help information seekers to search for expertise and seek information via their social networks. The focus of the current study is technical development of a toolkit that supports expertise sharing via social networks. Once such a toolkit is in place, it can facilitate researches that are more concerned with applications in social and organizational perspectives. Following a proposed full-fledged social network-powered expert searching and information sharing framework on the theoretical side, the study then reports a toolkit of Seeking Information via Social Networks (SISN), which is a general-purpose toolkit for social network-based information sharing applications that combines techniques in information retrieval, social network, and peer-to-peer system.", "num_citations": "5\n", "authors": ["1182"]}
{"title": "CommunityNetSimulator: Using simulation to study online community network formation and implications\n", "abstract": " Help-seeking communities have been playing an increasingly critical role the way people seek and share information online, forming the basis for knowledge dissemination and accumulation. Consider:  About. com, a popular help site", "num_citations": "5\n", "authors": ["1182"]}
{"title": "Personal and Ubiquitous Computing\n", "abstract": " These days, it seems that wherever computers are, privacy and security problems arise. From identity theft to feelings of invasion by spam email to evidence in criminal cases from surveillance cameras, privacy and security are hot topics, even in the popular press. There are many aspects of the ‘‘privacy problem’’and the ‘‘security problem.’’When Chris recently opened a bank account for his daughter, he witnessed many of them in an environment that was far from ‘‘ubiquitous computing.’’First, she refused to give the bank clerk her social security number (a financial ‘‘national identity number’’in the US) because she had learned that one must safeguard this information to protect against identity theft. The clerk, revealing as much information as many ‘‘input error’’Web pages, simply said,‘‘I can’t open an account for you without a social security number.’’Chris patiently explained to his daughter that, legally, the bank …", "num_citations": "5\n", "authors": ["1182"]}
{"title": "Everything you need to know about collaboration and collaboration software\n", "abstract": " We develop computationally fast and storage efficient implementations for the Kahnan-Bucy filter (KBf) for data assimilation problems with large time varying multidimensional fields. We refer to them as the block KBf (bKBf) and the localized block KBf (1bKBf). For fields defined on a 2D lattice of linear dimension I, the bKBf reduces the computational complexity of the KBf by O (I). The 1bKBf saves further on computations by a factor of I and decreases the storage requirements by O (I). We illustrate the 1bKBf iu assimilating satellite measurements in physical oceanography, presenting simulations for an equatorial beta plane.", "num_citations": "5\n", "authors": ["1182"]}
{"title": "Crowdsourced detection of emotionally manipulative language\n", "abstract": " Detecting rhetoric that manipulates readers' emotions requires distinguishing intrinsically emotional content (IEC; eg, a parent losing a child) from emotionally manipulative language (EML; eg, using fear-inducing language to spread anti-vaccine propaganda). However, this remains an open classification challenge for both automatic and crowdsourcing approaches. Machine Learning approaches only work in narrow domains where labeled training data is available, and non-expert annotators tend to conflate IEC with EML. We introduce an approach, anchor comparison, that leverages workers' ability to identify and remove instances of EML in text to create a paraphrased\" anchor text\", which is then used as a comparison point to classify EML in the original content. We evaluate our approach with a dataset of news-style text snippets and show that precision and recall can be tuned for system builders' needs. Our …", "num_citations": "4\n", "authors": ["1182"]}
{"title": "Willingness to participate in health information networks with diverse data use: evaluating public perspectives\n", "abstract": " Methods:Using a probability-based sample (n= 890), we examined the univariable and multivariable relationships between willingness to participate in health information networks and demographic factors, trust, altruism, beliefs about the public’s ethical obligation to participate in research, privacy, medical deception, and policy and governance using linear regression modeling.Results:Willingness to be a part of a multi-user network that includes health care providers, mental health, social services, research, or quality improvement is low (26 percent–7.4 percent, depending on the user). Using stepwise regression, we identified a model that explained 42.6 percent of the variability in willingness to participate and included nine statistically significant factors associated with the outcome: Trust in the health system, confidence in policy, the belief that people have an obligation to participate in research, the belief that …", "num_citations": "4\n", "authors": ["1182"]}
{"title": "A new generation of CSCW: Reinvigorating CSCW field-based research through a theory-inspired reboot\n", "abstract": " There are those who feel that the CSCW work studies and other interpretivist research streams need to be reinvigorated; they find many CSCW interpretivist studies to be small incremental elaborations over previous studies or studies that elaborate known findings. This paper argues that CSCW has already begun to make intellectual moves that will reinvigorate itself and that others need to be made. The paper traces how Symbolic Interactionism has kept itself vital and alive, noting how it has incorporated modern intellectual turns in the social sciences. The paper then argues that CSCW as a field and as a community needs to make similar moves, updating its theoretical concerns. We feel it is important for the CSCW community to find a communal understanding of the intellectual desirability, if not necessity, of these moves.", "num_citations": "4\n", "authors": ["1182"]}
{"title": "Designing for Lived Health: A Practice-Based Approach for Person-Centered Health Information Technologies\n", "abstract": " Health is almost always a deeply personal issue. As individuals, people struggle to maintain and enhance their health within their own “messiness”—their values, practices, and beliefs.", "num_citations": "4\n", "authors": ["1182"]}
{"title": "Pervasive Help@ Home: connecting people who connect devices\n", "abstract": " We propose a system to allow users of domestic pervasive computing technology to receive indirect help regarding the composition and control of their systems of devices from other users with similar configurations. Our work extends previous work on end-user composition and collaborative assistance and is based around the notion of a shared repository of compositions (called the Composition Community) from which end-users can receive information about typical and best-practice service compositions that are contributed by other community members. A Composition Monitor automatically determines the composition of each user’s network, allowing contributions to the repository to be made without explicit effort. A Composition Visualizer allows users to view and compare different compositions in order to choose the most appropriate one for their needs. The goal of our work is to bring together the knowledge and collective problem solving skills of diverse users who are currently isolated from each other in their separate homes.", "num_citations": "4\n", "authors": ["1182"]}
{"title": "Sustaining community-incentive mechanisms in online systems: Final report of the group 2005 workshop\n", "abstract": " How online communities sustain themselves? Attracting people to an online venue is difficult enough, but once that has been accomplished a number of other questions arise. How do designers ensure that people return? What motivates people to participate? And how does one create an online environment where people not only participate, but participate in such a way that the community, collectively, makes progress towards it goals?For the purpose of this workshop, we use “community” in the loose sense of a large group of people with generally weak ties. Thus we are concerned with everything from well-established applications such as chat rooms and help desks, to more recent examples of successful online systems like Slashdot, Friendster and Wikipedia.", "num_citations": "4\n", "authors": ["1182"]}
{"title": "Designing a web-based decision aid for individuals to consider lung cancer screening\n", "abstract": " Lung cancer screening, a relatively new procedure, is widely considered to be a promising way to address the low chances of survival from this disease by catching it at an earlier, more treatable stage. However, deciding whether to get this screening can be complicated for an individual; as such, patient decision aids are used to facilitate this process. To co-design a lung cancer decision aid, we conducted 5 participatory design workshops with 17 participants from African American and Latinx populations from communities with low resources. We also conducted 5 focus groups with 21 African-American participants to provide evaluative feedback. Through triangulating our fieldwork findings with other stakeholders, we detail the challenges of designing an inclusive decision aid and offer some suggestions with concrete examples, which complement current content-based guidelines, to assist in other patient decision …", "num_citations": "3\n", "authors": ["1182"]}
{"title": "If These Walls Could Talk\n", "abstract": " 1. At some point most of us have probably toured some building of historical significance that caused us to stop and wonder about the people who once lived inside its walls. Share with your group a place that you have visited where have paused for a moment and thought about the stories that could be told if only those walls could talk.a. It is not only buildings with historical significance that have stories to tell. Undoubtedly, every wall that exists or has existed would have a story to relate. Have you ever found yourself driving down a street, looking at the homes and wondering about the people who live within its walls? Take just a moment and list some one-word descriptions of the stories you think the walls on the street where you live might tell if they could only speak?", "num_citations": "3\n", "authors": ["1182"]}
{"title": "Location-aware computing, virtual networks\n", "abstract": " This issue includes four works in process on issues and applications in location-aware computing: letting users set and control privacy policies when they use location-aware applications, cold-starting recommender systems for mobile location-aware services, aggregating contextual information for location-based applications, and applying location-based services to public transportation environments. The department also includes a report on lightweight virtualization of low-power wireless personal area networks.", "num_citations": "3\n", "authors": ["1182"]}
{"title": "Montage: a platform for physically navigating multiple pages of web content\n", "abstract": " Montage is a platform for rendering multiple pages of web content on large tiled displays (several desktop LCDs arranged in a spatially contiguous matrix). We discuss the advantages of data visualization using a newsstand metaphor, showing many content items at once and allowing users to quickly refine visual searches by walking (physically navigating) closer to specific data on the display. We have used Montage to build three applications that demonstrate the variety of applications that are possible on this platform. These applications have benefits for both everyday use and as research tools.", "num_citations": "3\n", "authors": ["1182"]}
{"title": "The politics of design: Next generation computational environments\n", "abstract": " This paper describes and analyzes two next-generation computational environments and their architectures: the Semantic Web and pervasive computing. Each of these necessarily carries with it political assumptions about how the environments will be used, and these political assumptions are reflected in the accompanying computerization movement’s rhetoric. However, unlike\" first growth\" computerization efforts, both the Semantic Web and pervasive computing will result within a growing infrastructure that does not allow topdown design (or even overall design) but within which new designs must fit. The underlying assumptions for both environments are largely libertarian but with differing modalities of user control. This paper examines the libertarian assumptions, the promise of democratization in one but not the other, and the resulting conceptual tensions surrounding these two second-generation computerization movements.", "num_citations": "3\n", "authors": ["1182"]}
{"title": "Designing CIS to improve decisions in depression care management: A discourse analysis of frontline practice\n", "abstract": " Clinical care management promises to help diminish the major health problem of depression. To realize this promise, front line clinicians must know which care management interventions are best for which patients and act accordingly. Unfortunately, the detailed intervention data required for such differentiated assessments are missing in most clinical information systems (CIS). To determine frontline clinicians’ needs for these data and to identify the data that CIS should keep, we conducted an 18 month ethnographic study and discourse analysis of telehealth depression care management. Results show care managers need data-based evidence to choose best options, and discourse analysis suggests some personalized interventions that CIS should and can feasibly capture for evidence.", "num_citations": "3\n", "authors": ["1182"]}
{"title": "A collectivity in an electronic social space\n", "abstract": " University of Toronto, I would like to thank everyone at the DGP lab and Tom Milligan, in particular. I would like to thank the Computer Science Dept. at the University of Toronto for the graduate scholarship and research funding. I would also like to thank my management team at the IBM Toronto Laboratory for their moral support in this submission.", "num_citations": "3\n", "authors": ["1182"]}
{"title": "Extending CSCW into domestic environments (workshop session)\n", "abstract": " This half-day workshop will aim to build a community of interest and research agenda around extending CSCW methods and technologies to home settings. Relevant issues include the coordination of activities in public and private spaces; shared resource technologies; distributed coordination in and between households and the role of technology in everyday life.", "num_citations": "3\n", "authors": ["1182"]}
{"title": "CSCW'96: Proceedings of the ACM 1996 Conference on Computer Supported Cooperative Work, November 16-20, 1996, Boston, Massachusetts, USA\n", "abstract": " Copyright 1996 by the Association for Computing Machinery, Inc.(ACM). Permission to make digital or hard copies of all of this work for personal or classroom use is granted without fee provided that the copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, to republish, to post on servers or to redistribute to lists requires prior specific permission and/or a fee. Request permission to republish from: Publi-cations Dept. ACM, Inc. Fax+ 1 (212) 869-0481 or< permissions@ acm. org> For other copying of articles that carry a code at the bottom of the first or last page, copying is permitted provided that the per-copy fee indicated in the code is paid through the Copyright Clearance Center, 222 Rosewood Drive, Danvers, MA 01923.", "num_citations": "3\n", "authors": ["1182"]}
{"title": "AXAF user interfaces for heterogeneous analysis environments\n", "abstract": " 7. ConclusionMuch of the agcl functionality is based on the facilities of a system called AnswerGarden, which has sophisticated support for examining documentation and help files,", "num_citations": "3\n", "authors": ["1182"]}
{"title": "Localness of Location-based Knowledge Sharing: A Study of Naver KiN “Here”\n", "abstract": " In location-based social Q8A services, people ask a question with a high expectation that local residents who have local knowledge will answer the question. However, little is known about the locality of user activities in location-based social Q8A services. This study aims to deepen our understanding of location-based knowledge sharing by investigating the following: general behavioral characteristics of users, the topical and typological patterns related to geographic characteristics, geographic locality of user activities, and motivations of local knowledge sharing. To this end, we analyzed a 12-month period Q8A dataset from Naver KiN “Here,” a location-based social Q8A mobile app, in addition to a supplementary survey dataset obtained from 285 mobile users. Our results reveal several unique characteristics of location-based social Q8A. When compared with conventional social Q8A sites, users ask and answer …", "num_citations": "2\n", "authors": ["1182"]}
{"title": "The recording and reuse of psychosocial information in care\n", "abstract": " We conducted a field-based, ethnographic study at a large teaching hospital to examine doctors' use and documentation of patient care information, with a special focus on a patient's psychosocial information. We were particularly interested in the gaps between the medical work and representations of the patient. This chapter describes how doctors record this information for immediate and long-term use. We found that doctors documented a considerable amount of psychosocial information in their electronic health record systems; however, we also observed that such information was often recorded too selectively to be effectively reused later. Our study shows how missing or problematic representations of a patient's motivations or social setting affect clinical work activities and patient care. We accordingly suggest that medical systems can be made more useful in the long run by supporting representations of both …", "num_citations": "2\n", "authors": ["1182"]}
{"title": "The intellectual challenge of CSCW\n", "abstract": " Over the last 10 years, ComputerSupported Cooperative Work (CSCW) has identified a base set of findings. These findings are taken almost as assumptions within the field. In summary, they argue that human activity is highly flexible, nuanced, and contextualized and that computational entities such as information sharing, roles, and social norms need to be similarly flexible, nuanced, and contextualized. However, current systems cannot fully support the social world uncovered by these findings. In this article I argue that there is an inherent gap between the social requirements of CSCW and its technical mechanisms. The social–-technical gap is the divide between what we know we must support socially and what we can support technically. Exploring, understanding, and hopefully ameliorating this social–technical gap is the central challenge for CSCW as a field and one of the central problems for human–computer interaction. Indeed, merely attesting the continued centrality of this gap could be one of the important intellectual contributions of CSCW. I also argue that the challenge of the social–technical gap creates an opportunity to refocus CSCW.", "num_citations": "2\n", "authors": ["1182"]}
{"title": "Is ignorance bliss? Informed consent online\n", "abstract": " In this panel, we explore:(1) the impacts of electronic media on informed consent;(2) how electronic media can be designed and used to preserve informed consent;(3) the relationship between protecting privacy and informed consent;(4) the relationship between cultivating trust online and informed consent; and (5) proposed relevant standards and brokering systems. This panel fits within the emerging field of Value-Sensitive Design.", "num_citations": "2\n", "authors": ["1182"]}
{"title": "Public acceptance of evolution in the United States, 1985–2020\n", "abstract": " The public acceptance of evolution in the United States is a long-standing problem. Using data from a series of national surveys collected over the last 35 years, we find that the level of public acceptance of evolution has increased in the last decade after at least two decades in which the public was nearly evenly divided on the issue. A structural equation model indicates that increasing enrollment in baccalaureate-level programs, exposure to college-level science courses, a declining level of religious fundamentalism, and a rising level of civic scientific literacy are responsible for the increased level of public acceptance.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Coding Bias in the Use of Behavior Management Technologies: Uncovering Socio-technical Consequences of Data-driven Surveillance in Classrooms\n", "abstract": " Digital educational technologies have been employed in classrooms to collect students’ behavioral data in the hope of supporting teachers in identifying and correcting undesirable behaviors, which raises the concern of heightened surveillance in classrooms. We present a qualitative study of 20 K-8 teachers to understand their experiences and practices of using ClassDojo, a data-driven classroom behavior management intervention. Our analysis reveals a series of unintended socio-technical effects resulting from the use of ClassDojo in practice. In particular, the use of ClassDojo runs the risk of measuring, codifying, and simplifying the nuanced psycho-social factors that may drive children’s behavior and performance, thereby serving as a “Band-Aid” for deeper issues. We discuss how this process could perpetuate existing inequality and bias in education. With the goals of spurring future design and mitigating …", "num_citations": "1\n", "authors": ["1182"]}
{"title": "The acquisition of health and science information in the 21st century\n", "abstract": " The ways that humans acquire information is undergoing a fundamental change comparable to the introduction of Gutenberg’s printing press and broadcast systems. Using the literature and a growing body of empirical evidence, we describe a model of information acquisition that specifies the roles of education, salience, subject-matter literacy, and navigation skills in the decision to seek information. We refer to this model as a just-in-time information acquisition system. We focus on the acquisition of health information and science information separately and discuss the similarities and differences. We utilize a national U.S. survey to describe adult information acquisition behaviors empirically.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Expertise finding\n", "abstract": " The vision of expertise finding through technical systems is alluring. Organizationally, being able to easily find the requisite expertise whenever required would create a far more efficient organization. Finding the right person to answer a question, whether because of the required arcane knowledge or the complexity of the inquiry, would prevent those asking from being stuck and those asked from being unnecessarily bothered. Knowledge processes could be sped up and improved. Organizational members would not only be able to do their jobs more effectively by getting the help they need, they would also learn from one another, creating meaningful communities of practice (COP)(Lave and Wenger, 1991; Wenger, 1999) and learning organizations (Cohen and Sproull, 1996; Senge, 2006). Using the same mechanisms, managers would be able to more carefully monitor how well expertise was disseminated and used and to more effectively determine where an organization needed to grow its expertise in the topics required for further growth (Fulk, this volume). Expertise finder systems (EFs) help people locate required expertise in organizations and online communities. This is a meaningful and valued new socio-technical functionality that is attractive to organizations hoping to better utilize the expertise of workers. EF systems have evolved substantially over the last twenty years, as organizations and designers have developed a better understanding of the problems associated with the use of these technologies. What one can see is the slow but steady evolution of expertise finding in terms of both its technical and social mechanisms, as one …", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Information (Re) Use in Context\n", "abstract": " Over the last 25-30 years, an enormous amount has been learned about how people seek, use, maintain, and reuse information and expertise in groups and other collectivities. We have also seen major changes in the kinds of information available and in how it is available.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Discount Expertise Metrics for Augmenting Community Interaction\n", "abstract": " Community members would benefit by finding others who can answer questions or provide assistance. We want to find new ways to help find people who have expertise by creating metrics that can easily estimate expertise. In this paper, we explore discount expertise metrics that are easy to obtain and use. We present one such discount expertise metric that uses people’s browsing history to estimate technical expertise. In a study of 26 users, we show that this metric can distinguish experts and novices from others. We also validate this measure by comparing it to the ground truth about our users. We also discuss the possibilities in using measures like this, based on digital traces, to augment interaction within online communities, for example, gauging newcomers in a community of practice or evaluating people in a learning community.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Social overlays: augmenting existing UIs with social cues\n", "abstract": " Social Overlays is a novel toolkit that provides a generalized mechanism for implementing socially-based help on the Web without requiring access to the source code for the target application. As such, third-party developers can use Social Overlays to augment any existing web-based UI with a variety of social navigation cues. We demonstrate the capability of Social Overlays through an example application augmenting the standard PHP configuration page.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Progressive scenarios: a rapid method for understanding user interpretations of technology\n", "abstract": " For emerging group technologies that require evaluations on long-term use and social norms, assumptions, and implicit rules that develop around the technologies, standard usability testing may not be adequate. At the same time, field based research that allows for observing technology use over long-term is costly in terms of time. In this paper, we present a rapid method that we call progressive scenarios, which could help replicate the processes by which interpretations evolve over time in natural settings and how invisible assumptions and social norms dictate the technology use. Using a preliminary design concept of a publicly available ambient personal information and communication system, we demonstrate how the method helped to elicit design implications.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Designing information to facilitate chronic disease management: Clinician–Patient interactions in diabetes care\n", "abstract": " One of the major trends in treating chronic disease is to provide people with the information necessary for keeping their conditions under control and enabling them to self-manage their diseases as much as possible. This is widely thought to be the most cost-effective, self-empowering treatment strategy for better outcomes and adherence. Patients with diabetes, who often struggle with their disease throughout their lives, form an excellent group through which to examine the issues in this current emphasis on disseminating information in chronic disease management. Anecdotally and in research ﬁndings, diabetes clinicians ﬁnd that, as good as their communication of information for self-management might be, in at least 40% of the cases, changes do not “stick”(Yong et al., 2002). For example, patients’ glycosylated hemoglobin levels (HbA1C) often decrease as a result of increased knowledge about diabetes and behaviors to manage it, but 6 months later many patients’ levels creep up again. Even when patients are well informed about the causes of diabetic conditions and the positive consequences of self-care behaviors, and even when patients demonstrate an understanding, long-term self-management and motivation wane. What can we do to create information and communicative exchanges that work? Information technologies are often assumed to be a prime solution. They are able to widely disseminate necessary information for managing diabetes, tailor it to user proﬁles, and alert patients. Speciﬁcally, educational, informational, and selfmanagement Web sites as well as virtual clinics, advanced monitoring technologies, patient access to …", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Challenges in sustainability: Understanding users' appropriation and maintenance work of computational artifacts\n", "abstract": " Computational artifacts in today's computing environment emerge and disappear at a rapid pace. Due to the short life span of computational artifacts, we face challenges at the environmental scale such as increases in waste from old unused computers. Users also face with challenges in maintaining everyday computational resources that become continually outdated. In this workshop, we would like to discuss a group of users who have been independently appropriating and maintaining a DOS based discontinued palmtop called HP200LX (LX) for nearly ten years. From studying these users, we have identified several types of work that are involved in appropriating and maintaining the discontinued machine. Using this finding, we address long term challenges in sustainability in HCI that both designers/producers and users face in producing and making use of computational artifacts.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "A case study of CPOE adoption and use: work-arounds and their social-technical implications.\n", "abstract": " This study applies ethnographically-based methods to investigate the socio-technical issues during and after a CPOE system implementation. The research is conducted in an inpatient unit at an academic medical center, where the CPOE is being implemented and clinicians have found to develop ways to workaround the system. The findings of the study will help improve our understanding of the interaction between people, information, and IT systems in a highly efficient and highly collaborative clinical environment.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Knowledge Management In Action: IFIP 20th World Computer Congress, Conference on Knowledge Management in Action, September 7-10, 2008, Milano, Italy\n", "abstract": " Knowledge management (KM) is more a nd more recognized as a key factor of success for organisations: not only stru ctured companies, but also virtual enterprises, networks of organisations or ev en virtual communities. These organisations of differentki nds, are becoming increasingly aware of the need to collect, organise, mobilise, increase, in sum manage, the knowledge characterising their ability to stay alive, adapt and evolve in a turbulent context. Through various organisationaland t echnological approaches, KM aims at improving knowledge access, sharing and reuse as well as new knowledge creation. KMIA 2008 highlights problems, requirements and solutions that are derived from actual, concrete experiences. The fourteen papers accepted at KMIA 2008 give various answers to the following questions: What organisational strategies can enable to enact and promote KM within organisations? How to link these organisational strategies withth e ICT technology? Organisational strategies can be related to the evolution of the organisation itself or to its environment: intra organisational and inter organisational strategies can thus bedi stinguished. Some papers emphasize the importance of collaboration and knowledge transfer for team work and collaborative projects that may be intra organisational or inter organisational (eg intero rganisational outsourcing relationships). Strategies for designing and manufacturing innovative products are recognised as crucial for enterprises that operate in competitive sectors. Networkso forg anisations can help to improve the competitiveness of these organisations: KM can thus enhance competency …", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Reflections and Conclusions: Toward a Theory of Resources\n", "abstract": " This book has examined a broad range of resources. From the hand gesture that signifies a hypothesis about the configuration of a Thrombin molecule when binding a substrate (Becvar et al., this volume), to material artifacts like the rush cheat sheet (Halverson and Ackerman, this volume), to information systems like Zephyr (Ackerman and Palen, this volume) and CareVue (Reddy and Dourish, this volume), resources run the gamut from the minimal and material to the complex and virtual. The work reported here has explored questions ranging from how resources come into being and how they evolve over time, to the social arrangements that make them what they are.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Surviving the Information Explosion\n", "abstract": " The Problem: A typical person deals with a great deal of electronic information, and it can be overwhelming to keep track of it all. The problems that people have in interacting with large amounts of information are well documented. In 1988 Lansdale outlined some of “the problems of classification and the role of memory” in information organization—in other words, the problems of storing and retrieving information [2]. Lansdale states that the main problem with information organization is that humans have too limited a memory to remember exactly where they file every piece of information, either in the physical world or on their computers. Instead, people remember certain pieces of their organization, such as visual cues or dates, and rely on these pieces to help guide them to the information they need. Unfortunately, existing information organization tools are not tailored to the aspects of electronic information that people recall easily when locating information.Motivation: Haystack is a personal information management tool intended to provide users with centralized access to their personal information. With Haystack we seek to allow users to organize and access their information in a natural way. To allow for natural interactions, we must understand the cues that people use to store and retrieve their information. For example, when looking for a previously received email, a person might recall the email sender, but she may not remember specific words in the body of the email that could be used to generate", "num_citations": "1\n", "authors": ["1182"]}
{"title": "Expertise networks as an enabling technology for cyberspace use\n", "abstract": " Expertise networks are technical augmentations of the ad-hoc social networks that enable people to answer questions, accomplish tasks, and find information. Technologies to create, enhance, and maintain these networks will be important uses of the Net.In this paper, I briefly survey two interrelated things. First, the paper notes the social aspects of the Net that suggest these augmentations would be useful and interesting to do. Second, it discusses some technical directions to augment expertise networks that may change the ways we work and socialize. Because the technical and social are so interwoven in both the design and use of Net applications, at the end of this paper, I also note how important, although difficult, it is to understand the interplay of the technology and the social change.", "num_citations": "1\n", "authors": ["1182"]}
{"title": "An application Provide Task-Based Organizational Memory with Collaborative Help\n", "abstract": " CiNii 論文 - An application Provide Task-Based Organizational Memory with Collaborative Help CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について An application Provide Task-Based Organizational Memory with Collaborative Help ACKERMAN MS 被引用文献: 1件 著者 ACKERMAN MS 収録 刊行物 Proc. Hawaii International Conference of System Sciences Proc. Hawaii International Conference of System Sciences IV, 323-332, 1995 被引用文献: 1件中 1-1件を 表示 1 組織 におけるインフォーマル情報共有モデルとその支援に関する考察 爰川 知宏 情報処理学会論文誌 40(1), 264-272, 1999-01-15 参考文献8件 被引用文献1件 Tweet 各種コード NII論文ID(…", "num_citations": "1\n", "authors": ["1182"]}
{"title": "The Athena Muse Reference Facility\n", "abstract": " This paper reports on the issues of designing electronic reference works. Before the power of the computer medium can be exploited fully, we will need to explore methods and forms of presenting and indexing the resultant information.An experimental system called the Athena Muse Reference Facility (AMRf) has been built at MIT for Project Athena visual workstations (described below). Unlike similar systems, which focus on generic display problems, AMRf concentrates on the issues inherent in designing electronic books. For our initial work, we have focused on electronic reference works. The following paper discusses some of the indexing and interface requirements for such electronic reference systems.", "num_citations": "1\n", "authors": ["1182"]}