{"title": "Beyond lightning: A survey on security challenges in cloud computing\n", "abstract": " Cloud computing is a model to provide convenient, on-demand access to a shared pool configurable computing resources. In cloud computing, IT-related capabilities are provided as services, accessible without requiring detailed knowledge of the underlying technologies, and with minimal management effort. The great savings promised by the cloud are however offset by the perceived security threats feared by users. This paper gives an overview of cloud computing, and discusses related security challenges. We emphasize that although there are many technological approaches that can improve cloud security, there are currently no one-size-fits-all solutions, and future work has to tackle challenges such as service level agreements for security, as well as holistic mechanisms for ensuring accountability in the cloud.", "num_citations": "446\n", "authors": ["365"]}
{"title": "Security requirements for the rest of us: A survey\n", "abstract": " Most software developers aren't primarily interested in security. For decades, the focus has been on implementing as much functionality as possible before the deadline, and patching the inevitable bugs when it's time for the next release or hot fix. However, the software engineering community is slowly beginning to realize that information security is also important for software whose primary function isn't related to security. Security features or mechanisms typically aren't prominent in such software's user interface.", "num_citations": "184\n", "authors": ["365"]}
{"title": "Security SLAs for federated cloud services\n", "abstract": " The federated Cloud paradigm aims to provide flexible and reliable services composed of a mixture of internal and external mini-clouds, but this heterogeneous nature is also fuelling the security concerns of the customers. To allay the fears and deal with the threats associated with outsourcing data and applications to the Cloud, new methods for security assurance are urgently needed. This paper presents current work on Cloud Security Service Level Agreements and our approach on how to manage this in the context of hybrid clouds. The purpose is to facilitate rapid service composition and agreements based on the necessary security requirements and establish trust between the customer and provider. We also show how this can be applied on a realistic case study related to a hybrid Unified Communication service.", "num_citations": "125\n", "authors": ["365"]}
{"title": "Information security incident management: Current practice as reported in the literature\n", "abstract": " This paper reports results of a systematic literature review on current practice and experiences with incident management, covering a wide variety of organisations. Identified practices are summarised according to the incident management phases of ISO/IEC 27035. The study shows that current practice and experience seem to be in line with the standard. We identify some inspirational examples that will be useful for organisations looking to improve their practices, and highlight which recommended practices generally are challenging to follow. We provide suggestions for addressing the challenges, and present identified research needs within information security incident management.", "num_citations": "114\n", "authors": ["365"]}
{"title": "Cyber security challenges in Smart Grids\n", "abstract": " The introduction of telecommunication in the energy grid, leading the way towards Smart Grids, challenges the way safe operations have traditionally been assured in the energy sector. New cyber security challenges emerge, especially related to privacy, connectivity and security management, and these need to be properly addressed. Existing cyber security technology and good practice mainly come from the traditional telecommunication environment where the requirements on safety and availability are less strict. For Smart Grids, lessons can be learned from the oil and gas industry on how they have dealt with security challenges in their implementation of integrated operations. Still, Smart Grids face a slightly different reality, due to their extensive geographical distribution and the enormous number of end-users. The contribution of this paper is a survey of cyber security challenges for Smart Grids, together with a …", "num_citations": "70\n", "authors": ["365"]}
{"title": "A framework for incident response management in the petroleum industry\n", "abstract": " Incident response is the process of responding to and handling security-related incidents involving information and communications technology (ICT) infrastructure and data. Incident response has traditionally been reactive in nature, focusing mainly on technical issues. This paper presents the Incident Response Management (IRMA) method, which combines traditional incident response with proactive learning and socio-technical perspectives. The IRMA method is targeted at integrated operations within the petroleum industry, but it is also applicable to other industries that rely on process control systems.", "num_citations": "66\n", "authors": ["365"]}
{"title": "Deployment models: Towards eliminating security concerns from cloud computing\n", "abstract": " Cloud computing has become a popular choice as an alternative to investing new IT systems. When making decisions on adopting cloud computing related solutions, security has always been a major concern. This article summarizes security concerns in cloud computing and proposes five service deployment models to ease these concerns. The proposed models provide different security related features to address different requirements and scenarios and can serve as reference models for deployment.", "num_citations": "57\n", "authors": ["365"]}
{"title": "Interdependencies and reliability in the combined ICT and power system: An overview of current research\n", "abstract": " The smart grid vision implies extensive use of ICT in the power system, enabling increased flexibility and functionality and thereby meeting future demands and strategic goals. Consequently, power system reliability will increasingly depend on ICT components and systems. While adding functionality, ICT systems also contribute to failures, such as hidden failures in protection systems, as has been exemplified by recent power outages. It also brings new threats, such as that of cyber-attacks. To ensure effective power system reliability, the interdependencies between power and ICT systems need to be properly understood. This paper provides an overview of main interdependency categories, as well as methods that can be used to identify and study interdependencies. Based on a study of recent papers in major archival journals, we conclude that appropriate methods for identification of interdependencies between …", "num_citations": "49\n", "authors": ["365"]}
{"title": "An empirical study on the relationship between software security skills, usage and training needs in agile settings\n", "abstract": " Organizations recognize that protecting their assets against attacks is an important business. However, achieving what is adequate security requires taking bold steps to address security practices within the organization. In the Agile software development world, security engineering process is unacceptable as it runs counter to the agile values. Agile teams have thus approached software security activities in their own way. To improve security within agile settings requires that management understands the current practices of software security activities within their agile teams. In this study, we use survey to investigate software security usage, competence, and training needs in two agile organizations. We find that (1) The two organizations perform differently in core software security activities but are similar when activities that could be leveraged for security are considered (2) regardless of cost or benefit, skill drives …", "num_citations": "40\n", "authors": ["365"]}
{"title": "Reference deployment models for eliminating user concerns on cloud security\n", "abstract": " Cloud computing has become a hot topic both in research and in industry, and when making decisions on deploying/adopting cloud computing related solutions, security has always been a major concern. This article summarizes security related issues in cloud computing and proposes five service deployment models to address these issues. The proposed models provide different security related features to address different requirements and scenarios and can serve as reference models for deployment.", "num_citations": "36\n", "authors": ["365"]}
{"title": "Covering your assets in software engineering\n", "abstract": " Many security requirements elicitation techniques implicitly assume that assets are identified on beforehand, but few actually describe how this should be done. In this paper we suggest one specific method that can be used to identify and prioritize assets in any software engineering project.", "num_citations": "36\n", "authors": ["365"]}
{"title": "Monitoring intrusions and security breaches in highly distributed cloud environments\n", "abstract": " Cloud computing is a new computing model, and security is ranked first among its challenges. This paper reviews existing security monitoring mechanisms compared with new challenges which are caused by this new model. We highlight possible weaknesses in existing monitoring mechanisms, and propose approaches to mitigate them.", "num_citations": "35\n", "authors": ["365"]}
{"title": "Security in model driven development: A survey\n", "abstract": " Model driven development (MDD) is considered a promising approach for software development. In this paper the results of a systematic survey is reported to identify the state-of-the-art within the topic of security in model driven development, with a special focus on finding empirical studies. We provide an introduction to the major secure MDD initiatives, but our survey shows that there is a lack of empirical work on the topic. We conclude that better standardisation initiatives and more empirical research in the field is necessary before it can be considered mature.", "num_citations": "33\n", "authors": ["365"]}
{"title": "Security in service level agreements for cloud computing\n", "abstract": " The Cloud computing paradigm promises reliable services, accessible from anywhere in the world, in an on-demand manner. Insufficient security has been identified as a major obstacle to adopting Cloud services. To deal with the risks associated with outsourcing data and applications to the Cloud, new methods for security assurance are urgently needed. This paper presents a framework for security in Service Level Agreements for Cloud computing. The purpose is twofold; to help potential Cloud customers to identify necessary protection mechanisms and, in the next step, to facilitate automatic service composition based on a set of predefined security requirements. We demonstrate the practical applicability of the first objective with a small case study.", "num_citations": "32\n", "authors": ["365"]}
{"title": "Thunder in the clouds: Security challenges and solutions for federated clouds\n", "abstract": " Cloud federation brings together different service providers and their offered services, so that many Cloud variants can be tailored to match different sets of customer requirements. To mitigate security risks and convince hesitant customers, security must be an integrated part of the federated Cloud concept. This paper surveys the state of the art in Cloud computing security, identifies unsolved issues related to federated Clouds, discusses possible approaches to deal with the threats and points out directions for further work.", "num_citations": "30\n", "authors": ["365"]}
{"title": "Reusable security requirements for healthcare applications\n", "abstract": " Healthcare information systems are currently being migrated from paper based journals to fully digitalised information platforms. Protecting patient privacy is thus becoming an increasingly complex task, where several national and international legal requirements must be met. These legal requirements present only high-level goals for privacy protection, leaving the details of security requirements engineering to the developers of electronic healthcare systems. Our objective has been to map legal requirements for sensitive personal information to a set of reusable technical information security requirements. This paper presents examples of such requirements extracted from legislation applicable to the healthcare domain.", "num_citations": "30\n", "authors": ["365"]}
{"title": "Enhancing accountability in the cloud\n", "abstract": " This article focuses on the role of accountability within information management, particularly in cloud computing contexts. Key to this notion is that an accountable Cloud Provider must demonstrate both willingness and capacity for being a responsible steward of other people's data. More generally, the notion of accountability is defined as it applies to the cloud, and a conceptual model is presented related to the provision of accountability of cloud services. This allows a consideration of accountability at various different levels of abstraction, including the operationalisation of accountability. It is underpinned by fundamental requirements for strong accountability, which in particular are aimed at avoiding risks in the provision and verification of accounts (that include different types of accountability evidence and notifications, that may need to be provided to other cloud actors including data subjects, cloud customers and …", "num_citations": "29\n", "authors": ["365"]}
{"title": "Current practices and challenges in industrial control organizations regarding information security incident management–Does size matter? Information security incident …\n", "abstract": " This paper reports on the results of an interview study that surveyed current practices regarding information security incident management in small and large distribution system operators (DSOs) in the Norwegian electric power industry. The findings indicate that current risk perception and preparedness are low, especially among small electricity distribution system operators. Further, small distribution system operators rely heavily on their suppliers should incidents occur. At the same time, small distribution system operators are confident that they can handle the worst-case scenarios. This paper documents current perceptions and discusses the extent to which they are likely to hold given the transition towards smart electric grids. Several recommendations are provided based on the findings and the accompanying discussion. In particular, small distribution system operators should strengthen the collaboration with …", "num_citations": "29\n", "authors": ["365"]}
{"title": "Information security incident management: Planning for failure\n", "abstract": " This paper reports on an interview study on information security incident management that has been conducted in organizations operating industrial control systems that are highly dependent on conventional IT systems. Six distribution service operators from the power industry have participated in the study. We have investigated current practice regarding planning and preparation activities for incident management, and identified similarities and differences between the two traditions of conventional IT systems and industrial control systems. The findings show that there are differences between the IT and ICS disciplines in how they perceive an information security incident and how they plan and prepare for responding to such. The completeness of documented plans and procedures for incident management varies. Where documentation exists, this is in general not well-established throughout the organization …", "num_citations": "29\n", "authors": ["365"]}
{"title": "Security SLAs–an idea whose time has come?\n", "abstract": " Service Level Agreements (SLAs) have been used for decades to regulate aspects such as throughput, delay and response times of services in various outsourcing scenarios. However, security aspects have typically been neglected in SLAs. In this paper we argue that security SLAs will be necessary for future Internet services, and provide examples of how this will work in practice.", "num_citations": "29\n", "authors": ["365"]}
{"title": "Software security maturity in public organisations\n", "abstract": " Software security is about building software that will be secure even when it is attacked. This paper presents results from a survey evaluating software security practices in software development lifecycles in 20 public organisations in Norway using the practices and activities of the Building Security In Maturity Model (BSIMM). The findings suggest that public organisations in Norway excel at Compliance and Policy activities when developing their own code, but that there is a large potential for improvement with respect to Metrics, Penetration testing, and Training of developers in secure software development.", "num_citations": "27\n", "authors": ["365"]}
{"title": "Extending 3g/wimax networks and services through residential access capacity [wireless broadband access]\n", "abstract": " The transmit capacity of the access link that connects homes to the Internet is often not fully used, either because of a selected light subscription or because the user is not constantly online, leaving a surplus capacity. Many home networks are equipped with WLAN that can be received outside the walls of the home. This signal can be used to offer access to passing WLAN users who are sufficiently near the homes, potentially realizing a contiguous public radio coverage landscape of WLAN access points in urban areas. This article describes the challenges and solutions when using the surplus capacity available in broadband residential access for offering WLAN access to public subscribers, and how to integrate this solution with access and services offered by 3G and WiMAX.", "num_citations": "26\n", "authors": ["365"]}
{"title": "Privacy in a semantic cloud: What’s trust got to do with it?\n", "abstract": " The semantic web can benefit from cloud computing as a platform, but for semantic technologies to gain wide adoption, a solution to the privacy challenges of the cloud is necessary. In this paper we present a brief survey on recent work on privacy and trust for the semantic web, and sketch a middleware solution for privacy protection that leverages probabilistic methods for automated trust and privacy management for the semantic web.", "num_citations": "25\n", "authors": ["365"]}
{"title": "Towards strong accountability for cloud service providers\n", "abstract": " In order to be an accountable organisation, Cloud Providers need to commit to being responsible stewards of other people's information. This implies demonstrating both willingness and capacity for such stewardship. This paper outlines the fundamental requirements that must be met by accountable organisations, and sketches what kind of tools, mechanisms and guidelines support this in practice.", "num_citations": "23\n", "authors": ["365"]}
{"title": "Threat modeling of AMI\n", "abstract": " The introduction of an advanced metering infrastructure (AMI) into the power grid forces the power industry to address information security threats and consumer privacy more extensively than before. The industry needs practical advice on methods and tools to use in this context. Threat modeling is well-known among information security professionals as a method for investigating a system’s vulnerabilities. This paper documents the threat modeling of one actual AMI configuration. The results are both a demonstration of how these techniques can be applied to AMI, and a documentation of risks associated with this specific AMI configuration.", "num_citations": "23\n", "authors": ["365"]}
{"title": "The design of a redundant array of independent net-storages for improved confidentiality in cloud computing\n", "abstract": " This article describes how a Redundant Array of Independent Net-storages (RAIN) can be deployed for confidentiality control in Cloud Computing. The RAIN approach splits data into segments and distributes segments between multiple storage providers; by keeping the distribution of segments and the relationships between the distributed segments private, the original data cannot be re-assembled by an observer. As long as each segment is small enough, an individual segment discloses no meaningful information to others, and hence RAIN is able to ensure the confidentiality of data stored in the clouds. We describe the inter-cloud communication protocol, and present a formal model, security analysis, and simulation results.", "num_citations": "23\n", "authors": ["365"]}
{"title": "Hunting for aardvarks: Can software security be measured?\n", "abstract": " When you are in charge of building software from the ground up, software security can be encouraged through the use of secure software development methodologies. However, how can you measure the security of a given piece of software that you didn’t write yourself? In other words, when looking at two executables, what does “a is more secure than b” mean? This paper examines some approaches to measuring software security, and reccommends that more organisations should employ the Building Security In Maturity Model (BSIMM).", "num_citations": "23\n", "authors": ["365"]}
{"title": "An analysis of the manufacturing messaging specification protocol\n", "abstract": " The Manufacturing Messaging Specification (MMS) protocol is widely used in industrial process control applications, but it is poorly documented. In this paper we present an analysis of the MMS protocol in order to improve understanding of MMS in the context of information security. Our findings show that MMS has insufficient security mechanisms, and the meagre security mechanisms that are available are not implemented in commercially available industrial devices.", "num_citations": "22\n", "authors": ["365"]}
{"title": "Challenges and experiences with applying microsoft threat modeling in agile development projects\n", "abstract": " The goal of secure software engineering is to create software that keeps performing as intended even when exposed to attacks. Threat modeling is considered to be a key activity, but can be challenging to perform for developers, and even more so in agile software development. Hence, threat modeling has not seen widespread use in agile software projects. The goal of this paper is to investigate the challenges facing adoption of threat modeling using the Microsoft approach with STRIDE. We performed a case study in a company comprising five agile development projects. We identified 21 challenges to threat modeling that emerged from our observations. We then mapped these challenges to challenges found in the literature. Some challenges overlap the findings from the literature; the extra challenges we have found in our exploratory study came mostly from the activities of asset identification and also from our …", "num_citations": "20\n", "authors": ["365"]}
{"title": "Devops for better software security in the cloud invited paper\n", "abstract": " The DevOps paradigm means that development and operations for an organisation blend together. For security, this implies that information on detected attacks can be fed back to the development, enabling faster eradication of vulnerabilities in software. This is particularly important in cloud installations, where release cycles can be less than a day. This paper argues that DevOps can be employed for overall improved software security.", "num_citations": "19\n", "authors": ["365"]}
{"title": "Expressing cloud security requirements for SLAs in deontic contract languages for cloud brokers\n", "abstract": " The uptake of cloud computing is hindered by the fact that current cloud SLAs are not written in machine-readable language, and also fail to cover security requirements. This article considers a cloud brokering model that helps negotiate and establish SLAs between customers and providers. This broker handles security requirements on two different levels: between the customer and the broker, where the requirements are stated in natural language; and between the broker and different cloud providers, where requirements are stated in deontic contract languages. There are several such languages available today with different properties and abstraction levels, from generic container languages to more domain-specific languages for specifying the various details in a contract. In this article, we investigate the suitability of ten deontic contract languages for expressing security requirements in SLAs, and exemplify …", "num_citations": "19\n", "authors": ["365"]}
{"title": "Expressing Cloud Security Requirements in Deontic Contract Languages.\n", "abstract": " The uptake of Cloud computing is being hindered by the fact that not only are current Cloud SLAs written in natural language, but they also fail to cover security requirements. This paper considers a Cloud brokering model that helps negotiate and establish SLAs between customers and providers. This broker handles security requirements on two different levels; between the customer and the broker, where the requirements are stated in natural language; and between the broker and the different Cloud providers, where requirements are stated in deontic contract languages. We investigate the suitability of seven of those languages for expressing security requirements in SLAs and exemplify their use in the Cloud brokering model through a practical use case for a video streaming service.", "num_citations": "18\n", "authors": ["365"]}
{"title": "A farewell to trust: An approach to confidentiality control in the cloud\n", "abstract": " This paper applies a divide-and-conquer approach to achieve confidentiality control in Cloud Computing. We sketch how a Redundant Array of Independent Net-storages (RAIN) for Cloud Computing can be designed using techniques originally intended for other purposes. The RAIN approach splits data into segments and distributes segments onto multiple providers. By keeping the relationships between the distributed segments private, the original data cannot be re-assembled. Further, with each segment small enough, each segment discloses no meaningful information to others. Hence RAIN is able to ensure the confidentiality of data stored on clouds.", "num_citations": "17\n", "authors": ["365"]}
{"title": "Learning from software security testing\n", "abstract": " Software security testing tools and methodologies are presently abundant, and the question no longer seems to be \"if to test\" for security, but rather \"where and when to test\" and \"then what?\". In this paper we present a review of security testing literature, and propose a software security testing scheme that exploits an intra-organisational repository of discovered vulnerabilities that closes the loop after the testing of one application is complete, providing useful input to the next application to be tested.", "num_citations": "17\n", "authors": ["365"]}
{"title": "OWASP Top 10-Do Startups Care?\n", "abstract": " The following topics are dealt with: security of data; cryptography; computer crime; computer network security; learning (artificial intelligence); pattern classification; invasive software; Internet; support vector machines; and risk analysis.", "num_citations": "16\n", "authors": ["365"]}
{"title": "Bringing accountability to the cloud: addressing emerging threats and legal perspectives\n", "abstract": " This paper is concerned with accountability in cloud ecosystems. The separation between data and data subjects as well as the exchange of data between cloud consumers and providers increases the complexity of data governance in cloud ecosystems, a problem which is exacerbated by emerging threats and vulnerabilities. This paper discusses how accountability addresses emerging issues and legal perspectives in cloud ecosystems. In particular, it introduces an accountability model tailored to the cloud. It presents on-going work within the Cloud Accountability Project, highlighting both legal and technical aspects of accountability.", "num_citations": "16\n", "authors": ["365"]}
{"title": "Handling compromised components in an IaaS cloud installation\n", "abstract": " This article presents an approach to handle compromised components in the OpenStack Infrastructure-as-a-Service cloud environment. We present two specific use cases; a compromised service process and the introduction of a bogus component, and we describe several approaches for containment, eradication and recovery after an incident. Our experiments show that traditional incident handling procedures are applicable for cloud computing, but need some modification to function optimally.", "num_citations": "16\n", "authors": ["365"]}
{"title": "As strong as the weakest link: Handling compromised components in openstack\n", "abstract": " This paper presents an approach to handle compromised components in an Infrastructure-as-a-Service Cloud Computing platform. Our experiments show that traditional incident handling procedures are applicable for cloud computing, but need some modification to function optimally.", "num_citations": "16\n", "authors": ["365"]}
{"title": "Agile software development: The straight and narrow path to secure software?\n", "abstract": " In this article, the authors contrast the results of a series of interviews with agile software development organizations with a case study of a distributed agile development effort, focusing on how information security is taken care of in an agile context. The interviews indicate that small and medium-sized agile software development organizations do not use any particular methodology to achieve security goals, even when their software is web-facing and potential targets of attack. This case study confirms that even in cases where security is an articulated requirement, and where security design is fed as input to the implementation team, there is no guarantee that the end result meets the security objectives. The authors contend that security must be built as an intrinsic software property and emphasize the need for security awareness throughout the whole software development lifecycle. This paper suggests two …", "num_citations": "16\n", "authors": ["365"]}
{"title": "Federated identity management-we built it; why won't they come?\n", "abstract": " Solutions for federated identity management (FIM) are maturing; however, the adoption rate of this technology hasn't been as high as expected. The authors conducted and analyzed eleven semistructured interviews with representatives from the Norwegian oil and gas industry to learn more about the perceived benefits and challenges of FIM adoption. Their results show that some benefits of FIM adoption are offset by its challenges.", "num_citations": "15\n", "authors": ["365"]}
{"title": "A probabilistic approach to information control\n", "abstract": " Information aggregation is identified as one of the key threats of the emerging Semantic Web. Although the new web has experienced slow deployment, the advent of Cloud Computing is assumed to boost the rate of deployment by providing means to conduct resource intensive analysis, tracing and querying of semantically annotated and linked data with minimal investment cost for suppliers. However, the threat of information aggregation poses a severe threat to privacy protection, business-critical information and some aspects of national security. The lack of security mechanisms to restrict access to and usage of information after it has been distributed, further contributes to the risk of aggregation since redistribution cannot be controlled. In this paper we propose a probabilistic approach to information control based on trust management systems. Our solution provides the user with a view of the amount of information that any given entity probably has received through redistribution (from others), in order to determine the level of aggregation the entity can perform. We define a middleware architecture and provide an implementation in a simulation environment. Initial results from experiments demonstrate the accuracy of the model and that there may be significant benefits from the approach in several application areas.", "num_citations": "15\n", "authors": ["365"]}
{"title": "Where only fools dare to tread: An empirical study on the prevalence of Zero-Day malware\n", "abstract": " Zero-day malware is malware that is based on zero-day exploits and/or malware that is otherwise so new that it is not detected by any anti-virus or anti-malware scanners. This paper presents an empirical study that exposed updated Micsosoft Windows XP PCs with updated anti-virus software to a number of unsavoury Internet software repositories. A total of 124 zero-day malware instances were detected in our experiment. Our conclusion is that if a user is sufficiently adventurous (or foolish), no anti-virus protection can prevent a zero-day malware infection.", "num_citations": "15\n", "authors": ["365"]}
{"title": "Secure fast handover in an open broadband access network using Kerberos-style tickets\n", "abstract": " In an Open Broadband Access Network consisting of multiple Internet Service Providers, delay due to multi-hop processing of authentication credentials is a major obstacle to fast handover between access points, effectively preventing delay-sensitive interactive applications such as Voice over IP. By exploiting existing trust relationships between service providers and access points, it is possible to pre-authenticate a mobile terminal to an access point, creating a Kerberos-style ticket that can be evaluated locally. The terminal can thus perform a handover and be authenticated to the new access point, without incurring communication and processing delays by involving other servers.", "num_citations": "15\n", "authors": ["365"]}
{"title": "Threat modelling and agile software development: Identified practice in four Norwegian organisations\n", "abstract": " Threat modelling is considered a key activity in secure software engineering. However, despite its documented benefits it has not (yet) been widely adopted by agile software development projects. In this paper we present results from a qualitative study of how it is performed in practice by four different organisations. The findings show that, even though they all consider threat modelling to lead to a more secure product, they all struggle with practical aspects of the established theory.", "num_citations": "13\n", "authors": ["365"]}
{"title": "Threats to validity in empirical software security research\n", "abstract": " Empirical research in secure software engineering is increasingly important to advancing the state of the art in a scientific manner [16, 17]. Several recent results have pointed to problems related to how security research is conducted or reported in a way that is not advancing the area scientifically. Science of Security (SoS) is an area of research that seeks to apply a scientific approach to the study and design of secure and trustworthy information systems [16, 17]. The core purpose of science is to develop fundamental laws that let us make accurate predictions. Currently, the only prediction we can usually make confidently in secure software engineering is that a system will eventually fail when faced with sufficiently motivated attackers. However, there is a need and an opportunity to develop fundamental research to guide the development and understand the security and robustness of the complex systems on which we depend.Secure software engineering research is a long way from establishing a scientific approach based on the understanding of empirical evaluation and theoretical foundations as developed in other sciences, and even from software engineering in general. Many of our security and privacy best practices are derived from anecdote, not from careful, evidence-based research [23]. The area suffers from a lack of credible empirical evaluation, a split between industry practice and academic research, and a huge number of methods and method variants, with differences little understood and artificially magnified [17]. There is little empirical evidence on how to implement security practices in the software industry [35]. For example, in …", "num_citations": "13\n", "authors": ["365"]}
{"title": "Deliverance from trust through a redundant array of independent net-storages in cloud computing\n", "abstract": " Cloud storage services are gaining more and more attention. Surveys suggest that the confidentiality issue is one of the major obstacles for users to use cloud storage services to keep sensitive data. This paper proposes to deploy a Redundant Array of Independent Net-storages (RAIN) for confidentiality control in Cloud Computing. The RAIN approach splits data into segments and distributes segments onto multiple storage providers, without having to trust each provider. By keeping the distribution of segments and the relationships between the distributed segments private, the original data cannot be reassembled. When the segments are small enough, each segment discloses no meaningful information to others. Hence RAIN is able to ensure the confidentiality of data stored on clouds. A formal model of the proposed approach has been developed to articulate the process. Security analysis has been performed …", "num_citations": "12\n", "authors": ["365"]}
{"title": "Secure remote access to autonomous safety systems: A good practice approach\n", "abstract": " Safety instrumented systems (SIS) as defined in IEC 61508 and IEC 61511 are very important for the safety of offshore oil and natural gas installations. Partly as a consequence of the evolving 'integrated operations' concept, a need is emerging for remote access to such systems from vendors external to the operating company. This access will pass through a number of IP-based networks used for other purposes, including the open internet. This raises a number of security issues, ultimately threatening the safety integrity of SIS. In this article, we present a layered network architecture that represents current good practice for a solution to ensure secure remote access to SIS. Also, a method for assessing whether a given solution for remote access to SIS is acceptable is described.", "num_citations": "12\n", "authors": ["365"]}
{"title": "Architecture for sharing residential access with roaming WLAN users\n", "abstract": " The convergence of the various access networks forms a crucial aspect in the next generation networks. Telecom operators have concentrated on 2G and 3G public networks that operate in licensed frequency bands. On the other hand, the unlicensed frequencies in wireless local area networks (WLANs) have been applied successfully as home and last mile technology in the increasingly pervasive computing environments where mobile users access Internet services. The integration of WLAN in 3G devices and the convergence of various access network technologies indicate that WLAN is no competitor for 3G and that the unlicensed WLAN spectra may become an important and cost effective supplement to offer network access.In residential areas, WLAN is often positioned as the primary means of broadband access, widely deployed in many countries by access lines based on Digital Subscriber Line (DSL), fibre, and cable. When considering the limited capacity usage of for instance the popular Asynchronous DSL (ADSL) technology, it becomes clear that an enormous network access potential is currently wasted. In [1] this waste of capacity is metaphorically compared to a not very lucrative airline company that flies with an average of 97 out of 100 unoccupied seats. The broadband modems are often equipped with WLAN and when the device or antenna is placed optimally in a home, signal attenuation to reach the public domain is equivalent to a 40 m distance (real distance+ walls/windows, see [2]) which may be sufficient for offering supplement capacity to realize public access via residential equipment.", "num_citations": "12\n", "authors": ["365"]}
{"title": "Special issue on security in cloud computing\n", "abstract": " This special issue presents extended and revised versions of distinguished papers presented at the security & privacy track of the 3rd IEEE International Conference on Cloud Computing Technology and Science (IEEE Cloudcom 2011).", "num_citations": "11\n", "authors": ["365"]}
{"title": "The sesa method for assessing secure remote access to safety instrumented systems\n", "abstract": " Safety Instrumented Systems (SIS) are very important for the safety of Norwegian offshore installations. Partly as a consequence of evolving Integrated Operation concepts, a need for remote access to such systems from vendors external to the operating company, is expected. This kind of access will go through a number of networks used for other purposes, including the open Internet. This raises a number of security issues, ultimately threatening the safety integrity of SIS.The SeSa (SecureSafety) project has developed a systematic and methodological approach to assess whether a given technological solution for remote access to SIS is acceptable. The approach is restricted to the security of the remote access path as such, but also takes into consideration the Safety Integrity Level (SIL) of the SIS itself. Assessment of proper SIL level to be defended through the method described herein is outside the scope.", "num_citations": "11\n", "authors": ["365"]}
{"title": "Managing security in software: Or: How i learned to stop worrying and manage the security technical debt\n", "abstract": " Context: Security work in software development is generally under-prioritized. Software developers are not aware of security engineering practices, or find them external to the software development process. To the management, security work presents itself in the form of reactive testing performed out of necessity, incurring only costs in terms of time and resources. The long-term benefits of the security work are more difficult to demonstrate and the security investment harder to justify.Objectives: The concept of technical debt is widely used, but its benefits for software security improvement and security risk management have not been fully realized. To make the direct and indirect benefits of security work in software development more visible and therefore more justifiable, the security risk in software is expressed in the terms of technical debt. Correspondingly, the security engineering techniques are utilized to …", "num_citations": "10\n", "authors": ["365"]}
{"title": "Empirical research for software security: foundations and experience\n", "abstract": " Developing secure software requires the integration of numerous methods and tools into the development process, and software design is based on shared expert knowledge, claims, and opinions. Empirical methods, including data analytics, allow extracting knowledge and insights from the data that organizations collect from their processes and tools, and from the opinions of the experts who practice these processes and methods. This book introduces the reader to the fundamentals of empirical research methods, and demonstrates how these methods can be used to hone a secure software development lifecycle based on empirical data and published best practices.", "num_citations": "10\n", "authors": ["365"]}
{"title": "A lightweight measurement of software security skills, usage and training needs in agile teams\n", "abstract": " Although most organizations understand the need for application security at an abstract level, achieving adequate software security at the sharp end requires taking bold steps to address security practices within the organization. In the Agile software development world, a security engineering process is unacceptable if it is perceived to run counter to the agile values, and agile teams have thus approached software security activities in their own way. To improve security within agile settings requires that management understands the current practices of software security activities within their agile teams. In this study, the authors have used a survey instrument to investigate software security usage, competence, and training needs in two agile organizations. They find that (1) The two organizations perform differently in terms of core software security activities, but are similar when secondary activities that could be …", "num_citations": "10\n", "authors": ["365"]}
{"title": "Healthcare Services in the Cloud--Obstacles to Adoption, and a Way Forward\n", "abstract": " Cloud computing has been receiving a great deal of attention during the past few years. A major feature of public cloud services is that data are processed remotely in unknown systems that the users do not own or operate. This context creates a number of challenges related to data privacy and security and may hinder the adoption of cloud technology in, for example, the healthcare domain. This paper presents results from a stakeholder elicitation activity, in which the participants identified a number of obstacles to the adoption of cloud computing for the processing of healthcare data. We compare our results with previous studies and outline accountability as a possible way forward to increase the adoption of cloud services in the healthcare domain.", "num_citations": "10\n", "authors": ["365"]}
{"title": "A structured approach to incident response management in the oil and gas industry\n", "abstract": " Incident Response is the process of responding to and handling ICT security related incidents involving infrastructure and data. This has traditionally been a reactive approach, focusing mainly on technical issues. In this paper we present the Incident Response Management (IRMA) method, which combines traditional incident response with pro-active learning and socio-technical perspectives. The IRMA method is targeted at integrated operations within the oil and gas industry.", "num_citations": "10\n", "authors": ["365"]}
{"title": "Secure safety: Secure remote access to critical safety systems in offshore installations\n", "abstract": " Safety Instrumented Systems (SIS) as defined in IEC 61508 and IEC 61511 are very important for the safety of offshore oil & natural gas installations. SIS typically include the Emergency Shutdown System (ESD) that ensures that process systems return to a safe state in case of undesirable events. Partly as a consequence of the evolving “Integrated Operations” concept, a need is emerging for remote access to such systems from vendors external to the operating company. This access will pass through a number of IP-based networks used for other purposes, including the open Internet. This raises a number of security issues, ultimately threatening the safety integrity of SIS.                 In this paper we present a layered network architecture that represents current good practice for a solution to ensure secure remote access to SIS. Also, a method for assessing whether a given solution for remote access to SIS is …", "num_citations": "10\n", "authors": ["365"]}
{"title": "Threat modeling in agile software development\n", "abstract": " Threat modeling is a way to get an overview of possible attacks against your systems. The advantages of threat modeling include tackling security problems early, improved risk assessments, and more effective security testing. There will always be limited resources available for security, and threat modeling will allow you to focus on the most important areas first. There is no one single “correct” way of doing threat modeling, and “agile” is no excuse for not doing it. This chapter describes the authors' experiences with doing threat modeling with agile development organizations, outlining challenges to be faced and pitfalls to be avoided.", "num_citations": "9\n", "authors": ["365"]}
{"title": "Cloud Provider Transparency-A View from Cloud Customers.\n", "abstract": " A major feature of public cloud services is that data are processed remotely in unknown systems that the users do not own or operate. This context creates a number of challenges related to data privacy and security and may hinder the adoption of cloud technology. One of these challenges is how to maintain transparency of the processes and procedures while at the same time providing services that are secure and cost effective. This paper presents results from an empirical study in which the cloud customers identified a number of transparency requirements to the adoption of cloud providers. We have compared our results with previous studies, and have found that in general, customers are in synchrony with research criteria for cloud service provider transparency, but there are also some extra pieces of information that customers are looking for.", "num_citations": "9\n", "authors": ["365"]}
{"title": "Privacy enhancing technologies for information control\n", "abstract": " Privacy Enhancing Technologies (PETs) help to protect the personal information of users. This chapter will discuss challenges and opportunities of PETs in a business context, and present examples of currently available PETs. We will further study the Platform for Privacy Preferences (P3P), and discuss why it so far has failed to deliver on its promise. Finally, we provide our advice on further research on privacy preferences, and conclude with our conviction that businesses need to take a progressive stance on providing privacy to their customers.", "num_citations": "9\n", "authors": ["365"]}
{"title": "Incident Response Management in the oil and gas industry\n", "abstract": " Incident Response is the process of responding to and handling ICT security related incidents involving infrastructure and data. This has traditionally been a reactive approach, focusing mainly on technical issues. Incident Response Management (IRMA) combines traditional incident response with a proactive learning loop, thus increasing the focus on organisational learning. The IRMA method is comprised of the following phases: - Prepare: Planning and preparation of incident response - Detect and recover: Detection of incidents and restoration to normal operation - Learn: Experience sharing and learning afterwards. The IRMA project has focused on the offshore oil and gas industry, but the results should also be applicable to other organisations in the energy sector or process control industry.", "num_citations": "9\n", "authors": ["365"]}
{"title": "5G as an Enabler for Secure IoT in the Smart Grid\n", "abstract": " The use of IoT devices in the future electricity domain (known as the smart grid) has numerous benefits, such as improved reliability of the power system, enhanced functions of SCADA (Supervisory Control and Data Acquisition), improved monitoring and management of operational power grid assets, and advanced metering infrastructure. The smart grid concept relies on the integration of high-speed and reliable communication networking technologies in order to provide twofold benefits - one for the interconnection between the existing power grid and intelligent information systems, and another for enabling real-time grid monitoring via IoT devices. However, the security of IoT devices themselves is a challenge due to the trade-off between device cost and secure communication requirements. Further, current electricity grids require robust and secure wireless communication infrastructure to realize transformation …", "num_citations": "8\n", "authors": ["365"]}
{"title": "Software security activities that support incident management in secure DevOps\n", "abstract": " Many software services are currently created using DevOps, where developers and operations personnel are more tightly integrated. The DevOps paradigm enables shorter development cycles, but increased speed has raised concerns over whether security issues may be overlooked. However, perfect security is never achievable, and in addition to the proactive software security efforts, we also need a reactive effort to handle flaws and bugs that are not discovered before they are used in an attack. In this paper we explore how focus on incident management and collaboration with developers can contribute to improved software security.", "num_citations": "8\n", "authors": ["365"]}
{"title": "BatCave: Adding security to the BATMAN protocol\n", "abstract": " The Better Approach To Mobile Ad-hoc Networking (BATMAN) protocol is intended as a replacement for protocols such as OLSR, but just like most such efforts, BATMAN has no built-in security features. In this paper we describe security extensions to BATMAN that control network participation and prevent unauthorized nodes from influencing network routing.", "num_citations": "8\n", "authors": ["365"]}
{"title": "Managing emerging information security risks during transitions to Integrated Operations\n", "abstract": " The Norwegian Oil and Gas Industry is adopting new information communication technology to connect its offshore platforms, onshore control centers and the suppliers. The management of the oil companies is generally aware of the increasing risks associated with the transition, but so far, investment in incident response (IR) capability has not been highly prioritized because of uncertainty related to risks and the present reactive mental model for security risk management. In this paper, we extend previous system dynamics models on operation transition and change of vulnerability, investigating the role of IR capability in controlling the severity of incidents. The model simulation shows that a reactive approach to security risk management might trap the organization in low IR capability and lead to severe incidents. With a long-term view, proactive investment in IR capability is of financial benefit.", "num_citations": "8\n", "authors": ["365"]}
{"title": "A study of information security practice in a critical infrastructure application\n", "abstract": " Based on multiple methods we have studied how information security practices, and in particular computer security incident response practices, are handled in the Norwegian offshore oil and gas industry. Our findings show that there is still insufficient awareness regarding the importance of information security in the offshore industry, and that increased vigilance is required in order to respond to mounting threats of tomorrow.", "num_citations": "8\n", "authors": ["365"]}
{"title": "Challenges and approaches of performing canonical action research in software security\n", "abstract": " When studying work practices, it is important to obtain accurate and reliable information about how work is actually done. Action research is an interactive inquiry process that balances problem solving actions implemented in a collaborative context with data-driven collaborative analysis or research to understand underlying causes enabling future predictions about personal and organizational change. Our research team has been engaged in action research in software organizations in Norway for two years. In this paper we describe some of the challenges in performing canonical action research in software security. We have structured the discussion of the challenges based on the principles of canonical action research, and we draw some lessons learned and future work towards improving the adoption of action research in software security research.", "num_citations": "7\n", "authors": ["365"]}
{"title": "How much cloud can you handle?\n", "abstract": " Outsourcing computing and storage to the cloud does not eliminate the need for handling of information security incidents. However, the long provider chains and unclear responsibilities in the cloud make incident response difficult. In this paper we present results from interviews in critical infrastructure organisations that highlight incident handling needs that would apply to cloud customers, and suggest mechanisms that facilitate inter-provider collaboration in handling of incidents in the cloud, improving the accountability of the cloud service providers.", "num_citations": "7\n", "authors": ["365"]}
{"title": "Sink or SWIM: information security requirements in the sky\n", "abstract": " Despite the inherently cooperative nature of air traffic control, the ICT infrastructure supporting it has, metaphorically speaking, largely remained isolated islands of technology. To this day, most of the interaction between ATM centers is based on voice and point-to-point data communication. Speed and accuracy of coordination is thus frequently limited by human capacities. This also imposes severe restrictions on the scale of coordination efforts among ATM centers. There are, however, changes underway. The main ambition of the System-Wide Information Management (SWIM) concept is to realize a European-wide network of interconnected ATM systems that promises, among other things, to bring substantial gains in efficiency of coordination and improved utilization of valuable airspace. This paper presents challenges, approaches and experiences from ongoing work on security requirements within SWIM.", "num_citations": "7\n", "authors": ["365"]}
{"title": "GPRS security for smart meters\n", "abstract": " Many Smart Grid installations rely on General Packet Radio Service (GPRS) for wireless communication in Advanced Metering Infrastructures (AMI). In this paper we describe security functions available in GPRS, explaining authentication and encryption options, and evaluate how suitable it is for use in a Smart Grid environment. We conclude that suitability of GPRS depends on the chosen authentication and encryption functions, and on selecting a reliable and trustworthy mobile network operator.", "num_citations": "7\n", "authors": ["365"]}
{"title": "Fools download where angels fear to tread\n", "abstract": " Our study illustrates that the risk of getting infected by malware that antivirus protection doesn't detect is alarmingly high. New malware that the antivirus engines don't have signatures for is likely to escape detection by a desktop antivirus solution. Taking precautions while using the Internet can protect users only to a certain extent. If they visit the wrong Web site or download a file infected with 0-day malware, they probably won't be protected from infection. The malware specimens that our antivirus packages didn't detect during our two-week exposure period suggest to us that signature-based antivirus software doesn't provide sufficient protection for users who live on the bleeding edge with respect to where they obtain their software. Coupled with the exponential growth of new malware variants, our findings suggest that antivirus vendors have major problems keeping the signature lag within acceptable limits.", "num_citations": "7\n", "authors": ["365"]}
{"title": "Penetration testing of OPC as part of process control systems\n", "abstract": " We have performed penetration testing on OPC, which is a central component in process control systems on oil installations. We have shown how a malicious user with different privileges – outside the network, access to the signalling path and physical access to the OPC server – can fairly easily compromise the integrity, availability and confidentiality of the system. Our tentative tests demonstrate that full-scale penetration testing of process control systems in offshore installations is necessary in order to sensitise the oil and gas industry to the evolving threats.", "num_citations": "7\n", "authors": ["365"]}
{"title": "Understanding challenges to adoption of the Microsoft Elevation of Privilege game\n", "abstract": " The goal of secure software engineering is to create software that keeps performing as intended even when exposed to an active attacker. Threat modelling is considered to be a key activity, but can be challenging to perform for developers. Microsoft has tried to lower the bar through creating a threat modelling game called Elevation of Privilege (EoP), but anecdotal evidence suggests that it has seen little use in actual development projects. To learn more about challenges facing adoption of EoP, we performed a case study in a university setting comprising several agile development projects. The results show that the game aided in discussing and learning about software security, but the impact on development seems to have been limited. In addition, challenges related to game dynamics, relevance of hints on the cards, and the time needed to play the game, limits the acceptance of the game.", "num_citations": "6\n", "authors": ["365"]}
{"title": "Cyber Security Incident Management in the Aviation Domain\n", "abstract": " Cyber Security Incident Management is an emerging paradigm and capability within the aviation domain. To date, limited research has addressed the requirements and developed tangible solutions for the deployment of such a capability. This paper leverages good practice and experiences from other critical infrastructure settings in order to sketch a recommendation for cyber incident response management for the aviation domain.", "num_citations": "6\n", "authors": ["365"]}
{"title": "Options, forwards and provision-point contracts in improving cloud infrastructure utilisation\n", "abstract": " Cloud computing takes away much of the need to plan future IT demands from the consumer, and puts it in the hands of the provider. Consumers don’t need to give advance notice to start or terminate virtual machines, and can do so in real time to reflect changing business objectives. It is the task of the cloud IaaS provider to optimise the use of her infrastructure, and ensure there are enough resources available. Achieving optimum server utilisation in the data centre is particularly challenging – advance notification can help the provider to schedule workloads more efficiently, but this is at odds with one of the key benefits of cloud computing. In this paper, we propose a pricing method that combines options contracts with on-demand purchasing. We show that the method can provide consumers with the flexibility and cost-benefits afforded by cloud computing, and can benefit the provider by improving server utilisation …", "num_citations": "6\n", "authors": ["365"]}
{"title": "Security requirements for MANETs used in emergency and rescue operations\n", "abstract": " Ad hoc networks for first responders in emergency situations have some unique characteristics that differ from general ad hoc networks, since it is desirable to restrict who can participate in the network without relying on a predeployed infrastructure. In this paper we present security requirements elicited for a first responder mobile ad hoc network in the OASIS project. The requirements have been identified in a structured manner, based on identification of objectives, assets and threats towards these assets.", "num_citations": "6\n", "authors": ["365"]}
{"title": "Playing protection poker for practical software security\n", "abstract": " Software security is about creating software that keeps performing as intended even when exposed to an active attacker. Secure software engineering is thus relevant for all software, not only security software. We describe Protection Poker, a tool for risk estimation to be used as part of the iteration planning meeting, and discuss some preliminary experiences.", "num_citations": "5\n", "authors": ["365"]}
{"title": "CMQ-A lightweight, asynchronous high-performance messaging queue for the cloud\n", "abstract": " In cloud computing environments guarantees, consistency mechanisms, (shared) state and transactions are frequently traded for robustness, scalability and performance. Based on this challenge we present CMQ, a UDP-based inherently asynchronous message queue to orchestrate messages, events and processes in the cloud. CMQ’s inherently asynchronous design is shown to perform especially well in modern Layer 2 switches in data center networks, as well as in the presence of errors. CMQ’s lightweight edge-to-edge design, which is somewhat similar to Unix Pipes, makes it very composable. By presenting our work, we hope to initiate discussion on how to implement lightweight messaging paradigms that are aligned with the overall architectures and goals of cloud computing.", "num_citations": "5\n", "authors": ["365"]}
{"title": "Usage control in inter-organisational collaborative environments–a case study from an industry perspective\n", "abstract": " Sharing information between collaborators without relinquishing control of that information has for many years been a tantalizing goal in the research community, but despite application support, the concept of usage control has failed to take hold in the business community. In this paper we present the results of a case study in the Norwegian oil & gas domain. The purpose of the study is to better understand the reasons for the slow adoption rate of usage control technology to control shared information. To this end we investigate risk perception, existing control measures and the attitude towards usage control technology. The study shows that although participants in the case study do not think their information is properly protected, there are several practical challenges that prevent them from adopting usage control technology as a means to improve protection.", "num_citations": "5\n", "authors": ["365"]}
{"title": "On the Adoption of Usage Control Technology in Collaborative Environments.\n", "abstract": " The extensive collaboration across system boundaries facilitated by the Internet is unfortunately also increasing the potential for misuse of shared information. While mechanisms to protect assets from active attackers (such as firewalls, intrusion detection systems and anti-virus software) are commonplace, the availability of commercial software to protect information from misuse remains limited. Businesses employ non-disclosure agreements, but have no means to prevent or detect violations of these. Usage control has been proposed as the means to protect information even after its distribution. However, despite the efforts to develop new usage control technology and the apparent need for it, the industry is less enthusiastic. In this paper we investigate existing theories of technology adoption in order to better understand the industryperspective and to improve technology development. We base our study well-known general theories on protection motivation, innovation diffusion and technology acceptance. We then utilize these theories and preliminary results of a case study to build a new model for understanding usage control technology acceptance.", "num_citations": "5\n", "authors": ["365"]}
{"title": "A cryptographic protocol for communication in a redundant array of independent net-storages\n", "abstract": " This paper describes a cryptographic protocol for storing and processing data in a Cloud Computing setting, where users need not place absolute trust in the various Cloud Processing providers. This is achieved by distributing data among various Cloud Storage providers in such a manner that an individual data item does not divulge useful information about its owner, and only re-assembling data when it needs to be processed or returned to the user.", "num_citations": "5\n", "authors": ["365"]}
{"title": "Security in fast handovers\n", "abstract": " In an Open Broadband Access Network (OBAN), anyone with a broadband connection can offer Internet access to passers-by. Individuals and companies can make money on their Internet connection, while neighbours and people on the move get access to a high quality access network. Systems that offer such functionality are available today with different names; from traditional hotspots via the Boingo network [12] to the Linspot [13] and FON [14] concepts. The services offered are however simple, with limited support for mobility, Quality of Service (QoS) and security.The OBAN project [19] takes the idea of sharing broadband connections several steps further. The OBAN architecture [20] offers defined QoS mechanisms for both visiting and residential users. When using OBAN, seamless handovers is a main requirement, and so is security. Users of OBAN should be able to roam while using real time services. At the same time security requirements of both users and operators should be met also during handover. Authentication is one of the basic security services that must be ensured. Operators are concerned with AAA services (Authentication Authorization Accounting) to ensure correct billing, while users need to feel confident that nobody can use their identity with the result that they have to pay for other users’ service consumption.", "num_citations": "5\n", "authors": ["365"]}
{"title": "Secure file transfer over TCP/IP\n", "abstract": " With the spread of internetworks able to link LANs, and the availability of network hardware to monitor network traffic, the need to add additional security to traditional network utilities is becoming imperative. The development of security extensions to the FTP file transfer utility/protocol in the TCP/IP communications suite in order to provide authentication of the user and encryption of the files transferred is described. Specific security issues, including some alternatives for providing these security extensions, are given, and the final choice is explained. Initial trials of the implementation are presented. These show that on a single LAN link there is a performance penalty in providing encryption, but that over a wide area internetwork this is masked by the network delays.< >", "num_citations": "5\n", "authors": ["365"]}
{"title": "STOP-IT-Strategic, Tactical, Operational Protection of water Infrastructure against cyber-physical Threats\n", "abstract": " Water supply and sanitation infrastructures are essential for our welfare, but vulnerable to several attack types-facilitated by the ever-changing landscapes of the digital world. A cyber-attack on critical infrastructures could for example evolve along these threat vectors: chemical/biological contamination, physical or communications disruption between the network and the supervisory SCADA. Although conceptual and technological solutions to security and resilience are available, further work is required to bring them together in a risk management framework, strengthen the capacities of water utilities to systematically protect their systems, determine gaps in security technologies and improve risk management approaches. In particular, robust adaptable/flexible solutions for prevention, detection and mitigation of consequences in case of failure due to physical and cyber threats, their combination and cascading effects (from attacks to other critical infrastructure, ie energy) are still missing. There is (i) an urgent need to efficiently tackle cyber-physical security threats,(ii) an existing risk management gap in utilities’ practices and (iii) an un-tapped technology market potential for strategic, tactical and operational protection solutions for water infrastructure: how the H2020 STOP-IT project aims to bridge these gaps is presented in this paper.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Is a smarter grid also riskier?\n", "abstract": " The smart grid evolution digitalizes the traditional power distribution grid, by integrating information communication technology into its operation and control. A particularly interesting challenge is the integration of grid topology monitoring and decision support systems with the remote control of breakers in the grid and at the subscribers’ premises. In this paper we outline and discuss the results from a recent information security risk assessment of such an integrated system.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Zebras and Lions: Better Incident Handling Through Improved Cooperation\n", "abstract": " The ability to appropriately prepare for, and respond to, information security incidents, is of paramount importance, as it is impossible to prevent all possible incidents from occurring. Current trends show that the power and automation industry is an attractive target for hackers. A main challenge for this industry to overcome is the differences regarding culture and traditions, knowledge and communication, between Information and Communication Technology (ICT) staff and industrial control system staff. Communication is necessary for knowledge transfer, which in turn is necessary to learn from previous incidents in order to improve the incident handling process. This article reports on interviews with representatives from large electricity distribution service operators, and highlights challenges and opportunities for computer security incident handling in the industrial control system space.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Security Incident Information Exchange for Cloud Services.\n", "abstract": " The complex provider landscape in cloud computing makes incident handling difficult, as Cloud Service Providers (CSPs) with end-user customers do not necessarily get sufficient information about incidents that occur at upstream CSPs. In this paper, we argue the need for commonly agreed-upon incident information exchanges between providers as a means to improve accountability of CSPs. The discussion considers several technical challenges and non-technical aspects related to improving the situation for incident response in cloud computing scenarios. In addition, we propose a technical implementation which can embed standard representation formats for incidents in notification messages, built over a publish-subscribe architecture, and a web-based dashboard for handling the incident workflow.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Advanced healthcare services enabled by a computerized pain body map\n", "abstract": " Pain Body Maps are promising tools for patients with advanced cancer. We briefly present Computerised Pain Body Maps from the literature, and contrast them with our own CPBM specifically designed for this patient group. Furthermore, we ponder the fact that current CPBMs do not really offer any more functionality than the paper PBMs, but show how a fully-functioning CPBM system is a prerequisite to many innovations in pain management.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Passing the buck: outsourcing incident response management\n", "abstract": " Many organizations are outsourcing computer operations to third parties, and the next logical step is to outsource management of computer security incidents as well. This paper describes a case study where we have studied several organizations who are active in this space today. Our results indicate that outsourcing of incident management is a viable security approach for many organizations, but that transitioning between providers frequently is a challenge.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Security Considerations for Tablet-based eHealth Applications.\n", "abstract": " Tablet computers are slowly being put into use in hospitals and primary care both by clinicians and patients. This paper will examine security needs of tablet-based eHealth applications, and explore how conventional security mechanisms can be adapted to this space. Our approach will be demonstrated by examining a particular eHealth application; a tablet-based Pain Body Map for use in palliative care.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Security checklists: a compliance alibi, or a useful tool for water network operators?\n", "abstract": " Checklist Compliance is a term that has been used derisively in the information security community, implying that checklists are something used for paying lip service to security without instigating real changes to technology or processes. In this paper we argue that checklists can also be used as a practical tool to quickly establish a security baseline for water and wastewater systems.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Towards an Ontology for Cloud Security Obligations\n", "abstract": " This paper presents an ontology for Cloud security obligations, which is based on a number of industry accepted standards and guidelines. The ontology terms and relationships have been defined in the W3C ontology language OWL and includes a number of technical security controls that can be implemented by public Cloud providers. This paper outlines the ontology and demonstrates how it can be used in two different application areas.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Towards improved understanding and holistic management of the cyber security challenges in power transmission systems\n", "abstract": " Information and Communication Technology (ICT) is increasingly utilised in the electrical power transmission system. For the power system, ICT brings a lot of benefits, but it also introduces new types of vulnerabilities and threats. Currently the interdependencies between the power and ICT system are not fully understood, including how threats (both malicious and accidental) towards the ICT system may impact on power delivery. This paper addresses the need for improved understanding between ICT security and power experts. It explains important terms used differently in the two disciplines, identifies main impacts on power systems that may result from ICT incidents, and proposes a set of indicators that can be used as a basis for selecting measures.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Security Threats in Demo Steinkjer. Report from the Telenor-SINTEF collaboration project on Smart Grids\n", "abstract": " This report describes security threats associated with the deployment of an Advanced Metering Infrastructure (AMI) in the Demo Steinkjer demonstration project. The description is based on the first phase of the actual smart meter roll-out in Steinkjer, but is kept on a vendor-neutral level. This document should thus be relevant for all other Distribution System Operators choosing a similar configuration for their AMI.    The work described in this report has been performed by SINTEF with funding from Telenor, as a contribution to the Demo Steinkjer project organised under the auspices of the Norwegian Smart Grid Centre.  Additional contributions have been received from NTNU, NTE and Aidon.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Not ready for prime time: A survey on security in model driven development\n", "abstract": " Model Driven Development (MDD) is by many considered a promising approach for software development. This article reports the results of a systematic survey to identify the state-of-the-art within the topic of security in model driven development, with a special focus on finding empirical studies. The authors provide an introduction to the major secure MDD initiatives, but the survey shows that there is a lack of empirical work on the topic. The authors conclude that better standardization initiatives and more empirical research in the field is necessary before it can be considered mature.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Dynamic Modeling and Simulation Analysis of the Cushioning System of the Impact Roller Based on ADAMS\n", "abstract": " The mathematical model of cushioning system is established on the basis of analyzing the structure and work characteristics of the impact roller. The assembly model of the whole machine was developed in UG software utilizing the multi-body dynamics theory and imported into ADAMS that is the integrated mechanical system simulation software. The simulation model was created including tire and road model and was simulated dynamically in ADAMS under different working conditions. By simulation, the horizontal impact load is acquired which acted on the traction vehicle. The simulation results are compared with the testing data, which validates the correctness of the dynamic simulation model. It is simulated and analyzed how the model parameters influence the traction load. The results suggest that the dynamic model and road model can simulate working conditions of the impact roller and help engineering …", "num_citations": "4\n", "authors": ["365"]}
{"title": "Securing the IaaS Service Model of Cloud Computing Against Compromised Components\n", "abstract": " Cloud Computing is a new computing model, and its security aspects require special considerations. New characteristics of the cloud model have introduced new security challenges, and made some of the existing security techniques incompatible. Moreover, existing cloud environments are closed, operated by commercial providers, and their security mechanisms are proprietary as well as confidential. In other words, there is not much chance of observing how a real cloud environment is working, and how their providers adapt security measures to the new model.Therefore, we have chosen an open source cloud platform to build our own cloud environment. The OpenStack cloud software met our requirements, but it was not mature enough. We have done a deep analysis of this platform, identified potential attack targets in it, and discuss impacts of a successful attack.In order to secure our environment, the National Institute of Standards and Technology (NIST) incident handling guideline has been applied to the cloud model, and corresponding actions for each phase has been performed. To complete our study, we have proposed a set of cloud specific approaches that fulfill the incident handling requirements. These approaches address challenges identified in the guideline adaptation process. Additionally, we have studied the feasibility and compatibility of each approach against our deployed environment.Additionally, we also have submitted a paper to IEEE CloudCom 2011 conference, based on my thesis. A draft version of the paper is included in Appendix A.", "num_citations": "4\n", "authors": ["365"]}
{"title": "The road to Hell is paved with good intentions: A story of (in) secure software development\n", "abstract": " In this paper, we present the results of a security assessment performed on a home care system based on SOA, realized as web services. The security design concepts of this platform were specifically tailored to meet new security challenges and to be compliant with legal frameworks applicable to the healthcare domain. This security design was fed as input to the development team,which implemented the system. However, our assessment revealed a software platform with severe security weaknesses and vulnerabilities, demonstrating pitfalls that are, or should be, well known. Our experience re-confirms that security must be built as an intrinsic software property and emphasizes the need for security awareness throughout the whole software development lifecycle.", "num_citations": "4\n", "authors": ["365"]}
{"title": "All in a day's work: Password cracking for the rest of us\n", "abstract": " The majority of computer systems are still protected primarily with a user name and password, and many users employ the same password on multiple systems. Additionally, some of the most popular operating systems such as Windows XP, Windows Vista and the upcoming Windows 7, still use ad-hoc constructed hash functions such as LM, while many Linux variants use the broken hash function MD5. This paper describes an experiment where we have tested the strengthof a selection of passwords when converted to LM, NT and MD5 hashes, respectively, using commonly available tools. Our conclusion is that a large number of passwords can be cracked within a normal working day, and that all LM hash passwords can be recovered before morning coffee. The use of such weak hash functions in the process of user authentication in these operating systems poses a significant threat to an organization's security.", "num_citations": "4\n", "authors": ["365"]}
{"title": "Firewall technology\n", "abstract": " Although the study of ﬁrewalls by now has evolved into a mature ﬁeld, documentation and publications are still rife with ambiguities with respect to the terms used. This document ventures to describe today's ﬁrewall technology in its various component parts, using a consistent terminology. Current ﬁrewall research is also presented, along with an example of a possible future ﬁrewall design.", "num_citations": "4\n", "authors": ["365"]}
{"title": "IT security is from Mars, software security is from Venus\n", "abstract": " The divide between IT security and software security can result in the neglect of proper software security. This divide can be bridged by establishing a formal security champion role in the development team and conducting collaborative risk-based security activities.", "num_citations": "3\n", "authors": ["365"]}
{"title": "An Empirical Study of CERT Capacity in the North Sea\n", "abstract": " This paper documents the results of an empirical study of cyber incident response readiness in the Norwegian petroleum industry. The study addressed the Computer Emergency Response Team (CERT) capacity among various actors in the industry in handling critical cybersecurity incidents in industrial control and safety systems, with a focus on Operational Technology (OT) systems. The paper presents results from interviews with personnel in petroleum companies as well as interviews with national and international CERT actors. The informants in the petroleum industry are relatively satisfied with their own CERT capacity today, but it is acknowledged that one can always improve. Oil and gas companies and drilling companies share information and experience in various (virtual) meeting places and forums organized by external actors, but there is little focus, especially among the smaller companies, on …", "num_citations": "3\n", "authors": ["365"]}
{"title": "Towards a Conceptual Framework for Security Requirements Work in Agile Software Development\n", "abstract": " Security requirement work plays a key role in achieving cost-effective and adequate security in a software development project. Knowledge about software companies' experiences of security requirement work is important in order to bridge the observed gap between software security practices and security risks in many projects today. Particularly, such knowledge can help researchers improve on available practices and recommendations. This article uses the results of published empirical studies on security requirement work to create a conceptual framework that shows key concepts related to work context, this work itself and the effects of this work. The resulting framework points to the following research challenges: 1) Identifying and understanding factors important for the effect of security requirements work; 2) Understanding what is the importance of the chosen requirements approach itself, and; 3) Properly …", "num_citations": "3\n", "authors": ["365"]}
{"title": "The Security Intention Meeting Series as a way to increase visibility of software security decisions in agile development projects\n", "abstract": " To achieve a level of security that is just right, software development projects need to strike a balance between security and cost. This necessitates making such decisions as to what security activities to perform in development and which security requirements should be given priority. Current evidence indicates that in many agile development projects, software security is dealt with in a more or less\" accidental\" way based on individuals' security awareness and interest. This approach is unlikely to lead to an optimal security level for the product. This paper suggests Security Intention Recap Meetings as a recurring organisational tool for evaluating current practices regarding the security intentions of a software project, and to make decisions on how to move forward. These meetings involve key decision makers in the project, such as the product owner and the project manager, with the purpose of making security …", "num_citations": "3\n", "authors": ["365"]}
{"title": "Measuring Developers' Software Security Skills, Usage, and Training Needs\n", "abstract": " Software security does not emerge fully formed by divine intervention in deserving software development organizations; it requires that developers have the required theoretical background and practical skills to enable them to write secure software, and that the software security activities are actually performed, not just documented procedures that sit gathering dust on a shelf. In this chapter, the authors present a survey instrument that can be used to investigate software security usage, competence, and training needs in agile organizations. They present results of using this instrument in two organizations. They find that regardless of cost or benefit, skill drives the kind of activities that are performed, and secure design may be the most important training need.", "num_citations": "3\n", "authors": ["365"]}
{"title": "Understanding challenges to adoption of the Protection Poker software security game\n", "abstract": " Currently, security requirements are often neglected in agile projects. Despite many approaches to agile security requirements engineering in literature, there is little empirical research available on why there is limited adoption of these techniques. In this paper we describe a case study on challenges facing adoption of the Protection Poker game; a collaborative and lightweight software security risk estimation technique that is particularly suited for agile teams. Results show that Protection Poker has the potential to be adopted by agile teams. Key benefits identified include good discussions on security and the development project, increased knowledge and awareness of security, and contributions to security requirements. Challenges include managing discussions and the time it takes to play, ensuring confidence in the results from playing the game, and integrating results in a way that improves security of …", "num_citations": "3\n", "authors": ["365"]}
{"title": "Cyber security considerations for self-healing smart grid networks\n", "abstract": " Fault Location, Isolation and System Restoration (FLISR) mechanisms allow for rapid restoration of power to customers that are not directly implicated by distribution network failures. However, depending on where the logic for the FLISR system is located, deployment may have security implications for the distribution network. This paper discusses alternative FLISR placements in terms of cyber security considerations, concluding that there is a case for both local and centralized FLISR solutions.", "num_citations": "3\n", "authors": ["365"]}
{"title": "Could the Outsourcing of Incident Response Management Provide a Blueprint for Managing Other Cloud Security Requirements?\n", "abstract": " In this chapter, we consider whether the outsourcing of incident management is a viable technological approach that may be transferable to other cloud security management requirements. We review a viable approach to outsourcing incident response management and consider whether this can be applied to other cloud security approaches, starting with the concept of using proper measurement for a cloud security assurance model. We demonstrate how this approach can be applied, not only to the approach under review, but how it may be applied to address other cloud security requirements.", "num_citations": "3\n", "authors": ["365"]}
{"title": "Accountability through transparency for cloud customers\n", "abstract": " Public cloud providers process data on behalf of their customers in data centres that typically are physically remote from their users. This context creates a number of challenges related to data privacy and security, and may hinder the adoption of cloud technology. One of these challenges is how to maintain transparency of the processes and procedures while at the same time providing services that are secure and cost effective. This chapter presents results from an empirical study in which the cloud customers identified a number of transparency requirements to the adoption of cloud providers. We have compared our results with previous studies, and have found that in general, customers are in synchrony with research criteria for cloud service provider transparency, but there are also some extra pieces of information that customers are looking for. We further explain how A4Cloud tools contribute to …", "num_citations": "3\n", "authors": ["365"]}
{"title": "Modenhetskartlegging av programvaresikkerhet i offentlige virksomheter\n", "abstract": " Difi ønsker å få en kartlegging av modenhet knyttet til informasjonssikkerhet i utvikling og anskaffelser av IKT-løsninger i offentlig sektor. Denne rapporten beskriver resultatene fra en spørreundersøkelse knyttet til i hvilken grad aktiviteter for å sikre programvaresikkerhet er tatt i bruk som en del av programvareutviklingsprosessene i 20 offentlige virksomheter.    Funnene tyder på at offentlige virksomheter i Norge er gode på å etterleve lover og retningslinjer når de utvikler egen kode, men at det er store forbedringspotensialer i forbindelse med måling av sikkerhet og opplæring av utviklere innen sikker programvareutvikling.", "num_citations": "3\n", "authors": ["365"]}
{"title": "“Security-Aware and Data Intensive Low-Cost Mobile Systems” Editorial\n", "abstract": " We are witnessing a paradigm shift in the way mobile devices are being used and operated. What was once a voice network is now predominantly a data network. As a consequence, end-users are now using mobile systems for applications that fall under the data intensive paradigm, such as Skyline queries, streaming information relays, and crowd sourced disaster management. However, this paradigm shift has opened new research directions, such as:(a) Security, as the system now has numerous distributed entry points and the behavior of a malicious entity does not really correlate with any previously known phenomenon (eg, Internet virus attacks, DOS attacks, etc.).(b) Data interoperability that must cater to the fundamental issue that mobile devices are required to work seamlessly with Internet data, thus requiring revision of protocols, data exchange frameworks to improve data sharing among mobile devices …", "num_citations": "3\n", "authors": ["365"]}
{"title": "A lightweight approach to secure software engineering\n", "abstract": " Secure software engineering1 is much more than developing critical software. History has shown us that software bugs and design flaws also represent exploitable security vulnerabilities in seemingly innocuous applications such as web browsers and PDF document viewers. This implies that there is a need for a well-balanced amount of security awareness in all software development projects right from the beginning.Most software developers are not primarily interested in (or knowledgeable about) security; for decades, the focus has been on implementing as much functionality as possible before the deadline, and then patch whatever bugs there may be when it’s time for the next release or hotfix. However, it is slowly beginning to dawn on the software engineering community that security is important also for software whose primary function is not related to security. There are clear indications that significant cost savings and other advantages are achieved when security analysis and secure engineering practices are introduced early in the development cycle, and that the number of serious security defects can be significantly reduced with a minimum of extra costs. However, having a clear security focus is not easy, and today there are very few people that master both the art of software and security engineering. There is thus a need for closer collaboration and knowledge transfer between the two factions.", "num_citations": "3\n", "authors": ["365"]}
{"title": "A secure MANET routing protocol for first responders\n", "abstract": " Emergency and rescue operations are often carried out in areas where the network infrastructure cannot be relied on for message exchange between first responders. Since the fundamental feature of Mobile Ad Hoc Network is the ability to operate independently of existing infrastructure, it is deemed a well suited solution to first responders scenarios. In this paper we describe a security extension to the OLSR routing protocol specifically designed for first responders scenarios. Our proposed protocol provides node authentication and access control using asymmetric encryption and digital certificates. A link encryption scheme is devised to allow for efficient encryption of data even in broadcast mode, without the need for a network wide shared key. By utilising pairwise symmetric keys for link confidentiality, our solution is both efficient and scalable.", "num_citations": "3\n", "authors": ["365"]}
{"title": "A Security Architecture for an Open Broadband Access Network\n", "abstract": " Europe is experiencing a rapid growth in residential broadband coverage, but due to usage patterns and cost structures, only a fraction of the available bandwidth is actually being consumed. This implies that most residential broadband subscribers have excess capacity, and the idea of the Open Broadband Access Network (OBAN) project is that this capacity can be shared with passers-by. In order for the residential broadband subscribers to open up their networks, and for the potential wireless customers to sign up for OBAN service, the security of both parties must be ensured. OBAN needs to solve the problems posed by the fact that a visiting OBAN user and a residential access point operator have no pre-existing trust relationship. This paper describes an architecture that achieves this. In addition, the architecture ensures that all participating parties are able to prove the amount of traffic transferred in any given OBAN session. This enables a broader range of business models with respect to charging of visiting OBAN users, remuneration of residential subscribers, and cooperation between service providers. This may in turn result in new business opportunities.", "num_citations": "3\n", "authors": ["365"]}
{"title": "A Trustworthy Blockchain-based Decentralised Resource Management System in the Cloud\n", "abstract": " Quality Critical Decentralised Applications (QC-DApp) have high requirements for system performance and service quality, involve heterogeneous infrastructures (Clouds, Fogs, Edges and IoT), and rely on the trustworthy collaborations among participants of data sources and infrastructure providers to deliver their business value. The development of the QCDApp has to tackle the low-performance challenge of the current blockchain technologies due to the low collaboration efficiency among distributed peers for consensus. On the other hand, the resilience of the Cloud has enabled significant advances in software-defined storage, networking, infrastructure, and every technology; however, those rich programmabilities of infrastructure (in particular, the advances of new hardware accelerators in the infrastructures) can still not be effectively utilised for QCDApp due to lack of suitable architecture and programming model.", "num_citations": "2\n", "authors": ["365"]}
{"title": "Achieving\" Good Enough\" Software Security: The Role of Objectivity\n", "abstract": " Today's software development projects need to consider security as one of the qualities the software should possess. However, overspending on security will imply that the software will become more expensive and often also delayed. This paper discusses the role of objectivity in assessing and researching the goal of good enough security. Different understandings of objectivity are introduced, and the paper explores how these can guide the way forward in improving judgements on what level of security is good enough. The paper recommends adopting and improving upon methods that include different perspectives, support the building of interactive expertise, and support confirmability by keeping documentation of the basis on which judgements were made.", "num_citations": "2\n", "authors": ["365"]}
{"title": "Tackling the cloud forensic problem while keeping your eye on the GDPR\n", "abstract": " If the cloud is just someone else's computer, securing forensic evidence in case of a breach can be tricky. A blockchain-based distributed ledger could contribute to solve this problem, provided the required forensic information finds its way onto the blockchain. In this paper we sketch how blockchain technology and smart contracts apply to various processing models and their respective forensic challenges, and highlight how an accountability-based approach will be instrumental to the overall acceptability of the solution.", "num_citations": "2\n", "authors": ["365"]}
{"title": "Safety Critical Software and Security-How Low Can You Go?\n", "abstract": " The safety of aviation software is ensured by performing development according to the DO-178C standard. However, this standard has a blind spot in that it fails to consider software security aspects in development. The Building Security In Maturity Model (BSIMM) comprises a software security framework with 113 software security activities. This model is often used for measuring the maturity of an organization's software security lifecycle. In this paper we evaluate the ability of DO-178C to ensure also software security, by demonstrating how few BSIMM activities you can get away with performing, while remaining compliant with the different DO-178C assurance levels. The results indicate that organizations with very low software security maturity can still be able to perform well in accordance to DO-178C. Based on the results, we propose concrete activities that could be integrated into the DO-178C development …", "num_citations": "2\n", "authors": ["365"]}
{"title": "Securing big data in the cloud by protected mapping over multiple providers\n", "abstract": " The Cloud is increasingly being used to store and process big data, and conventional security mechanisms using encryption are either not sufficiently efficient or not suited to the task of protecting big data in the Cloud. In this paper we present an alternative approach which divides big data among multiple Cloud providers, and instead of protecting the data itself, protects the mapping of the various data elements to each provider using a trapdoor function. Our initial analysis indicates that this is an efficient and secure approach for securing big data.", "num_citations": "2\n", "authors": ["365"]}
{"title": "Learn to SWIM\n", "abstract": " This paper is meant to provide an overview over SWIM and its context from a security point of view. Rather than describing everything in detail it refers to the relevant SJU deliverables where possible and tries to provide the \"glue\" between the different pieces of information.", "num_citations": "2\n", "authors": ["365"]}
{"title": "A briefing on cloud security challenges and opportunities\n", "abstract": " Cloud computing has emerged as a major shift in how computing resources are deployed and consumed, both by individuals and enterprises. However, despite benefits such as reduced up-front investment, lower costs and more eco-friendly operation, a large proportion of potential cloud customers are voicing misgivings with respect to how security and privacy are handled in the cloud. This distrust has been further fueled by media events, such as the PRISM scandal, which really shows how difficult it can be to know to what extent our data is being monitored for legitimate or illegitimate purposes.", "num_citations": "2\n", "authors": ["365"]}
{"title": "Security, Mobility and QoS in Open Access: Can You Get Three Things at Once?\n", "abstract": " The broadband access capacity that connects homes to the Internet is often only partially consumed, either because of the relatively low-range access subscription selected or because the user is not constantly on-line. By allowing strangers-that happen to be near but outside the home-to make use of these residential access facilities through their WLAN equipped terminals, the usage of the network capacity can be increased substantially. The challenge is to offer this access service in such a way that it is comparable to the services offered in 2G/3G networks, including the support of quality of service, secure connections and the possibility to roam from one home to another while continuing the session without noticeable disruptions. This paper sketches how to realise these challenges in an integrated solution.", "num_citations": "2\n", "authors": ["365"]}
{"title": "DID-eFed: Facilitating Federated Learning as a Service with Decentralized Identities\n", "abstract": " We have entered the era of big data, and it is considered to be the” fuel” for the flourishing of artificial intelligence applications. The enactment of the EU General Data Protection Regulation (GDPR) raises concerns about individuals’ privacy in big data. Federated learning (FL) emerges as a functional solution that can help build high-performance models shared among multiple parties while still complying with user privacy and data confidentiality requirements. Although FL has been intensively studied and used in real applications, there is still limited research related to its prospects and applications as a FLaaS (Federated Learning as a Service) to interested 3rd parties. In this paper, we present a FLaaS system: DID-eFed, where FL is facilitated by decentralized identities (DID) and a smart contract. DID enables a more flexible and credible decentralized access management in our system, while the smart contract …", "num_citations": "1\n", "authors": ["365"]}
{"title": "The Quality Triage Method: Quickly Identifying User Stories with Quality Risks\n", "abstract": " Quality requirements often receive insufficient attention, both in agile and in traditional software development. This paper describes the quality triage, a quick, agile method in which user stories or features with quality risks are identified. This paper shows how the four qualities scalability, security, safety, and availability are scored at short expert meetings ― triages. In this way, quality risks are made explicit and can be immediately addressed. We illustrate the method with a scenario involving semi-autonomous cars.", "num_citations": "1\n", "authors": ["365"]}
{"title": "Grunnprinsipper for ikt-sikkerhet i industrielle ikt-systemer\n", "abstract": " The purpose of this report is to assess to what extent the controls in the NSM basic principles for ICT security (version 2.0) are relevant for industrial ICT systems (OT systems) in the petroleum sector, and to assess whether there are complementary controls in Kraftberedskapsforskriften and the NIST CyberSecurity Framework.Our assessment is that the NSM basic principles to a great extent are relevant for OT systems, provided special care is taken with selected controls, as indicated in this report. Out of 118 NSM controls, we find that 96 are fully relevant (☑); 18 are relevant, but require special care ([!]); and 4 controls are not relevant for OT systems", "num_citations": "1\n", "authors": ["365"]}
{"title": "What Could Possibly Go Wrong? Smart Grid Misuse Case Scenarios\n", "abstract": " The modernisation of the power grid is ongoing, and the level of digitalisation of the power grid in, say, ten years may be quite different than today. Cyber security needs will change correspondingly. In this paper we utilise a qualitative research approach to explore misuse cases related to three main areas of modernisation that we envision for the next ten year period: 1) managing flexibility in the TSO-DSO relation, 2) smart distribution grids, and 3) microgrids. The misuse cases represent potential security challenges to be considered when working on modernising the grid, however they are not exhaustive. The misuse cases presented in this paper can contribute to identifying security requirements, thus reducing associated cyber risks, and assist in development of new cyber security mechanisms for the next-generation power grid employing digitally-connected, self-healing, and automation characteristics.", "num_citations": "1\n", "authors": ["365"]}
{"title": "Architectural Risk Analysis in Agile Development of Cloud Software\n", "abstract": " Software in the cloud is predominantly developed using agile methodologies, where practices such as continuous deployment and DevOps contribute to increased speed and quick turnarounds. This increased speed does however require additional focus on software security in order to avoid security bugs and architectural flaws from crippling a cloud business. Architectural Risk Analysis has been touted as one of the most powerful software security activities, but in some agile development projects there is no distinct architecture activity, and often no dedicated architects. In this paper we will examine the challenges of performing Architectural Risk Analysis in agile development projects.", "num_citations": "1\n", "authors": ["365"]}
{"title": "A cost-efficient protocol for open blockchains\n", "abstract": " Current proof-of-work blockchains are not sustainable in terms of energy needed to run them. In this paper we propose a new scheme that avoids wasted proof-of-work by a dynamic probabilistic method, where the consensus algorithm can be adjusted according to the parties' required assurance levels.", "num_citations": "1\n", "authors": ["365"]}
{"title": "Risiko-og sårbarhetsanalyse for økt integrasjon av AMS-DMS-SCADA\n", "abstract": " Rapporten beskriver risiko og sårbarhet i kraftnettet ved tettere kobling mellom AMS, DMS og SCADA. Sikkerhetsutfordringene ved økt integrasjon er håndterbare, gitt iverksetting av gode forebyggende tiltak", "num_citations": "1\n", "authors": ["365"]}
{"title": "Cybersikkerhet i digitale transformatorstasjoner. Forprosjekt\n", "abstract": " Dette notatet beskriver konseptet digital transformatorstasjon, og skisser relevante cyberrelaterte sårbarheter og mottiltak. For grunnleggende sikkerhetsnivå (basisnivå) anbefaler vi at det gjennomføres risikoanalyse med henblikk på cyberangrep for en representativ digital transformatorstasjon, at det gjøres øvelser og trening basert på NVEs scenarioer for IKT‐hendelser, at det innføres monitorering av nettverkstrafikk med anomalideteksjon, logging og logganalyse, konfigurasjonskontroll på fysiske og logiske komponenter, og at det etableres gode passord på alle komponenter. For utvidet sikkerhet anbefaler vi fullkryptering av all IEC 61850‐trafikk i feltet (må veies mot ulempene kryptering medfører for monitorering), redundans av kritiske komponenter med failover, anomalideteksjon på sensormålinger (med ekstra sensorer for validering), etablering av \"nødknapp\" for enkel nettverks‐segregering ved behov, og at det innføres tofaktor autentisering mot alle komponenter. Videre anbefaler vi at det foretas risikoanalyser med henblikk på cyberangrep for hver enkelt transformatorstasjon, og at det utarbeides nye scenarioer for cyberhendelser spesifikt for digitale transformatorstasjoner. Oppdragsgiver: Statnett", "num_citations": "1\n", "authors": ["365"]}
{"title": "Does Public Media Enhance Citizen Knowledge? Sifting through the Evidence\n", "abstract": " Although there are disagreements about how politically knowledgeable citizens should be for democracy to function well, few argue against the notion that an informed citizenry is good for democracy. Because most citizens get their information about politics and current affairs from the media, a key concern for political communication scholars has been investigating the links between (1) media funding and organization and (2) the supply of political information and public knowledge. To understand these mechanisms is perhaps more important now than ever before, as the media landscape is radically expanding and the number of commercial media channels multiplying. The challenge to existing media brought by this expansion is assumed to be a positive development, as citizen", "num_citations": "1\n", "authors": ["365"]}
{"title": "I'll Trust You-for Now.\n", "abstract": " The pervasiveness of cloud computing paired with big data analytics is fueling privacy fears among the more paranoid users. Cryptography-based solutions such as fully homomorphic encryption and secure multiparty computation are trying to address these fears, but still do not seem to be ready for prime time. This paper presents an alternative approach using encrypted cloud storage by one provider, supplemented by cloud processing of cleartext data on one or more different cloud providers.", "num_citations": "1\n", "authors": ["365"]}
{"title": "Seeking Risks: Towards a quantitative risk perception measure\n", "abstract": " Existing instruments for measuring risk perception have focused on an abstract version of the concept, without diving into the the details of what forms the perception of likelihood and impact. However, as information security risks become increasingly complex and difficult for users to understand, this approach may be less feasible. The average user may be able to imagine the worst case scenario should an asset be compromised by an attacker, but he has few means to determine the likelihood of this happening. In this paper we therefore propose a different approach to measuring risk perception. Based on well established concepts from formal risk analysis, we define an instrument to measure users’ risk perception that combines the strengths of both traditional risk perception and formal risk analysis. By being more explicit and specific concerning possible attackers, existing security measures and …", "num_citations": "1\n", "authors": ["365"]}
{"title": "Drizzle: the RAIN prototype\n", "abstract": " Internet communities are moving to the Cloud, but in addition to the advantages regarding cost and convenience, this also means that cloud service providers are increasingly in a position to aggregate large amounts of personal data, which means that it is becoming prudent to develop mechanisms that can contribute to limiting the information available to providers. In this paper we present a prototype cloud security solution for protection against an “honest but curious” cloud provider. The solution is based on splitting up data and distributing it to multiple cloud providers, without encrypting the individual pieces. Our initial tests indicate that our solution is sufficiently efficient for normal use.", "num_citations": "1\n", "authors": ["365"]}
{"title": "Autonomic and Trusted Computing\n", "abstract": " This book constitutes the refereed procedings of the 5th International Conference on Autonomic and Trusted Computing, ATC 2008, held in Oslo, Norway, in June 2008, co-located with UIC 2008, the 5th International Conference on Ubiquitous Intelligence and Computing.  The 25 revised full papers presented together with 26 special session papers and 1 keynote talk were carefully reviewed and selected from 75 submissions. The regular papers are organized in topical sections on intrusion detection, trust, trusted systems and crypto, autonomic computing, organic computing, knowledge and patterns, and pervasive systems. The special session papers cover issues such as organic computing, trust, trust and dependable systems, routing and reliable systems, sensor networks, VoIP, and watermarking.", "num_citations": "1\n", "authors": ["365"]}
{"title": "Survival by deception\n", "abstract": " A system with a high degree of availability and survivability can be created via service duplication on disparate server platforms, where a compromise via a previously unknown attack is detected by a voting mechanism. However, shutting down the compromised component will inform the attacker that the subversion attempt was unsuccessful, and might lead her to explore other avenues of attack. This paper presents a better solution by transforming the compromised component to a state of honeypot; removing it from duty, while providing the attacker with bogus data. This provides the administrator of the target system with extra time to implement adequate security measures while the attacker is busy “exploiting” the honeypot. As long as the majority of components remain uncompromised, the system continues to deliver service to legitimate users.", "num_citations": "1\n", "authors": ["365"]}
{"title": "Techniques for increasing survivability in NATO CIS\n", "abstract": " The battlefield is becoming more dependent on digital information, such as updated situation pictures, and fast communication between different commanders and systems. As Nato CISs are connected against other CISs new threats emerge, and survivability of the CISs become an important issue.", "num_citations": "1\n", "authors": ["365"]}