{"title": "Software quality: A curriculum postscript?\n", "abstract": " This paper addresses a central and critical issue in the development of computer software-its quality. The main thesis of the paper is that computer science faculty, in their design and implementation of curricula, do not devote sufficient attention to teaching their students how to develop high-quality software. As in industry, the most common and popular way of assuring the quality of programs is through software testing. In other words, quality is treated as an afterthought or as postscript in program development. The paper presents and discusses a quality model that can be used to incorporate a wide variety of quality assurance techniques within a curriculum. The model also presents a structured approach for introducing software testing into the educational environment. Finally, there is a discussion of how the model has been implemented using two current software process technologies, the PSP and the TSP.", "num_citations": "75\n", "authors": ["1253"]}
{"title": "A case for software engineering\n", "abstract": " The paper argues for the use of the \"case study\" approach to educating and training software engineers. After discussing problems in software engineering education and introducing the fundamentals of case study teaching, the paper describes a project to develop a comprehensive and complete case study, called the DigitalHome (DH) system, which involves the development of \"smart house\" technology by a national retail chain serving the needs of home owners. Thus far the following has been developed: marketing documents, project launch material, a project plan, an SRS, and a set of scene-setting and problem-solving scenarios. The case study will eventually consist of a complete set of life-cycle artifacts, a realistic description of the people and events that are part of the DH development, and a set of exercises that are designed to involve students in the solutions of software engineering problems associated …", "num_citations": "38\n", "authors": ["1253"]}
{"title": "Fault tree analysis for software design\n", "abstract": " We present a study on software fault tree analysis (SFTA) conducted at the Software Assurance Technology Center at NASA Goddard Space Flight Center. While researchers have made various attempts at SFTA, software assurance practitioners have been slow to adopt it. One reason is the intense manual effort needed to identify and draw the fault trees for the code of large software projects. Another is the lack of commercial tools to assist in the technique for software. Most SFTA research efforts have been directed at requirements or code. Performing SFTA on the design may enable application of SFTA to critical code only, thus reducing the amount of effort. We attempt to develop a relationship between UML/spl trade/ design diagrams and fault tree symbology to enable adaptation of a commercial FTA tool to at least one software design language. Such a result would reduce the amount of fault tree effort both for …", "num_citations": "36\n", "authors": ["1253"]}
{"title": "Integrating the Personal Software Process (PSP) across the undergraduate curriculum\n", "abstract": " This paper summaries some Embry-Riddle University activities on the incorporation of Watts Humphrey's Personal Software Process (PSP) throughout the undergraduate computer science curriculum. This paper includes a description of the project's objectives, a discussion of the activities engaged in by students, an explanation of how the activities were integrated into the curriculum, a description of the data collected and an assessment of the impact and value of the project. Finally ideas about modification and extension of the project's concepts are presented.", "num_citations": "27\n", "authors": ["1253"]}
{"title": "Validation of object oriented software design with fault tree analysis\n", "abstract": " Software plays an increasing role in the safety critical systems. Increasing the quality and reliability of the software has become the major objective of software development industry. Researchers and industry practitioners, look for innovative techniques and methodologies that could be used to increase their confidence in the software reliability. Fault tree analysis (FTA) is one method under study at the Software Assurance Technology Center (SATC) of NASA's Goddard Space Flight Center to determine its relevance to increasing the quality and the reliability of software. This paper briefly reviews some of the previous research in the area of software fault tree analysis (SFTA). Next we discuss a roadmap for application of the SFTA to software, with special emphasis on object-oriented design. This is followed by a brief discussion of the paradigm for transforming a software design artifact (i.e., sequence diagram) to its …", "num_citations": "26\n", "authors": ["1253"]}
{"title": "Work in progress: Teaching computational thinking in middle and high school\n", "abstract": " Computational thinking (CT) does not require profound knowledge of computer science (CS). Vice versa, it helps students organize and build up new knowledge around the core CS concepts they encounter on the daily basis. Furthermore, CT provides a set of problem-solving skills and enhances analytical abilities that are crucial for the young generation to succeed in modern world pervaded with technology. Teaching the principles of computing to students with non-computing tracks of study provides them with a competitive advantage and breaks down stereotypes around CS. Our approach is to introduce a topic related to world issues and students' interests while concealing its relation to CS until students' interest and attention are captured. The approach takes advantage of pattern-matching abilities that are naturally wired in our brain to improve understanding and make the obtained knowledge persist in …", "num_citations": "25\n", "authors": ["1253"]}
{"title": "A case study project for software engineering education\n", "abstract": " This paper advocates the use of the \"case study\" approach to educating and training software engineers. After an account of the use of case studies in the education of professionals, there is a discussion of problems in educating software professionals and how a case teaching approach can be used to address these problems. The paper describes a project to develop a comprehensive and complete case study, along with supporting educational material. The case study is designed to teach a variety of software topics, modules and courses: from high school through college and even for continuing professional development", "num_citations": "24\n", "authors": ["1253"]}
{"title": "Doing quality work: the role of software process definition in the computer science curriculum\n", "abstract": " This paper discusses the role of personal software process definition in the education of computing professionals and the importance of emphasizing quality in the development of software. After examining recent government and industry efforts in introducing and instituting effective software development processes, there is a description of the Capability Maturity Model (CMM) and Watts Humphrey's Personal Software Process (PSP) and its use in industry and academia. The rest of the paper reports on a recent project that introduced PSP concepts into CS1 and CS2. Project methods and activities are described and the results of the project are analyzed. Finally, future enhancements and extensions of the project are discussed.", "num_citations": "21\n", "authors": ["1253"]}
{"title": "A web-based system for automating a disciplined personal software process (PSP)\n", "abstract": " In this paper, we describe PSP-DROPS (PSF Data RepOsitory and Presentation System), an automated Web-based tool to support teaching the Personal Software Process (PSP) technique, at Embry-Riddle Aeronautical University. PSP is a disciplined personal software process used in software development. Last year, PSP was incorporated into our first two programming, courses (CS1 and CS2). Using PPS-DROPS, students can receive on-line instructions for recording, their data, which cuts down the work load of managing and analyzing process data. Most importantly, the analyzed result can be presented to the students graphically anywhere that has the World Wide Web, (WWW) access. The user friendly environment by PSP-DROPS facilitates and motivates the students to practice PSP for improving, their academic work.", "num_citations": "20\n", "authors": ["1253"]}
{"title": "A cross-layer design for data collecting of the UAV-wireless sensor network system\n", "abstract": " There are advantages to retrieve information from the Wireless Sensor Network (WSN) for UAVs (Unmanned Aerial Vehicles). However, the UAV-WSN system has some differences with conventional WSN system. So it is important to design an appropriate scheme to control the transmission in a UAV-WSN system. In this paper we proposed a protocol called A-OAloha (Adaptive-Opportunistic Aloha) for UAV-UAV-WSN system to guarantee its efficiency. This protocol is based on a cross-layer design and is designed with the consideration of the distribution of the successful sensors, energy consumption and the transmission efficiency. For the distribution of the successful sensors, we design a mechanism based on the priority to make the distribution more uniform and the priority could be adaptively changed. For the consideration of energy-efficiency we choose to use the method that make the sensors go into sleep …", "num_citations": "14\n", "authors": ["1253"]}
{"title": "Developing case modules for teaching software engineering and computer science concepts\n", "abstract": " Although many software engineering (SE) and computer science (CS) texts use case studies to explain the different concepts, these case studies tend to focus on a specific subject such as object oriented design and implementation or requirements analysis and specification. In addition, these case studies usually lack instructor guidelines on how to use the material in teaching these concepts. The Digital Home Case Study addresses these issues by providing a complete set of artifacts associated with software development, and an extensive set of case study exercises for teaching different topics in software engineering and computer science, as well as guidance for instructors on how to use these case modules. In this paper, we motivate the use of the case study approach in teaching SE and CS concepts. We provide a description of the Digital Home case study and the associated artifacts and case modules. We …", "num_citations": "12\n", "authors": ["1253"]}
{"title": "Software quality across the curriculum\n", "abstract": " One of the major areas of software engineering, as specified in the SoftWare Engineering Body Of Knowledge, is software quality. This paper argues that software quality should be a central focus in an undergraduate computer science or software engineering curriculum, and that quality should not be viewed only as an exercise in software testing. First, we discuss the concepts and techniques that are needed to develop a high-quality software product. Then, we propose a model for viewing software quality and use the model to advocate quality activities that should be incorporated in a curriculum, addressing both product quality and process quality. We also share some of our ideas and experiences about integrating quality activities into the curriculum. Finally, we describe why an undergraduate software engineering curriculum should include at least one dedicated course in software quality. We present a detailed …", "num_citations": "12\n", "authors": ["1253"]}
{"title": "Software engineering emphasis in advanced courses\n", "abstract": " In the last twenty years, the development of application software has moved beyond the capabilities of the individual programmer and is now widely viewed as an engineering activity. This view is reinforced by the advent of “software factories,” the recent interest by government and industry in software process improvement, and the strategic importance of good engineering practice in the development of large complex computer systems. Employers of computer science majors, however, express serious concerns about recent graduates: a lack of relevant and practical competencies; the inability to work as part of a team; and little perspective about the human, economic, and managerial issues involved in software development needs. Peter Denning [1] summarizes the problems associated with current engineering education:1,... a curriculum capable of preparing students for the shifting world must incorporate new …", "num_citations": "10\n", "authors": ["1253"]}
{"title": "Information security in the aircraft access to system wide information management infrastructure\n", "abstract": " The Federal Aviation Administration's (FAA) Next Generation Air Transportation (NextGen) program is a long-term modernization and transformation of the current National Airspace System (NAS) into a more effective and coordinated decision-making system. NextGen provides a more reliable, secure, and dependable aviation capability for both users and operators ensuring more capacity, throughput, and safety. System Wide Information Management (SWIM) is a NextGen Service Oriented Architecture (SOA) technology that communicates aviation data among the various stakeholders incorporating trajectory based operations and optimum profile descent. SWIM data is delivered to the aircrew via Aircraft Access to SWIM (AAtS) framework. This research paper investigates the information security threats and performance caveats in the main operating components of AAtS by identifying the information security …", "num_citations": "9\n", "authors": ["1253"]}
{"title": "Introducing computational thinking through stealth teaching\n", "abstract": " The demand for additional engineering and computing degree graduates continue to increase [1, 2]; however, interest in pursuing these degrees is not matching the predicated demand. More specifically, attracting US students in engineering and computing field has always been a challenge; this is particularly true for female and minority students. Factors such as the \"geek image\", a demanding mathematical foundation, lack of \"gee whiz\" element early in the curriculum, and overall misconception about the career in these areas are all contributors to this problem. This paper describes some of our activities associated with the introduction of Computational Thinking (CT) concepts to middle and high schools. The central tenet of the project is to entice students in grade 6-12 to learn some fundamental and advance topics in engineering and computing field, thereby recognizing their own ability to understand the …", "num_citations": "9\n", "authors": ["1253"]}
{"title": "Read before you write\n", "abstract": " This paper describes and advocates a focused approach to using inspections of software artifacts as an active learning technique in software engineering education. A central thesis is that one must “learn to read before they write” that is, you should read and study an existing software artifact, before you develop one. There is discussion of how software artifacts and supporting instructional materials from a Digital Home case study project can be used to support and guide software inspection exercises. These inspection exercises are designed to introduce students to realistic software engineering artifacts and involve them in rigorous examination of their contents. Instances of the use of software inspections to teach software engineering are described and analyzed: the experiences of students and instructors, what worked and what did not, and how this influenced the cases study project. The authors also outline a …", "num_citations": "9\n", "authors": ["1253"]}
{"title": "Agile methodologies for hardware/software teams for a capstone design course: lessons learned\n", "abstract": " Agile Methodologies for Hardware/Software Teams for a Capstone Design Course: Lessons LearnedAbstract: Agile methodologies provide an alternative to more rigorous engineering design processesthrough iterative design and development. An engineering design process guides a team throughthe development of a product or products from inception to delivery based on customer needs. Software and systems engineering communities have defined a large number of processes thatcan be characterized by process models such as the waterfall model, v-model, spiral model, etc. These process models include large monolithic requirements and design activities with feedbackloops, and implementations such as the Team Software Process produce a significant level ofoverhead for students. Unfortunately, during a capstone design project in which students areworking with new tools, programming languages, multidisciplinary domains, etc., they oftenencounter set backs, requirements changes, and design changes because they are learning. There are a variety of agile methodologies that exist within the software engineering communitysuch as Crystal Clear, Extreme Programming, Scrum, etc. The Agile Manifesto emphasizesfrequent and rapid delivery of working prototypes of the system to the customer that areiteratively refined and developed. The teams define the specifics of their own design processbased on the guidance of the agile methodology selected with the anticipation that it will berevised periodically based on the team’s experience on the project. Since the team designates theprocess (with some input from the team’s manager), the …", "num_citations": "8\n", "authors": ["1253"]}
{"title": "The DigitalHome case study material\n", "abstract": " The paper discusses the content and use of a comprehensive case study called the DigitalHome (DH) system. The DH system involves the development of ldquosmart houserdquo technology by a national retail chain serving the needs of home owners. Thus far, DH artifacts, scenarios and exercises have been developed. Thus DH case study has been used in an introductory software engineering course and in a graduate course in software architecture.", "num_citations": "8\n", "authors": ["1253"]}
{"title": "Incorporating a disciplined software development process in to introductory computer science programming courses: Initial results\n", "abstract": " As the processing power of computers has increased, more complex and larger problems have been introduced. The lack of a disciplined approach to the solution of such problems has created a situation referred to as the \"software crisis\". That is, software products have been behind schedule, over budget and unreliable. The Software Engineering Institute (SEI), through the Capability Maturity Model (CMM), has addressed a software organization's capability with five maturity levels. CMM is based on a team approach to software production. Watts Humphrey, in the Personal Software Process (PSP) concept, addresses the roles and processes that individual team members should follow in order to be an effective member of a team. PSP is being taught to software engineers in different industries and also to graduate students in mainly Master of Software Engineering (MSE) programs. In their experiment the authors …", "num_citations": "8\n", "authors": ["1253"]}
{"title": "Modeling and simulation for uas integration into the united states national airspace system and nextgen\n", "abstract": " Airspace integration is a major challenge that must be addressed for wider unmanned aircraft system (UAS) acceptance and one-day ubiquitous operations. Both research and training play a role in addressing these challenges, which are cross-disciplinary. Embry-Riddle Aeronautical University (ERAU) is heavily invested in promoting the safe integration of UAS into both the United States National Airspace System (NAS) as well its future under the FAA NextGen programs planned upgrades. This paper surveys ERAUs use of modeling and simulation (M&S) to address the relevant challenges including development of flight management systems (FMS) for UAS to operate amongst manned air traffic, the development of aircraft performance models for various UAS categories, the application of simulator technologies to UAS flight crew training, and the creation of virtual labs to provide realistic training …", "num_citations": "7\n", "authors": ["1253"]}
{"title": "Best practices in software engineering project class management\n", "abstract": " An increasing number of institutions require software engineering as part of their computing curriculum. Technical managers and hiring personnel of many software development companies cite familiarity with software engineering principles among the top skills required for entry-level computing positions. Furthermore, technical managers and hiring personnel often consider experience with real-world group projects to be a necessary part of the computing background of prospective new hires. These conclusions are based on systematic discussions with technical and human resources personnel at 13 large Midwestern companies (50+ developers) over the past seven years (J. Beck, unpublished data, 2001–2008). Unfortunately, many computing students never benefit from the experience of a real project during their undergraduate studies.The experiences of many students are limited to toy textbook problems …", "num_citations": "6\n", "authors": ["1253"]}
{"title": "Software quality across the curriculum\n", "abstract": " This tutorial proves an overview of software quality concepts, processes, and techniques, as related to the design and implementation of undergraduate computing curricula. It provides ideas and examples of how to incorporate and integrate software quality practices into such curricula.", "num_citations": "6\n", "authors": ["1253"]}
{"title": "Functional conflict resolution in automated knowledge generation.\n", "abstract": " Degree: Ph. D.DegreeYear: 1990Institute: University of Central FloridaIn the past decade, the use of control and diagnostic reasoning systems in different areas of government, industry, and university operations has increased. A great number of these systems find their basis in engineering, specifically in process control. The majority of the time devoted to the development of these systems is spent in the areas of Knowledge Engineering (KE) and Knowledge Acquisition (KA). Extensive research for the development of systems that perform the KE task is underway. The work presented here is an approach toward automatic knowledge acquisition. The objective of this research was to construct a complete knowledge base for a diagnostic and control reasoning system from information that resides in Computer Aided Design (CAD) databases.", "num_citations": "6\n", "authors": ["1253"]}
{"title": "Flight dynamics and surveillance equipment simulation for trajectory based operation in unmanned aerial systems\n", "abstract": " This paper presents a Research and Development (R&D) effort to design and develop a flight simulation system with Adaptive Surveillance Broadcast (ADS-B), and Traffic Collision Avoidance System (TCAS), for integration of Unmanned Aerial Systems (UAS) into National Airspace System (NAS). The paper will delineate the design and development of the Next Generation Applied Research (NEAR) Lab's FMS (NEAR-FMS) including the UAS aircraft models, and the surveillance simulation equipment. The NEAR-FMS will be used in NextGen projects such as Four-Dimensional Trajectory 4DT operations, as well as Alliance for System Safety of UAS through Research Excellence (ASSURE) projects funded by Federal Aviation Association (FAA). Middle-fidelity Flight Dynamic Models (FDM) of two UASs, a Predator class and a Global Hawk have been designed and tested on JSBSim aerodynamic simulator. Autopilots …", "num_citations": "5\n", "authors": ["1253"]}
{"title": "Reporting on the use of a software development case study in computing curricula\n", "abstract": " The Use of a Software Development Case Study in Computing CurriculaThe use of case studies is an effective method for introducing real-world professional practicesinto the classroom. Case studies have become a proven and pervasive method of teaching aboutprofessional practice in such fields as business, law, and medicine. The term “case study” is usedin a variety of ways. In its most naive form, it simply refers to a realistic example used toillustrate a concept or technique. Although the use of case studies in education has shown success in the above mentioneddisciplines, it is yet to be adopted in any significant way in the computing education. One of thereasons for the lack of use of the case-study approach is the shortage of sufficient material forthis purpose. While many computing text books include the use of case studies to explain ideas, these cases seem to serve a specific purpose (eg, discussing programming constructs, softwareplanning or requirements analysis, design, risk analysis, or construction issues) by using simpleexamples that are quasi-realistic. These case studies often lack the following:• Realistic artifacts (often space does not allow providing a complete requirements or design document)• Completeness (covers only a portion of the life-cycle, and not an end-to-end), with a focus on design and implementation• Ability to decouple from the text and apply in ways not intended by the author• Techniques for integration into course activities or into the curriculum as a whole• A scenario format that would motivate students to get engaged in problem identification and solution.• Guidance to the instructor on how to use the case …", "num_citations": "5\n", "authors": ["1253"]}
{"title": "Constraint mechanisms in automated knowledge generation\n", "abstract": " In the past decade, the use of control and diagnostic reasoning systems in different areas of government, industry, and university operations has increased. A great number of these systems find their basis in engineering, specifically in process control. The majority of the time devoted to the development of these systems is spent in the areas of Knowledge Engineering (KE) and Knowledge Acquisition (KA). Extensive research for the development of systems that perform the KE task is under way. This article presents an approach toward automatic knowledge acquisition. The objective of this research was to construct a complete knowledge base for a diagnostic and control reasoning system from information that resides in Computer Aided Design (CAD) databases. This work will decrease the amount of time spent in the manual generation of knowledge bases for diagnostic reasoning systems, ft will also enable the …", "num_citations": "5\n", "authors": ["1253"]}
{"title": "Performance issues in Aircraft Access to the National Airspace SWIM program\n", "abstract": " The System Wide Information Management (SWIM) program is one of the critical components in the Federal Aviation Administration's (FAA) NextGen project. This investigates some of the challenges that arise during communication between the Electronic Flight Bag (EFB) and the Data Management System (DMS). The FAA has identified nine operational scenarios (OS) detailing information exchange within the context of the AAtS between the DMS and the aircraft. The FAA has also identified three technical scenarios (TS) for communication between an aircraft and the DMS for conveying the NAS information. This study is limited to the downlink (information from the aircraft to the DMS) portion of the EFB-DMS interaction. Additionally, we do not investigate NAS-DMS interaction. We implemented a replicated network infrastructure to mimic the functionality of the Aircraft Access to SWIM (AAtS) and the SWIM …", "num_citations": "4\n", "authors": ["1253"]}
{"title": "Application of Software Fault Tree Analysis to an Airport Ground Control System.\n", "abstract": " With the ever increasing role of software in our day-to-day life, and even more important the criticality of their role in safety and reliability of the applications, it is important to find techniques that helps with identifying and balancing risks. One such technique is Fault Tree Analysis, which has proven to be powerful in other domains such as systems and processes. This paper, describes the results of application of the fault tree analysis to software requirement specification for an airport ground control system. In addition, this paper proposes a set of guidelines on how to apply SFTA to software requirement specification.", "num_citations": "4\n", "authors": ["1253"]}
{"title": "Incorporating software quality assurance in computer science education: an experiment\n", "abstract": " This paper describes an experiment which involved students in the undergraduate computer science senior project capstone design course, and students in the graduate software testing course. Students entering the senior project class are graduating seniors who have completed all but maximum of two required CS classes. They have already completed a one-semester software engineering class, with major emphasis on software development life cycle and software processes. Students entering the software testing course have already completed graduate courses in software engineering, project management, requirement engineering, and they may have other courses in software design and architecture. Students in the undergraduate class worked as the development team while students in the graduate class worked as the software quality assurance team, both working on a single product. This paper …", "num_citations": "4\n", "authors": ["1253"]}
{"title": "An Overview of GRCSE: Graduate Reference Curriculum for Systems Engineering\n", "abstract": " With the ever increasing complexity of engineered systems, there is a need for educating and training additional systems engineers to meet future demand. Over the last three years, educators and professional systems engineers from around the world have been working on the development of a Graduate Reference Curriculum for Systems Engineering (GRCSE™), which is scheduled to be released by December 2012. This work has been supported by the US Department of Defense and many international organizations such as the IEEE Computer Society, IEEE Systems Council, INCOSE, and ACM.", "num_citations": "3\n", "authors": ["1253"]}
{"title": "Target Acquisition Cooperative Unmanned Vehicle System\n", "abstract": " The goal of the Target Acquisition Cooperative (TAC) Unmanned Vehicle System (UVS) is to provide a group of autonomous vehicles that can work cooperatively to identify and classify targets in a predefined target area. TAC outlines three classes of vehicle: Eagle, Strike, and Rover. The first class, TAC Eagle, would be an eight foot wingspan aircraft that can fly high above the target area to identify possible targets. The second class is the TAC Strike, which would have a five foot wingspan, and provide the capability of target identification. The third class is TAC Rover, which would drive to identified targets and collect close range data.", "num_citations": "3\n", "authors": ["1253"]}
{"title": "Validation of an automated system model generator\n", "abstract": " Modeling and simulation have always been highly useful techniques to use when designing, analyzing, or diagnosing an engineered system. Development of an appropriate model, in terms of accuracy, granularity, and complexity, has typically been the burden of the designer, analyst, or troubleshooter. It would naturally be advantageous if a model could be developed automatically, with the user supplying only some final minor refinements. The fact that most modern systems are designed in a computer-aided design (CAD) environment makes this a realistic prospect, because much of the data necessary for the model is already in electronic form. This article outlines a system called the automated knowledge generator (AKG), which embodies techniques that automatically create a model of an engineered system directly from its CAD representation, and describes the extensive testing process followed in order to …", "num_citations": "3\n", "authors": ["1253"]}
{"title": "Automated Extraction of Knowledge from Computer-Aided Design Databases\n", "abstract": " The development of expert systems and other knowledge-based systems is frequently slowed by the arduous task of knowledge acquisition. For a particular domain, the required knowledge can be extensive, and its extraction from the appropriate source can be astonishingly time consuming. For model-based diagnostic systems, one proposed partial solution to this knowledge acquisition bottleneck is automated knowledge extraction from computer-aided design (CAD) databases.To build a knowledge base (model) for a model-based diagnostic system, both system structure and component function need to be described. The automated knowledge generation (AKG) system extracts descriptive information about the components of a system as well as their interconnectivity data from CAD databases. Instead of simply performing a direct translation of the CAD data, the modules that compose the AKG system cooperatively correct any inconsistencies in the CAD representations and supply the function information. This information is not found in CAD but is vital for the effective modeling of the systems to be diagnosed and their individual components. The AKG goal is to automatically build a functional knowledge base for a model-based diagnostic system with minimal human intervention.", "num_citations": "3\n", "authors": ["1253"]}
{"title": "Automated knowledge generation in support of Shuttle ground operations\n", "abstract": " A system is described that performs automated knowledge generation (AKG) using structural databases to create semantic knowledge bases. The approach, borrowed from machine vision, uses relaxation labeling to propagate constraints through the system. A prototype system has been developed which accesses an Intergraph CAD database,'processes' the information contained therein, and generates a frame-based knowledge base usable by NASA's Knowledge-based Autonomous Test Engineer (KATE) diagnostic system. The authors present a summary of work to date and discuss some of the obstacles found by the research group during the development of the AKG system.<>", "num_citations": "3\n", "authors": ["1253"]}
{"title": "An integrated swarm intelligence simulation for resilient autonomous systems\n", "abstract": " Embry-Riddle Aeronautical University is working on an ongoing project, Resilient Autonomous Systems (RAS), supported by the Air Force Research Lab (AFRL). The objective of this project is to develop autonomous vehicle command and control (C2) technologies that demonstrate increased resilience in Anti-Access Area Denial (A2/AD) environments. Current automated solutions that offer little autonomous re-planning capability can be inflexible in handling dynamic scenarios in these environments. In this case, increased resiliency is defined as the ability of the system to better operate at or above an acceptable level of performance even in unfavorable environments, such as when encountering intelligent adversaries using Electronic Warfare (EW) and Integrated Air Defenses (IAD). The ERAU team has outlined a number of scenarios that set two teams, red and blue, against each other in a shared simulated …", "num_citations": "2\n", "authors": ["1253"]}
{"title": "Innovation and certification in aviation software\n", "abstract": " Software safety is of critical importance to the ongoing success of the aviation industry. The DO-178 standard is the de-facto standard for safe aviation software across different regulatory contexts. Regulatory usage of DO-178 has coincided with an excellent aviation safety record, and therefore is often considered a success. There is an open question on whether the DO-178 standard prohibits the ability to utilize recent innovative techniques and processes that are being used by the broader software industry. This question is increasingly relevant in a time when rising software complexity, long considered a challenge, is posing a serious threat to the continued success of the industry. Aviation software is particularly subject to this complexity, and is challenged by growing software size, increased importance, and other accidental complexity.", "num_citations": "2\n", "authors": ["1253"]}
{"title": "Aircraft access to system-wide information management infrastructure\n", "abstract": " Within the Federal Aviation Administration’s (FAA) NextGen project, System Wide Information Management (SWIM) program is the essential core in facilitating the collaborative access to the aviation information by various stakeholders. The Aircraft Access to SWIM (AAtS) initiative is an effort to connect the SWIM network to the aircraft to exchange the situational information between the aircraft and the National Airspace System (NAS). This paper summarizes the highlevel design and implementation of the AAtS infrastructure; namely the communication medium design, data management system, pilot peripheral, as well as the security of the data being exchanged and the performance of the entire system. The research work led to the design and implementation of a reliable data storing and exchange system between the Electronic Flight Bag (EFB)(pilot peripheral to the AAtS network) and the SWIM network architecture. Issues such as cyber-security, performance, availability, and quality of service in the AAtS are investigated and mitigation approaches toward more secure and efficient service provided to the aircraft and to NAS are discussed.", "num_citations": "2\n", "authors": ["1253"]}
{"title": "A life-cycle engineering case study\n", "abstract": " For engineering degree programs, one of the primary objectives is to teach engineering practice in a course-by-course academic structure. Although engineering programs typically have a yearlong senior level design project to provide engineering development experience, it is still a challenge to provide students with the full life-cycle experience and expose them to all of the various dimensions of engineering practice. This paper advocates the development and use of a full life-cycle case study to address such a challenge. A software engineering case study, developed by the authors, and used in various courses and workshops, illustrates the nature, structure and value of this approach. The case study learning objectives emphasize development of engineering practice and acquiring team, problem solving, and analysis skills. The paper also describes how this life-cycle case study can be used throughout a software engineering curriculum.", "num_citations": "2\n", "authors": ["1253"]}
{"title": "Introducing case study based teaching in computing curricula: pre-conference workshop\n", "abstract": " The use of case studies is an effective method for introducing real-world professional practices into the classroom. Case studies have become a proven and pervasive method of teaching about professional practice in such fields as business, law, and medicine. The term “case study” is used in a variety of ways. In its most naive form, it simply refers to a realistic example used to illustrate a concept or technique. Although the use of case studies in education has shown success in the above mentioned disciplines, it is yet to be adopted in any significant way in the computer science education. One of the reasons for the lack of use of the case-study approach is the lack of sufficient material for this purpose. The main aim of the workshop is fourfold. First, the participants will be introduced to a comprehensive set of case study (the DigitalHomecase study) that can be used throughout a computing curriculum, emphasizing full software development life cycle. Second, the workshop will include an interactive discussion of how to use the case study artifacts and the associated teaching support materials to complement their teaching artifacts throughout their computing curriculum. Third, the attendees will be asked to participate in the assessment of case study material and make recommendations for improving both the material and the delivery. Fourth, we intend to follow up with the attendees who are interested to participate in our project, by incorporating some of the case study material as part of their course work during the fall 2011 semester.", "num_citations": "2\n", "authors": ["1253"]}
{"title": "A p-3 deployable unmanned aircraft for scientific measurement of tropical cyclones\n", "abstract": " Tropical cyclones are destructive forces of nature that threaten people, properties, infrastructures, communities, and economies. While scientists have developed many models to predict the paths and intensifications of these storms, there are still a tremendous number of unknowns. In order to enhance these models, it is necessary to develop new data collection techniques to fill the knowledge gaps. The current state-of-the-art utilizes several in-situ sensing techniques including airborne data collection via aircraft and expendable GPS dropsondes1in addition to surface-based sensing via ocean buoys. Unmanned aircraft systems (UAS) provide a new and powerful means for collecting additional in-situ data from tropical cyclones. These unmanned aircraft (UA) can be used to collect data from much lower altitudes than is feasible or safe for manned operations. Past missions conducted by the National Oceanic and …", "num_citations": "2\n", "authors": ["1253"]}
{"title": "An assessment strategy for a capstone course in software and computer engineering\n", "abstract": " NOTE: The first page of text has been automatically extracted and included below in lieu of an abstract", "num_citations": "2\n", "authors": ["1253"]}
{"title": "EcoEagles Hybrid Vehicle Control Architecture\n", "abstract": " The EcoCar Challenge provides 17 universities the opportunity to compete in the design and development of a new hybrid-vehicle based off of the 2009 Saturn Vue. At Embry-Riddle Aeronautical University, the vehicle’s initial architecture has been designed that provides the opportunity for the vehicle to operate in up to four different modes: electric only, series, parallel thru the road, and gas only. The control architecture is comprised of the various embedded controllers throughout the vehicle plus the addition of two new computer systems. The first is a safety critical supervisory controller responsible for configuring the vehicle into one of the hybrid modes. The second is the Intelligent Drive Efficiency Assistant (I.D.E.A), which is responsible for suggesting the best hybrid mode possible given the anticipated state of the vehicle. This paper will present the control architecture and the hardware/software-in-the-loop test …", "num_citations": "2\n", "authors": ["1253"]}
{"title": "Challenges/Issues In A Industry Academic Collaboration\n", "abstract": " NOTE: The first page of text has been automatically extracted and included below in lieu of an abstract", "num_citations": "2\n", "authors": ["1253"]}
{"title": "I/O, meet Scrum: Agile engineering processes for teams and change management\n", "abstract": " Study explores Scrum, a comprehensive team performance process based on Agile engineering principles, through an I/O lens. Study focuses on impact of Scrum implementation on team performance, organizational culture, and change management. Role of I/O in implementing engineering process improvement programs is discussed, as well as need for greater I/O involvement in engineering process management.", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Improving UAV Traffic Management using Fog Computing\n", "abstract": " The System-Wide Information Management (SWIM) is a program destined to manage every aspect of aviation traffic in the near future, but given the system's enormous amount of information, and the rise of Unmanned Aerial Vehicles (UAV), the system is bound to run into problems. The introduction of the Internet of Things (IoT) solutions, such as fog computing, could allow for a more secure and distributed management UAVs traffic management as part of the National Airspace, as well as to solve the System-Wide Information Management potential future shortcomings. This paper seeks to introduce an approach to integrate the concept of fog computing and the SWIM architecture in order to provide an improved and more reliable solution to airport traffic management in and around Tower and TRACON facilities, where there is a chance of intrusion by small Unmanned Aerial Vehicles.", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Highly Flexible Swarm Intelligence Algorithm for Resilient Autonomous Systems\n", "abstract": " This paper provides an update to our ongoing Resilient Autonomous Systems (RAS) project that is being conducted at Embry-Riddle Aeronautical University and is supported by the Air Force Research Lab (AFRL). The objective of the RAS project is to develop a distributed multi-layer autonomous UAS planning and control technology for gathering intelligence in Anti-Access Area Denial (A2/AD) environments populated by intelligent adaptive adversaries. These resilient autonomous systems are able to navigate through hostile environments while collecting intelligence and minimizing the loss of assets. Our approach incorporates artificial life concepts, with the high-level architecture divided into three biologically inspired meta-layers: cyber-physical, reactive, and deliberative. Each meta-layer is a combination of N layers, each representing simple behavior, and collectively having a dynamic level of influence over …", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Multi-layer model of swarm intelligence for resilient autonomous systems\n", "abstract": " Embry-Riddle Aeronautical University (ERAU) is working with the Air Force Research Lab (AFRL) to develop a distributed multi-layer autonomous UAS planning and control technology for gathering intelligence in Anti-Access Area Denial (A2/AD) environments populated by intelligent adaptive adversaries. These resilient autonomous systems are able to navigate through hostile environments while performing Intelligence, Surveillance, and Reconnaissance (ISR) tasks, and minimizing the loss of assets. Our approach incorporates artificial life concepts, with a high-level architecture divided into three biologically inspired layers: cyber-physical, reactive, and deliberative. Each layer has a dynamic level of influence over the behavior of the agent. Algorithms within the layers act on a filtered view of reality, abstracted in the layer immediately below. Each layer takes input from the layer below, provides output to the layer …", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Determining Degree of Alignment of Undergraduate Software Engineering Program with SWECOM\n", "abstract": " In the last couple of decades, the role of software in our society and day-to-day life has increased exponentially. This has resulted in a great workforce demand for people who have the appropriate knowledge and experience in software engineering. In 2014, IEEE Computer Society published the Software Engineering Competency Model (SWECOM). SWECOM describes competencies for software engineers who participate in the development and alteration of a software system. This competency model framework is based on a series of five life-cycle skill areas and eight cross cutting skill areas. Each skill area defined by different skills and each skill is defined by series of activities. Each activity can have up to five level of competencies (Follow, Assist, Perform, Lead and Create). In this paper, we provide an overview of the SWECOM. The overview mainly concentrates on the typical competencies that most …", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Software Industry Experience for High School Students\n", "abstract": " Funded by National Science Foundation (NSF), Inspire-CT is exploring vertically integrated students teams to improve student learning and raise student interest in computing. We are leveraging the excitement of computing capstone design courses and real-world projects to attract more students to computing. The target audience includes less advanced computing students, students in other majors, and pre-college students who might choose to study software engineering or computer science. To date, we have concentrated on activities targeting freshmen, sophomore, and junior students in computing fields, college students who are pursuing non computing degrees, and high school and middle school students. In the last phase of the project we exposed high school students to real-world projects, as they integrate with professional software developers at the NextGeneration Applied Research (NEAR) Laboratory (www. near. aero). Twenty five students from high schools across the Volusia and Seminole county (Florida) were selected to come to NEAR lab and interact with NEAR lab staffs and students through fall 2014 and spring 2015 semester. During this time, students were given an opportunity to work one-on-one with the NEAR lab personnel on specific projects. They were also given an opportunity to shadow them while they are working on one of the current projects that are being conducted at the lab. Some of these projects are funded by Federal Aviation Administrations (FAA), Boeing Corporations, New York Port Authority, National Oceanic and Atmospheric Administration (NOAA), etc. The twenty five students were selected among …", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Demonstration and evaluation of ADS-B technology for commercial space operations onboard reusable sub-orbital launch vehicles\n", "abstract": " To enhance the flexibility and responsiveness of commercial space operations, improved surveillance techniques are required to track the ascent and descent of a space vehicle through the national airspace system. In this paper, a prototype UAT Automatic Dependent Surveillance - Broadcast (or ADS-B) transmitter developed by Embry-Riddle Aeronautical University for research purposes is presented. The past flight history and design of this prototype is briefly discussed. Next, the experimental results of a flight onboard a commercial reusable launch vehicle (RLV) that functions similar to a sounding rocket is presented and analyzed. The paper concludes with a discussion of possible future work in adapting ADS-B to support commercial space operations for not just reusable launch vehicles, but other commercial space transportation vehicles as well.", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Developing an Air/Ground Robots for Disaster Response as a Project for a Senior Capstone Design Course\n", "abstract": " Robots for disaster response require a multi-disciplinary engineering approach in order to solve the constraints and requirements of operating within a disaster environment for one or multiple missions. At Embry-Riddle Aeronautical University, the senior capstone design course for the Department of Electrical, Computer, Software, and Systems Engineering brings together a multi-disciplinary team of students to solve complex engineering problems as part of their capstone senior design experience. During the 2009-2010 and 2011-2012 academic years, students were challenged to develop robotic systems for human-robot teaming for the task of post-disaster search-and-rescue. This paper discusses how disaster robotics was used to support project-based learning for these capstone design experience.", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Using the EcoCAR Challenge as a Non-Traditional Domain for Software and Computer Engineering Capstone Course\n", "abstract": " Using the EcoCAR Challenge as a Non-Traditional Domain for Software and Computer Engineering Capstone CourseAbstract: This paper presents a unique capstone opportunity in which seniors in computer engineering andsoftware engineering were given the opportunity to take an active role on a multidisciplinarycapstone projects. The EcoCAR Challenge is an international competition in which 17 universities compete toproduce the next generation of hybrid vehicles over a three year period from 2008-2011. Thiscompetition is the successor of a number of previous challenges hosted by the United StatesDepartment of Energy including Challenge X. While traditionally, teams competing in competitions such as EcoCAR are traditionallycomprised of mechanical engineering students and only a small handful of students from otherdomains. During the 2008-2009 academic year, as part of their computer and softwareengineering capstone project students majoring in computer engineering, software engineering, and human factors formed a new sub-team focused upon developing a new pre-emptive controlsystem for hybrid vehicles. The course’s final product was the initial prototype of the Intelligent Drive Efficiency Assistant (IDEA). This high-level control system is designed to observe the hybrid control system, thevehicle’s state, and the anticipated future state of the vehicle (based on GPS, terrain maps, etc.) and make recommendations regarding which hybrid configuration the vehicle should operate. Unlike traditional hybrid vehicle control systems, this system preemptively selects the “best” hybrid mode so that it is ready ahead of demand …", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Using Vertically Integrated Project Teams to Inspire Studnet Interest in Computing Careers\n", "abstract": " Using Vertically Integrated Project Teams to Inspire Student Interest in Computing Careers The precipitous decline in students majoring in computing degree programs has stopped, butno adequate recovery is in sight. The most recent numbers available show about 62,000 newcomputing graduates for a market estimated by the Department of Labor to require over 150,000 new entrants each year. Attracting students in the computing field has always been a major challenge. Factors suchas the geek image, a demanding mathematical foundation, the lack of a “gee wiz” element earlyin the curriculum, and the dot com bust are all contributors to this problem. However, attractingstudents is only a first step. Maintaining student interest is also difficult. This paper describes aNSF-funded project that is exploring vertically integrated teams as a way of inspiring studentinterest in computing. This project is focused on undergraduate computing education. The central tenet of theproject is that computing education will benefit by engaging students in hands-on, team-basedprojects much earlier in their education. The excitement of student teams working on capstonedesign projects is commonly observed. The goal of this project is to let much less experiencedstudents see and share in that excitement based on their skill levels. Advanced undergraduates working on capstone design projects are at the center of theproject. The capstone experience will be shared with less experienced students by teamingadvanced undergraduates with beginning undergraduates. This teaming will be designed tobenefit both the beginning and advanced students. The core focus …", "num_citations": "1\n", "authors": ["1253"]}
{"title": "DIGITAL HOME: A CASE STUDY APPROACH TO TEACHING IN COMPUTING CURRICULA\n", "abstract": " Case studies have been a subject of much study and research about their effectiveness in teaching and learning [1, 2, 3]. Although the use of case study teaching has become a proven and pervasive method of teaching about professional practice in such fields as business, law, and medicine, it is yet to be adopted in any significant way in the computing education. One of the reasons for the paucity in the use of the case-study approach is the lack of sufficient material for this purpose. For example, among the hundreds of case studies in science at the SUNY Buffalo web site [4] only three concern computer science or software engineering.Digital Home [11, 12] is a comprehensive case study that can be used throughout a computing curriculum. The case study material include complete software development artifacts as well as teaching case modules to be used to teach different topics (ie, software inspections, object oriented design and implementation…) throughout a computer science or software engineering curriculum. There are many software textbooks that use case studies (as examples to illustrate concepts and techniques):[5](several, including an Airline Reservation System and a Household Alarm System),[6](Fireworks Factory),[7](Picadilly Television and Ariane-5),[8](SafeHome). Additionally, there has been an increased effort in introducing case studies in computing courses as reported in the literature [9, 10]. Although these cases seem to serve a specific purpose (eg, discussing planning, requirements, design, risk analysis, or construction issues by using simple examples that are quasi-realistic), they often lack the following:", "num_citations": "1\n", "authors": ["1253"]}
{"title": "GSwE2009: A New Set of Guidelines for Graduate Software Engineering Education\n", "abstract": " A new set of curriculum guidelines for graduate software engineering education has recently been published. In this panel those guidelines and two supporting companion reports will be presented to faculty interested in creating new programs or improving existing programs. Faculty who attend the panel will learn how to use the recommended curriculum architecture to customize their programs to meet their needs.", "num_citations": "1\n", "authors": ["1253"]}
{"title": "How does Software Engineering fit into a College of Engineering?\n", "abstract": " NOTE: The first page of text has been automatically extracted and included below in lieu of an abstract", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Teaching software testing throughout the curriculum\n", "abstract": " Software testing is recognized in industry as being critical for large, complex projects, especially where safety factors are involved. However, student programming projects, especially in introductory courses, do not have the same sense of criticality since the only effect of their failure is for the student to receive a lower grade. Instilling good habits in novice programmers is important. Relegating software testing to an upper-level elective course or omitting it from the computer/information science curriculum does not lead to preparing effective software developers. The panelists will present approaches they use to include software testing throughout the curriculum.All of the panelists participated in an NSF sponsored Undergraduate Faculty Enhancement workshop led by John McGregor at Clemson University in the summer of 1998 and by Allen Parrish at the University of Alabama, Tuscaloosa in the summer of 1999 …", "num_citations": "1\n", "authors": ["1253"]}
{"title": "Multi-computer communication network with crossbar switches\n", "abstract": " This thesis describes the architecture and organization of a multi-computer communication network employing crossbar switches. The network is implemented using the Motorola EXORset development system. The network provides a flexible communication system capable of application to a wide range of data transfers. In this system each computer will perform its local tasks, in the meantime, each computer could send or receive messages to and from other computers in the network. The system logic has been partitioned into two basic board types:(a) communication interface, and (b) controller. The communication interface provides the interface of computers in the network to the controller and other computers. The controller is used as a traffic signal, which supervises the transmission of messages between computers.", "num_citations": "1\n", "authors": ["1253"]}