{"title": "A review on software requirements validation and consistency management\n", "abstract": " Requirements need to be validated at the early phase of the software development to avoid errors such as inconsistency, incompleteness and incorrectness. Drawn from this argument, a requirements validation process needs to consider Consistency, Completeness and Correctness (“3 Cs”) for the production of a quality software specifications. This paper provides a review of requirements validation and consistency management based on the existing literature in order to identify the gaps in the existing knowledge on the process of software requirements specifications. This paper begins with a review of the definitions of the 3Cs, upon which the understanding of the 3Cs is derived. Next comprehensive review of related works on the identified consistency management techniques: traceability and analysis approaches are then presented. This is supported with a heat map representations of the related research on the types of contributions, techniques, specifications and semantics used in consistency management. Since semi-formal specifications were found as the most common representation of the requirements, the types of models used as semi-formal specifications to represent the requirements were also discussed. Overall, this paper identifies the various gaps existing within the process of validating and managing the consistency of requirements to avoid re-inventing the wheels in the diverse and comprehensive knowledge of requirements engineering.", "num_citations": "31\n", "authors": ["1914"]}
{"title": "Automated software tool support for checking the inconsistency of requirements\n", "abstract": " Handling inconsistency in software requirements is a complicated task which has attracted the interest of many groups of researchers. Formal and semi-formal specifications often have inconsistencies in the depicted requirements that need to be managed and resolved. This is particularly challenging when refining informal to formalized requirements. We propose an automated tool with traceability and consistency checking techniques to support analysis of requirements and traceability between different representations: textual, visual, informal and formal.", "num_citations": "25\n", "authors": ["1914"]}
{"title": "A review on tool supports for security requirements engineering\n", "abstract": " Capturing the right security requirements is crucial when developing a security software. Poor elicited security requirements can lead to a failure in software development, thus it needs to be accurately defined. This study evaluates various security requirement engineering tools and analyses the existing gaps in security requirement engineering tools. Based on a literature search conducted manually, we report our findings from the review and analysis of different studies of security requirements engineering tool. Consequently, the gaps and motivations found from this literature study are discussed. Future directions of this study is to develop a more useful tool that can perform a better function in capturing security requirements are also discussed.", "num_citations": "13\n", "authors": ["1914"]}
{"title": "Architecture of mobile web application for generating dynamic route map\n", "abstract": " Integrated Light Rail Transit (LRT) System in the capital of Malaysia connects some key districts where historical places, interesting places, business areas and shopping malls are concentrated. The train services are running independently but have points where they have interchanges. This may leads the traveler facing difficulty when they are choosing incorrect destination station especially on different LRT lines which contribute to time consuming and high costing. Thus, we present an architecture in developing mobile application that runs on a Personal Digital Assistant (PDA) to provide the solution for traveler to reach the desired destination. It is use to dynamically generate dynamic route map by determining the nearest station according to the specific places. The architecture, web components and its implementation are proposed and discussed in this paper.", "num_citations": "13\n", "authors": ["1914"]}
{"title": "Customization of Requirements Modeling Tool For Software Engineering Education\n", "abstract": " Requirements modelling tools readily available in the market have been convenietly used as teaching and learning tools in the teaching of software engineering (SE) subjects. Students are expected to gain the skills of eliciting, analysing, specifying and validating requirements as they use the requirements modelling tools in class. However, these tools are mainly developed for industry purposes; hence they are not suitable for teaching and learning due to their high cost and complexity. This paper reports a study that develops an approach and supporting tool that customize the requirements modeling tool for SE learning purposes. The main objectives of this work are twofold: 1) to assist the learning process of the students to model the use diagram, and 2) to understand the syntax of the use case diagram. A requirements modeling tool, named CustomTool, which is customized for SE education has been developed, and it was tested for its effectiveness and usability using questionnaire survey. Based on the survey results, it can be concluded that users particularly students were satisfied and comfortable using the tool in the classroom.", "num_citations": "12\n", "authors": ["1914"]}
{"title": "Volunteer selection based on crowdsourcing approach\n", "abstract": " Voluntary work is important today’s world. There are various versions of the volunteer management system referenced in industry resources. Several organizations have developed volunteer management systems designed to incorporate spontaneous volunteers. However, it can be difficult to find and recruit suitable volunteers for volunteer organizations because the volunteers have many criteria to match with tasks. Also, we still have lacking information on the process of crowdsourcing in volunteering perspective. This paper, we conduct a review of volunteering management systems and crowdsourcing approach. Based on the insights derived from this analysis, we identify some issues for future research. To solve this problem, we designed a framework for the crowdsourcing approach in volunteering system to automate the process of selection volunteers and match with the criteria of volunteers and tasks …", "num_citations": "11\n", "authors": ["1914"]}
{"title": "Capturing security requirements using essential use cases (EUCs)\n", "abstract": " Capturing security requirements is a complex process, but it is crucial to the success of a secure software product. Hence, requirements engineers need to have security knowledge when eliciting and analyzing the security requirements from business requirements. However, the majority of requirements engineers lack such knowledge and skills, and they face difficulties to capture and understand many security terms and issues. This results in capturing inaccurate, inconsistent and incomplete security requirements that in turn may lead to insecure software systems. In this paper, we describe a new approach of capturing security requirements using an extended Essential Use Cases (EUCs) model. This approach enhances the process of capturing and analyzing security requirements to produce accurate and complete requirements. We have evaluated our prototype tool using usability testing and assessment …", "num_citations": "11\n", "authors": ["1914"]}
{"title": "Automatic acceptance test case generation from essential use cases\n", "abstract": " Requirements validation is a crucial process to determine whether client-stakeholders’ needs and expectations of a product are sufficiently correct and complete. Various requirements validation techniques have been used to evaluate the correctness and quality of requirements, but most of these techniques are tedious, expensive and time consuming. Accordingly, most project members are reluctant to invest their time and efforts in the requirements validation process. Moreover, automated tool supports that promote effective collaboration between the client-stakeholders and the engineers are still lacking. In this paper, we describe a novel approach that combines prototyping and test-based requirements techniques to improve the requirements validation process and promote better communication and collaboration between requirements engineers and clientstakeholders. To justify the potential of this prototype tool, we also present three types of evaluation conducted on the prototpye tool, which are the usability survey, 3-tool comparison analysis and expert reviews.", "num_citations": "10\n", "authors": ["1914"]}
{"title": "Automated acceptance testing tools evaluation in Agile software development\n", "abstract": " Acceptance test is a crucial procedure in software development for the development of the right requirements that meets the needs and expectations of the stakeholders and users. Due to the problems faced when conducting this test manually, several automated acceptance tools have been developed. This paper presents a comparison analysis of selected automated acceptance tools from the existing literature and experienced reports, highlighting their requirements representation, programming language, end-user inclusion, usability and output representation. It is found that these tools are still at their infancy stage and there are still more rooms for improvements. This paper serves as a preliminary work for future works to develop better requirements validation tools that facilitate the acceptance testing process, as well as promote collaboration and communication between client-stakeholders and the development team.", "num_citations": "10\n", "authors": ["1914"]}
{"title": "Malaysian palm oil-moving ahead to sustainable production growth\n", "abstract": " Malaysian palm oil production has surged in recent decades and the palm oil industry has been transformed to become Malaysia’s key socioeconomic driver. Plans are underway to ensure palm oil continues to be a major growth engine and its production remains sustainable in the future. While undergoing the process of transformation, the industry faces such major issues as labour and land availability that can hinder the sustainability of production growth. This article highlights the continuous efforts made to sustain production growth in Malaysia in the future, focusing on increasing land productivity, replanting, promoting mechanisation and upgrading labour skills. In addition, the article also forecasts long-term palm oil production until 2020, the year targeted for the transformation of Malaysia into a high income economy.", "num_citations": "9\n", "authors": ["1914"]}
{"title": "A security requirements library for the development of Internet of Things (IoT) applications\n", "abstract": " In today’s era, there is a rapid increase in the demand for IoT applications. Thus, securing the information content delivered among various entities involved in the IoT applications development has become an important issue. It is also identified that there is a high cost of implementing a secured IoT application as it requires efforts, skills and knowledge to understand the security concern, especially when developers and requirement engineers do not have any formal training in software engineering and eliciting security requirements. In addition, requirements engineers who are unfamiliar with the IoT applications confront problems to elicit accurate security requirements to avoid misinterpretations. Motivated by these issues, this paper presents the development of a new IoT security requirements library of security requirement for the development of IoT applications. Using an industry scenario, the utilities of …", "num_citations": "8\n", "authors": ["1914"]}
{"title": "Trust Requirements Model for Developing Acceptable Autonomous Car\n", "abstract": " There has been an increase interest among automakers to develop autonomous cars. However, the level of acceptance of the autonomous cars among users is limited. Considering that trust is one of the main determinants for users to accept the autonomous cars. Considering that user’s needs and expectation are highly important when developing the autonomous car, a trust requirements model that consists of attributes and related properties based on the perspectives of the users has been developed. The model was also developed based on the proposition that automakers need to consider trust requirements at the early stage of developing the autonomous car. Drawn from a systematic analysis of the literature review, seven attributes, namely safety, security, privacy, performance, user’s experience, reliability and economic value together with their related properties were identified. It was also found that there is a one-to-many relationship between the attribute and its properties. This model, named as trust requirements autonomous car (TReAC) model can be used as guideline for automakers to develop acceptable autonomous cars. It is anticipated that this model can be adaptable to other domain. Future work should be dedicated to validating and testing this model.", "num_citations": "7\n", "authors": ["1914"]}
{"title": "Meeting real challenges in eliciting security attributes for mobile application development\n", "abstract": " There has been a rapid growth in the development of mobile application resulting from its wide usage for online transaction, data storage and exchange of information. However, an important issue that has been overlooked is the lack of emphasis on the security issues at the early stage of the development. In fact, security issues have been kept until the later stage of the implementation of mobile apps. Requirements engineers frequently ignore and incorrectly elicit security related requirements at the early stage of mobile application development. This scenario has led to the failure of developing secure and safe mobile application based on the needs of the users. As such, this paper intends to provide further understanding of the real challenges in extracting security attributes for mobile application faced by novice requirements engineers. For this purpose, two experiments on eliciting security attributes requirements of textual requirements scenario were conducted. The performance related to the correctness and time taken to elicit the security attributes were measured and recorded. It was found that the process of eliciting correct security attributes for mobile application requires effort, knowledge and skills. The findings indicate that an automated tool for correct elicitation security attributes requirement could help to overcome the challenges in eliciting security attributes requirements, especially among novice requirements engineers.", "num_citations": "7\n", "authors": ["1914"]}
{"title": "Destination-Oriented Route in Integrated LRT Web-Based System for Tourism\n", "abstract": " Light Rail Transit (LRT) Monorail and RapidKL are one of the major public transportations in Kuala Lumpur (KL), Malaysia and by traveling in LRT is said to be the most convenient public transport. In LRT RapidKL, there are three train-lines; Kelana Jaya Line, Ampang Line and Sri Petaling Line. This paper addresses the problem of selecting nearest destination station to a given places of interest such as shopping places, historical places and interesting places which may involve at least two LRT lines and need of interchange station. Thus, the traveler may face difficulty when they choosing incorrect station especially on different LRT lines which lead to time consuming and high cost. Producing web-based system for Internet applications in tourism has become wide spread and within this paper, the development of web-based application where destination-oriented routes need to be dynamically generated by determining the nearest station according to the specified places. In addition, this system provides detail information on interchange station (if any), estimated time arrive, total fares and operating hours.", "num_citations": "7\n", "authors": ["1914"]}
{"title": "Interacting through disclosing: Peer interaction patterns based on self-disclosure levels via Facebook\n", "abstract": " Peer interaction in an online environment has close connections with self-disclosure. Hence, this study was conducted to explore peer interaction patterns and self-disclosure levels via a social networking tool, specifically, Facebook. Twenty-two postgraduate students who enrolled for the Authoring System course participated in the study. Data were gathered from the online discussion transcripts in Facebook. The online discussion transcripts were coded and analysed based on (a) coding scheme for identifying patterns of peer interaction, and (b) a self-disclosure rating scale for categorizing the levels of self-disclosure. Findings showed that the students had mostly used response and position types of peer interaction. Meanwhile, most of the students were self-disclosing through Information-Level 1 followed by Feeling-Level 1, and Thought-Level 1. Furthermore, peer interaction patterns were found to have a strong significant and positive correlation with self-disclosure levels. In conclusion, this study revealed that high self-disclosure by students affects positively peer interaction in Facebook discussions. The implications of these results are considered, and possible future studies are suggested.", "num_citations": "6\n", "authors": ["1914"]}
{"title": "A Dijkstra’s mobile web application engine for generating integrated light rail transit route\n", "abstract": " In the capital city of Malaysia, Integrated Light Rail Transit (LRT) System is one of the most importance public transportation as it connects some key districts to historical, interesting places, business areas and shopping malls are concentrated. The train services are running independently but have interchanges to integrate from one different LRT lines to the others. These interchanges could cause traveler a troublesome when they are choosing incorrect destination station especially on different LRT lines which contribute to time consuming and high costing. In previous research we are implemented the mobile web application using rules based algorithm where the destinationoriented routes need to be dynamically generated by determining the nearest station according to the specific places. Currently, our research is focusing on Dijkstra’s algorithms to provide more effective and intelligent shortest path system to provide the solution for traveler to reach the desired destination. In this paper, we discuss the results from our Dijkstra’s application prototype.", "num_citations": "6\n", "authors": ["1914"]}
{"title": "Reinforcing the concept of calculating isotope pattern using theoretical isotope generator (TIG)\n", "abstract": " This paper describes how the isotope patterns are calculated for chemists, students, lecturers and researchers using Theoretical Isotope Generator (TIG) integrated from the .NET framework (specifically VB .NET) with the data from the dual databases (Microsoft Access and Microsoft SQL 2000). Accordingly, TIG in terms of its functionality and features is an application developed to gain related information on molecules and their relative intensity for educational purposes (chemists, students, lecturers and researchers). Although various mass spectrometer applications are available as web-based and windows-based systems, the projected software is indeed practical, beneficial and constructive for the academic learners as well for the intellectual researchers for rapidly defining the numbers of the possibility isotope patterns obtainable from a substance (chemical compound) for example methane (CH2). Therefore, TIG with the mathematical application called Cartesian Products is used to obtain the isotope patterns of any atom or molecules. TIG provides extra features than others that are proficient to retrieve the information of the mass (atomic/molecular weight) from the substance specified based from the isotope patterns available. Additionally, TIG is completely with several functionalities such as drawing, normalizing and zooming the generated graph that convey with the molecular information in a number of formats by providing the details of the calculation and molecules.", "num_citations": "6\n", "authors": ["1914"]}
{"title": "INTERNET OF THINGS: ISSUES AND CHALLENGES.\n", "abstract": " Substantial research attention has been paid to the Internet of Things (hereafter abbreviated to IoT) since the dawn of the new millennium. IoT is very much perceived as being a major component of the Internet of the future. The composition of the Internet of the future will be billions of intelligent things that communicate through a variety of connected devices and it will become a means of enabling the realization of new capabilities of the'things' that are connected. This paper presents a review of the related research relating to IoT. Further, issues associated with IoT particularly standardisation, security and privacy are also discussed. The discussion provides valuable information for future research in IoT.", "num_citations": "5\n", "authors": ["1914"]}
{"title": "New Trends in Software Methodologies, Tools and Techniques: Proceedings of the Thirteenth SoMeT_14\n", "abstract": " Software is the essential enabling means for science and the new economy. It helps us to create a more reliable, flexible and robust society. But software often falls short of our expectations. Current methodologies, tools, and techniques remain expensive and are not yet sufficiently reliable, while many promising approaches have proved to be no more than case-by-case oriented methods. This book contains extensively reviewed papers from the thirteenth International Conference on New Trends in software Methodology, Tools and Techniques (SoMeT_14), held in Langkawi, Malaysia, in September 2014. The conference provides an opportunity for scholars from the international research community to discuss and share research experiences of new software methodologies and techniques, and the contributions presented here address issues ranging from research practices and techniques and methodologies to proposing and reporting solutions for global world business. The emphasis has been on human-centric software methodologies, end-user development techniques and emotional reasoning, for an optimally harmonized performance between the design tool and the user. Topics covered include the handling of cognitive issues in software development to adapt it to the user's mental state and intelligent software design in software utilizing new aspects on conceptual ontology and semantics reflected on knowledge base system models. This book provides an opportunity for the software science community to show where we are today and where the future may take us.", "num_citations": "5\n", "authors": ["1914"]}
{"title": "TestMEReq: automated acceptance testing tool for requirements validation\n", "abstract": " Acceptance tests are used to identify that the software to be developed will meet the customer’s needs and interests. Previously we have conducted a preliminary study, which discovered the usefulness of acceptance testing and automated toolkits as requirements validation approach. In this demonstration, we present our automated acceptance testing tool called TestMEReq, which generates abstract test cases and executable UIs to facilitate the requirements validation process.", "num_citations": "5\n", "authors": ["1914"]}
{"title": "Theoretical Isotope Generator: An Alternative towards Isotope Pattern Calculator\n", "abstract": " A number of mass spectrometry applications are already available as web-based and windows-based systems to calculate isotope pattern and to display the mass spectrum based on the specific molecular formula besides providing necessary information. These applications were evaluated and compared with our new alternative application called Theoretical Isotope Generator (TIG) in terms of its functionality and features provided to prove this new application is working better and performing well. TIG provides extra features than others, complete with several functionality such as drawing, normalizing and zooming the generated graph that convey with the molecular information in a number of formats by providing the details of the calculation and molecules. Thus, any chemist, students, lecturers and researchers from anywhere could use TIG to gain related information on molecules and their relative intensity.", "num_citations": "5\n", "authors": ["1914"]}
{"title": "A REVIEW ON REQUIREMENTS VALIDATION FOR SOFTWARE DEVELOPMENT.\n", "abstract": " Requirement validation is an important phase in software development project in order to certify that the captured requirements are the exact representations of the users' needs and expectations. This phase helps to identify and avoid requirements errors from propagating to the later stage. In this paper, we performed a literature review that investigated the trend in software requirements validation approach studied in a decade from the year of 2007 until 2016. Here, we investigated the types of contributions, modes of approaches, requirements types and the techniques that were commonly used and proposed for requirements validation. In this study, we found that many studies contributed new methodology/approach for validating the functional requirements using semi-formalise method. The Unified Modelling Language (UML) models were the most favourite models for this purpose. Furthermore, we found that …", "num_citations": "4\n", "authors": ["1914"]}
{"title": "Verification on the Trustworthiness of Information: A Study\n", "abstract": " The pervasive use of social media has generated massive information sharing among its users. Given the fluidity and excessive information available online, issues relating to the trustworthiness of information have become a concern among the users and authorities. Sensational and unreliable information shared in the social media may cause and harm the reputation of an individual, product, organisation or government. Therefore, there is a need to develop a mechanism that helps users to verify the trustworthiness of information that feed in the social media so that they can decide whether to trust or to ignore the information. This paper reports a review on the analysis of the existing work related to trustworthiness of information. The analysis were based on three questions that address the definition of trustworthiness of information, factors influencing trustworthiness of information and existing tools to verify …", "num_citations": "4\n", "authors": ["1914"]}
{"title": "Pair analysis of requirements in software engineering education\n", "abstract": " Requirements Analysis and Design is found to be one of the crucial subjects in Software Engineering education. Students need to have deeper understanding before they could start to analyse and design the requirements, either using models or textual descriptions. However, the outcomes of their analysis are always vague and error-prone. We assume that this issue can be handled if “pair analysis” is conducted where all students are assigned with partners following the concept of pair-programming. To prove this, we have conducted a small preliminary evaluation to compare the outcomes of solo work and “pair analysis” work for three different groups of students. The performance, efficacy and students' satisfaction and confidence level are evaluated.", "num_citations": "4\n", "authors": ["1914"]}
{"title": "Automated support for consistency management and validation of requirements\n", "abstract": " The requirements engineering phase of software development remains presents many challenges to researchers and practitioners alike. Among them, the management of consistency across multiple representations is particularly complex yet it lacks effective tool support. The thesis proposes an automated support mechanism to enable users (Requirements Engineers) to manage the consistency and validation of requirements. We have investigated existing approaches, developed a novel technique, and realised this technique as an automated support tool called MaramaAI (Automated Inconsistency Checker). We have taken an iterative approach to our work. We began by developing a lightweight extraction approach that allows an accurate and quick extraction of essential requirements (abstract interactions) from natural language requirements and the generation of Essential Use Case models from them. We then used automated traceability with visual support to check the consistency of requirements in three different forms: textual natural language requirements, abstract interaction and Essential Use Case, as well as to further validate the correctness and completeness of requirements. We also extended the automated tool to provide end-to-end rapid prototyping support embedded in the tool for validating requirements consistency in a form usable by both requirement engineers and clients to confirm the consistency of requirements. We have evaluated the tool's efficacy and performance especially on the extraction process, and also evaluated the user perception on the tool's usability and user-perceived strengths via a substantial usability …", "num_citations": "4\n", "authors": ["1914"]}
{"title": "SECURITY REQUIREMENTS AND TECHNOLOGIES FOR THE INTERNET OF THINGS (IOT) APPLICATIONS: A SYSTEMATIC LITERATURE REVIEW.\n", "abstract": " Security requirement is one of the most important intangible requirements which could be taken as a burden on the smooth functioning of the system or application. Requirements engineers without expertise in security are at risk of overlooking security requirement, which frequently leads to the act of misuse. This study plans to identify the security requirements and technologies being used in IoT applications. We conducted a systematic literature review in order to identify and analyse related literature on elicitation of security requirements for IoT applications. We found that the most used technologies for IoT applications are sensors, mobility networks, RFID systems, WiFi, Bluetooth and Zigbee and the security requirements that are relevant for IoT applications are authentication, confidentiality, integrity, authorization, access control and availability. Finally, the characteristics and properties of the security requirements …", "num_citations": "3\n", "authors": ["1914"]}
{"title": "ELICITING SECURITY REQUIRMENTS FOR MOBILE APPS: A REPLICATION STUDY.\n", "abstract": " Mobile applications (mobile apps) are becoming a common medium for conducting transaction, saving data and exchanging information online. However, an important issue that has been overlooked is the emphasis on security issues at the early stage of mobile apps development. It has become a common practice among requirements engineers to deal with security issues after the mobile apps have been developed. This scenario has led to the failure of developing secure and safe mobile application based on the needs of the users. Motivated by this problem, we propose an automated support tool to assist requirements engineers to elicit security related requirements at the early stage of mobile apps development. This paper reported a replication of a study from our previous work that describes our user study and tool support, called MobiMEReq. This tool uses SecEUCs and SecEUIs prototype model to …", "num_citations": "3\n", "authors": ["1914"]}
{"title": "FACTORS INFLUENCING INTERNET ADDICTION AMONG UNIVERSITY STUDENTS: A REVIEW.\n", "abstract": " The widespread usage of Internet worldwide has resulted in a tremendous change in people’s lifestyle, particularly the young generation, which is recognized as the digital natives. However, there is an increased concern in the use of Internet among university students as they can become addicted to Internet due to its excessive usage. In this respect, it is vital to investigate the pattern of Internet usage of the users as the ways in which they use Internet may result in the Internet addiction. Considering that Internet addiction can disrupt the productivity of a nation, extensive studies of Internet addiction have been conducted, and most of these studies were conducted in countries that have advanced technology of Internet. This paper presents a review of the existing studies of the factors contributing to Internet addiction among university students. Based on the review, these factors can be categorized into four factors, namely, the psychological factors, demographic factors, socioeconomic factors and usage pattern. Drawn from this review, a conceptual framework consisting of eight factors influencing Internet addiction has been formulated. This conceptual framework serves as a research design to investigate the factors that influence Internet addiction among university students", "num_citations": "3\n", "authors": ["1914"]}
{"title": "A Review On Agile Decision Making In Crisis Management\n", "abstract": " Agility in decision making has a potential to resolve crisis management; therefore a specific agile decision making technique should be implemented in crisis management. Crisis management requires the agility in decision making in order to resolve the crisis. The decision made has to be flexible enough so that the solution can be delivered on time. In having the decision, there are people that will contribute some suggestion, opinion, experience or knowledge. The virtual knowledge sharing is the vital part on delivering the agile decision making. This paper reviews such methods on agile decision making towards crisis management and the relation with virtual knowledge sharing.", "num_citations": "3\n", "authors": ["1914"]}
{"title": "The Use of Essential Use Cases (EUCs) to enhance the Process of Capturing Security Requirements for Accurate Secure Software\n", "abstract": " Complexity in security requirements requires requirements engineers to have a security experience and knowledge in the process of eliciting and analyzing requirements. Further, capturing correct security requirements at the early phase can contribute to the development of secure software. However, requirement engineers lacking sufficient experience in security are facing the risk of over-looking security requirement which might lead to inaccurate, inconsistent and incomplete requirements when capturing the security requirements. This situation may influence the quality of security requirements. In this paper, we describe the overview of our research plan towards developing our new approach that uses essential use cases (EUCs) model to enhance to process of capturing security requirements for accurate secure software.", "num_citations": "3\n", "authors": ["1914"]}
{"title": "A Mobile web application architecture for generating destination-oriented LRT Route\n", "abstract": " Integrated Light Rail Transit (LRT) System in the capital of Malaysia connects some key districts where historical places, interesting places, business areas and shopping malls are concentrated. The train services are running independently but have points where they have interchanges. This may leads the traveler facing difficulty when they are choosing incorrect destination station especially on different LRT lines which contribute to time consuming and high costing. Thus, Dynamic Route Map (DRM) is proposed where the destination-oriented routes need to be dynamically generated by determining the nearest station according to the specific places. In this paper, we present an architecture in developing mobile application that runs on a Personal Digital Assistant (PDA) to provide the solution for traveler to reach the desired destination.", "num_citations": "3\n", "authors": ["1914"]}
{"title": "A Preliminary Study: Challenges in Capturing Security Requirements and Consistency Checking by Requirement Engineers\n", "abstract": " There has been a growing concern on the importance of security with the rise of phenomena, such as ecommerce and nomadic and geographically distributed work. Realizing the security early, especially in the requirement analysis phase, is important so that security problems can be tackled early enough before going further in the development process and avoid re-work. Ensuring the consistency of elicited functional security requirement of requirements specification is also crucial as the requirements should be well understood and agreed upon by all the stakeholders and end-users. Therefore, the aim of this paper is to further discuss on the challenges faced by Requirement Engineers (REs) in:(1) capturing Security Requirement and (2) Consistency Checking in Requirement Engineering. Motivated from the need to ensure consistency in functional security requirement for developing secure software and the gaps found in the existing works, a survey has been conducted involving 38 experts in software engineering in the industry. The survey aims to identify the current problems faced by them during the elicitation process, security standards used as the reference, elicitation and validation method, and the important properties considered while developing secure software. Results of the survey show that REs face difficulties to understand the security needs and the existing standards are difficult to understand. Therefore, it is proposed that an automated tool to elicit security requirements should be developed.", "num_citations": "2\n", "authors": ["1914"]}
{"title": "Requirements Engineering for Internet of Things: 4th Asia-Pacific Symposium, APRES 2017, Melaka, Malaysia, November 9–10, 2017, Proceedings\n", "abstract": " This book constitutes the proceedings of the 4th Asia Pacific Requirements Engineering Symposium, APRES 2017, held in Melaka, Malaysia, in November 2017. The 11 full papers presented together with four short papers were carefully reviewed and selected from 45 submissions. The papers are organized in topical sections on big data, cyber security, crowd-sourcing, requirements challenges, automation.", "num_citations": "2\n", "authors": ["1914"]}
{"title": "A Template for Writing Security Requirements\n", "abstract": " Quality security requirements contribute to the success of secure software development. However, the process of eliciting and writing security requirements is tedious and complex, It requires Requirements Engineers (RE) to have security experience in the process of eliciting consistent security requirements from the clients-stakeholders. Considering the requirements are derived from natural language, RE faced problems in eliciting and writing security requirements as they have the tendency to misunderstand the real needs and the security terms used. Motivated from these problems, this paper proposed a security requirements library and template to assist RE in writing security requirements. The library was built based on compilation of security attributes derived from syntax analysis and keywords matching. The realization of the library and writing template was demonstrated using two sets of scenario …", "num_citations": "2\n", "authors": ["1914"]}
{"title": "Capturing security requirements of mobile apps using MobiMEReq\n", "abstract": " Mobile devices have been widely used around the world as it facilitates interaction between people and services at anywhere and anytime. Mobile applications are found to be used for conducting online transactions, saving data and exchanging information. However, issues related to security have become a major concern among mobile users as insecure applications may lead to security vulnerabilities that make them to be easily compromised by hackers. Further, mobile applications that lack of security concerns also could exposed the mobile devices and users to malwares that could cause failure and malfunction to the application. Thus, it is important for mobile apps developers to capture security requirements of mobile apps at the earliest stage to prevent security problems during the implementation of mobile application. In this paper, we describe our automated approach and tool support, called MobiMEReq that helps to automatically capture the security attributes requirements of mobile apps. We represent our extraction using Essential Use Cases (EUCs) and Essential User Interface (EUI) prototype models. We also compared our tool with the manual approach to evaluate the performance and correctness of our tool in various application domains. The results of the study show that our tool is able to help requirements engineers to easily capture security-related requirements of mobile apps.", "num_citations": "2\n", "authors": ["1914"]}
{"title": "A Review of Software Cost Estimation: Tools, Methods, and Techniques\n", "abstract": " Project Management (SPM) is one of the important aspect that need to be concerned. It is because high-quality of SPM might leads the project to quality product. However, misconducting SPM might be cause a project failure. One of the most important part in SPM is cost and effort estimation. During the project planning in SPM, an accurate Software Cost Estimation (SCE) is becoming critical for both developers and customers to making the decision. However, conducting SCE is not an easy task. There are several aspect needs to be concern that might influence the cost estimation. In this paper, a systematic review regarding to SCE is conducted. In addition, an analysis and discussion regarding to SCE tools, methods and techniques will be also provided. In this paper, SCE methods are divided into three categories which are algorithmic method, non-algorithmic method, and hybrid method.", "num_citations": "2\n", "authors": ["1914"]}
{"title": "Security requirements validation for mobile apps: a systematic literature review\n", "abstract": " Security requirements are important to increase the confidence of mobile users to perform many online transactions, such as banking, booking and payment via mobile devices. Â Objective: This study aims to identify the attributes of security requirements for mobile applications (mobile apps) and the existing tools, techniques and approaches used in security requirements. The gaps and limitations for each approach are also discussed. Method: We conducted a systematic literature review to identify and analyse related literatures on validation of security requirements for mobile apps. We identified 68 studies that provide relevant information on security requirements for mobile apps. Result: Â There were two main findings:(1) the attributes of security requirements that are relevant for mobile apps are authentication, confidentiality, authorization, access controlÂ Â and integrity;(2) Mobile security testing methods for validating security requirements of mobile apps were also identified. Finally, the gaps and limitation of each approach requirements in relation to mobile apps were also discussed. Conclusions: The main challenge of security requirements is to identify the most appropriate security attributes and security testing technique to validate security requirements for mobile apps. As such, requirements engineers should consider the challenges posed by security requirements such as testing when validating and developing security requirements for mobile apps testing technique. Further, correct security requirements for security attributes of security requirements need to be considered at the early stage of development of the mobile apps …", "num_citations": "2\n", "authors": ["1914"]}
{"title": "A fuzzy-based buffer split algorithm for buffer attack detection in internet of things\n", "abstract": " Internet of Things (IoT) process technology is a rapidly emerging technology with great benefits for the pool of individuals, homes, companies and other institutions in general. This technology is used to connect everyday devices to the network to enable additional features such as remote control and access to data, But the network is exposed to several attacks, the most important attacks that cause the problem of overload is event-based attack, Smart stretched attack on the buffer one of the most important attacks on the network, in this research we propose a new algorithm called a Fuzzy Buffer Split (FBS) to defend against these two types of buffer attacks.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "SECURITY REQUIREMENTS ELICITATION AND CONSISTENCY VALIDATION: A SYSTEMATIC\n", "abstract": " Security requirements are important in developing secure software development. Objectives: This study plans to identify properties of security requirements for developing secure software as well as to analyse the existing works for requirements validation. The gaps and limitations of each approach was discussed in this study. Method: A systematic literature review is conducted to identify and analyse related literature on elicitation of security requirements for developing secure software. Findings: There are four results:(1) the security properties highly considered for developing secure software are “Confidentiality”,“Integrity”“Identification & Authentication”, and “Availability”;(2) the approaches in validating security requirements are controlled user experiments, tools and manual checklist;(3) the security references used are the NIST, the Common Criteria and the ISO/IEC; and (4) security requirements template and consistency checking. Finally, the gaps and limitations of the existing works were also discussed. Conclusion: The primary challenge of security requirements during elicitation is to write the correct security requirements and validating the consistency of security requirements. As such, requirements engineers should consider the challenges posed by security requirements in eliciting and validating security requirements.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Trust requirements in e-health system: a conceptual framework\n", "abstract": " Resulting from the development of new technology, conventional scientific practices have migrated into computer-based infrastructures, called e-science. Specifically, escience applied in health discipline is called e-health. It is an organized system that deals to diagnose and treat patients. Considering trust is an important role and fundamental for the provision of effective healthcare service, this paper discusses trust requirement in e-health. To highlight the importance of trust in e-health system, a conceptual framework of trust requirements in e-health system is developed. Drawn from literature search framed by STARLITE, a conceptual framework that addresses trust resulting from relationships of various actors based on two perspectives: sociotechnical and technical perspectives are presented. This framework suggests that e-health system must build a trust relationship between actors and understand trust based on sociotechnical and technical perspectives. Further, security and privacy that protect the confidentiality of patient’s data, especially m-health (mobile health) also need trust in resource sharing. It can be concluded that trust requirements in e-health depend on how the media transmits a social experience, patient-system relationship, and collaboration of software engineering and healthcare professionals. The implementation of trust requirements has the potential to produce well-engineered software in a healthcare organization, resulting in the use of software for effective diagnosis and treatment of patients.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "A New Consistency Validation Approach to Enhance the Quality of Functional Security Requirements for Secure Software\n", "abstract": " Quality security requirements contribute to the success of secure software development. However, the process of eliciting security requirements is tedious and complex. It also requires requirements engineers to have security experience in the process of eliciting consistent security requirements from the clients-stakeholders. Most of the requirements engineers faced problems in eliciting consistent security compliance requirements from the clients-stakeholders as they misunderstood the real needs and the security term used. Thus, this resulted to inconsistent security requirements being elicited. The inconsistency leads to incorrect and insecure software systems being developed as well as to disruptions of schedule and increase of a project's expenditure. Motivated by these problems, this study is aimed to propose a new approach for consistency validation of functional security requirements. Here, security requirements specifications will be collected from software vendors to analyse the flow of functional security requirements process. Next, visual differencing will be integrated to cross-validate the consistency of the elicited functional security requirements with the best-practise template. Here, security requirements best-practice template pattern library will be designed and a new mathematical formulation that defines the consistency validation rules of security requirements will also be constructed. The formulation will be based on the security-related semi-formalised model, called SecEssential Use Case (SecEUC). This approach will then be realised with a proof of concept prototype tool and will be compared with the existing approaches …", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Requirements defects techniques in requirements analysis: A Review\n", "abstract": " Defects existing in the systems due to poorly identified requirements defects are viewed as the major factors leading to system failure, especially if the requirements defects are not identified or addressed until at the later stage of software development life cycle. In response to this, several attempts have been made to identify defects during the requirements analysis process. This paper presents a review of the various techniques to handle requirements defects in the requirements analysis activity. These techniques are categorised into four categories, namely reading, inspection, analysis and automated tool. It was found that these techniques have different focus and lack of emphasis on the needs of the industry. This study provides the basis for future research aiming at developing an approach to automate the process of requirements defects handling.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Determination of trust requirements attributes for developing acceptable autonomous car\n", "abstract": " Automation technology has gained a special interest in the revolution of Industry 4.0, where it helps to minimize human intervention to perform a complex task such as driving a vehicle. This has resulted to the needs of trust concern among users especially when it related to driving an autonomous car. Hence, this leads to low acceptability and marketability among users on this car. Therefore, considering trust requirements from the early development of car is crucial. To do this, determination of trust requirements attributes needs to be done in order to define correct trust requirements is produced. In this paper, we discussed our findings of preliminary study conducted to analyse the attributes of trust requirements for developing acceptable autonomous car based on the perspectives of the users in Malaysia. This preliminary study was carried out with 50 potential buyers of autonomous car. The results indicated that the most effective trust attributes in trust requirements are privacy, experience and integrity the may lead to better acceptability of autonomous car.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "A crowdsourcing approach for volunteering system using delphi method\n", "abstract": " Voluntary work is an important part of virtually every civilization and society. There are several versions of the volunteer management theory referenced in industry resources. Several organizations have developed organization-based systems designed to incorporate spontaneous volunteers. However, it can be difficult to find and recruit suitable candidates for volunteer organizations because the volunteers have many criteria to match with tasks. Also, we still have lacking information on the process of crowdsourcing in volunteering perspective. This paper, we conduct a review of volunteering management systems and crowdsourcing approach. Based on the insights derived from this analysis, we identify some issues for future research. To solve this problem, we designed a framework for the crowdsourcing approach in volunteering system to automate the process of selection volunteers and match with the …", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Eliciting Functional Requirements in Clinical Domain: A Review\n", "abstract": " Requirements elicitation is the most crucial and complex tasks in requirement engineering as it determines the quality of requirements in software development. Further, considering that clinical requirements are more complex in comparison to other requirements, requirements engineers have to give more attention when eliciting requirements for clinical software as any errors may lead to disastrous effects in healthcare. In this case, requirement engineers need to be cognizant of the accuracy and completeness of requirements to ensure the development of a full-function software. Although various methods, approaches and tools have been developed to assist requirements engineers to elicit accurate requirements, there have been very limited work involved in the clinical domain. This paper aims to present a comparison analysis of the existing methods, approaches and tools that help requirements to elicit requirements. The analysis of tools can be used a guidance to identify the existing work related to requirements elicitation.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "A STUDY OF GENERATING ABSTRACT TEST FOR REQUIREMENTS VALIDATION AMONG REQUIREMENTS ENGINEERS.\n", "abstract": " Requirements testing or requirements-based testing (RBT) is one of the software testing techniques that is found effective to test requirements' completeness and accuracy. This technique involves systematic way of test case generation from the model of the requirements specification. This technique has been applied in the requirements analysis phase to detect and eliminate requirements defects before the next stage of software development project. Although this technique is useful, it is tedious and time consuming to manually generate abstract test from the requirements model. However, we argue that the tedious process can be minimised if the requirements engineer have the good ability (skill) to generate abstract test from requirements models for requirements validation. This paper described a study of requirements engineer manually generate abstract tests from requirements model: Essential Use Cases …", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Ensemble Selection and Optimization Based on Soft Set Theory for Customer Churn Classification\n", "abstract": " Ensemble methods or multiple classifiers which combine decisions from many base classifiers have been confirmed to outperform the classification performance of any single classifiers. Despite having the ability of producing the highest classification accuracy, ensemble methods have suffered significantly from their large volume of base classifiers. Thus, in the previous work, we have proposed a novel soft set based method to prune the base classifiers from heterogeneous ensemble committee and have demonstrated the ability of our proposed soft set pruning algorithm in reducing a substantial number of classifiers while at the same time producing the highest prediction accuracy. However, the pruning method only suggests a subset of relevant classifiers, and the search for the optimized and best classifiers is not yet considered. The selection of the best or optimized classifiers is carried out by checking all combinations of pruned classifiers. In this paper, we extended our research by proposing a new soft ensemble selection and optimization method to find the best subset of the pruned classifiers. The results of this work have proven that our proposed method is able to search for the minimum number of classifiers in the ensemble repository while at the same time maintaining or improving the classification performance. The proposed method is systematically evaluated using Customer Churn dataset taken from the UC Irvine Machine Learning Repository data set. This work proved that the proposed soft ensemble selection and optimization method is able to search for the minimum number of classifiers in the ensemble repository while at the …", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Requirements Engineering: First Asia Pacific Requirements Engineering Symposium, APRES 2014, Auckland, New Zealand, April 28-29, 2014, Proceedings\n", "abstract": " This book constitutes the proceedings of the first Asia Pacific Requirements Engineering Symposium, APRES 2014, held in Auckland, New Zealand, in April 2014. The 16 papers presented were carefully reviewed and selected from 30 submissions. The focus of the papers is on the following topics: novel ideas, methods, tools, and techniques for improving and enhancing Requirement Engineering products and processes.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Characterisation of Healthcare Domain Library to Capture Accurate Requirements of Healthcare Software\n", "abstract": " Capturing accurate requirements is crucial in healthcare domain as it is considered as the most sensitive domain due to its direct impacts on people’s well-being and lives. The common practice for capturing requirements is found to be subjected to errors, inconsistencies, redundancy, incompleteness, and omissions. Although frequent face-to-face communication between the requirements engineer and various stakeholders can minimize these problems, it is found to consume too much time. Hence, this research suggests that a healthcare domain library comprising compilation of structural expressions and glossary of functional requirements derived from various stakeholders can assist requirements engineer to capture accurate requirements as well as reduce the time taken. This research involves three stages: analysis, design development as well as testing and evaluation. This paper reports the progress of this research approach which is at its analysis stage.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Optimization of LRT Route for Mobile Web Application Engine\n", "abstract": " Integrated light rail transit (LRT) system in the capital of Malaysia connects some key districts to historical places, interesting places, business areas and shopping malls are concentrated. The train services are running independently but have interchanges to integrate from one different LRT lines. This may leads the traveler facing difficulty when they are choosing incorrect destination station especially on different LRT lines which contribute to time consuming and high costing. In previous research we already implement the mobile Web application architecture where the destination-oriented routes need to be dynamically generated by determining the nearest station according to the specific places. In this paper, we proposed the used of Dijkstra's algorithms to provide more effective and intelligent shortest path system to provide the solution for traveler to reach the desired destination.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "A Mobile Web Application Engine for Generating Destination-oriented LRT Route\n", "abstract": " Integrated Light Rail Transit (LRT) System in the capital of Malaysia connects some key districts to historical places, interesting places, business areas and shopping malls are concentrated. The train services are running independently but have interchanges to integrate from one different LRT lines. This may leads the traveler facing difficulty when they are choosing incorrect destination station especially on different LRT lines which contribute to time consuming and high costing. In previous research we already implement the mobile web application architecture where the destination-oriented routes need to be dynamically generated by determining the nearest station according to the specific places. In this paper, we proposed the used of Dijkstra’s Algorithms to provide more effective and intelligent shortest path system to provide the solution for traveler to reach the desired destination.", "num_citations": "1\n", "authors": ["1914"]}
{"title": "Software learning tool to calculate isotope pattern for chemistry area of study\n", "abstract": " This article describes the anticipated software learning tool to calculate the isotope pattern for educational purposes. Despite the availability of the mass spectrometer to classify the existence of the isotopes from the particular elements, the projected software is indeed practical, beneficial and constructive for the academic learners as well for the intellectual researchers for rapidly defining the numbers of the possibility isotope patterns obtainable from a substance (chemical compound) for example methane (CH2). Hence, with the mathematical application (Cartesian Products) and the fundamental knowledge of chemistry that facilitate the calculations are feasible to obtain the isotope patterns without the aid of the mass spectrometer. For instance, the intended calculator called as Theoretical Isotope Generator (TIG) is fairly to be a calculation engine as well that is proficient to retrieve the information of the mass (atomic/molecular weight) from the substance specified based from the isotope patterns available. In conjunction of the patterns attained, the current mass spectrometer defines the acknowledged atomic isotopes of each identified elements which will be predefined for the software learning tools in order to regain the calculation for the molecular isotope patterns.", "num_citations": "1\n", "authors": ["1914"]}