{"title": "A framework for reducing the cost of instrumented code\n", "abstract": " Instrumenting code to collect profiling information can cause substantial execution overhead. This overhead makes instrumentation difficult to perform at runtime, often preventing many known offline feedback-directed optimizations from being used in online systems. This paper presents a general framework for performing instrumentation sampling to reduce the overhead of previously expensive instrumentation. The framework is simple and effective, using code-duplication and counter-based sampling to allow switching between instrumented and non-instrumented code.", "num_citations": "449\n", "authors": ["711"]}
{"title": "Finding low-utility data structures\n", "abstract": " Many opportunities for easy, big-win, program optimizations are missed by compilers. This is especially true in highly layered Java applications. Often at the heart of these missed optimization opportunities lie computations that, with great expense, produce data values that have little impact on the program's final output. Constructing a new date formatter to format every date, or populating a large set full of expensively constructed structures only to check its size: these involve costs that are out of line with the benefits gained. This disparity between the formation costs and accrued benefits of data structures is at the heart of much runtime bloat.", "num_citations": "128\n", "authors": ["711"]}
{"title": "Web services navigator: Visualizing the execution of web services\n", "abstract": " The Web Services standard is becoming the lingua franca for loosely coupled distributed applications. As the number of nodes and the complexity of these applications grow over the coming years, it will become more challenging for developers to understand, debug, and optimize them. In this paper, we describe Web Services Navigator, a visualization tool that fosters better understanding of service-oriented architecture (SOA) applications. We draw on our experience with real SOA applications to show how this tool has been applied to practical problems ranging from business logic misunderstandings to performance bottlenecks to syntax and semantic errors. Web Services Navigator helps to solve these problems by visualizing how applications really execute, enabling business owners, application designers, project managers, programmers, and operations staff to understand how their applications actually …", "num_citations": "120\n", "authors": ["711"]}
{"title": "Go with the flow: Profiling copies to find runtime bloat\n", "abstract": " Many large-scale Java applications suffer from runtime bloat. They execute large volumes of methods, and create many temporary objects, all to execute relatively simple operations. There are large opportunities for performance optimizations in these applications, but most are being missed by existing optimization and tooling technology. While JIT optimizations struggle for a few percent, performance experts analyze deployed applications and regularly find gains of 2x or more.", "num_citations": "115\n", "authors": ["711"]}
{"title": "Software bloat analysis: Finding, removing, and preventing performance problems in modern large-scale object-oriented applications\n", "abstract": " Generally believed to be a problem belonging to the compiler and architecture communities, performance optimization has rarely gained attention in mainstream software engineering research. However, due to the proliferation of large-scale object-oriented software designed to solve increasingly complex problems, performance issues stand out, preventing applications from meeting their performance requirements. Many such issues result from design principles adopted widely in the software research community, such as the idea of software reuse and design patterns. We argue that, in the modern era when Moore's dividend becomes less obvious, performance optimization is more of a software engineering problem than ever and should receive much more attention in the future. We explain why this is the case, review what has been achieved in software bloat analysis, present challenges, and provide a road map …", "num_citations": "95\n", "authors": ["711"]}
{"title": "Approximating the calling context tree via sampling\n", "abstract": " This Research Report is available. This report has been submitted for publication outside of IBM and will probably be copyrighted if accepted for publication. It has been issued as a Research Report for early dissemination of its contents. In view of the transfer of copyright to the outside publisher, its distribution outside of IBM prior to publication should be limited to peer communications and specific requests. After outside publication, requests should be filled only by reprints or legally obtained copies of the article (eg, payment of royalties). I have read and understand this notice and am a member of the scientific community outside or inside of IBM seeking a single copy only.", "num_citations": "84\n", "authors": ["711"]}
{"title": "A concurrent dynamic analysis framework for multicore hardware\n", "abstract": " Software has spent the bounty of Moore's law by solving harder problems and exploiting abstractions, such as high-level languages, virtual machine technology, binary rewriting, and dynamic analysis. Abstractions make programmers more productive and programs more portable, but usually slow them down. Since Moore's law is now delivering multiple cores instead of faster processors, future systems must either bear a relatively higher cost for abstractions or use some cores to help tolerate abstraction costs.", "num_citations": "71\n", "authors": ["711"]}
{"title": "Collecting and exploiting high-accuracy call graph profiles in virtual machines\n", "abstract": " Due to the high dynamic frequency of virtual method calls in typical object-oriented programs, feedback-directed devirtualization and inlining is one of the most important optimizations performed by high-performance virtual machines. A critical input to effective feedback-directed inlining is an accurate dynamic call graph. In a virtual machine, the dynamic call graph is computed online during program execution. Therefore, to maximize overall system performance, the profiling mechanism must strike a balance between profile accuracy, the speed at which the profile becomes available to the optimizer, and profiling overhead. This paper introduces a new low-overhead sampling-based technique that rapidly converges on a high-accuracy dynamic call graph. We have implemented the technique in two high-performance virtual machines: Jikes RVM and J9. We empirically assess our profiling technique by reporting on …", "num_citations": "70\n", "authors": ["711"]}
{"title": "Improving virtual machine performance using a cross-run profile repository\n", "abstract": " Virtual machines for languages such as the Java programming language make extensive use of online profiling and dynamic optimization to improve program performance. But despite the important role that profiling plays in achieving high performance, current virtual machines discard a program's profile data at the end of execution, wasting the opportunity to use past knowledge to improve future performance. In this paper, we present a fully automated architecture for exploiting cross-run profile data in virtual machines. Our work addresses a number of challenges that previously limited the practicality of such an approach. We apply this architecture to address the problem of selective optimization, and describe our implementation in IBM's J9 Java virtual machine. Our results demonstrate substantial performance improvements on a broad suite of Java programs, with the average performance ranging from 8.8%--16 …", "num_citations": "55\n", "authors": ["711"]}
{"title": "Thin guards: A simple and effective technique for reducing the penalty of dynamic class loading\n", "abstract": " Dynamic class loading is an integral part of the Java™ programming language, offering a number of advantages such as lazy class loading and dynamic installation of software components. Unfortunately, these advantages often come at the cost of decreased performance because certain optimizations become more difficult to perform when an optimizing compiler cannot assume that it has seen the whole program. This paper introduces thin guards, a simple but effective technique that uses lightweight runtime tests to identify regions of code within which speculative optimizations can be performed. One application of thin guards is described in detail, demonstrating how they can be used to perform speculative inlining in the presence of dynamic class loading. Our experimental evaluation shows that when used in combination with other traditional compiler optimizations, thin guards can eliminate most of the …", "num_citations": "44\n", "authors": ["711"]}
{"title": "QVM: An efficient runtime for detecting defects in deployed systems\n", "abstract": " Coping with software defects that occur in the post-deployment stage is a challenging problem: bugs may occur only when the system uses a specific configuration and only under certain usage scenarios. Nevertheless, halting production systems until the bug is tracked and fixed is often impossible. Thus, developers have to try to reproduce the bug in laboratory conditions. Often, the reproduction of the bug takes most of the debugging effort. In this paper we suggest an approach to address this problem by using a specialized runtime environment called Quality Virtual Machine (QVM). QVM efficiently detects defects by continuously monitoring the execution of the application in a production setting. QVM enables the efficient checking of violations of user-specified correctness properties, that is, typestate safety properties, Java assertions, and heap properties pertaining to ownership. QVM is markedly different from …", "num_citations": "37\n", "authors": ["711"]}
{"title": "Poetry and prose\n", "abstract": " THE volumes in this series are designed to give the reader a faithful picture of the range, and the excellences, of each writer's work. As Macaulay is pre-eminently an historian, selections from his", "num_citations": "37\n", "authors": ["711"]}
{"title": "Standardizing compression testing for measuring the stiffness of human bone\n", "abstract": " Objectives The ability to determine human bone stiffness is of clinical relevance in many fields, including bone quality assessment and orthopaedic prosthesis design. Stiffness can be measured using compression testing, an experimental technique commonly used to test bone specimens in vitro. This systematic review aims to determine how best to perform compression testing of human bone.   Methods A keyword search of all English language articles up until December 2017 of compression testing of bone was undertaken in Medline, Embase, PubMed, and Scopus databases. Studies using bulk tissue, animal tissue, whole bone, or testing techniques other than compression testing were excluded.   Results A total of 4712 abstracts were retrieved, with 177 papers included in the analysis; 20 studies directly analyzed the compression testing technique to improve the accuracy of testing. Several influencing factors …", "num_citations": "35\n", "authors": ["711"]}
{"title": "Burden of carotid artery atherosclerosis in Chinese adults: implications for future risk of cardiovascular diseases\n", "abstract": " Background           Population-based studies of ultrasound measures of carotid atherosclerosis are informative about future risks of cardiovascular disease.                             Design           Cross-sectional studies of carotid artery atherosclerosis in 24,822 Chinese adults from the China Kadoorie Biobank and 2579 Europeans from the UK Biobank.                             Methods           Mean intima-media thickness of the common carotid arteries and presence of carotid artery plaque were examined in the China Kadoorie Biobank study. The carotid intima-media thickness (cIMT) findings in Chinese (mean age 59 years) were compared with a European population (mean age 62 years).                             Results           Overall, the mean cIMT in Chinese was 0.70 mm (SD 0.16) and increased with age by 0.08 mm (SE 0.008) per 10-years older age. About 31% of the Chinese had carotid plaques and the prevalence …", "num_citations": "31\n", "authors": ["711"]}
{"title": "Matthew Arnold\n", "abstract": " Critic, essayist, educator and poet, author of The Scholar Gypsy, Dover Beach, The Forsaken Merman and other popular poems.", "num_citations": "30\n", "authors": ["711"]}
{"title": "Microindentation–a tool for measuring cortical bone stiffness? A systematic review\n", "abstract": " Objectives Microindentation has the potential to measure the stiffness of an individual patient’s bone. Bone stiffness plays a crucial role in the press-fit stability of orthopaedic implants. Arming surgeons with accurate bone stiffness information may reduce surgical complications including periprosthetic fractures. The question addressed with this systematic review is whether microindentation can accurately measure cortical bone stiffness.   Methods A systematic review of all English language articles using a keyword search was undertaken using Medline, Embase, PubMed, Scopus and Cochrane databases. Studies that only used nanoindentation, cancellous bone or animal tissue were excluded.   Results A total of 1094 abstracts were retrieved and 32 papers were included in the analysis, 20 of which used reference point indentation, and 12 of which used traditional depth-sensing indentation. There are several …", "num_citations": "28\n", "authors": ["711"]}
{"title": "System and method for improving virtual machine performance using an offline profile repository\n", "abstract": " A system, method, and computer readable medium, for automatically improving performance of, and optimizing, a program based on on-line profile data of the program and profile data (302) collected across multiple runs of the program and stored in a persistent off-line repository (114). The method includes executing a program in an execution environment. Profile data (302) is collected for the program across multiple runs thereof. The performance of the program is improved, such as by optimization of the program, based on on-line profile data of the executing program and the collected profile data in the persistent off-line repository.", "num_citations": "22\n", "authors": ["711"]}
{"title": "Scalable runtime bloat detection using abstract dynamic slicing\n", "abstract": " Many large-scale Java applications suffer from runtime bloat. They execute large volumes of methods and create many temporary objects, all to execute relatively simple operations. There are large opportunities for performance optimizations in these applications, but most are being missed by existing optimization and tooling technology. While JIT optimizations struggle for a few percent improvement, performance experts analyze deployed applications and regularly find gains of 2× or more. Finding such big gains is difficult, for both humans and compilers, because of the diffuse nature of runtime bloat. Time is spread thinly across calling contexts, making it difficult to judge how to improve performance. Our experience shows that, in order to identify large performance bottlenecks in a program, it is more important to understand its dynamic dataflow than traditional performance metrics, such as running time. This …", "num_citations": "21\n", "authors": ["711"]}
{"title": "Online profiling and feedback-directed optimization of java\n", "abstract": " The dynamic nature of the Java™ programming language presents a number of challenges for Java Virtual Machine (JVM) implementations. Constructs such as dynamic class loading and reflection make traditional whole program analysis and optimization difficult, or even impossible; however, Java's dynamic execution environment also presents a potential performance advantage over the traditional static compilation model: the ability to perform feedback-directed optimizations, where profiling information is collected at runtime and used to tailor the optimization decisions that are made.", "num_citations": "20\n", "authors": ["711"]}
{"title": "Measuring bone stiffness using spherical indentation\n", "abstract": " Objectives Bone material properties are a major determinant of bone health in older age, both in terms of fracture risk and implant fixation, in orthopaedics and dentistry. Bone is an anisotropic and hierarchical material so its measured material properties depend upon the scale of metric used. The scale used should reflect the clinical problem, whether it is fracture risk, a whole bone problem, or implant stability, at the millimetre-scale. Indentation, an engineering technique involving pressing a hard-tipped material into another material with a known force, may be able to assess bone stiffness at the millimetre-scale (the apparent elastic modulus). We aimed to investigate whether spherical-tip indentation could reliably measure the apparent elastic modulus of human cortical bone.   Materials and methods Cortical bone samples were retrieved from the femoral necks of nineteen patients undergoing total hip replacement surgery (10 females, 9 males, mean age: 69 years). The samples underwent indentation using a 1.5 mm diameter, ruby, spherical indenter tip, with sixty indentations per patient sample, across six locations on the bone surfaces, with ten repeated indentations at each of the six locations. The samples then underwent mechanical compression testing. The repeatability of indentation measurements of elastic modulus was assessed using the co-efficient of repeatability and the correlation between the bone elastic modulus measured by indentation and compression testing was analysed by least-squares regression.   Results In total, 1140 indentations in total were performed. Indentation was found to be repeatable for indentations …", "num_citations": "19\n", "authors": ["711"]}
{"title": "A comparison of the radiation response of the epidermis in two strains of pig\n", "abstract": " The response of the epidermis was compared in two strains of pig, the English Large White and the Göttinger Miniature, after irradiation with90 Sr β rays. The effects of two types of anesthesia were also tested in pigs of each strain, a volatile gas mixture of ∼70% oxygen, ∼30% nitrous oxide, and 2% halothane, and an intravenously administered narcotic azaperon/etimodat with the animals breathing air. Strain- and anesthetic-related changes were compared on the basis of dose-effect curves for the incidence of moist desquamation from which ED50 values (±SE) were determined, i.e., the dose required to produce this effect in 50% of the fields irradiated. For English Large White pigs anesthetized with the volatile gas mixture, an ED50 of 27.32 ± 0.52 Gy was obtained for moist desquamation. Irradiation with the azaperon/etomidat anesthesia in this strain of pig produced a significantly higher ED50 of 33.36 ± 0.76 …", "num_citations": "16\n", "authors": ["711"]}
{"title": "Polygenic risk scores in cardiovascular risk prediction: A cohort study and modelling analyses\n", "abstract": " Background Polygenic risk scores (PRSs) can stratify populations into cardiovascular disease (CVD) risk groups. We aimed to quantify the potential advantage of adding information on PRSs to conventional risk factors in the primary prevention of CVD.   Methods and findings Using data from UK Biobank on 306,654 individuals without a history of CVD and not on lipid-lowering treatments (mean age [SD]: 56.0 [8.0] years; females: 57%; median follow-up: 8.1 years), we calculated measures of risk discrimination and reclassification upon addition of PRSs to risk factors in a conventional risk prediction model (i.e., age, sex, systolic blood pressure, smoking status, history of diabetes, and total and high-density lipoprotein cholesterol). We then modelled the implications of initiating guideline-recommended statin therapy in a primary care setting using incidence rates from 2.1 million individuals from the Clinical Practice Research Datalink. The C-index, a measure of risk discrimination, was 0.710 (95% CI 0.703–0.717) for a CVD prediction model containing conventional risk predictors alone. Addition of information on PRSs increased the C-index by 0.012 (95% CI 0.009–0.015), and resulted in continuous net reclassification improvements of about 10% and 12% in cases and non-cases, respectively. If a PRS were assessed in the entire UK primary care population aged 40–75 years, assuming that statin therapy would be initiated in accordance with the UK National Institute for Health and Care Excellence guidelines (i.e., for persons with a predicted risk of ≥10% and for those with certain other risk factors, such as diabetes, irrespective of their 10-year …", "num_citations": "15\n", "authors": ["711"]}
{"title": "Assessment of the role of carotid atherosclerosis in the association between major cardiovascular risk factors and ischemic stroke subtypes\n", "abstract": " ImportanceA better understanding of the role of atherosclerosis in the development of ischemic stroke subtypes could help to improve strategies for prevention of stroke worldwide.ObjectiveTo assess the role of carotid atherosclerosis in the association between major cardiovascular risk factors and ischemic stroke subtypes.Design, Setting, and ParticipantsThe prospective China Kadoorie Biobank cohort study was conducted in the general population of 5 urban and 5 rural areas in China, with a baseline survey obtained between June 2004 and July 2008. A random sample of 23 973 participants with no history of cardiovascular disease at enrollment who had carotid artery ultrasonographic measurements recorded at a resurvey from September 2013 to June 2014 were included. Data analysis was performed from July 1, 2016, to April 10, 2019.ExposuresMajor cardiovascular risk factors (ie, blood pressure [BP …", "num_citations": "15\n", "authors": ["711"]}
{"title": "Walking the ethical tightrope\n", "abstract": " Walking the ethical tightrope ПОИСК НАВИГАТОР Начальная страница Каталог журналов Авторский указатель Список организаций Тематический рубрикатор Поисковые запросы Новые поступления Настройка СЕССИЯ КОНТАКТЫ ИНФОРМАЦИЯ О ПУБЛИКАЦИИ WALKING THE ETHICAL TIGHTROPE ARNOLD MATTHEW 1 1 Company: Philip Morris Cos Inc Geographic Place: United States; US; United Kingdom; UK Тип: статья в журнале Язык: английский Год: 2002 Страницы: 17 ЖУРНАЛ: MARKETING Издательство: Proquest ABI/INFORM ISSN: 0025-3650 КЛЮЧЕВЫЕ СЛОВА: TOBACCO INDUSTRY, CORPORATE RESPONSIBILITY, MULTINATIONAL CORPORATIONS, MANYCOMPANIES, MARKET STRATEGY, SPINOFFS, CORPORATE IMAGE, ADVERTISING CAMPAIGNS АННОТАЦИЯ: Philip Morris last week became the latest in a growing stable of beleaguered blue-chip …", "num_citations": "11\n", "authors": ["711"]}
{"title": "Method and apparatus for efficient implementation of discontiguous objects\n", "abstract": " A garbage collection system that needs to meet real-time requirements breaks large objects that need to be moved into a series of arraylets. The arraylets are sized such that the amount of time required to move the arraylets is bounded by a predetermined amount. The arrays are preferably uniformly represented in the header for each array with a series of arraylet pointers that indicate the location of the arraylets. Control-flow graph splitting is used to eliminate multiple tests and allow common sub-expression elimination. Strip-mining can also be used to improve the efficiency of the process.", "num_citations": "10\n", "authors": ["711"]}
{"title": "Approaches to minimising the epidemiological impact of sources of systematic and random variation that may affect biochemistry assay data in UK Biobank\n", "abstract": " Background: UK Biobank is a large prospective study that recruited 500,000 participants aged 40 to 69 years, between 2006-2010. The study has collected (and continues to collect) extensive phenotypic and genomic data about its participants. In order to enhance further the value of the UK Biobank resource, a wide range of biochemistry markers were measured in all participants with an available biological sample. Here, we describe the approaches UK Biobank has taken to minimise error related to sample collection, processing, retrieval and assay measurement.Methods: During routine quality control checks, the laboratory team observed that some assay results were lower than expected for samples acquired during certain time periods. Analyses were undertaken to identify and correct for the unexpected dilution identified during sample processing, and for expected error caused by laboratory drift of assay …", "num_citations": "7\n", "authors": ["711"]}
{"title": "Online instrumentation and feedback-directed optimization of Java\n", "abstract": " The overhead involved in collecting fine-grained profiling information makes feedback-directed optimizations difficult to perform online at runtime. As a result, the vast majority of work in offline feedback-directed optimization is not yet being applied in online systems. This paper describes the design and implementation of a fully automatic online approach for performing instrumentation and feedback-directed optimization. Our approach uses instrumentation sampling to reduce the overhead of instrumentation, thus eliminating many of the limitations present in existing online systems. Several online feedback-directed optimizations are described, including a novel algorithm for performing feedback-directed splitting. Our experimental results show improvements in peak performance of up to 20% while overhead remains low, with no individual execution being degraded more than 2%.", "num_citations": "7\n", "authors": ["711"]}
{"title": "Assessment of Vascular Event Prevention and Cognitive Function Among Older Adults With Preexisting Vascular Disease or Diabetes: A Secondary Analysis of 3 Randomized Clinical …\n", "abstract": " ImportanceAcquisition of reliable randomized clinical trial evidence of the effects of cardiovascular interventions on cognitive decline is a priority.ObjectivesTo estimate the association of cognitive aging with the avoidance of vascular events in cardiovascular intervention trials and understand whether reports of nonsignificant results exclude worthwhile benefit.Design, Setting, and ParticipantsThis secondary analysis of 3 randomized clinical trials in participants with preexisting occlusive vascular disease or diabetes included survivors to final in-trial follow-up in the Heart Protection Study (HPS), Study of the Effectiveness of Additional Reductions in Cholesterol and Homocysteine (SEARCH), and Treatment of HDL (High-Density Lipoprotein) to Reduce the Incidence of Vascular Events (HPS2-THRIVE) trials of lipid modification for prevention of cardiovascular events. Data were collected from February 1994 through …", "num_citations": "5\n", "authors": ["711"]}
{"title": "Reproducibility of dietary intakes of macronutrients, specific food groups, and dietary patterns in 211 050 adults in the UK Biobank study\n", "abstract": " To detect modest associations of dietary intake with disease risk, observational studies need to be large and control for moderate measurement errors. The reproducibility of dietary intakes of macronutrients, food groups and dietary patterns (vegetarian and Mediterranean) was assessed in adults in the UK Biobank study on up to five occasions using a web-based 24-h dietary assessment (n 211 050), and using short FFQ recorded at baseline (n 502 655) and after 4 years (n 20 346). When the means of two 24-h assessments were used, the intra-class correlation coefficients (ICC) for macronutrients varied from 0·63 for alcohol to 0·36 for polyunsaturated fat. The ICC for food groups also varied from 0·68 for fruit to 0·18 for fish. The ICC for the FFQ varied from 0·66 for meat and fruit to 0·48 for bread and cereals. The reproducibility was higher for vegetarian status (κ > 0·80) than for the Mediterranean dietary pattern …", "num_citations": "5\n", "authors": ["711"]}
{"title": "Integrative analysis of the plasma proteome and polygenic risk of cardiometabolic diseases\n", "abstract": " Cardiometabolic diseases are frequently polygenic in architecture, comprising a large number of risk alleles with small effects spread across the genome 1, 2, 3. Polygenic scores (PGS) aggregate these into a metric representing an individual’s genetic predisposition to disease. PGS have shown promise for early risk prediction 4, 5, 6, 7 and there is an open question as to whether PGS can also be used to understand disease biology 8. Here, we demonstrate that cardiometabolic disease PGS can be used to elucidate the proteins underlying disease pathogenesis. In 3,087 healthy individuals, we found that PGS for coronary artery disease, type 2 diabetes, chronic kidney disease and ischaemic stroke are associated with the levels of 49 plasma proteins. Associations were polygenic in architecture, largely independent of cis and trans protein quantitative trait loci and present for proteins without quantitative trait loci …", "num_citations": "4\n", "authors": ["711"]}
{"title": "Prediction of cardiovascular disease risk accounting for future initiation of statin treatment\n", "abstract": " Cardiovascular disease (CVD) risk prediction models are used to identify high-risk individuals and guide statin-initiation. However, these models are usually derived from individuals who may initiate statins during follow-up. We present a simple approach to address statin-initiation to predict “statin-naïve” CVD risk. We analyzed primary care data (2004-2017) from the UK Clinical Practice Research Datalink for 1,678,727 individuals (40-85 years) without CVD or statin treatment history at study entry. We derived age- and sex-specific prediction models including conventional risk factors and a time-dependent effect of statin-initiation constrained to 25% risk reduction (from trial results). We compared predictive performance and measures of public-health impact (e.g., numbers-needed-to-screen to prevent one case) against models ignoring statin-initiation. During a median follow-up of 8.9 years, 103,163 individuals …", "num_citations": "4\n", "authors": ["711"]}
{"title": "Towards automating the AI operations lifecycle\n", "abstract": " Today's AI deployments often require significant human involvement and skill in the operational stages of the model lifecycle, including pre-release testing, monitoring, problem diagnosis and model improvements. We present a set of enabling technologies that can be used to increase the level of automation in AI operations, thus lowering the human effort required. Since a common source of human involvement is the need to assess the performance of deployed models, we focus on technologies for performance prediction and KPI analysis and show how they can be used to improve automation in the key stages of a typical AI operations pipeline.", "num_citations": "3\n", "authors": ["711"]}
{"title": "Carotid Intima‐Media Thickness but Not Carotid Artery Plaque in Healthy Individuals Is Linked to Lean Body Mass\n", "abstract": " Background Lean body mass has been identified as a key determinant of left ventricular mass and wall thickness. However, the importance of lean body mass or other body‐size measures as normative determinants of carotid intima‐media thickness (cIMT), a widely used early indicator of atherosclerosis, has not been well established.   Methods and Results Carotid artery ultrasound measurements of cIMT and carotid artery plaque burden (derived from plaque number and maximum size) and measurements of body size, including height, body mass index, weight, body fat proportion, and lean body mass ([1−body fat proportion]×weight), were recorded in 25 020 participants from 10 regions of China. Analyses were restricted to a healthy younger subset (n=6617) defined as never or long‐term ex‐regular smokers aged <60 years (mean age, 50) without previous ischemic heart disease, stroke, diabetes mellitus, or …", "num_citations": "3\n", "authors": ["711"]}
{"title": "Use of polygenic risk scores and other molecular markers to enhance cardiovascular risk prediction: prospective cohort study and modelling analysis\n", "abstract": " Background There is debate about the value of adding information on genetic and other molecular markers to conventional cardiovascular disease (CVD) risk predictors.Methods Using data on 306,654 individuals without a history of CVD from UK Biobank, we calculated measures of risk-discrimination and reclassification upon addition of polygenic risk scores (PRS) and a panel of 27 clinical biochemistry markers to a conventional risk prediction model (i.e., including age, sex, systolic blood pressure, smoking status, history of diabetes, total cholesterol and HDL cholesterol). We then modelled implications of initiating guideline-recommended statin therapy after the assessment of molecular markers for a UK primary-care setting.Findings The C-index was 0.710 (95% CI, 0.703-0.717) for a CVD prediction model containing conventional risk predictors alone. The C-index increased by similar amounts when adding information on PRS or biochemistry markers (0.011 and 0.014, respectively; P<0.001), and it increased still further (0.022; P<0.001) when information on both was combined. Among cases and controls, continuous net reclassification improvements were about 12% and 19%, respectively, when both PRS and biochemistry markers were added. If PRS and biochemistry markers were to be assessed in the entire primary care population aged 40-75, then it could help prevent one additional CVD event for every 893 individuals screened. By contrast, targeted assessment only among people at intermediate (i.e., 5-10%) 10-year CVD risk could help prevent one additional CVD event for every 233 individuals screened. This targeted strategy …", "num_citations": "3\n", "authors": ["711"]}
{"title": "Genetic, lifestyle, and health-related characteristics of adults without celiac disease who follow a gluten-free diet: a population-based study of 124,447 participants\n", "abstract": " Background           The number of gluten-free diet followers without celiac disease (CD) is increasing. However, little is known about the characteristics of these individuals.                             Objectives           We address this issue by investigating a wide range of genetic and phenotypic characteristics in association with following a gluten-free diet.                             Methods           The cross-sectional association between lifestyle and health-related characteristics and following a gluten-free diet was investigated in 124,447 women and men aged 40–69 y from the population-based UK Biobank study. A genome-wide association study (GWAS) of following a gluten-free diet was performed.                             Results           A total of 1776 (1.4%) participants reported following a gluten-free diet. Gluten-free diet followers were more likely to be women, nonwhite, highly educated, living in more socioeconomically …", "num_citations": "2\n", "authors": ["711"]}
{"title": "Effects of within-person variability in spot urinary sodium measurements on associations with blood pressure and cardiovascular disease\n", "abstract": " Randomized trials of salt restriction have consistently demonstrated that decreasing salt consumption lowers blood pressure, but results of observational studies of salt intake and cardiovascular disease have been conflicting. After excluding individuals with prevalent cardiovascular or kidney disease in the prospective UK Biobank study, we examined the within-person variability in spot urinary sodium excretion and its impact on associations with systolic blood pressure and risk of incident cardiovascular disease. Spearman correlation coefficients were used to assess within-person variability in spot urinary sodium, and associations between sodium and blood pressure were assessed using linear regression in participants with measurements at baseline (N=355 134) and after 9 years (N=33 915). Cox regression was used to assess associations with the risk of cardiovascular disease over the same follow-up …", "num_citations": "1\n", "authors": ["711"]}
{"title": "A biomarker-based biological age in UK Biobank: composition and prediction of mortality and hospital admissions\n", "abstract": " Background           Chronological age is the strongest risk factor for most chronic diseases. Developing a biomarker-based age and understanding its most important contributing biomarkers may shed light on the effects of age on later-life health and inform opportunities for disease prevention.                             Methods           A subpopulation of 141 254 individuals healthy at baseline were studied, from among 480 019 UK Biobank participants aged 40–70 recruited in 2006–2010, and followed up for 6–12 years via linked death and secondary care records. Principal components of 72 biomarkers measured at baseline were characterized and used to construct sex-specific composite biomarker ages using the Klemera Doubal method, which derived a weighted sum of biomarker principal components based on their linear associations with chronological age. Biomarker importance in the biomarker ages was …", "num_citations": "1\n", "authors": ["711"]}
{"title": "Learning prediction intervals for model performance\n", "abstract": " Understanding model performance on unlabeled data is a fun-1 damental challenge of developing, deploying, and maintain-2 ing AI systems. Model performance is typically evaluated 3 using test sets or periodic manual quality assessments, both 4 of which require laborious manual data labeling. Automated 5 performance prediction techniques aim to mitigate this bur-6 den, but potential inaccuracy and a lack of trust in their pre-7 dictions has prevented their widespread adoption. We address 8 this core problem of performance prediction uncertainty with 9 a method to compute prediction intervals for model perfor-10 mance. Our methodology uses transfer learning to train an un-11 certainty model to estimate the uncertainty of model perfor-12 mance predictions. We evaluate our approach across a wide 13 range of drift conditions and show substantial improvement 14 over competitive baselines. We believe this result makes pre-15 diction intervals, and performance prediction in general, sig-16 nificantly more practical for real-world use. 17", "num_citations": "1\n", "authors": ["711"]}
{"title": "Discovering and resolving training conflicts in machine learning systems\n", "abstract": " A method optimizes a training of a machine learning system. A conflict detection system discovers a conflict between a first training data and a second training data for a machine learning system, where the first training data and the second training data are ground truths that describe a same type of entity, and where the first training data and the second training data have different labels. In response to discovering the conflict between the first training data and the second training data for the machine learning system, an oracle adjusts the different labels of the first training data and the second training data. The machine learning system is then trained using the first training data and the second training data with the adjusted labels.", "num_citations": "1\n", "authors": ["711"]}
{"title": "Uncertainty prediction for deep sequential regression using meta models\n", "abstract": " Generating high quality uncertainty estimates for sequential regression, particularly deep recurrent networks, remains a challenging and open problem. Existing approaches often make restrictive assumptions (such as stationarity) yet still perform poorly in practice, particularly in presence of real world non-stationary signals and drift. This paper describes a flexible method that can generate symmetric and asymmetric uncertainty estimates, makes no assumptions about stationarity, and outperforms competitive baselines on both drift and non drift scenarios. This work helps make sequential regression more effective and practical for use in real-world applications, and is a powerful new addition to the modeling toolbox for sequential uncertainty quantification in general.", "num_citations": "1\n", "authors": ["711"]}
{"title": "Sex-Dependent Effects on Liver Inflammation and Gut Microbial Dysbiosis After Continuous Developmental Exposure to Trichloroethylene in Autoimmune-Prone Mice\n", "abstract": " Trichloroethylene (TCE) is a common environmental toxicant linked with hypersensitivity and autoimmune responses in humans and animal models. While autoimmune diseases are more common in females, mechanisms behind this disparity are not clear. Recent evidence suggests that autoimmunity may be increasing in males, and occupational studies have shown that TCE-mediated hypersensitivity responses occur just as often in males. Previous experimental studies in autoimmune-prone MRL+/+ mice have focused on responses in females. However, it is important to include both males and females in order to better understand sex-disparity in autoimmune disease. In addition, because of an alarming increase in autoimmunity in adolescents, developmental and/or early life exposures to immune-enhancing environmental pollutants should also be considered. Using MRL+/+ mice, we hypothesized that TCE …", "num_citations": "1\n", "authors": ["711"]}
{"title": "Biological age in UK Biobank: biomarker composition and prediction of mortality, coronary heart disease and hospital admissions\n", "abstract": " Background: Age is the strongest risk factor for most chronic diseases, and yet individuals may age at different rates biologically. A biological age formed from biomarkers may be a stronger risk factor than chronological age and understanding what factors contribute to it could provide insight into new opportunities for disease prevention.  Methods and findings: Among 480,019 UK Biobank participants aged 40-70 recruited in 2006-2010 and followed up for 6-12 years via linked death registry and secondary care records, a subpopulation of 141,254 (29.4%) non-smoking adults in good health and with no medication use or disease history at baseline were identified. Independent components of 72 biomarkers measured at baseline were characterised by principal component analysis. The Klemera Doubal method (KDM), which derived a weighted sum of biomarker principal components based on the strengths of their linear associations with chronological age, was used to derive sex-specific biological ages in this healthy subpopulation. The proportions of the overall biological and chronological age effects on mortality, coronary heart disease and age-related non-fatal hospital admissions (based on a hospital frailty index) that were explained by biological age were assessed using log-likelihoods of proportional hazards models.  Reduced lung function, reduced kidney function, slower reaction time, lower insulin-like-growth factor 1, lower hand grip strength and higher blood pressure were key contributors to biological age (explaining the highest percentages of its variance) in both men and women, while lower albumin, higher sex hormone-binding …", "num_citations": "1\n", "authors": ["711"]}
{"title": "What's Good for the Goose May Not Be Good for the Gander: A Bird's Eye View of the Emerging Incidental Take Permit Program under the Migratory Bird Treaty Act\n", "abstract": " As bitter winds rip across the Arctic tundra during the depths of winter, a small bird in the jungles of South America, no larger than a tennis ball, is preparing to make one of the most remarkable journeys on the planet. 2 Within just two short months, this Gray-cheeked Thrush (Catharus minimus) will travel over four thousand miles from the Amazonian jungles to the alder thickets along the Arctic Circle. 3 Along the way, it will evade predators, overcome starvation and inconceivable exhaustion-just to give birth to the next generation of these distant nomads.'Increasingly, however, these natural obstacles are not the greatest threat to the Thrush's survival.'When this Gray-cheeked Thrush crosses into Texas, it must navigate its way through a maze of the largest wind farms in the world. 6 These wind turbines are formidable opponents to a small songbird-killing between 140,000 and 328,000 migratory birds annually.'In …", "num_citations": "1\n", "authors": ["711"]}
{"title": "MEASURING CORTICAL BONE STIFFNESS USING MICRO-INDENTATION\n", "abstract": " The increase in revision joint replacement surgery and fractures of bone around orthopaedic implants may be partly addressed by keeping bone healthy around orthopaedic implants by inserting implants with mechanical properties closer to the patient's bone properties. We do not currently have an accurate way of calculating a patient's bone mechanical properties. We are therefore investigating whether microindentation can accurately calculate bone stiffness.We received ethical approval to retrieve femoral heads and necks from patients undergoing hip replacement surgery for research. Cortical bone from the medial calcar region of the femoral neck was cut into 3×3×6mm cuboid specimens. Micro-indentation testing was performed in the direction of loading of the bone using a MicroMaterials indenter. The samples were kept hydrated and were not fixed or polished. From the unloading curve after indentation, the …", "num_citations": "1\n", "authors": ["711"]}
{"title": "Is alcohol the new tobacco?\n", "abstract": " Is alcohol the new tobacco? ПОИСК НАВИГАТОР Начальная страница Каталог журналов Авторский указатель Список организаций Тематический рубрикатор Поисковые запросы Новые поступления Настройка СЕССИЯ КОНТАКТЫ ИНФОРМАЦИЯ О ПУБЛИКАЦИИ IS ALCOHOL THE NEW TOBACCO? ARNOLD MATTHEW 1 1 Geographic Place: United Kingdom; UK Тип: статья в журнале Язык: английский Год: 2002 Страницы: 15 ЖУРНАЛ: MARKETING Издательство: Proquest ABI/INFORM ISSN: 0025-3650 КЛЮЧЕВЫЕ СЛОВА: STATISTICAL DATA, ALCOHOL USE, ADVERTISING RESTRICTIONS, DEATHS, PUBLIC HEALTH, LABELING, LIQUOR INDUSTRY АННОТАЦИЯ: It may be the season to eat, drink and be merry, but there was bad news for alcohol brands in the chief medical officer's annual report last week. The survey found a worrying rise in the number of young people, and …", "num_citations": "1\n", "authors": ["711"]}